{"TopicId":54284,"ForumId":34,"TopicTitle":"[1.12] Extraplanetary Launchpads v6.99.3","CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-11-25T03:43:45Z","PageNum":63,"Articles":[{"CreatedByName":"Aedile","CreatedById":104353,"CreatedDateTime":"2014-09-03T17:15:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EFirst, why did you quote my whole and address only one point?\u003Cp\u003EAnd that tank mass is critical. The mass of a tank is \u003Cem\u003Edirectly\u003C/em\u003E proportional to the volume of its contents for the same pressure. Delta-V is all about Isp and mass ratio.\u003C/p\u003E\u003Cp\u003EYou very much \u003Cem\u003Ecan\u003C/em\u003E know. The jumbo-64 holds 6400u. It is a 7.5m long cylinder of 2.5m diameter. If you assume the internal shape is a hemisphere-capped 5m long cylinder with walls of ~12.4mm (ie, internal diameter of ~2.4752m)*, then the internal volume is 32m\u003Csup\u003E3\u003C/sup\u003E. That gives 200u/m\u003Csup\u003E3\u003C/sup\u003E, or 5L/u. All of the X200 tanks, and the FL-T tanks follow the same pattern. Note that the tank thickness scales too, though not quite linearly.\u003C/p\u003E\u003Cp\u003E* Yes, this omits the separator between LF and O. Just reduce the thickness of the walls (increase the internal diamter) by a small amount\u003C/p\u003E\u003Cp\u003EI can\u0027t explain the engines (I haven\u0027t looked into them), but the tanks are easy: they\u0027re made of iron (density of 7.8t/m\u003Csup\u003E3\u003C/sup\u003E, with ridiculously thick walls (10-13mm is way too much, even for aluminum)).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETank is critical. However you try to put realism in ksp, while keeping its unrealistic assumptions. \u003C/p\u003E\u003Cp\u003EYou make the assumption that hydrogen tank is same as rp1 tank, or ox tank. Yes if you make 14 times bigger tank it will be much heavier. Tank design is very complicated matter, namely picking the wall thickness. The tank needs to withstand its own weight, obviously. Then it needs to withstand the weight of it\u0027s contents, as well as the GForces, deformation forces etc. I suppose you can figure out that 1500m3 of LH2 weighing only 100ton would need a thinner wall than 1500m3 rp1 weighing 1500tons. Well if we need to go that deep, thin solid wall, and pretty thick insulation. You apply the RL logic for the size, but ignore the RL logic of the tanks and engines. Both real and mod fuels have concept of the internal tanks actually having weight, but at least MF which I use, keep the ridiculous weight of the external tank shell. Then as you probably know, the ratio (by mass) H2 engines use is not 45/55. \u003C/p\u003E\u003Cp\u003EAaand there is the assumption, that units have anything to do with volume to begin with. Look at space shuttle tank - (the super light one) - 1/4th of volume is LOX, 6/7 of the weight. 3/4th is LH2 1/6th of the weight. The only thing to imply volume, is the property being called density - but then again, EC has density too. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd yet you quoted my one and only mention of \u0022cheat\u0022 (where I used to word twice: once for stock). The part you missed was the density and thus the required tank size and thus tank mass. Stock tanks give a single stage a maximum (asymptotic) mass ratio of 9. The 1.3 factor between stock Isp vs realistic Isp for LF\u002BO means that for realistic Isp, you\u0027d need a mass ratio of ~17.4 (9\u003Csup\u003E1.3\u003C/sup\u003E) to get the same delta-v. I don\u0027t know at what pressure LHyd is stored (seems it may be 1 atmosphere, even, just very cold (20K)), but considering the need for insulation, getting a good mass ratio is challenging. Keeping things consistent, a mass ratio of 9 is unachievable (note: real tanks probably do get better than 9, but are not made of iron and certainly aren\u0027t 1cm thick).\u003C/p\u003E\u003Cp\u003EAs for the chemistry: Toss in carbon dioxide, or any other source of carbon, it matters not, and you can have your LiquidFuel with no quibbles from me (8H\u003Csub\u003E2\u003C/sub\u003EO \u002B 12CO\u003Csub\u003E2\u003C/sub\u003E \u002B mucho energy -\u0026gt; C\u003Csub\u003E12\u003C/sub\u003EH\u003Csub\u003E16\u003C/sub\u003E* \u002B 16O\u003Csub\u003E2\u003C/sub\u003E).\u003C/p\u003E\u003Cp\u003E* Stoichiometric formula for RP-1.\u003C/p\u003E\u003Cp\u003EI admit to never having played with KSPi. I\u0027ve considered it, but I was told about the LiquidFuel=LHyd issue and decided against it. If that has changed, then yay.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain, I\u0027m not debating LF being LH2, just the fact that there is no benefit that KSPI treats it as such when producing it. Compared with stock there is no difference whatsoever. You get absolutely same fuel as stock. Only 60% of the water is usable, and water tanks are just as heavy. So absolutely 0 sense of bringing water to space and produce fuel there. The reason why CO2 is not used, is because it\u0027s available only 4 places.\u003C/p\u003E\u003Cp\u003ECompared with kethane/karbonite - 60% of water useful, not every body has water. (only 4 actually have co2). You can actually scoop fuel from atmospheres which has it (which other than jool is almost nothing). \u003C/p\u003E\u003Cp\u003EIf we are talking about RL - like I said earlier - RL hydrolox tank 760 tons total, 26 tons empty. So well, lol\u003C/p\u003E\u003Cp\u003EFor some reason you insist that is cheaty, and the very same stock engines and tanks kspi uses should be 14 times bigger and heavier. I really don\u0027t follow the logic. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn case you haven\u0027t noticed, I\u0027ve been helping people do so. EL doesn\u0027t care where or how you get the RocketParts, just that you have them. The same goes for any other resource the craft may need.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know integration already exists. I know you are great guy, I\u0027m not disputing that. I\u0027m just pointing out a misconception. Relax\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt\u0027s called financial independence: having more passive income than your expenses, though EL isn\u0027t passive income.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can actually do that also on your launchpad or runway. So it\u0027s cheat. I don\u0027t do it, but I remember discussion of which is the most profitable part to produce..\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENow you\u0027re pulling my leg.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EFAR: other than less drag and more lift, FAR actually makes things more difficult.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKerbal Alarm Clock: what, something to help watch a bouncing time display is cheating? Also, set the alarm too close to the event and you miss it while responding. Set it too far from the event and you still sit there watching the clock. And then there are complex fleet operations: using KAC isn\u0027t cheating; not using KAC is... madness?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPrecise Node: oh, yeah, it\u0027s \u0022cheaty\u0022 being able to set a maneuver node that even MechJeb can\u0027t burn precisely.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKerbal Engineer: you still have to understand the information it gives you.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReal Chutes: Uh, yeah, riiiiiiiiiight. Open chute at 100m (Kerbin) with stock chutes, land safely. Do the same with Real Chutes, sayonara.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes I am. I\u0027m pointing out the subjectivity of \u0022cheaty\u0022, and I know you\u0027ll find purists claiming that. I consider all those essential, if they are not there, I\u0027ll refuse to play \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EFAR will shave 1km/s to kirbin orbit and around 3km/s at eve. Makes lots of things harder, but 1km/s. ferram4 released KIDS for reason (great mod, if you set isp to vary thrust rather than fuel consumption)\u003C/p\u003E\u003Cp\u003EAlarm clock - lets you manage interstellar empire, which in stock is nigh impossible. Also gives you transfer windows. \u003C/p\u003E\u003Cp\u003EPrecise node - lets you input numbers, making interplanetary transfers much easier. Also lets you increase the conics steps...\u003C/p\u003E\u003Cp\u003EKerbal engineer - helps you build really efficient craft. And not having that flight info is like driving a car blind.\u003C/p\u003E\u003Cp\u003EReal chutes - well I admit I havent used stock chutes after the joint fixes, but before that they loved to rip your stuff apart. Also the drogues and drags are just godsend. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EActually, the only reason asparagus is \u0022cheaty\u0022 is the infinite flow-rate of the fuel-lines. If flow rate issues could be overcome, NASA would be using asparagus staging. Actually, I seem to remember hearing about somebody (one of the private space companies?) experimenting with simple asparagus or maybe onion staging.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is not the only, it\u0027s one of them. There are may differences with RL, I was talking in sense of other configurations in ksp.\u003C/p\u003E\u003Cp\u003EKSP engines are heavy - you want that engine boosting, instead of playing dead weight, even if you use them under their isp.\u003C/p\u003E\u003Cp\u003EKSP tanks are heavy - you want to drop them as soon as possible.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-08T06:52:14Z\u0022 title=\u002209/08/2014 06:52  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 8, 2014\u003C/time\u003E by Aedile\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"archont","CreatedById":109034,"CreatedDateTime":"2014-09-03T21:42:03Z","Content":"\n\u003Cp\u003EI\u0027m having an issue with the smelter. When viewing the part in the VAB builder, it doesn\u0027t rotate like other parts. It \u003Cem\u003Escales\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/yQ4MqaG\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/yQ4MqaGl.jpg\u0022 alt=\u0022yQ4MqaGl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere you can see the part as it exploded out of my menu. The part attaches and otherwise works fine once dragged out of the part selection window, but mousing over it causes this kind of behavior.\u003C/p\u003E\u003Cp\u003EI have tons of mods but the smelters, all three of them, are the only parts to feature this weird behavior.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-09-04T09:29:39Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Earchont\u003C/strong\u003E: Yup, stock KSP bug. The simple fix is to install Kethane (or Karbonite and the patches for EL\u002BKarbonite). The problem is 3 or more resources and no modules on a part. The lack of a module is caused by KethaneConverter not being available.\u003C/p\u003E\n"},{"CreatedByName":"archont","CreatedById":109034,"CreatedDateTime":"2014-09-04T15:06:50Z","Content":"\n\u003Cp\u003EThanks taniwha, it\u0027s the first time I\u0027ve encountered it. I reinstalled Karbonite and then the Karbonite-EPL conversion pack, the smelters work fine now.\u003C/p\u003E\n"},{"CreatedByName":"janiekh","CreatedById":112618,"CreatedDateTime":"2014-09-04T15:38:21Z","Content":"\n\u003Cp\u003EIs there actually a way to just have a endless amount of rocket parts, so you don\u0027t have to mine or get parts to the base everytime?\u003C/p\u003E\n"},{"CreatedByName":"dzikakulka","CreatedById":116606,"CreatedDateTime":"2014-09-04T16:42:09Z","Content":"\n\u003Cp\u003EEdit rocket workshop cfg, multiply rocket parts output, delete input metal/anything requirement (in converter module). That\u0027s like one of thousand ways \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"janiekh","CreatedById":112618,"CreatedDateTime":"2014-09-04T16:59:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dzikakulka\u0022 data-cite=\u0022dzikakulka\u0022\u003E\u003Cdiv\u003EEdit rocket workshop cfg, multiply rocket parts output, delete input metal/anything requirement (in converter module). That\u0027s like one of thousand ways \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you, but how i do this?\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2014-09-04T17:08:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022janiekh\u0022 data-cite=\u0022janiekh\u0022\u003E\u003Cdiv\u003EThank you, but how i do this?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUse text editor to open the .cfg file. Its not terribly difficult.\u003C/p\u003E\n"},{"CreatedByName":"janiekh","CreatedById":112618,"CreatedDateTime":"2014-09-04T17:09:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EUse text editor to open the .cfg file. Its not terribly difficult.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut what do i change to what?\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2014-09-04T17:13:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022janiekh\u0022 data-cite=\u0022janiekh\u0022\u003E\u003Cdiv\u003EBut what do i change to what?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou were already told what to change. The config has a module which controls what resources are required for a conversion so if you delete the \u0027metal\u0027 input requirement you will get a conversion that just makes rocket parts for free.\u003C/p\u003E\n"},{"CreatedByName":"janiekh","CreatedById":112618,"CreatedDateTime":"2014-09-04T17:18:49Z","Content":"\n\u003Cp\u003EI\u0027m sorry, but i don\u0027t know what to do, this is what i can find, but then with more planets, or do i have the wrong file?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E//These densities work on the assumption that 1m^3 holds 200u of resource.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ERESOURCE_DEFINITION\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E{\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E name = RocketParts\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E density = 0.0025 // parts are very fluffy. 0.5t/m^3\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E unitCost = 5.0 // 2000/t\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E flowMode = ALL_VESSEL\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E transfer = PUMP\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E isTweakable = true\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E}\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ERESOURCE_DEFINITION\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E{\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E name = Metal\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E density = 0.039 // iron is 7.8t/m^3\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E unitCost = 71.2 // 800/t\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E flowMode = ALL_VESSEL\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E transfer = PUMP\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E isTweakable = true\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E}\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"dzikakulka","CreatedById":116606,"CreatedDateTime":"2014-09-04T17:26:47Z","Content":"\n\u003Cp\u003EYou want to change converter module (that\u0027s how original looks):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EMODULE {\u003Cbr\u003E        name = KethaneConverter\u003Cbr\u003E        Label = RocketParts\u003Cbr\u003E        InputRates {\u003Cbr\u003E            Metal = 0.5\u003Cbr\u003E            //FIXME kerbal hours would be much better, but they\u0027re not a\u003Cbr\u003E            // resource.\u003Cbr\u003E            ElectricCharge = 10\u003Cbr\u003E        }\u003Cbr\u003E        OutputRatios {\u003Cbr\u003E            // I\u0027ve seen as bad as 0.35 and better than 0.95. This seems like\u003Cbr\u003E            // a good compromise\u003Cbr\u003E            RocketParts = 0.7\u003Cbr\u003E            // Tiny scraps escape.\u003Cbr\u003E            ScrapMetal* = 0.2995\u003Cbr\u003E        }\u003Cbr\u003E    }\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m not super familiar with that particular module but you\u0027ll figure it out - maybe deleting whole InputRates with latter brackets will work, maybe simple make 0.5 and 10 in there zero and give it a try. And multiply that 0.7 in OutputRatios so you produce as fast as you use them. Remember that you have to use the part you\u0027ve edited and you still have to activate \u0022converter\u0022.\u003C/p\u003E\u003Cp\u003EAnd you should learn a little on how KSP handles parts, configs are easy to understand and give you amazing tweaking/modding possibilities even if you can\u0027t program/model/do anything related at all.\u003C/p\u003E\n"},{"CreatedByName":"janiekh","CreatedById":112618,"CreatedDateTime":"2014-09-04T17:28:49Z","Content":"\n\u003Cp\u003ENvm guys, i\u0027ve already found the right file,sorry, and thanks for the help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-04T17:32:11Z\u0022 title=\u002209/04/2014 05:32  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 4, 2014\u003C/time\u003E by janiekh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2014-09-04T17:32:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022janiekh\u0022 data-cite=\u0022janiekh\u0022\u003E\u003Cdiv\u003ENvm guys, i\u0027ve already found the right file,sorry, and thanks for the help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGlad you found it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E If you test it out and get a working config, consider sharing it in case others here are interested.\u003C/p\u003E\n"},{"CreatedByName":"janiekh","CreatedById":112618,"CreatedDateTime":"2014-09-04T17:36:16Z","Content":"\n\u003Cp\u003EGood idea, if i\u0027ve tested it, and it works, i\u0027ll paste it here (how do i get it into \u0027code\u0027 like you did with the previous comment?)\u003C/p\u003E\u003Cp\u003EEDIT: Thanks forsaken1111, and it won\u0027t be here today, the item didn\u0027t load (at the starting of the game when all items get loaded), so i\u0027ll do it some other time :\\\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-04T17:51:53Z\u0022 title=\u002209/04/2014 05:51  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 4, 2014\u003C/time\u003E by janiekh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2014-09-04T17:37:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022janiekh\u0022 data-cite=\u0022janiekh\u0022\u003E\u003Cdiv\u003EGood idea, if i\u0027ve tested it, and it works, i\u0027ll paste it here (how do i get it into \u0027code\u0027 like you did with the previous comment?)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPush \u0022Reply with Quote\u0022 on his post to see the tag. It is \u003C/p\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E and then [/code.] (without the period)\u003C/pre\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2014-09-04T18:32:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starstrider42\u0022 data-cite=\u0022Starstrider42\u0022\u003E\u003Cdiv\u003EPut your smart kerbals where they will do the most good (e.g. the workshop) and your stupid kerbals where they will do the least harm (e.g. command pods).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol, you just described my workplace to perfection.\u003C/p\u003E\n"},{"CreatedByName":"elementalfx","CreatedById":79515,"CreatedDateTime":"2014-09-08T22:29:31Z","Content":"\n\u003Cp\u003EHello guys I just installed this Mod but every time I start the game and hit OK to confirm progressive building it puts me to Mission control and then it crashes. I have no idea whats wrong. I am using latest KSP version on Steam.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-09-09T10:36:20Z","Content":"\n\u003Cp\u003EThe game going into mission control is due to the click passing through the window and getting MC as well as the button.\u003C/p\u003E\u003Cp\u003EThe crash is something else entirely and I cannot do anything without your output_log.txt.l\u003C/p\u003E\n"},{"CreatedByName":"elementalfx","CreatedById":79515,"CreatedDateTime":"2014-09-10T10:24:00Z","Content":"\n\u003Cp\u003EYep thanks for help. I found out its because of what you said. And crash problem was solved. It was other interfering mod that caused all the problems.\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2014-09-10T12:47:31Z","Content":"\n\u003Cp\u003Eis it possible to use any old part as a launch pad assuming you set up the config file correctly or does it have to be something that is set up in unity like thrust transforms is for engines?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-09-10T13:09:01Z","Content":"\n\u003Cp\u003EFirst, I don\u0027ty use Unity \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E but that\u0027s actually irrelevant.\u003C/p\u003E\u003Cp\u003EYes, any old part will work (I used a dockotron sr for orbital construction development), but there is one problem: unless there is a special transform (check the orbital dock config for details), the default position at which a vessel will be placed is the origin of the part (usually its center of mass). However, that\u0027s what SpawnHeightOffset is for: shifting the position to just outside the part (the \u003Cem\u003Ebase\u003C/em\u003E of the vessel will be placed there). Check the config file for launchpad2.\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2014-09-10T13:45:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EFirst, I don\u0027ty use Unity \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E but that\u0027s actually irrelevant.\u003Cp\u003EYes, any old part will work (I used a dockotron sr for orbital construction development), but there is one problem: unless there is a special transform (check the orbital dock config for details), the default position at which a vessel will be placed is the origin of the part (usually its center of mass). However, that\u0027s what SpawnHeightOffset is for: shifting the position to just outside the part (the \u003Cem\u003Ebase\u003C/em\u003E of the vessel will be placed there). Check the config file for launchpad2.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for the response I\u0027ve been debating putting this on my latest save cause I wasn\u0027t keen on the launch pad models this nugget of knowledge should help change that. Is there a way to limit the size of craft that a launch pad can spawn? say if I wanted to use an ISX space dock, or a hanger mod hangar and I didn\u0027t want everything to explode if I accidentally made a craft that was too wide.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-09-10T14:17:19Z","Content":"\n\u003Cp\u003ENo, there\u0027s no way to limit craft size. EL doesn\u0027t do any size checks at all, just mass, and that\u0027s for build times and resource costs. That said, the feature I\u0027m currently working on will need size checks to figure out placement, so such may be possible in the future.\u003C/p\u003E\u003Cp\u003EIn the meantime, read \u0022The Dog Who Wouldn\u0027t Be\u0022 by Farley Mowat, particularly chapter 10, \u0022The Cruise of the Coot\u0022. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kiel Eire","CreatedById":120305,"CreatedDateTime":"2014-09-10T23:51:55Z","Content":"\n\u003Cp\u003EIs there a way to enable resource use after primarily disabling it? I\u0027ve tried uninstalling, launching, then re-installing to no avail. Any config file I can edit?\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"}]}