{"TopicId":54284,"ForumId":34,"TopicTitle":"[1.12] Extraplanetary Launchpads v6.99.3","CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-11-25T03:43:45Z","PageNum":125,"Articles":[{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-08-17T22:42:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003ENo time for a proper response now, but I have never liked the single resource path (ie, [*]ore-\u0026gt;metal-\u0026gt;rocketparts). I have never liked even RocketParts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf that changes, I\u0027ll be happy to adjust all of my mods to follow suit, which would be awesome for interop (and pretty much everyone wins).\u003C/p\u003E\u003Cp\u003EIf you\u0027d like to collaborate, just let me know.\u003C/p\u003E\u003Cp\u003EMy preference would of course for there to be at least three distinct things to harvest, but three or twenty, I\u0027d be on board since I prefer breadth (and found that depth was the best bit to trim).\u003C/p\u003E\u003Cp\u003ESo something like:\u003C/p\u003E\u003Cp\u003EA=A1\u003C/p\u003E\u003Cp\u003EB=B2\u003C/p\u003E\u003Cp\u003EC=C2\u003C/p\u003E\u003Cp\u003ED=D2\u003C/p\u003E\u003Cp\u003E(where A = what you drill, and A1 = what it gets refined into)\u003C/p\u003E\u003Cp\u003EA1\u002BB1 = Tanks\u003C/p\u003E\u003Cp\u003EB1\u002BD1= Science Parts \u0026lt;= Tier 8\u003C/p\u003E\u003Cp\u003EC1\u002BD1 = Science Parts \u0026gt; Tier 8\u003C/p\u003E\u003Cp\u003EA1\u002BB1\u002BC1 = Utility Parts\u003C/p\u003E\u003Cp\u003Eetc.\u003C/p\u003E\u003Cp\u003EBut you get the idea.\u003C/p\u003E\n"},{"CreatedByName":"vivenvex","CreatedById":149130,"CreatedDateTime":"2015-08-18T02:56:29Z","Content":"\n\u003Cp\u003ESadly, still no luck getting this to work. Core of the problem seems to be EPL not showing up on any of my toolbars. Also when clicking the pad no option to show GUI. Got to the point where I had a Mag-lev steady drilling/reprocessing/rocketpart producing factory on Minmus and xfered the rocketparts to the pad *which was then full of parts*. But alas, when right clicking no option to actually build.\u003C/p\u003E\u003Cp\u003EThe base has since been returned to kerbin leaving behind a cargo container drone and the launchpad, sitting lonely in the highlands full of rocketparts.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-08-18T09:36:35Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Evivenvex\u003C/strong\u003E: Do you get a build-info window in the VAB/SPH? (it should come up by default, needs blizzy\u0027s toolbar, or .sfs hacking, to get rid of it). Do you get a settings window for EL\u0027s KAC integration in a new game? (might need KAC installed for that)\u003C/p\u003E\u003Cp\u003EIf not, then something went wrong with the installation. Your best bet is to get me your logs.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-08-18T12:18:56Z","Content":"\n\u003Cp\u003EOk, I\u0027ve got time for a proper response \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Though I\u0027m not sure how coherent or informative it is.\u003C/p\u003E\u003Cp\u003EI\u0027m considering keeping an \u0022easy mode\u0022 for EL that keeps [MetalOre/ScrapMetal]-\u0026gt;Metal-\u0026gt;RocketParts (with recycling going to ScrapMetal instead of Metal), but with the addition of requiring Ore (or Kethane if installed) to process MetalOre into Metal (to provide the carbon and/or hydrogen used to reduce the MetalOre to Metal). Thanks to recipes, I might add Plastics to mix for making parts (dunno).\u003C/p\u003E\u003Cp\u003ENow for the more interesting stuff, though there\u0027s one important thing to point out: while possibly not easy, EL\u0027s recipes allow any level of detail and abstraction.\u003C/p\u003E\u003Cp\u003EAlso note that I have yet to actually look at CRP and MKS, so what I say might already be there for the most part.\u003C/p\u003E\u003Cp\u003EThe raw stuff in the \u0022ground\u0022 is tricky (KSP\u0027s resource system shows its weaknesses here) because it is difficult to store various mixes of dug up stuff in the one tank. Using a Landis Fluorine refinery (my name), where you mine should govern the ratios of stuff in your \u0022dirt\u0022 and thus the ratios you get out of the refinery, but one should be able to ship the raw \u0022dirt\u0022.\u003C/p\u003E\u003Cp\u003ESomething I have wanted for a while for a nicely abstract \u0022hard\u0022 (medium?) mode for EL (though one problem is it may require a complete re-balancing of KSP\u0027s part masses, or maybe a part module to set the part properties based on what was used to make the part):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EHighTempMetals: good impact tolerance, strong, high maximum temperature, heavy (iron, tungsten, etc).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECeramics: poor impact tolerance, strong, high maximum temperature, light.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELowTempMetals: good impact tolerance, strong, low to medium maximum temperatures, light (aluminum, titanium).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPlastics: modest impact tolerance, weak, usually low maximum temperature, very light.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERadioactives: LV-N, nuff said \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EA mix of Plastics and LowTempMetals might be good for SolidFuel, Plastics and ? for Ablator (these two resources are actually one of the biggest things that makes RocketParts a poor abstraction).\u003C/p\u003E\u003Cp\u003EAnd then, I\u0027d like to make a much less abstract system.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-08-18T12:36:02Z","Content":"\n\u003Cp\u003Ehm, one challenging bit I see there is that the \u0027dirt\u0027 concept is a fairly heavy change, and your larger issue is that you can\u0027t mix \u0027dirt\u0027 from two different locations if the dirt has to be location aware. tbh I don\u0027t think there\u0027s a lot of mileage from that particular abstraction (and not sure why someone would move dirt around instead of just processing it and getting rid of the waste as soon as possible).\u003C/p\u003E\u003Cp\u003ENow what you *could* do is add a \u0027dirt\u0027 resource, and don\u0027t add drills for the several other resources (the stuff you get out of the dirt). And then just have a custom part module drill the \u0027dirt\u0027 but reconstitute it based on the local abundance (totally doable in stock) similar to how asteroids work. \u003C/p\u003E\u003Cp\u003EEither way, those bits would not affect interop - it\u0027s more about adding a second mining mod that, in the end, gets you to the ceramics, plastics, etc.\u003C/p\u003E\u003Cp\u003EOn that front, I think messing with part masses would be a bad idea (and one that should be unecessary).\u003C/p\u003E\u003Cp\u003EOne option, and one that me and ObiVanDamme are looking at for both OSE Workshop and the existing UKS, is a combination of resources via MM that handles the exploitable cost differential, so you have MaterialKits (cheap, heavy) and SpecializedParts (expensive, light) as a mix to make sure you can\u0027t start a money printer.\u003C/p\u003E\u003Cp\u003EExtend this a bit and I expect you could do a default formula for all parts based on category and tech level and slap it in via MM, so you would have a different mix for engines vs. advanced solar panels, with an expensive (fluffy) resource in there to handle the cost component. \u003C/p\u003E\u003Cp\u003EI\u0027ll need to check - but can you have (with recipes) input mass exceed output mass? i.e. can it be lossy? That opens some options too.\u003C/p\u003E\u003Cp\u003EI think a good (short term) starting point would be to at least agree on the initial raw materials list (ceramics, hightempmetals, radioactives, etc.) and what they are harvested from (substrate, metallicore, etc. - or what you call them when they come out of \u0027dirt\u0027 if you go that route).\u003C/p\u003E\u003Cp\u003EBy separating out harvesting mechanics from the materials and resources themselves, we can at least get past having a ton of incompatible storage tanks and massive resource lists with duplicates lying around.\u003C/p\u003E\n"},{"CreatedByName":"GokouZWAR","CreatedById":142307,"CreatedDateTime":"2015-08-23T00:40:05Z","Content":"\n\u003Cp\u003EPlease don\u0027t let this get too complicated. Its not THAT easy to build ships in career mode...\u003C/p\u003E\u003Cp\u003EI haven\u0027t really read over what you guys are planning, but if you\u0027re planning on making it so that if I want to build a ship with 20 verners on it, 3 fuel tanks, a specific engine and then I have to have all those parts stored somewhere and then EL constructs the ship, that might be interesting to do. \u003C/p\u003E\u003Cp\u003EIf you\u0027re just talking about adding more minerals to mine to get to rocket parts, all you\u0027re going to do is make the build more tedious rather that difficult. Having to store 5 separate materials to be processed into 2 or 3 types of materials to be processed then into rocket parts designed for specific stuff, no. That sounds way to much of a stupid grind and there\u0027s no real benefit or addition of the game to warrant upgrading to the latest versions. I\u0027ve tried to use the USI method to build rocket parts and its just stupidly bloated in my book when I can get an auger and just get metal ore and smelt it into metal and convert it to rocket parts, its not THAT easy. I still have to fuel the ship and provide basic resources post-build too and even that is very limited in career mode.\u003C/p\u003E\u003Cp\u003EYou guys forget that not everyone plays in sandbox mode...money is always a factor. If its too easy for you in sandbox mode, try doing it in career mode. A huge refueler tanker is pretty expensive to ship up to space and its not that easy to get tons of fuel out of the ground. Especially since the stock ore drill is so far down the research tree getting fuel from the ground isn\u0027t THAT easy. You have to research it and you need like $1.6m to upgrade the research lab to be able to get it, nevermind the science required. Its pretty hard and by then you\u0027ve definitely earned the ability to mine ore and convert it to fuel with the stock stuff. Even with karbonite installed, I had a ship mining karbonite on minmus for over 250 days to get 11k worth of liquid fuel and the equivalent oxidizer. Its easier to just get the money and build a refueler tanker on the ground on kerbin and shoot it into space rather than mine your own fuel up. \u003C/p\u003E\u003Cp\u003EJust be sure you guys are considering all angles on this. It is easy in sandbox mode, but keep in mind that sandbox mode is where you test stuff out. If you\u0027re playing in sandbox mode you\u0027re not really \u0022playing\u0022 the game. You\u0027re in creative mode. IMO sandbox mode should have a way to just refuel your ships to full with a single button click so you can test stuff not be the end-all-be-all method to play the game. Its supposed to help you get used to the parts and test out builds so you can build stuff in career mode that works well.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-08-23T04:45:07Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EGokouZWAR\u003C/strong\u003E: I haven\u0027t \u003Cem\u003Ereally\u003C/em\u003E played in sandbox mode since career mode came out (despite my gripes about career mode). Sure, I have messed around in it since, but all my long-term saves have been career mode (I\u0027m not sure I\u0027ve ever started a science mode save, unless you count the interval between career mode coming out and contracts). My understanding is that RoverDude plays mostly in career mode too, but it does seem that ObiVanDamme (OSE Workshop) has been playing mostly in sandbox mode as he has had to address various career mode issues recently.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMy\u003C/em\u003E goal in this situation is to create a system that the three of us (RoverDude, ObiVanDamme and myself) can agree on, but 1) does not hinder operations that are completely independent of KSC, 2) is believable on an abstract level (RocketParts fails at this, thus recipes), 3) is interesting enough to the player than any grind does not seem tedious, and 4) allows the player to make a profit from production. A part of my efforts in this has come to be helping ObiVanDamme interface with EL so he can use recipes in OSE Workshop when both are installed (just in case that reads wrong, I am very happy to help him).\u003C/p\u003E\u003Cp\u003EWhile I have talked about a hard mode, I am not interested in making things difficult or tedious, the \u0022hard\u0022 is for lack of a better term. Instead, I want to to make things \u003Cem\u003Einteresting\u003C/em\u003E, and so long as things are interesting enough, grind (in moderation!) is not tedious. One of the best ways to make things interesting is to make choice important: do I use my LiquidFuel and Oxidizer to power my rockets, or to smelt MetalOre into Metal\u003Csup\u003E*\u003C/sup\u003E, do I use my supply of LightMetal to make more structural parts, or (mixed with Oxides) to make SolidFuel, or I can use Oxides to make Ceramics... In other words, few, if any, single-use resources.\u003C/p\u003E\u003Cp\u003EThis is the problem with EL\u0027s current resource system: MetalOre is used only to make Metal, Metal is used only to make RocketParts, RocketParts is used only to make, well, actual parts (and ScrapMetal). The only choice is whether to convert the ScrapMetal back to Metal (requiring a smelter on-site). Worse, recycling goes to Metal instead of ScrapMetal, making ScrapMetal have even less meaning.\u003C/p\u003E\u003Cp\u003E\u003Csup\u003E*\u003C/sup\u003EI am planning on changing the smelter (or adding a lower-tech version) that consumes LF\u002BO (in a different ratio than the 9:11 of rocket engines) to produce the heat and CO required to smelt the ore into metal, but also produce a fair bit of ElectricCharge. A separate low-tech furnace for melting ScrapMetal into Metal (again LF\u002BO, but in a different ratio to get optimal heating). Then I\u0027d add a high-tech electric furnace (consuming a lot more EC than can be produced by the LFO furnace) but that would be good for either MetalOre or ScrapMetal. The LFO furnace would be available a bit earlier than it is now, and the electric furnace maybe a little later (I have never been happy with EL\u0027s tech-tree integration).\u003C/p\u003E\u003Cp\u003E(\u003Cstrong\u003ERoverDude\u003C/strong\u003E too)\u003C/p\u003E\u003Cp\u003EUsing something similar to the process described in \u003Ca href=\u0022http://taniwha.org/~bill/Landis.pdf\u0022 rel=\u0022external nofollow\u0022\u003ELandis\u0027s paper\u003C/a\u003E, I would like there to be a small number of mine-able resources (regolith, dirt (organic rich regolith), maybe a couple more) with various concentrations of useful resources (LightMetals, HeavyMetals, RadioActives, Oxides, Carbon, Silicon...) that are are then used in various combinations to produce things like Alloys, HighTempAlloys, Ceramics, Plastics, Electronics (signal/logic), Electricals (power), Hydraulics etc that are used in different ratios for parts.\u003C/p\u003E\u003Cp\u003EHowever, I do not want it to be tedious. Rather, I want it so you start out being dependent on KSC (sending out high-level materials for building until you can start producing them yourself on-site) but you can work your way to being fully independent \u0027(eg, you wouldn\u0027t want to have to ship stuff out to Laythe, or worse, some of the more distant planets in the various planet mods). Also, you have the option of mining and recovering resources in various stages of production to gain some extra funds, or taking lower-level resources from KSC and processing them into higher-level resources or even actual parts for a profit. The idea is to give more ways to play.\u003C/p\u003E\u003Cp\u003EI really need to go through EL\u0027s parts and give them better tech tree placement (mostly earlier!) and various upgrades for higher nodes. Eg, larger, less efficient parts early on, with upgrades reducing size and increasing efficiency.\u003C/p\u003E\n"},{"CreatedByName":"Jagzeplin","CreatedById":117054,"CreatedDateTime":"2015-08-23T16:05:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GokouZWAR\u0022 data-cite=\u0022GokouZWAR\u0022\u003E\u003Cdiv\u003Elotta words...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to disagree here. I only play Career mode and while I concur that the ore drill should be a bit easier to access I do not agree with having a single resource chain to rocket parts as this is not only incredibly unrealistic but enables the \u0022money printer\u0022 strategy way too easily IMHO. I get that KSP noobs will consider setting up such a system challenge enough but KSP has always had a learning curve and I for one prefer realism over \u0022gameyness\u0022.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-08-23T16:12:52Z","Content":"\n\u003Cp\u003E@Taniwha - so how do you propose handling the issue of the localized nature of \u0027dirt\u0027 - Assuming you want location-specific abundances in a mixable resource - without killing the save file with persistence data?\u003C/p\u003E\n"},{"CreatedByName":"WRXminion","CreatedById":150119,"CreatedDateTime":"2015-08-23T18:51:54Z","Content":"\n\u003Cp\u003EHello RoverDude! Thanks for the awesome mod! \u003C/p\u003E\u003Cp\u003EI\u0027m reporting exploding survey stakes. I saw mention of this in a previous post but did not see a solution. It has put a hold on my mining program. Is there a solution to this?\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-08-23T21:47:06Z","Content":"\n\u003Cp\u003ENot my mod \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E But I am sure Taniwha can answer your issue on survey stakes\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-08-23T22:04:05Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EWRXminion\u003C/strong\u003E: make sure you have the latest KIS, and then make sure you actually attach the stakes to the ground (not just drop them). I believe the latests versions of EL and KIS require you to use the mallet with the stakes. I have never had an attached stake explode, but ones that were just dropped eventually fell over and exploded.\u003C/p\u003E\n"},{"CreatedByName":"WRXminion","CreatedById":150119,"CreatedDateTime":"2015-08-24T00:34:48Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Etaniwha\u003C/strong\u003E : Thanks! Yup, was not attaching them properly.... working now. how do I put an item I\u0027ve detached, or grabbed into a kerbals inventory? \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERoverDude\u003C/strong\u003E : Oooops \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WRXminion","CreatedById":150119,"CreatedDateTime":"2015-08-24T00:39:48Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Etaniwha: \u003C/strong\u003EI found the manual... figured it out. Thanks for the awesome mods!\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-08-24T10:47:38Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Etaniwha: \u003C/strong\u003Emost of my plays are in science mode. That is the reasone why I need to address all that career issues at the moment. I already started my work on a system that fulfills all four requirements you had, as those where my concern as well. In the end I restored my recipe code I had some releases ago, which is basically a less powerfull implementation of your part recipe. It does not have module recipes or resource recipes. The problem I have is, that I do not want to implement my own recipe feature and switch to El when it is available. Do you think it would be possible to somehow make the recipe bits available separately, so that I can use the same implementation but with my own processor. In the end the thing that I am interested is the cost report, that says how much of each resource is required. If we could share the path to this point the integration would be seamless I think.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-08-24T11:07:56Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EObiVanDamme\u003C/strong\u003E: That is a good idea. I just need to figure out how to do it without creating a mess (I don\u0027t want a repeat of KSPAPIExt). All the relevant code is entirely mine, so that won\u0027t get in the way.\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-08-24T11:27:25Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Etaniwha: \u003C/strong\u003EI saw, that you do not use a PartModule for your recipe, but load the recipe configs in a central database. I really like that approach and already thought about implementing the same thing with the same config syntax. In that case I would not need to change anything in my code, but EL recipes would just work if they are present. The problem is, that in this case the code will be duplicated and needs maintenance in the form, that I need to make the same changes and fixes as you. It should be no problem in regards to licensing if I understand the GNU license correct, right? It would be better if I could reuse the recipe system just like I can use the \u0022core\u0022 features of fire spitter if I just want to have the fuel switcher, but not the complete package with all the parts. If it is ok for you I would re-implement the recipe database and the recipe system and redistribute it in a separate dll under your license, until you managed to extract it, ok?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-08-24T12:00:42Z","Content":"\n\u003Cp\u003EI believe I am able to put the recipe code under a different license (should I need to) as it is entirely mine and it is EL that depends on the recipe code and not the other way round. My problem is the technical side: dll linked directly? dll accessed via reflection (with a handy wrapper supplied)? .cs files to include in a project? I suspect the reflection method may be best as it allows easy updating of the module for bug fixes and backwards-compatible enhancements.\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-08-24T12:23:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EI believe I am able to put the recipe code under a different license (should I need to) as it is entirely mine and it is EL that depends on the recipe code and not the other way round. My problem is the technical side: dll linked directly? dll accessed via reflection (with a handy wrapper supplied)? .cs files to include in a project? I suspect the reflection method may be best as it allows easy updating of the module for bug fixes and backwards-compatible enhancements.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei agree with that. i will reimplement your code on my side and make the classes i use wrappers around your package when you are done. with this way i can start to switch my processors over to el recipes asap.\u003C/p\u003E\n"},{"CreatedByName":"Eskandare","CreatedById":62742,"CreatedDateTime":"2015-08-24T21:52:46Z","Content":"\n\u003Cp\u003Etaniwha, where is the config for the survey station? I want to create an alternate texture so that I don\u0027t confuse the survey station for the hitchhiker module. It\u0027ll basically be the same texture map but black/dark grey with yellow warning stripes.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-08-25T09:17:39Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EEskandare\u003C/strong\u003E: the survey stationi is an MM clone of the hitchhiker can. You will find the config in ExtraplanetaryLaunchpads/EL_MM.cfg, should be around line 32.\u003C/p\u003E\n"},{"CreatedByName":"TauPhraim","CreatedById":146808,"CreatedDateTime":"2015-08-25T18:35:09Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI think I might have a bug. I\u0027m trying to build something on a slope on Minmus. I\u0027m not sure I understand everything \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59545?p=1692681\u0026amp;viewfull=1#post1692681\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E but I have more or less given up on orienting the ship parallel to the terrain, as impossible.\u003C/p\u003E\u003Cp\u003EHowever, I cannot spawn it inclined either, because part of the ship spawns into the ground (and it is sent flying away).\u003C/p\u003E\u003Cp\u003EPictures \u003Ca href=\u0022http://imgur.com/a/3bpex\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E (stakes are: origin, \u002Bx, \u002Bz).\u003C/p\u003E\u003Cp\u003EKSP logs for spawn time \u003Ca href=\u0022http://pastebin.com/FeQ177A1\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThanks in advance for any help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECheers !\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-08-25T18:54:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TauPhraim\u0022 data-cite=\u0022TauPhraim\u0022\u003E\u003Cdiv\u003EHi,\u003Cp\u003EI think I might have a bug. I\u0027m trying to build something on a slope on Minmus. I\u0027m not sure I understand everything \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59545?p=1692681\u0026amp;viewfull=1#post1692681\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E but I have more or less given up on orienting the ship parallel to the terrain, as impossible.\u003C/p\u003E\u003Cp\u003EHowever, I cannot spawn it inclined either, because part of the ship spawns into the ground (and it is sent flying away).\u003C/p\u003E\u003Cp\u003EPictures \u003Ca href=\u0022http://imgur.com/a/3bpex\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E (stakes are: origin, \u002Bx, \u002Bz).\u003C/p\u003E\u003Cp\u003EKSP logs for spawn time \u003Ca href=\u0022http://pastebin.com/FeQ177A1\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThanks in advance for any help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECheers !\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs the second pic the ship you\u0027re trying to spawn? Maybe try a bigger rectangle? Personally, I\u0027d just avoid steep slopes like that and build on ground that is as flat as possible. Using clamps is probably advised as well.\u003C/p\u003E\n"},{"CreatedByName":"TauPhraim","CreatedById":146808,"CreatedDateTime":"2015-08-25T19:28:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smjjames\u0022 data-cite=\u0022smjjames\u0022\u003E\u003Cdiv\u003EIs the second pic the ship you\u0027re trying to spawn? Maybe try a bigger rectangle? Personally, I\u0027d just avoid steep slopes like that and build on ground that is as flat as possible. Using clamps is probably advised as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just clicked on \u0022Finalize\u0022. I tried a bigger rectangle just after that, with the same effect.\u003C/p\u003E\u003Cp\u003EThe slope does not look that steep to me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow would I go about using clamps ?\u003C/p\u003E\n"},{"CreatedByName":"Tarheel1999","CreatedById":123965,"CreatedDateTime":"2015-08-25T19:31:39Z","Content":"\n\u003Cp\u003EIf you attach launch clamps to your ship they will be part of the build. Might help, might not.\u003C/p\u003E\n"}]}