{"TopicId":54284,"ForumId":34,"TopicTitle":"[1.12] Extraplanetary Launchpads v6.99.3","CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-11-25T03:43:45Z","PageNum":27,"Articles":[{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-03-07T00:48:54Z","Content":"\n\u003Cp\u003EActually, one of my plans was to create a \u0022grabbable parts\u0022 spawner, but I like your idea of just adding another menu. However, either way, it\u0027s going to be a pain to implement the GUI :/\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-03-07T01:13:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Neowulf\u0022 data-cite=\u0022Neowulf\u0022\u003E\u003Cdiv\u003EI was thinking a special KAS container that had a way to spawn/recycle grabbable/storable parts in its inventory. A parts bin.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOooh I like that. Open the bin with your EVA\u0027d Kerbal and just build the part right there. Doesn\u0027t even need to store anything, really. Just spawn the part on his back. Of course, he can\u0027t build any part if he\u0027s already carrying something.\u003C/p\u003E\u003Cp\u003EMaybe a little workbench instead of a container? Or adopt that 3d printer in the mod officially and convert the current rocketparts bench into this new function.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-03-07T17:00:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022curiousepic\u0022 data-cite=\u0022curiousepic\u0022\u003E\u003Cdiv\u003EApologies if this has been answered before, but is there a way to restrict which parts can be built by a 3D printer or used in a craft built on-site?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you mean Bahamuto\u0027s 3D printer then the answer is simply no. It doesn\u0027t actually \u0027print\u0027 anything. It just converts the resource \u003Cem\u003Emetal\u003C/em\u003E into the resource \u003Cem\u003Erocketparts\u003C/em\u003E. Those rocketparts are what you consume to build ships.\u003C/p\u003E\u003Cp\u003EThe actual building of the ship is exactly the same as it is when launching from KSC. If you want to limit the use of certain parts then simply don\u0027t use them in the VAB/SPH.\u003C/p\u003E\n"},{"CreatedByName":"docfish","CreatedById":83007,"CreatedDateTime":"2014-03-08T06:23:38Z","Content":"\n\u003Cp\u003EAnd here I go again, so right clicking and activating totally worked... the first time. I gobbled up a craft and got 850 metal out of it. Then I realized the design was flawed and sent up a different ship recycler ship. It gobbled up the first one leaving a total of .... 850 metal? So I got nothing for the craft itself. So I sent up other things, it is gobbling them up quite handily, but no matter if I save \u0026amp; exit, reload whatever, the only way I\u0027ve gotten any more metal (even for a 50t craft with little fuel weight) is by accidentally recycling 2 kerbals which hitched a ride and I forgot to transfer before recycling. I\u0027ve tried deactivating \u0026amp; reactivating, basically everthing I can think of. I even paused mid-writing this to launch a 3rd recycler \u0026amp; target for recycling. Still the same results, craft vanishes but I didn\u0027t get drop of fuel from the half full boost stage I mulched up. Any ideas what I\u0027m doing wrong now? The fact that it\u0027s vanishing but not giving me anything is really confusing.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-03-08T08:52:20Z","Content":"\n\u003Cp\u003EThat is because you get RocketParts, not Metal, for recycling ships (this is a mistake that will be corrected in the next version). As for not getting a drop of full: were your tanks already full?\u003C/p\u003E\u003Cp\u003EIf you check your log file, you should \u0022[EL] \u0026lt;vessel\u0026gt;-\u0026lt;resource\u0026gt;: \u0026lt;amount\u0026gt; taken \u0026lt;amount\u0026gt; reclaimed, \u0026lt;amount\u0026gt; lost\u0022. If the amount reclaimed is not the same as the amount taken (and thus the amount lost is non-zero), then there was insufficient space to put the resource.\u003C/p\u003E\n"},{"CreatedByName":"mockingking","CreatedById":6738,"CreatedDateTime":"2014-03-08T10:29:42Z","Content":"\n\u003Cp\u003EI sent up an orbital construction module with a full container of rocket parts, then docked another container and started building ships in orbit.\u003C/p\u003E\u003Cp\u003EThing is, the rocket parts never deplete. Is this intentional?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-03-08T12:12:01Z","Content":"\n\u003Cp\u003EIf you do not have Kethane installed, then yes, it is intentional. However, the next version allows you to force resource usage even without kethane.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-03-08T18:08:36Z","Content":"\n\u003Cp\u003EIt looks like EPL has problems building reaction wheels in orbit. Over and over again (with different designs) reaction wheels are misaligned after building a craft in orbit.\u003C/p\u003E\u003Cp\u003ENot that the reaction wheels don\u0027t work, the craft does work properly. But the reaction wheels and adjacent parts get shifted out of place.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://tex.texel.com/ksp023/screenshot10.2.png\u0022 alt=\u0022screenshot10.2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe central KW tank should be nice and flush with the conical tank. In this case only the central KW tank is misplaced ,the reaction wheels are actually in the correct position, as is everything else. It always happens near or at the reaction wheels and most of the time the wheels are wonky too.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EEdit:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EI did some additional testing and it might not be related to reaction wheels. It\u0027s the root parts that gets misaligned.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EOn other designs the reaction wheel was the root part and on the picture it is the KW tank. The reaction wheels just happened to be in the same place.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-08T18:34:01Z\u0022 title=\u002203/08/2014 06:34  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 8, 2014\u003C/time\u003E by Tex_NL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-03-08T23:04:15Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ETex_NL\u003C/strong\u003E: That is a known bug and has been fixed for the next version which will be out soon. \u003Ca href=\u0022https://github.com/taniwha-qf/Extraplanetary-Launchpads/issues/3\u0022 rel=\u0022external nofollow\u0022\u003Emore details\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-08T23:08:40Z\u0022 title=\u002203/08/2014 11:08  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 8, 2014\u003C/time\u003E by taniwha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darkfrei","CreatedById":84530,"CreatedDateTime":"2014-03-08T23:19:49Z","Content":"\n\u003Cp\u003ECan you build a hextank twice bigger?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BoPHtAE.png\u0022 alt=\u0022BoPHtAE.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-03-08T23:51:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003ETex_NL\u003C/strong\u003E: That is a known bug and has been fixed for the next version which will be out soon. \u003Ca href=\u0022https://github.com/taniwha-qf/Extraplanetary-Launchpads/issues/3\u0022 rel=\u0022external nofollow\u0022\u003Emore details\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the info. Good to see it will be fixed.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-03-09T10:39:27Z","Content":"\n\u003Cp\u003EI have released v4.0 of Extraplanetary Launchpads (as always, GPL). Download details are in the first post.\u003C/p\u003E\u003Cp\u003E4.0 brings a major change to EL\u0027s gameplay: progressive builds. This means two things:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EYou do not need to have 400000u of rocket parts on hand to build a 1000t rocket.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt takes some time to build a rocket. However, you \u003Cem\u003Edo\u003C/em\u003E have control over the build time: The more Kerbals you have in your construction facility, the faster the build. However, there is a catch: Kerbal stats (stupidity and courage) affect their productivity. Some Kerbals will even hold the team back.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EChangelog summary:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ERockets are now recycled to metal rather than RocketParts (unless you do not have Kethane installed, then the target resource remains as RocketParts).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhen Kethane is not installed, it is possible to force the use of resources. This is a per-save setting and a dialog allowing you to select the behavior will be presented the first time you go to the space center.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe state of the build requirements window (in the VAB) is saved (per save). This includes both visibility and position.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EProgressive builds. As mentioned above. This to is a per-save setting. For those that do not like the new system, they can have the old behavior (mostly, fuel etc is handled a little differently) by disabling progressive builds when they first start a new save.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EToolbar integration for the build window.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe one build menu supports multiple pads on the one vessels.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAll pods (actually, anything that\u0027s a command module) act as a low-grade workshop. The stock hitchhiker can and science lab also work as low-grade workshops (though of slightly better quality). \u003Cstrong\u003ENOTE\u003C/strong\u003E This feature requires ModuleManager.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA high-grade workshop has been added. Warning: it is very heavy, and rather large. However, it holds 10 kerbals (so even in non-progressive build mode, it still acts as a bus) and is 10 times as good as the science lab (per Kerbal).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETiny versions of the auger and smelter. Thanks to Triffid Hunter for the configs.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESpawned vessels are now always docked to the pad. This allows the use of mods to transfer Kerbals to the new ship (Crew Manifest, if I remember correctly).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEditor build requirements window doesn\u0027t lose track of the mass of a ship.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EVessels spawning has been reworked to avoid twisted parts and other issues caused by incorrect startup sequences.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe model for the large scanner (OMD) has been fixed: the bottom is no longer invisible.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWith this release, I declare a personal holiday so I can actually play KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E (I will, however, respond to issues).\u003C/p\u003E\n"},{"CreatedByName":"Thourion","CreatedById":47430,"CreatedDateTime":"2014-03-09T11:07:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EI have released v4.0 of Extraplanetary Launchpads (as always, GPL)....\u003Cp\u003E...With this release, I declare a personal holiday so I can actually play KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E (I will, however, respond to issues).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah i got an issue .. that change log made my eyes open waaay to much, and i cant close them. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[list]\u003Cbr\u003E[*]When Kethane is not installed, it is possible to force the use of resources.\u003Cbr\u003E[*]Toolbar integration for the build window.\u003Cbr\u003E[/list]\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEspecially those 2, along of course with the two majors above the log, made my day. Happy holidays \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E and thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-09T11:22:01Z\u0022 title=\u002203/09/2014 11:22  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 9, 2014\u003C/time\u003E by Thourion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Horus","CreatedById":99705,"CreatedDateTime":"2014-03-09T12:55:29Z","Content":"\n\u003Cp\u003EIs there a possibility to cancel production on a certain launchpad? Of course, with proper resources payback.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-03-09T13:14:18Z","Content":"\n\u003Cp\u003EOne problem with the new workshop, I can not get kerbals out of it. \u003C/p\u003E\u003Cp\u003EElse I like the new workshop a lot, yes it need stock textures. It might also be nice to balance it a bit regarding kerbal stupidity.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-03-09T13:23:43Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EHorus\u003C/strong\u003E: planned. I wanted to get 4.0 out so I thought that feature should wait.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Emagnemoe\u003C/strong\u003E: you can. wave your mouse around the airlock (should be obvious where it is) until you get a \u0022crew hatch\u0022 popup (you might have to get a funny camera angle). When you do, click and you\u0027ll get a menu for EVAing kerbals.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-03-09T15:13:09Z","Content":"\n\u003Cp\u003EOK, here\u0027s the situation:\u003C/p\u003E\u003Cp\u003EI\u0027ve got an orbital Construction yard with plenty of fuel, rocketparts and currently 16 Kerbals. Obviously it does not have a workshop. That\u0027s the part I wanted to ad. My station is build mainly out of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/34664\u0022 rel=\u0022external nofollow\u0022\u003E\u0027Large Structural/Station Components\u0027\u003C/a\u003E so it does not contain hitchhiker or lab modules. It does however has a few Mk1-2 Command Pod\u0027s. I have already moved as many of my Kerbals to all possible command pods (including the B9 pods on the docked shuttles) and already had the latest version of ModuleManager installed.\u003C/p\u003E\u003Cp\u003ENothings happening when I try to construct something. The bar stays at 0%.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003EEdit:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003ENo this is really weird. The problem seems to have solved itself. The percentage is slowly going up. All I did was leave the station for the Space Center and come back a few minutes later, re-loading the station.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-09T15:35:43Z\u0022 title=\u002203/09/2014 03:35  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 9, 2014\u003C/time\u003E by Tex_NL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-03-09T15:33:54Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ETex_NL\u003C/strong\u003E: you may have gotten unlucky. Check all your Kerbal \u0022tanks\u0022 for their productivity levels (right click menu, Productivity). If the value is 0 or less (yes less, it can be negative), then you have stupid kerbals in there (maybe all, or maybe enough to out-weigh the not so stupid kerbals).\u003C/p\u003E\u003Cp\u003EIf you don\u0027t get the Productivity line in your context menu, then we have more serious issues to sort out.\u003C/p\u003E\n"},{"CreatedByName":"Kapow","CreatedById":105333,"CreatedDateTime":"2014-03-09T15:36:57Z","Content":"\n\u003Cp\u003EHi taniwha, I love the new update cheers for all your work! buttttt I have a problem hopfully its a simple issue... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI can see nearly all of the parts in my career game and sandbox but spherical tanks and the new augs / workshop isnt spawning in my part lists. o.O\u003C/p\u003E\u003Cp\u003Edont understand how that can be but the install as far as i know was completed to the letter?\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-03-09T15:45:48Z","Content":"\n\u003Cp\u003EI did as you said and checked the productivity and I might have uncovered a minor bug in the process. One of the pods was indeed negative so I moved both Kerbals to a module that does not contribute to EPL. Right clicking on the now empty command pod still showed the negative productivity. Logic dictates it should be zero. Only after reloading the station (switched to other craft) the pod showed the correct productivity again.\u003C/p\u003E\u003Cp\u003EThis minor bug might also explain why I had no productivity at all. At first I loaded my station with empty command pods and moved my Kerbals after I started construction. When I cam back I loaded the station with filled pods and the productivity was calculated correctly.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003EEdit:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003EWould it be possible to add an overall productivity number? Perhaps on the dock/launchpad part?\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-09T15:53:03Z\u0022 title=\u002203/09/2014 03:53  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 9, 2014\u003C/time\u003E by Tex_NL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kapow","CreatedById":105333,"CreatedDateTime":"2014-03-09T15:48:32Z","Content":"\n\u003Cp\u003EHi Tanwha, cheers for all your hard work keeping this mod alive. \u003C/p\u003E\u003Cp\u003EI dont know if you could help point me in the right direction but some of the parts arn\u0027t spawning. I have all the other parts apart from the new aug\u0027s, spherical tanks and the new rocket part workshop. Yet the other parts are fine. any idea\u0027s? o.O\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-03-09T16:05:25Z","Content":"\n\u003Cp\u003EHmm, I thought I had that working, but maybe I hadn\u0027t actually tested boarding/disembarking. I\u0027m glad you got it sorted (as such). Would you mind \u003Ca href=\u0022https://github.com/taniwha-qf/Extraplanetary-Launchpads/issues?state=open\u0022 rel=\u0022external nofollow\u0022\u003Esubmitting an issue\u003C/a\u003E? And maybe another one for the productivity display.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-03-09T16:18:33Z","Content":"\n\u003Cp\u003ESorry but I don\u0027t have a Github account.\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-03-09T16:34:28Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E@PART[inflato1]{\u003Cbr\u003E\u003Cbr\u003E\tMODULE {\u003Cbr\u003E\t\tname = ExWorkshop\u003Cbr\u003E\t\tProductivityFactor = 3\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E@PART[inflato2]{\u003Cbr\u003E\u003Cbr\u003E\tMODULE {\u003Cbr\u003E\t\tname = ExWorkshop\u003Cbr\u003E\t\tProductivityFactor = 2\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E@PART[inflatoFlat]{\u003Cbr\u003E\u003Cbr\u003E\tMODULE {\u003Cbr\u003E\t\tname = ExWorkshop\u003Cbr\u003E\t\tProductivityFactor = 1.5\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E@PART[centrifuge1]{\u003Cbr\u003E\u003Cbr\u003E\tMODULE {\u003Cbr\u003E\t\tname = ExWorkshop\u003Cbr\u003E\t\tProductivityFactor = 0.5\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThere is an MM cfg to make the inflatable habs: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64442-Habitat-Pack\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/64442-Habitat-Pack\u003C/a\u003E into workshops, not sure on the balance of the numbers, the workshop in EL is 5, figured these would be less efficient and I basically adjusted it based on number of kerbals and free space inside to work, the flat and rotating habs both store 4 kerbals but the rotating one is really claustrophobic inside.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-09T16:41:09Z\u0022 title=\u002203/09/2014 04:41  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 9, 2014\u003C/time\u003E by K3|Chris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2014-03-09T18:17:42Z","Content":"\n\u003Cp\u003EThis might just be me, but when I try and build a ship with the new version, I am unable to switch into the built craft (or any craft). If I try returning to the Space Centre and then back to my base, the pad says that my craft is there but it\u0027s disappeared, and am unable to use it.\u003C/p\u003E\n"}]}