{"TopicId":54308,"ForumId":16,"TopicTitle":"General Career Mode Questions","CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2013-11-25T14:36:54Z","PageNum":1,"Articles":[{"CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2013-11-25T14:36:54Z","Content":"\n\u003Cp\u003ESo first off, making sure I\u0027m even understanding Science. At present I seem to have five ways of collecting Science: a science tool like the goo container or one of the sensors, crew reports, EVA reports, soil samples, and recovery of a ship after a flight. Now as I have seen it explained, for each of these categories, there are a pool of Science points at given locations within the game; low orbit, high orbit, over or landed at various biomes, around the Mun, etc etc. And that these pools are set amounts that you deplete every time you collect and then turn in the points, either by bringing them home or transmitting them, and that the percentage loss due to transmission doesn\u0027t actually reduce the total points you can gain from the pool, it merely means you have to do more transmissions to collect everything. You can\u0027t actually lose points forever by transmitting. \u003C/p\u003E\u003Cp\u003ENow for transmitting science, does the type and number of comm units have any effect on the percentage of Science you can get per transmission? Does it matter if I\u0027m using a Communotron 16 or the 88-88? Do more of them make a difference? \u003C/p\u003E\u003Cp\u003EAlso, has anyone mapped out the different locations where you can collect Science from? \u003C/p\u003E\u003Cp\u003EFinally in regards to ship building. I used to use Mechjeb in order to determine my TWR and Delta V while building my ships. However MJ isn\u0027t available in the career mode, which has left me building blind, using my best guesses based on what I can remember from my old sandbox games. Is there a mod that can be used to give you the ship stats while playing career mode?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T04:08:45Z\u0022 title=\u002211/28/2013 04:08  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Lighthawk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-11-25T16:46:56Z","Content":"\n\u003Cp\u003ESomeone correct me if I\u0027m wrong but does VOID show up in the VAB? Doesn\u0027t use a part so it should work. If not.. get engineer redux and add the line \u0022start\u0022 in its .cfg next to techrequired. Then purchase it in R\u0026amp;D.\u003C/p\u003E\u003Cp\u003EYou got it with the science points, but when it comes to antennas the larger ones only make the transmissions faster. You don\u0027t get more SP per trans. They use much more power, but I personally like the speed. I use the second, flat antenna that folds outward ( forget the name ) and I have one per experiment. It really makes transmissions quick. Depleting a biome to 0.0 points well... sucks quite frankly so the quicker the better imo.\u003C/p\u003E\u003Cp\u003EAnd yes there are biome maps laying around here somewhere. I\u0027m on my phone though so searching isn\u0027t the easiest thing. I\u0027ll look around later if someone doesn\u0027t beat me to it by then. Honestly though.. you don\u0027t need them. The different biomes are kinda obvious. Especialy on the moon. Just every major crater and the poles. Then on Kerbin every terrain change.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-25T16:48:57Z\u0022 title=\u002211/25/2013 04:48  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 25, 2013\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-11-25T17:19:28Z","Content":"\n\u003Cp\u003EKER will do the TWR and delta-V display job. It looks like it\u0027s been updated so that you don\u0027t have to crack open the .cfg files (this from October 21, 2013 off the mod\u0027s comment page). If not, add the \u0022start\u0022 parameter Motokid600 indicated. You will have to activate the parts in R\u0026amp;D; just click on them and select \u0022YES\u0022. They should be under Starting Tech.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022www.kerbalmaps.com\u0022 rel=\u0022external nofollow\u0022\u003Ewww.kerbalmaps.com\u003C/a\u003E has added biome data for Kerbin and MÃƒÂ¼n; it\u0027s pretty much what Motokid600 indicated.\u003C/p\u003E\u003Cp\u003EEverything else has been covered; your understanding of how Science works is accurate.\u003C/p\u003E\u003Cp\u003EEDIT: Found the specific parameters you need in case it doesn\u0027t work. It\u0027s:\u003C/p\u003E\u003Cp\u003ETechRequired = start \u003C/p\u003E\u003Cp\u003EentryCost = 0 \u003C/p\u003E\u003Cp\u003EAdd those to the part .cfg files if they aren\u0027t there. Then go into R\u0026amp;D, select Starting Tech and click on the parts to activate them.\u003C/p\u003E\u003Cp\u003EActually, MechJeb uses parts, doesn\u0027t it? No reason why you couldn\u0027t just do the same thing there...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-25T17:26:17Z\u0022 title=\u002211/25/2013 05:26  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 25, 2013\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-11-25T17:20:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lighthawk\u0022 data-cite=\u0022Lighthawk\u0022\u003E\u003Cdiv\u003ESo first off, making sure I\u0027m even understanding Science. At present I seem to have five ways of collecting Science: a science tool like the goo container or one of the sensors, crew reports, EVA reports, soil samples, and recovery of a ship after a flight. Now as I have seen it explained, for each of these categories, there are a pool of Science points at given locations within the game; low orbit, high orbit, over or landed at various biomes, around the Mun, etc etc. And that these pools are set amounts that you deplete every time you collect and then turn in the points, either by bringing them home or transmitting them, and that the percentage loss due to transmission doesn\u0027t actually reduce the total points you can gain from the pool, it merely means you have to do more transmissions to collect everything. You can\u0027t actually lose points forever by transmitting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is correct as of 0.22. The pool of science available for any particular activity is fixed - and transmission loss only means it takes more experiments to get it all. Typically three to five runs (depending on transmission loss) will grab most of the science available at a location.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENow for transmitting science, does the type and number of comm units have any effect on the percentage of Science you can get per transmission? Does it matter if I\u0027m using a Communotron 16 or the 88-88? Do more of them make a difference?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, this doesn\u0027t matter actually. The different kinds of transmission instruments have some different power usage and data through-put. Generally - the higher level ones transmit faster, but consume more power per data portion. So it becomes a trade-off of how much power you want to carry around all the time in the form of batteries. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso, has anyone mapped out the different locations where you can collect Science from? \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only two bodies that have biomes defined (that aren\u0027t the whole body) are Kerbin and Mun. Here is a \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/File:MunBiomeMap.png\u0022 rel=\u0022external nofollow\u0022\u003Ebiome map for Mun\u003C/a\u003E (Source, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Main_Page\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Main_Page\u003C/a\u003E).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFinally in regards to ship building. I used to use Mechjeb in order to determine my TWR and Delta V while building my ships. However MJ isn\u0027t available in the career mode, which has left me building blind, using my best guesses based on what I can remember from my old sandbox games. Is there a mod that can be used to give you the ship stats while playing career mode?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think some mods are working toward allowing you to add those parts, it may take a bit - though, as career mode is very much WIP. In the mean time, I prefer to just ham-hand my builds and see what happens anyway. Failure is always an option - and a good place to learn something new. =)\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-11-25T17:23:55Z","Content":"\n\u003Cp\u003EThe different antennae have different peak power requirements and different transmission rates but they don\u0027t affect the science that you get back from the transmission. In almost all cases the small red and white antenna is the optimal choice. If however you need to transmit a large amount of data very fast you might want the dish antenna. for example if you were traveling through Dunas upper atmosphere and collecting repeated samples with the atmosphere tool and needed to transmit all that data before you got to lower atmosphere. Note that you\u0027d need a lot of batteries for that.\u003C/p\u003E\u003Cp\u003EEdit: actually now that I think about it multiple small antennas might be better than one large dish antenna for that\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-25T17:44:26Z","Content":"\n\u003Cp\u003EThe different types of antennae have different power requirements (Increasing as they get bigger) and different transmission speeds (Again, increasing with size) but otherwise they are identical. However, each antenna is capable of transmitting one experiment, so if you have 5 experiments on a craft you should have 5 antennae for \u003Cstrong\u003Esimultaneous \u003C/strong\u003Etransmission. Now, that being said (And the reason I emboldened) is because transmission stack. In the above scenario (Duna Atmosphere reentry) you can spam the transmit button as you fall (And you will also eventually get flying at) and upon successfully landing your ship will continue to transmit all the data it gathered whilst falling through the atmosphere (It will just take a really long time)\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-25T17:46:33Z","Content":"\n\u003Cp\u003EExcept for biomes (only kerbin and the mun) science pools are the same everywhere. High orbit, low orbit, on the surface\u003C/p\u003E\n"},{"CreatedByName":"gtmattz","CreatedById":15075,"CreatedDateTime":"2013-11-25T17:54:55Z","Content":"\n\u003Cp\u003EThe current version of mechjeb is incorporated into career mode. I cannot recall which node unlocks the module, but it is quite low on the tree. When first unlocked about all you get is smart a.s.s. orbit info, and vessel stats, then the rest of the features unlock as you progress up the unmanned tech line. Until you get the module unlocked, however, you are stuck with either guesswork, or doing the calculations on your own (you can go into sandbox and check there as well... I just guess myself.)\u003C/p\u003E\n"},{"CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2013-11-28T04:08:12Z","Content":"\n\u003Cp\u003EThank you all for the good information, I greatly appreciate it.\u003C/p\u003E\n"},{"CreatedByName":"phuzz","CreatedById":71882,"CreatedDateTime":"2013-11-28T16:10:20Z","Content":"\n\u003Cp\u003EI ended up modifying the tech tree in MechJeb, as I wanted at least the info windows and the warp helper to be available from near the start.\u003C/p\u003E\n"}]}