{"TopicId":54373,"ForumId":39,"TopicTitle":"Kerbal: Spassi Ishosh yi Aton (Kerbstomp Edition on Reddit)","CreatedByName":"featherwinglove","CreatedById":68098,"CreatedDateTime":"2013-11-26T01:27:37Z","PageNum":1,"Articles":[{"CreatedByName":"featherwinglove","CreatedById":68098,"CreatedDateTime":"2013-11-26T01:27:37Z","Content":"\n\u003Cp\u003ESome of you might remember back in January, this crazy guy naming himself \u0022featherwinglove\u0022 starting (to the tune of 28 chapters) a story named Kerbal: Spassi Ishosh yi Aton (Kerbal: Space Welcomes You). Maybe you liked it, maybe not. It no longer exists here because of the April crash, and neither it, nor its reboot, the Kerbstomp Edition will be posted on this forum due to more recent problems I\u0027ve had with this forum\u0027s moderation. Here\u0027s the link to where it is actually going up on Reddit:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://redd.it/1rgldc\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://redd.it/1rgldc\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you\u0027re interested in the original version, which falls off at Chapter 28, I\u0027m open to zipping up my original files and dropbox\u0027ing them. Please send me a gmail if you\u0027d like me to do that.\u003C/p\u003E\n"},{"CreatedByName":"Needles_10","CreatedById":59554,"CreatedDateTime":"2013-11-26T01:38:35Z","Content":"\n\u003Cp\u003EPlease do.\u003C/p\u003E\n"},{"CreatedByName":"Zuni","CreatedById":85203,"CreatedDateTime":"2013-11-26T07:00:22Z","Content":"\n\u003Cp\u003EHow do you translate to Kerbic? MUST KNOW THE SECRET!\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2013-11-26T18:28:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zuni\u0022 data-cite=\u0022Zuni\u0022\u003E\u003Cdiv\u003EHow do you translate to Kerbic? MUST KNOW THE SECRET!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReverse Spanish\u003C/p\u003E\n"},{"CreatedByName":"featherwinglove","CreatedById":68098,"CreatedDateTime":"2013-11-28T07:19:32Z","Content":"\n\u003Cp\u003EOkay, zipped up the old story and put it here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.4shared.com/zip/U2vbZu9o/Story.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.4shared.com/zip/U2vbZu9o/Story.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt includes only the last (once published) versions of the stories, and several previously unpublished support files (flight logs mostly), including one to partly answer Zuni\u0027s question: what little I\u0027ve developed regarding the kerbal language for K:SIyA (btw, the official Squad videos really are in reversed Spanish!)\u003C/p\u003E\u003Cp\u003EAs for the Reddit story, please vote it up if you think more people should read it. Reddit doesn\u0027t make it easy to find.\u003C/p\u003E\n"}]}