{"TopicId":54419,"ForumId":29,"TopicTitle":"Idea: Real-time in-game compilation of C# mods, a la kOS","CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-11-26T17:11:04Z","PageNum":1,"Articles":[{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-11-26T17:11:04Z","Content":"\n\u003Cp\u003ELast night, I had an idea for a scripting framework that would allow for in-game coding and execution of true C# code, like kOS but with all the power of C# behind it.\u003C/p\u003E\u003Cp\u003EThe .NET framework \u003Ca href=\u0022http://msdn.microsoft.com/en-us/library/system.codedom.compiler.icodecompiler.aspx\u0022 rel=\u0022external nofollow\u0022\u003Econtains its own compiler\u003C/a\u003E. This could be used to generate an assembly with certain pre-defined method names, such as \u0022Init\u0022 or \u0022Loop\u0022. The mod could then execute those methods at the correct time. \u003C/p\u003E\u003Cp\u003EThe main difficulty that I see in this is unloading the assembly when we want to recompile. There are ways to use Application Domains to forcibly unload an assembly, but I do not know them yet.\u003C/p\u003E\u003Cp\u003EAside from that, does anyone know any reasons why this might not work?\u003C/p\u003E\n"},{"CreatedByName":"Cilph","CreatedById":21477,"CreatedDateTime":"2013-11-26T17:44:17Z","Content":"\n\u003Cp\u003EWell, it doesn\u0027t contain a compiler - it contains an interface. Compiler-as-a-service isn\u0027t available until .NET 5.0\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Microsoft_Roslyn\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Microsoft_Roslyn\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHowever I might see a future in including a LUA core \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T17:47:14Z\u0022 title=\u002211/26/2013 05:47  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by Cilph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-11-26T18:01:19Z","Content":"\n\u003Cp\u003EIs there any meaningful difference between an interface to the compiler and getting the actual compiler? Right now I\u0027ve got some test code that takes in a string representing source code and spits out a functioning .NET assembly. Admittedly, the only code I\u0027ve tried so far is trivial, but it seems to work OK.\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-11-26T18:06:32Z","Content":"\n\u003Cp\u003EMicrosoft\u0027s .net Framework \u003Cstrong\u003Edoes\u003C/strong\u003E contain a compiler, even with our old version: \u003Ca href=\u0022http://msdn.microsoft.com/en-us/library/microsoft.csharp.csharpcodeprovider%28v=vs.90%29.aspx\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://msdn.microsoft.com/en-us/library/microsoft.csharp.csharpcodeprovider%28v=vs.90%29.aspx\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EActually multiple different ways, though afaik none of them is supported on all platforms/versions. Thats pretty much the only reason i know for Roslyn...\u003C/p\u003E\u003Cp\u003EI tried to use AppDomains once on a different game, and it usually ended killing my entire app. So yeah, forcefully unloading an assembly isn\u0027t rly sth .net likes. It also would not be necessary for kOS-like scripts, btw.\u003C/p\u003E\u003Cp\u003EAlso what should be the big benefit of using C#? You could directly use the ksp-api, though most of it isn\u0027t well documented and usually not suitable for an auto pilot, so you would have to write some kind of wrapper api anyway.\u003C/p\u003E\u003Cp\u003EYou would have to use state machines (Enumerators, since we are on pre-.net4) very frequently, what isn\u0027t as easy to understand for someone new to scripting as kOS\u0027s simplified api. You also don\u0027t have the awesome dev environment... though if you do, you can just compile it anyway. To make it short: I also have thought about that once, after kOS was been released and my conclusion was that it wasn\u0027t worth the effort for me. Though it should definitively work.\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-11-26T18:15:09Z","Content":"\n\u003Cp\u003EAt the end of the day, what I\u0027m imagining is a way to access the KSP API directly and dynamically from in-game. C# is my \u0022native tongue\u0022, I\u0027m much more familiar with it than any other language and often do these kinds of dirty tricks at my day job. \u003C/p\u003E\u003Cp\u003EAdditionally, using C# gets us a much more robust language and compiler, one that has a hundred MS engineers with unlimited freedom behind it, as opposed to anything one person could shoehorn into a mod API. I mean no slight to the author of kOS, I just see a possible different path.\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-11-26T18:40:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dahud\u0022 data-cite=\u0022dahud\u0022\u003E\u003Cdiv\u003EWhat I\u0027m imagining is a way to access the KSP API directly and dynamically from in-game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut what does that mean? I only see a few advantages:\u003C/p\u003E\u003Cp\u003E- Its C# and some of us are already familiar with it\u003C/p\u003E\u003Cp\u003E- All benefits C# gives us (performance, ...) including multiple powerful dev environments \u003C/p\u003E\u003Cp\u003E- Compile-when-loading, so non-C#-users don\u0027t have to install a compiler (though also loosing the matching advantage)\u003C/p\u003E\u003Cp\u003E- Loading a piece of code multiple times/ loading an update version without restarting KSP, though sth like that can be achieved anyway when loading assemblies manually\u003C/p\u003E\u003Cp\u003EDoes \u0022directly\u0022 mean you don\u0027t want an kOS-Like wrapper? Well, this wrapper should actually help you, so you for example don\u0027t have to fiddle around with KSP\u0027s bunch of different reference frames. Does \u0022dynamically\u0022 mean that you can reload a modified assembly?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T18:42:24Z\u0022 title=\u002211/26/2013 06:42  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by Faark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-11-26T18:59:37Z","Content":"\n\u003Cp\u003EBy \u0022directly and dynamically\u0022, I meant that I want a kOS-like console in the game that I can type C# code into. Essentially this would be a tool for fiddling with the API, not so much an autopiloting thing.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-11-26T19:22:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dahud\u0022 data-cite=\u0022dahud\u0022\u003E\u003Cdiv\u003EBy \u0022directly and dynamically\u0022, I meant that I want a kOS-like console in the game that I can type C# code into.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ER4m0n did it a year ago, although I don\u0027t know if he ever released an updated version:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/5E1GvxZncUU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-27T13:41:16Z","Content":"\n\u003Cp\u003EI\u0027m not sure about C#, but what the Mono contained inside Unity that comes with KSP definitely does have is the \u003Ca href=\u0022http://boo.codehaus.org/\u0022 rel=\u0022external nofollow\u0022\u003EBoo compiler\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EBoo is also the language specifically suited for \u003Ca href=\u0022https://www.amazon.com/DSLs-Boo-Domain-Specific-Languages/dp/1933988606\u0022 rel=\u0022external nofollow\u0022\u003Econstructing domain-specific languages\u003C/a\u003E, even, so a plugin that presents you with such a domain-specific language and works with scripts on disk the way kOS does is quite practical. I actually considered something like this for RasterPropMonitor, because the first I\u0027ve heard of Boo was in the description of how how Kerbin Orbiter MFDs were supposed to work -- but then decided that would be overkill for what it actually needs to do.\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-11-27T20:50:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dahud\u0022 data-cite=\u0022dahud\u0022\u003E\u003Cdiv\u003EBy \u0022directly and dynamically\u0022, I meant that I want a kOS-like console in the game that I can type C# code into. Essentially this would be a tool for fiddling with the API, not so much an autopiloting thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh okay, you basically want sth like Visual Studios or MonoDevelops \u0022Immediate Window\u0022? Well, we could have the second, if squad would just share a development build of KSP with us. There would still be a \u003Ca href=\u0022http://answers.unity3d.com/questions/37822/how-to-debug-external-net-dlls.html\u0022 rel=\u0022external nofollow\u0022\u003Efew\u003C/a\u003E additional steps to follow, but a proper debugger would make building mods so much easier. No idea why they cannot or do not want to offer such an dev build for modders. Do you have a direct line? Maybe you could ask them...\u003C/p\u003E\u003Cp\u003EAlso MonoDevelops Immediate Window is kind of limited. I\u0027m especially missing the auto completion. Have to try out UnityVS, though that does only support VS Professional\u002B, so i doubt Squad would ever want to negotiate an agreement with them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T20:55:35Z\u0022 title=\u002211/27/2013 08:55  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Faark\u003C/strong\u003E\n\u003C/span\u003E\n"}]}