{"TopicId":54462,"ForumId":16,"TopicTitle":"My single crew Duna Lander in need of help","CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-27T01:43:11Z","PageNum":1,"Articles":[{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-27T01:43:11Z","Content":"\n\u003Cp\u003EOk I designed a small ship today that I intend to land on Duna, or Eve, and meet back up with the probe tug (yet to be designed) waiting back in orbit. My problem is weight I feel, it weights 38.55 T but can get into Kerbin orbit (around 100km-ish) with no fuel left. Is this a bit of over kill for landing on these two planets or a strong contender? I added parachute...lots of them... figured it will help slow me down so I do not need to use the main thruster much or at all. On Kerbin it slows to about 6.5 m/s before landing without the thruster being engaged. It has RCS with the small ball tanks, though I may put a big cell on it but I fear making it any heavier. The main thruster does not have gimbling, hence why there are winglets for aid in maneuvering. I could take and make the side tanks detachable to help aid in the lift off process. To me this just seems so heavy for what it is, yet from what I have read I feel everything is needed to achieve a safe landing and getting it back into orbit. I am so lost right now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny help would be most welcomed and great appreciated. \u003C/p\u003E\u003Cp\u003EPicture taken just a few moments ago showing what the ship looks like currently\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img802.imageshack.us/img802/5155/5s90.png\u0022 alt=\u00225s90.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T07:45:14Z\u0022 title=\u002211/28/2013 07:45  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"louddifference","CreatedById":90113,"CreatedDateTime":"2013-11-27T01:51:46Z","Content":"\n\u003Cp\u003Ei would say if its weight is too large get rid of the srbs and replace them with liquid rockets\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T02:05:41Z","Content":"\n\u003Cp\u003EFor Duna, this is way overkill. Duna has 0.3 gravity so you don\u0027t even need half of those engines. Like the other poster said, replace the SRB\u0027s with liquid fuel engines. you\u0027ll only need 4 max for Duna along with your central one. Eve on the other hand... This craft won\u0027t even make it 15,000 meters off the ground, so don\u0027t land it on Eve unless you never want to see the poor Kerbal in that pod ever again. Eve\u0027s gravity is 1.7 so 70% more than Kerban. The atmosphere is also way thicker and doesn\u0027t end until 90 km. Duna has thin atmosphere so all of those parachutes will help, you\u0027ll actually land a little faster on Duna because the parachutes won\u0027t be as affective as they are on Kerban. You might land at 10 m/s or more for Duna.\u003C/p\u003E\u003Cp\u003EFor Duna you need less. For Eve you need way, way, way more fuel (Do Not Attempt if it\u0027s your first time).\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-27T02:08:52Z","Content":"\n\u003Cp\u003EIn the center I have one LV-T30 with 6 FL-T 400 tanks (2 mounted in the center and four on the sides) and 4 FL-T 100 tanks on to of the outer set of the 400\u0027s. Without the SRB\u0027s it is a struggle on Kerbin to make it to a 100km-ish orbit, I can do it but I have no room for error. Even with the boosters I only have enough fuel to burn for 2 seconds at most. But if it is easier to leave Duna than Kerbin am I going a bit much then on fuel? Also if that is the case I could also go to the LV-T45 losing only 15 from max power of the LV-T30 and ditch the SRB\u0027s and still be fine. I guess maybe the weight is not the main concern as needing to know if I am over shooting the dV to get off Duna with this craft or not. Thanks for the advice though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-27T02:17:08Z","Content":"\n\u003Cp\u003EOk that is what I was thinking after building it that it was too much in one direction and seriously not enough in the other. If I put LV-909\u0027s at the 4 corners with a LV-T 30 in the center I should have more than enough thruster action to slow myself down then, and keep the chutes to lessen the amount of thrust needing to stop before kaboom. Right now this all on my test save so what happens there is not too big of a deal, so long as I can do the same thing a few times there I should be good on the main save. I did name it Kaboom for a reason I guess hehe.\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T02:22:41Z","Content":"\n\u003Cp\u003EYeah, that\u0027s way too much fuel for Duna. The SRB\u0027s you have on there could get you into orbit by themselves with no problem. Here is my Duna Transfer Pod that\u0027s docked to my orbiting space station as an example. I don\u0027t know the names of all of the parts, but I\u0027m sure you can tell what\u0027s on there. This thing deorbits from about 80 km to the surface of Duna, then it goes back into orbit and docks with the space station and refuels. Since this is the goal of your ship, take this as an example of how much fuel you need on a pod like yours. Since mine seats 2 kerbals, it\u0027s a little heavier than yours should be. Of course, you could always use the aerospike engines for your landers engines and just add additional fuel in asparagus staging and you would get the same result as this lander, even better because you would have a little more fuel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226640824924/C5AB9DAF16888BFC1805DA0D8D8B59F84FB91E02/\u0022 alt=\u0022C5AB9DAF16888BFC1805DA0D8D8B59F84FB91E02\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226640829314/3BEA4136BC5E5A6CC5D0FB1CC32FDC6EDC468B93/\u0022 alt=\u00223BEA4136BC5E5A6CC5D0FB1CC32FDC6EDC468B93\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere it is attached to my orbital station at Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/1046252431431418478/8CFDF8BE5E4F52751F3641A7FF65E048A57FE133/\u0022 alt=\u00228CFDF8BE5E4F52751F3641A7FF65E048A57FE133\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T02:57:40Z","Content":"\n\u003Cp\u003EI launched a quick mission over to Duna to show how this transfer pod works and what to expect. I didn\u0027t use any RCS fuel in this flight, but remember that RCS can be used just as effectively as liquid fuel engines when the craft is small enough and has enough RCS ports. I still had fuel remaining after I achieved orbit. You also want to make an engine to deorbit your lander and don\u0027t use any of the lander\u0027s fuel. I was coming down fast on Duna, but a short half second burn from the lander engines slowed it down to 10m/s for landing. I broke 2 of the landing legs, but Jeb repaired them so it didn\u0027t matter. Also remember to repack parachutes and check your legs after the landing just to make sure that everything is fixed and ready for takeoff otherwise bad things can happen. Just right click on the components with the Kerbal in EVA and you can repack parachutes and repair landing legs if you didn\u0027t know already. You can also repair rover wheels too.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226641451417/8A29ED790DF7A637DE77301A887E8F9A1EAC4E46/\u0022 alt=\u00228A29ED790DF7A637DE77301A887E8F9A1EAC4E46\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/903266226641457783/7541592BD30D74AF866B4D62D17193C1B4D41585/\u0022 alt=\u00227541592BD30D74AF866B4D62D17193C1B4D41585\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226641462887/CF4046BCC7E2899FF5B6FE6DE4E3F889661F6AD0/\u0022 alt=\u0022CF4046BCC7E2899FF5B6FE6DE4E3F889661F6AD0\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226641468985/FD919BA7E43F4AE6A0F80A48CC10A0757C7FD5BB/\u0022 alt=\u0022FD919BA7E43F4AE6A0F80A48CC10A0757C7FD5BB\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226641473072/B8864CB2CA9374C6FB3561CF5CC4FA40A003A9E3/\u0022 alt=\u0022B8864CB2CA9374C6FB3561CF5CC4FA40A003A9E3\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226641477939/C6A2C13E48EC29F111619B746AE6BB276DDFCDC6/\u0022 alt=\u0022C6A2C13E48EC29F111619B746AE6BB276DDFCDC6\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-11-27T03:06:25Z","Content":"\n\u003Cp\u003E700NitroXpress, it\u0027s so cute! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T03:07:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003E700NitroXpress, it\u0027s so cute! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I like my lil transfer pod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-27T03:26:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022700NitroXpress\u0022 data-cite=\u0022700NitroXpress\u0022\u003E\u003Cdiv\u003EYeah, that\u0027s way too much fuel for Duna. The SRB\u0027s you have on there could get you into orbit by themselves with no problem. Here is my Duna Transfer Pod that\u0027s docked to my orbiting space station as an example. I don\u0027t know the names of all of the parts, but I\u0027m sure you can tell what\u0027s on there. This thing deorbits from about 80 km to the surface of Duna, then it goes back into orbit and docks with the space station and refuels. Since this is the goal of your ship, take this as an example of how much fuel you need on a pod like yours. Since mine seats 2 kerbals, it\u0027s a little heavier than yours should be. Of course, you could always use the aerospike engines for your landers engines and just add additional fuel in asparagus staging and you would get the same result as this lander, even better because you would have a little more fuel.\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226640824924/C5AB9DAF16888BFC1805DA0D8D8B59F84FB91E02/\u0022 alt=\u0022C5AB9DAF16888BFC1805DA0D8D8B59F84FB91E02\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226640829314/3BEA4136BC5E5A6CC5D0FB1CC32FDC6EDC468B93/\u0022 alt=\u00223BEA4136BC5E5A6CC5D0FB1CC32FDC6EDC468B93\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere it is attached to my orbital station at Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/1046252431431418478/8CFDF8BE5E4F52751F3641A7FF65E048A57FE133/\u0022 alt=\u00228CFDF8BE5E4F52751F3641A7FF65E048A57FE133\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the advice, I added aerospikes to the outer pods and kept the LV-T 35 in the center and man that thing motors up quick even on Kerbin. I did the asparagus staging on the spike tanks, but jettison them in flight (I may rethink this idea later as now it would be reusable). I think I got up to 300m/s before 9000 meters and the first set of spike tanks dying out, in fact I got up to 100km but no orbit mostly due to not paying attention. I think if I add four fuel only tank to drain into the first two that will die first I should be ok, but as it stands now I am at 28.3 T so I might be ok to add on the tanks and still be under that 38.55 T I had before. Your lander is so much more beefier than my poor little pencil LOL, but it is impressive. Now for my Robo-tug, basically a probe with atomic engines and fuel for days. It is becoming more and more likely I may have my first Duna landing soon...maybe by Christmas LOL.\u003C/p\u003E\u003Cp\u003EEdit: Here is the slimmed down version. I am still debating adding on more fuel tanks but at .3 the gravity I feel this should be more than enough to run away from Duna. Also I know this will not make it to Duna on its own, the tug is still in the build phase.....meaning I need to build it yet.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img842.imageshack.us/img842/8620/1mnx.png\u0022 alt=\u00221mnx.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T03:34:19Z\u0022 title=\u002211/27/2013 03:34  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T03:36:33Z","Content":"\n\u003Cp\u003EEven though your craft you have now didn\u0027t get into a full orbit, I can tell by the numbers you posted that it\u0027s more than enough for Duna. Whatever you have now is good to go. If you don\u0027t want to stage the tanks, then that\u0027s fine, you could probably make them permanently attached if you want to use the whole thing over again. Just switch the engines into different stages and use action groups to control them. Use one set for landing and help with takeoff, then the next set should be more than enough for orbit. It doesn\u0027t take much fuel for a transfer stage to get to Duna. That station I have there got to Duna with that amount of fuel you see in the image and it\u0027s somewhere around 160 tons. Your lander is lightweight so all you should need is one or two of the 1440 capacity fuel tanks with one nuclear engine each and that should be enough to get to Duna and back to Kerban.\u003C/p\u003E\u003Cp\u003EEdit: Oh yeah, what you have shown is more than enough for Duna, you\u0027ll be just fine with that craft. If you make all of the tanks permanent, set up the asparagus fuel lines, but don\u0027t stage the tanks. Keep them attached and it will still work really well and you can reuse it.\u003C/p\u003E\u003Cp\u003EMy transfer pod is 77 parts and 17.85 tons.\u003C/p\u003E\u003Cp\u003EThose aerospikes are probably way to powerful for your purposes now that I think of it. You could replace those with the LV-909 engines and it would be more efficient. Doing this would also allow you to get rid of some of the excess fuel tanks. The FL-T100 fuel tanks on the outer engines could go if you switched the engines to the LV-909\u0027s, but both will work. If weight is a concern then the LV-909 is the way to go. You could also shorten the craft by getting rid of the LV-T30 and using 2 Mark 55 radial engines.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T04:14:30Z\u0022 title=\u002211/27/2013 04:14  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003Cbr\u003EMerging sequential posts\n\u003C/span\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-27T03:53:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022700NitroXpress\u0022 data-cite=\u0022700NitroXpress\u0022\u003E\u003Cdiv\u003EEven though your craft you have now didn\u0027t get into a full orbit, I can tell by the numbers you posted that it\u0027s more than enough for Duna. Whatever you have now is good to go. If you don\u0027t want to stage the tanks, then that\u0027s fine, you could probably make them permanently attached if you want to use the whole thing over again. Just switch the engines into different stages and use action groups to control them. Use one set for landing and help with takeoff, then the next set should be more than enough for orbit. It doesn\u0027t take much fuel for a transfer stage to get to Duna. That station I have there got to Duna with that amount of fuel you see in the image and it\u0027s somewhere around 160 tons. Your lander is lightweight so all you should need is one or two of the 1440 capacity fuel tanks with one nuclear engine each and that should be enough to get to Duna and back to Kerban.\u003Cp\u003EEdit: Oh yeah, what you have shown is more than enough for Duna, you\u0027ll be just fine with that craft. If you make all of the tanks permanent, set up the asparagus fuel lines, but don\u0027t stage the tanks. Keep them attached and it will still work really well and you can reuse it.\u003C/p\u003E\u003Cp\u003EMy transfer pod is 77 parts and 17.85 tons.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah I will work on again tomorrow before I go off to make pies, bugs me I cannot take my tower with me now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E when there is work to be done in the universe LOL. Next up on lander ideas would be Eve, I will use the same tug to take it there as well I think so design wise it should be small as well. I know there are some who like big monsters of ships, but I figure if it is functional and does the same as a big one that is good by me. Of course when I get more experience I will do bigger ones, but this is what my goals are. Thanks again for the assist as this has been bugging me all week me all week.\u003C/p\u003E\u003Cp\u003EEdit: Just seen the second post....Hmmmm Might have to make a mental note on those changes and do 2 launches to see what one I like better.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T03:55:21Z\u0022 title=\u002211/27/2013 03:55  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T04:14:49Z","Content":"\n\u003Cp\u003EYeah, I went ahead and real quickly recreated your lander with the changes I had in mind for it. So this is how I would do your lander to make it more efficient. Still weighs about 24 tons, but it flies on Kerban and lands well. I put on the engines and set up the RCS placement. I also used the smaller landing legs as they were more stable when the craft was deployed. I also added electrical generators instead of solar panels on the sides of the pod and changed the docking port to a shielded one. In the VAB shot, the asparagus fuel lines are set up, but notice that the craft is all one piece so there\u0027s no staging. It will behave like an asparagus staged craft, but you don\u0027t have to stage it if you intend on reusing it. Normally I would have and SAS module on it, but this was stable without one so you should be fine. You also don\u0027t need to add any struts at all to something like this because it\u0027s already solid.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226642864033/E78E872E2EC89EC331FB4F4E443E3D083BFBB884/\u0022 alt=\u0022E78E872E2EC89EC331FB4F4E443E3D083BFBB884\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226642868792/F0A859F89E30CF92C90424C737FB0A0CF9FE8BFA/\u0022 alt=\u0022F0A859F89E30CF92C90424C737FB0A0CF9FE8BFA\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226642872258/63CF24A77F42FA1773EE3132BA10DAEAE4F04733/\u0022 alt=\u002263CF24A77F42FA1773EE3132BA10DAEAE4F04733\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T04:54:59Z","Content":"\n\u003Cp\u003EAlright, so to save you time and effort, I did a test flight for you at Duna. The craft deployed parachutes going in excess of 350 m/s towards the surface and slowed down to about 25 m/s without anything ripping off, so that\u0027s an extreme stress test for you. It took a little burst from the engines in order to land softly at 6 m/s. It then had more than enough fuel to achieve orbit of Duna with the asparagus fuel lines. So if you like this design, it\u0027s good to go for Duna. You could cut the fuel in half and still get good results, but this one works. It will not make it off of Eve or even get close. It might get about 2,000 meters off the ground at Eve if it\u0027s lucky so don\u0027t take it there, Eve is a different monster to tackle. The results of the test are posted below. You\u0027ll also see in this redesign that there\u0027s room for an attachment or docking port on the bottom of the long fuel tank, so you could move the docking port around. If you use the same fuel tank for all 5 engine parts, so the outer 4 and the one in the center, you\u0027ll cut down on the weight and you\u0027ll have more than enough fuel for the job with this same design. You\u0027ll also bring the craft closer to the center of mass which will give you more control.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226643559320/4890282D26864C8869B3A744E4F3AFAE9F4EE183/\u0022 alt=\u00224890282D26864C8869B3A744E4F3AFAE9F4EE183\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226643564297/2F39D00AD2A2C6866E7CFBCA02F5A4944816AB28/\u0022 alt=\u00222F39D00AD2A2C6866E7CFBCA02F5A4944816AB28\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226643568264/190DE64C75443CB2BC9EDBE6252A972E6A39A98D/\u0022 alt=\u0022190DE64C75443CB2BC9EDBE6252A972E6A39A98D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226643573572/4EA8439AA190AD19938C811E60FB473FCE9D6C1D/\u0022 alt=\u00224EA8439AA190AD19938C811E60FB473FCE9D6C1D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T05:00:43Z\u0022 title=\u002211/27/2013 05:00  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by 700NitroXpress\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-27T05:13:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022700NitroXpress\u0022 data-cite=\u0022700NitroXpress\u0022\u003E\u003Cdiv\u003EAlright, so to save you time and effort, I did a test flight for you at Duna. The craft deployed parachutes going in excess of 350 m/s towards the surface and slowed down to about 25 m/s without anything ripping off, so that\u0027s an extreme stress test for you. It took a little burst from the engines in order to land softly at 6 m/s. It then had more than enough fuel to achieve orbit of Duna with the asparagus fuel lines. So if you like this design, it\u0027s good to go for Duna. You could cut the fuel in half and still get good results, but this one works. It will not make it off of Eve or even get close. It might get about 2,000 meters off the ground at Eve if it\u0027s lucky so don\u0027t take it there, Eve is a different monster to tackle. The results of the test are posted below. You\u0027ll also see in this redesign that there\u0027s room for an attachment or docking port on the bottom of the long fuel tank, so you could move the docking port around. If you use the same fuel tank for all 5 engine parts, so the outer 4 and the one in the center, you\u0027ll cut down on the weight and you\u0027ll have more than enough fuel for the job with this same design. You\u0027ll also bring the craft closer to the center of mass which will give you more control.\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226643559320/4890282D26864C8869B3A744E4F3AFAE9F4EE183/\u0022 alt=\u00224890282D26864C8869B3A744E4F3AFAE9F4EE183\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903266226643564297/2F39D00AD2A2C6866E7CFBCA02F5A4944816AB28/\u0022 alt=\u00222F39D00AD2A2C6866E7CFBCA02F5A4944816AB28\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226643568264/190DE64C75443CB2BC9EDBE6252A972E6A39A98D/\u0022 alt=\u0022190DE64C75443CB2BC9EDBE6252A972E6A39A98D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/903266226643573572/4EA8439AA190AD19938C811E60FB473FCE9D6C1D/\u0022 alt=\u00224EA8439AA190AD19938C811E60FB473FCE9D6C1D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am humbled good sir, very humbled indeed. I should be able to reconstruct yours as it seems a bit more wide, I was having an issue with those side mounted thrusters using my design. I tweeked the landing gear config file as they seem seriously soft on all my crafts, but now I may put it back. As for Eve like you said another monster for another day, and I already knew this wouldn\u0027t be enough to get off of there....I am foolish but not that much \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E . Now I feel like I was a pain having you go and do the testing of that, but is very much appreciated.\u003C/p\u003E\u003Cp\u003EOne last question: if I repack the chutes can they be redeployed if they are restaged or no?\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T05:50:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Liowen\u0022 data-cite=\u0022Liowen\u0022\u003E\u003Cdiv\u003EOne last question: if I repack the chutes can they be redeployed if they are restaged or no?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think so, but I\u0027ve had trouble with them redeploying in the past. The best way to do it is to set up an action group for them and in that action group put deploy for all of the parachutes. Then when you go to land, you can either hit the space bar for the stage or you can never hit the stage at all and activate them with the action group. Then they can redeploy easily without failure.\u003C/p\u003E\u003Cp\u003EHere\u0027s the craft file of that lander that\u0027s designed based off of yours if you want it, then you can just tweak it as you need to. I didn\u0027t test the RCS system, but it should work.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0B-vTRL2n8wvzSFZBVm5jczBWS0k/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/file/d/0B-vTRL2n8wvzSFZBVm5jczBWS0k/edit?usp=sharing\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T06:07:19Z\u0022 title=\u002211/27/2013 06:07  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by 700NitroXpress\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2013-11-27T07:33:13Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FwJCzlo.png?1\u0022 alt=\u0022FwJCzlo.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003ESorry for the rover in the front. I don\u0027t take much images and this one was for the rovers thread. Landed with one rover without counter-mass \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI like to use more parachutes which makes no need for engine burn when landing. Asparagus quite fast drops legs and parachutes attached to the outer-side. I would just change Poodle engine to 48-7S.\u003C/p\u003E\u003Cp\u003EJust use it - \u002248-7S\u0022. Somewhat 5x\u002248-7S\u0022 engines will be capable of lifting your lander even in Kerbin and that will weight only 0.5t.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-27T15:59:41Z","Content":"\n\u003Cp\u003ENice rover and ship DrMonte, I have yet to do any type of rover. I made an ugly tug this morning, basically like I figured a probe with fuel and engines. I did put a dish on it though in sandbox mode it really is there to make it look nice. I also just noticed I may need more RCS ports on it too looking at the pictures. The whole thing weighs in at 73 T, this is including the lander being docked on top. I was not sure I needed the struts or not, but safety first. As for docking ports I am not sure the difference honestly between the shielded ones and the unshielded (please don\u0027t say one is shielded and other is not \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E ) If I use an unshielded one with something attached during take off will it be fine? Here are a few pictures of the tug and lander.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img209.imageshack.us/img209/7546/iucq.png\u0022 alt=\u0022iucq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img9.imageshack.us/img9/7143/naaq.png\u0022 alt=\u0022naaq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img13.imageshack.us/img13/8961/vtj5.png\u0022 alt=\u0022vtj5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso I do not know if you can see, but I caught Minimus in the first shot. There are three generators on thetug and well as a big round battery under the probe structure, as well as two big RCS tanks. My idea is this will whole thing, lander included, will remain in orbit around Kerbin and refueling vechiles will go up top it off before its next mission. I feel this will do well for most moon trips, Laythe begin the only exception most likely. Also the tug can detach from this lander and hook on to another one for different missions. Also with having ports on both ends I can put on more tanks if needed for longer missions, unless I design something better later on down the road. Who knows maybe I will do a bus with the Hitchhiker cans, a kind of space tourism bus trip. one thing at a time first though, single mission or duo missions to places first until I get semi better at doing things.\u003C/p\u003E\u003Cp\u003EEdit: My original thinking was that if it could go into an orbit around Kerbin then I would have nothing at all to worry about on Duna as I would most likely have more than enough fuel left over for mistakes that would happen, and while I still think that is true it may have been overkill at the end of the day.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T17:14:51Z\u0022 title=\u002211/27/2013 05:14  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-27T19:14:56Z","Content":"\n\u003Cp\u003EIf you use an unshielded docking port and you have something attached to it, it will tend to sink into the ship and cause explosions unless it\u0027s properly secured. The different in the docking ports is purely cosmetic. I love the shielded ones as long as it\u0027s on the top. You have an excessive amount of RCS on that thing. You only need one of those large tanks, you\u0027ll never use that much RCS fuel. Put one of the huge RCS tanks in the middle. Also put electrical generators on the center transfer stage otherwise it will run out of power while you\u0027re on the surface. Adding a large SAS module to the center is also a good idea. You want single direction RCS ports on the center part as well so you get better maneuverability out of it when docking. With these changes you could also increase the fuel supply of the transfer stage by having 3 of those 1440 capacity tanks. Then I would say that you\u0027d be good to go.\u003C/p\u003E\u003Cp\u003EIt\u0027s always best to have a little more fuel than you think you\u0027ll need. If you add enough fuel to it, you could do multiple landings with the extra fuel. I only used 720 units of liquid fuel to get that lander back into Duna orbit. So 2 landings on Duna in one mission is possible with that fuel loadout.\u003C/p\u003E\u003Cp\u003EIf you have trouble getting it into space, check out my Leviathan super max payload lifter. 250 ton capacity, one size fits all. There\u0027s a video on that thread that shows you how to use it. I also have a smaller version of it that works just as well as this one.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57409-Leviathan-Heavy-Lifter\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/57409-Leviathan-Heavy-Lifter\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-28T02:28:10Z","Content":"\n\u003Cp\u003Ethe RCS tanks I figured more for a refueling as well as the payload ship, but now looking at it it does seem excessive and I will edit in a bit (just got home and need a break). The RCS ports I knew when I put those on I would need more this was just a reference to what the tug may look like, it is always subject to change. If I use the 1440 tanks would I still feed center to engine like I am now or center to outside tanks? That has always been a nagging question, from a design aspect I would think inner to out tanks but the inner to engine set up seems to work as well. I kind of wish there was a slightly bigger pod like this one that could hold 2 Kerbals, the bigger can is just too big in my eyes. As for the cosmetic thing I have to agree, but having the unshielded on the bottom like that hooked to the tug should be fine so long as it is braced, but the one under the decoupler may have and issue or be fine? All this docking stuff is new to me still, but I am learning it as I go. I will check out you lifter as well and see how it works, maybe \u0022steal\u0022 some ideas from it for testing. As for getting into space I had a concept that I tested (using a ship much like the tug that went both to Duna and Eve orbits) but I think a different lifter maybe in order.\u003C/p\u003E\u003Cp\u003EThanks again and hopefully you have a good Thanksgiving tomorrow.\u003C/p\u003E\u003Cp\u003EEdit: There are 3 generators on the craft, but they are clipping badly so they are not really visible (just double checked before editing). Sorry for the size of the pictures I tend to shrink them with imageshack to make them a bit lighter for people to load\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T03:27:56Z\u0022 title=\u002211/28/2013 03:27  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-28T06:19:39Z","Content":"\n\u003Cp\u003EFirst, the docking port on the bottom will be fine as long as it\u0027s braced. For the transfer stage, use the inner tank to feed the outer two tanks and you\u0027ll have plenty of fuel to get to Duna and Back if you use all 1440 capacity tanks. If you want to carry 2 kerbals, then I would suggest putting another can on top of the current one, or put a MK1 pod on top of the can and attach a little parachute to it. Move the battery down below the can and get rid of the docking port on top. The top docking port didn\u0027t make sense to me as to why you had it there to begin with. Now that you have a docking port on the bottom, you don\u0027t need one on the top as well.\u003C/p\u003E\u003Cp\u003EAny of my lifters from Leviathan Engineering will certainly get your craft into orbit with no problem. The key thing to take away from my lifting designs is the use of slack tanks to the inner asparagus stages.\u003C/p\u003E\u003Cp\u003EHere\u0027s a link to my rocket building company on the spacecraft exchange thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58749-Leviathan-Engineering\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/58749-Leviathan-Engineering\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI just added a couple new lifter designs today. For your craft, I would recommend the Ultra Light or the Leviathan MK-II. The Ultra Light should be able to handle it just fine.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-28T06:36:12Z","Content":"\n\u003Cp\u003EWell after much fanfare, and physics per launch breaking things, I finally got the tug and lander up in orbit with a very basic lifter (14 orange tanks double stacked, 6 of those asparagus staged and 7 of the big rocket max engines). That unshielded docking port on the bottom of the tug was just not working so I put 2 on either side of the main fuel tank and left the top one with the lander attached. Now with it 1,000km above Kerbin I noticed something I like on all my ships to have..... lights (ok there are some but I don\u0027t where). I also forgot one important thing this one I do not have a good encounter with Duna on this save \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E that is on my one I do all my videos for \u0026lt;sigh\u0026gt;.\u003C/p\u003E\u003Cp\u003EWell anyways enough of that, here are the pics I took of it in orbit, I would have gotten some of the launch, but I had a hard time getting it to not go boom on the pad. On a sidenote I need to remember to turn off cross feeding while flying the tug as it drains from the lander \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img6/6634/93ob.png\u0022 alt=\u002293ob.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img849/1738/lz0q.png\u0022 alt=\u0022lz0q.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T07:34:51Z\u0022 title=\u002211/28/2013 07:34  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2013-11-28T06:56:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Liowen\u0022 data-cite=\u0022Liowen\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEdit: My original thinking was that if it could go into an orbit around Kerbin then I would have nothing at all to worry about on Duna as I would most likely have more than enough fuel left over for mistakes that would happen, and while I still think that is true it may have been overkill at the end of the day.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy testing runs in similar way. My Duna lander got to Kerbin orbit then I sliced all in twice. Two times less fuel, less engines. Also modification led to ladders on different side of the cockpits door which I noticed only after landing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Good thing that Duna gravity was suitable for jetpack usage.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-28T07:05:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DrMonte\u0022 data-cite=\u0022DrMonte\u0022\u003E\u003Cdiv\u003EMy testing runs in similar way. My Duna lander got to Kerbin orbit then I sliced all in twice. Two times less fuel, less engines. Also modification led to ladders on different side of the cockpits door which I noticed only after landing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Good thing that Duna gravity was suitable for jetpack usage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell me being even more impatient I did a maneuver to go for Duna at 300-ish degrees behind Kerbin and burned the center tank out of fuel.... oh did I mention it is 2 am here and I am playing KSP? LOL It was a 16 minute burn and I need a 38 second correction as I under shot it by a bit. Dang my impatiences anyway.\u003C/p\u003E\u003Cp\u003EEdit: Here is my path I took, I think I took the long way around LOL\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img24.imageshack.us/img24/9813/fhod.png\u0022 alt=\u0022fhod.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T07:35:14Z\u0022 title=\u002211/28/2013 07:35  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2013-11-28T07:15:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Liowen\u0022 data-cite=\u0022Liowen\u0022\u003E\u003Cdiv\u003EWell me being even more impatient I did a maneuver to go for Duna at 300-ish degrees behind Kerbin and burned the center tank out of fuel.... oh did I mention it is 2 am here and I am playing KSP? LOL It was a 16 minute burn and I need a 38 second correction as I under shot it by a bit. Dang my impatiences anyway.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood for you. Here is 9 a.m. and I\u0027m at work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"}]}