{"TopicId":54896,"ForumId":16,"TopicTitle":"Tutorials or help with my heavy lifters? Stuck :(","CreatedByName":"Neshma","CreatedById":93751,"CreatedDateTime":"2013-12-01T16:14:15Z","PageNum":1,"Articles":[{"CreatedByName":"Neshma","CreatedById":93751,"CreatedDateTime":"2013-12-01T16:14:15Z","Content":"\n\u003Cp\u003EHi everyone,\u003C/p\u003E\u003Cp\u003ESo Ive gotten to the mun and back, ive put up small craft, a heliocentric satellite, even shot a satellite or two to other planets.\u003C/p\u003E\u003Cp\u003EIm really stuck with heavy lift. I\u0027ve been experimenting with various designs for heavy lifters, even trying to emulate factors from other peoples designs (playing career mode second last tier so skippers and the silver half orange tanks).\u003C/p\u003E\u003Cp\u003EIm using kerbal engineer so I can get an idea of delta V, ISP, TWR etc. Also im noticing the need to delay my gravity turns later than 10k, so im watching the apoapsis rise then when time to apoapsis hits 30secs im turning. Turning earlier seems to often mean my power isnt high enough, I catch up with the apoapsis and end up with a water landing. as suggested by scott manley im trying ot measure it by keep my apoapsis around 30-40secs (not sure if im bunging this up).\u003C/p\u003E\u003Cp\u003EFirst I was just wondering if there were any suggestions out there on tutorials for advanced rocket design. Second I thought i\u0027d post photos of my rockets and see if you can spot the problems. Here is my planned interplanetary manned survey craft atop each of my current \u0022heavy\u0022 lift designs. The first one is my oldest (hence...well just look at it) and the last is my newest. The survey craft weighs in at 57tonnes.\u003C/p\u003E\u003Cp\u003EThey all fly perfectly well (no disintegrations) thought I did go crazy on the struts. Its power or perhaps flight path which seems to be my problem. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.aiahome.com/ctf/pics/KSPscreenies/screenshot221.png\u0022 rel=\u0022external nofollow\u0022\u003EHeavy Lift - 1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.aiahome.com/ctf/pics/KSPscreenies/screenshot220.png\u0022 rel=\u0022external nofollow\u0022\u003EHeavy Lift - 2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.aiahome.com/ctf/pics/KSPscreenies/screenshot219.png\u0022 rel=\u0022external nofollow\u0022\u003EHeavy Lift - 3\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAny help would be great thanks guys. I\u0027d really like to shoot off this survey craft and proceed onto a fuel tanker, space station and other such heavy lift requiring vehicles.\u003C/p\u003E\u003Cp\u003ENesh\u003C/p\u003E\n"},{"CreatedByName":"panzerknoef","CreatedById":90599,"CreatedDateTime":"2013-12-01T16:29:36Z","Content":"\n\u003Cp\u003EThat lifter is waaaayyy to complicated, use aspargus instead, mine can get about 100t into orbit. Link to wiki: \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:Asparagus_Staging\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Tutorial:Asparagus_Staging\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lockes","CreatedById":95087,"CreatedDateTime":"2013-12-01T16:36:50Z","Content":"\n\u003Cp\u003EThe center of mass is not in the middle of your rocket. There are too many parts that are making the mass uneven. Try builder a simpler launcher that uses only about 30 parts.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-01T16:46:57Z","Content":"\n\u003Cp\u003EFor the second and third one I would get rid of those smaller tanks and run two of those half large tanks off of the main tank and eliminate the decoupling ring, unless you are planning on landing that one. If you have a way to share the .craft file I could test it and see if maybe a slower gravity turn might be needed, I found sometimes doing them too fast with bigger lifters will cause it to not make it into orbit. If you cannot share the .craft for whatever reason I will try and build it in sandbox mode off of what I see here, just let me know and I will help the best I can. To be honest I feel your second one would be fine with asparagus staging and the changes I mentioned to get into a decent orbit, but I would need to try it a few times to see.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T16:49:23Z\u0022 title=\u002212/01/2013 04:49  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-01T16:56:07Z","Content":"\n\u003Cp\u003EKeep in mind you\u0027ll need around 4,500 m/s to get a decent orbit. Use asparagus. Keep thrust to weight above 1.4 and below 2.2. I find a slow turn from around 12,000m works well. Don\u0027t aim below 45 degrees until you\u0027re going over 500m/s. Get apoapsis above 70,000 and coast to around 50 seconds before you hit it and then burn horizontal as hard as possible until the apo and peri swing round. Hit x. Badda boom badda bing.\u003C/p\u003E\u003Cp\u003EWith all that in mind and looking at your screenshot I\u0027d say you don\u0027t have enough thrust to weight in the last 4 stages or so. You\u0027re losing too much to gravity. Lose one of the nukes to save weight. 2 is more than enough. Bit less fuel and some little tweaks and it will do fine. All your lifter stages should be 1.3-4 minimum.\u003C/p\u003E\u003Cp\u003EHere\u0027s a shot of my mum return ship. Check the thrust to weights. Works a treat. Good luck.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/684841102021768347/4496CD5F4FBBBE6BD205A36A74539EFBFABA87E1/\u0022 alt=\u00224496CD5F4FBBBE6BD205A36A74539EFBFABA87E1\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T17:07:12Z\u0022 title=\u002212/01/2013 05:07  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Monkeh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-12-01T17:25:08Z","Content":"\n\u003Cp\u003EYour TWR is waaaay too low. Aim for ~1.7 on the readouts and that will serve you well (that should make it fluctuate between 1.7-2.2). At least do this for the first 3500m/s, that last 1000m/s can be lower (\u0026gt;0.8 should be okay).\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2013-12-01T17:26:04Z","Content":"\n\u003Cp\u003ESome things that come to mind.\u003C/p\u003E\u003Cp\u003Ea) Forget about boosters. When talking about heavy lifters, from the dV perspective you\u0027ll gain 100-300 m/s dV which is nothing. From a TWR perspective your rocket should be able to push a big payload all the way to the Ap so needing help at the beginning might indicate that your main stack lacks power.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Asparagus is your friend and remember that there are higher symmetry values than 6x!\u003C/p\u003E\u003Cp\u003Ec) Keep it simple. A heavy lifter gets very big, very complicated VERY easily. Keeping simplicity in mind helps mitigate that somehow.\u003C/p\u003E\u003Cp\u003Ed) Better fat than tall. Build outwards and not upwards. After all, you\u0027ll have to put a payload on top.\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-12-01T18:24:34Z","Content":"\n\u003Cp\u003EI love my Leviathan lifters, gets 200 tons of payload or more to orbit depending on the design and uses slack tank asparagus staging to regular asparagus staging.\u003C/p\u003E\u003Cp\u003EEverything you need to know can be found here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57409-Leviathan-Heavy-Lifter\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/57409-Leviathan-Heavy-Lifter\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-12-01T19:31:34Z","Content":"\n\u003Cp\u003EI made a tutorial on this, but the launcher is not as \u0022heavy\u0022 as most of the things I see here.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/CM2rt_klOvc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2013-12-01T20:02:56Z","Content":"\n\u003Cp\u003EAt casual glance, you\u0027re trying to lift too much, and you\u0027re sacrificing your TWR for dV with all that fuel. If this thing\u0027s just meant to get your payload into orbit, you can do it with less gas, larger engines (I\u0027m assuming you\u0027ve unlocked them, I apologize if you didn\u0027t yet), and maybe 2/3rd\u0027s that cargo you\u0027re trying to lift.\u003C/p\u003E\u003Cp\u003Eedit: And you\u0027d gain a hefty amount of TWR by using \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:Asparagus_Staging\u0022 rel=\u0022external nofollow\u0022\u003Easparagus staging\u003C/a\u003E. I pretty much haven\u0027t built a lifter that doesn\u0027t use it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T20:05:58Z\u0022 title=\u002212/01/2013 08:05  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Franklin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-12-01T22:25:18Z","Content":"\n\u003Cp\u003EGeez, never seen a question thread with so much misinformation.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThat lifter is waaaayyy to complicated\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA central column and two rings is hardly what I\u0027d call a complicated lifter.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe center of mass is not in the middle of your rocket.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes it is.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHere\u0027s a shot of my mum return ship\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy show a ship that uses modded parts?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYour TWR is waaaay too low\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA TWR lower than 1.7 at liftoff is entirely reasonable for super heavy lifts (granted that the OP\u0027s launch is not a super heavy lift).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EForget about boosters.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t forget about the boosters.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E Asparagus is your friend and remember that there are higher symmetry values than 6x! ... c) Keep it simple.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is somewhat self contradictory.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI made a tutorial on this\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWatch this OP (you probably already have). \u0027Tis a good tutorial.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T22:28:43Z\u0022 title=\u002212/01/2013 10:28  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-01T22:53:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhy show a ship that uses modded parts?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only modded parts on view there are some lights and the fairings. I\u0027m pretty sure those, combined with a little KerbPaint, won\u0027t change the relevance of the engineer readout showing the thrust to weights of a successful ship\u0027s stages. It also shows that before the 0.55 TWr nukes come into play, I\u0027ll be in orbit, as the other stages have over 4,500 m/s combined.\u003C/p\u003E\u003Cp\u003EI hereby conclude the picture is relevant and helpful. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-12-01T23:10:45Z","Content":"\n\u003Cp\u003EAh, because of the fairing I thought those tanks were mod tanks not kerbpaint tanks. I retract my statement.\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2013-12-01T23:14:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis is somewhat self contradictory.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat I mean is, considering that the thing is going to grow FAST, try to make the simplest design you can think of. You\u0027ll fail to do anything simple and pretty, but you won\u0027t end up with a 1000 parts monstrosity.\u003C/p\u003E\u003Cp\u003EAnd I maintain it, I don\u0027t see the point in boosters for heavy lifters. If you have a 1400 ton beast with a TRW of 0.9, and you add some boosters to get to, say 1.8, after the fist kilometer your boosters run out and you\u0027re done. You\u0027re better off rethinking the design and replacing the boosters with fuel tanks \u002B engines.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-12-01T23:23:44Z","Content":"\n\u003Cp\u003EIf TWR is low in the lower stages, you have trouble accelerating in the first part of the flight, obviously. The reason why this is bad it is bad is because you then waste fuel fighting gravity for a long time while you should be trying to get out of the atmosphere as fast as possible. Ideally you should be flying at the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Kerbin\u0022 rel=\u0022external nofollow\u0022\u003Eterminal velocity\u003C/a\u003E (look at the table under paragraph atmosphere). So what you basically should be doing is adjusting your design so it flies at the terminal velocity at each point of the flight.\u003C/p\u003E\u003Cp\u003EYou mentioning your power not being high enough when making your gravity turn would fit well with to little acceleration in the early stages of the flight. \u003C/p\u003E\u003Cp\u003EMy advice would be to start with \u0022Heavy Lift - 1\u0022. It seems the best design at first glance. \u003C/p\u003E\u003Cp\u003E-Change it so the central engine is activated at launch this will increase the thrust in early stage.\u003C/p\u003E\u003Cp\u003E-Replace the Skippers on the outer stages with quadcoupler with four LV-T30 engines on each. (If you don\u0027t have quadcoupler you can make one by using three bicouplers) It will again increase thrust so you waste less time and fuel muddling around in the atmosphere.\u003C/p\u003E\u003Cp\u003E-Try removing the fuel lines. See if that improves the profile. It would seem these fuel lines would cause the central stage to be very heavy for that one skipper underneath once you drop all the outer tanks.\u003C/p\u003E\n"},{"CreatedByName":"Jim DiGriz","CreatedById":92465,"CreatedDateTime":"2013-12-01T23:41:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Neshma\u0022 data-cite=\u0022Neshma\u0022\u003E\u003Cdiv\u003EHi everyone,\u003Cp\u003ESo Ive gotten to the mun and back, ive put up small craft, a heliocentric satellite, even shot a satellite or two to other planets.\u003C/p\u003E\u003Cp\u003EIm really stuck with heavy lift. I\u0027ve been experimenting with various designs for heavy lifters, even trying to emulate factors from other peoples designs (playing career mode second last tier so skippers and the silver half orange tanks).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you\u0027re just trying to lift too much with the skippers, you\u0027d need mainsails, and maybe a bit more fuel for them. I built something very similar to your heavy-lift-1 design at the same point in the science tree, only it was 9 skippers on the bottom, with the outer 8 asparagus staged, and I used the TT-70 radial decouplers with girder segments on them to git some breathing room between the stages. Then only put one \u0022half-orange\u0022 tank on top of the middle skipper. Then start adding payload in the middle until you\u0027re just about completely burning all your lifter stages to get the payload into circularized LKO -- then you are more or less done with the capacity of the lifter that you designed. Mostly you\u0027ll want to get some mainsails to up the TWR in order to boost more into orbit. You probably don\u0027t want to add a lot of LV-Ns like that as well, since they\u0027re heavy. The idea is get enough big engines to get your LVN stage into orbit and then use it. If you\u0027re building a landing craft you also don\u0027t want to use the LVNs to try to land anywhere with significant gravity, you\u0027ll want a detachable lander stage that flies down and returns and then re-docks to the LVN for the transfer home (if you get large enough you can start needing more LVNs in order to just do interplanetary burns, but you\u0027re not there yet).\u003C/p\u003E\u003Cp\u003E(well, actually you can probably stack a couple more half-tanks in the middle above the final skipper and use that for your circularization burn, but after awhile you\u0027ll get diminishing returns, and you\u0027ll start falling back to kerbin before you can burn all your fuel and circularize)\u003C/p\u003E\u003Cp\u003EEDIT: BTW, I don\u0027t think you need to go nuts with the mainsails, if you convert the inner engine to mainsail you\u0027ll probably have enough TWR throughout the whole ascent to circularize, you should be able to lift a whole lot more if you asparagus stage a bunch of mainsails.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T04:01:27Z\u0022 title=\u002212/02/2013 04:01  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by Jim DiGriz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nao","CreatedById":23462,"CreatedDateTime":"2013-12-02T04:11:37Z","Content":"\n\u003Cp\u003E@ Jim DiGriz There is nothing wrong with skippers. Mainsails are great but unless your rocket needs a lot of them (\u0026gt;~7) them its just as easy using skippers with more outer stages.\u003C/p\u003E\u003Cp\u003E@ OP \u003C/p\u003E\u003Cp\u003EYour crafts are actually quite good, just a little underpowered. Try to use a little more TWR (target 1,4-1,6 TWR). Also asparagus staging for low TWR rockets is actually hurting you. For example, in your 3rd rocket , if you remove the first asparagus staging (fuel the center tank from all 8 surrounding stacks and decouple them at the same time) you can gain something like 15-20t of fuel in orbit (500m/s more dv on skippers) and have much easier ascent. Good TWR matters the most during the gravity turn in ascents and not decoupling the outer engines gives much needed punch there, so even thou your craft has less dV it requires much less of it to get to orbit.\u003C/p\u003E\u003Cp\u003EAlso contrary to popular belief asparagus staging for the ascent portion of flight gives only up to 10% more efficiency.\u003C/p\u003E\u003Cp\u003EIn general i would recommend a setup where first stage are the boosters, second long burn stage of skippers starting from 1,3-1,4 TWR up to 2,7 or something that get you to ~1000m/s and then a orbital insertion stage of 0,5-0,8 TWR.\u003C/p\u003E\u003Cp\u003ETry removing one X200-32 from each of 7 stacks in craft 2, add fuel feed for center stack from outer ones, and you have a great ascent vehicle, that should reach orbit and have one X200-32 left full for orbital maneuvers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T04:14:52Z\u0022 title=\u002212/02/2013 04:14  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by Nao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-12-02T08:34:01Z","Content":"\n\u003Cp\u003EFew threads here that might help...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/48641-Ways-to-lift-a-lot-of-fuel-to-orbit\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/48641-Ways-to-lift-a-lot-of-fuel-to-orbit\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59032-Help-with-massive-launcher\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/59032-Help-with-massive-launcher\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/51828-What-s-the-highest-mass-you-ve-ever-put-into-Kerbin-orbit-with-a-single-ship\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/51828-What-s-the-highest-mass-you-ve-ever-put-into-Kerbin-orbit-with-a-single-ship\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere a design floating around called a Thrust Plate, which is worth looking into.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jim DiGriz\u0022 data-cite=\u0022Jim DiGriz\u0022\u003E\u003Cdiv\u003EI think you\u0027re just trying to lift too much with the skippers, you\u0027d need mainsails, ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot really... Building a massive lifter with Skippers is actually quite sensible. The lower thrust helps cuts down on the forces at play, reducing chances of a break. A big wide rocket made of Skippers with a single Jumbo on each has enough TWR to work well.\u003C/p\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-12-03T00:19:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EA TWR lower than 1.7 at liftoff is entirely reasonable for super heavy lifts (granted that the OP\u0027s launch is not a super heavy lift).\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem with low TWRs is that to get to orbit with low TWRs requires extra dV. Getting extra dV costs extra fuel, which requires more mass and parts. This requires more struts, which further increases partcount. For large launchers, mass is bad because it increases joint stresses, leading to Rapid Unplanned Disassembly. Additionally, it increases partcount, which increases lag and personal suffering.\u003C/p\u003E\u003Cp\u003ESo low TWRs can actually make things much harder in many cases.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-12-03T02:38:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arq\u0022 data-cite=\u0022arq\u0022\u003E\u003Cdiv\u003EThe problem with low TWRs is that to get to orbit with low TWRs requires extra dV. Getting extra dV costs extra fuel, which requires more mass and parts. This requires more struts, which further increases partcount. For large launchers, mass is bad because it increases joint stresses, leading to Rapid Unplanned Disassembly. Additionally, it increases partcount, which increases lag and personal suffering.\u003Cp\u003ESo low TWRs can actually make things much harder in many cases.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll true. And yet a TWR lower than 1.7, even down to around 1.2 or 1.3, is still entirely reasonable for super heavy lifts.\u003C/p\u003E\u003Cp\u003EHOW CAN THIS BE?\u003C/p\u003E\u003Cp\u003EBecause as you use up your fuel your TWR will increase, as long as you have most of your power in your later stages. In other words, the first columns you drop may only have skippers, or LVT30\u0027s, or even no engine at all. Perhaps just some SRB\u0027s to provide lift while the columns still have a lot of fuel in them (hence \u0022don\u0027t forget about the SRB\u0027s). \u003C/p\u003E\u003Cp\u003EThe first columns you drop are the most likely to fail since they are the ones furthest away from the mass you are lifting, and are therefore the ones creating the largest shear stresses. Adding big engines like mainsails to these columns in order to keep your TWR up puts too much strain on areas too far from the payload.\u003C/p\u003E\n"},{"CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2013-12-03T02:46:20Z","Content":"\n\u003Cp\u003EJust use simple asparagus staging as said above. It can lift a little over 100 tons.\u003C/p\u003E\n"},{"CreatedByName":"Nao","CreatedById":23462,"CreatedDateTime":"2013-12-03T04:10:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arq\u0022 data-cite=\u0022arq\u0022\u003E\u003Cdiv\u003EThe problem with low TWRs is that to get to orbit with low TWRs requires extra dV. Getting extra dV costs extra fuel, which requires more mass and parts. This requires more struts, which further increases partcount. For large launchers, mass is bad because it increases joint stresses, leading to Rapid Unplanned Disassembly. Additionally, it increases partcount, which increases lag and personal suffering.\u003Cp\u003ESo low TWRs can actually make things much harder in many cases.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E Wait, you say that to get a given payload to orbit, using heavy, low TWR craft it will be bad because stress will require more struts. But what happens when we use 1.7 TWR craft for the same payload? Not only does it weight almost the same (if not more!) because of added engine weight, but it has more acceleration actually increasing the stress forces. (If you don\u0027t believe a TWR 1.4 ship can be lighter than 1.7, try beating \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55615-Payload-Fraction-Challenge?p=770578\u0026amp;viewfull=1#post770578\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E using 3 stages and rules from the challenge. It even doesn\u0027t use asparagus staging as a handicap.)\u003Cp\u003EHonestly, for me at least, launching 1.3-1.4 TWR crafts powered by many mainsails requires quite low strut count, like 2-3 per mainsail can be enough.\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2013-12-03T04:19:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003E[...](hence \u0022don\u0027t forget about the SRB\u0027s). [...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually I made some tests, and I stand corrected. DO include SRBs in your design, as long as you include a lot of them. Enough to be left with a 1.2-2 TRW when they run out.\u003C/p\u003E\n"},{"CreatedByName":"Col_Jessep","CreatedById":4071,"CreatedDateTime":"2013-12-03T04:44:25Z","Content":"\n\u003Cp\u003EHmm, I see your problem. You don\u0027t have thrust for the fuel you need without Mainsail engines. And you are not using any fuel lines to pimp your rocket. Thankfully that\u0027s easy to fix!\u003C/p\u003E\u003Cp\u003ELet\u0027s begin with the engines:\u003C/p\u003E\u003Cp\u003EYou can attach more than one engine to your fuel tank and if you need a heavy lifter early in the tech tree you will have to cut a few corners:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4362XgJ.jpg\u0022 alt=\u00224362XgJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou probably don\u0027t have those little cubic octagonal struts unlocked yet but there is another way:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/igQdmhc.jpg\u0022 alt=\u0022igQdmhc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUse the \u0027Tail Connector\u0027 form the Aerodynamic tab and press the W key once. Now you can attach it to the 2.5m tanks and stick rocket engines on it. With 6x LV-T30 and one LV-T45 in the middle you got 1490kN thrust compared to the Mansail\u0027s 1500. The whole setup is slightly heavier than the Mainsail but it will certainly get you into orbit!\u003C/p\u003E\u003Cp\u003EIf this is not to your liking you can use radial mounted Rockomax Mark 55s to buff your center engine:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IvsY4dj.jpg\u0022 alt=\u0022IvsY4dj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENone of the above solutions require part clipping but you will have to nudge some of them into place with some patience occasionally. You know how it is... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EOther than that you can use Asparagus Staging like suggested or use fuel lines to transfer fuel from the outer tanks to the center tank. It\u0027s not necessary though. Here are two examples:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dLb2x5Q.jpg\u0022 alt=\u0022dLb2x5Q.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is a 80 ton lifter without use of fuel lines. Yes, the part count and engine number will probably lag a bit but it works fine otherwise.\u003C/p\u003E\u003Cp\u003EAnd now for the big finale:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d57fEJ9.jpg\u0022 alt=\u0022d57fEJ9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeet my \u003Cstrong\u003EInsanity Mark 14\u003C/strong\u003E. As you can see she has 14,500 delta-V. The twist is that she is build from parts of the first 3 tech levels. (\u002Bsolar panels because I\u0027m not that insane...)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-03T04:57:44Z\u0022 title=\u002212/03/2013 04:57  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 3, 2013\u003C/time\u003E by Col_Jessep\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-12-03T06:07:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rosco P. Coltrane\u0022 data-cite=\u0022Rosco P. Coltrane\u0022\u003E\u003Cdiv\u003EActually I made some tests, and I stand corrected. DO include SRBs in your design, as long as you include a lot of them. Enough to be left with a 1.2-2 TRW when they run out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe deal with SRB\u0027s is that they provide excellent thrust to weight at the cost of efficiency, and they run out pretty fast. \u003C/p\u003E\u003Cp\u003EThis makes them ideal candidates to help lift your fuel-filled \u0022bonus\u0022 columns off the pad at launch. As you consume the fuel in the columns they will get lighter, so your TWR rises. Ideally your SRB\u0027s will run out shortly before the column empties, since this keeps shear stresses to a minimum. \u003C/p\u003E\u003Cp\u003EIf you had stuck a big engine at the bottom of the column instead of an SRB then that engine would still be providing full thrust just as the column runs out of fuel, at which point the TWR of that column would be huge relative to the rest of the rocket, and is a primary cause of structural failure with asparagus rockets.\u003C/p\u003E\n"}]}