{"TopicId":54929,"ForumId":32,"TopicTitle":"What makes this game fun","CreatedByName":"snowlion","CreatedById":95048,"CreatedDateTime":"2013-12-02T00:16:58Z","PageNum":1,"Articles":[{"CreatedByName":"snowlion","CreatedById":95048,"CreatedDateTime":"2013-12-02T00:16:58Z","Content":"\n\u003Cp\u003EWhat Makes Ksp fun. This post is all off of opinion, I\u0027m not saying its bad just what do you think makes it fun? Oh you want my opinion? I like that fact that it has high quality Aerodynamics and space flight.\u003C/p\u003E\u003Cp\u003E-SL:cool:\u003C/p\u003E\n"},{"CreatedByName":"Force21","CreatedById":14852,"CreatedDateTime":"2013-12-02T00:29:26Z","Content":"\n\u003Cp\u003ESPAAAAACE! Oh and being able to set my own challenges in different space programs.\u003C/p\u003E\n"},{"CreatedByName":"Xyd","CreatedById":73520,"CreatedDateTime":"2013-12-02T00:33:26Z","Content":"\n\u003Cp\u003EScience, exploration, building my own designs, career mode and financial management (mod).\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-12-02T00:43:48Z","Content":"\n\u003Cp\u003ETo me the best part is how everything you build has significance in some form or fashion. While it\u0027s pretty to make a castle in Minecraft or something, I get so much more satisfaction out of this game knowing that every piece of my ship has a role and affects how my mission will turn out. \u003C/p\u003E\u003Cp\u003EAll that coupled with the great physics emulation, the 100% open world (or worlds, shall I say? you get a whole freakin\u0027 solar system to play with!), and the real-world knowledge that you discover and learn along the way, you end up with one of the most satisfying gaming experiences I know of.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T00:46:53Z\u0022 title=\u002212/02/2013 12:46  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by FenrirWolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bobcook","CreatedById":73597,"CreatedDateTime":"2013-12-02T00:45:13Z","Content":"\n\u003Cp\u003EDecent simulation of spaceflight. Lots of flexibility for crazy rockets, space planes, etc. Landings and flybys of the various planets and moons. Great community and lots of high quality mods.\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2013-12-02T00:58:53Z","Content":"\n\u003Cp\u003EWhat makes KSP fun is the steep learning curve. I am a Space-Enthusiast but before KSP I did know almost nothing about Space Mechanics.\u003C/p\u003E\u003Cp\u003EToday I am fiddeling out my Apoapsis, Periapses, Closest approaches and Gravitational-Brake Maneuvers (Thanks to Tanuki \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ).\u003C/p\u003E\u003Cp\u003EWhat also tributes to it, is that you are completely free to unfold your creativity what to do, how to do it, when to do it without any restrictions at all.\u003C/p\u003E\u003Cp\u003EBut the biggest advantage is the following:\u003C/p\u003E\u003Cp\u003EEXPLOSIONS!!! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-02T02:44:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhat makes KSP fun is the steep learning curve. \u003C/div\u003E\u003C/blockquote\u003EYeah, they didn\u0027t dumb it down. You have to put some thought and effort into making things happen.\n"},{"CreatedByName":"canuckster","CreatedById":95193,"CreatedDateTime":"2013-12-02T02:48:43Z","Content":"\n\u003Cp\u003EIt\u0027s easily the most boring game I\u0027ve ever played, that being said it\u0027s also the most rewarding, if that makes sense. I love it. I\u0027ve played more hours on KSP than the rest of my Steam games combined, I guess that says something.\u003C/p\u003E\n"},{"CreatedByName":"Jon Tash","CreatedById":2681,"CreatedDateTime":"2013-12-02T02:53:47Z","Content":"\n\u003Cp\u003EWhat Makes Ksp fun? Building, space, building, space, space and... Oh have I told you space? And building too of course? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-12-02T03:22:18Z","Content":"\n\u003Cp\u003EThe big thing for me (and this is on a very technical level so I understand if most don\u0027t agree) is that it does not rely on the randomizer to keep things interesting. One of the biggest flaws in game design has always been the over-reliance on randomly generated numbers to effectively determine whether or not the player is going to get to have fun. Some genres more than others (RPGs especially) have been painfully prone to what I call \u0022randomizer abuse\u0022, but you\u0027d be hard-pressed to find \u003Cem\u003Eany\u003C/em\u003E genre where a simulated roll of the dice hasn\u0027t been at the core of at least one game in the genre\u0027s core mechanics. That KSP almost completely eliminates the randomizer from the equation, relying instead on a very elaborate system which instead features a multitude of variables which can actually be accounted for and counted on, is a huge breath of fresh air for me.\u003C/p\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2013-12-02T03:28:56Z","Content":"\n\u003Cp\u003EProbably the just the satisfaction of doing every step of a mission, from pre-planning to building to testing to flying. Knowing that everything works (or doesn\u0027t) because of design choices you made.\u003C/p\u003E\u003Cp\u003EAlso, the contrast of the goofy Kerbals with realistic tech and physics.\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-12-02T03:46:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EThe big thing for me (and this is on a very technical level so I understand if most don\u0027t agree) is that it does not rely on the randomizer to keep things interesting. One of the biggest flaws in game design has always been the over-reliance on randomly generated numbers to effectively determine whether or not the player is going to get to have fun. Some genres more than others (RPGs especially) have been painfully prone to what I call \u0022randomizer abuse\u0022, but you\u0027d be hard-pressed to find \u003Cem\u003Eany\u003C/em\u003E genre where a simulated roll of the dice hasn\u0027t been at the core of at least one game in the genre\u0027s core mechanics. That KSP almost completely eliminates the randomizer from the equation, relying instead on a very elaborate system which instead features a multitude of variables which can actually be accounted for and counted on, is a huge breath of fresh air for me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is another very good answer. All the variety in the game comes from a complicated set of interactions but ultimately, each one of them is predictable and able to be harnessed in controlled ways. Even things that seem lucky or random come from a sound principle instead of a fortunate crit roll.\u003C/p\u003E\n"},{"CreatedByName":"panfish5","CreatedById":74937,"CreatedDateTime":"2013-12-02T03:50:14Z","Content":"\n\u003Cp\u003EI like it because unlike other games you need some real smarts to play this game. Other games seem much easier and anyone can play them. I also love how you get to design everything to make it work as this is probably my favorite part of the game. There are just too many reasons that makes it an awesome games its impossible to list them all.\u003C/p\u003E\n"},{"CreatedByName":"larsmaehlum","CreatedById":51566,"CreatedDateTime":"2013-12-02T10:16:08Z","Content":"\n\u003Cp\u003EThe game makes you think, and you need some patience and determination to do well. Also, tons of really cool mods!\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-12-02T10:23:30Z","Content":"\n\u003Cp\u003EIt\u0027s the constant plotting and scheming, then seeing if the plan eventually works.\u003C/p\u003E\u003Cp\u003EI spend most of my days daydreaming about possible missions and possible spacecraft designs and just going nuts planning it all.\u003C/p\u003E\n"},{"CreatedByName":"3mon","CreatedById":83138,"CreatedDateTime":"2013-12-02T10:30:55Z","Content":"\n\u003Cp\u003EFor me, its that sense of acomplishment you get when your carefully planned and built mission finally gets to its objective (after several explosio... erhmm controlled failure tests \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-02T10:35:29Z","Content":"\n\u003Cp\u003EThe fun for me comes from the sense of achievement and beating the heartless bitch that is gravity. I\u0027ve also enjoyed learning about rocket science as well.\u003C/p\u003E\n"},{"CreatedByName":"Floule","CreatedById":82840,"CreatedDateTime":"2013-12-02T10:46:32Z","Content":"\n\u003Cp\u003EFor me, it\u0027s fun because you must think about how you will make your rocket. Then you build it, test it and go for it. And then, after repeating these steps maybe 10 times or maybe not at all, the enjoyment when the mission is successful.\u003C/p\u003E\u003Cp\u003EAnd you can do whatever you want. You won\u0027t have a big marker that says \u0022do this and go there\u0022. It\u0027s about experience!\u003C/p\u003E\u003Cp\u003EAnd of course, the brilliant community. Otherwise i wouldn\u0027t write this right now.\u003C/p\u003E\n"},{"CreatedByName":"Danish_Savage","CreatedById":49194,"CreatedDateTime":"2013-12-02T12:17:26Z","Content":"\n\u003Cp\u003ESorry but.. SPAAAAAAAAAAAAAAAAAAAAAAAACE\u003C/p\u003E\u003Cp\u003ESeriously, the look is astonishing. Also the plotting, and the feeling of having your soul gutted when you lose a lil\u0027 green guy.\u003C/p\u003E\n"},{"CreatedByName":"TUFOM","CreatedById":83820,"CreatedDateTime":"2013-12-02T13:04:32Z","Content":"\n\u003Cp\u003EFor real I have been looking years for game where one can be charge of own space program. When asteroids, mining \u0026amp; probably industry comes to game it would be perfect (at least mods?). Kethane does part of this but I want minerals to be about money not fuel. More detail more biomes, asteroids... new planets would be very nice. But 250 hours in under month, it tels something about this game. Dream, build, fly! =)\u003C/p\u003E\n"},{"CreatedByName":"jduchock","CreatedById":82906,"CreatedDateTime":"2013-12-02T13:59:09Z","Content":"\n\u003Cp\u003Ethe never ending desire to start over...\u003C/p\u003E\u003Cp\u003Ereally, i find myself starting over trying new trees all the time. And with what seems to be an endless supply of mods, it never really seems to get old.\u003C/p\u003E\u003Cp\u003EI am eagerly (but patiently) awaiting colonization prospects and with the BioFuels mod ramping up once again, it might become a possibility soon !\u003C/p\u003E\u003Cp\u003EThe major downfall i have had is my insatiable desire to poke around in stuff...and as a result, learned how to edit part configuration and save game files...which makes it too easy for me to cheat. i am hoping that configuration files become part of .DAT or other file structure thereby making it harder to fudge values\u003C/p\u003E\n"},{"CreatedByName":"Stranded","CreatedById":90919,"CreatedDateTime":"2013-12-02T14:13:46Z","Content":"\n\u003Cp\u003EThe reward. Plus the spectacular views. One of the things about our space program for me has always been the amazing views, pictures and videos. Even on my old laptop I still sit back after scrolling the view around and see the craft I just built and put into orbit and am just stunned by the image.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2013-12-02T18:54:19Z","Content":"\n\u003Cp\u003EProbably the sound fundamentals behind making a space-based game that uses 0% random chance to screw you over. That, and launching completely insane designs that should never be considered, let alone built and shot down the runway. And the fact that it\u0027s highly rewarding. Everything from your first successful flight where no Kerbals die, to your first orbit, your first Mun flyby, your first landing on some other world, that first VTOL airplane you made for fun, and your first SSTO just all combine to make the game highly rewarding and keep you playing for hours.\u003C/p\u003E\n"},{"CreatedByName":"95tiger59","CreatedById":92346,"CreatedDateTime":"2013-12-02T20:08:19Z","Content":"\n\u003Cp\u003Ethis game is fun for me because everyone when they are little dreams of going to space but few actually try as society seems to push it off as less then 1% which is true but its because less than 1% try to reach their goals and this game lets me experience what space would be like to almost act out my dreams when I was younger\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-12-02T20:53:47Z","Content":"\n\u003Cp\u003EI finally get to fly all those Lego spaceships I built as a kid. How can that \u003Cem\u003Enot\u003C/em\u003E be fun? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"}]}