{"TopicId":54993,"ForumId":16,"TopicTitle":"LSO (Laythe Synchronous orbit)","CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-12-02T17:52:11Z","PageNum":1,"Articles":[{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-12-02T17:52:11Z","Content":"\n\u003Cp\u003ESo I\u0027ve decided to do a long term mission to Laythe (because I can) and I\u0027m having trouble setting up my COMSAT network (RP purposes only) in an equatorial semi-synchronous orbit around Laythe (since true synchronous orbit is outside it\u0027s SOI. \u003C/p\u003E\u003Cp\u003ENow, I\u0027ve got my sattelites in orbit, but I want them to be exact (only done with save file editing) and I was curious what I would need to change so that they are in a semi-synchronous equitorial orbit 90 degrees apart?\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-12-02T18:43:44Z","Content":"\n\u003Cp\u003EHigher orbits are slower (longer orbital periods) than lower orbits. So all you need to do is raise your Ap to \u0022fall back\u0022 or lower your Pe to \u0022jump ahead\u0022 relative to another object. Doesn\u0027t need to be much if you\u0027re patient and willing to wait many orbits.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-12-02T19:31:10Z","Content":"\n\u003Cp\u003EPlace your first satellite in the desired orbit. Have your second satellite in a different (higher or lower) orbit.\u003C/p\u003E\u003Cp\u003ETarget the first satellite then rendezvous with a point 90 degrees ahead of the first. Repeat.\u003C/p\u003E\u003Cp\u003EIt\u0027s what I\u0027ve done for all my remotetech set-ups. Only hard part comes when doing long interplanetary missions, since the satellites aren\u0027t perfectly aligned they tend to drift a bit, but that\u0027s only noticeable after many months if you do it right.\u003C/p\u003E\n"},{"CreatedByName":"UH60guy","CreatedById":77959,"CreatedDateTime":"2013-12-02T20:30:53Z","Content":"\n\u003Cp\u003EIf you can\u0027t do exact, or don\u0027t want to, consider Molniya orbits- basically a series of satellites with high apoapses and low periapses that give you long loiter times as they\u0027re high up, and cost a lot less in fuel to operate (no fuel needed to circularize). They\u0027re good for getting satellite coverage of higher latitudes as well, where synchronous orbits can\u0027t get line of sight. \u003C/p\u003E\u003Cp\u003EDepending on your setups, you may have a few communication black out time periods, but they\u0027re usually short in duration as the satellite speeds around the periapsis, and could lead to some fun RP. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Molniya_orbit\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Molniya_orbit\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T20:33:20Z\u0022 title=\u002212/02/2013 08:33  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by UH60guy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"larsmaehlum","CreatedById":51566,"CreatedDateTime":"2013-12-02T23:00:53Z","Content":"\n\u003Cp\u003EOrbital periods are the key. Apo/peri isn\u0027t important. I\u0027d recommend using the Kerbal Engineer Redux mod for satellite deployments, espescially when playing with RemoteTech \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"einsteiner","CreatedById":71000,"CreatedDateTime":"2013-12-03T02:45:04Z","Content":"\n\u003Cp\u003EIf you want to edit the save file to get them in the right orbits, you need to calculate the right semi-major axis to get the period you want. The formula is T=2*pi*sqrt(SMA^3/mu). In the save file set all the satellites\u0027 SMA parameter to this number. I assume you want circular, equatorial orbits, so set the ECC, INC, and LAN to zero. To get the right angle between the satellites you should set the MAE and EPH for all the satellites the same and the argument of periapsis (which is LPE in the save file) should be 90 degrees apart for each satellite.\u003C/p\u003E\n"},{"CreatedByName":"Rayder","CreatedById":95226,"CreatedDateTime":"2013-12-03T04:06:22Z","Content":"\n\u003Cp\u003EThe way I do it is as follows:\u003C/p\u003E\u003Cp\u003E1: Rendesvous with the satellite as close as possible.\u003C/p\u003E\u003Cp\u003E2: At the closest point of approach (usually near apoapsis), alter your perapsis to set your synch. So for example if 1 was doing 3 satellites synched in a 3hr orbit, they would be 1hr apart. So I would then adjust the orbit to 2 hours. This would put my new satellite 1hr ahead.\u003C/p\u003E\u003Cp\u003E3: When the new satellite hits apoapsis again, it should be in front by one hour. Circularize your orbit and you should be close to exactly 1hr in front. Synch the orbital periods as close as possible using RCS.\u003C/p\u003E\u003Cp\u003EThe values will of course depend on your current orbital period, how much separation you want and how many satellites you are launching. If you are spacing them equally, just divide the orbital period by the amount of satellites.\u003C/p\u003E\n"}]}