{"TopicId":55047,"ForumId":16,"TopicTitle":"Lost in space (EVA fail)","CreatedByName":"grizzlebizzle","CreatedById":95325,"CreatedDateTime":"2013-12-03T06:07:36Z","PageNum":1,"Articles":[{"CreatedByName":"grizzlebizzle","CreatedById":95325,"CreatedDateTime":"2013-12-03T06:07:36Z","Content":"\n\u003Cp\u003ESo first I accidentally hit space bar and separated the final stage from my capsule while in orbit (oops). With no way to reenter I figure I will try EVAing and pushing the capsule backwards to slow it down at periapsis - seemed like a reasonable plan considering periapsis was only 68km or so. So I send my guy out on EVA and let go and fire up the jet pack trying to figure out the jetpack controls. I started drifting away from the space craft and I wasn\u0027t sure how to get back even from a hundred meters away... I\u0027m not sure what direction I need to burn for and how long. A big problem I think was overshooting. All I did was make things worse in the process. In the end when I burned up all my guy\u0027s EVA fuel they were a couple kilometers away from each other and he and the spacecraft are stuck in orbit... now they are about 100km apart just waiting to eventually burn up on reentry. Any tips on how to avoid the EVA disaster the next time? With no nav ball and no maneuvers I really didn\u0027t know how to get where I want to go using the least amount of fuel (or really any amount of fuel).\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-03T06:41:15Z","Content":"\n\u003Cp\u003EEVA flight is just plain difficult. My preferred method is to move the camera until I\u0027m looking past my kerbal at the place I want him to go, hit the spacebar (which causes him to face directly away from the camera), correct for the RCS spasm this causes (oy!) until he\u0027s pretty much sitting still again, and then fly him to the destination. You will need to make VERY light taps on the keys so that he doesn\u0027t get out of control. And go slowly; there\u0027s no prize for hurrying. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith a 68km periapsis, he\u0027s not going to come down any time soon, though. There\u0027s probably still time for a rescue mission. Though how to collect him if he\u0027s got no RCS fuel is quite a question. You\u0027d have to fly a ship close enough to touch him with a ladder, switch to him, and grab the ladder before you drift apart. Yeah, he\u0027s probably doomed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EIncidentally, apoapsis would be a more effective time to try to change the ship\u0027s velocity.\u003C/p\u003E\n"},{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2013-12-03T06:42:43Z","Content":"\n\u003Cp\u003EOrient yourself by rotating the view, in eva left, right, up and down are always what you see on the screen. Then thrust just a touch at a time, don\u0027t rush - get the kerbal going in the direction you want then just let it float there, don\u0027t keep thrusting or you\u0027re pretty much guaranteed to overshoot.\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2013-12-03T17:40:36Z","Content":"\n\u003Cp\u003EYeah, the tip for any and all maneuvering in space is \u0027be gentle.\u0027 remember that in space, every motion you make needs to be matched by the reverse, or you\u0027ll just overshoot.\u003C/p\u003E\u003Cp\u003EYou can possibly rescue your kerbal with an insanely careful rendezvous, but I\u0027d probably just wave goodbye.\u003C/p\u003E\u003Cp\u003EIn future:\u003C/p\u003E\u003Cp\u003Enever hold any direction in EVA for more than a second,\u003C/p\u003E\u003Cp\u003EAlways keep your camera in one place.\u003C/p\u003E\u003Cp\u003EWhen maneuvering, deal with one axis of motion at a time. For instance, if you\u0027re 100m away from your craft, slightly to the top-right (as your kerbal sees it) sort out getting the craft lined up left-right, first, then move up-down, then thrust forwards. You can fine-tune when you\u0027re a few metres away in the same manner. \u003C/p\u003E\u003Cp\u003EThe same principle applies when maneuvering craft, too. Always do gentle bursts, always line yourself up on one axis at a time, and have lots of patience - docking and rendezvous are the most tricky parts of KSP for new players to understand just because it\u0027s quite counter-intuitive.\u003C/p\u003E\n"}]}