{"TopicId":55410,"ForumId":32,"TopicTitle":"My turn to have a KSP dream","CreatedByName":"Joshington","CreatedById":73509,"CreatedDateTime":"2013-12-06T23:38:00Z","PageNum":1,"Articles":[{"CreatedByName":"Joshington","CreatedById":73509,"CreatedDateTime":"2013-12-06T23:38:00Z","Content":"\n\u003Cp\u003ESo I\u0027ve noticed that quite a few players have had dreams about KSP, and I guess last night was my turn, so here it is:\u003C/p\u003E\u003Cp\u003EIt started off with me launching a strange rocket from the space center (which was moved to Kerbin\u0027s largest continent in an open field, very close to a kerbal city). I say that it\u0027s strange because after a few thousand meters, the rocket tilted completely to the side, but continued going up. Then, just like a movie, the words, \u0022SEVERAL MONTHS LATER\u0022 popped up, then disappeared, replaced by the Mk1-2 Command Pod traveling extremely fast (take the speed of free falling to Kerbin, then triple it) and crash in the water. But Kerbin was different. A giant black sphere called \u0022Titanus\u0022 had seemingly crash-landed on top of the space center. In the distance, aliens were shooting green lasers at the city, followed by a mushroom cloud. When I checked the map, Kerbin was in an ice age, most of the surface covered in snow (including the space center area, but not the water).\u003C/p\u003E\u003Cp\u003EHave I witnessed a future update(s)? Or possibly the end of Kerbin?\u003C/p\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2013-12-06T23:50:05Z","Content":"\n\u003Cp\u003ENOOOOOOOOOOOOO HUMENS! They finally found Kerbin!!! (had to say it). I think it was actually a bad movie on a kerbal cinema.\u003C/p\u003E\n"},{"CreatedByName":"panfish5","CreatedById":74937,"CreatedDateTime":"2013-12-06T23:58:17Z","Content":"\n\u003Cp\u003EMaybe kerbin is actually earth in the past and the aliens are actually humans but then the ice age had killed almost all of the humans and all the kerbals had been incinerated by the war witch is why we have never dug one up before and humans came back and now we live in the current world.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2013-12-06T23:59:32Z","Content":"\n\u003Cp\u003EYou guys have such awesome dreams. I never had a good KSP dream yet.\u003C/p\u003E\n"}]}