{"TopicId":55420,"ForumId":34,"TopicTitle":"[1.2.0] Toolbar 1.7.13 - Common API for draggable/resizable buttons toolbar","CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-07T01:17:23Z","PageNum":1,"Articles":[{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-07T01:17:23Z","Content":"\n\u003Cp\u003E\nHi, there are quite a few plugins now that add various GUI buttons to the game. Right now, every plugin author has to implement button behaviour themselves. Also, there is no consistent button style between different plugins\u0027 buttons.\n\u003C/p\u003E\n\u003Cp\u003E\nI have written a plugin that is targeted towards those plugins. Specifically, it provides an API for third-party plugins to provide GUI buttons to a toolbar. Those buttons then can invoke an arbitrary action specified by the plugin\u0027s author, such as opening a new window. The ultimate goal of this plugin is the separation of specifying a button\u0027s contents (such as text or image) and its action from the actual display style and position of the button. The player should be free to position buttons anywhere they please.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003E\u003Ca href=\u0022https://www.blizzy.de/toolbar/download.html\u0022 rel=\u0022external nofollow\u0022\u003EDownload Toolbar Plugin 1.7.13\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(\u003Ca href=\u0022https://www.dropbox.com/sh/b256r09rx0x6cow/AAArLp9-Yg80YglLxHbnWMB_a?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EOlder releases\u003C/a\u003E - these will not be supported)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick\u0026amp;hosted_button_id=PCRP5Y2MUS62A\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022btn_donate_LG.gif\u0022 src=\u0022https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://bit.ly/1dwimeT\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022flattr-badge-large.png\u0022 src=\u0022http://blizzy.de/flattr-badge-large.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSource code: \u003Ca href=\u0022https://github.com/blizzy78/ksp_toolbar\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/blizzy78/ksp_toolbar\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(The Toolbar Plugin is licensed under the \u003Ca href=\u0022http://opensource.org/licenses/BSD-2-Clause\u0022 rel=\u0022external nofollow\u0022\u003EBSD 2-clause license\u003C/a\u003E.)\n\u003C/p\u003E\n\u003Cp\u003E\nOlder video demonstrating some of the features:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/5yRh8WwYKkY?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nMod spotlight from HAWX Gaming:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/QPvMC4EXPbs?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFeature List\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nA draggable and resizable toolbar holds all buttons\n\u003C/li\u003E\n\u003Cli\u003E\nButtons have a texture (icon)\n\u003C/li\u003E\n\u003Cli\u003E\nCustom button order can be maintained\n\u003C/li\u003E\n\u003Cli\u003E\nUnlimited number of toolbars per game scene\n\u003C/li\u003E\n\u003Cli\u003E\nCustom button folders can be created to improve organization\n\u003C/li\u003E\n\u003Cli\u003E\nToolbar position is saved between KSP restarts\n\u003C/li\u003E\n\u003Cli\u003E\nToolbar will auto-clamp to screen area so that it cannot be dragged off-screen\n\u003C/li\u003E\n\u003Cli\u003E\nToolbar may auto-hide itself if positioned at screen edge\n\u003C/li\u003E\n\u003Cli\u003E\nClicking a button invokes an arbitrary action specified by plugin author\n\u003C/li\u003E\n\u003Cli\u003E\nEvery button looks the same, no need for plugin author to provide any styles\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPlease note that this is not a regular plugin in the usual sense. You can install it, but it won\u0027t actually do anything on its own unless being told to do so by other plugins.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, if you\u0027re a player and would like your favorite plugin to use the Toolbar Plugin, please tell that plugin\u0027s author to look into it.\n\u003C/p\u003E\n\u003Cp\u003E\nAre you a plugin author and would like to use the Toolbar Plugin? Please head over to the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60066\u0022 rel=\u0022\u0022\u003E\u003Cstrong\u003Edevelopment thread\u003C/strong\u003E\u003C/a\u003E which has all the info you need.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFrequently Asked Questions\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EYour download link is dead!?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt is not. It works just fine. Clear your browser\u0027s cache and try again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHow do I reposition the toolbar on my screen?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick on the little triangle button on the toolbar, then select \u0022Unlock Position and Size\u0022 from the menu. You can now drag the toolbar around. When done, click on the triangle button again, then select \u0022Lock Position and Size.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHow do I change the layout of the toolbar? I want there to be two rows of buttons, or two columns, or ...\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick on the little triangle button on the toolbar, then select \u0022Unlock Position and Size\u0022 from the menu. You can now resize the toolbar by clicking and dragging in the lower-right corner of it. When done, click on the triangle button again, then select \u0022Lock Position and Size.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHow do I change the order of the buttons?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick on the little triangle button on the toolbar, then select \u0022Unlock Button Order\u0022 from the menu. You can now drag the buttons around. When done, click on the triangle button again, then select \u0022Lock Button Order.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EDoes the toolbar remember position, layout, button order, and button visibility dependent on current game scene?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYes, all those settings are saved dependent on the current game scene.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIs there a way to automatically hide the toolbar when I don\u0027t need it?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, drag the toolbar to the screen edge. Then, click the triangle button and select \u0022Activate Auto-Hide at Screen Edge\u0022 from the menu. The toolbar should now auto-hide itself when the mouse pointer is not hovering above it. To disable this behaviour, click the triangle button again, then select \u0022Deactivate Auto-Hide at Screen Edge.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EI\u0027ve installed a new plugin, how do I make its buttons visible?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick on the little triangle button on the toolbar, then select \u0022Configure Visible Buttons\u0022 from the menu. Activate or deactivate buttons as desired. Click \u0022Close\u0022 to close the configuration window.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHow do I create a new button folder? How do I put buttons into a folder?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick the triangle button, then select \u0022Create New Folder\u0022 from the menu.\n\u003C/p\u003E\n\u003Cp\u003E\nTo put buttons into the folder, click the triangle button, then select \u0022Unlock Button Order\u0022 from the menu. Then drag any regular button onto the folder button (not into the folder, should it be visible.) To exit the button drag mode, click the triangle button, then select \u0022Lock Button Order.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHow do I delete a button folder?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nRight-click on the button folder, then select \u0022Delete Folder\u0022 from the menu.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EFolders are not enough, I need more toolbars. How do I add them?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick the triangle button, then select \u0022Create New Toolbar\u0022 to add a new toolbar.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHow do I delete a toolbar?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick the triangle button on the toolbar in question, then select \u0022Delete Toolbar\u0022. Note that you cannot delete the last toolbar.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHow do I change a folder button\u0027s tool tip text?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nRight-click on the button folder, then select \u0022Edit Folder Settings\u0022 from the menu.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EI like the KSP GUI skin better than Unity\u0027s default, is there a way to make the buttons look like that?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick the triangle button, then select \u0022Use KSP Skin\u0022 from the menu. To revert back to Unity\u0027s default skin, click the triangle button again, then select \u0022Use Unity \u0027Smoke\u0027 Skin.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIs there a way to hide the toolbar\u0027s border?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nClick the triangle button, then select \u0022Hide Border\u0022 from the menu. To show the border again, click the triangle button again, then select \u0022Show Border.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EMy toolbar is all messed up, how do I reset it completely?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTo reset to defaults completely, exit KSP, delete the GameData\\toolbar-settings.dat file from your installation, then start KSP again.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EChange Log\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis mod includes version checking using \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/72169-11-ksp-avc-add-on-version-checker-plugin-1161-miniavc-ksp-avc-online-2016-04-19/\u0022 rel=\u0022\u0022\u003EMiniAVC\u003C/a\u003E. If you opt-in, it will use the Internet to check whether there is a new version available. Data is only read from the Internet and no personal information is sent. For a more comprehensive version checking experience, please download the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/72169-11-ksp-avc-add-on-version-checker-plugin-1161-miniavc-ksp-avc-online-2016-04-19/\u0022 rel=\u0022\u0022\u003EKSP-AVC Plugin\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\n1.7.13, 2016-10-15\n- Updated for KSP 1.2.0.\n- Please note that the 32-bit version of KSP will no longer be supported.\n- Plugin developers: Please update ToolbarWrapper.cs in your project.\n\n1.7.12, 2016-05-02\n- Updated for KSP 1.1.2.\n- Now uses KSP-AVC for version checking. If KSP-AVC is not installed, the bundled\n  MiniAVC will be used. The \u0022Toolbar Update Available\u0022 button on the toolbar has\n  been removed.\n\n1.7.11, 2016-04-21\n- Updated for KSP 1.1.0.\n\n1.7.10, 2015-11-10\n- Updated for KSP 1.0.5.\n- Disabled KSP compatibility check for the time being.\n\n1.7.9, 2015-05-02\n- Updated for KSP 1.0.2.\n\n1.7.8, 2014-12-22\n- Updated for KSP 0.90.0.\n\n1.7.7, 2014-10-09\n- Fixed a bug in the KSP compatibility check.\n\n1.7.6, 2014-07-26\n- In addition to the automatic update check, the plugin now also gets KSP versions\n  from the update check server. In case the currently running KSP version is one of\n  those versions, the plugin will not complain about being incompatible with this\n  KSP version. This saves both players\u0027 and plugin authors\u0027 time.\n- Updated for KSP 0.24.2.\n\n1.7.5, 2014-07-25\n- Updated for KSP 0.24.1.\n\n1.7.4, 2014-07-17\n- Updated for KSP 0.24.0.\n\n1.7.3, 2014-06-26\n- Improved positioning of folders and \u0022drawables.\u0022 This also fixes a bug that\n  occurred if a folder/drawable was blocking both the nav ball and the altimeter\n  at the same time.\n\n1.7.2, 2014-06-22\n- Folders and \u0022drawables\u0022 (which are provided by third-party plugins) are now\n  prevented from blocking the nav ball and altimeter.\n- Folders and \u0022drawables\u0022 will now open in the same spot as they opened the\n  last time (as long as they fit on screen.) This should be helpful for third-\n  party plugin developers that provide \u0022drawables\u0022 that may change their size\n  while being displayed.\n\n1.7.1, 2014-04-02\n- Updated for KSP 0.23.5.\n\n1.7.0, 2014-03-03\n- Fixed a bug that could prevent the saving of settings in certain situations.\n- Plugin authors: Added new API to allow to display \u0022drawables.\u0022 These are any\n  GUI widgets that you wish to display that are tied to a particular button.\n  For example, drawables can be used to display a popup menu (see the\n  PopupMenuDrawable class and the example source code), or an informational\n  small window when hovering over a button. Drawables will always be positioned\n  near the parent toolbar (much like button folders.)\n  This new API is available for users of the official Toolbar wrapper as well.\n\n1.6.1, 2014-02-28\n- You can now choose different icons for folder buttons.\n\n1.6.0, 2014-02-15\n- Added support for multiple toolbars. You can add new toolbars by selecting\n  \u0022Create New Toolbar\u0022 from the triangle drop-down menu. Each toolbar has its\n  own separate set of settings, folders, and visible buttons.\n- The map view during flight is now considered a separate game scene. This\n  means that it is now possible to configure different toolbars for the\n  regular flight scene and the flight map scene.\n\n1.5.3, 2014-02-13\n- Fixed a bug where buttons marked as \u0022important\u0022 could prevent the toolbar\n  from auto-hiding itself, even though those buttons have not been configured\n  to be visible.\n\n1.5.2, 2014-02-08\n- Removed the popup dialog that notifies about new buttons that became\n  available. Instead, the toolbar will always show the configuration button as\n  long as no other buttons are configured to be visible.\n- Fixed a bug where the toolbar would lose the configured visibility of some\n  buttons.\n- Fixed a bug where a newly-created folder would not respect the \u0022show border\u0022\n  setting of the main toolbar.\n- Plugin authors: Added an official Toolbar Plugin wrapper that can be used to\n  provide Toolbar Plugin support without creating a hard dependency. Check the\n  development forum thread at http://bit.ly/1b1ZXda for details.\n\n1.5.1, 2014-02-07\n- Fixed a bug where the new buttons notification would pop up more often\n  than intended.\n- Fixed a bug where folders would not display their contents.\n- The update notification button can now be dismissed (hidden) by right-\n  clicking it.\n\n1.5.0, 2014-02-07\n- You can now configure the visibility of each button. For example, you can\n  now hide a button if you don\u0027t need it. Button visibility is saved in\n  relation to game scene.\n  Note: This change will cause a one-time reset of the toolbar, such that\n  no buttons are visible at first. Toolbar location will be preserved.\n\n1.4.5, 2014-02-04\n- Fixed another bug where the toolbar would get completely invisible under\n  certain circumstances.\n- Various other minor improvements and bug fixes.\n\n1.4.4, 2014-01-27\n- Fixed a bug where the toolbar would get completely invisible under certain\n  circumstances.\n\n1.4.3, 2014-01-25\n- Various minor improvements and bug fixes.\n\n1.4.2, 2014-01-13\n- The plugin will now display a confirmation dialog before deleting a folder.\n- The plugin will now check for incorrect installations and display a\n  warning if necessary.\n\n1.4.1, 2014-01-05\n- Fixed a bug that could sometimes cause buttons to render with Unity\u0027s\n  default skin instead of the KSP skin.\n\n1.4.0, 2014-01-01\n- You can now add custom folders to the toolbar, which can hold any number\n  of regular buttons for improved organization.\n\n1.3.0, 2013-12-26\n- You can now reorder the buttons on the toolbar. Button order is saved in\n  relation to game scene (for example, you can have a different button order\n  in the flight scene and the tracking station scene.)\n- Plugin authors: Added new property IButton.EffectivelyVisible. See the\n  documentation of that property for details.\n\n1.2.2, 2013-12-23\n- You may now chose to use the KSP skin for buttons instead of Unity\u0027s\n  default \u0027Smoke\u0027 skin.\n- The toolbar border can now be hidden.\n- Improved the positioning/sizing of the toolbar after startup with respect\n  to the size that has been chosen previously by the player.\n\n1.2.1, 2013-12-20\n- Increased the size of the triangle button that opens the toolbar-specific\n  drop-down menu.\n- Fixed a bug that could make the toolbar completely invisible under\n  certain circumstances.\n- The toolbar should now no longer be visible during loading screens.\n- Plugin authors: Added new events IButton.OnMouseEnter/OnMouseLeave.\n  See the documentation of those events for details.\n\n1.2.0, 2013-12-17\n- Toolbar position and size are stored in relation to the current scene now.\n  For example, you can place it at different positions in the vehicle assembly\n  building, the spaceplane hangar, and the actual flight scene.\n- Plugin authors: There is a new property IButton.Important now. See the\n  documentation of that property for details.\n\n1.1.0, 2013-12-08\n- Added a new toolbar-specific drop-down menu where players can configure\n  the toolbar.\n- Repositioning and resizing the toolbar should now be considerably easier.\n- Added the ability to auto-hide the toolbar when it is positioned at the\n  screen edge.\n- Plugin authors: No API changes were made in this version.\n\n1.0.0, 2013-12-06\n- Initial public release.\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-15T14:28:13Z\u0022 title=\u002210/15/2016 02:28  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 15, 2016\u003C/time\u003E by blizzy78\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-12-07T01:18:36Z","Content":"\n\u003Cp\u003ENice to see this finally released! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EDoes this only apply to the flight screen or can it also be accessed from the VAB/SPH?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-07T01:20:59Z","Content":"\n\u003Cp\u003EIt works in any scene. Third-party plugins can specify in which scene(s) a particular button should be visible. The API is quite flexible in that regard.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-12-07T01:22:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EIt works in any scene. Third-party plugins can specify in which scene(s) a particular button should be visible. The API is quite flexible in that regard.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery good, I\u0027ll see into using this for the editor window of RealChute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-07T02:28:39Z","Content":"\n\u003Cp\u003E@ blizzy78. as of now, the download link for the \u0022user\u0022 version of your plugin seems to be very well hidden (can\u0027t see it anywhere on the first post or else in this thread). \u003C/p\u003E\u003Cp\u003EOf course I could find it in the development thread, instead.\u003C/p\u003E\u003Cp\u003EAnd, again, thank you for this: absolutely needed.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-07T02:30:25Z","Content":"\n\u003Cp\u003ERight, I didn\u0027t post a link in this thread because it doesn\u0027t really make sense. Instead I was trying to show off what exists and can potentially be used by third-party plugins.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-07T03:23:34Z","Content":"\n\u003Cp\u003EWell, yes, you\u0027re right: doesn\u0027t really make sense. I was thinking along the lines of ModuleManager and seeing the DL link for that is readily available to users (even if most mods have it included in their package).\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2013-12-07T03:27:42Z","Content":"\n\u003Cp\u003EIt would certainly be worthwhile linking to updates (if any are needed) so users can update the toolbar .dll independent of other plugin authors\u0027 release schedules.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-07T04:11:25Z","Content":"\n\u003Cp\u003E@ blizzy78: tried your plugin (installed with SteamGauges new release) and must say it is not very easy for me. I can see the toolbar resizing rect by holding LMB and dragging, but the active area to start with resizing is pretty narrow, I most often can\u0027t click on it. Would be nice to have that active area highlighted.\u003C/p\u003E\u003Cp\u003ECould not find any way to drag the toolbar. Can you provide instructions?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-07T15:03:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022diomedea\u0022 data-cite=\u0022diomedea\u0022\u003E\u003Cdiv\u003EI can see the toolbar resizing rect by holding LMB and dragging, but the active area to start with resizing is pretty narrow, I most often can\u0027t click on it. Would be nice to have that active area highlighted.\u003Cp\u003ECould not find any way to drag the toolbar. Can you provide instructions?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo drag, you need to click and drag anywhere in the toolbar\u0027s rectangle except for buttons and the resizing area. That is, dragging at any edge should work.\u003C/p\u003E\u003Cp\u003EI agree that the areas are extremely narrow. I have plans to make it easier for players to position/resize the toolbar by adding a toolbar-specific dropdown-menu with options. It will look like this: (note the little arrow button in the toolbar)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bSxdHjT.png\u0022 alt=\u0022bSxdHjT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis will also allow players to reorder buttons in a later version.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-07T22:26:40Z\u0022 title=\u002212/07/2013 10:26  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 7, 2013\u003C/time\u003E by blizzy78\u003C/strong\u003E\n\u003Cbr\u003Ereplaced example screenshot with actual in-development screenshot\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-08T13:09:47Z","Content":"\n\u003Cp\u003EI\u0027ve edited the OP to put up a new video that shows the current state of development. (yet to be published)\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-08T13:58:26Z","Content":"\n\u003Cp\u003EBased on that new video, it\u0027s getting even better than I had hoped. \u003C/p\u003E\u003Cp\u003EOne minor issue, probably will disappear when more mods use this plugin: the toolbar area seems to be \u0022locked\u0022 to the same rect even when changing \u0022scene\u0022; if I have the toolbar set in a specific position and dimension in flight or map, I will find the same position and dimension while getting back to the space center, and with each single building (most times, empty toolbar). I could even see an empty \u0022toolbar\u0022 with the initial splashscreen when restarting KSP. If I try to adjust an empty toolbar it will shrink to a small square, but then the correct setting for flight may have benn lost. IMHO, each \u0022scene\u0022 should have a specific setting for the toolbar to be shown.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-08T14:03:20Z","Content":"\n\u003Cp\u003ERight, for now the toolbar stays at the same position in all scenes. It should never display when there aren\u0027t any buttons visible, though. Then again, I think I know what the bug is that does it.\u003C/p\u003E\u003Cp\u003EEdit: Fixed it for the next release.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-08T14:13:16Z\u0022 title=\u002212/08/2013 02:13  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 8, 2013\u003C/time\u003E by blizzy78\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-08T14:56:16Z","Content":"\n\u003Cp\u003EToolbar Plugin 1.1.0 is now available for download, with a new toolbar-specific drop-down menu that allows to configure the toolbar.\u003C/p\u003E\u003Cp\u003EI\u0027ve added a download link to the OP so that players may update their installation independently from third-party plugins\u0027 releases.\u003C/p\u003E\n"},{"CreatedByName":"martinezfg11","CreatedById":59995,"CreatedDateTime":"2013-12-13T07:36:20Z","Content":"\n\u003Cp\u003EIs there a list of plugins currently using this toolbar?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-13T09:10:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022martinezfg11\u0022 data-cite=\u0022martinezfg11\u0022\u003E\u003Cdiv\u003EIs there a list of plugins currently using this toolbar?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot yet, but I can try and compile one.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-17T21:42:36Z","Content":"\n\u003Cp\u003EToolbar Plugin 1.2.0 is now available for download. The toolbar position is now stored separately for every game scene.\u003C/p\u003E\n"},{"CreatedByName":"Chris_W","CreatedById":96985,"CreatedDateTime":"2013-12-17T23:26:34Z","Content":"\n\u003Cp\u003Estrike this post, found the bug in another mod.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T01:37:14Z\u0022 title=\u002212/18/2013 01:37  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by Chris_W\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-18T01:38:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chris_W\u0022 data-cite=\u0022Chris_W\u0022\u003E\u003Cdiv\u003ECould this be coming from Toolbar? \u003Cp\u003E[Exception]: FileNotFoundException: Could not load file or assembly \u0027KAS, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null\u0027 or one of its dependencies.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think KAS uses the Toolbar Plugin, so these two wouldn\u0027t interact with one another. Is there more to that error in the output_log.txt?\u003C/p\u003E\n"},{"CreatedByName":"therealcrow999","CreatedById":19331,"CreatedDateTime":"2013-12-18T04:37:57Z","Content":"\n\u003Cp\u003EI am using 1.2.0 version, it was working good. Then I moved my toolbar to right of screen then set it to auto hide, later on notice it was gone. I can\u0027t seem to get it back. I deleted toolbar folder and installed it again, but didn\u0027t bring tool bar back. The 3 mods that I have using it are, MJ, Action group Manager and Crew Manifest. The only one that hasn\u0027t been updated to 0.23 is Crew Manifest, as far as I know.\u003C/p\u003E\n"},{"CreatedByName":"therealcrow999","CreatedById":19331,"CreatedDateTime":"2013-12-18T04:58:09Z","Content":"\n\u003Cp\u003EAfter reinstall of all those mods and toolbar didn\u0027t show up. I ended up finding it in SPH and moved to middle so I could get it in another scene.\u003C/p\u003E\n"},{"CreatedByName":"C4pt.Miles","CreatedById":57863,"CreatedDateTime":"2013-12-18T14:35:16Z","Content":"\n\u003Cp\u003EI don\u0027t get it. At 0.22 it wasn\u0027t working at all and now at 0.23 I see only the Crew Manifest and the Aciefments, but not the TAC Lifesupport, TAC Fuelbalancer and Kerbal alarm clock. They are still on there own buttons...\u003C/p\u003E\u003Cp\u003EIst there a special way to install it or something?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-18T15:08:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022therealcrow999\u0022 data-cite=\u0022therealcrow999\u0022\u003E\u003Cdiv\u003EAfter reinstall of all those mods and toolbar didn\u0027t show up. I ended up finding it in SPH and moved to middle so I could get it in another scene.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn version 1.2.0, there is a minor bug that moves the toolbar to the top-left corner of the screen the first time you enter a game scene after installing version 1.2.0. For example, after installing version 1.2.0, if you enter the flight scene for the first time, the toolbar will be at the top-left corner of the screen. After that, it should always stay where you positioned it for that particular scene.\u003C/p\u003E\u003Cp\u003ENote that it should never get inaccessible if it has been accessible in that game scene before. That would be a bug.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022C4pt.Miles\u0022 data-cite=\u0022C4pt.Miles\u0022\u003E\u003Cdiv\u003ETAC Lifesupport, TAC Fuelbalancer and Kerbal alarm clock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think TAC LifeSupport, TAC FuelBalancer and Kerbal Alarm Clock use the Toolbar Plugin as of now?\u003C/p\u003E\u003Cp\u003EYou see, the Toolbar Plugin is providing a programming interface for third-party plugin authors. If those authors do not use it, nothing will happen - their buttons will appear and function as before.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T15:13:28Z\u0022 title=\u002212/18/2013 03:13  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by blizzy78\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"C4pt.Miles","CreatedById":57863,"CreatedDateTime":"2013-12-18T15:21:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EI don\u0027t think TAC LifeSupport, TAC FuelBalancer and Kerbal Alarm Clock use the Toolbar Plugin as of now?\u003Cp\u003EYou see, the Toolbar Plugin is providing a programming interface for third-party plugin authors. If those authors do not use it, nothing will happen - their buttons will appear and function as before.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60066\u0022 rel=\u0022external nofollow\u0022\u003EDevelopers-Blog\u003C/a\u003E they are listed...?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-18T15:22:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022C4pt.Miles\u0022 data-cite=\u0022C4pt.Miles\u0022\u003E\u003Cdiv\u003EIn the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60066\u0022 rel=\u0022external nofollow\u0022\u003EDevelopers-Blog\u003C/a\u003E they are listed...?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt says \u0022List of Plugins That \u003Cstrong\u003ECould\u003C/strong\u003E Use It\u0022.\u003C/p\u003E\n"}]}