{"TopicId":55563,"ForumId":36,"TopicTitle":"Considering making a airship mod - now with rough render","CreatedByName":"whistlehead","CreatedById":79926,"CreatedDateTime":"2013-12-08T18:02:18Z","PageNum":1,"Articles":[{"CreatedByName":"whistlehead","CreatedById":79926,"CreatedDateTime":"2013-12-08T18:02:18Z","Content":"\n\u003Cp\u003EI\u0027ve been making virtual models for railway simulator Trainz for a while now (though I\u0027ll be the first to admit that I\u0027m not exactly an exceptional talent) - and I\u0027d like to have a shot at doing the same for KSP.\u003C/p\u003E\u003Cp\u003EThe first thing that springs to mind is an airship pack of more traditional design than the Hooligan labs components - big cigars, built in sections.\u003C/p\u003E\u003Cp\u003EThis is just a vague idea at the moment, but if anyone could give me some pointers as to how exactly to create a part which works with Hooligan labs I\u0027d much appreciate it. Alternatively, could I simply set the mass to be so low that it floats naturally? Does KSP\u0027s physics allow for that?\u003C/p\u003E\u003Cp\u003EEDIT: As clarification, I\u0027m thinking simple parts that are always inflated - not deflatable parts like some of the Hooligan components\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003EChris\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-10T22:35:50Z\u0022 title=\u002212/10/2013 10:35  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 10, 2013\u003C/time\u003E by whistlehead\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2013-12-09T00:06:11Z","Content":"\n\u003Cp\u003ETalk to JewelShizen, the maintainer of HL. He can help you.\u003C/p\u003E\n"},{"CreatedByName":"whistlehead","CreatedById":79926,"CreatedDateTime":"2013-12-10T11:21:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathsoul097\u0022 data-cite=\u0022Deathsoul097\u0022\u003E\u003Cdiv\u003ETalk to JewelShizen, the maintainer of HL. He can help you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks - if I go ahead I will do, though I do have an alternative idea which I explain below.\u003C/p\u003E\u003Cp\u003EAs my idea progesses, I have a few more queries.\u003C/p\u003E\u003Cp\u003EMost important:\u003C/p\u003E\u003Cp\u003E - It is possible to make trust-reversing engines, or would it be better to use IR rotatrons to turn the engine over?\u003C/p\u003E\u003Cp\u003E - If I used small propellers as a replacement RCS system, could I animate the props? Alternatively, could I make the model swap out with one with a \u0027rotating disk\u0027 (just a transparent circle which looks like a moving propellor)? Along the same lines, could I configure the props to run off the main fuel supply?\u003C/p\u003E\u003Cp\u003E - Possibly most importantly - How should I deal with the issue of creating lift? \u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E- Idea 1:\u003C/strong\u003E Could I make the envelope of the airship use a combination of two resources (Helium/Hydrogen [maybe just call it Lifting Gas?] and Compressed Air [ballast?]) for lift? The idea that I have is that compressed air could fill and empty in flight, acting as ballast to move the airship up and down - i.e. it would add mass to the envelope. Meanwhile, Lifting Gas would have a negative mass. This would be an expendable resource which once drained is gone forever - or until refilled, either through docking or KAS. The user would have the option to drain Lifting Gas to drop quickly, with the obvious disadvantage of not being able to get back into the air again. To add difficulty, Lifting Gas would drain very slowly over time, as Hydrogen and Helium do in reality, meaning you can\u0027t fly forever. \u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E- Idea 2:\u003C/strong\u003E Alternatively (and perhaps more simply) could I just give the envelope a negative mass and use a ballast resource? A possible extension of this is to use a convertor to convert IntakeAir to ballast.\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E- Idea 3:\u003C/strong\u003E Should I just use Hooligan?\u003C/p\u003E\u003Cp\u003EFor ideas 1 and 2 I\u0027m thinking that I could possibly get action groups to alter the resources quantities.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENot so important\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThose are my main queries. I have a few others, but they aren\u0027t so important:\u003C/p\u003E\u003Cp\u003E - Regarding transportable lifting gas tanks to build stations to refill your airships (for idea 1) - obviously the lifting gas would need to be compressed in these tanks so they could store an appropriate quantity and not float away. Could I use another resource (compressed lifting gas) in these tanks and have a Kethane-style convertor part to attach to a fuelling rig? Or could I make a convertor which converts a generic game resource to lifting gas?\u003C/p\u003E\u003Cp\u003E - I quite like the idea of having to fit exhausts to remove exhaust gases, similar to WasteHeat in Interstellar. Would the simple solution be to essentially copy this across but with a different resource?\u003C/p\u003E\u003Cp\u003EI realise this is rather a large set of questions (and that I might be getting too ambitious), especially as I still may not actually create the item in question, but I am very interested to know if it\u0027s possible. I might create a roadmap for myself to see if I could fit in creating this around the other things I have to do - but I need to set the fundamentals first.\u003C/p\u003E\u003Cp\u003EI have got a touch of experience in writing configs for game parts, but not in KSP and never anything especially complex.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003EChris\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-10T11:24:19Z\u0022 title=\u002212/10/2013 11:24  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 10, 2013\u003C/time\u003E by whistlehead\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-12-10T14:07:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022whistlehead\u0022 data-cite=\u0022whistlehead\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECould I make the envelope of the airship use a combination of two resources (Helium/Hydrogen [maybe just call it Lifting Gas?] and Compressed Air [ballast?]) for lift? The idea that I have is that compressed air could fill and empty in flight, acting as ballast to move the airship up and down - i.e. it would add mass to the envelope. Meanwhile, Lifting Gas would have a negative mass. This would be an expendable resource which once drained is gone forever - or until refilled, either through docking or KAS. The user would have the option to drain Lifting Gas to drop quickly, with the obvious disadvantage of not being able to get back into the air again. To add difficulty, Lifting Gas would drain very slowly over time, as Hydrogen and Helium do in reality, meaning you can\u0027t fly forever. \u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really, really like this. Hooligan baloons are way too much overpovered, we need some realistic approach. \u003C/p\u003E\u003Cp\u003EAnd of course filling ballast shoudl drain batteries. That woudl limmit time of using airship too.\u003C/p\u003E\n"},{"CreatedByName":"whistlehead","CreatedById":79926,"CreatedDateTime":"2013-12-10T14:24:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EI really, really like this. Hooligan baloons are way too much overpovered, we need some realistic approach. \u003Cp\u003EAnd of course filling ballast shoudl drain batteries. That woudl limmit time of using airship too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like the battery drain idea - I hadn\u0027t come up with that. I guess it wouldn\u0027t be too hard to create a part which turns IntakeAir to ComoressedAir at the cost of electricity, though as I say I\u0027ve never scripted a KSP part before.\u003C/p\u003E\u003Cp\u003EAnd thanks! This is my preferred idea, but I don\u0027t know if it\u0027s workable or not.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003EChris\u003C/p\u003E\n"},{"CreatedByName":"pizzaoverhead","CreatedById":26349,"CreatedDateTime":"2013-12-10T14:49:28Z","Content":"\n\u003Cp\u003EYou\u0027re making a rigid airship in sections? Cool! Give them a damaged state like the solar panels and wheels have, then you could replicate something similar to Crimson Skies\u0027 zeppelins:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cf.shacknews.com/images/20120412/cs_screen_22_b_21746.jpg\u0022 alt=\u0022cs_screen_22_b_21746.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d recommend starting with some modelling before worrying about all the complicated features you want to implement. It\u0027s better to have something that half-works than nothing at all, and aside from the engines, the models won\u0027t be affected by their functionality. It should be easy to make a simple model too: You could do the longitudinal ribs in your normal map to save polygons if needed.\u003C/p\u003E\u003Cp\u003EHave you any idea what kind of parts you\u0027d like to make for it? Here\u0027s what I\u0027ve come up with:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E Centre cells\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Nose cell\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Tail cell\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Fin\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Fin control surface\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Crew cupola\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Engines\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Cargo cell (hollow with opening doors)\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-12-10T14:58:05Z","Content":"\n\u003Cp\u003EPersonally I would love to see something really retro with the airships like steam power.\u003C/p\u003E\u003Cp\u003ELike this, but with a larger gas envelope.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/1YzV5RG.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/1YzV5RG.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/pjBE8Tr.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/pjBE8Tr.jpg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"whistlehead","CreatedById":79926,"CreatedDateTime":"2013-12-10T15:14:20Z","Content":"\n\u003Cp\u003E@Pizzaoverhead: We\u0027ll see about the damaged parts - I think that\u0027s a thing to do later rather than at the start. As you say, first thing is to get the parts made. In terms of parts, that\u0027s pretty much what I\u0027d come up with, though I might leave out the cargo bay for now. I\u0027m thinking of having a radial fuel gondola part and the rest of the gondola parts (cabin, cargo, more fuel) are attached inline with that part. I\u0027ll pop a few rough diagrams of what I\u0027m thinking up sometime soon to clarify.\u003C/p\u003E\u003Cp\u003E@Tommygun: I\u0027m going to stick with 30\u0027s style for now, but I already had plans for more modern ships to match the stock parts, and I see no reason not to make steam parts later on - I\u0027m a bit of a steampunk fan. Tech tree integration could be fun!\u003C/p\u003E\u003Cp\u003EThe interest I\u0027m getting is very encouraging - and I\u0027m now very tempted to go ahead. Just need to make sure I don\u0027t prioritise this over my coursework!\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003EChris\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2013-12-10T16:38:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022whistlehead\u0022 data-cite=\u0022whistlehead\u0022\u003E\u003Cdiv\u003E- If I used small propellers as a replacement RCS system, could I animate the props?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t be much help to you, but for this one you should look at the FireSpitter plugin. Iirc, it has a module just for this\u003C/p\u003E\n"},{"CreatedByName":"whistlehead","CreatedById":79926,"CreatedDateTime":"2013-12-10T22:34:43Z","Content":"\n\u003Cp\u003EA *very* rough render mainly to show the scale I\u0027m thinking - the envelope segments are 3.2 orange tanks high (or 24 metres for those of you stuck in the metric system).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1247.photobucket.com/albums/gg640/whistlehead/airship1.jpg\u0022 alt=\u0022airship1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI guess I could also do smaller ones, but this is the kind of size I had originally intended to make.\u003C/p\u003E\u003Cp\u003EThe final thing will have more polys on the front end and hugely better textures (hopefully). It also won\u0027t have the smoothing issue on the nose - though as I\u0027m not sure what caused it I can\u0027t guarantee!\u003C/p\u003E\u003Cp\u003E@Talisar - I\u0027ll have to download it, thanks.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003EChris\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-12-11T00:24:32Z","Content":"\n\u003Cp\u003ENice looking, I would suggest not making them so big you can\u0027t assemble them in the hanger though.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-12-11T01:27:52Z","Content":"\n\u003Cp\u003EHow about some baloons? \u003C/p\u003E\u003Cp\u003ECompletly spherical:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.wired.com/images_blogs/wiredscience/2013/04/EVE_in_cloud_1500x1000.png\u0022 alt=\u0022EVE_in_cloud_1500x1000.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOr with classic baloon shape.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.nature.com/news/2009/090121/images/_tmp_articling-import-20090121101630606378_457366a-i2.0.jpg\u0022 alt=\u0022_tmp_articling-import-20090121101630606378_457366a-i2.0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis one coudl be just hot air baloon. Just carries some fuel for heating air inside. But cant controll whith way it is heading. Well, without wind implemented by squad it woudlnt be heading anywhere, right?\u003C/p\u003E\u003Cp\u003EThe way i can see it, these ballons woudl be for light probes or very brave but stupid kerbal on rover seat. Nothing heavier.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-11T01:33:18Z\u0022 title=\u002212/11/2013 01:33  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 11, 2013\u003C/time\u003E by kiwiak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bluegobln","CreatedById":59640,"CreatedDateTime":"2013-12-11T01:57:50Z","Content":"\n\u003Cp\u003EWhen it comes to an object of that size, trust me, the game can handle a LOT of polygons. You should be able to do several hundred with ease and make that smooth as a baby\u0027s rump and not tax anyone\u0027s systems too badly. Unlike a lot of parts, yours is unlikely to be present in more than say 3-4 copies at a time, so you can actually afford to be pretty extreme with the model and not really worry too much.\u003C/p\u003E\u003Cp\u003EObviously lower/more efficient poly is better, but don\u0027t skimp on quality is what I am saying, there\u0027s no real harm in it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-11T01:59:53Z\u0022 title=\u002212/11/2013 01:59  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 11, 2013\u003C/time\u003E by Bluegobln\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"whistlehead","CreatedById":79926,"CreatedDateTime":"2013-12-11T10:39:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bluegobln\u0022 data-cite=\u0022Bluegobln\u0022\u003E\u003Cdiv\u003EWhen it comes to an object of that size, trust me, the game can handle a LOT of polygons. You should be able to do several hundred with ease and make that smooth as a baby\u0027s rump and not tax anyone\u0027s systems too badly. Unlike a lot of parts, yours is unlikely to be present in more than say 3-4 copies at a time, so you can actually afford to be pretty extreme with the model and not really worry too much.\u003Cp\u003EObviously lower/more efficient poly is better, but don\u0027t skimp on quality is what I am saying, there\u0027s no real harm in it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I see what you mean - it\u0027s the physics rather than the polys which drag KSP down, so such a large single entity = fewer parts = smoother running = polys matter less\u003C/p\u003E\u003Cp\u003EAs to balloons - I\u0027m going to such with airships for now. Heck, I still don\u0027t know if what I\u0027m planning is possible\u003C/p\u003E\n"},{"CreatedByName":"pizzaoverhead","CreatedById":26349,"CreatedDateTime":"2013-12-11T10:51:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EHow about some baloons? \u003Cp\u003ECompletly spherical\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou mean like a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Balloon_satellite\u0022 rel=\u0022external nofollow\u0022\u003Esatelloon\u003C/a\u003E?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/4/44/PAGEOS_Satellite_-_GPN-2000-001896.jpg\u0022 alt=\u0022PAGEOS_Satellite_-_GPN-2000-001896.jpg\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EOr with classic baloon shape.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://b-i.forbesimg.com/brucedorminey/files/2013/04/507004main_Bubble2.jpg\u0022 alt=\u0022507004main_Bubble2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese kind of aerostats would be more suitable for the Hooligan Labs mod as they\u0027re dynamic: You\u0027re changing their lift, and their shape depends on their altitude.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-11T13:58:06Z","Content":"\n\u003Cp\u003EI would love proper balloons (and airships), as they are a valuable part of research in the real world. HL aircraft never seemed usable considering the standards parts need to have to be used in my games.\u003C/p\u003E\u003Cp\u003EYou models are definitly going to need some normalmapping. You could get away with very few polygons that way. I also would suggest contacting the makers of the FireSpitter mod. I am not sure I like all their models, but their plugin could be invaluable and they have been very helpful to me in the past.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EWing with normalmapping; a section without normalmapping can be seen around the RAF roundel.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AxiY4Bc.png\u0022 alt=\u0022AxiY4Bc.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"whistlehead","CreatedById":79926,"CreatedDateTime":"2013-12-12T09:06:54Z","Content":"\n\u003Cp\u003EWhile my experience of texturing does not stray further than diffuse and alpha right now, I\u0027ve always wanted to develop further in these areas and I\u0027ll most certainly look into it.\u003C/p\u003E\u003Cp\u003EI don\u0027t think baloons are going to happen just yet - airships first.\u003C/p\u003E\u003Cp\u003EIt might actually be easier to start with a modern style airship, as this wouldn\u0027t require the visible ribs of older ships. It would also look better with current stock parts and Firespitter - so I wouldn\u0027tneed to think about my own engines or pods just yet, only the essentials - i.e. making it fly!\u003C/p\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2013-12-12T13:15:57Z","Content":"\n\u003Cp\u003EThis certainly seems interesting and i know i am interested to see where you take it. I know that once i learn C# i plan to start requiring the use of electricty to inflate the airships from HL.\u003C/p\u003E\n"}]}