{"TopicId":55860,"ForumId":51,"TopicTitle":"[WIP] Armchair\u0026#039;s KSP Adventures","CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2013-12-12T01:20:57Z","PageNum":1,"Articles":[{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2013-12-12T01:20:57Z","Content":"\n\u003Cp\u003EGreetings, KSP Forums.\u003C/p\u003E\u003Cp\u003EThe purpose of this thread is to create a public archive of the various missions and projects of the Armchair Aeronautics Space and Explosions Agency (AASEA).\u003C/p\u003E\u003Cp\u003EOur goals are as follows:\u003C/p\u003E\u003Cp\u003E1. Be mostly realistic for serious missions. This means no sending kerbals on 5-year flights in a command seat or similar shenanigans. If roleplaying conflicts with the game mechanics, roleplaying wins.\u003C/p\u003E\u003Cp\u003E2. Don\u0027t kill kerbals for no reason. This means sending probes to unknown destinations first, and no one-way trips.\u003C/p\u003E\u003Cp\u003E3. Use reusable vehicles where possible.\u003C/p\u003E\u003Cp\u003EMods used include: Mechjeb, Procedural Fairings, Procedural Wings, B9 Aerospace, and some edited config files.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-12T02:30:25Z\u0022 title=\u002212/12/2013 02:30  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 12, 2013\u003C/time\u003E by Armchair Rocket Scientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-12T01:25:16Z","Content":"\n\u003Cp\u003EI\u0027m awaiting for your first adventure. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2013-12-12T03:04:41Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ELaunch Systems\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAll the launch vehicles used by AASEA are based on the same basic concept: a fully reusable two stage rocket capable of reaching LKO and beyond. Any SRBs used separate only a few kilometers up and are recovered near KSC, while the first stage travels far out over the ocean. The second stage contains the \u0022brains\u0022 of the vehicle, and can operate in space for several days thanks to its onboard solar panels. The heat shield is only rated for reentry from LKO, but by aerobraking to said orbit before its final reentry, the stage can fly as far out as the orbit of Minmus and safely return.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAthos:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe Athos is the smallest launch vehicle commonly used by AASEA, but has all the features and capabilities of its larger siblings. Its capacity to LKO is 1 ton. While small, this is enough to send probes as far away as Eve and Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3ibJnul.png\u0022 alt=\u00223ibJnul.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPorthos:\u003C/strong\u003E Porthos is the newest of the three launchers. It was developed to fill the gap in payload capacity between the Athos and Aramis. Much of its hardware is borrowed from its siblings, including 4 LVT-45 engines from Athos and two SRBs from Aramis.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Qq53AT8.png\u0022 alt=\u0022Qq53AT8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAramis:\u003C/strong\u003E With a capacity of up to 16 tons to LKO, depending on how many SRBs are used, Aramis is current AASEA\u0027s heaviest launch vehicle. Among other payloads, it has launched large communications satellites to KSO and Molniya orbits, and space station modules into LKO. For even larger payloads, an \u0022Aramis Heavy\u0022 variant is being developed with two additional first stage cores cross-feeding fuel to the central one, providing a capacity of 27 tons to LKO.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GtiBw3y.png\u0022 alt=\u0022GtiBw3y.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2013-12-15T08:21:24Z","Content":"\n\u003Cp\u003ESo far, the Surveyor program has sent probes into orbit around both of Kerbin\u0027s moons and all the inner planets. Kerbin\u0027s nearest neighbors have attracted the most scientific interest; Duna with its red, dusty, yet strangely Kerbin-like surface, and Eve with its thick, cloudy atmosphere and alien seas. The orbiters have already provided a treasure trove of data - for instance, Eve\u0027s seas are a mixture of hydrocarbons similar to rocket fuel, and definitely not drinkable - but sometimes nothing beats actually being there.\u003C/p\u003E\u003Cp\u003EAs a result, Kerbal scientists developed the ADAM program. Its goal: to reach the surface of Eve. Two identical probes were built, each equipped with a variety of scientific instruments and extensively tested to make sure they could withstand the harsh conditions on Eve\u0027s surface (in a related story, Bob swears his hairdryer was stolen by someone in a lab coat. Bill and Jeb insist he simply lost it).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D9rW6tm.png\u0022 alt=\u0022D9rW6tm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe two probes were launched only hours apart, with ADAM 2 being wheeled out to the launch pad as soon as the concrete cooled. Both used an Athos launch vehicle, but with the SRBs replaced by two aerospike-powered boosters (no fuel crossfeed though: the Athos core stage lacks the necessary hardware). However, ADAM 2 actually beat its twin to Eve by several days - much to the relief of KSC staff, who were not looking forward to landing two probes at the same time.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YIPsE76.png\u0022 alt=\u0022YIPsE76.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter performing a final correction burn to place its projected landing site in Eve\u0027s oceans, ADAM 2 jettisoned its interplanetary cruise stage and plunged into Eve\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OC91pg8.png\u0022 alt=\u0022OC91pg8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEven during the fiery reentry, the probe was collecting data, analyzing the plume of ionized gases surrounding the vehicle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DINAxLT.png\u0022 alt=\u0022DINAxLT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce slowed down sufficiently, it jettisoned the scorched remnants of its ablative heat shield, deployed its parachute, and came in for a gentle splashdown.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/H7aGxSc.png\u0022 alt=\u0022H7aGxSc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HkyeBvE.png\u0022 alt=\u0022HkyeBvE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7c1DVyQ.png\u0022 alt=\u00227c1DVyQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EADAM 1\u0027s initial trajectory would have landed it in the ocean as well, but with ADAM 2\u0027s successful splashdown it instead put itself into a high orbit which would bring it down over land. Unfortunately, during the procedure a faulty command pointed the probe\u0027s solar panels away from the sun. By the time the mistake was realized, its batteries had died. Luckily, as it entered Eve\u0027s upper atmosphere aerodynamic forces forced it into a heatshield-first orientation and ripped away the cruise stage. A few minutes later, the little probe touched down safely on a hillside in Eve\u0027s highlands.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rwCr5lR.png\u0022 alt=\u0022rwCr5lR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mdoKBaa.png\u0022 alt=\u0022mdoKBaa.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/86hVDG9.png\u0022 alt=\u002286hVDG9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vTglU4X.png\u0022 alt=\u0022vTglU4X.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBoth probes are currently still operational, as is Surveyor Eve, which now acts as a data relay for them in addition to its primary mission.\u003C/p\u003E\u003Cp\u003ENext stop: Duna!\u003C/p\u003E\n"}]}