{"TopicId":55888,"ForumId":32,"TopicTitle":"simple is best!","CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-12-12T09:47:43Z","PageNum":1,"Articles":[{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-12-12T09:47:43Z","Content":"\n\u003Cp\u003Ei always struggled with spaceplanes. every time i over engineered them, used too many mods, prioritized looks over function...\u003C/p\u003E\u003Cp\u003Etoday i started my ksp and just threw together some stock parts. i didn\u0027t even check COM and COL.... and it worked like a charm. it flew like an angel and reached orbit with 3/4 oxidizer left!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.umluex.at/bilder/ksp/screenshot2.png\u0022 alt=\u0022screenshot2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESIMPLE IS BEST, FOLKS!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-12-12T09:50:02Z","Content":"\n\u003Cp\u003EGreat job, how\u0027s it land?\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-12-12T09:59:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EGreat job, how\u0027s it land?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.umluex.at/bilder/ksp/screenshot3.png\u0022 alt=\u0022screenshot3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Epiece of cake\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-12-12T10:21:16Z","Content":"\n\u003Cp\u003EIs it the angle, or is there a wing missing in that last picture?\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-12-12T10:28:02Z","Content":"\n\u003Cp\u003Ehaha you\u0027re right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E it looks like the wing is missing!\u003C/p\u003E\u003Cp\u003Ebut its only the angle of view.\u003C/p\u003E\n"},{"CreatedByName":"Vlk","CreatedById":57928,"CreatedDateTime":"2013-12-12T10:31:03Z","Content":"\n\u003Cp\u003EI don\u0027t want to be a jerk, but what are you going to do with all the oxidizer you spared? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(hmm, are those screenshots taken from different flights? the ratio of liquid fuel compared to oxidizer is better on the second shot than on the first)\u003C/p\u003E\u003Cp\u003Eedit: but still very effective, and nice looking ship, i am a fan of simplicity as well - since the career mode forced me to work with smaller parts\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-12T10:34:01Z\u0022 title=\u002212/12/2013 10:34  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 12, 2013\u003C/time\u003E by Vlk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-12-12T10:44:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vlk\u0022 data-cite=\u0022Vlk\u0022\u003E\u003Cdiv\u003EI don\u0027t want to be a jerk, but what are you going to do with all the oxidizer you spared? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could breathe it XD\u003C/p\u003E\n"},{"CreatedByName":"OneEyedShark","CreatedById":83582,"CreatedDateTime":"2013-12-12T10:45:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vlk\u0022 data-cite=\u0022Vlk\u0022\u003E\u003Cdiv\u003EI don\u0027t want to be a jerk, but what are you going to do with all the oxidizer you spared? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003E(hmm, are those screenshots taken from different flights? the ratio of liquid fuel compared to oxidizer is better on the second shot than on the first)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Emight be becuase it\u0027s two different flights?\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2013-12-12T11:29:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vlk\u0022 data-cite=\u0022Vlk\u0022\u003E\u003Cdiv\u003EI don\u0027t want to be a jerk, but what are you going to do with all the oxidizer you spared? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGiven that there\u0027s a lot of liquid fuel left too he could head on to the Mun. . . \u003C/p\u003E\u003Cp\u003EMy 2nd best spaceplane is also very small, the below is very easy to fly a solid as a rock:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XdAp9yhl.jpg%5D\u0022 alt=\u0022XdAp9yhl.jpg]\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy new best one can make orbit with \u0026gt;3000m/s DeltaV left. I\u0027v taken it to minmus and back, I\u0027m gonna see if it can make Duna:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0Ntr80ol.jpg\u0022 alt=\u00220Ntr80ol.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/VaHvLXtl.jpg\u0022 alt=\u0022VaHvLXtl.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-12T11:31:23Z\u0022 title=\u002212/12/2013 11:31  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 12, 2013\u003C/time\u003E by Bishop149\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-12-12T11:29:10Z","Content":"\n\u003Cp\u003Eit is one flight\u003C/p\u003E\u003Cp\u003Ebut i came in to steep and used the jets on my KSP approach -\u0026gt; more LF used.\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-12-12T12:04:09Z","Content":"\n\u003Cp\u003EYes, if your goal is to get an SSTO spaceplane to orbit, you\u0027re better off keeping it small and simple. Because of the 10:1 scaling issue you can build up more than half the necessary orbital speed using only jets, so it\u0027s pretty easy to get to orbit with even low-end parts once you know what you\u0027re doing. It makes a very good starting point for people who haven\u0027t tried spaceplanes yet; a lot of people really overbuild on their first attempt, simply because with rockets bigger usually IS better. (You should have seen my own first attempt. It was horribly overbuilt.) Of course, looking at your wings you\u0027re clearly clipping some parts, so it\u0027s hard to really gauge how heavy your design actually is.\u003C/p\u003E\u003Cp\u003EThe hard part comes when you try to add more to it than that basic orbital capability. Adding anything beyond that baseline requires a substantial investment in weight, which in turn requires more engine power and fuel to carry it, which quickly spirals out of control. Common culprits:\u003C/p\u003E\u003Cp\u003E\u0026gt; A lot of spaceplanes use an LV-N instead of an aerospike so that they can fly to other planets; besides the fact that the engine alone weighs 2.25 tons, an LV-N has too little engine power to get you to orbit if you\u0027re carrying enough fuel to actually get to those other bodies (or even Mun/Minmus in some cases), and that means stacking on some other low-efficiency propulsion as well just for the transition to orbit. (In 0.23 you\u0027ll be able to use SABERs for this, which\u0027ll help quite a bit.) Also, a 60kN engine like an LV-N can only hit a TWR of 2 on Mun if your design is 18 tons or less; any heavier, and you\u0027ll have problems taking off from Mun (or landing, for that matter), which really limits your destinations.\u003C/p\u003E\u003Cp\u003E\u0026gt; If you want to get all the way to Laythe, even an LV-N won\u0027t really be efficient enough unless you\u0027re very careful with your slingshots or remove absolutely every nonessential part to save weight. Now you\u0027re looking at putting ions on your design, which requires not only xenon and ion engines, but plenty of power generation as well (something a simpler spaceplane has no need for). Solar panels don\u0027t weigh much individually, but to get enough power to run two ions at full power you\u0027ll need a pretty good number of panels, plus batteries and possibly an RTG for emergency eclipses, and so on.\u003C/p\u003E\u003Cp\u003E\u0026gt; If you want to land on airless bodies, you need to either add a set of downward-firing rocket engines, or else add landing legs and ladders so that the plane can land on its tail. I personally prefer the second option, but either way will cost you about a half a ton of mass.\u003C/p\u003E\u003Cp\u003E\u0026gt; Then there\u0027s all the miscellanea. Science gear, lights, extra flaps for maneuverability and easy takeoffs on places like Laythe, docking ports, ladders, maybe a winch, RCS for docking, that sort of thing. Again, individually these don\u0027t weigh much, but it all adds up.\u003C/p\u003E\u003Cp\u003E(Also beyond a certain size you start needing struts to hold it all together rigidly, but for now those don\u0027t add mass.)\u003C/p\u003E\u003Cp\u003E\u0026gt; And finally, payload. A spaceplane that just gets a single kerbonaut to orbit is nice for bragging rights and all, but it\u0027s nothing you can\u0027t do far more easily with conventional rockets and they\u0027re capable of much more. But if you make one that can deliver a pair of ion-powered mapping probes capable of reaching Jool\u0027s moons, or carry kerbonauts to and from a space station, or that sort of thing? Now the design is useful, but this sort of thing has a tremendous cost in weight.\u003C/p\u003E\u003Cp\u003EDo all of that on one design, and the weight really starts piling up. Once you get above about 25 tons a 2-jet design just won\u0027t cut it any more, so you add a third jet, which adds another 1.2 tons and requires even more jet fuel... and then we hit the intake issue. To get enough intakes to lift a heavier design to orbit you either have to abuse the clipping exceptions, make a really ugly design, or use mods with bigger intakes (like B9) that have worse mass efficiencies, and that only gets worse once you add that third engine. In the end, you get something like my personal spaceplane, weighing in at about 34 tons:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qKHCx2D.png\u0022 alt=\u0022qKHCx2D.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s pretty, can fly to Laythe and back, handles beautifully in-atmosphere, and lands on airless moons without a problem. But it\u0027s definitely NOT small, especially not the version that carries those probes I mentioned.\u003C/p\u003E\u003Cp\u003ESo yeah, it\u0027s good to make those small spaceplanes at first. Just don\u0027t expect that to really work in the long term for all the things you\u0027re going to want to do.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-12T12:06:45Z\u0022 title=\u002212/12/2013 12:06  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 12, 2013\u003C/time\u003E by Spatzimaus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NQMT","CreatedById":79402,"CreatedDateTime":"2013-12-12T12:34:03Z","Content":"\n\u003Cp\u003ESimple, hey? Don\u0027t let Whackjob see this...\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-12-12T12:41:02Z","Content":"\n\u003Cp\u003Eat least i have a working design now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Enext step is to add a docking port and some 1man cans to make it a crew shuttle\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2013-12-12T12:49:39Z","Content":"\n\u003Cp\u003ESimple is nice. Some of my best designs started simple, getting complex as I needed more out of it. I\u0027ve gotten to orbit with twin LV-N\u0027s, but it was based on a plan to dock with a Rockomax Jumbo-64 in orbit and refuel from that, along with being able to carry it whenever it was needed to travel longer distances.\u003C/p\u003E\u003Cp\u003EAdmittedly, it was a horribly inefficient design, but it worked.\u003C/p\u003E\n"},{"CreatedByName":"Kanukki","CreatedById":92482,"CreatedDateTime":"2013-12-12T13:39:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmlÃƒÂ¼x\u0022 data-cite=\u0022UmlÃƒÂ¼x\u0022\u003E\u003Cdiv\u003Ei always struggled with spaceplanes. every time i over engineered them, used too many mods, prioritized looks over function...\u003Cp\u003Etoday i started my ksp and just threw together some stock parts. i didn\u0027t even check COM and COL.... and it worked like a charm. it flew like an angel and reached orbit with 3/4 oxidizer left!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks great, UmlÃƒÂ¼x. I\u0027m trying something similar, but not sure if it is design or piloting that is limiting my escape from Kerbin atmosphere. Any chance of a .craft link so we could give yours a try?\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-12-12T13:46:28Z","Content":"\n\u003Cp\u003EHm, so we might just as well forget about rockets, space planes are so much more efficient. Maybe a bit of re-balancing is in order...\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-12-12T13:57:04Z","Content":"\n\u003Cp\u003Esure: \u003Ca href=\u0022http://www.umluex.at/files/DaFraunz.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.umluex.at/files/DaFraunz.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ejust pull up to 10km, slowly level down until 20km, then build up speed and height. it is easily capable of 30km\u002B and 2000m/s\u002B on jets alone if you throttle down a bit.\u003C/p\u003E\u003Cp\u003Ehit 1 to shut down jets and fire up the spike.\u003C/p\u003E\n"},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2013-12-12T14:26:09Z","Content":"\n\u003Cp\u003EOf course, if you\u0027re not intending to go to space today, you can get very simple indeed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hardy.dropbear.id.au/assorted/ksp/thumper.png\u0022 alt=\u0022thumper.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kanukki","CreatedById":92482,"CreatedDateTime":"2013-12-12T14:28:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmlÃƒÂ¼x\u0022 data-cite=\u0022UmlÃƒÂ¼x\u0022\u003E\u003Cdiv\u003Esure: \u003Ca href=\u0022http://www.umluex.at/files/DaFraunz.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.umluex.at/files/DaFraunz.zip\u003C/a\u003E\u003Cp\u003Ejust pull up to 10km, slowly level down until 20km, then build up speed and height. it is easily capable of 30km\u002B and 2000m/s\u002B on jets alone if you throttle down a bit.\u003C/p\u003E\u003Cp\u003Ehit 1 to shut down jets and fire up the spike.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks so much, giving it a try now!\u003C/p\u003E\n"},{"CreatedByName":"Vlk","CreatedById":57928,"CreatedDateTime":"2013-12-12T15:01:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmlÃƒÂ¼x\u0022 data-cite=\u0022UmlÃƒÂ¼x\u0022\u003E\u003Cdiv\u003Eit is one flight\u003Cp\u003Ebut i came in to steep and used the jets on my KSP approach -\u0026gt; more LF used.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, i\u0027m just testing my math skills \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I think i made an error, but i think the retroburn to get back to the atmosphere is responsible for the values.\u003C/p\u003E\u003Cp\u003Eon the first picture the liquidfuel tank is 62%, the oxidizer is 73%\u003C/p\u003E\u003Cp\u003Eon the second, the li is 47%, the oxidizer is 52%\u003C/p\u003E\u003Cp\u003Eso you burnt 15% li, and 21% ox, and i thought that this is impossible, because you should have burned the same amount of ox and li, or more li. But now i realized that if you have a li tank, then burning in the atmosphere would burn more percentage of oxidizer - so its ok \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-12-12T15:07:39Z","Content":"\n\u003Cp\u003Ei think the values are misleading. i have one rocket tank and two pure fuel tanks on this, so the LF value is higher.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-12-12T15:15:38Z","Content":"\n\u003Cp\u003EYou seem to be packing a lot more monoprop than you need, too!\u003C/p\u003E\n"}]}