{"TopicId":56196,"ForumId":32,"TopicTitle":"Just what is the community to SQUAD?","CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-15T02:48:01Z","PageNum":7,"Articles":[{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-12-15T14:55:30Z","Content":"\n\u003Cp\u003EJust to put things into perspective. Just looked at joindota forums and took me all of 5 seconds to find a post that somes up a poor gaming community.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://forum.gamesports.net/dota/showthread.php?74689-Valve-hate-low-perf-pc-users\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.gamesports.net/dota/showthread.php?74689-Valve-hate-low-perf-pc-users\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBe gratefull for squad and the ksp community\u003C/p\u003E\n"},{"CreatedByName":"Simon Ross","CreatedById":82582,"CreatedDateTime":"2013-12-15T15:00:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vetrox\u0022 data-cite=\u0022vetrox\u0022\u003E\u003Cdiv\u003EJust to put things into perspective. Just looked at joindota forums and took me all of 5 seconds to find a post that somes up a poor gaming community.\u003Cp\u003E\u003Ca href=\u0022http://forum.gamesports.net/dota/showthread.php?74689-Valve-hate-low-perf-pc-users\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.gamesports.net/dota/showthread.php?74689-Valve-hate-low-perf-pc-users\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBe gratefull for squad and the ksp community\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESays it all really \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you really want to see toys out of the pram, try the Bethesda game forums. The almost childish entitlement attitude displayed there when the recent Fallout 4 news was proven to be a hoax for example.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-15T15:10:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022djnattyd\u0022 data-cite=\u0022djnattyd\u0022\u003E\u003Cdiv\u003ESeems to me that SQUAD can\u0027t win no matter what they do. People ask for resources and they\u0027re open with us, telling us that we\u0027ll get stock resources when they work properly and people complain that they don\u0027t have it now. People ask for more to do other than just Sandbox mode and they tell us that Career Mode is being actively worked on and people complain that they don\u0027t want Career Mode, they want Sandbox Multiplayer. They tell us that they\u0027re working on mutliplayer and people complain that they never asked for mutliplayer, they asked for resources and more contact from the devs. Realistically, the only option they have left is to not listen to the community and not tell us anything. \u003Cp\u003EAt this exact moment in time, we have resources with Kethane and EPL, we have multiplayer in KMP so we \u003Cem\u003Ecan\u003C/em\u003E wait for the official versions to be \u0022done when they\u0027re done\u0022. What we \u003Cem\u003Eneed\u003C/em\u003E is a finished, bug-free game, not accusations of dishonesty on SQUADs part.\u003C/p\u003E\u003Cp\u003ESeriously, if people think that SQUAD are being dishonest, non-transparent and not keeping to (self-imagined) promises, you should look at what Egosoft \u003Cem\u003Eactually\u003C/em\u003E promised and then delivered with X-Rebirth.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree 100% people think they are entitled to something the moment they buy into, however these are the same people who will buy a game and 2 months later buy a DLC that should have been in the game at its launch. KSP is still in development, meaning that resources might not be in now but they will most likely be in nearer to launch... you just have to give them time to work out the system they have currently. I would like to see somethings put into the game, but I also realize that some of the ideas are either too far out there, or just beyond the current scope for the game (Terraforming would be awesome, but it is not really foreseeable). I have seen a lot of people with SQUAD, and to be honest I am starting to become disappointed by the entitlist mentality of some of the community members. How many companies let you test a game this early in development and not charge you later for more? What other company lets you show videos or screenshots from an alpha without being punished for it? Most bigger company\u0027s I have tested for do not allow this, while you might get to test for free you end up having to pay when the game is release. You do have a right to be unhappy, but remember claim made about the game in its development is subject to change before release (it is in the EULA that no one ever reads).\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2013-12-15T15:14:39Z","Content":"\n\u003Cp\u003EWhew! This topic has been quite the read! I\u0027m not surprised the topic is getting so much attention but I do find it a bit sad. I guess a lot of this would have been deflected if people were playing 0.23 right now, though I guess there\u0027s no way to really know. My contribution is simply a few observations which have come up over my reading.\u003C/p\u003E\u003Cp\u003EFirst off is the \u0027remember how good things were before? now they are RUINED\u0027 mentality. Yeah, remember back in 0.19 when we didn\u0027t have career mode, there was no science, SAS was a hard, stuttering lock and Bac9 hadn\u0027t redone the KSC? Unless the game is going pay-to-win some time in the future, the game has done nothing but get better with each patch. It isn\u0027t native to this game, people tend to put rose colored glasses on for the past for reasons I guess were summed up in Watchmen, \u0022Every day, the future looks a little bit darker. But the past, even the grimy parts of it, keep on getting brighter.\u0022 It\u0027s a dumb sentiment unless a plague is currently wiping us out, the future is unanimously better than the past. The poorest person today is better off than the poorest person a hundred years ago. KSP is better now than it was ten patches ago.\u003C/p\u003E\u003Cp\u003ERegarding the fear of future development: is it just me or is this a case of \u0027missing the big picture\u0027? So, Felipe says, \u0022Look, we have to focus on what is going to make KSP a good game first and add cosmetic stuff later.\u0022 You wanted resources? You thought they were great? You HAVE Kethane. I want clouds, and rbay89 was so kind as to give them to us. It\u0027s clear Squad is going to focus on career mode first and foremost, multiplayer is end of development stuff. They said they\u0027ll probably implement some back end as they go along but first and foremost is completing the game. Here\u0027s my tea leaves: We know two things, the owners said they wanted to have KerbalKon next year, which supports we\u0027ll see another year of development at least and that the versioning scheme has been ticked up .01 per patch. If this is any indication to go off of, it looks to me like they expect to do quite a bit more development and aren\u0027t entirely flying by the seat of their pants. There is one bit of information being glossed over, probably because the \u0027victors\u0027 don\u0027t really think of it in terms of a potential problem.\u003C/p\u003E\u003Cp\u003EThe debacle about post-release DLC or expansions and how the people who bought in early got approval to get everything free forever! I don\u0027t know about you, but it looks like the community has been able to strong-arm Squad before, and it\u0027s likely why they are as hesitant now as they are to watch what they say. The game is new, it\u0027s expanding and the developers want to share what\u0027s going on. I mean, they are human, they are just as excited about what they do as we are. Developer tweets from indie studios has reached a fevered pitch. Now, I\u0027m not going to debate whether or not one side was right or wrong on this one, but you have to examine the implications of it. Squad said something, tried to change their mind and ultimately were forced into a position to comply. I believe them when they say this was not a pleasant experience for them, and I\u0027m sure that was their first real \u0027wake-up\u0027 call: shut the hell up or get burned at the stake.\u003C/p\u003E\u003Cp\u003ESo, in closing, I\u0027d like to address the resources chart. This may be news to some but Squad has LOTS of those charts lying around. They have written a TON of stuff down, discussed and planned many features they ultimately pushed off or are still finding ways to address. If they shared every design with us, our heads would explode. I\u0027m sure they\u0027ve played around with the idea of crafting or hats at some point. If you feel betrayed, please think of it this way : you are not the only person in the room. The player base expanded. Much as gaming has exploded over the last decade and casual gaming has become the norm, traditional (now referred to as \u0027core\u0027) gamers are in the minority. As KSP\u0027s number of users grow, the idea of what it should be or where it should go has also expanded. Just because you were here first doesn\u0027t mean that you know best, or that you own the game. Your share has been dwindling with each new purchase or forum sign-up. Whereas you are only selfish enough to see how you want the game to be, Squad has to distill community interest and see how it mixes with their own interest.\u003C/p\u003E\u003Cp\u003E\u0022Because [insert your feature here] is the feature KSP deserves, but not the one it needs right now.\u0022\u003C/p\u003E\u003Cp\u003EAlso I think Squad mostly does what it thinks will be fun, and if you can\u0027t enjoy your work I don\u0027t want to play anymore.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-15T15:21:25Z\u0022 title=\u002212/15/2013 03:21  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 15, 2013\u003C/time\u003E by Hyomoto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-12-15T15:19:10Z","Content":"\n\u003Cp\u003EAs our Community Manager Rowsdower said \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61749-Just-what-is-the-community-to-SQUAD?p=840509\u0026amp;viewfull=1#post840509\u0022 rel=\u0022external nofollow\u0022\u003Ein this thread\u003C/a\u003E:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rowsdower\u0022 data-cite=\u0022Rowsdower\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EListen, I plan on on grabbing some people and asking *them* for certain things that *you* would like to have clarified. Unfortunately, that will have to come on Monday when everyone will be back at 100%. \u003C/strong\u003EThe best I can do for you is to try to clear up any confusion that may exist during the course of the week.\u003Cp\u003EAll I ask is that at least for a while,\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Eplease just chill out a bit\u003C/strong\u003E\u003C/span\u003E. Dissenting opinions are fine, but name calling, ill wishes and threats to any member of this board will not be tolerated.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003ESo I think we should listen to him and calm down\u003C/strong\u003E. I hope everything will be clarified in the next few days. Most of the threads about resources and MP started all right but now it\u0027s mostly ad hominem and venting IMHO.\u003C/p\u003E\u003Cp\u003ELet\u0027s stay positive - Squad is not our enemy after all, they created the game we enjoy so much. \u003Cstrong\u003EThey deserve some credit of trust or at very least some chance to explain their position, don\u0027t you think?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo let\u0027s not turn this board into another example of \u003Ca href=\u0022http://tvtropes.org/pmwiki/pmwiki.php/Main/TheyChangedItNowItSucks\u0022 rel=\u0022external nofollow\u0022\u003EThey Changed It Now It Sucks\u003C/a\u003E and \u003Ca href=\u0022http://tvtropes.org/pmwiki/pmwiki.php/DarthWiki/RuinedFOREVER?from=Main.RuinedFOREVER\u0022 rel=\u0022external nofollow\u0022\u003ERuined Forever\u003C/a\u003E tropes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-15T15:26:18Z\u0022 title=\u002212/15/2013 03:26  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 15, 2013\u003C/time\u003E by czokletmuss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-15T15:22:22Z","Content":"\n\u003Cp\u003EP.S. It\u0027s spelled \u0022manager\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-15T15:22:36Z","Content":"\n\u003Cp\u003EThis. A thousand times this.\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-12-15T15:24:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003EP.S. It\u0027s spelled \u0022manager\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFunny, in Polish both versions are accepted, borrowed words and all that.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-15T15:25:12Z","Content":"\n\u003Cp\u003EI have nearly given up trying to have an civil conversation about the game at this, and it is not because of SQUAD but rather the community in general. While there are some who are nice to talk to it seems to have turned into a boiling pot of people looking for fault in the game. I do not feel some posters know truly what an ALPHA or a BETA really are, and believe this is the final product, heck look at MineCraft, it is released and still getting updated from its original format. Ok before I get all ranty again I will leave it at that.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-12-15T15:36:18Z","Content":"\n\u003Cp\u003EYeah, we\u0027ve all said our parts and pieces. Let\u0027s settle down and wait for response. And remember -- SQUAD just finished with huge event, and is about to release an update \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Not to mention it\u0027s almost Christmas time. Let\u0027s give them some peace, OK?\u003C/p\u003E\n"},{"CreatedByName":"glacierre","CreatedById":63209,"CreatedDateTime":"2013-12-15T15:52:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Liowen\u0022 data-cite=\u0022Liowen\u0022\u003E\u003Cdiv\u003EI have nearly given up trying to have an civil conversation about the game at this, and it is not because of SQUAD but rather the community in general. While there are some who are nice to talk to it seems to have turned into a boiling pot of people looking for fault in the game. I do not feel some posters know truly what an ALPHA or a BETA really are, and believe this is the final product, heck look at MineCraft, it is released and still getting updated from its original format. Ok before I get all ranty again I will leave it at that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe alpha concept is veeeery much abused in the late years (not talking specifically about KSP, a general trend). \u003C/p\u003E\u003Cp\u003EBesides, when people complains, some get shushed because \u0022you already got your game, the devs do not owe you anything\u0022, but on the other hand, when somebody complains they get shushed because \u0022you must understand it is still an alpha/beta\u0022.\u003C/p\u003E\u003Cp\u003EWell, it is one or the other, but not both. I am personally of the opinion that my money was 1.0, and that gives me some right to ask for more, not to get silenced with either lame excuse.\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-12-15T16:52:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vetrox\u0022 data-cite=\u0022vetrox\u0022\u003E\u003Cdiv\u003E You can tell the maturity of the ksp player base because they dont start correcting your spelling and grammar or racism when they cant argue any more\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECorrecting someone\u0027s racism. I like that. May I use it? I\u0027m not making fun or anything because I know what you mean but, I just like the way you said it. It made me smile and I have just the person at work I can use it on.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-15T17:03:11Z\u0022 title=\u002212/15/2013 05:03  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 15, 2013\u003C/time\u003E by dr_jt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-15T18:26:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hyomoto\u0022 data-cite=\u0022Hyomoto\u0022\u003E\u003Cdiv\u003E--snip--\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002BRep. So much \u002BRep. People need to hear this before things get bad.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2013-12-15T18:46:43Z","Content":"\n\u003Cp\u003EJust go with whatever you\u0027re given. Be grateful you have an already good game to play. Plenty of mods adds the stuff you\u0027re asking for (to an extent)\u003C/p\u003E\n"},{"CreatedByName":"Bekiekutmoar","CreatedById":23500,"CreatedDateTime":"2013-12-15T19:08:46Z","Content":"\n\u003Cp\u003ESome people seem to think Squad is heading south, but I think the soup isn\u0027t eaten as hot as it is served. While I\u0027m not too thrilled about the priority given to Multiplayer over Resources either, the increasing quality of some mods can counteract the lack of some features. For me at least. I\u0027m still confident the devs know what they\u0027re doing and the organisation Squad itself isn\u0027t adrift currently.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-12-15T19:19:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Javster\u0022 data-cite=\u0022Javster\u0022\u003E\u003Cdiv\u003EJust go with whatever you\u0027re given. Be grateful you have an already good game to play. Plenty of mods adds the stuff you\u0027re asking for (to an extent)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, I wasn\u0027t going to say anything until you posted this. I do not bare any ill will to Squad or the developers of KSP, but boy do I feel like they created a PR nightmare here that I honestly feel could have been totally avoided! We can argue the merits of resources and multiplayer until we\u0027re blue in the face, and that\u0027s fine. We can have debates about which one deserves to be in the game more (for the record I think it\u0027s resources, but that\u0027s not why I am writing this post), and that\u0027s fine too. I think most reasonable people can understand why squad would want to challenge themselves to trying to implement multiplayer, and I think most reasonable people would also understand why squad wants to make sure their resource management mechanic is accessible to everyone. That\u0027s all well and good.\u003C/p\u003E\u003Cp\u003EWhat I do NOT think is well and good is this idea that because a mod exists that implements a feature, that it should not be included as part of the stock game. Why shouldn\u0027t it? The devs have far more resources available than the modding community, and on top of everything they\u0027re getting paid for it. The modding community does what it does because it sees a demand that is being created by the fact that the game is still in development, but as the game develops it is perfectly reasonable to expect that demand to disappear. I can\u0027t speak for others on the forum but I myself see mods like Kethane, KAS, and FAR to be *placeholders* for the stock features they are filling in for, not *substitutions*. I hope that distinction is very clear to the developers, bless them all.\u003C/p\u003E\u003Cp\u003EI honestly feel like no game should rely on a third party outside of the developers and the intended audience in order to reach the state of gameplay it was supposed to be at to begin with. If you will forgive me for indulging in a slippery slope / strawman argument for a moment, a very respected video game analyst named Jim Sterling (you can catch his segment the Jimquisition at \u003Ca href=\u0022www.escapistmagazine.com\u0022 rel=\u0022external nofollow\u0022\u003Ewww.escapistmagazine.com\u003C/a\u003E) once detailed a phenomenon where triple-A game developers would do an awful job porting console games over to PC with the expectation that third party modders would fix the port\u0027s flaws. That is *not* okay! In my own experience, I could tell you the endless frustration I had playing orbiter because I struggled to sort out all the mods I needed for basic features such as sound, high-resolution textures, EVA, and more extraterrestrial bases, but orbiter gets a pass on that because it\u0027s a free program only done as a hobby to begin with.\u003C/p\u003E\u003Cp\u003EBut KSP does not need to, and in fact should not have to rely on third party modders for basic gameplay features! Now, we can argue what constitutes a basic gameplay feature, and I would say that a prime target for this debate would be Mechjeb. I love Mechjeb, and I think it\u0027s a very useful mod, but the base game already provides a myriad of tools that allow players to control and guide their own spacecrafts manually so Mechjeb isn\u0027t really necessary to complete the gameplay experience. Resources on the other hand do not even have a basic current implementation in the stock game, and so adding them is perfectly reasonable to expect. So you say \u0022well Kethane already does that so why not install Kethane?\u0022 Well, I\u0027ve already explained why games relying on third party support for things they should have done to begin with is not an okay thing, but besides that Kethane adds an entirely new gameplay mechanic rather than just augment or modify an existing one. I hope you can see why this is a completely different thing than Mechjeb simply providing more information and tools to guide your spacecraft from point A to point B which you can already do in the base game.\u003C/p\u003E\u003Cp\u003EUltimately the decision to add resources and/or multiplayer is squad\u0027s decision, and if they choose not to add one or the other you can bet there will be a host of mods to fill the demand. That said, I hope my post has made clear why third party modders should never have to do squad\u0027s work for them, and rather should create enhancements to existing features that give advanced players more tools to play with. And that\u0027s all I really have to say about that.\u003C/p\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-12-15T19:33:25Z","Content":"\n\u003Cp\u003EIn case anyone here wants to know what Squad actually thinks about your opinions:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/395muIk.png\u0022 alt=\u0022395muIk.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mmmmyum","CreatedById":85231,"CreatedDateTime":"2013-12-15T19:34:03Z","Content":"\n\u003Cp\u003EHonestly they\u0027ve made a good game, and it\u0027s their game to do so as they wish. I haven\u0027t really seen any promises of \u0027resources\u0027 or the like. Yes they\u0027ve said it\u0027s in the pipeline, but that doesn\u0027t mean it\u0027s a promise of things to come.\u003C/p\u003E\u003Cp\u003EWe paid to basically bug-test, and I love the game as it was released (0.21 for me). I just trust them with my $22 to not ruin the game and so far I haven\u0027t seen anything that will ruin it for me.\u003C/p\u003E\u003Cp\u003E(Haven\u0027t read the whole thread so I may sound stupid :/ )\u003C/p\u003E\n"},{"CreatedByName":"JebidiahsBigSister","CreatedById":85774,"CreatedDateTime":"2013-12-15T19:35:07Z","Content":"\n\u003Cp\u003EI\u0027m really surprised at he amount of griefing I\u0027m seeing on the boards lately. I\u0027ve been playing the game for a year and love what Squad has done. Yes there are some annoying glitches but the fact is that I have received more enjoyment from this game than any other since half-life. And frankly I can play KSP over and over as I get new ideas or try to duplicate someone else\u0027s - so vastly better than any half-life kind of game. Far more creative.\u003C/p\u003E\u003Cp\u003ESome people are just Debbie Downers and live to complain and ruin the fun for everyone else \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I really wish the big forum Poo-Bah would create a \u0022I want to complain\u0022 sub-forum so that all complaint threads could be moved there by mods and all the complainers would have a place to share with each other and everyone else could just ignore it and enjoy the game.\u003C/p\u003E\n"},{"CreatedByName":"Maxmaps","CreatedById":66172,"CreatedDateTime":"2013-12-15T19:38:07Z","Content":"\n\u003Cp\u003EI was asked about the community reaction I see, but honestly this is a good point as any to answer to this thread as a whole.\u003C/p\u003E\u003Cp\u003EThe community is everything to us, and you can look around and find the work that had already been done into resources. It was a hard pill to swallow but in the end even after all that work we had to admit to ourselves that the feature was not only out of our scope, but was ending up grindy and simply not fun to play with. It wasn\u0027t a pleasant or easy decision whatsover, but it had to be made. We hope you can understand this, and we hope you trust us enough to believe us when we say we want nothing else than for KSP to be the best game it can possibly be. Resources was sadly outside of it.\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-12-15T19:41:32Z","Content":"\n\u003Cp\u003EAnd this is what we\u0027re all expecting, a clear message to the community \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Maxmaps, could we expect more details about this in a form of dev article/post? It would explain everything once and for all and end all the speculation, which is IMHO a good idea right now.\u003C/p\u003E\n"},{"CreatedByName":"Niels","CreatedById":65015,"CreatedDateTime":"2013-12-15T19:42:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxmaps\u0022 data-cite=\u0022Maxmaps\u0022\u003E\u003Cdiv\u003EI was asked about the community reaction I see, but honestly this is a good point as any to answer to this thread as a whole.\u003Cp\u003EThe community is everything to us, and you can look around and find the work that had already been done into resources. It was a hard pill to swallow but in the end even after all that work we had to admit to ourselves that the feature was not only out of our scope, but was ending up grindy and simply not fun to play with. It wasn\u0027t a pleasant or easy decision whatsover, but it had to be made. We hope you can understand this, and we hope you trust us enough to believe us when we say we want nothing else than for KSP to be the best game it can possibly be. Resources was sadly outside of it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EScience is grinding\u003C/p\u003E\n"},{"CreatedByName":"Boakamxe","CreatedById":68863,"CreatedDateTime":"2013-12-15T19:43:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxmaps\u0022 data-cite=\u0022Maxmaps\u0022\u003E\u003Cdiv\u003EI was asked about the community reaction I see, but honestly this is a good point as any to answer to this thread as a whole.\u003Cp\u003EThe community is everything to us, and you can look around and find the work that had already been done into resources. It was a hard pill to swallow but in the end even after all that work we had to admit to ourselves that the feature was not only out of our scope, but was ending up grindy and simply not fun to play with. It wasn\u0027t a pleasant or easy decision whatsover, but it had to be made. We hope you can understand this, and we hope you trust us enough to believe us when we say we want nothing else than for KSP to be the best game it can possibly be. Resources was sadly outside of it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo is science and career mode\u003C/p\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-12-15T19:43:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxmaps\u0022 data-cite=\u0022Maxmaps\u0022\u003E\u003Cdiv\u003EI was asked about the community reaction I see, but honestly this is a good point as any to answer to this thread as a whole.\u003Cp\u003EThe community is everything to us, and you can look around and find the work that had already been done into resources. It was a hard pill to swallow but in the end even after all that work we had to admit to ourselves that the feature was not only out of our scope, but was ending up grindy and simply not fun to play with. It wasn\u0027t a pleasant or easy decision whatsover, but it had to be made. We hope you can understand this, and we hope you trust us enough to believe us when we say we want nothing else than for KSP to be the best game it can possibly be. Resources was sadly outside of it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m sorry that Squad felt the need to lead on the community for a year about resources and then crush their dreams. And if you feel that resources are too grindy then you have never played career mode.\u003C/p\u003E\n"},{"CreatedByName":"SpaceHips","CreatedById":176006,"CreatedDateTime":"2013-12-15T19:45:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxmaps\u0022 data-cite=\u0022Maxmaps\u0022\u003E\u003Cdiv\u003E~snip~.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo make it not grindy and more fun.\u003C/p\u003E\u003Cp\u003EIf something doesn\u0027t work properly, you change it in a way that makes it work.\u003C/p\u003E\u003Cp\u003EDon\u0027t be lazy.\u003C/p\u003E\n"}]}