{"TopicId":56200,"ForumId":16,"TopicTitle":"Kerbal lost in orbit! HELP!","CreatedByName":"GungaDin","CreatedById":92717,"CreatedDateTime":"2013-12-15T03:23:48Z","PageNum":1,"Articles":[{"CreatedByName":"GungaDin","CreatedById":92717,"CreatedDateTime":"2013-12-15T03:23:48Z","Content":"\n\u003Cp\u003EI accidentally stranded a Kerbal in orbit. He\u0027s been up there for hours by himself. I\u0027m in career mode so have limited parts so is there any way of rescuing him? Even if I had a 3 seat capsule which I don\u0027t yet - can you leave one seat empty?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-15T04:25:28Z","Content":"\n\u003Cp\u003EBefore leaving the VAB, you can click on the crew tab and choose to have more or fewer seats occupied. (You can also just have somebody get out later, if he\u0027s got a way to reach the ground safely.) Then you can fly close to the stranded guy, and have him fly to the rescue ship using his RCS backpack.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2013-12-15T04:48:04Z","Content":"\n\u003Cp\u003EOr there\u0027s the old \u0022get out and push!\u0022 Seriously, you can go EVA and maneuver him to be in \u0027front\u0027 of the capsule, then push it retrograde with the suit RCS. Once you get down to about 10% RCS propellant, go back into the capsule to recharge your RCS, then rinse and repeat until you\u0027re in the soup. If the capsule has any RCS capability left you can use that first, of course.\u003C/p\u003E\n"},{"CreatedByName":"Omicron314","CreatedById":59506,"CreatedDateTime":"2013-12-15T14:36:51Z","Content":"\n\u003Cp\u003EOr, if your craft is equipped with a docking port, you can build a small craft with a fuel tank and engine, dock with your craft, and deorbit using your probe as an engine.\u003C/p\u003E\u003Cp\u003EIt (kind of) works if you don\u0027t have a docking port attached, to. You can position yourself so that you are \u0022ahead\u0022 of the stranded capsule in orbit and slowly burn towards it. It\u0027s the same concept as \u0022get out and push\u0022 only much, much faster.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-12-15T14:42:16Z","Content":"\n\u003Cp\u003EIf you have a pod with more then 1 seat you can use the crew tab in the VAB to remove some of the crew leaving empty seats. Or the low tech way is to just have some of the crew EVA on the launchpad, you can recover them later since they are already \u0027landed\u0027.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t have a pod with more then 1 seat, but have a probe core, you can build a ship with both a capsule and a probe core, and using the crew tab remove the pilot and let the probe core fly the empty ship to your stranded kerbal.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-12-15T15:29:45Z","Content":"\n\u003Cp\u003EYou can build a craft with 2 command pods. Make sure 1 of the pods is empty, and randevous with the stranded kerbal. Get in the spare pod, and land both\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-15T16:35:11Z","Content":"\n\u003Cp\u003EAlso, try to minimize burning the rescuee\u0027s EVA fuel during your rendezvous: If your first rescue attempt doesn\u0027t work, you want to be sure the poor guy has enough left over for a second attempt.\u003C/p\u003E\u003Cp\u003EAnd a third...\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-12-15T16:41:21Z","Content":"\n\u003Cp\u003ERendezvous, but just use a satyputnik with a 1kerbal pod underneath.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-15T17:02:15Z","Content":"\n\u003Cp\u003ESimple Career mode rescue\u0026amp;descent module - you can build any kind of lifter you want below it.\u003C/p\u003E\u003Cp\u003EMake sure you:\u003C/p\u003E\u003Cp\u003E- open all three chutes BEFORE you decouple pods from the body\u003C/p\u003E\u003Cp\u003E- decouple all three decouplers at once, low enough in atmosphere (~3000 m)\u003C/p\u003E\u003Cp\u003EThen you can be sure they will keep together till they reach the ground/ocean and will all survive.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NhNoo9M.jpg\u0022 alt=\u0022NhNoo9M.jpg\u0022\u003E\u003C/p\u003E\n"}]}