{"TopicId":56319,"ForumId":44,"TopicTitle":"My first (blurry) image of Jupiter, zoomed in 6x!","CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2013-12-16T03:38:55Z","PageNum":1,"Articles":[{"CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2013-12-16T03:38:55Z","Content":"\n\u003Cp\u003ETook this image with my iPhone:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i43.tinypic.com/jv2fif.jpg\u0022 alt=\u0022jv2fif.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m pretty sure this is a \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Every\u003C/span\u003E blurry image of Jupiter. IDK if any moons are in the image. Please tell me if there are.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-12-16T03:45:34Z","Content":"\n\u003Cp\u003EThat\u0027s some pretty nice zoom, although you might wanna buy a telescope to get some better pictures. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"check","CreatedById":71875,"CreatedDateTime":"2013-12-16T03:52:28Z","Content":"\n\u003Cp\u003EWhen (exact time and day) was this taken? What were the camera settings when you took this image? Is this image cropped? Is that\u0027s why it\u0027s so small? Which direction is north/east or \u0027up\u0027 ?\u003C/p\u003E\u003Cp\u003EStretching the levels in the image, there is a spot near Jupiter (presumably) that\u0027s brighter than the image noise which MIGHT be a moon if you\u0027re super lucky, or a background star... or just image noise. Hard to tell, but if you answer the above questions then maybe we can make some more sense of it.\u003C/p\u003E\u003Cp\u003EEdit: also, could you please post the original, uncropped, image and confirm that the zoom is exactly 6x? If we know the field of view of the image and the exact time it was taken, it\u0027ll be fairly straight forward to overlay the image onto a screenshot of planetarium program and see if anything lines up.\u003C/p\u003E\u003Cp\u003EEdit2: missed the part where you said it was taken with an iPhone... yeah, that\u0027s very unlikely if not impossible that you\u0027d be able to image a moon of Jupiter. Digital \u0027zoom\u0027 is not actually zoom. it\u0027s just stretching an image digitally and not adding to your ability to resolve anything.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T22:46:13Z\u0022 title=\u002212/16/2013 10:46  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by check\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2013-12-16T03:52:38Z","Content":"\n\u003Cp\u003EThere\u0027s a very tiny dot that I think might be Ganymede. Might just be noise tho =P\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/22015656/ganymede.png\u0022 alt=\u0022ganymede.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EActually I\u0027m making all kinds of assumptions here about the orientation of the image, but I thought the brightness falloff and the hue being very different from the surrounding noise might mean it\u0027s not noise.\u003C/p\u003E\u003Cp\u003EIt\u0027s roughly 9,5 jupiters away from jupiter, meaning it\u0027s about 600 000-700 000 km away, and that puts it within the orbit of Ganymede, and Ganymede is the largest moon.\u003C/p\u003E\u003Cp\u003EEdit: I was apparently wrong on all accounts =P\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T20:03:51Z\u0022 title=\u002212/16/2013 08:03  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by maccollo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-12-16T04:20:05Z","Content":"\n\u003Cp\u003EI didn\u0027t realize Ganymede could appear that far away from Jupiter at x6 magnification.\u003C/p\u003E\u003Cp\u003EI used to have an eight inch reflector and I could see faint color bands and about three moons very close to Jupiter.\u003C/p\u003E\u003Cp\u003EI never though to pay attention to objects farther out as I assumed they where stars.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-16T06:26:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maccollo\u0022 data-cite=\u0022maccollo\u0022\u003E\u003Cdiv\u003EIt\u0027s roughly 9,5 jupiters away from jupiter\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not. Jupiter is about 10\u003Csup\u003E-4\u003C/sup\u003E at closest approach, which means that even with optical 6x zoom, it\u0027s going to be just a dot. You need a stronger zoom before you can see that it has diameter. The fact that the spot on that image has some size is strictly an artifact of the optics and the way digital zoom was performed.\u003C/p\u003E\u003Cp\u003EYou will not see any moons without a telescope.\u003C/p\u003E\u003Cp\u003EEdit: Ok, here we go. iPhone 4S and 5 resolve at about 3x10\u003Csup\u003E-4\u003C/sup\u003E. (Older models are worse.) So I was a bit off. If that 6x zoom was optical, you\u0027d be just able to see that it\u0027s not a point, assuming no problems with aberrations. But the zoom is digital, so the apparent diameter on the image is just an artifact.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T06:47:38Z\u0022 title=\u002212/16/2013 06:47  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-12-16T17:40:09Z","Content":"\n\u003Cp\u003EOne night a few years ago when Jupiter was closest I could see the four largest moons without a telescope.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-12-16T18:05:07Z","Content":"\n\u003Cp\u003EDigital zoom is useless, don\u0027t ever use it. It is just stretching an image over the screen and ruining it. I always disable such things on any camera I use.\u003C/p\u003E\u003Cp\u003EYour iPhone can\u0027t resolve the sphere of Jupiter, let alone its satellites. If you see anything more than a pixel, it\u0027s a compression artifact.\u003C/p\u003E\u003Cp\u003ETake fairly powerful binoculars and put it in front of the camera lens (good luck with that) and you might be able to take a photo of a blob and few points beside it, something like this or probably even worse.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://2.bp.blogspot.com/_1c6uKfrEfj0/SrRsvzEoYhI/AAAAAAAAD_0/rBVh-DyAvDk/s400/jupiter.jpg\u0022 alt=\u0022jupiter.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SFJackBauer","CreatedById":82269,"CreatedDateTime":"2013-12-16T19:05:08Z","Content":"\n\u003Cp\u003ESome binoculars and even telescopes are cheaper than an iPhone. Use the right tool for the right job.\u003C/p\u003E\u003Cp\u003EThe experience of seeing with your naked eyes through an eyepiece Mars, Jupiter and Saturn, or the Orion\u0027s Nebula is one of the things you will never forget.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-12-16T19:16:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TechnicalK3rbal\u0022 data-cite=\u0022TechnicalK3rbal\u0022\u003E\u003Cdiv\u003EOne night a few years ago when Jupiter was closest I could see the four largest moons without a telescope.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf by \u0027without a telescope\u0027 you mean \u0027with binoculars\u0027, fair enough. If you mean \u0027with your naked eyes\u0027... let\u0027s just say it\u0027d be a first.\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-12-16T19:18:20Z","Content":"\n\u003Cp\u003EApparently it was a first. Or are there four planes flying in circles around where Jupiter is in the sky?\u003C/p\u003E\u003Cp\u003EEDIT Galileo Galilei, the famous astronomer, also saw the same four, which is why their called the Galilean moons.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-16T19:34:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TechnicalK3rbal\u0022 data-cite=\u0022TechnicalK3rbal\u0022\u003E\u003Cdiv\u003EEDIT Galileo Galilei, the famous astronomer, also saw the same four, which is why their called the Galilean moons.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne other thing that\u0027s called \u0022Galilean\u0022 is a type of telescope. I\u0027m going to let you work out the connection.\u003C/p\u003E\u003Cp\u003EEdit: That might have come out more mean than I intended it to be. Sorry, I just couldn\u0027t miss this setup.\u003C/p\u003E\u003Cp\u003EOn the more useful note, Galilean moons are going to be somewhere in the 4.5 - 5.5 magnitude range when optimal for viewing. That\u0027s right at the edge of human vision. The viewing angle is going to be in the .5 - 2 x 10\u003Csup\u003E-3\u003C/sup\u003E. Which is \u003Cem\u003Ealso\u003C/em\u003E right at the edge of human vision. If it were just the moons, a person with absolutely perfect vision, on an absolutely clear, moonless night, with absolutely no light pollution, would be just able to make out that there is something there. Being able to say, \u0022Oh, there are four points of light in arrangement consistent with Galilean moons,\u0022 would already be superhuman.\u003C/p\u003E\u003Cp\u003EBut even this hypothetical ability to make out that there is something there is completely ruined by the fact that Jupiter is going to be something like -2.5 magnitude, or about 1,000 times brighter than the moons. Optical aberrations from Jupiter\u0027s light will overpower any light from the moons. Sorry. It\u0027s absolutely impossible without using some kind of optics other than your eye.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T19:46:59Z\u0022 title=\u002212/16/2013 07:46  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-12-16T22:10:18Z","Content":"\n\u003Cp\u003ETechnicalK3rbal, what you \u003Cem\u003Eprobably\u003C/em\u003E saw was some abberation of Jupiter\u0027s light from your astigmatism. We all, at least to some extent, have errors in our cornea shapes, which makes stars look like they have spikes. I have actual diagnosed astigmatism so without lenses, I see ****. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt is impossible to see all four of them. Human eyes don\u0027t have such acuity. But with really good sight and in excellent conditions, if you cover Jupiter with a thin powerline or something like that, you might see Ganymede and Callisto, because otherwise Jupiter\u0027s brightness outshines them all.\u003C/p\u003E\u003Cp\u003EThere are rare people that can see the crescent of Venus, and that\u0027s a bit easier task.\u003C/p\u003E\n"},{"CreatedByName":"JebidiahsBigSister","CreatedById":85774,"CreatedDateTime":"2013-12-17T12:34:46Z","Content":"\n\u003Cp\u003E\u003Cem\u003E You will not see any moons without a telescope.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ENot in fact true - when I was younger and an amateur astronomer I could regularly see Ganymede and Castillo on a clear dark night at max elongation. You have to live outside of a city and have pretty good vision and a map of when the moons will be at max elongation from the planet (sky and telescope used to have such maps).\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-12-17T17:04:24Z","Content":"\n\u003Cp\u003EDont worry....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T19:16:59Z\u0022 title=\u002212/17/2013 07:16  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by montyben101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-17T17:18:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JebidiahsBigSister\u0022 data-cite=\u0022JebidiahsBigSister\u0022\u003E\u003Cdiv\u003E\u003Cem\u003E You will not see any moons without a telescope.\u003C/em\u003E\u003Cp\u003ENot in fact true - when I was younger and an amateur astronomer I could regularly see Ganymede and Castillo on a clear dark night at max elongation. You have to live outside of a city and have pretty good vision and a map of when the moons will be at max elongation from the planet (sky and telescope used to have such maps).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s optically impossible. You can say as much as you want that you have seen it, but even at maximum elongation, light from Jupiter proper is too strong to make it possible to see something that\u0027s 2x10\u003Csup\u003E-3\u003C/sup\u003E away without some sort of an aid. Like lajoswinkler pointed out, you can use something to obstruct light from Jupiter and then just be able to see these, but there is absolutely no way to see them without doing something. Human eye can\u0027t do it. Period.\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-12-17T17:21:40Z","Content":"\n\u003Cp\u003EI find it hard to believe you could see make out the moons with the naked eye as jupiter is just so damn bright. Even through a telescope the moons just look like stars. Jupiter and m42 (i think m42..the nebulae in orion) are probably the easiest to see objects in the winter sky. Easy to find, great to look at. M42 is visible with the naked eye in low light polluted skies its basically orions junk.\u003C/p\u003E\u003Cp\u003EJupiter and moons taken with my phone through a telescope at 45xmagnification (by just holding the phone up to the eyepiece)\u003Ca href=\u0022http://s121.photobucket.com/user/Vindi06/media/DSC_0132.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i121.photobucket.com/albums/o231/Vindi06/DSC_0132.jpg\u0022 alt=\u0022DSC_0132.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESame again at 90x\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s121.photobucket.com/user/Vindi06/media/DSC_0142.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i121.photobucket.com/albums/o231/Vindi06/DSC_0142.jpg\u0022 alt=\u0022DSC_0142.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJupiter with a webcam (not a very good attempt btw) but very similar to what jupiter actually looks like through a small telescope.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s121.photobucket.com/user/Vindi06/media/jupiterimg3_zps3e551929.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i121.photobucket.com/albums/o231/Vindi06/jupiterimg3_zps3e551929.png\u0022 alt=\u0022jupiterimg3_zps3e551929.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E@OP\u003C/p\u003E\u003Cp\u003EIt may well be jupiter. However, from the ground jupiter just looks like another star in the sky (although its a pretty obvious one) when taken with a phone it will still just look like a star. Also i think the iphone only has digital zoom. So you are not looking at it with 6x mag. Its more of a zoomed in 1x image.\u003C/p\u003E\u003Cp\u003EIf you are interested in looking at the planets you can get some fairly cheap telescopes that will do an excellent job.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T17:38:27Z\u0022 title=\u002212/17/2013 05:38  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by vetrox\u003C/strong\u003E\n\u003Cbr\u003EChanged m21 to m42\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-12-17T17:26:49Z","Content":"\n\u003Cp\u003Emontyben101, that\u0027s a blurred, out of focus image of a dot. There are many nutters on the interwebs talking all kinds of stupid stuff based on such images. I just wanted to point that out...\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-12-17T17:30:26Z","Content":"\n\u003Cp\u003EVetrox,\u003C/p\u003E\u003Cp\u003EYou\u0027re thinking of M42, not M21.\u003C/p\u003E\u003Cp\u003EWhich is confusing, because you mention M42 in your post. M21 is not in the winter sky, and, being an open cluster, it\u0027s a boring object. Open clusters suck. Ok, some are kinda pretty, but nebulae and galaxies are just so much more interesting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T17:33:07Z\u0022 title=\u002212/17/2013 05:33  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-12-17T17:38:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EVetrox,\u003Cp\u003EYou\u0027re thinking of M42, not M21.\u003C/p\u003E\u003Cp\u003EWhich is confusing, because you mention M42 in your post. M21 is not in the winter sky, and, being an open cluster, it\u0027s a boring object. Open clusters suck. Ok, some are kinda pretty, but nebulae and galaxies are just so much more interesting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeh i edited my post when i noticed the mistake!\u003C/p\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2013-12-17T17:49:43Z","Content":"\n\u003Cp\u003EHere\u0027s a few I took with an off-the-shelf digital compact (among other gadgets) last year...\u003C/p\u003E\u003Cp\u003EThe Moon, Jupiter and M45 (AKA Pleiades cluster), along with Aldebaran, Alnath, Kabdhilinan to name but a few of the brightest stars in Taurus and Auriga and the head of Orion. 2s exposure, 10sec delay on a tripod, and a bit of mask cropping and stacking on the not-Moon region to bring it up a bit\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://scontent-a-ams.xx.fbcdn.net/hphotos-ash2/530912_198007373668601_965234180_n.jpg\u0022 alt=\u0022530912_198007373668601_965234180_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EM45 with a webcam:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-prn1/1017573_303194393149898_775215124_n.jpg\u0022 alt=\u00221017573_303194393149898_775215124_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMoon with a Motorola V3i and a Celestron 90AZ refractor, K20 eyepiece (yes those eyepieces really do suck)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-c-a.akamaihd.net/hphotos-ak-ash3/941218_290548911081113_2140095972_n.jpg\u0022 alt=\u0022941218_290548911081113_2140095972_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethe dim \u0022star\u0022 above-centre-left, below the bright pair, is IC434, the emission nebula which contains the Horse Head Nebula (Barnard 33). Below-centre-right is another dim \u0022star\u0022. This is the bright spot of M42, the Orion Nebula. You can just make out the brightest bits of wisp, which isn\u0027t shoddy considering it was an 8 second exposure! The aberrations around the stars are caused by high altitude ice and the fact that the optics are far from perfect.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-prn1/21719_205972342872104_1297845460_n.jpg\u0022 alt=\u002221719_205972342872104_1297845460_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThree days ago I did a timelapse experiment with a JVC camcorder and captured 69 minutes of the sunrise, condensed into 67 seconds. Came up pretty nice. I\u0027ve also captured multiple lightning strikes on my digital compact, which is a feat in itself... this one\u0027s a single frame with six(!) bolts: four air and two ground strikes!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-h-a.akamaihd.net/hphotos-ak-frc3/1072307_317939368342067_2115202811_o.jpg\u0022 alt=\u00221072307_317939368342067_2115202811_o.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T18:19:58Z\u0022 title=\u002212/17/2013 06:19  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by ihtoit\u003C/strong\u003E\n\u003Cbr\u003Efixed oops\n\u003C/span\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2013-12-17T18:07:41Z","Content":"\n\u003Cp\u003Eihtoit,\u003C/p\u003E\u003Cp\u003EThe Pleiades are M45. I always wondered why M45 was included in the Messier catalog (M44 is another one that is impossible to confuse with a comet, at least with any kind of telescope...). I think that Charles Messier, while maybe his original intention was a catalog of objects that might be mistaken for comets, must have branched out a bit and just decided to include a few undeniably stellar objects. It makes you wonder why he didn\u0027t include the Double Cluster though.\u003C/p\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2013-12-17T18:16:41Z","Content":"\n\u003Cp\u003Eyep spotted and corrected, ta!\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-17T18:57:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vetrox\u0022 data-cite=\u0022vetrox\u0022\u003E\u003Cdiv\u003EI find it hard to believe you could see make out the moons with the naked eye as jupiter is just so damn bright.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I\u0027m trying to get simulation going that shows exactly what an image of Jupiter and moons looks like on human retina. Just need to get the right numbers for the aberration coefficients, but I think I found what I need in the articles.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-12-17T19:23:06Z","Content":"\n\u003Cp\u003EYou guys are making me really miss my telescope now.\u003C/p\u003E\n"}]}