{"TopicId":56325,"ForumId":51,"TopicTitle":"Mini-SSTO Satellite Deployer!","CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2013-12-16T04:16:43Z","PageNum":1,"Articles":[{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2013-12-16T04:16:43Z","Content":"\n\u003Cp\u003ESorry if you were expecting some awesome craft that could release multiple satellites into orbit and land safely. This would be a good goal to strive towards in the future, but I\u0027m not there yet. \u003C/p\u003E\u003Cp\u003EAnyway.\u003C/p\u003E\u003Cp\u003EAfter a flawless liftoff, the Mini-Boost mk2 SSTO rocket (with only ~728 gallons of fuel!) blasted up into space, attaining an orbit of 120x170 km. This was achieved with five mini engines mounted to the bottom Apollo style. (Yes, I know the pylons on the bottom aren\u0027t needed at all, but they add to that Apollo look! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E) \u003C/p\u003E\u003Cp\u003EAfter a successful jettison of the first stage, the second stage engines (two of the really miniscule radially mounted ones) ignited to bring the craft\u0027s apoapsis up into a Munar encounter. Using the same engines, the craft decelerated to a 38x40km Mun orbit, still with about 25% of its fuel left for course corrections.\u003C/p\u003E\u003Cp\u003EThe satellite, which is probably the simplest thing I\u0027ve ever put into another celestial object\u0027s SOI, contains two nontracking solar panels, two miniature fuel tanks, two engines, a probe core and an antenna for ground communications. Not the most sophisticated craft ever, but it\u0027ll do its job.\u003C/p\u003E\u003Cp\u003EYou may be wondering why I\u0027ve posted this obscenely simple, insignificant craft. The reason is that I\u0027ve been completely unable to build an effective, light SSTO that takes off vertically (I created a very effective plane-style SSTO in KSP 0.17, but nothing much since then). I\u0027ve finally cracked the SSTO code. My strategy is to use a lot of small, fuel-efficient motors. The craft should be carrying a very small payload relative to its size. And, of course, fin-lookalike pylons always help.\u003C/p\u003E\u003Cp\u003EHere is a Youtube video of the flight:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/BAS8gzwgB54?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EI\u0027ll include the .craft if enough people request it, although I don\u0027t think there\u0027s much of a need.\u003C/p\u003E\u003Cp\u003EHave a nice day!\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-12-16T04:29:11Z","Content":"\n\u003Cp\u003EVery nice. Tiny rockets are cool.\u003C/p\u003E\n"},{"CreatedByName":"koshelenkovv","CreatedById":53764,"CreatedDateTime":"2013-12-16T19:22:29Z","Content":"\n\u003Cp\u003EAwesome rocket!\u003C/p\u003E\u003Cp\u003ETruly, the less is the more.\u003C/p\u003E\n"}]}