{"TopicId":56360,"ForumId":16,"TopicTitle":"Best way to stabilize stages with multiple engines?","CreatedByName":"Grant_","CreatedById":95484,"CreatedDateTime":"2013-12-16T14:55:40Z","PageNum":1,"Articles":[{"CreatedByName":"Grant_","CreatedById":95484,"CreatedDateTime":"2013-12-16T14:55:40Z","Content":"\n\u003Cp\u003ERight now the rocket has 5 Mainsail, 4 Skipper and 3 Atomic Engine. Unfortunately the Atomic engine section is making it very unstable....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022%5Bimg%5Dhttp%3A//i.imgur.com/8YMyTXg.png\u0022 alt=\u00228YMyTXg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI tried some girders but it didn\u0027t fit perfectly and didn\u0027t seem to help. Is there a better way besides adding as many struts as possible? \u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T00:14:36Z\u0022 title=\u002212/18/2013 12:14  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by Grant_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fett2oo5","CreatedById":77444,"CreatedDateTime":"2013-12-16T16:02:11Z","Content":"\n\u003Cp\u003EI\u0027ll take a guess that the connection failure is at that 1.25m fuel tank? You\u0027ve got a lot of weight balancing on a \u0022toothpick\u0022 between your larger fuel tanks.\u003C/p\u003E\u003Cp\u003EBaring a significant design change, try using the same size tanks throughout.\u003C/p\u003E\u003Cp\u003EIf you are set on using this fuel tank configuration connect the 2.5m tanks that are on top and bottom of the 1.25m tank with 6-8 symmetrical struts. That might solve the immediate problem.\u003C/p\u003E\u003Cp\u003EOf the two above, I suggest using 2.5m tanks for the entire craft, as you have with most of your design.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T16:07:24Z\u0022 title=\u002212/16/2013 04:07  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by Fett2oo5\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-12-16T16:20:36Z","Content":"\n\u003Cp\u003EEfficient strutting is what you need:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.smidgeindustriesltd.com/truss-n-strut.jpg\u0022 alt=\u0022truss-n-strut.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn your case, use 3-way symmetry so the trusses are between (not underneath) the second stage engines, and strut up diagonally in both directions.\u003C/p\u003E\u003Cp\u003EWhere is that probe going? Seems awfully overbuilt even for a tour of the Jool system.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"running","CreatedById":82033,"CreatedDateTime":"2013-12-16T16:23:48Z","Content":"\n\u003Cp\u003EWhat worked for me a lot of times... (assuming your break is between the fuel tanks):\u003C/p\u003E\u003Cp\u003EUse the small structural cube thingy. (name?) place it on 4 (or more sides) above and below where the 2 tanks meet (and break).\u003C/p\u003E\u003Cp\u003EThen connect a strut from the lower right conrner of the top cube, to the upper left corner of the lower cube, creating a cross (do this on all sides ofcourse)\u003C/p\u003E\u003Cp\u003E(You can do the same even if there is more stuff in between like a decoupler and engine.)\u003C/p\u003E\u003Cp\u003EFor me that makes the rocket a lot stronger. However as stated above, this design is quite extreme in it\u0027s large weight ontop.\u003C/p\u003E\u003Cp\u003E- You could use smaller tanks (as in thickness) to which you attach the nukes (and add more tanks without a nuke) to keep the top mass closer to the center. \u003C/p\u003E\u003Cp\u003E- You could attach a few small SRB\u0027s to the top tanks (the ones with the nukes) that pull on the rocket during lift of instead of the balancing act from the bottom. You might run into trouble when they run out and you are still doing the balancing act. \u003C/p\u003E\u003Cp\u003E- For the 3 engines and tanks below the nukes I would also look into smaller engines and more slimmer tanks to keep the mass closer to the center.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-12-16T17:00:24Z","Content":"\n\u003Cp\u003EYou don\u0027t even need trusses to truss the gap between the Skipper stage and the LV-N stage: just run struts from the bottom tank to the top tank. I\u0027d recommend 4 struts going straight up, unless you have a lot of torsion.\u003C/p\u003E\u003Cp\u003EOther than that, there\u0027s lots to critique about your rocket, if you\u0027re interested. You could build a much smaller one and still get as much range.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-12-16T17:33:29Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EIf the girders aren\u0027t helping take them out.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore boosters, this will allow you to get rid of the tri-tanks on the second stage\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore Struts, depending on where the failure is happening at every joint, and make a strut cage around that lone LV-N in the middle.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt could just be me, but it looks like your lower stage is going into a fuel loop try Asparagus staging.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr Tegu","CreatedById":76643,"CreatedDateTime":"2013-12-16T17:37:54Z","Content":"\n\u003Cp\u003EAs running stated: If you pull all of the booster stages closer to the principle axis you will reduce the bending moments caused and thus improve the stability and strength of the rocket considerably (as well as saving a little mass too). Locking the gimbals on the outer engines will also help.\u003C/p\u003E\u003Cp\u003EEdit: You seem to have attempted to use asparagus staging on the lower boosters but symmetry mode has messed things up for you. You need to place each crossfeed individually.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T17:43:40Z\u0022 title=\u002212/16/2013 05:43  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by Mr Tegu\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Grant_","CreatedById":95484,"CreatedDateTime":"2013-12-16T20:00:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Smidge204\u0022 data-cite=\u0022Smidge204\u0022\u003E\u003Cdiv\u003EEfficient strutting is what you need:\u003Cp\u003EIn your case, use 3-way symmetry so the trusses are between (not underneath) the second stage engines, and strut up diagonally in both directions.\u003C/p\u003E\u003Cp\u003EWhere is that probe going? Seems awfully overbuilt even for a tour of the Jool system.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHopefully Moho and the Sun, but right now I\u0027m experimenting with maximizing my dV (16 000 atm).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fett2oo5\u0022 data-cite=\u0022Fett2oo5\u0022\u003E\u003Cdiv\u003EI\u0027ll take a guess that the connection failure is at that 1.25m fuel tank? You\u0027ve got a lot of weight balancing on a \u0022toothpick\u0022 between your larger fuel tanks.\u003Cp\u003EBaring a significant design change, try using the same size tanks throughout.\u003C/p\u003E\u003Cp\u003EIf you are set on using this fuel tank configuration connect the 2.5m tanks that are on top and bottom of the 1.25m tank with 6-8 symmetrical struts. That might solve the immediate problem.\u003C/p\u003E\u003Cp\u003EOf the two above, I suggest using 2.5m tanks for the entire craft, as you have with most of your design.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDuring failure the skipper fuel tanks (stage 2) seem to push inwards at the bottom and then everything seems to blow up at launch, which does seem to take place there. I\u0027m not set on the fuel configuration, just on the amount of fuel and thrust.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EYou don\u0027t even need trusses to truss the gap between the Skipper stage and the LV-N stage: just run struts from the bottom tank to the top tank. I\u0027d recommend 4 struts going straight up, unless you have a lot of torsion.\u003Cp\u003EOther than that, there\u0027s lots to critique about your rocket, if you\u0027re interested. You could build a much smaller one and still get as much range.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow would I make it smaller? Right now my staging is just based on engine efficiency and achieving a 16 000 dV.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EIf the girders aren\u0027t helping take them out.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore boosters, this will allow you to get rid of the tri-tanks on the second stage\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore Struts, depending on where the failure is happening at every joint, and make a strut cage around that lone LV-N in the middle.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt could just be me, but it looks like your lower stage is going into a fuel loop try Asparagus staging.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI definitely will consider boosters. Just haven\u0027t added it to my program yet. Yes All of my tanks are in fuel loops since I think I need all the thrust the entire time :/ ... I guess I should calculate at what point I can get away with less thrust.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Tegu\u0022 data-cite=\u0022Mr Tegu\u0022\u003E\u003Cdiv\u003EAs running stated: If you pull all of the booster stages closer to the principle axis you will reduce the bending moments caused and thus improve the stability and strength of the rocket considerably (as well as saving a little mass too). Locking the gimbals on the outer engines will also help.\u003Cp\u003EEdit: You seem to have attempted to use asparagus staging on the lower boosters but symmetry mode has messed things up for you. You need to place each crossfeed individually.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight now the thing just explodes on the launch pad and I can\u0027t even take off... I\u0027m just not sure how to move things in closer, while keeping all the engines. I haven\u0027t used asparagus staging yet... right now I\u0027m just making sure all the engines get fuel for the entire stage.\u003C/p\u003E\u003Cp\u003EThanks everyone. I definitely have a lot to think about.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-12-16T22:21:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grant_\u0022 data-cite=\u0022Grant_\u0022\u003E\u003Cdiv\u003EHopefully Moho and the Sun, but right now I\u0027m experimenting with maximizing my dV (16 000 atm).\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E you can get anywhere you want with that kind of dV, and still have more than enough to get back.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EDuring failure the skipper fuel tanks (stage 2) seem to push inwards at the bottom and then everything seems to blow up at launch, which does seem to take place there. I\u0027m not set on the fuel configuration, just on the amount of fuel and thrust.\u003C/p\u003E\u003Cp\u003EHow would I make it smaller? Right now my staging is just based on engine efficiency and achieving a 16 000 dV.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003Ethe engine thing is due to your skippers accelerating faster than the tank because the tank is now empty, but the skipper still has fuel\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI definitely will consider boosters. Just haven\u0027t added it to my program yet. Yes All of my tanks are in fuel loops since I think I need all the thrust the entire time :/ ... I guess I should calculate at what point I can get away with less thrust.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003Efuel loops tend to do crazy things to rockets, take a look at asparagus staging. Another alternative is to make all of the tanks in your initial stage the same so that they all drop at the same time.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ERight now the thing just explodes on the launch pad and I can\u0027t even take off... I\u0027m just not sure how to move things in closer, while keeping all the engines. I haven\u0027t used asparagus staging yet... right now I\u0027m just making sure all the engines get fuel for the entire stage.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003Eyou don\u0027t need your engine for the entire stage, just long enough for it to lift its share of the fuel. That\u0027s the beauty of asparagus staging, you only carry the mass you are currently using, then as it gets used you drop the excess (skippers are heavy!)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThanks everyone. I definitely have a lot to think about.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy comments are in red, sorry for not doing it proper but I\u0027m on my phone.\u003C/p\u003E\n"},{"CreatedByName":"Grant_","CreatedById":95484,"CreatedDateTime":"2013-12-16T23:45:38Z","Content":"\n\u003Cp\u003EAfter using a tri-coupler on the nuclear rockets, I made a gif to show how it\u0027s failing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CuFBTjz.gif\u0022 alt=\u0022CuFBTjz.gif\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-12-16T23:54:37Z","Content":"\n\u003Cp\u003EOK, so general critiques from me: your TWR is quite high.\u003C/p\u003E\u003Cp\u003ERemember that a mainsail is a huge amount of thrust: it can push 100t and still have good TWR on liftoff. You\u0027ve only got 250t on your five mainsails, which suggests you can drop to just three mainsails and still climb quite well, or add a whole bunch of fuel. Otherwise you\u0027ll have to throttle back to avoid exceeding terminal velocity. Similarly, each Skipper can push just under 50t of payload and still get enough TWR for mid stages. So you can drop one from the second stage.\u003C/p\u003E\u003Cp\u003EYou have a mess of fuel lines on the bottom stage. If you want to burn all the engines for the same amount of time, just put the same amount of fuel on top of each engine, and get rid of the fuel lines. Simpler, fewer parts, no worrying about whether you\u0027ll end up with unbalanced fuel usage (which cycles in the fuel line graph can do).\u003C/p\u003E\u003Cp\u003EAfter my proposed modifications so far you have 3 mainsails on the first stage burning a jumbo and a small tank each, 3 skippers on the second stage burning a jumbo each, 3 LV-N on the third stage sharing a half-jumbo between them, then 1 LV-N on the fourth stage burning another half-jumbo, and finally your probe on top. You\u0027ve got the same amount of fuel, but less engine mass, and therefore you have higher total deltaV. And a simpler rocket.\u003C/p\u003E\u003Cp\u003EDeparting from simplicity, the Skipper is not that great. We could replace the three Skippers by a cluster of 8 LV-T30s and one LV-T45 to get almost the same thrust (1920 kN rather than 1950 kN), slightly less mass (11.5t rather than 12t), slightly better Isp, and still have some thrust vectoring. Not a huge change in itself, but that\u0027s more thrust than a mainsail. You can therefore use these clustered engines twice: the first stage will be two mainsails and the cluster, each burning a jumbo and a small tank. The second stage will involve dropping the two mainsails but keeping the cluster, now burning three more jumbos. Total engine mass is reduced by 6.5t since the cluster replaced three Skippers and a mainsail. And the T30/T45 have higher Isp than the engines they replaced. So you have better Isp and lower mass =\u0026gt; better deltaV overall. You also have a bit more thrust on liftoff, which you could use by adding more fuel, almost a jumbo\u0027s worth shared between the first-stage engines.\u003C/p\u003E\u003Cp\u003ENow you can also run fuel lines from the mainsail towers to the cluster tower. Add the cluster\u0027s first-stage fuel to the mainsail towers, which means your second stage won\u0027t be hauling as many empty tanks. You can also split the second-stage fuel in two, and drop the empty fuel tanks: the cluster is burning three jumbos, so if you ditch half of the empty tanks, that\u0027s 6t you\u0027re dumping for half the burn =\u0026gt; more deltaV.\u003C/p\u003E\u003Cp\u003ELast trick, of less consequence than the previous stuff: you\u0027ve got three idle LV-Ns. Unless you\u0027re using the FAR mod, turn that stage 90 degrees from the lower stages, and run fuel lines from the cluster\u0027s fuel tanks to the outboard LV-Ns. This way, two of your LV-Ns will be firing all the way up, allowing you to add about 8t of fuel to the second stage yet keep the same TWR. As a bonus, it also improves Isp (as soon as you get above 600m). If you\u0027re using FAR, this is probably bad advice since it means you\u0027ll have a bigger cross-section area, and thus more drag.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-12-16T23:55:49Z","Content":"\n\u003Cp\u003EAs for explosions on the pad: MOAR STRUTS.\u003C/p\u003E\n"},{"CreatedByName":"Grant_","CreatedById":95484,"CreatedDateTime":"2013-12-17T00:31:10Z","Content":"\n\u003Cp\u003EThe thrust has been calculated to get 2.2 TWR for the first stage, 1.5 the second (@6300m-low orbit) and the third 0.2. What TWR values should I aim for?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T00:34:58Z\u0022 title=\u002212/17/2013 12:34  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by Grant_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-12-17T01:05:05Z","Content":"\n\u003Cp\u003E790\u002Btons, 108 tons in orbit. KW Rocketry and Nova Punch mods used. Payload to Jool is stock.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1Bsfv67.jpg\u0022 alt=\u00221Bsfv67.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oNpUkEV.jpg\u0022 alt=\u0022oNpUkEV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cxeADtM.jpg\u0022 alt=\u0022cxeADtM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/J4ihOIi.jpg\u0022 alt=\u0022J4ihOIi.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-17T01:09:20Z","Content":"\n\u003Cp\u003EJust as a suggestion: the length of the LV-Ns seems to make them wobbily no matter how well strutted they are, so I simply place them on side mounts where they do not bear any weight.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-12-17T01:14:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003E790\u002Btons, 108 tons in orbit. KW Rocketry and Nova Punch mods used. Payload to Jool is stock.\u003Cp\u003E\u003Cem\u003Epics\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI recognize that craft! but seriously, if you want even fuel usage, you need the same amount of fuel for each engine, with enough weight to make them controllable.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-12-17T01:15:24Z","Content":"\n\u003Cp\u003EOlder all stock design.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UXAgK1K.jpg\u0022 alt=\u0022UXAgK1K.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CMuxT2g.jpg\u0022 alt=\u0022CMuxT2g.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/s395WLx.jpg\u0022 alt=\u0022s395WLx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UglcBaV.jpg\u0022 alt=\u0022UglcBaV.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-12-17T01:20:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003EI recognize that craft! but seriously, if you want even fuel usage, you need the same amount of fuel for each engine, with enough weight to make them controllable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt flies quite well. The center tank feeds the twin LV-N till it runs out. Bracing properly is the key to stability. \u003C/p\u003E\u003Cp\u003EWhen rockets fall apart on the pad, there are serious stability and bracing issues to be sorted out.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-12-17T01:45:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grant_\u0022 data-cite=\u0022Grant_\u0022\u003E\u003Cdiv\u003EThe thrust has been calculated to get 2.2 TWR for the first stage, 1.5 the second (@6300m-low orbit) and the third 0.2. What TWR values should I aim for?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1.5 is plenty at launch -- remember that TWR grows during your stage as you burn fuel. Then 1.3 above 10km is a good start. That said, you might need more engines than I described; I was assuming the first stage took you to 10km or so. It might now, having reduced engine mass by 16.5t and increased the Isp.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-17T02:09:34Z","Content":"\n\u003Cp\u003EMan... Just stack the tanks you have radially mounted. I do that all the time. \u003C/p\u003E\u003Cp\u003EI typically try to have anything on the upper stage supported with lower booster stages to keep things stable and safe. It works moderately well.\u003C/p\u003E\u003Cp\u003EAnd, No, I don\u0027t use asparagus staging, I prefer classic-ish (combo of serial and parallel) staging. My rationale is that if asparagus staging were feasible/practical, then NASA would have been doing it for the last 50 years. I\u0027m willing to take that hit to efficiency on the chin for RP purposes, and I\u0027ve done fine so far.\u003C/p\u003E\n"},{"CreatedByName":"Grant_","CreatedById":95484,"CreatedDateTime":"2013-12-17T02:58:18Z","Content":"\n\u003Cp\u003EJust updated based on your guys suggestions \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I did employ Asparagus staging to drop 2 of the 8 engines for the first stage due to excess thrust... but I got it to orbit nicely!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BIhJ578.jpg\u0022 alt=\u0022BIhJ578.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only thing I dislike with having this much fuel is that is takes almost two minutes to create a proper orbit once I cut engines at 70 km and I doubt adding more nuclear engines will help. If I cut back from 16k dV to 15k dV I could use LV-T45 engines instead of skipper.... which is probably better.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T03:06:28Z\u0022 title=\u002212/17/2013 03:06  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by Grant_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Ideal Gas Lawyer","CreatedById":60804,"CreatedDateTime":"2013-12-17T03:01:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E2.More boosters, this will allow you to get rid of the tri-tanks on the second stage\u003C/p\u003E\u003Cp\u003E3.More Struts, depending on where the failure is happening at every joint, and make a strut cage around that lone LV-N in the middle.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore struts, more boosters. Most generic (and effective) advice in KSP, ever.\u003C/p\u003E\u003Cp\u003EFor the record, I agree.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-12-17T03:14:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grant_\u0022 data-cite=\u0022Grant_\u0022\u003E\u003Cdiv\u003EJust updated based on your guys suggestions \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I did employ Asparagus staging to drop 2 of the 8 engines for the first stage due to excess thrust... but I got it to orbit nicely!\u003Cp\u003E\u003Cem\u003EPIC\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe only thing I dislike with having this much fuel is that is takes almost two minutes to create a proper orbit once I cut engines at 70 km and I doubt adding more nuclear engines will help. If I cut back from 16k dV to 15k dV I could use LV-T45 engines instead of skipper.... which is probably better.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Enow for some optimization. 2 of those X200-32\u0027s is equal to 1 orange tank, and two of the X200-8\u0027s cans is equivalent to 1 X200-16.\u003C/p\u003E\u003Cp\u003EUsing this in your first stage, if you put an orange tank and an X200-16 and an X200-8 fuel tank on top of the mainsail you will have the same amount of fuel as you do now (Without having to run all the lines) If you then asparagus this you should get about the same dV. (But don\u0027t quote me on that, I\u0027m guessing here)\u003C/p\u003E\n"}]}