{"TopicId":56377,"ForumId":32,"TopicTitle":"does anybody use stage speration rockets?","CreatedByName":"chaoko99","CreatedById":96110,"CreatedDateTime":"2013-12-16T17:42:52Z","PageNum":1,"Articles":[{"CreatedByName":"chaoko99","CreatedById":96110,"CreatedDateTime":"2013-12-16T17:42:52Z","Content":"\n\u003Cp\u003EIm curious on the matter, and if so, what advantages do they pose\u003C/p\u003E\u003Cp\u003E (hint, I dont)\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-12-16T17:44:25Z","Content":"\n\u003Cp\u003EIncreased awesomeness and clean separation.\u003C/p\u003E\n"},{"CreatedByName":"chaoko99","CreatedById":96110,"CreatedDateTime":"2013-12-16T17:45:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TMS\u0022 data-cite=\u0022TMS\u0022\u003E\u003Cdiv\u003EIncreased awesomeness and clean separation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehow does one set them up?\u003C/p\u003E\n"},{"CreatedByName":"El wonso","CreatedById":37011,"CreatedDateTime":"2013-12-16T17:45:54Z","Content":"\n\u003Cp\u003EI use them only when necessary.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-16T17:47:21Z","Content":"\n\u003Cp\u003EI do on occasion.\u003C/p\u003E\u003Cp\u003EIf your radial boosters need to be strutted for stability, breaking those connections cancels any outward push the decoupler gives. I use the mini SRBs to get those boosters away from my main engine and avoid a collision.\u003C/p\u003E\u003Cp\u003EStrapping a bunch to my final launch stage before the payload allows me to circularize with it and not leave it in orbit. That little bit of extra dV usually gets it into a skimming atmosphere encounter, and cleans up my orbits.\u003C/p\u003E\u003Cp\u003EI also use them for my spaceplane abort sequences to get the cockpit away from the plane which is, usually, on a flat spin of death.\u003C/p\u003E\u003Cp\u003EEDIT: Using them, put them on the same stage as the decoupler you want them to fire with. They\u0027ll fire and burn their entire duration without actually being on your vessel.\u003C/p\u003E\n"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2013-12-16T17:47:22Z","Content":"\n\u003Cp\u003EIf you mean sepatrons, yeah... I use them all the time. Especially when I have to ditch some tanks/boosters while making a gravity turn during ascend so I don\u0027t damage the part that\u0027s supposed to go up.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-12-16T17:48:26Z","Content":"\n\u003Cp\u003EDepending on your rocket designs and how/when they stage, the separation event may not separate the spent stage very quickly; sometimes there can be re-contact events or interference if the spent stage doesn\u0027t move away quickly enough. For instance, if your first stage gets you to high enough energy and you\u0027re coasting up to your apoapsis,you may want to maneuver a bit to get ready for the next burn. Separation motors will ensure that the spent stage drops back and away quickly enough to not get in the way and pose a collision risk.\u003C/p\u003E\n"},{"CreatedByName":"Joe32320","CreatedById":81055,"CreatedDateTime":"2013-12-16T17:48:53Z","Content":"\n\u003Cp\u003EYes, either when I have a lower stage of 6 tanks around one in the middle and drop those 6 first (I can\u0027t be arsed to do the full bells and whistles asparagus staging most of the time), and they\u0027re long enough that they have a tendency to knock on the remaining tank, usually knocking something vital off like a mainsail engine.\u003C/p\u003E\u003Cp\u003EOr if I build a module for construction in orbit and I have 2 docking ports at either end of the vessel yet want to make the rocket look vaguely aerodynamic, I use separtrons to blow the nose cone into space once I don\u0027t need it anymore.\u003C/p\u003E\n"},{"CreatedByName":"uui8457","CreatedById":96312,"CreatedDateTime":"2013-12-16T17:48:55Z","Content":"\n\u003Cp\u003EThey sure add to the awesomeness, but other then that I don\u0027t find them particularly useful since the decouplers often have the force required.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2013-12-16T17:49:54Z","Content":"\n\u003Cp\u003EPrimarilly I use them to deorbit the final, orbital stages of launch vehicles so as to reduce debris. Occasionally I use them if trsts show the discarded stage does get enough separation.\u003C/p\u003E\n"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2013-12-16T17:50:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chaoko99\u0022 data-cite=\u0022chaoko99\u0022\u003E\u003Cdiv\u003Ehow does one set them up?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s how I use them:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img703.imageshack.us/img703/6916/9ruk.png\u0022 alt=\u00229ruk.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T17:52:58Z\u0022 title=\u002212/16/2013 05:52  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by Galileo Kerbonaut\u003C/strong\u003E\n\u003Cbr\u003Ebetter picture quality\n\u003C/span\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-12-16T17:51:19Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Rvf5UEu.png\u0022 alt=\u0022Rvf5UEu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooks more epic that way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2013-12-16T17:52:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chaoko99\u0022 data-cite=\u0022chaoko99\u0022\u003E\u003Cdiv\u003Ehow does one set them up?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENormally I just add 1 sepatron to the top of each strap-on booster facing the inner core. No fancy angling or anthing.\u003C/p\u003E\u003Cp\u003EAs long as the boosters are at the same level, or slightly below the main core this is the simplest and most reliable method, and looks pretty realistic.\u003C/p\u003E\u003Cp\u003EIf the main core is lower, they\u0027ll normally take out your middle engine, so a design like that normally needs a more complicated setup.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-12-16T17:52:09Z","Content":"\n\u003Cp\u003EYes. 3-2-1\u003C/p\u003E\n"},{"CreatedByName":"bigdad84","CreatedById":49379,"CreatedDateTime":"2013-12-16T17:55:44Z","Content":"\n\u003Cp\u003EI only use mine for separating the radial boosters. Allowing for a clean separation from the core stage. Pushing them away from the main stage before the chutes deploy.\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2013-12-16T18:05:38Z","Content":"\n\u003Cp\u003EThey be my primary mode of propulsion, baby\u003C/p\u003E\n"},{"CreatedByName":"Firedtm","CreatedById":61907,"CreatedDateTime":"2013-12-16T18:13:52Z","Content":"\n\u003Cp\u003EI Use the mini SRB\u0027s every now and than\u003C/p\u003E\n"},{"CreatedByName":"Klingon Admiral","CreatedById":69090,"CreatedDateTime":"2013-12-16T18:30:40Z","Content":"\n\u003Cp\u003EI use spetrons mainly for two purposes:\u003C/p\u003E\u003Cp\u003E1. Safe removal of radially mounted booster rockets.\u003C/p\u003E\u003Cp\u003E2. Deorbiting of small upper stages after payload separation. This has somewhat declined in usefulness now that my small rockets are SSTO.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-12-16T18:35:17Z","Content":"\n\u003Cp\u003EI use the separatrons for my abort sequences for my planes and manned rockets. I\u0027m trying to fibd a way to make unmanned rockets self destruct with them\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-12-16T18:36:37Z","Content":"\n\u003Cp\u003EHere\u0027s how I use the sepratrons:\u003C/p\u003E\u003Cp\u003E1) making sure big radial boosters don\u0027t collide with the main stack; I have a couple of heavy-lift designs that use twin Rockomax 64s and they don\u0027t drift terribly quickly, so a little extra boost helps get them clear\u003C/p\u003E\u003Cp\u003E2) de-orbiting insertion engines with sepratrons facing retrograde, cued to fire upon staging. I also use them to de-orbit my Popcorn miniprobes; a pair\u0027s enough to give over 180m/s delta-V on the wee things.\u003C/p\u003E\u003Cp\u003E3) ejection motors on my spaceplanes\u0027 escape capsues, to get the cockpit and crew away cleanly\u003C/p\u003E\u003Cp\u003EI\u0027ve also toyed with using them as boosters on sample-return probe stages, but not really put them into practice for that.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2013-12-16T18:47:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EStrapping a bunch to my final launch stage before the payload allows me to circularize with it and not leave it in orbit. That little bit of extra dV usually gets it into a skimming atmosphere encounter, and cleans up my orbits.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve started doing this. Just made sure I\u0027m pointing prograde after circularisation and *whoosh* - off it goes back to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-12-16T18:47:19Z","Content":"\n\u003Cp\u003ESeparatrons make for great escape towers, but besides that yeah... Sometimes I\u0027ve needed to slap a few onto lower stages so they wouldn\u0027t slam into my rocket. Once I even used a Metric Crapton of the things to slow down a heavy fuel depot as I was landing it on Duna. In that case the separatrons made the difference between success and failure!\u003C/p\u003E\n"},{"CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2013-12-16T18:49:20Z","Content":"\n\u003Cp\u003EI use them on my space shuttles because having 8 tons of SRB hit your wing is a bad thing.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-16T18:54:50Z","Content":"\n\u003Cp\u003EI use them when I need to safely decouple orange tanks.\u003C/p\u003E\n"},{"CreatedByName":"HoHun","CreatedById":92103,"CreatedDateTime":"2013-12-16T18:56:10Z","Content":"\n\u003Cp\u003EI use them on the radial stages jettisoned in the gravity turn to ensure they don\u0027t hit the ship, which they did before I added outward-burning sepratrons.\u003C/p\u003E\u003Cp\u003EFor the lower radial stages, I use radial chutes to make sure the empty stages fall behind before they have a chance to hit the ship. Chutes stabilize and decelerate, while sepratrons make things more interesting ;-)\u003C/p\u003E\n"}]}