{"TopicId":56407,"ForumId":32,"TopicTitle":"KerbalKon Announcements","CreatedByName":"Rowsdower","CreatedById":91811,"CreatedDateTime":"2013-12-16T22:22:45Z","PageNum":5,"Articles":[{"CreatedByName":"Sethnizzle","CreatedById":22985,"CreatedDateTime":"2013-12-17T07:55:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EAlso, space mining has driven exactly zero national space programs this far\u003C/strong\u003E, beyond the \u0022wouldn\u0027t it be cool to harvest resources someday\u0022 So while you can hold the opinion that mining is crucial to any space program game, it it not really based in reality and Squad has plenty of design room to work around them should mining not make sense within the gameplay of KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, however I would say a lack of space mining has inhibited every space program. It is prohibitively too expensive and impractical to carry all the fuel required for round-trip travel to other planets. One of the reasons (besides indication of life) for trying to find water on every planetary body we explore is to create fuel for the return trip for manned missions. Add to that the recent advancements in commercial extraterrestrial mining and I would argue that adding resources/mining to KSP would be more realistic than not having it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T07:58:39Z\u0022 title=\u002212/17/2013 07:58  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by Sethnizzle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-12-17T07:56:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003ETiberion, I\u0027ve debated you all weekend. Lean back, step into the shoes of the people you\u0027re talking about for a moment. Read what you just wrote up there. \u003Cp\u003EIt doesn\u0027t matter whether you\u0027re right or not, or how angry they are or how unreasonable it is. They are angry. And calling it a temper tantrum and them rioters and abusers is NOT going to make them sit down and say \u0027oh yes, how silly of me.\u0027\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is not a thing to be \u0022angry\u0022 about at all. Being angry and reacting emotionally is the wrong decision here. I don\u0027t really expect them to change, but I am not going to placate anyone or validate their feelings when they deliver so much vitriol. Do to so would encourage them to continue it. So if I share a harsh word about it, someone might accidentally take stock and apply future feedback in a useful manner.\u003C/p\u003E\u003Cp\u003ETrust me, I have invested a lot of time and energy into this game and have felt the temptation to \u0027flame on\u0027 numerous times. But its a bad idea.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sethnizzle\u0022 data-cite=\u0022Sethnizzle\u0022\u003E\u003Cdiv\u003ETrue, however I would say a lack of space mining has inhibited every space program. It is prohibitively too expensive and impractical to carry all the fuel required for round-trip travel to other planets. One of the reasons (besides indication of life) for trying to find water on every planetary body we explore is to create fuel for the return trip for manned missions. Add to that the recent advancements in commercial extraterrestrial mining and I would argue that adding resources/mining to KSP would be more realistic than not having it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, resource limitations certainly inhibit lots of space programs. As does gravity, and relativity, and the inhospitable living conditions for humans and machines alike. And solving those challenges is part of what makes adventuring into space engaging and interesting, even when we\u0027re only flying around little green dudes in a sim.\u003C/p\u003E\u003Cp\u003ESo there is a real danger that making resources too readily available \u0027out there\u0027 via mining and refining could actually remove the challenge and the danger. Or that balancing those issues to keep it from making it too easy instead makes it too much of a grind or isn\u0027t fun.\u003C/p\u003E\u003Cp\u003EThese are all things that the smart people at SquadHQ talked about whenever they were working on this system. It was part of what they considered when they decided to stop development on the resource mining system we saw in the flowchart. And that is part of the challenge that lays ahead for them - how to find that balance between keeping the game fun and keeping it challenging. Nobody has said that resources and logistics won\u0027t play a role in the final game.. just not the version we saw (only on the drawing board, mind you)\u003C/p\u003E\u003Cp\u003EAs for realism: I don\u0027t really agree. Currently, real scientists have a lot of work ahead of them trying to figure out ways to actually extract and utilize any water or fuel we find out there. Certainly having kerbals plopping down bases on Duna and refilling liquid engines sounds interesting, but it is nowhere near \u0027realistic\u0027 at this point.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T08:07:22Z\u0022 title=\u002212/17/2013 08:07  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by Tiberion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-17T08:12:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EIt is not a thing to be \u0022angry\u0022 about at all. Being angry and reacting emotionally is the wrong decision here. I don\u0027t really expect them to change, but I am not going to placate anyone or validate their feelings when they deliver so much vitriol. Do to so would encourage them to continue it. So if I share a harsh word about it, someone might accidentally take stock and apply future feedback in a useful manner.\u003Cp\u003ETrust me, I have invested a lot of time and energy into this game and have felt the temptation to \u0027flame on\u0027 numerous times. But its a bad idea.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree it\u0027s a bad idea. I AGREE that people shouldn\u0027t get super angry about a dev decision. But there is a difference between validation and placation. I am a teacher, I\u0027ve dealt with angry, frustrated children and adults. No amount of logic or reason or telling them to just \u0027not be angry\u0027 will work when they are already there.\u003C/p\u003E\u003Cp\u003EYou admit you\u0027re being harsh. This is the WRONG tact. That action is the equivalent of shouting back. You are feeding that anger. Perpetuating it. Potentially turning disappointment and hurt into genuine rage. As cathartic as it sometimes feel to shoot barbs back at them, you CAN\u0027T if you want any hope of a rational discussion from there on out. \u003C/p\u003E\u003Cp\u003EI recall in one of the earlier threads when you called everything I\u0027d said up to that point... I don\u0027t remember exactly, but it wasn\u0027t pleasant. Fortunately, I\u0027ve learned to take people who say that to me very seriously indeed. For almost anyone else... that is an attack on THEM. It\u0027s natural to unsheathe the claws and fight back. They might have thrown the first metaphorical punch, but that does not give anyone license to go weapons-free on them and fire back. In a lot of cases, THEY DON\u0027T REALIZE THEY STRUCK FIRST.\u003C/p\u003E\n"},{"CreatedByName":"Danish_Savage","CreatedById":49194,"CreatedDateTime":"2013-12-17T08:30:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EI agree it\u0027s a bad idea. I AGREE that people shouldn\u0027t get super angry about a dev decision. But there is a difference between validation and placation. I am a teacher, I\u0027ve dealt with angry, frustrated children and adults. No amount of logic or reason or telling them to just \u0027not be angry\u0027 will work when they are already there.\u003Cp\u003EYou admit you\u0027re being harsh. This is the WRONG tact. That action is the equivalent of shouting back. You are feeding that anger. Perpetuating it. Potentially turning disappointment and hurt into genuine rage. As cathartic as it sometimes feel to shoot barbs back at them, you CAN\u0027T if you want any hope of a rational discussion from there on out. \u003C/p\u003E\u003Cp\u003EI recall in one of the earlier threads when you called everything I\u0027d said up to that point... I don\u0027t remember exactly, but it wasn\u0027t pleasant. Fortunately, I\u0027ve learned to take people who say that to me very seriously indeed. For almost anyone else... that is an attack on THEM. It\u0027s natural to unsheathe the claws and fight back. They might have thrown the first metaphorical punch, but that does not give anyone license to go weapons-free on them and fire back. In a lot of cases, THEY DON\u0027T REALIZE THEY STRUCK FIRST.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoys, if you feel like shouting at each other, could\u0027t you do it in a PM. The thing is, that in cases like this there is no definite answer. Life isn\u0027t black or white, it\u0027s all grey tones. This case is an example of how different people are, which is something we wont be capable of changing. Therefore we should not be constantly trying to streamline everyone\u0027s opinion, because that just never works out, and especially not on a realm so fast-phased as the Internet.\u003C/p\u003E\u003Cp\u003EThese last few days, there seems to be developing a flamewar on these forums. And while I like the fact that it makes people write long, and thought trough post, I get kinda pissed of when people keep expecting others to see it from their own angle. Because that just won\u0027t happen. So while calmed discussions are a gift to the forums, please don\u0027t get yourself\u0027s heated up for an debate that can\u0027t be won.\u003C/p\u003E\u003Cp\u003EAnd while its understandable to be disappointed about the devs taking another road than the one you envisioned, it does not mean that you should get into fights about it. Its a game. The devs have absolute rule over it, and yes you paid them money, but what you paid for was access to the game that they where developing, and that they have delivered. However they are so kind and understanding that they do listen to our concerns, and they do pay notice to our suggestions. But if you want to make them notice your ideas, you should write it in a calm and professional tone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T08:36:23Z\u0022 title=\u002212/17/2013 08:36  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by Danish_Savage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-12-17T08:52:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EI agree it\u0027s a bad idea. I AGREE that people shouldn\u0027t get super angry about a dev decision. But there is a difference between validation and placation. I am a teacher, I\u0027ve dealt with angry, frustrated children and adults. No amount of logic or reason or telling them to just \u0027not be angry\u0027 will work when they are already there.\u003Cp\u003EYou admit you\u0027re being harsh. This is the WRONG tact. That action is the equivalent of shouting back. You are feeding that anger. Perpetuating it. Potentially turning disappointment and hurt into genuine rage. As cathartic as it sometimes feel to shoot barbs back at them, you CAN\u0027T if you want any hope of a rational discussion from there on out. \u003C/p\u003E\u003Cp\u003EI recall in one of the earlier threads when you called everything I\u0027d said up to that point... I don\u0027t remember exactly, but it wasn\u0027t pleasant. Fortunately, I\u0027ve learned to take people who say that to me very seriously indeed. For almost anyone else... that is an attack on THEM. It\u0027s natural to unsheathe the claws and fight back. They might have thrown the first metaphorical punch, but that does not give anyone license to go weapons-free on them and fire back. In a lot of cases, THEY DON\u0027T REALIZE THEY STRUCK FIRST.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not really interested in placating, validating, or any of that. My intent is to continue to inject some reason in this echo chamber where the same few people feed off of each other\u0027s froth and discuss the \u0027issues\u0027 in a circle, each iteration with stronger condemnation and less reason. Maybe we\u0027re doing the same thing on a smaller scale, I don\u0027t know, but its something different at least.\u003C/p\u003E\u003Cp\u003EI plan to continue to voice my dissent and to refute especially egregious statements, because they otherwise float out there and get adopted as some sort of \u0022truth\u0022\u003C/p\u003E\u003Cp\u003EI don\u0027t plan to hold my tongue. We tried that during the last one of these eruptions, the so called \u0022DLC drama\u0022 where the fervor climbed and climbed and no one really said too much in opposition. That Squad made a strong statement about content being free is a godo thing, but they were also driven into a communication blackout that we\u0027ve only recently emerged from as new community people have come on board.\u003C/p\u003E\u003Cp\u003EI don\u0027t want to see it happen again.\u003C/p\u003E\n"},{"CreatedByName":"Sethnizzle","CreatedById":22985,"CreatedDateTime":"2013-12-17T10:14:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EYes, resource limitations certainly inhibit lots of space programs. As does gravity, and relativity, and the inhospitable living conditions for humans and machines alike. And solving those challenges is part of what makes adventuring into space engaging and interesting, even when we\u0027re only flying around little green dudes in a sim.\u003Cp\u003E\u003Cstrong\u003ESo there is a real danger that making resources too readily available \u0027out there\u0027 via mining and refining could actually remove the challenge and the danger. Or that balancing those issues to keep it from making it too easy instead makes it too much of a grind or isn\u0027t fun.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThese are all things that the smart people at SquadHQ talked about whenever they were working on this system. It was part of what they considered when they decided to stop development on the resource mining system we saw in the flowchart. And that is part of the challenge that lays ahead for them - how to find that balance between keeping the game fun and keeping it challenging. Nobody has said that resources and logistics won\u0027t play a role in the final game.. just not the version we saw (only on the drawing board, mind you)\u003C/p\u003E\u003Cp\u003EAs for realism: I don\u0027t really agree. Currently, real scientists have a lot of work ahead of them trying to figure out ways to actually extract and utilize any water or fuel we find out there. Certainly having kerbals plopping down bases on Duna and refilling liquid engines sounds interesting \u003Cstrong\u003E[and fun]\u003C/strong\u003E, but it is nowhere near \u0027realistic\u0027 at this point.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m on board with all of your points and opinions except with the idea of adding mining to KSP as being \u0022nowhere near realistic.\u0022 It is certainly in the realm of possibility in real life, so it shouldn\u0027t be hard to make the leap to believability for it to be in KSP. Especially when you consider the scale of what is acceptably \u0022realistic\u0022 as already established by the game. If you are able to accept that Kerbals are capable of manned interplanetary exploration (something we can\u0027t do irl \u0022at this point\u0022), even visiting every planet in a single mission, then certainly you can accept mining as being realistic...\u003C/p\u003E\u003Cp\u003EThats the only issue I wanted to address as I pretty much agree with you on everything else. The proposed resource system was exciting, but admittedly too complicated. I\u0027d be fine with a more refined and official version of the Kethane mod. I also didn\u0027t interpret Harvs explanation as completely doing away with resources/mining. I enjoy setting up fuel depots but I am also looking forward to the other things Harv has in mind when he said they want to make creating bases and stations more meaningful and fun.\u003C/p\u003E\n"},{"CreatedByName":"Draft","CreatedById":72633,"CreatedDateTime":"2013-12-17T10:15:09Z","Content":"\n\u003Cp\u003EMy main gripes so far are with Harvester\u0027s logic as presented, and I\u0027ve said this across several forums by now.\u003C/p\u003E\u003Cp\u003EThe original plan for resources may very well have been too complicated to be fun. I can believe that, it had a lot of dedicated steps and single-use parts and didn\u0027t really tie into anything. I don\u0027t see that as a reason to abandon all plans for the feature, though, but as a reason to iterate to something that\u0027s more simple and more integrated with the rest of the game. A good handful of the features coming in tomorrow\u0027s update definitely fall into the category of \u0027further framework we can build things like resources off of\u0027.\u003C/p\u003E\u003Cp\u003EAs for the excuse that forgetting a part on your rocket isn\u0027t fun, that argument falls flat on several levels. Firstly, pretty much everyone has some story of a forgotten parachute, or antenna, or landing gear, or batteries, or solar panels, any of which can render a mission a complete failure. That doesn\u0027t make them bad, unfun features. Secondly, if you\u0027re afraid that people won\u0027t even know that drills and such exist, that\u0027s a reason to improve the ingame documentation, not to throw out the plans for the feature. By tomorrow we\u0027ll have an R\u0026amp;D center here we can review science reports and whatever else von Kerman wishes to tell us. We\u0027ll have more capable part tooltips and tweakables to let us know more about the parts we\u0027re using and how they work.\u003C/p\u003E\u003Cp\u003EIt just doesn\u0027t add up, in my mind. Either they\u0027re making a mistake by my reckoning, or they\u0027ve decided to do these things in secret for whatever reason and in another year we\u0027ll hear that resources have always been on the plan internally, and anybody who said otherwise was wrong.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-12-17T10:43:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Draft\u0022 data-cite=\u0022Draft\u0022\u003E\u003Cdiv\u003Ea reason to iterate to something that\u0027s more simple and more integrated with the rest of the game. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFantastic post, agree with everything there. I especially wanted to quote this line though. It\u0027s the integration that we\u0027re missing, that\u0027s just the perfect word to use. Even the science system is not really an integrated component right now. Sure, it unlocks parts, but it does so on a bit of a gimmicky way, it\u0027s just a tacked-on mechanic, and that\u0027s largely what makes it so grindy.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-12-17T10:46:30Z","Content":"\n\u003Cp\u003EGuessing i\u0027m alone here thinking that the saddest part of this announcement is not the No Mining Mo Stuff, but the following...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003EWe arenÃ¢â‚¬â„¢t ready to disclose any new ideas now because weÃ¢â‚¬â„¢re focused on Career Mode and anything we bring up now could end up getting scrapped later and weÃ¢â‚¬â„¢ll have the same issue we have now.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Axder","CreatedById":57767,"CreatedDateTime":"2013-12-17T11:14:45Z","Content":"\n\u003Cp\u003EWell I will add my two cents. \u003C/p\u003E\u003Cp\u003E1) Why are people angry? Becouse they were promised resources last kerbalkon, being scraped spring 2013. If I remeber corectly thats what costed Damion his position as a comunity manager. If I remeber corectly it was something about building bases and complex mining was considered being added as a expansion. And outrage was quie suvire. So people are waiting a year for this feature, which could again revolutunaze the way we play a game. (Unlike science, which is curently just play a game with less parts) \u003C/p\u003E\u003Cp\u003E2) Multyplayer is wierd, and will be wierd. How anybody ever said hey man lets play flight simulator on this lan party. (Well nobody ever) Becouse map is fricking huge and you can both be on other side of the universe literaly. With KSP added time warp it boils down to actualy one person is playing and rest is either waiting or building in VAB. Only momens which could be fun is shared building of space stations and bases. But i dont think its a good move. Veteran players are alredy getting kinda bored, and teaching your friends orbital mechanics is fun. But not in a long run or if you are playing alone. \u003C/p\u003E\u003Cp\u003EAs for ongoing debate. I completly agree that mining resources and fuel, makes things super easy. It is true. I instaled kethane and it is easy to just strap bunch of parts and do a grand tour with OP self suficient lander. My imaginary idea off one day implemantaion of resources will be some sot of colony mechanics combined with curency. In the end we will be able to put VAB on Duna or Gilly. Prefrebly like you land this 5 super heavy pars 2 km apart and kerbals would actualy build something out of it. And than you can buy parts there for some extreme cost, which can be lovered by bringing more miners or other buildings. I strongly belive that astronaut recruitment complex could have more categories. Like pilots scientist miners, drivers etc. With each having sosme bonuses. \u003C/p\u003E\u003Cp\u003EANd lastly as for squad, I completly understand why you comunicate as you comunicate. I was in some sort of a same endevaur, and in the end you just have to comunicate like a lawyer becouse anything you say will be used against you.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-12-17T11:17:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sethnizzle\u0022 data-cite=\u0022Sethnizzle\u0022\u003E\u003Cdiv\u003EI\u0027m on board with all of your points and opinions except with the idea of adding mining to KSP as being \u0022nowhere near realistic.\u0022 It is certainly in the realm of possibility in real life, so it shouldn\u0027t be hard to make the leap to believability for it to be in KSP. Especially when you consider the scale of what is acceptably \u0022realistic\u0022 as already established by the game. If you are able to accept that Kerbals are capable of manned interplanetary exploration (something we can\u0027t do irl \u0022at this point\u0022), even visiting every planet in a single mission, then certainly you can accept mining as being realistic...\u003Cp\u003EThats the only issue I wanted to address as I pretty much agree with you on everything else. The proposed resource system was exciting, but admittedly too complicated. I\u0027d be fine with a more refined and official version of the Kethane mod. I also didn\u0027t interpret Harvs explanation as completely doing away with resources/mining. I enjoy setting up fuel depots but I am also looking forward to the other things Harv has in mind when he said they want to make creating bases and stations more meaningful and fun.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes I say RL mining water from moon or an asteroid is more realistic than an manned Mars Mission. \u003C/p\u003E\u003Cp\u003EIn KSP an apollo style mission to Duna\u002B Ike has no need for mining, even with hitchhiker container and command module for mothership and two man lander and both targets. \u003C/p\u003E\u003Cp\u003EYou save launch weight from pad if you top off the mothership with fuel from Minmus but mission is no easier. \u003C/p\u003E\u003Cp\u003EJool grand tour would benefit a lot from mining, so will missions using oversized motherships or large bases.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-12-17T11:18:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sethnizzle\u0022 data-cite=\u0022Sethnizzle\u0022\u003E\u003Cdiv\u003EI\u0027m on board with all of your points and opinions except with the idea of adding mining to KSP as being \u0022nowhere near realistic.\u0022 It is certainly in the realm of possibility in real life, so it shouldn\u0027t be hard to make the leap to believability for it to be in KSP. Especially when you consider the scale of what is acceptably \u0022realistic\u0022 as already established by the game. If you are able to accept that Kerbals are capable of manned interplanetary exploration (something we can\u0027t do irl \u0022at this point\u0022), even visiting every planet in a single mission, then certainly you can accept mining as being realistic...\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe thing that gets me with resources is that they are just not necessary for the main game. While one can certainly set up a vast system of mining vehicles and refineries, using them to refuel your ships is kind of overkill. \u003C/p\u003E\u003Cp\u003EAn argument being made is that resource mining is a focus of real-life space programs, and as such should be in KSP. However, real-life space programs have to deal with Earth\u0027s much larger size, which requires craft which are exponentially larger than the ships used by us KSP players (well, except if you\u0027ve installed that real life solar system mod).\u003C/p\u003E\u003Cp\u003EThus, if you need to refuel your ship stuck in orbit, you wouldn\u0027t spend a lot of time and energy setting up a mining base, you\u0027d just build a heavy lift rocket and fly a couple Orange Tanks out from Kerbin. \u003C/p\u003E\u003Cp\u003EThe point I\u0027m trying to make here is that resources aren\u0027t entirely necessary for the core game of KSP. Sure, they add extra fun and roleplay (perhaps even saving money), but you can get anywhere in the solar (kerbolar?) system just by launching all your fuel from Kerbin. \u003C/p\u003E\u003Cp\u003EAs such, I see why Squad has designated resources as an end-game feature; they don\u0027t add any critical features to the game (you can accomplish just as much with as without them). While I would have rather seen Squad focus on those end-game features after completing Career mode rather than multiplayer, I understand where they\u0027re coming from and I respect their decision.\u003C/p\u003E\n"},{"CreatedByName":"Fourjays","CreatedById":60289,"CreatedDateTime":"2013-12-17T11:50:51Z","Content":"\n\u003Cp\u003ENot interested in multiplayer. Even more so when I see what people do in it (build weapons). Just hope when they are implementing it that they still add things to singleplayer and the focus remains primarily on the singleplayer. If KSP goes down a multiplayer oriented route then I\u0027ll probably stop playing it.\u003C/p\u003E\u003Cp\u003EWould like to see resources, but mods do fine at it so far.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Scruffy","CreatedById":38540,"CreatedDateTime":"2013-12-17T12:01:49Z","Content":"\n\u003Cp\u003EThe way iÃ‚Â´d like ressources (on bodies) be implemented would go somewhere along these lines:\u003C/p\u003E\u003Cp\u003E- They are there for you to discover. Sats give rough ressource maps. Taking a sample from a site will mark that site.\u003C/p\u003E\u003Cp\u003E- Marked Sites can be recommended to other in-game entities (read: companies) for exploitation.\u003C/p\u003E\u003Cp\u003E- A while after that, if any marked site has turned out to be interesting enough (\u002B mabye some other pre-requisites have been met, like bringing and returning a kerbal there, f.e.), a company will show up with a contract for you to bring up a mining device (given by them) to the site. TheyÃ‚Â´ll pay you a lump sum upon successful completion.\u003C/p\u003E\u003Cp\u003E- Wether a company will offer a contract for a specific site depends on its value (ressource type \u0026amp; quantity) and the overall time in the game elapsed (the later in the game it is, the more valuable ressources will become, assuming steady supply, making sites seem ever more tasty as time elapses).\u003C/p\u003E\u003Cp\u003E- Running mining operations (by your former contractors) lower the costs of specific parts, depending on ressource type. One ressource might be an excellent solid propellant, say, and thus, the more of it is being extracted throughout the system, the cheaper solid boosters will be.\u003C/p\u003E\u003Cp\u003E- Mines are running completely independent and are not much more than a marker on the map and a device on the ground, plus the bonus attached as mentioned above, gameplay wise. No transport ships or crew ferrying or such gets represented, since none of that is part of your space-program, but of an independent private enterprise (having certain techs developed could be a pre-requisite for having any mining operations start, though). Mines deplete the site they are gathering from and close down after complete exploitation of it.\u003C/p\u003E\n"},{"CreatedByName":"Dogface","CreatedById":75396,"CreatedDateTime":"2013-12-17T13:35:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022czokletmuss\u0022 data-cite=\u0022czokletmuss\u0022\u003E\u003Cdiv\u003EI would like to say that it\u0027s good to hear official statement - finally.\u003Cp\u003EI also think that by improving communication with the community Squad can only gain more support from us. Most of the emotions were borned because we were misinformed and without any official information we had to speculate and guess. So to take something positive from all this mess I suggest even bigger transparency to clear the air and kill all the speculations once and for all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E^^^^This \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"darpavader","CreatedById":52420,"CreatedDateTime":"2013-12-17T14:21:54Z","Content":"\n\u003Cp\u003EKSP is running into the same problem that real world space agencies are running into. We can get into space, NOW WHAT? IMO, the science system in the game now needs to be tied into a resource system. Things like the mystery goo could be more attracted to certain elements leading the kerbals in the discovery of elements on different planets and moons. Maybe new metals could be found that would open up new parts. This also should be tied into the life support system. And I\u0027m not sure why this has to ne so complex. Kerbals are not humans. who knows how many snacks or water or air they need. \u003C/p\u003E\u003Cp\u003Eanyway, we\u0027re so close to having a perfect game.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-12-17T15:57:59Z","Content":"\n\u003Cp\u003EFor those of you saying that mining resources to maintain life support would be a grind, consider this: The kerbal solar system is much, much smaller than our own. A round trip to Duna takes only a few months of real time, essentially a one way trip to its real life analogue - Mars. So it is not outside the realm of possibility that enough life support \u0022stuff\u0022 (food, water, oxygen, etc) could be loaded onto the ship for a very long time. I\u0027m talking a year or so of in-game time. If that were the case, the only time you\u0027d need to worry about \u0022mining\u0022 life support \u0022stuff\u0022 (food, water, oxygen, etc) would be if you were planning a long-term stay there... Which is certainly a very reasonable expectation. That way, you don\u0027t even need to worry about it if all you\u0027re planning to do is go there, do science, then get back.\u003C/p\u003E\u003Cp\u003EThat\u0027s just one example of how we could compromise between people who really want resource mining, and those who think it\u0027d be too much of a grind. Concessions can be made so that the realism of the KSP universe is upheld while the fun of the KSP game is also upheld. Just something to think about guys.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-17T16:11:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tntristan12\u0022 data-cite=\u0022tntristan12\u0022\u003E\u003Cdiv\u003EThat\u0027s just one example of how we could compromise between people who really want resource mining, and those who think it\u0027d be too much of a grind. Concessions can be made so that the realism of the KSP universe is upheld while the fun of the KSP game is also upheld. Just something to think about guys.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are working under the assumption that anybody who thought SQUAD\u0027s proposed resource system looked grindy didn\u0027t want resources in the first place, which is not even close to the truth. I would \u003Cem\u003Elove\u003C/em\u003E to see mine-able resources in the game, especially so I can pull off real-world-esque proposals where a small probe can do in-situ refueling and then return with a core sample, or something similar. As you mention it would also be nice to keep base resources topped off with ice mining or something similar. Unfortunately that terrible spaghetti mess of resources pretty much only worked on an industrial scale and would have been grind city, and boring as hell.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-12-17T16:42:15Z","Content":"\n\u003Cp\u003EI\u0027m not convinced that the only options available to the devs for resource mining are \u0022overly simplistic\u0022 or \u0022industrial strength convolution.\u0022 I\u0027m sure there\u0027s a middle ground somewhere worth exploring. For example, what if the goal of resource mining was to collect any of the primary consumable resources: Dirt/Regolith/Topsoil (can be used in building), Water (for use in life support), Oxygen (also for use in life support), Oxidizer (compressed oxygen), Liquid Fuel, Monopropellent (compressed liquid fuel), or EVA Propellent (even further compressed Monopropellent).\u003C/p\u003E\u003Cp\u003EYou pretty much start with Dirt/Regolith/Topsoil which you get directly from the drill. You have a second unit which breaks it down into constituent parts - Water, Liquid Fuel, and more Dirt/Regolith/Topsoil, in differing ratios depending on where you\u0027re mining it from. For example, if you\u0027re mining on an ice cap you get a higher ratio of Water to other stuff. If you\u0027re mining on Eve, you get a higher ratio of Liquid Fuel. If you\u0027re mining on the Munar Equator, you get a higher ratio of Dirt/Regolith/Topsoil. And hey, you know what? We don\u0027t really even need two separate units for this do we? So let\u0027s just get rid of the separator as its own unit and couple it with the drill, so instead of getting out soil from the ground it automatically splits it into these three things that you get in different ratios no matter where you are in the solar system!\u003C/p\u003E\u003Cp\u003EOkay, so after that you then have a second unit which can use electricity to compress/convert the base resource into other more useful resources. So for this example, you could put in Water, and for a certain amount of electricity get out Oxygen. Put in twice that amount of electricity and you get out Oxidizer. You use that *same unit* and pump in Liquid Fuel and you can similarly get out Monoprop or EVA prop, again depending on how much precious electricity you want to part with. What about Dirt? Well, it could be used as ballast, brought home for science, or simply dumped overboard because it\u0027s not as useful.\u003C/p\u003E\u003Cp\u003ETwo units: Drill/Separator, and Converter. Each one takes a certain amount of electricity. Besides the two units needed for the actual mining, you\u0027d only really need to add a third part for storage, and let\u0027s say it\u0027s just one unit that can contain certain amounts of all three mineable resources. Also, notice that the \u0022resource map\u0022 I described only has three branches: Water -\u0026gt; Oxygen -\u0026gt; Oxidizer, Liquid Fuel -\u0026gt; Monopropellent -\u0026gt; EVA Propellent, and Dirt, which doesn\u0027t really do much of anything except possibly net you science points and allow you to fulfill contracts back home possibly. That hardly seems like a \u0022terrible spaghetti mess of resources\u0022 to me. In fact, it pretty much runs off the same principal as Kethane, but instead of discrete deposits that you need to locate you are using the built-in biome structure that \u003Cem\u003Ealready exists in the game\u003C/em\u003E. As long as you\u0027re able to run mining and converting out of focus, this would be a pretty streamlined way of doing things.\u003C/p\u003E\u003Cp\u003EReally, I \u003Cem\u003Ejust\u003C/em\u003E came up with this on the spot. I\u0027m sure it\u0027s not a perfect scheme, but if I can come up with this within five minutes of brainstorming I\u0027m sure I could fill any loopholes if I had the combined resources of Squad at my disposal. Don\u0027t you think?\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-17T16:49:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tntristan12\u0022 data-cite=\u0022tntristan12\u0022\u003E\u003Cdiv\u003EI\u0027m not convinced that the only options available to the devs for resource mining are \u0022overly simplistic\u0022 or \u0022industrial strength convolution.\u0022 I\u0027m sure there\u0027s a middle ground somewhere worth exploring.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo one is disputing that. I don\u0027t even think SQUAD is. It\u0027s just that SQUAD\u0027s early proposal was a terrible spaghetti mess that really only worked on an industrial scale. Any solution for resources should meet the needs of small-time resource users and industrial-scale tycoons, and it should be fun (or at least unobtrusive), and should also not become the main focus of the game.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-12-17T17:01:21Z","Content":"\n\u003Cp\u003EI agree. What I\u0027m trying to do is help come up with something that might be appealing to the devs or modmakers as a potential solution. Something that isn\u0027t perfect, but might be developed into something that works. Isn\u0027t that the least that we as a community can do?\u003C/p\u003E\u003Cp\u003EAs for the solution I outlined in my last post, I came up with a graph of what I had in mind because I honestly have nothing better to do. I feel like something like this would contribute to gameplay without becoming the sole purpose of it, because everything you get out of it could help you in your overall mission, but isn\u0027t just the sole reason for being. What do you think?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5tUpvPn.png\u0022 alt=\u00225tUpvPn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: This would tie in nicely with the \u0022gather surface sample\u0022 mechanic introduced in 0.22, since you could use your surface samples to predetermine what kind of breakdown you\u0027d get when you come back later to mine it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T17:05:28Z\u0022 title=\u002212/17/2013 05:05  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by tntristan12\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-17T17:06:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tntristan12\u0022 data-cite=\u0022tntristan12\u0022\u003E\u003Cdiv\u003EI agree. What I\u0027m trying to do is help come up with something that might be appealing to the devs or modmakers as a potential solution. Something that isn\u0027t perfect, but might be developed into something that works. Isn\u0027t that the least that we as a community can do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61605-Modding-Team-Wanted-the-Resource-Expansion-Module-Project\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/61605-Modding-Team-Wanted-the-Resource-Expansion-Module-Project\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tntristan12\u0022 data-cite=\u0022tntristan12\u0022\u003E\u003Cdiv\u003EAs for the solution I outlined in my last post, I came up with a graph of what I had in mind because I honestly have nothing better to do. I feel like something like this would contribute to gameplay without becoming the sole purpose of it, because everything you get out of it could help you in your overall mission, but isn\u0027t just the sole reason for being. What do you think?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWould probably work fine. I\u0027d want a small, all-in-one part for probes though.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-12-17T17:09:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EWould probably work fine. I\u0027d want a small, all-in-one part for probes though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, maybe something that\u0027s similar in size to the 1.25 meter ion engine, that can drill, separate, and convert all at once, but rather than have all the benefits of separate manned units, it can only produce resource at a time, and in smaller quantities?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-17T17:10:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAny solution for resources should meet the needs of small-time resource users and industrial-scale tycoons, and it should be fun (or at least unobtrusive), and should also not become the main focus of the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHonestly, I strongly disagree that small probes should be able to manage their own refueling with zero external refueling. I think there should be some level of infrastructure that is needed for mining, resourcing, resource conversion, etc. for the explicit purpose of preventing this. As you pointed out there\u0027s a middle ground, for complexity as well as infrastructure. \u003C/p\u003E\u003Cp\u003EThat middle ground should exclude that low-end probe refueling (they should need to carry their own fuel), and the high-end \u0022only massive creations can do resourcing\u0022. Moving towards the low-end would be too close to trivializing fuel use and too exploitable.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-17T17:12:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tntristan12\u0022 data-cite=\u0022tntristan12\u0022\u003E\u003Cdiv\u003EYeah, maybe something that\u0027s similar in size to the 1.25 meter ion engine, that can drill, separate, and convert all at once, but rather than have all the benefits of separate manned units, it can only produce resource at a time, and in smaller quantities?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d suggest the same drawback as the ion: Super-duper slow and takes a metric ton of electricity.\u003C/p\u003E\n"}]}