{"TopicId":56535,"ForumId":44,"TopicTitle":"What would DQ an astronaut","CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-12-17T20:43:50Z","PageNum":1,"Articles":[{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-12-17T20:43:50Z","Content":"\n\u003Cp\u003EI strongly doubt that I will ever be competing for a job as an astronaut. This is a hypothetical thread for what would disqualify (DQ) an individual.\u003C/p\u003E\u003Cp\u003EI personally think I would be DQed for Celiac Disease. If that didn\u0027t somehow DQ me, than maybe asthma or 20/40 vision in one eye.\u003C/p\u003E\u003Cp\u003ESo, is there a list anywhere for what would DQ someone?\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-12-17T20:51:44Z","Content":"\n\u003Cp\u003ENo idea if there\u0027s any public list but I think it\u0027s safe to assume the requirements are even more demanding than any military/law enforcement job. If even the military won\u0027t have you I doubt any space agency will.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-12-17T20:52:49Z","Content":"\n\u003Cp\u003EI think the list is rather what would qualify you. It\u0027s a highly selective process for a very small number of positions, so to qualify as an astronaut, you really just have to be the best candidate among hundreds of other really really smart people.\u003C/p\u003E\u003Cp\u003EIt also depends on the organization. NASA doesn\u0027t necessarily have the same criteria as ESA or other space agencies.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2013-12-17T20:57:32Z","Content":"\n\u003Cp\u003EIf you want NASA\u0027s requirements specifically, they should be \u003Ca href=\u0022http://astronauts.nasa.gov/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E somewhere. The educational requirements are easy enough to find, but I haven\u0027t yet come across anything but a few criteria of the \u0027NASA flight physical\u0027 you have to pass.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2013-12-18T02:13:11Z","Content":"\n\u003Cp\u003EWell the russians will fly you into space if you\u0027ve got a spare $70million.\u003C/p\u003E\u003Cp\u003EAs long as you\u0027re reasonably healthy and pass all the training exams they\u0027ll be willing to take you up as human cargo.\u003C/p\u003E\u003Cp\u003EIf you want to actually push buttons and stuff I imagine you\u0027d have to be in pretty much perfect health. Like other have said, the competition is so fierce.\u003C/p\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2013-12-18T02:22:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWell the russians will fly you into space if you\u0027ve got a spare $70million.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think Richard Garriot paid $25 million but he was paying his own space tourist company.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Astronaut_training\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Astronaut_training\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENot only physical considerations, most modern astronaut selection programs focus on psychological factors also.\u003C/p\u003E\u003Cp\u003EAttention to detail in repetitive mind numbingly dull tasks, ability to calmly and professionally deal with people, the ability to follow directions and take leadership where necessary without creating conflict.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-12-18T02:32:58Z","Content":"\n\u003Cp\u003EThere are also height and I believe weight requirements (kind of old, but here\u0027s one source on height requirements \u003Ca href=\u0022http://usatoday30.usatoday.com/tech/science/space/2007-04-02-astronaut-size_N.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://usatoday30.usatoday.com/tech/science/space/2007-04-02-astronaut-size_N.htm\u003C/a\u003E). A few years back I met a nice woman at an alumni event who worked for NASA, and was pretty close to being in one of the earliest groups of female NASA astronauts, except at about 6 feet tall she was way outside the initial height/weight requirements they had set for women.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-12-18T03:10:12Z","Content":"\n\u003Cp\u003Eim slightly schizophrenic, so i doubt il be allowed on a space craft. they dont even let me drive.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-18T04:32:48Z","Content":"\n\u003Cp\u003ELast I checked, the only qualification for a U.S.M.C pilot I didn\u0027t make was age by about a year. Eye sight is just barely passing, but passing still. I don\u0027t think there is any specific reason to disqualify me from a space mission. On the other hand, there are people way better qualified and more fit, so I doubt I\u0027d have a snow ball\u0027s chance of actually making into a program.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-12-18T04:33:56Z","Content":"\n\u003Cp\u003EI flew a plane once, does that count?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-18T04:44:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveofDefeat\u0022 data-cite=\u0022DaveofDefeat\u0022\u003E\u003Cdiv\u003EI flew a plane once, does that count?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends. What kind of a plane?\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-12-18T05:37:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EOn the other hand, there are people way better qualified and more fit, so I doubt I\u0027d have a snow ball\u0027s chance of actually making into a program.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Canadian Space Agency put a job ad for astronauts in the paper a few years ago. I too wouldn\u0027t have had a snow ball\u0027s chance in heck of being selected, but I applied anyway. I was hoping that I\u0027d get a rejection letter on CSA letterhead so I could frame it. I made it through a couple of rounds before they sent me a very politely worded email telling me that they weren\u0027t interested. I didn\u0027t make it as far as an interview and I didn\u0027t get a rejection letter to frame. Somehow the email just wasn\u0027t worth framing...\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2013-12-18T14:07:52Z","Content":"\n\u003Cp\u003EFor me the easiest disqualifier would be size. I\u0027m too tall (about 197cm), at least some mars-mission-simulation I wanted to sign up for had the height limit at something like 180cm. I suppose it makes sense, but that was a bit of a downer \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2013-12-18T15:09:12Z","Content":"\n\u003Cp\u003ESize For me too....\u003C/p\u003E\u003Cp\u003EOh and lack of any flying experience...\u003C/p\u003E\u003Cp\u003Eor science background, \u003C/p\u003E\u003Cp\u003Eor good eyesight, \u003C/p\u003E\u003Cp\u003Etoo old,\u003C/p\u003E\u003Cp\u003Eand \u003C/p\u003E\u003Cp\u003ESQUIRREL!!!!!!!\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-12-18T15:49:22Z","Content":"\n\u003Cp\u003Ethe original astronaut corpse for NASA were all selected from the graduates of the US Air Force Test Pilot School.\u003C/p\u003E\u003Cp\u003EAnd only a small selection of their graduates made the grade.\u003C/p\u003E\u003Cp\u003ESince then the pool of candidates has been widened to include the other branches and even civilians, but the competition is just as fierce.\u003C/p\u003E\u003Cp\u003EIf you can\u0027t stand flying a Mach 2\u002B fighter jet through 7G turns, well...\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-12-18T17:48:03Z","Content":"\n\u003Cp\u003EI\u0027m too tall.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/audience/forstudents/postsecondary/features/F_Astronaut_Requirements.html\u0022 rel=\u0022external nofollow\u0022\u003ENASA\u003C/a\u003E: \u0022Height between 58.5 and 76 inches.\u0022\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.esa.int/Our_Activities/Human_Spaceflight/Astronauts/Astronaut_training_requirements\u0022 rel=\u0022external nofollow\u0022\u003EESA\u003C/a\u003E: \u0022...within the height range of 153 to 190 cm.\u0022\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.asc-csa.gc.ca/eng/astronauts/selection.asp\u0022 rel=\u0022external nofollow\u0022\u003EASC-CSA\u003C/a\u003E: \u0022Standing height must be between 149.5 cm to 190.5 cm\u0022\u003C/p\u003E\u003Cp\u003EI stand 195cm, or 6\u00275\u0022 and some (76 inches\u002B) tall.\u003C/p\u003E\u003Cp\u003EThe reason why space progams prefer people of a specific height (or body size, to be more accurate), is because they don\u0027t want to build things to accommodate large people if they don\u0027t have to. People with large bodies will consume more food and require bigger chairs, which both weigh more than simply tailoring things for people who are small. Therefore, people who are too tall or too fat or whatever are disqualified. \u003C/p\u003E\u003Cp\u003EThat all said, I probably should\u0027ve been working on a career focus like astronautics if I wanted to in the first place.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2013-12-19T06:04:42Z","Content":"\n\u003Cp\u003EI would say not crashing every spaceship you touch, yes Jeb, I\u0027m looking at you. And also not blowing it up, and not killing anybody FOR SCIENCE!\u003C/p\u003E\n"}]}