{"TopicId":56545,"ForumId":16,"TopicTitle":"Episode .23: The Kraken Strikes Back","CreatedByName":"LittleItaly","CreatedById":69633,"CreatedDateTime":"2013-12-17T21:46:57Z","PageNum":1,"Articles":[{"CreatedByName":"LittleItaly","CreatedById":69633,"CreatedDateTime":"2013-12-17T21:46:57Z","Content":"\n\u003Cp\u003EAfter updating to .23, I have noticed that quite literally everything that I build breaks...even the simplest module attached to an SRB and a parachute. In the VAB, everything is connected, but as soon as I launch it, when the physics engine kicks in, the connection between the command module/probe core (any of them) is severed from the rest of the build. Granted, I have a few mods (Deadly Reentry and Kethane to be exact) installed. Could those be the culprit? Has anyone else had this problem?\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-12-17T21:52:02Z","Content":"\n\u003Cp\u003EI don\u0027t have this problem in an all stock game, so uninstall the mods, then try.\u003C/p\u003E\n"},{"CreatedByName":"GROOV3ST3R","CreatedById":27590,"CreatedDateTime":"2013-12-17T21:52:07Z","Content":"\n\u003Cp\u003EThat would be what\u0027s wrong with your game. I have just downloaded a fresh copy and I\u0027m running it without mods. Works fine. Most of the plugins will be broken by the update - it\u0027s usually a good idea to wait until a few days after the launch, when creators fix their plugins or they are tested thoroughly for compatibility.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-12-17T22:34:33Z","Content":"\n\u003Cp\u003EI\u0027m going to second the suggestion to try it again after uninstalling your mods. Not all of them have been verified to work with 0.23 properly, so it\u0027s entirely possible that changes in the way the stock game\u0027s code works could be causing unintended interactions.\u003C/p\u003E\n"},{"CreatedByName":"scottyblizz","CreatedById":97262,"CreatedDateTime":"2013-12-18T00:12:22Z","Content":"\n\u003Cp\u003Ei have been having the same problem without mods. my rockets just fall apart before I can launch them. The structural towers kinda help but my game is still broken as of 0.23 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"}]}