{"TopicId":56575,"ForumId":16,"TopicTitle":"Can someone explain how the bars work in the new science dialogue area?","CreatedByName":"flightmaster","CreatedById":32617,"CreatedDateTime":"2013-12-17T23:33:13Z","PageNum":1,"Articles":[{"CreatedByName":"flightmaster","CreatedById":32617,"CreatedDateTime":"2013-12-17T23:33:13Z","Content":"\n\u003Cp\u003EI\u0027m just a bit confused about the differences between the solid colour and the greyed out colour of the same bar... Is it like a theoretical maximum?\u003C/p\u003E\n"},{"CreatedByName":"vidboi","CreatedById":60555,"CreatedDateTime":"2013-12-17T23:46:19Z","Content":"\n\u003Cp\u003EThe solid colour is what you will get for the return/transmission of that data. The darker colour represents the maximum limit you can get from returning/transmitting that data multiple times. The grey part of the bar is what you can\u0027t get/have previously got. You can increase the amount that you can get using the lab module (reducing the amount of grey). Note that after transmitting the maximum amount of data possible you can still collect all the science remaining from returning the data.\u003C/p\u003E\n"},{"CreatedByName":"flightmaster","CreatedById":32617,"CreatedDateTime":"2013-12-18T00:03:00Z","Content":"\n\u003Cp\u003EAwesome, thanks for the info\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vidboi\u0022 data-cite=\u0022vidboi\u0022\u003E\u003Cdiv\u003EThe darker colour represents the maximum limit you can get from returning/transmitting that data multiple times.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs that multiple times in the same run or multiple times over several launches? I\u0027m actually really struggling to get the concept of the science haha, I\u0027m probably overcomplicating it!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-12-18T00:16:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022flightmaster\u0022 data-cite=\u0022flightmaster\u0022\u003E\u003Cdiv\u003EAwesome, thanks for the info\u003Cp\u003EIs that multiple times in the same run or multiple times over several launches? I\u0027m actually really struggling to get the concept of the science haha, I\u0027m probably overcomplicating it!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo put it a slightly different way: The bar as a whole represents the total amount of value you can get out of that experiment. The lighter color represents what you\u0027ll get from this one run, and the darker color represents how much total value will be left over in the \u0022science pool\u0022 for that particular experiment in that particular situation.\u003C/p\u003E\n"}]}