{"TopicId":56685,"ForumId":32,"TopicTitle":"Manned Vs. unmanned missions","CreatedByName":"Maxwell Fern","CreatedById":68536,"CreatedDateTime":"2013-12-18T13:39:15Z","PageNum":1,"Articles":[{"CreatedByName":"Maxwell Fern","CreatedById":68536,"CreatedDateTime":"2013-12-18T13:39:15Z","Content":"\n\u003Cp\u003EHi there,\u003C/p\u003E\u003Cp\u003Efirst of all, I\u0027d like to say I love this update, especially the performance boost. But I\u0027m a little surprised by how it made unmanned missions so inferior to manned ones:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EStill no crew or EVA report, no surface samples, and no counterpart. And of course you need electricity or you lose control of your ship (nothing new here).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf you plan to come back, a Kerbal can transfer experiment results to the pod so you don\u0027t need to bring all the science equipment along.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf you plan a one way trip, 2 kerbals can operate the Science lab and maximize the science yield.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAm I missing something or is there basically no upside to launch an unmanned mission, except for the little gain in weight ?\u003C/p\u003E\n"},{"CreatedByName":"Azoth","CreatedById":92220,"CreatedDateTime":"2013-12-18T14:22:19Z","Content":"\n\u003Cp\u003EThat really seems to be it. I made a thread on it a month or so ago asking if there really was a point to unmanned missions. the best answers really were for the saved weight, for scouting landing zones, and for role playing. hopefully the next update will make unmanned missions actually useful. Until then, there really isn\u0027t much point in investing science in unmanned tech except to reach whatever is beyond it.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2013-12-18T14:27:26Z","Content":"\n\u003Cp\u003EUnmanned stuff is hugely useful for assembling stuff in orbit, or to send provisions to kerbals somewhere. Or one could imagine a landed science lab and some unmanned rovers with experiments that drive around to the different regions.\u003C/p\u003E\u003Cp\u003EUnmanned probes with one or two experiments are still good as cheap (they can be made very small and thus require only a tiny/cheap booster) one-offs to distant targets as well\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-18T14:30:50Z","Content":"\n\u003Cp\u003ERemember even real probes might be able to get a lot of information, but you would get more by doing a manned mission. So I would reason a probe would be a great starting point before you send a manned mission to where you are going, at least until you have the science lab. With science lab you could make traveling science lab that you put into orbit and deploy probes and have those probes come back to the lab to reset science.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-18T14:33:35Z","Content":"\n\u003Cp\u003EOnce Squad implements life support, unmanned missions will take on the obvious \u0022cheaper, faster, no risk of life and limb\u0022 roles that they do in reality.\u003C/p\u003E\u003Cp\u003EThat being said, for now... it\u0027s lighter, and that\u0027s about it.\u003C/p\u003E\n"},{"CreatedByName":"Man in the Funny Hat","CreatedById":95419,"CreatedDateTime":"2013-12-18T16:17:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003EOnce Squad implements life support, unmanned missions will take on the obvious \u0022cheaper, faster, no risk of life and limb\u0022 roles that they do in reality.\u003Cp\u003EThat being said, for now... it\u0027s lighter, and that\u0027s about it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EYeah, you have to remember that this is still not the finished form of the game. Eventually you will be dealing with reputation and money constraints that will make putting kerbals into space more expensive and risky - so you\u0027ll be weighing the value of getting more science versus the costs of getting it.\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-12-18T16:29:21Z","Content":"\n\u003Cp\u003EThey\u0027re useful to me because if i leave my kerbals unprotected for too long they get irradiated.\u003C/p\u003E\n"},{"CreatedByName":"Luckless","CreatedById":3954,"CreatedDateTime":"2013-12-18T17:22:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Liowen\u0022 data-cite=\u0022Liowen\u0022\u003E\u003Cdiv\u003ERemember even real probes might be able to get a lot of information, but you would get more by doing a manned mission.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is however real world arguments against manned missions.\u003C/p\u003E\u003Cp\u003EHow much mass is required for a human, the life support for them, \u003Cem\u003Eand their return trip\u003C/em\u003E? How much of that mass could instead be used on \u003Cem\u003Emore\u003C/em\u003E unmanned rovers?\u003C/p\u003E\u003Cp\u003EHow long can a single human stay for a given payload? How many more months can a rover or probe stay on the same? \u003C/p\u003E\u003Cp\u003EFor the cost of landing a single person on another planet to investigate a single location, we can drop dozens, if not hundreds of probes all over the surface and gather even more information and conduct the same experiments. Not only that, but we can gather it in an ongoing manner.\u003C/p\u003E\u003Cp\u003EIdeally I would like to see more support for unmanned missions, while manned missions unlock other things. They should work together and both be equally useful.\u003C/p\u003E\n"},{"CreatedByName":"richiespeed13","CreatedById":96460,"CreatedDateTime":"2013-12-18T17:30:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luckless\u0022 data-cite=\u0022Luckless\u0022\u003E\u003Cdiv\u003EThere is however real world arguments against manned missions.\u003Cp\u003EHow much mass is required for a human, the life support for them, \u003Cem\u003Eand their return trip\u003C/em\u003E? How much of that mass could instead be used on \u003Cem\u003Emore\u003C/em\u003E unmanned rovers?\u003C/p\u003E\u003Cp\u003EHow long can a single human stay for a given payload? How many more months can a rover or probe stay on the same? \u003C/p\u003E\u003Cp\u003EFor the cost of landing a single person on another planet to investigate a single location, we can drop dozens, if not hundreds of probes all over the surface and gather even more information and conduct the same experiments. Not only that, but we can gather it in an ongoing manner.\u003C/p\u003E\u003Cp\u003EIdeally I would like to see more support for unmanned missions, while manned missions unlock other things. They should work together and both be equally useful.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat post, this is how I feel also.\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-12-18T18:56:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DonLorenzo\u0022 data-cite=\u0022DonLorenzo\u0022\u003E\u003Cdiv\u003EUnmanned stuff is hugely useful for assembling stuff in orbit, or to send provisions to kerbals somewhere. Or one could imagine a landed science lab and some unmanned rovers with experiments that drive around to the different regions.\u003Cp\u003EUnmanned probes with one or two experiments are still good as cheap (they can be made very small and thus require only a tiny/cheap booster) one-offs to distant targets as well\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is exactly how I\u0027m going about it. Unmanned for refueling the manned science station and lander, as well as unmanned science probes and rovers to get to those dangerous nooks and crannies I\u0027d be to scared to send a manned mission to. Yeah, it would be nice to have a core driller for surface samples. I bet there will be a mod for that soon!\u003C/p\u003E\n"},{"CreatedByName":"Luckless","CreatedById":3954,"CreatedDateTime":"2013-12-18T22:48:09Z","Content":"\n\u003Cp\u003EI would also really love to see samples as modelled objects within the game that can be transferred between craft, and various sample materials that can be collected from the various biomes with different methods. Surface materials would be easy to pick up. Various rocks, sands, fluids, etc. Then have deeper samples that would require a drill. Samples could be collected and analyzed remotely for a limited amount of science with a probe, or analyzed by a trained scientist on site for a major bonus. Actually bringing the sample back then unlocks even more science (Representing the greater number of scientist who then get to work with it.)\u003C/p\u003E\u003Cp\u003EHaving a trained scientist on site as the sample is collected would give a bonus (better observations of the local conditions), so there is still the incentive to carting the manned crew all the way out, but a probe based play style should still be as completely valid as a manned based program.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-12-19T00:36:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003EOnce Squad implements life support, unmanned missions will take on the obvious \u0022cheaper, faster, no risk of life and limb\u0022 roles that they do in reality.\u003Cp\u003EThat being said, for now... it\u0027s lighter, and that\u0027s about it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECurious as to how that will work. I would say it should mean that the ship requires power and to run life support and possibly a generic life support matter/waste matter resource.\u003C/p\u003E\u003Cp\u003EPerhaps also there could be a device to convert waste matter back to life support matter at a very slow rate. Although it may convert some to unusuable junk matter instead(which can be ejected).\u003C/p\u003E\u003Cp\u003EIt would take about 2 kg to feed a Kerbal, however only 0.5 kg of this is food, the rest is water, which can be easily recycled using electricity.\u003C/p\u003E\u003Cp\u003EIf power were lost, air would keep 3 Kerbals alive for about 48 hours for the 3-man cockpit (about 18 hours in the regular 1 man, 96 hours in the cupola, 24 in the mk 1 lander can, and 72 in the mk 1-2.). An EVA Kerbal could live for about 8 more hours.\u003C/p\u003E\u003Cp\u003EIgnoring food-recyclers, rehydrated food for a round-trip mission to Duna lasting 283 days would weigh 141.5 kg. (assuming that waste can be treated and the water sanitized.)\u003C/p\u003E\u003Cp\u003EI would say a Kerbal can probably live 1 month without food and 3 real days without water. At that point, they die.\u003C/p\u003E\u003Cp\u003EPerhaps using tweakable GUIs, food and water-recycling equipment could be built into some of the larger capsules. Food would be available on all capsules, but water-recyclers would be limited to just the 3-man capsules and the 4-man crew tanks.\u003C/p\u003E\u003Cp\u003EAs for food recyclers, I believe they are not quite developed enough, save for growing plants onboard, to get accurate numbers on.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2013-12-19T00:42:02Z","Content":"\n\u003Cp\u003EOh, might I mention that this makes it marginally possible (though not fuel-efficient) to rescue Kerbals from the mun who\u0027ve been stranded there without a working lander.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-12-19T03:10:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003EOnce Squad implements life support...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich hopefully will NEVER happen. I mean, there\u0027s no fun upside to burdening the players with it and there\u0027s always the question: how do we know Kerbals even need life support? They\u0027re not human so certainly humanocentric life support would kill them. They don\u0027t have noses so obviously don\u0027t need oxygen. And they\u0027re obviously not native to Kerbin because they have to wear spacesuits outside there just like everywhere else \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThat being said, for now... it\u0027s lighter, and that\u0027s about it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut to get back on topic....\u003C/p\u003E\u003Cp\u003EIn career mode, probes have only 2 uses: Eve landers and piloting modules of multi-part ships you\u0027re building in orbit. Otherwise, they merely cheat you out of the Kerbal-based science.\u003C/p\u003E\u003Cp\u003ENow, in sandbox, it\u0027s totally the reverse. All Kerbals can do is menial labor: fixing flats, pumping gas, etc. So unless you actually need that labor, you don\u0027t need Kerbals because probes can fly the rockets just fine.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2013-12-19T20:17:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EWhich hopefully will NEVER happen. I mean, there\u0027s no fun upside to burdening the players with it and there\u0027s always the question: how do we know Kerbals even need life support? They\u0027re not human so certainly humanocentric life support would kill them. They don\u0027t have noses so obviously don\u0027t need oxygen. And they\u0027re obviously not native to Kerbin because they have to wear spacesuits outside there just like everywhere else \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003Cp\u003EBut to get back on topic....\u003C/p\u003E\u003Cp\u003EIn career mode, probes have only 2 uses: Eve landers and piloting modules of multi-part ships you\u0027re building in orbit. Otherwise, they merely cheat you out of the Kerbal-based science.\u003C/p\u003E\u003Cp\u003ENow, in sandbox, it\u0027s totally the reverse. All Kerbals can do is menial labor: fixing flats, pumping gas, etc. So unless you actually need that labor, you don\u0027t need Kerbals because probes can fly the rockets just fine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot native to kerbin?\u003C/p\u003E\u003Cp\u003E1. They have no spacesuits in vechicle asembly building (And the doors are open)\u003C/p\u003E\u003Cp\u003E2. Eva reports on kerbin surface say that they think they would not need a spacesuit.\u003C/p\u003E\n"},{"CreatedByName":"Great General Kaboomsky","CreatedById":96553,"CreatedDateTime":"2013-12-19T21:03:22Z","Content":"\n\u003Cp\u003EI know it has probably been talked to death at this point, but I still see a really great purpose for unmanned missions at the very start of the career mode. I\u0027m not thinking so-much in the direction of the probes that we already have (a.k.a. fully-controllable replacements for a Kerbal pilot) but rather an un-guided instrument package on a sounding rocket (basically, a normal probe core but with no ability to control the rocket,) which could earn you your first few science points, teach new players a little bit about rocketry, and not risk the damage to reputation and budget (once they are implemented) which could ruin a fledgling space agency if their first manned mission were to end in disaster.\u003C/p\u003E\u003Cp\u003EAnyway, consider my 2 cents chipped in. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ricktza","CreatedById":93948,"CreatedDateTime":"2013-12-19T21:57:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EWhich hopefully will NEVER happen. I mean, there\u0027s no fun upside to burdening the players with it and there\u0027s always the question: how do we know Kerbals even need life support? They\u0027re not human so certainly humanocentric life support would kill them. They don\u0027t have noses so obviously don\u0027t need oxygen. And they\u0027re obviously not native to Kerbin because they have to wear spacesuits outside there just like everywhere else \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003Cp\u003EBut to get back on topic....\u003C/p\u003E\u003Cp\u003EIn career mode, probes have only 2 uses: Eve landers and piloting modules of multi-part ships you\u0027re building in orbit. Otherwise, they merely cheat you out of the Kerbal-based science.\u003C/p\u003E\u003Cp\u003ENow, in sandbox, it\u0027s totally the reverse. All Kerbals can do is menial labor: fixing flats, pumping gas, etc. So unless you actually need that labor, you don\u0027t need Kerbals because probes can fly the rockets just fine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://scontent-b-lhr.xx.fbcdn.net/hphotos-frc3/q71/s720x720/1514154_709059909113236_1681323697_n.jpg\u0022 alt=\u00221514154_709059909113236_1681323697_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think this answers the question about life support, it seems they are somewhat like a plant \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2013-12-19T22:01:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003E I mean, there\u0027s no fun upside to burdening the players with it\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wish fuel wasn\u0027t a factor in rocket design. I mean, there\u0027s no fun upside in burdening the players with such limitations.\u003C/p\u003E\u003Cp\u003ENow, I don\u0027t really think that, and I\u0027m pretty sure that you don\u0027t either. Why is fuel considered an acceptable limitation, but life support is deemed a burden? They are, functionally, the exact same thing; they limit what can be achieved with any one spacecraft. A lot of people find that enjoyable. Some people don\u0027t. My point is that your claim that there\u0027s \u0022no fun\u0022 in such a system is entirely your own opinion.\u003C/p\u003E\n"},{"CreatedByName":"Wheffle","CreatedById":74893,"CreatedDateTime":"2013-12-19T22:53:49Z","Content":"\n\u003Cp\u003EI\u0027m planning on modding some of the simple measurement-parts (like the thermometer) to have very high-yield transmission science gain, like they should (because they are just simple measurements). I feel that it would make probe missions more valuable and realistic.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EJust to throw my 2 cents at the life support argument, I play with TAC LS and it really adds a lot to the game for me. Because of the size of the solar system compared to ours, storing food, oxygen or water for missions is trivial compared to real life. I wouldn\u0027t be surprised if Squad eventually introduced a simple LF mechanic.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-19T22:58:50Z\u0022 title=\u002212/19/2013 10:58  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 19, 2013\u003C/time\u003E by Wheffle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ElectricalFan","CreatedById":80889,"CreatedDateTime":"2013-12-20T03:04:22Z","Content":"\n\u003Cp\u003E1. I absolutely hate killing Kerbals. 2. I read somewhere next update there\u0027s going to be an economy, so Kerbals might be quite expensive, and we might have to pay them based on how long they\u0027re in space, while probes won\u0027t cost too much.\u003C/p\u003E\n"},{"CreatedByName":"Dangerous_Beans","CreatedById":78059,"CreatedDateTime":"2013-12-20T05:04:01Z","Content":"\n\u003Cp\u003Ei just feel bad having a Kerbal cooped up, all alone, for weeks at a time. how would you feel being stuck in a Mk1 command pod for a round trip to Duna?\u003C/p\u003E\u003Cp\u003Eso i use probes anywhere i can\u0027t justify multiple Kerbals and enough space for them to stretch their legs.\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-12-20T05:38:26Z","Content":"\n\u003Cp\u003EThe only thing I will say for life support is that if they do implement it, there should be a way in which to replenish it. \u003C/p\u003E\u003Cp\u003EOnboard oxygen/food farm, or something similar. Some of those long trips out to Jool would be incredibly difficult if life support were a finite resource.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-20T05:55:26Z\u0022 title=\u002212/20/2013 05:55  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 20, 2013\u003C/time\u003E by FlamedSteak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"federicoaa","CreatedById":94879,"CreatedDateTime":"2013-12-20T07:14:39Z","Content":"\n\u003Cp\u003EI think adding some parts for unmanned science would make unmanned science better. Something that allows to take surface analysis for example (I would describe this as a robotic arm with a driller duct taped to it, with a space-proof duct tape off course)\u003C/p\u003E\n"},{"CreatedByName":"Maxwell Fern","CreatedById":68536,"CreatedDateTime":"2013-12-20T10:21:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022federicoaa\u0022 data-cite=\u0022federicoaa\u0022\u003E\u003Cdiv\u003EI think adding some parts for unmanned science would make unmanned science better. Something that allows to take surface analysis for example (I would describe this as a robotic arm with a driller duct taped to it, with a space-proof duct tape off course)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem with that is that it turns probes into science modules, so the best choice in all cases will still be to send a manned mission, with a probe attached to get that robotic arm experiment.\u003C/p\u003E\u003Cp\u003EWe need a new game mechanics that justifies sending unmanned one-way trip missions. RemoteTech2 somehow fills that void for me, but it can be better and more deeply implicated.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-12-20T11:29:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EWhich hopefully will NEVER happen. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree, a life support mechanism, as long as it\u0027s done well, (only a few things to manage, recyclers, some sort of food generation, and enough in the EVA suit to support some orbital stunts, resource system integration) it could add some interesting aspects to the game. \u003C/p\u003E\u003Cp\u003ETime in space becomes a limited thing, reducing the convenience of time warp, so some time based mechanisms could be used. \u003Cspan style=\u0022font-size:8px;\u0022\u003EThings like science and budget could have time based aspects.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIt makes mission planning a little more complex if you\u0027re concerned with safety- Do I bring more of the life support, so they can wait until rescue, or build a redundancy system to return home?\u003C/p\u003E\u003Cp\u003EThe possibility of processing gasses and liquids (and maybe soils) for life support useage is another use for stations and bases- the processing part might be big and heavy, and inideal to lug around. \u003C/p\u003E\u003Cp\u003EPlus, there\u0027s the added reason to use probes.\u003C/p\u003E\u003Cp\u003EI tend to use probes if there\u0027s no reason to bring a kerbal along, for example, a mapping satellite, or a piece of infrastructure. I\u0027m also quite into the roleplay aspect of the game, and unless I\u0027m planning out a whole big mission, I\u0027ll just send a probe for interplanetary trips.\u003C/p\u003E\n"}]}