{"TopicId":56806,"ForumId":16,"TopicTitle":"Save Game Setback","CreatedByName":"Ironwatsas","CreatedById":61128,"CreatedDateTime":"2013-12-19T04:44:27Z","PageNum":1,"Articles":[{"CreatedByName":"Ironwatsas","CreatedById":61128,"CreatedDateTime":"2013-12-19T04:44:27Z","Content":"\n\u003Cp\u003EIn the midst of a rather spectacular career, I\u0027ve run into a massively annoying issue: After a botched munar insertion with a probe, I tried to load a quicksave. Unfortunately, this sent me BACK IN TIME to a previous mission, several missions prior. Thus, the loss not only of a munar lander, but of a gillion points worth of science which would be rather painful to do again.\u003C/p\u003E\u003Cp\u003EHow do I load an autosave or otherwise re-undo the botched quick-save to get back to my exciting mun mission and not have to unlock half the tech tree. Again. Is there something simple I\u0027m missing here or am I totally screwed?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-19T05:52:45Z\u0022 title=\u002212/19/2013 05:52  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 19, 2013\u003C/time\u003E by Ironwatsas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-12-19T05:25:18Z","Content":"\n\u003Cp\u003EYou\u0027ve probably lost it. There are two save files, persistent and quicksave. The persistent file gets updated each time you exit and periodically when you see \u0027auto saving\u0027. The quicksave file is created whenever you press F5 and is the same as persistent. Holding down F9 replaces the persistent file with your quicksave file, overwriting it.\u003C/p\u003E\u003Cp\u003EWhat you can do is see if you have a backup of your persistent.sfs. Do you run any backup software that might have a copy?\u003C/p\u003E\u003Cp\u003EIf you are on Windows Vista or later go to your kerbal folder (if its steam then look in your steam folder under steamapps\\common) and open the saves folder. You\u0027ll find a folder with the name of your career. In that folder right click persistent.sfs and choose properties and click on the previous versions tab to see if you have a suitable backup. Be warned that the answer is likely no. Unless you\u0027ve changed the configuration Windows does not aggressively store copies of files like that (it is mainly keeping copies of any changed system files and files in the documents folder).\u003C/p\u003E\n"},{"CreatedByName":"Ironwatsas","CreatedById":61128,"CreatedDateTime":"2013-12-19T05:52:29Z","Content":"\n\u003Cp\u003ECurses! It seems there\u0027s no way to actually do that. Three hours worth of progress on the Munar Program are ruined! Ruined I tell you!\u003C/p\u003E\u003Cp\u003EIt seems sort of silly that the savegame system would work that way. They should think of something better, like F9 loading the most recent autosave OR quicksave.\u003C/p\u003E\u003Cp\u003EInfact, I should suggest that.\u003C/p\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2013-12-19T05:54:11Z","Content":"\n\u003Cp\u003ENext time this happens, just alt-f4 as soon as you realize the quicksave is too far back. This will prevent the game from having time to overwrite the persistent save file, so as to at least preserve your progress up to that point.\u003C/p\u003E\n"},{"CreatedByName":"Ironwatsas","CreatedById":61128,"CreatedDateTime":"2013-12-19T05:55:06Z","Content":"\n\u003Cp\u003EExcellent thought.\u003C/p\u003E\n"},{"CreatedByName":"dnugroho","CreatedById":85760,"CreatedDateTime":"2013-12-19T06:17:32Z","Content":"\n\u003Cp\u003EI had the same thing happened to me last night. I crashed my Munar lander full with experiment samples, and I intuitively pressed F9 to load my quicksave, only to find that I lost a few hours worth of science activities on the Mun and Minmus. However, \u003Cstrong\u003Ebefore\u003C/strong\u003E I exited KSP, I made a backup of the save folder right away before KSP create any new autosave. It is my understanding that during exit, the game will do an autosave. \u003C/p\u003E\u003Cp\u003EAfter I exit KSP, I renamed the current save folder to something else (as a backup just in case this procedure doesn\u0027t work), and renamed my \u003Cstrong\u003Ebackup\u003C/strong\u003E save folder to save folder. Voila! I got KSP back to the latest autosaved state. \u003C/p\u003E\u003Cp\u003EThis will only work if no autosave happened after the botched mission.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2013-12-19T09:17:20Z","Content":"\n\u003Cp\u003EI strongly second the introduction of a much improved save system. Like, named saves would be awesome, like : \u0022Just finished building the Death Star using a gazillion flat plates\u0022\u003C/p\u003E\n"}]}