{"TopicId":57053,"ForumId":55,"TopicTitle":"Science Overhaul","CreatedByName":"Schmonzo","CreatedById":5728,"CreatedDateTime":"2013-12-20T16:57:41Z","PageNum":1,"Articles":[{"CreatedByName":"Schmonzo","CreatedById":5728,"CreatedDateTime":"2013-12-20T16:57:41Z","Content":"\n\u003Cp\u003ELet me first say that although I don\u0027t like the science system I am no dev and have not talked to anyone about my idea, so it might as well be crap. Also english is not my first language so bare with me.\u003C/p\u003E\u003Cp\u003ELabs make nearly no sense (except for cleaning experiments) imo and since we can transport science via Kerbals now, there is no more need for transmitting data if you can take it all home for 100% yield instead. \u003C/p\u003E\u003Cp\u003EI think the solution to this would be that you \u003Cstrong\u003E(1.)\u003C/strong\u003E \u003Cem\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003Ecan not store unlimited science\u003C/span\u003E\u003C/em\u003E but instead you have a certain data capacity. Then if your mission collected too much science you would have to transmit it in order to create more \u0027sciencespace\u0027 on your Vessel. \u003Cstrong\u003E(2.)\u003C/strong\u003E \u003Cem\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003EHow much science can be stored would be connected to the commandpod\u003C/span\u003E\u003C/em\u003E (higher tech/more space for kerbals=more harddrive space; the lab would add the biggest storage value, thus making it a good station component to store collected data while command pods only have a rather small harddrive). \u003C/p\u003E\u003Cp\u003EThis way you would have a reason for transmitting if you are far away from home and can\u0027t bring all the collected data back. \u003Cstrong\u003E(3.)\u003C/strong\u003E The \u003Cem\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003Escienceloss should be connected to the antenna\u003C/span\u003E\u003C/em\u003E you are using though. The small antennas only have a very bad bandwidth and a lot of data is lost. The bigger the data \u0027packet\u0027 is the more data you loose. This way you can\u0027t do big interplanetary missions on a low tech level without a severe science hit. No Antenna would yield 100% though.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E(4.)\u003C/strong\u003E \u003Cem\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003ESurface samples, goo and material bay experiments could not be send unless processed in a lab\u003C/span\u003E\u003C/em\u003E, so you need one or need to bring the physical experiments home if you plan a long mission to many biomes. I think this would be a good system that still is not too complicated for all the newcomers. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat do you think about this?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Ehave a nice day!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-21T10:56:25Z\u0022 title=\u002212/21/2013 10:56  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 21, 2013\u003C/time\u003E by Schmonzo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Schmonzo","CreatedById":5728,"CreatedDateTime":"2013-12-21T08:19:10Z","Content":"\n\u003Cp\u003Eso nobody has an opinion about this?\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-12-21T09:17:56Z","Content":"\n\u003Cp\u003EI think you underestimate how many people are willing to transmit for a small return to save time and energy on returning the samples.\u003C/p\u003E\n"},{"CreatedByName":"Schmonzo","CreatedById":5728,"CreatedDateTime":"2013-12-21T10:53:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thereaverofdarkness\u0022 data-cite=\u0022thereaverofdarkness\u0022\u003E\u003Cdiv\u003EI think you underestimate how many people are willing to transmit for a small return to save time and energy on returning the samples.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you never return your kerbals home? Or do you transmit before you bring them back to kerbin?\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2013-12-21T13:40:01Z","Content":"\n\u003Cp\u003EItem 3 I fully agree with. \u003C/p\u003E\u003Cp\u003EThe rest sounds like punishing people for not using labs, which I don\u0027t agree with. Instead I suggest that the transmission bonus gets bumped up for labs, and all samples processed in a lab, whether transmitted or returned, get a bonus. This would reward the played for using them.\u003C/p\u003E\u003Cp\u003ELast night I created a 1-man ship that had 2 of each science experiment and could return from Muna or Minmus. This netted roughly 1000 science per trip. I also put a science lab in orbit around Mun and Minmus, and used these as drop offs and refueling stations for the lander. The thing is, it was easier and faster to NOT use the station. Using the station required rendezvous, docking, and EVA work. It also required an additional craft to act as the sample return vehicle, which is another rendezvous. It was faster and easier to just blast for home and relaunch.\u003C/p\u003E\u003Cp\u003EAll of the extra effort it takes to use a lab should be rewarded.\u003C/p\u003E\n"},{"CreatedByName":"CyclonicTuna","CreatedById":21888,"CreatedDateTime":"2013-12-21T15:42:45Z","Content":"\n\u003Cp\u003EI think you should take into account that for the most part the whole science part of the game is still WIP. It will most likely be subject to change untill the final release. Besides, I think that some of the features you mentioned like for instance being able to store only a set amount of science has already been considered by the dev\u0027s, if not tried out. \u003C/p\u003E\u003Cp\u003EI disagree however when you said that transmitting is useless. You have to take into account that a lot of this stuff also has to cooperate with an economy at some point. So transmitting data will most likely be more profitable untill a certain point. Bringing all your experiments back sometimes just doesn\u0027t make sense when you have to take a long trip to an unexplored world. Just look at NASA, they have no plans of brining their rovers back from Mars.\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2013-12-21T21:12:36Z","Content":"\n\u003Cp\u003EI agree with data size and storage being relevant with tech upgrades to improve it like electricity capacity.\u003C/p\u003E\u003Cp\u003EI disagree science loss is to do with antennae. Its to do with the nature of the experiment and must be in keeping to give texture and immersion. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EYou can always transmit a digital reading at 100%. eg\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003Eaero\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ethermal\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Egravity\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eseismic\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ebarometer\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Materials bay internal sensors are not as accurate as laboratory analysis so you lose data from transmitting that.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EBut you can get the rest of the data either by recovering the unreset (but transmitted) materials bay to the KSP base lab\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eor by processing it in a mobile lab module. So in a mobile lab you should be able to process the materials and goos to give 100% of the recovery data as transmit data with much higher data volume.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Samples should be highest value when recovered of all experiments and should have a different kind of volume to data ie need physical size and mass eg 10Kg.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EWith limited storage for capsules and lab.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA crew transmission should be able to recover 20% data from a sample without losing the sample eg like a photo of the sample and other simple readings.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe remaining 80% should require recovery of the sample to Kerbin,\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ebut a mobile lab should be able to add 30% to the 20% from the crew report to give max 50% field data because one lab is not as good as a university full of boffins with a few grams each.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Schmonzo","CreatedById":5728,"CreatedDateTime":"2013-12-22T16:35:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CyclonicTuna\u0022 data-cite=\u0022CyclonicTuna\u0022\u003E\u003Cdiv\u003EI think you should take into account that for the most part the whole science part of the game is still WIP. It will most likely be subject to change untill the final release. \u003Cp\u003EI disagree however when you said that transmitting is useless. You have to take into account that a lot of this stuff also has to cooperate with an economy at some point. So transmitting data will most likely be more profitable untill a certain point. Bringing all your experiments back sometimes just doesn\u0027t make sense when you have to take a long trip to an unexplored world. Just look at NASA, they have no plans of brining their rovers back from Mars.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, first of all, I am very aware that KSP is a work in progress, that\u0027s why I made a suggestion on the science system in the first place. The whole idea of suggestions only makes sense on areas the devs are still willing to work on in my opinion. \u003C/p\u003E\u003Cp\u003EFor the second part of your comment: NASA has unmanned probes on Mars, but in KSP we have Kerbals that don\u0027t need food or anything else to stay alive, so in many cases we send them rather than probes (this is also stimulated by the techtree). But still I see your point that on faraway planets people will probably probe first and go for a tour of getting surface samples later. So I guess my critique applies stronger to the kerbol system than the rest of the planets. But on Mun and Minmus you have to agree that it is far easier and (through the techtree) more likely that people send kerbals, thus having no reason to transmitting data... right?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-23T04:41:03Z","Content":"\n\u003Cp\u003EI FULLY agree with your 1st point: Limited data storage. I mentioned this prior to 0.23, and I hope to see it get implemented at some point. I\u0027d like to see Command Modules and probe cores store very limited amounts of data, and additional parts be introduced to store additional data.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-12-23T08:45:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Schmonzo\u0022 data-cite=\u0022Schmonzo\u0022\u003E\u003Cdiv\u003ESo you never return your kerbals home? Or do you transmit before you bring them back to kerbin?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI prefer to bring samples home but I\u0027m content with transmitting if bringing it home is too hard. Bringing the lab there is easier than taking the samples home.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-12-23T18:34:44Z","Content":"\n\u003Cp\u003ENo thanks for 1 and 2. This is a bit of an arbitrary, illogical and unintuitive mechanic designed solely to \u0022balance\u0022 the underlying gameplay. This is not, in general, a good way to go about things. Better to fix the underlying gameplay.\u003C/p\u003E\u003Cp\u003EApropos, 4 is on the right track. It \u003Cem\u003Emakes sense\u003C/em\u003E that you would have to analyze a sample in order to get any data from it. \u003C/p\u003E\u003Cp\u003E3... meh. I think transmission loss should be removed entirely. Again, this whole concept smacks of being an arbitrary \u0022balance mechanic\u0022 that was strapped on without regard to how the rest of the science gameplay functions, and suggestions that incorporate it seem to be beholden to the existing system squad has implemented. Look further afield for solutions, squad\u0027s current solutions are almost entirely categorizable under my first paragraph: arbitrary and unintuitive.\u003C/p\u003E\n"}]}