{"TopicId":57077,"ForumId":16,"TopicTitle":"Question on taking off at 270 instead of 90 degrees","CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-20T20:12:13Z","PageNum":1,"Articles":[{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-20T20:12:13Z","Content":"\n\u003Cp\u003EIf I launch a craft from KSC is there a difference in doing the gravity turn on the90 degree marker vs. the 270 (which is 180 degrees from 90)? I have been meaning to try it, but I keep forgetting to do it when I go for launch. I have tried to send a craft to Jool but I believe that I need a higher orbit than what I am using right now, I am at 110km for most orbits so most likely that is what the problem is. Then I thought if I was going the opposite way from the planet spin I could get a better angel for my burns, but I am think that this could be wrong though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-20T20:34:42Z\u0022 title=\u002212/20/2013 08:34  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 20, 2013\u003C/time\u003E by Liowen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-12-20T20:20:23Z","Content":"\n\u003Cp\u003EYes, you are wrong.\u003C/p\u003E\u003Cp\u003EThough it is perfectly possible to get into orbit it is less efficient. By launching WITH the rotation of Kerbin you\u0027re already moving at 174,53 m/s before you even left the launchpad. By launching AGAINST the rotation you\u0027ll have to get rid of that same 174,53 m/s, then gain it in your desired direction. That\u0027s a total of 349,06 m/s you could have used to get into orbit. 349,06 m/s is nearly half of what you need to get from Kerbin to Mun.\u003C/p\u003E\n"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2013-12-20T20:22:17Z","Content":"\n\u003Cp\u003EKerbin spins in the 90 degree direction, so if you burn for an orbit in that direction, the planet\u0027s spin will add to your initial velocity and make your burn easier. If you burn in the opposite direction (270 degrees), the planet\u0027s spin will be AGAINST your eventual orbit, and you\u0027ll have to burn MORE to offset it.\u003C/p\u003E\u003Cp\u003EIf your goal is to send a craft to a different planet, there\u0027s no real advantage to setting up a parking orbit at any given altitude. What you\u0027d gain in making for an easier exit burn from the higher altitude, you lose in having to reach that higher altitude. Basically the only thing you really need in the parking orbit, is that it be flat to the plane of the ecliptic.\u003C/p\u003E\n"},{"CreatedByName":"ThirdHorseman","CreatedById":77825,"CreatedDateTime":"2013-12-20T20:29:04Z","Content":"\n\u003Cp\u003EWell the obvious benefit for going 90 is that you then add the rotational speed of Kerbin into your d/v calculations, whereas if you use 270 you need to work against it.\u003C/p\u003E\u003Cp\u003ENinja\u0027d\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-20T20:29:35Z\u0022 title=\u002212/20/2013 08:29  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 20, 2013\u003C/time\u003E by ThirdHorseman\u003C/strong\u003E\n\u003Cbr\u003ENinja\u0026#039;d\n\u003C/span\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-20T20:38:38Z","Content":"\n\u003Cp\u003EOk I knew there was a reason, but somehow I had forgot about the rotation of the planet being as helpful (I blame the cold weather we are having today as to why). The only reason I do parking orbits is that at times I start the mission but have to go on to other things in real life, so by having it in orbit already makes it easier to deal with when I get back. Other times I go up with no real plan so I park and think about where I am going, oddly enough when I drive my car I just get in and go without planning where I am going LOL. Thanks for the help I guess I will just work on getting things right like I have been doing.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-12-20T20:40:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DeMatt\u0022 data-cite=\u0022DeMatt\u0022\u003E\u003Cdiv\u003E...\u003Cp\u003EIf your goal is to send a craft to a different planet, there\u0027s no real advantage to setting up a parking orbit at any given altitude. What you\u0027d gain in making for an easier exit burn from the higher altitude, you lose in having to reach that higher altitude. Basically the only thing you really need in the parking orbit, is that it be flat to the plane of the ecliptic.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, the altitude of your parking orbit DOES matter. A lower orbit has a higher velocity and thanks to the Oberth effect you\u0027re getting better efficiency from your engines the faster you\u0027re moving.\u003C/p\u003E\n"}]}