{"TopicId":57105,"ForumId":16,"TopicTitle":"Viewing ship info such as fuel levels in map mode","CreatedByName":"notasurgeon","CreatedById":30601,"CreatedDateTime":"2013-12-21T00:04:16Z","PageNum":1,"Articles":[{"CreatedByName":"notasurgeon","CreatedById":30601,"CreatedDateTime":"2013-12-21T00:04:16Z","Content":"\n\u003Cp\u003EEver since I discovered how to show the nav-ball in map mode, I do pretty much everything except taking off and docking there. My only complaint is that I have to flip back to ship view in order to see how close my current stage is to running out of fuel.\u003C/p\u003E\u003Cp\u003EIs it possible to view fuel levels in map mode? I don\u0027t mind using mods if necessary, although I\u0027d prefer to keep my game as stock as possible.\u003C/p\u003E\n"},{"CreatedByName":"Mr.Rocket","CreatedById":80241,"CreatedDateTime":"2013-12-21T00:18:36Z","Content":"\n\u003Cp\u003EYeah, you just click the resources tab in the top right corner. If you mean by stage, you can\u0027t, at least I don\u0027t think you can with stock. I use Kerbal Engineer Redux (very handy mod) and it can show how much Delta-v each stage has left, so when it reaches 0 that stage is out of fuel. Link here: \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-kerbal-engineer-redux-v0-5/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/0-18-1-kerbal-engineer-redux-v0-5/\u003C/a\u003E (It\u0027s not cheaty mod whatsoever, it changes nothing, only shows you what you couldn\u0027t see before). It doesn\u0027t work unless you attach the parts with it under the science tab.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-21T00:22:25Z\u0022 title=\u002212/21/2013 12:22  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 21, 2013\u003C/time\u003E by Mr.Rocket\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"hawkinator","CreatedById":57569,"CreatedDateTime":"2013-12-21T00:24:19Z","Content":"\n\u003Cp\u003EWell, if you look in the upper right hand corner of the screen you\u0027ll see a little grey tab called \u0022resources\u0022. Mouse over it to view it breifly, click it to stare deeply at it. It will show you how much fuel (and electricity and monopropellant and whatever else) you have, but unfortunately, it only shows (as far as I know) the fuel in the entire vessel, so it\u0027s not very good if you want to know how much fuel is in your current stage. \u003C/p\u003E\u003Cp\u003EAs far as mods go, I would recommend either MechJeb (which does a lot of other stuff), and Kerbal Engineer Redux (which doesn\u0027t). Both of these mods will give you a detailed breakdown of how much delta-v you have left on your current vessel. Knowing the amount of delta-v is, of course, much more useful than the amount of fuel, since the amount of delta-v obtained from a given amount of fuel varies depending on the engine it\u0027s being burned in.\u003C/p\u003E\n"},{"CreatedByName":"notasurgeon","CreatedById":30601,"CreatedDateTime":"2013-12-21T00:27:44Z","Content":"\n\u003Cp\u003EThanks for the quick replies!\u003C/p\u003E\u003Cp\u003EDon\u0027t the GUIs from those mods hide themselves along with the other stuff when you switch to map mode? Is there a way to keep them visible or am I remembering things incorrectly?\u003C/p\u003E\n"},{"CreatedByName":"jedensuscg","CreatedById":76475,"CreatedDateTime":"2013-12-21T05:20:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022notasurgeon\u0022 data-cite=\u0022notasurgeon\u0022\u003E\u003Cdiv\u003EThanks for the quick replies!\u003Cp\u003EDon\u0027t the GUIs from those mods hide themselves along with the other stuff when you switch to map mode? Is there a way to keep them visible or am I remembering things incorrectly?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMechjeb does not.\u003C/p\u003E\u003Cp\u003EPeople say Mechjeb is cheating. In career mode, you only start out unlocking the basic module (which is a few branches in) and that has no auto-pilot functions except minor ones like, you can have it point to your pro/retrograde, maneuver node, etc, but you still must manually burn and set up nodes. You can create custom windows that shows only data you want and it shows on both map and rocket view.\u003C/p\u003E\u003Cp\u003EIts useful to have a window that shows total delta-v, stage delta-v, delta-v left in time, apoapsis and periapsis and current alt all in one window you can have on the map screen.\u003C/p\u003E\n"},{"CreatedByName":"Jay7sun","CreatedById":97892,"CreatedDateTime":"2013-12-21T11:55:44Z","Content":"\n\u003Cp\u003EYou can click \u0027stage only\u0027 on the resources tab at the top right of the screen. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jananton","CreatedById":83920,"CreatedDateTime":"2013-12-21T15:40:57Z","Content":"\n\u003Cp\u003EI was going to mention that too, but there\u0027s one snag here as well. \u003C/p\u003E\u003Cp\u003EThis option seem to count all fuel between horizontal couplers only. So if one has a stage with a central fuel tank and engine and \u0027helper\u0027 tanks and engines attached with vertical couplers to this main one you still can\u0027t see when their fuel runs out and when to drop those \u0027helpers\u0027.\u003C/p\u003E\u003Cp\u003EGreets and seasonal best wishes,\u003C/p\u003E\u003Cp\u003EJan\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-12-21T16:26:08Z","Content":"\n\u003Cp\u003EThe fuel and electric gauges from SteamGauges (and everything else) are available in map mode. No stage fuel yet, though.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022www.kerbalspaceprogram.com/steamgauges\u0022 rel=\u0022external nofollow\u0022\u003EDownload\u003C/a\u003E\u003C/p\u003E\n"}]}