{"TopicId":57159,"ForumId":24,"TopicTitle":"Xander Shadow, the kerbal killer!","CreatedByName":"XanderShadow","CreatedById":97887,"CreatedDateTime":"2013-12-21T11:07:29Z","PageNum":1,"Articles":[{"CreatedByName":"XanderShadow","CreatedById":97887,"CreatedDateTime":"2013-12-21T11:07:29Z","Content":"\n\u003Cp\u003EGreetings one and all!\u003C/p\u003E\u003Cp\u003EAfter a few nudges from folks, and some recent events I was informed about ON here; decided to finally make a forum account!\u003C/p\u003E\u003Cp\u003EA few of you will know me from \u003Ca href=\u0022http://www.twitch.tv/xandershadow\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/xandershadow\u003C/a\u003E where I\u0027ve held KSP and other game streams on occasion (Being plugged by Spootyman: biggest win ever)\u003C/p\u003E\u003Cp\u003EI haven\u0027t streamed in a while due to some personal issues, including the recent death of a man who was like a father to me. BUT!; I will be resuming streams soon!\u003C/p\u003E\u003Cp\u003EMy current followers know me for... well, let\u0027s just say I don\u0027t bring many kerbals back alive when I play KSP!\u003C/p\u003E\u003Cp\u003EI tend to build contraptions and crafts no sane mind could envision; including my ever famous EKMP (Eight Kerbal Missile Platform) which fires pilotable missiles.\u003C/p\u003E\u003Cp\u003EI\u0027m also looking into streaming other games, like DayZ Standalone Survival Guides and Loot Spots, as well as Battlefield 4 (Because my few fans love seeing me smeg up royally! you know who you are!)\u003C/p\u003E\u003Cp\u003EOn a different note: I was recently informed that some people were worried a person called Xander on here (Not been supplied a account name) was me, and has apparently been stirring up quite a lot of annoyance from some of you.\u003C/p\u003E\u003Cp\u003ESo, I just want you guys and gals to know:\u003C/p\u003E\u003Cp\u003EIf it isn\u0027t XanderShadow; it isn\u0027t me!\u003C/p\u003E\u003Cp\u003EThis is my ONLY KSP Forum account, and the official one now!\u003C/p\u003E\u003Cp\u003EXander Shadow, the Kerbal killing Bunny\u003C/p\u003E\u003Cp\u003ESigning out!\u003C/p\u003E\n"},{"CreatedByName":"Darndello","CreatedById":58137,"CreatedDateTime":"2013-12-21T13:30:53Z","Content":"\n\u003Cp\u003EWell... I guess it\u0027s not my duty, but \u003Cspan style=\u0022font-size:10px;\u0022\u003EWelcome to the forums! \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-21T13:31:29Z\u0022 title=\u002212/21/2013 01:31  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 21, 2013\u003C/time\u003E by Darndello\u003C/strong\u003E\n\u003Cbr\u003EForgot smile face :D\n\u003C/span\u003E\n"}]}