{"TopicId":57362,"ForumId":55,"TopicTitle":"A thought on performance related to space stations","CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2013-12-22T21:40:33Z","PageNum":1,"Articles":[{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2013-12-22T21:40:33Z","Content":"\n\u003Cp\u003EI got to thinking something about space stations and game performance. It seems that when I connect more than 4 ships together to form a station the framerate starts dropping like a rock. I even set the physics delta to .03 to maintain it. I wanted to think about why this happens and I think I know (though I don\u0027t know what the inner workings of KSP is like).\u003C/p\u003E\u003Cp\u003EIf each ship is structured as a tree then the docking ports allow multiple trees to be connected together. The collision component is calculating whether a collision happens for each tree. The thing I want to suggest is this:\u003C/p\u003E\u003Cp\u003EIf multiple trees are connected the game only needs to calculate collisions and structural physics once for the whole interconnected tree choosing only one \u0022root\u0022 of one of the space ships as the calculation root. I believe now it calculates the collisions for each tree root in the connected system. This results in redundant collision measurements and cuts into the framerate, dividing it by each connected ship in the system, of course depending on the size of the ship part wise.\u003C/p\u003E\u003Cp\u003EI need to test if this is true by connecting together several ships with the same design to see if the framerate divides by the number of ships connected.\u003C/p\u003E\u003Cp\u003EIt\u0027s something worth taking a look at for optimizing large space stations.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-12-22T23:55:41Z","Content":"\n\u003Cp\u003EI\u0027m no dev, but to the best of my knowledge... upon docking, the ship trees are completely merged, with only a few extra values being stored (e.g., name of the docked craft, etc.). No information about the previous tree root is kept, to my knowledge, which can be checked by looking at the data tree in a persistence file that contains a docked ship. It\u0027s not connecting trees, it\u0027s \u003Cem\u003Emerging\u003C/em\u003E them, and then breaking off a branch again when undocking. That\u0027s how I understand it whenever Harv went through and explained how it went, anyway.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-12-23T13:16:01Z","Content":"\n\u003Cp\u003EPerformance drops on stations because they have so many parts. Each part adds to the physics load on the CPU.\u003C/p\u003E\n"}]}