{"TopicId":57508,"ForumId":55,"TopicTitle":"Career mode - my impressions","CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-23T20:07:35Z","PageNum":1,"Articles":[{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-23T20:07:35Z","Content":"\n\u003Cp\u003EOn Year 1, Day 26, 6h, 46m, 20s according to Tracking Station, i.e. in about 79 Kerbin days my Career mode finished by uncovering the last node from the tech tree. I was not trying to make any records, the only thing I was trying for was to have it easy. So it involved a bunch of suborbital flights on Kerbin, some 14 missions to Mun (one per biome) and 4 missions to Minmus - all crewed return missions, one of them a rescue mission, no transmissions. I did not have to leave Kerbin SOI to top up the tech tree. Most of the flying was done with one and the same ship which I was able to put together relatively early in the game, its most sophisticated parts were Skipper engines and drogue chute. Later on I replaced unreliable solar power by reliable nuclear generators, that was about the only change I did to that ship.\u003C/p\u003E\u003Cp\u003EI guess that ship would be able to safely visit Duna but it was not necessary to go that far.\u003C/p\u003E\u003Cp\u003EWhile I did enjoy playing the Career mode, I found it quite unchallenging and repetitive. Maybe it was the way I played it because running 16 identical missions to Mun/Minmus - with only difference being the landing spot - is definitely not the only possible way to \u0022win\u0022 the Career mode. But it\u0027s the easy one.\u003C/p\u003E\u003Cp\u003EI am definitely looking forward what the dev team will come up with in next release. I hope it will be something that will get me to visit some more distant places before I could declare the Career finished.\u003C/p\u003E\u003Cp\u003EWhatever will the final Career mode look like, it should put more goals ahead of the player. Science Archives are a nice feature, but they\u0027re more of a list of accomplishments than list of goals to try for. So the only \u0022progress bar\u0022 in the Career mode - at least in my opinion - is still just the tech tree.\u003C/p\u003E\n"},{"CreatedByName":"ravener","CreatedById":44766,"CreatedDateTime":"2013-12-23T20:51:59Z","Content":"\n\u003Cp\u003Ei had some of the same experiences, the 0.23 update actually made it slightly worse since i felt obliged to return all my missions. the science lab is at the moment not helping this feeling of repetition as it is 1. almost useless and 2. another step to preform.\u003C/p\u003E\u003Cp\u003Ethe problem is that returning a craft to kerbin from minimus is less labour intensive from the players perspective than docking to a station, and that is with a disgraceful 10% science boost. \u003C/p\u003E\u003Cp\u003Eas for the future of career; i hope the addition of money and missions will add diversity. in the end resources are going to help too, but that seems further down the line than we anticipated.\u003C/p\u003E\n"}]}