{"TopicId":57529,"ForumId":44,"TopicTitle":"Lift vs Weight tradeoff on Skylon-style spaceplane?","CreatedByName":"Exosphere","CreatedById":98328,"CreatedDateTime":"2013-12-23T23:17:03Z","PageNum":1,"Articles":[{"CreatedByName":"Exosphere","CreatedById":98328,"CreatedDateTime":"2013-12-23T23:17:03Z","Content":"\n\u003Cp\u003EOne of the advantages of a spaceplane over a rocket is that the wings provide some lift, reducing the delta-v required to achieve orbit. The disadvantage, however, is that the wings serve as dead weight in space. Is there any way to determine whether or not the life benefit outweighs the weight detriment, assuming the spaceplane is only going to go to LEO? It seems like spaceplanes aren\u0027t as good at transferring cargo to space, but could they do better than a rocket (in terms of fuel consumption) in shuttling astronauts to the ISS?\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2013-12-24T01:16:17Z","Content":"\n\u003Cp\u003EReaction Engines claim that the payload fraction of the Skylon ought to be better than for any other launch solution that can carry a similar payload mass. However, there are many factors influencing this - wings, ultra-lightweight construction and engines that are ultra-efficient at low altitude. The wings alone won\u0027t do it, it\u0027s the whole package!\u003C/p\u003E\u003Cp\u003E(Of course, this assumes that their calculations are matched by reality: until an engine has been built, tested and perfected it\u0027s silly to build too much on claims made for it, still less any craft it is built into!)\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-24T02:26:39Z","Content":"\n\u003Cp\u003ELift \u003Cem\u003Edoes not\u003C/em\u003E reduce delta-V requirement. Ever. In fact, it\u0027s guaranteed to increase delta-V requirement.\u003C/p\u003E\u003Cp\u003EYou can engineer a space-plane where the increased delta-V cost is minimal, and TWR requirements are reduced, which can let you get to orbit with a smaller, lighter engine. That can give you net savings in fuel, but because of a lighter orbiter. Not because of smaller delta-V.\u003C/p\u003E\n"},{"CreatedByName":"Horn Brain","CreatedById":49626,"CreatedDateTime":"2013-12-24T02:56:59Z","Content":"\n\u003Cp\u003EIs this independent of gravity on a planet? Imagine a world with 10g surface gravity but a thick enough atmosphere that flight is still possible. Is the dV always guaranteed to be higher for a lifting vehicle than for a vertical launch system? I suppose it eventually comes down to an energy balance, so maybe the effects cancel.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-24T02:59:48Z","Content":"\n\u003Cp\u003EWell, to compare the Space Shuttle and Skylon in terms of fuel requirements, let\u0027s see which one uses more (they both use the same fuel, and both are going to be used for the same purpose as far as I know, so this should make the comparison quite valid.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESkylon\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ELoaded weight: 345,000 kg (760,000 lb)\u003C/p\u003E\u003Cp\u003E-Payload: 15,000 kg (33,000 lb)\u003C/p\u003E\u003Cp\u003E-Empty weight: 53,000 kg (120,000 lb)\u003C/p\u003E\u003Cp\u003E--------------------------------------------\u003C/p\u003E\u003Cp\u003EFuel: 277,000 kg (assuming no other mass needs subtracted)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EShuttle\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EGross Liftoff Weight [External Tank]: 1,680,000 lb (760,000 kg)\u003C/p\u003E\u003Cp\u003E-Empty Weight [External Tank]: 58,500 lb (26,500 kg)\u003C/p\u003E\u003Cp\u003E--------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003EFuel: 733,500 kg (assuming no other mass needs subtracted)\u003C/p\u003E\u003Cp\u003EI didn\u0027t even do the math for the SRBs, and you can already see how much more cost efficient Skylon is. It should also be noted here that since Skylon\u0027s fuel is all internal, it is therefore theoretically possible (assuming this isn\u0027t planned as normal functioning) to do a powered landing, instead of having to glide it in, which gives the advantage of being more flexible with where you land without worrying about running out of lift.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-12-24T03:23:25Z","Content":"\n\u003Cp\u003Eeverything that would make skylon awesome comes from the engine design. but its not something you want to put on its end and launch like a rocket. that would underutilize the rather heavy hardware that makes air breathing possible. you need to get skylon into the sweet spot of the atmosphere that gives you optimal performance from the engine and fly straight and level until you cant accelerate any more in air breathing mode. you cant really fly a rocket horizontally through the atmosphere like this, because of the rapidly changing center of mass (in relation to center of drag) which would lead to a rather uncontrollable flight. there are ways around it, drain the tanks from both ends and feed center mounted engines (like skylon does). so you have a rocket with side mounted engines, how do you hold level flight? well you point the thrust down a little to maintain altitude. but then you aren\u0027t using that thrust to accelerate. wings let you use all the thrust to accelerate at expense of a little bit more drag (and this isnt as bad as it seems since drag works funny in hypersonic regimes). so what you get out of all this is skylon.\u003C/p\u003E\n"},{"CreatedByName":"Exosphere","CreatedById":98328,"CreatedDateTime":"2013-12-24T04:06:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003ELift \u003Cem\u003Edoes not\u003C/em\u003E reduce delta-V requirement. Ever. In fact, it\u0027s guaranteed to increase delta-V requirement.\u003Cp\u003EYou can engineer a space-plane where the increased delta-V cost is minimal, and TWR requirements are reduced, which can let you get to orbit with a smaller, lighter engine. That can give you net savings in fuel, but because of a lighter orbiter. Not because of smaller delta-V.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoesn\u0027t the lift provide *some* advantage to getting into orbit using a lower amount of fuel? I remember hearing something to that effect, but I don\u0027t know if it\u0027s true (which is why I\u0027m asking).\u003C/p\u003E\u003Cp\u003EAlso, as far as drag, if the wings are relatively small (such as the on the Skylon), used a high-speed design (delta or trapezoidal wing), and were light weight (to minimize the negative effect on the craft\u0027s fuel fraction) would the negative effects caused by the drag, extra weight, and slightly decreased fuel fraction be offset by the positive effect of the lift the wings created (if there is a positive effect)? If so, would smaller or larger wings be optimal?\u003C/p\u003E\u003Cp\u003EBTW, I\u0027m not a Skylon/spaceplane/SSTO fanboy. I\u0027m just using the Skylon because it was the first example I could think of.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-12-24T08:13:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exosphere\u0022 data-cite=\u0022Exosphere\u0022\u003E\u003Cdiv\u003EDoesn\u0027t the lift provide *some* advantage to getting into orbit using a lower amount of fuel? I remember hearing something to that effect, but I don\u0027t know if it\u0027s true (which is why I\u0027m asking).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo it doesn\u0027t. Getting to orbit is about getting from 0 to 26000km/h. That\u0027s all there is to it. Wings don\u0027t make you go faster. They actually slow you down.\u003C/p\u003E\u003Cp\u003EHowever, your biggest obstacle when trying to reach orbital speed is the atmosphere. So really only have two options:\u003C/p\u003E\u003Cp\u003E- Get as high as you can to minimize drag. This is the conventional rocket approach.\u003C/p\u003E\u003Cp\u003E- Use the atmosphere to provide oxygen with the hope that you will save weight by carrying less of it for the final acceleration. This is the SSTO space plane approach, which has never been done.\u003C/p\u003E\u003Cp\u003EThe latter is of course much more complex. It doesn\u0027t only require a magical engine that can work through all flight regimes, with and without ambient oxygen. The best we have done is 0 to Mach 3 or Mach 1 to Mach 6. What you need is an engine that can go from 0 to Mach 20, which is something that we don\u0027t have (yet). BEcause you want to end up in space, you are always going to need to carry some oxydizer with you anyway, and because you are taking a slower route, therefore burning for a longer period, you are going to need more fuel.\u003C/p\u003E\u003Cp\u003EIt also requires and airframe that can fly subsonic, transonic, and hypersonic regimes. Again, this is hugely complex. It pretty much can\u0027t be done without variable geometry, which carries a huge mass penalty. And once you get to Mach 6, you start to need a really serious heat shield, either tiles or ablative, which also carries a mass penalty.\u003C/p\u003E\u003Cp\u003EDo all these mass penalties compensate for the mass saving of carrying less oxydizer? Is the extra complexity worth the reliability hit ? It\u0027s hard to say, as it has never been done.\u003C/p\u003E\u003Cp\u003ESo yes, 4 blokes in a shed in Britain think they have cracked all these problems with their revolutionary design. It might be true, but let\u0027s not forget that an SSTO spaceplane is the holy grail that aerospace engineers all over the world have been seeking for 50 years. I don\u0027t think the folks at NASA, USAF, Boeing, Lockheed Martin, etc are stupid. Nobody has even been able to make an object fly from 0 to Mach 4 on its own power and land safely, let alone 0 to Mach 20.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-24T08:18:55Z\u0022 title=\u002212/24/2013 08:18  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 24, 2013\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-12-24T08:22:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exosphere\u0022 data-cite=\u0022Exosphere\u0022\u003E\u003Cdiv\u003EDoesn\u0027t the lift provide *some* advantage to getting into orbit using a lower amount of fuel? I remember hearing something to that effect, but I don\u0027t know if it\u0027s true (which is why I\u0027m asking).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo it doesn\u0027t. Getting to orbit is about getting from 0 to 26000km/h. That\u0027s all there is to it. Wings don\u0027t make you go faster. They actually slow you down.\u003C/p\u003E\u003Cp\u003EAcceleration requires energy. The only way we know to generate enough thrust to provide that kind of acceleration is to burn fuel with an oxydizer.\u003C/p\u003E\u003Cp\u003EHowever, your biggest obstacle when trying to reach orbital speed is the atmosphere. So really only have two options:\u003C/p\u003E\u003Cp\u003E- Get as high as you can to minimize drag. This is the conventional rocket approach.\u003C/p\u003E\u003Cp\u003E- Use the atmosphere to provide free oxydizer with the hope that you will save weight by carrying less of it for the final acceleration. This is the SSTO space plane approach, which has never been done.\u003C/p\u003E\u003Cp\u003EThe latter is of course much more complex. It doesn\u0027t only require a magical engine that can work through all flight regimes, with and without ambient oxygen. The best we have done is 0 to Mach 3 or Mach 1 to Mach 6. What you need is an engine that can go from 0 to Mach 20, which is something that we don\u0027t have (yet).\u003C/p\u003E\u003Cp\u003EIt also requires and airframe that can fly subsonic, transonic, and hypersonic regimes. Again, this is hugely complex. It pretty much can\u0027t be done without variable geometry, which carries a huge mass penalty. And once you get above Mach 6, you start to need a really serious heat shield, either tiles or ablative, which also carries a mass penalty. So this magical airframe is also technology that we don\u0027t have (yet).\u003C/p\u003E\u003Cp\u003ESo yes, 4 blokes in a shed in Britain think they have cracked all these problems with their revolutionary design. It might be true, but let\u0027s not forget that an SSTO spaceplane is the holy grail that aerospace engineers all over the world have been seeking for 50 years. I don\u0027t think the folks at NASA, USAF, Boeing, Lockheed Martin, etc are stupid. Nobody has even been able to make an object fly from 0 to Mach 4 on its own power and land safely, let alone 0 to Mach 20.\u003C/p\u003E\n"},{"CreatedByName":"Exosphere","CreatedById":98328,"CreatedDateTime":"2013-12-24T08:36:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ENo it doesn\u0027t. Getting to orbit is about getting from 0 to 26000km/h. That\u0027s all there is to it. Wings don\u0027t make you go faster. They actually slow you down.\u003Cp\u003EAcceleration requires energy. The only way we know to generate enough thrust to provide that kind of acceleration is to burn fuel with an oxydizer.\u003C/p\u003E\u003Cp\u003EHowever, your biggest obstacle when trying to reach orbital speed is the atmosphere. So really only have two options:\u003C/p\u003E\u003Cp\u003E- Get as high as you can to minimize drag. This is the conventional rocket approach.\u003C/p\u003E\u003Cp\u003E- Use the atmosphere to provide free oxydizer with the hope that you will save weight by carrying less of it for the final acceleration. This is the SSTO space plane approach, which has never been done.\u003C/p\u003E\u003Cp\u003EThe latter is of course much more complex. It doesn\u0027t only require a magical engine that can work through all flight regimes, with and without ambient oxygen. The best we have done is 0 to Mach 3 or Mach 1 to Mach 6. What you need is an engine that can go from 0 to Mach 20, which is something that we don\u0027t have (yet).\u003C/p\u003E\u003Cp\u003EIt also requires and airframe that can fly subsonic, transonic, and hypersonic regimes. Again, this is hugely complex. It pretty much can\u0027t be done without variable geometry, which carries a huge mass penalty. And once you get above Mach 6, you start to need a really serious heat shield, either tiles or ablative, which also carries a mass penalty. So this magical airframe is also technology that we don\u0027t have (yet).\u003C/p\u003E\u003Cp\u003ESo yes, 4 blokes in a shed in Britain think they have cracked all these problems with their revolutionary design. It might be true, but let\u0027s not forget that an SSTO spaceplane is the holy grail that aerospace engineers all over the world have been seeking for 50 years. I don\u0027t think the folks at NASA, USAF, Boeing, Lockheed Martin, etc are stupid. Nobody has even been able to make an object fly from 0 to Mach 4 on its own power and land safely, let alone 0 to Mach 20.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, in that case, the wings are there simply to allow the craft to accelerate horizontally, and their only purpose is to allow the SSTO to use air breathing engines effectively? In other words, their only direct contribution to the spaceplane design is extra weight and drag?\u003C/p\u003E\u003Cp\u003EAssuming the wings contained fuel (as is the case in modern airliners), wouldn\u0027t the extra weight be relatively small (as the fuel and wing weight would already have to be carried even in a VTO rocket, just in the form of a rocket body and an internal fuel tank)? Also, if the wings were small enough, the extra drag would seem to be relatively small (disclaimer: I am not an aerospace engineer, I have no hard evidence backing up that idea, and all of this is simply speculation). In that case, wouldn\u0027t the fuel saved through the use of a higher-isp engine be greater than the fuel lost using a HTO SSTO design vs a VTO rocket?\u003C/p\u003E\u003Cp\u003EOf course, for any of this to even be considered, we\u0027d have to develop an engine capable of functioning from a standstill to orbital velocities which, like you said, isn\u0027t exactly easy, and hasn\u0027t been done before.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-12-25T04:30:13Z","Content":"\n\u003Cp\u003Eany fully reusable system would bring down the costs. problem with vtvl is the possibility of gliding it in goes out the window. a chute to land an entire vtvl ssto (a large vehicle) would be impractical (perhaps a drogue chute in combination with a little bit of landing fuel would work). powered landing seems like the only way to go in that case, something like the dc-x. the problems with that system, the need for an engine nozzle that can operate efficiently at all altitudes and speeds, are mostly solved. we just need to build one. any reusable ssto would be a game changer. the spacex way of doing things is a step in the right direction.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-25T04:32:17Z\u0022 title=\u002212/25/2013 04:32  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 25, 2013\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-12-25T19:10:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exosphere\u0022 data-cite=\u0022Exosphere\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAssuming the wings contained fuel (as is the case in modern airliners), wouldn\u0027t the extra weight be relatively small (as the fuel and wing weight would already have to be carried even in a VTO rocket, just in the form of a rocket body and an internal fuel tank)? \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is that wings contribute more mass than the simple tankage envelope. You need control surfaces, which require hydraulics, which require pressurization systems, actuators, piping, etc... Horizontal takeoff and landing requires a landing gear, which is also heavy. The increased surface requires a much heavier thermal protection than the relatively small circular heatshield of a capsule.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso, if the wings were small enough, the extra drag would seem to be relatively small (disclaimer: I am not an aerospace engineer, I have no hard evidence backing up that idea, and all of this is simply speculation). In that case, wouldn\u0027t the fuel saved through the use of a higher-isp engine be greater than the fuel lost using a HTO SSTO design vs a VTO rocket?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESmall wings (or a lifting body) designed for hypersonic flight do not provide a substantial lift at subsonic speed. And wings that are efficient at subsonic speeds would be ripped off at hypersonic speed.\u003C/p\u003E\u003Cp\u003ELifting bodies, like the HL20, DreamChaser, or the good old Space Shuttle, are actually crappy gliders. Although the Shuttle was often depicted as \u0022landing like a plane\u0022, the descent ratio at landing was really hairy... They also aren\u0027t designed for lift during acceleration. Their lift/drag ratio is designed to slow down the vehicle during reentry.\u003C/p\u003E\u003Cp\u003EI don\u0027t believe strongly in horizontal operation for an SSTO. The problems with dealing with all the flight regimes and spending time accelerating in the atmosphere are simply too complex. I think that if you want to go to space, you want to spend as little time in the atmospheric soup as possible. Vertical takeoff and propulsive landing seem to be the easiest and more reliable methods, like SpaceX or the old DC-X.\u003C/p\u003E\n"}]}