{"TopicId":57654,"ForumId":51,"TopicTitle":"My Epic Ion Probe Journey- Project Hades","CreatedByName":"Monty_Droppings","CreatedById":98204,"CreatedDateTime":"2013-12-25T01:50:22Z","PageNum":1,"Articles":[{"CreatedByName":"Monty_Droppings","CreatedById":98204,"CreatedDateTime":"2013-12-25T01:50:22Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/5yd3c\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI just completed a mission that took 16 hours in real time, and that is despite the fact I timewarped nearly every single burn (Dem ions....)\u003C/p\u003E\u003Cp\u003EKerbin-Dres-Pol-Bop-Minimus-Kerbin again.\u003C/p\u003E\u003Cp\u003EIons were used the whole time, to land and take off from every object except for the lifter stage and the Dres landing/takeoff (Ions cannot even lift themselves on Dres) \u003C/p\u003E\u003Cp\u003EThat was the most rewarding thing I have ever done, and is probably a cakewalk for most of the people in the community but this was a big moment for me. \u003C/p\u003E\u003Cp\u003EThe mission was a failure, as the craft was designed to Land on Dres, then land on the 4 \u0022Ionic\u0022 objects, the 4 places where ions can lift themselves: Minimus, Bop, Pol, and Gilly. After i Landed on Bop i decided i didnt have enough fuel to go to Gilly, so i had to settle for landing quickly at minimus before heading back to kerbin. \u003C/p\u003E\u003Cp\u003ESo Meh. Time to do it over again so i can get to gilly this time.\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2013-12-26T02:27:13Z","Content":"\n\u003Cp\u003EAwesome mission. Hitting up all those planetary bodies in a single launch is impressive, regardless of the Gilly situation. I think Dres is underestimated in general, it burns a lot more dv than it looks like it should.\u003C/p\u003E\n"},{"CreatedByName":"irongut","CreatedById":97315,"CreatedDateTime":"2013-12-27T23:12:24Z","Content":"\n\u003Cp\u003ENice mission. I really like the design of your probe with the solar panels on the arms. What is on the ends, fuel tanks?\u003C/p\u003E\u003Cp\u003EI haven\u0027t tried ion engines yet but after reading this I\u0027ll have to try them soon.\u003C/p\u003E\n"},{"CreatedByName":"Monty_Droppings","CreatedById":98204,"CreatedDateTime":"2013-12-29T02:28:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022irongut\u0022 data-cite=\u0022irongut\u0022\u003E\u003Cdiv\u003ENice mission. I really like the design of your probe with the solar panels on the arms. What is on the ends, fuel tanks?\u003Cp\u003EI haven\u0027t tried ion engines yet but after reading this I\u0027ll have to try them soon.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a set of L100 fuel tanks with \u0022ant\u0022 liquid engines, this is what allows you to land on stuff ions cant. Once the stage is dropped, there are still additional xenon tanks, once those get to 25%, i transfer everything to the center tank and drop the radial xenons. \u003C/p\u003E\u003Cp\u003EI like this design as it allows me to land on a \u0022heavy object\u0022 (that ions normally cant), then i can land on several of the \u0022ionic\u0022 bodies before returning to kerbin.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-12-29T02:36:18Z","Content":"\n\u003Cp\u003ESorry to be that guy, but... *Minmus. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhere did you find the patience to do a mission like that?\u003C/p\u003E\n"}]}