{"TopicId":57767,"ForumId":55,"TopicTitle":"Scale in VAB/SPH","CreatedByName":"MircoMars","CreatedById":61811,"CreatedDateTime":"2013-12-26T10:26:44Z","PageNum":1,"Articles":[{"CreatedByName":"MircoMars","CreatedById":61811,"CreatedDateTime":"2013-12-26T10:26:44Z","Content":"\n\u003Cp\u003EHi there,\u003C/p\u003E\u003Cp\u003EI follow the discussion about MechJeb/KerbalEngineer thrust-calculators and whether or not they should be implemented in stock. In the latest Interview HarvesteR stated, that he doesn\u0027t want a dV-bar inflight and I\u0027m totally with him on that. However, I think one thing would be really helpful for novice and advanced players: a scale in VAB \u0026amp; SPH. \u003C/p\u003E\u003Cp\u003EJust give us the total weight of the craft while building it. Not even thrust or dryweight, just a scale how heavy everything attached to the rootpart right now is. I\u0027d even take it with a resolution of 0.1 or as a exponential graphic indicator like the radaraltimeter and the climbrate. Heck, I\u0027d even take it as a pop-up on request! \u003C/p\u003E\u003Cp\u003EI\u0027m really annoyed by calculating pointzeroonesevenfives together, having to look up everything in the partmenues and recalculate everything when changing things. I also waste a lot of paper doing that! Think of the environment, man, won\u0027t somebody please think of the children!! \u003C/p\u003E\u003Cp\u003Eokay, I better leave now...\u003C/p\u003E\u003Cp\u003Emy point still stands, please add a scale, thank you.\u003C/p\u003E\n"},{"CreatedByName":"ravener","CreatedById":44766,"CreatedDateTime":"2013-12-26T11:36:56Z","Content":"\n\u003Cp\u003EI, on the other hand DO want a deltaV meter. Maybe we could have all our stats in a collapsible sidebar or something of that nature.\u003C/p\u003E\n"},{"CreatedByName":"Murph","CreatedById":90837,"CreatedDateTime":"2013-12-26T11:49:28Z","Content":"\n\u003Cp\u003EI\u0027ve a feeling that this is \u0022what not to suggest\u0022, but not so much because it\u0027s never going to be done, just because it\u0027s a common suggestion that will be addressed eventually. We certainly do need something in the long term. In the short term, Engineer or MechJeb do the job nicely.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-12-26T12:20:44Z","Content":"\n\u003Cp\u003EAye, showing craft parameters is definitely on the [thread=36863]What Not to Suggest List[/thread]... and Murph\u0027s right -- it\u0027s there because every tenth person to come here posts something like that. Well, not \u003Cem\u003Equite\u003C/em\u003E that many, but you get the picture. We see it three times a week more often than not. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs such, I\u0027ll be locking this one. Be patient, eh? We\u0027ll see what happens. I think something like this will have to come with Career mode and figuring out costs and such.\u003C/p\u003E\n"}]}