{"TopicId":57855,"ForumId":51,"TopicTitle":"The Centipede Mission","CreatedByName":"Kieve","CreatedById":98713,"CreatedDateTime":"2013-12-27T04:17:31Z","PageNum":1,"Articles":[{"CreatedByName":"Kieve","CreatedById":98713,"CreatedDateTime":"2013-12-27T04:17:31Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003EI literally joined the KSP forums to share this. It is a tale of failure and frustration, of triumph over impossible odds (and flawed engineering), and the brave but masterfully inept Kerbals who pulled it off anyway.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CentipedeBanner.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022100\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/CentipedeBanner.jpg~original\u0022 width=\u0022700\u0022\u003E\u003C/p\u003E\n\u003Chr\u003E\u003Cp\u003E\nBehold, the Centipede...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-26_00004.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-26_00004.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWeighing in at 17.16 tons, it was designed to conquer any terrain the Mun could offer up. A compliment to the newly-landed Arc Luna Outpost, it would function as a mobile command center, taking Kerbals far across the Mun in their search for more Science - without popping too many tires on the way. Perhaps sensing imminent failure, Command assigned five of the absolute \u003Cem\u003Edumbest\u003C/em\u003E Kerbals to it (and two of the smartest but most cowardly to man the science lab). Then in true Kerbal fashion, they strapped a bunch of rockets to its bumper and prepared to launch it into space. Fortunately, they\u0027d sent up a half-dozen similar rockets under various Orbital Hauler missions and knew the OH lifter was up for the job. Then Burhat Kerman had to open his blasted mouth.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022How are you going to land it?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe engineers promptly turned a much darker shade of green and proposed the usual solution - \u003Cem\u003Estrap more rockets to it, of course!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThus a set of wing-like lander cells were added to the Centipede\u0027s flanks, powered by a pair of LV-909\u0027s with two Rockomax 24-77\u0027s riding sidecar to balance Thrust between Center Of Mass. The engineers nodded their heads, pleased with their work, and certain the lander cells would do just fine. Their calculations assured everyone, on Mun the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E was plenty high enough to ensure a safe landing!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-26_00001.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-26_00001.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESo in went the Kerbals, and off went the rocket! Munward-ho!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nImmediately, it became apparent something was wrong. The added weight of the Centipede\u0027s monstrous wheel assembly was dragging the craft down, throwing the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E badly out of alignment. This became even more noticeable as the latter stages dropped off. So the engineers went back to work, doing what they did best - \u003Cem\u003Emore rockets!\u003C/em\u003E Two more 24-77\u0027s tipped the scales, keeping the Centipede finely balanced down to the last stage.\n\u003C/p\u003E\n\u003Cp\u003E\nMostly.\n\u003C/p\u003E\n\u003Cp\u003E\nThe trip to the Mun was a short eight-hour drift through the black, and Jeb threw them a greeting as the Centipede\u0027s crew swung into alignment behind the Mun Orbiter station. He had been exiled to the Orbiter after constantly jumping into the cockpit of anything that went towards the pad (Command finally had enough and let him go, in one mission they were quite sure would be staying put). As the Centipede prepared to de-orbit and aligned itself with Arc Luna, several things became immediately evident:\n\u003C/p\u003E\n\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E\nThere was not enough fuel left in the final stage to drop the Centipede to a halt as planned. At low pass above Arc Luna, it would bleed off half the Delta-V they needed to stop. At \u003Cem\u003Ebest\u003C/em\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nThe engineers had misaligned the lander cells. The craft had a nasty yaw to the right, which became insurmountable above half-power.\n\u003C/li\u003E\n\u003Cli\u003E\nYou couldn\u0027t align \u003Cem\u003Eanything\u003C/em\u003E with the damned gimbal! The Centipede might be pointing forward, but the lander cells faced downards (and not even \u003Cem\u003Estraight\u003C/em\u003E downards). Burning retrograde had to be done blind - if orbit speed was decreasing you were pointed the right way. Probably.\n\u003C/li\u003E\n\u003Cli\u003E\nClearly, Command wanted them all to die, because Burhat opened his blasted mouth.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nDespite the crews\u0027 assumption however, Command did \u003Cem\u003Enot\u003C/em\u003E want them to die. Possibly the engineers did, but fortunately it wasn\u0027t their choice. A mad scramble ensued, as everyone tried to find a way to get the Centipede down safely, without scattering it across the surface of Mun, or popping any of those expensive tires.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen Bartbles heard the answer, he raised an eyebrow. \u0022You\u0027re sure?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It\u0027s really the only way. You\u0027re one of the bravest Kerbals we know, Bart. We\u0027re sure you can pull it off.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBartbles Kerman puffed out his chest and gripped the controls. Retrograde was already lined up and his burn was only a few minutes away.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom 45,000m above the Mun, he was going to stop them dead, and drop straight down.\n\u003C/p\u003E\n\u003Cp\u003E\nThe mission profile had indicated a slower parabolic descent that put them right over Arc Luna. However, every pass the Centipede had made, it picked up enormous amounts of Delta-V flying so low to the surface. The final rocket stage simply didn\u0027t have enough fuel left to bring them in safely, and it was bloody impossible to use the landing cells at the power needed to halt that kind of velocity. Every simulation \u003Cspan style=\u0022font-size:8px;\u0022\u003E(read: \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Equicksave reload\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E)\u003C/span\u003E resulted in fireballs and scattered debris being bounced back into space. Even the plentiful \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E supply wasn\u0027t going to make a dent in anything but the surface. But at lower speeds...\n\u003C/p\u003E\n\u003Cp\u003E\nThinking was not Bart\u0027s strong suit, so he tended not to do much of it. What Command told him made enough sense, and he \u003Cem\u003Ewas\u003C/em\u003E one of the most courageous pilots to leave Kerbin. The engines flared up, bringing orbital speed down from 500m/s to just under 200 before the tanks went dry. With a shrug, Bart cut them loose and engaged the landing cells. Sudden groans and the sound of retching filled the rear cabins as he swung the Centipede\u0027s nose down, pointing the cells retro as best as he could judge. Orbital velocity dropped even more, and slowly the altimeter counted down. 40 kilometers... 35... 30... 25. As the dials spun down, he began to believe this might actually work. It was a constant fight to keep the craft\u0027s landers aimed retro, and despite his best efforts their speed was still above 100m/s, but it \u003Cem\u003Ewas\u003C/em\u003E slowing, and the engines still had fuel and \u003Cem\u003Eoh \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKer\u003C/abbr\u003E I hope we don\u0027t all die!\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n10,000 meters. They were still dropping too fast, but speed was below 100m/s now. He kicked the engines up a little higher and the craft lurched right, yawing slowly. Pitch up, pitch down, roll left, \u003Cem\u003Eovercompensating! Oh crud!\u003C/em\u003E Haul the nose back to the left. Rinse, repeat. He didn\u0027t even want to know what the back cabins must look like, though at least he couldn\u0027t hear the rest of the crew vomiting now. Some rinsing and repeating would be needed there as well, he was sure.\n\u003C/p\u003E\n\u003Cp\u003E\n5,000 meters. Fuel was starting to dwindle and \u003Cem\u003Estill\u003C/em\u003E they were coming in too hot. He\u0027d lost the sweet spot, the craft was drifting all over now, and he couldn\u0027t crank the engines up any more or the yaw would become insurmountable. The Centipede\u0027s shadow danced around below them like... well, like something very drunk, Bart was much too occupied with not crashing to give it much thought right now. 4,000 meters.\n\u003C/p\u003E\n\u003Cp\u003E\nAround 3,000, Bart noticed the altimeter had stalled. Whatever speed he was fighting now was pure drift. He tried to see out the window but the Cupola module had crap visibility for landing, unless it was pointed straight down. More airsick moans welled up from the rear cabin as he pitched the Centipede down again. Ah, there it was. He realigned and killed the drifting. Under 20m/s now, and dropping smoothly.\n\u003C/p\u003E\n\u003Cp\u003E\nA hill rose up towards them as the craft resumed yawing. 6.5m/s. No fuel left. Their shadow was practically right under them...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWith a soft bump, the Centipede touched down. Not a single tire was popped that day.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-26_00003.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-26_00003.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBartbles Kerman let out a breath he hadn\u0027t realized he was holding. Apparently he\u0027d forgotten to do that \u003Cem\u003Ebreathing\u003C/em\u003E thing again. Now, where was Arc Luna?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-26_00006.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-26_00006.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAww, fish-paste!\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-05T04:07:05Z\u0022 title=\u002211/05/2017 04:07  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 5, 2017\u003C/time\u003E by Kieve\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2013-12-27T19:45:09Z","Content":"\n\u003Cp\u003ENow this is a magnificent first post.\u003C/p\u003E\u003Cp\u003ECongratulations, and welcome!\u003C/p\u003E\n"},{"CreatedByName":"Kieve","CreatedById":98713,"CreatedDateTime":"2013-12-28T04:00:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-cite=\u0022Commander Zoom\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-username=\u0022Commander Zoom\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nCommander Zoom said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv\u003E\nNow this is a magnificent first post.\n\u003Cp\u003E\nCongratulations, and welcome!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you for the kind words. It took me a bit to figure out the right place to post it.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now, to continue the journey...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe Centipede Mission: \u003C/span\u003E\u003C/strong\u003E\u003Cem\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ERoad-Trip\u003C/span\u003E\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDespite Bart\u0027s death-defying landing (or perhaps because of it), the rest of the Centipede\u0027s crew ousted him from the controls. For their long journey across the surface to Arc Luna, it was voted that Calger should take the controls. After all, he still had the top score on the \u003Cem\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKer\u003C/abbr\u003E-Kart\u003C/em\u003E arcade machine back home - for six weeks running, so far. Secretly, Calger suspected that was one of the reasons they\u0027d sent him off on this missions. No matter, he could fill up the leaderboards with \u0022CAL-OWNZ\u0022 when he got back. Maybe they\u0027d even have KK2 installed by then!\n\u003C/p\u003E\n\u003Cp\u003E\nAfter some token protest, Bartbles relented and Calger took the Centipede\u0027s wheels. He jettisoned the lander cells and set out across the barren surface.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-27_00003.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-27_00003.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt didn\u0027t take long for more of the Centipede\u0027s flaws to become apparent. Despite the ridiculous number of tires, it floated and skidded across Mun\u0027s terrain like a rhinoceros on roller-skates. In fact, the only thing the hefty wheel array was good for, apparently, was draining the batteries at an absurd rate. The paltry solar panels on top couldn\u0027t hope to compensate for the energy so many electric motors were sucking down. Not that he could open up the throttle anyway - 10m/s was about as fast as he dared go with the way the Centipede handled. Even the slightest bump tended to leave it floating above the surface. At 15m/s, he stood a good chance of hitting a rock or micro-crater and flipping it upside-down. So the Centipede crawled across the surface like the insect it was named after, and Calger did his best to let Mun\u0027s slight hills and valleys do most of the accelerating.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThis is going to take an eternity,\u003C/em\u003E he grumped. It didn\u0027t help that Mun\u0027s featureless gray terrain was mind-numbingly dull. Well, not entirely featureless. It did have craters after all. Little ones, shallow ones, steep ones, and vast - \u003Cem\u003EOH \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E THERE\u0027S ONE RIGHT IN FRONT OF US!\u003C/em\u003E He slammed on the brakes, skidding to a stop bare meters from the cliff-edge of a broad bowl, several kilometers wide.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-27_00004.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-27_00004.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-27_00006.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-27_00006.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFor a long moment, Calger just stared off the edge of the precipice, weighing his options.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, Bart piped up from the back, \u0022Why did we stop? Do you want me to drive?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nCalger called a group meeting. One by one, they piled out of the Centipede to take stock of the situation.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-27_00005.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-27_00005.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022So here are our choices,\u0022 Calger announced. \u0022We can cut across the crater and save an hour or two of travel, but it\u0027ll run our batteries down more trying to climb the incline on the far side. Or we can go around and conserve the batteries, but it\u0027ll take even longer to get to Arc Luna.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You think you can actually get us down that cliff in one piece?\u0022 Alvin demanded skeptically. \u0022That\u0027s a sheer drop at least twenty meters, plus whatever speed we pick up on the way down.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Can I just jet across?\u0022 Seanden asked. \u0022I\u0027m sick of riding in this can. And I have to pee.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Should\u0027ve thought of that before we left Kerbin,\u0022 Bart told him.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I did! That was ten hours ago!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nCalger banged his foot on the top of the Centipede\u0027s hatch to get their attention, but then remembered that sound wouldn\u0027t carry in the airless environment. \u0022Focus, crew. Across or around, raise your glove. Who votes across?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe final tally was three in favor of crossing, three in favor of skirting the crater\u0027s edge. The deciding vote was his. He looked past his assembled crew, at the crater\u0027s lip once more. He was sick of toeing the throttle and creeping over each hill and depression. Command had built the Centipede to tackle anything - if it couldn\u0027t handle a simple crater, there was no point in landing it here in the first place. \u0022Across it is then. Everyone back on board!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAlvin glared at Calger. \u0022You\u0027re going to make us explode. I don\u0027t want to explode, Cal.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Everyone explodes sooner or later, Alvin,\u0022 Bartbles stated matter-of-factly. \u0022Cal\u0027s as good a reason as any.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I don\u0027t think that\u0027s how the saying goes, Bart.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBart raised an eyebrow. \u0022Are you sure? That\u0027s how Jeb always tells it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Guys, just get \u003Cem\u003Ein\u003C/em\u003E,\u0022 Calger scolded.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce settled back in the driver\u0027s seat, Calger sized up the crater\u0027s edge once more. Despite the power drain, he decided to switch on the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, just in case the Centipede bounced too much, or too awkwardly. The wheels spun in the dust as they struggled for traction, and slowly the big rover crept out over the precipice. The nose pitched down, and in Cal\u0027s mind he could see the starting lights of \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKer\u003C/abbr\u003E-Kart cycling - red, yellow, \u003Cem\u003Egreen\u003C/em\u003E! The ground dropped out from under them, and the Centipede plunged down the crater\u0027s slope.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-27_00008.jpg\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-27_00008.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow \u003Cem\u003Ethis\u003C/em\u003E was driving! The Centipede accelerated, 10, 20, 30 meters a second, shooting down into the bowl like a wheeled avalanche. Calger fought to keep the wheels facing the ground - \u003Cem\u003Eon\u003C/em\u003E it was hopeless, as even the tiniest hump send the craft skimming, sometimes several meters above the ground. Suddenly he gulped, realizing that the impact tolerance for everything but the wheels was well below 10m/s - if anything but the tires themselves so much as touched the ground, this was all likely to end in spectacular, explosive failure. The tires bounced again, on the left side only, and the whole rover began a lazy barrel roll as it shot across the crater floor. This did not go unnoticed by the crew.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Are we upside down? I don\u0027t want to be upside down. We tend to explode more that way.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I knew I should\u0027ve jet-packed for this.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Cal! For \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKer\u003C/abbr\u003E\u0027s sake, pull in the solar panels! If you clip them we\u0027re \u003Cem\u003Escrewed!\u003C/em\u003E\u0022 Bart warned him frantically. Too late now - they would not be safely retracted before the Centipede was upside down. With determined effort, Calger hauled on the control stick and forced the rover to finish its roll, all twenty-four wheels touching down at once. The incline of the crater\u0027s opposite edge loomed up at him. Dimly, he wondered what would happen if it launched them back up above the surface. The Centipede had no \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to slow it, and they\u0027d dumped the empty lander cells long ago.\n\u003C/p\u003E\n\u003Cp\u003E\nHe needn\u0027t have worried. Little by little the speed dropped off and he was able to bring the Centipede back under control. Under its own power, it crested the ridge and began sliding gently down the crater\u0027s ejecta. Swiftly, Calger threw on the brakes and extended the ladders. Somewhere in their crazy suicide plunge, a warning light had come on.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-27_00011.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-27_00011.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFortunately, it turned out to be nothing more than a blown tire. Structural damage would have been much worse - tires, at least, were replaceable.\n\u003C/p\u003E\n\u003Cp\u003E\nBreathing a sigh of relief, Calger took stock of the situation. They were still hundreds of kilometers from Arc Luna, and there would be a lot more craters in the way.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-27_00012.jpg\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-27_00012.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHopefully the rest of them had Kart lights at their rims as well.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-05T04:14:25Z\u0022 title=\u002211/05/2017 04:14  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 5, 2017\u003C/time\u003E by Kieve\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2013-12-30T02:02:07Z","Content":"\n\u003Cp\u003EGreat little vessel you have there! Keep up the good work and welcome to the forums!\u003C/p\u003E\n"},{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2013-12-30T20:01:35Z","Content":"\n\u003Cp\u003EYes, waiting for the next update on the story! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kieve","CreatedById":98713,"CreatedDateTime":"2013-12-31T01:10:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Naten\u0022 data-cite=\u0022Naten\u0022\u003E\u003Cdiv\u003EYes, waiting for the next update on the story! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHonestly, I\u0027m debating the next step myself. Do I make this a hundred-kilometer trek overland, weaving between (and through) craters, or do I say hang it all, send a rescue shuttle, and ship them to Arc Luna in a more conventional style? And not forgetting, in the eight to ten hours it\u0027d take for a rocket to \u003Cem\u003Eget there\u003C/em\u003E, the Centipede may well have reached the base under its own power, so in game time it may simply be more efficient to keep going as-is.\u003C/p\u003E\u003Cp\u003EI suppose it\u0027s down to my tolerance for frustration at the moment, since as well as the Centipede performed in Kerbin gravity, it\u0027s exactly as described above on the Mun - a rhino on rollerskates.\u003C/p\u003E\n"},{"CreatedByName":"Kieve","CreatedById":98713,"CreatedDateTime":"2014-01-01T20:31:01Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003EDamn this mission is starting to wear on me... but we must press on in the name of Science!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe Centipede Mission: \u003C/span\u003E\u003C/strong\u003E\u003Cem\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EEclipse\u003C/span\u003E\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCalger was really beginning to hate the Mun. After the last crater, it seemed the cratered rock had only one direction - \u003Cem\u003Euphill\u003C/em\u003E - and it was taking a severe toll on the Centipede\u0027s generous battery supply. He took it as easy on the throttle as he dared, treading a fine line between battery use and keeping up momentum on the never-ending slope. While he drove, Calger listened to the comm chatter. Apparently, Command had sent up a manned deep-space mission to follow their \u003Cem\u003EEeloo Seer\u003C/em\u003E launch. Someone kept repeating the code \u0022434-238,\u0022 which he assumed were either coordinates to something on Eeloo, or somebody\u0027s locker combo.\n\u003C/p\u003E\n\u003Cp\u003E\nCalger grumped at the controls, wishing he could go faster.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-30_00001.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-30_00001.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDespite his best efforts however, the constant upward climb took their toll on the Centipede\u0027s reserves. With an electric sigh, the throttle went dead and the rover drifted to a halt. Quickly, he engaged the brakes to keep it from rolling backwards. Then he did a double-take at his instruments. Something was wrong - the panels were deployed, but nothing was recharging! Fretting, he popped open the hatch, expecting to see them all broken, but the panels were intact. The fault lay not with the equipment, but with their orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-30_00003.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-30_00003.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EKerbin was causing a solar eclipse.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere was nothing to be done now but wait. Eventually their planet would move and the sun would recharge the exhausted batteries, but until then they were stuck. Shrugging, Calger shuffled down the Centipede\u0027s spine and climbed into the crew compartment. The others looked up in surprise as he entered.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022What did you break now, Cal?\u0022 Bart asked. There was no malice or scorn in his voice - it was an honest question expecting a practical answer. Calger just chuckled.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The sun. Kerbin\u0027s eclipsing us and the batteries are dead, so we\u0027re stuck here until we can get a charge back.\u0022 He broke out a pack of cards. \u0022Anyone for a game of Go Fish?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222013-12-30_00002.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2013-12-30_00002.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbin\u0027s shadow lingered over them for what felt like an eternity, and the batteries took even longer to charge once it had passed. Seven Kerbals waited, crammed into a capsule made for four, playing cards and eating what few snacks were left. It was dull, but for Calger, a welcome change from the constant slate-gray of Mun\u0027s surface. When he got back to Kerbin, he was moving to a tropical forest, with \u003Cem\u003Ecolors\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, the Centipede had enough of a charge to get moving again. To Calger\u0027s immense relief, they were near the crest of whatever hill or mountain they\u0027d been ascending.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-01_00001.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-01_00001.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was all downhill from here. He flipped on the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, sipped his energy drink, and let the rover coast, paying careful attention to keep it oriented wheels-flat as it skimmed over small bumps and slewed sideways around rocks. After conserving power and speed for so long, cruising downhill at 20m/s was as good as flying to Calger. The original landing site was over a hundred kilometers behind them now, and according to their orbital map, they were nearly halfway to Arc Luna!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-01_00003.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-01_00003.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-01_00002.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-01_00002.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut they were heading into twilight now, the sun dipping slowly towards the horizon. Could they make it to the Mun-base before sunset left them stranded again..?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-05T04:19:29Z\u0022 title=\u002211/05/2017 04:19  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 5, 2017\u003C/time\u003E by Kieve\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kieve","CreatedById":98713,"CreatedDateTime":"2014-01-12T20:44:09Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe Centipede Mission: \u003C/span\u003E\u003C/strong\u003E\u003Cem\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EEnd of the Line\u003C/span\u003E\u003C/strong\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn a word: No.\n\u003C/p\u003E\n\u003Cp\u003E\nIn multiple words: still no.\n\u003C/p\u003E\n\u003Cp\u003E\nCalger had pressed on as far as he was able, conserving the batteries where he could and easing the over sized rover up one crater slope after another, but as the sun sank below the horizon he found another problem even harder to fight than the Centipede\u0027s poor handling - darkness. Despite the floodlights mounted to the Centipede\u0027s cabin, the terrain ahead remained a stubborn inky black. It was impossible for Calger to see where they were going, and with the craters and rolling hills ahead, driving blind through them would almost certainly prove fatal. As he crested another rise, a blip appeared on the HUD - they were within fifty clicks of the base now, automatically registering it with the Centipede\u0027s tracking systems. Deciding they\u0027d come far enough for the day\u0027s travel, he locked the brakes and pulled in the solar panels. They would wait out the night here.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-06_00005.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-06_00005.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTo pass the time, they listened to radio chatter from Command back on Kerbin. An expedition to Duna was in the works, with Shelsey in command of the Orbiter station and Burhat assigned to the Lander - Ribdrin and Sigby would operate the Science Lab while in the field.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I can\u0027t believe they\u0027re putting Ribdrin in the lab,\u0022 Alvin grumped. \u0022He doesn\u0027t know a test tube from a tube sock.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Maybe not,\u0022 Bartbles reminded him tartly, \u0022but at least he didn\u0027t try to \u003Cem\u003Eeat\u003C/em\u003E them in training.\u0022 The other Kerbals laughed, and Alvin turned a deeper shade of green.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022That was on a dare and you know it,\u0022 the embarrassed Kerbal muttered. The rest of the crew laughed harder. Eventually, lacking anything better to do, the travel-weary Kerbals fell asleep.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00004.jpg\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00004.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMunar dawn broke over the dunes with little fanfare. Calger blinked, twisting his large head to work out a cramp in his neck. Dimly, he became aware of the yellow glare forcing its way past the polarized glass. The sun had finally managed to climb back up above the crater peaks, revealing the rolling gray hills ahead. A slow smile spread across his face - it was all downhill from here. The batteries were almost fully recharged already, and he would only need them sparingly to control their descent from the highlands. Anxious to be on the move again, he disengaged the brakes and began the long rolling descent to Arc Luna.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00001.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00001.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00006.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00006.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs they skirted another crater, Bartbles switched on the intercom, signalling Calger to stop. Despite their very limited view from the crew module, he\u0027d noticed something interesting in the hillside.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Bart, we\u0027ve still got a good thirty clicks to go before we\u0027re there,\u0022 Cal protested. \u0022Can we save admiring the scenery for our arrival at least?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBartbles rolled his eyes, forgetting that Calger could not see it through the intercom. \u0022We came here to do Science, Cal. We should take the time to actually Science something.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Alright,\u0022 the driver conceded. \u0022You\u0027ve got five minutes to get back in the \u0027Pede, otherwise you\u0027re walking the rest of the way.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Knowing your driving, we might live longer that way,\u0022 Seanden muttered under his breath. Alvin and Anfen smothered their laughter.\n\u003C/p\u003E\n\u003Cp\u003E\nGlad to be stretching his legs once more, Bartbles climbed out of the crew module and hit the release on the left-side ladder. As he took a step towards it however, his foot caught in the handholds for the science lab - Mun\u0027s low gravity did nothing to halt his momentum, and he performed an awkward somersault into the dust below.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00007.jpg\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00007.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00008.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00008.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfazed, Bart picked himself up and brushed off the clinging Mun-dust. Without proper instruments, there was only so much data he could collect, but he made certain to take a soil sample for Dermin and Kenbas to analyze in the lab. It would give the two \u003Cem\u003Esomething\u003C/em\u003E to do at least. Planting a flag to mark the spot for further examination, he climbed back into the crew module and informed Calger they could be on their way once more. Their impatient driver was only too happy to oblige.\n\u003C/p\u003E\n\u003Cp\u003E\nAn air of excitement permeated the crew - after their hair-raising and wildly off-course landing, they were finally going to see the Outpost. Calger in particular was so distracted by their impending arrival, he neglected to check the terrain mapping, continuing blissfully down the valley until he noticed the ridge rising in front of him. Seven clicks from Bartbles\u0027 site, the Centipede drew to a halt once more. One last network of craters lay between them and their destination - a cluster they had already entered without being aware of it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00010.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00010.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00011.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00011.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFed up with skirting craters, Calger checked the battery reserves. \u003Cem\u003E100% charge - we haven\u0027t needed them since entering the valley.\u003C/em\u003E A sequence of lights appeared in his head, accompanied by the soft \u0022ding\u0022 as they cycled color. They were nearly to Arc Luna, these pits were shallow, and they\u0027d only waste time and energy turning around to circumvent them. If he could\u0027ve revved the electric motors, he would have.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kart lights in his head went green.\n\u003C/p\u003E\n\u003Cp\u003E\nDust and debris smacked the underside of the Centipede as the wheels spun to gain traction. Even in the low gravity, he felt the change in momentum as the big rover accelerated down the crater slope. From the protests coming from the crew module, he wasn\u0027t the only one.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Cal, what the heck are you doing?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKer\u003C/abbr\u003E we\u0027re all gonna die! I don\u0027t want to die!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022He\u0027s lost his mind! Someone else drive, please!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nCalger just laughed, his mirth tinged with manic glee. The Centipede crested the far side of the middle crater, wheels spinning in empty space as it floated above the terrain.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00012.jpg\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00012.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe best was yet to come, however. It bounced, wheels digging into the grit, and shot down the crater\u0027s bowl as though the rhino\u0027s skates had become rocket-powered. At 30m/s, Calger knew the slightest wrong move on the controls could spell disaster for the Centipede, but he was past caring. Arc Luna was so close he could taste it. His laughter rose, drowning out the panicked wails from the back with his madness. The crater\u0027s wall loomed ahead, but the Centipede barely slowed as its momentum carried it upwards. With a final lurch, the rover was airborne again, in spectacular fashion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00013.jpg\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00013.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLacking \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or rockets, all Calger could do was keep the wheels facing down and hope they didn\u0027t hit ground harder than the tires could stand. In the back of his mind, he wondered if he\u0027d taken things too far this time. The Centipede came down.\n\u003C/p\u003E\n\u003Cp\u003E\nMetal struts groaned under the strain as the wheels struck the Mun\u0027s surface, sixteen tons of Science, Steel, and Kerbals bearing down on top of them, but somehow the craft held together. Skidding wildly across the dunes, Calger slowly brought the careening vehicle back under control. It slid to a stop at the lip of the final crater - the one where, four kilometers away in its bowl, Arc Luna had touched down. For a moment, he paused there on the cliffside, finally able to see their destination.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00014.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00014.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was it. With all the caution he had abandoned previously, Calger nosed the Centipede\u0027s cabin over the edge. For a heart-stopping moment as the craft pitched forward, he was staring straight down. His foot rested on the brakes. Then they were sliding down the final slope, brakes locked as their intrepid driver did everything he could to fight momentum from building again. Smoother than he believed possible, Calger brought the rover to a brisk cruise over the crater floor.\n\u003C/p\u003E\n\u003Cp\u003E\nAt long last, they had arrived.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00015.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00015.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222014-01-11_00016.jpg~original\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i50.photobucket.com/albums/f321/Kieve/2014-01-11_00016.jpg~original\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-11-05T04:24:49Z\u0022 title=\u002211/05/2017 04:24  AM\u0022 data-short=\u00226 yr\u0022\u003ENovember 5, 2017\u003C/time\u003E by Kieve\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-01-13T10:48:56Z","Content":"\n\u003Cp\u003EWow. Magnificent effort. \u003C/p\u003E\u003Cp\u003EYou will have much experience from that endeavor, and it was very nicely written too.\u003C/p\u003E\u003Cp\u003EHave very warm welcome to these forums!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/gdJw0uy\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/gdJw0uyl.png\u0022 alt=\u0022gdJw0uyl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"}]}