{"TopicId":57918,"ForumId":20,"TopicTitle":"I could use your opinion on...","CreatedByName":"Bothersome","CreatedById":66869,"CreatedDateTime":"2013-12-27T17:54:07Z","PageNum":1,"Articles":[{"CreatedByName":"Bothersome","CreatedById":66869,"CreatedDateTime":"2013-12-27T17:54:07Z","Content":"\n\u003Cp\u003EI\u0027m curios as to the best approach to a problem.\u003C/p\u003E\u003Cp\u003EThe situation: Playing in Real Scale System with Deadly Re-entry, FAR, MJ, a few other mods to help.\u003C/p\u003E\u003Cp\u003EProblem: Getting to the Moon (Mun) or other far reaching places.\u003C/p\u003E\u003Cp\u003EOK, the Moon is on a 23.5 degree incline. It\u0027s not on the equator like in stock Kerbal system. It\u0027s also way out there. What I need to know is, Is it better to launch a craft going 0 degree incline as you would from Kerbin and then time the burn to meet the Moon when it crosses the equator, or launch the craft to the 23.5 degree incline? So, what would you do and why?\u003C/p\u003E\u003Cp\u003ENote, when doing the launch to 23.5 degree incline, more fuel is used to get the craft going in that direction. The benefit is that you can then burn to get to the Moon within couple of hours. When you launch on the 0 degree incline, you must time the burn to one of two burn windows per month.\u003C/p\u003E\u003Cp\u003ENow you should know, that weight is EXPENSIVE. My lander craft is 22 tons and must be refueled from orbit before going out to the Moon, as it takes about half of the on board fuel just to \u0022set the orbit\u0022.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=208640538\u0022 rel=\u0022external nofollow\u0022\u003EPicture of lander\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/450657240913774337/0CF0EC6671015810CFE2684549123B1FFDA1D4E5/\u0022 alt=\u00220CF0EC6671015810CFE2684549123B1FFDA1D4E5\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Raikoutrio","CreatedById":78489,"CreatedDateTime":"2013-12-27T18:02:42Z","Content":"\n\u003Cp\u003EIf you aren\u0027t using any life support mods, it would be more efficient to launch into a standard equatorial orbit and then burn to meet the Mun at it\u0027s ascending/descending node. However, if time is of the essence(which it probably won\u0027t be unless you have some kind of life support mod) launch into the inclined orbit so that your Kerbals don\u0027t die.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-12-27T18:23:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Raikoutrio\u0022 data-cite=\u0022Raikoutrio\u0022\u003E\u003Cdiv\u003EIf you aren\u0027t using any life support mods, it would be more efficient to launch into a standard equatorial orbit and then burn to meet the Mun at it\u0027s ascending/descending node. However, if time is of the essence(which it probably won\u0027t be unless you have some kind of life support mod) launch into the inclined orbit so that your Kerbals don\u0027t die.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly what I would suggest. The only change would be if you do have a life support mod or other time constraint I would suggest waiting till your launch window is perfect so once you have reached orbit all you have to do is burn to the moon. This is pretty close to what the actual Apollo missions did. They waited till the Moon was in the right place before the launch, then launched the craft, a few hours before the optimal window and did everything in one go.\u003C/p\u003E\n"},{"CreatedByName":"Bothersome","CreatedById":66869,"CreatedDateTime":"2013-12-27T21:07:10Z","Content":"\n\u003Cp\u003EThanks guys, that\u0027s kind of what I was thinking too. My launches don\u0027t go off \u0022that close to target\u0022 though, so, I\u0027ll just have to build in some error.\u003C/p\u003E\n"}]}