{"TopicId":58190,"ForumId":44,"TopicTitle":"Would it be a bad idea to travel the speed of light?","CreatedByName":"willwolvescry","CreatedById":71661,"CreatedDateTime":"2013-12-29T23:50:46Z","PageNum":1,"Articles":[{"CreatedByName":"willwolvescry","CreatedById":71661,"CreatedDateTime":"2013-12-29T23:50:46Z","Content":"\n\u003Cp\u003ELet\u0027s face it. Everyone wants to travel the speed of light even if its just to get to the moon in seconds but let\u0027s think about this. We do know right now Light speed travel is impossible for manned flights currently and at best we can make particles achieve light speed but I see some major problems. First off the most obvious to me is navigation. When we finally do achieve manned light speed travel how do we know where we are going or more importantly where we are? Currently what we use to navigate wont work for light travel. Most of our navigation is visual and we wouldn\u0027t be able to see any visual cues since light wouldn\u0027t be able to reach our eyes fast enough. Any auditory cues would also be useless for the same reason. Felt cues may work but by the time we receive them and react it may be too late. Let\u0027s also think about getting out of light speed. If it takes a long time to return to a safer speed wouldn\u0027t it seem rather pointless well with the exception of long distance travel. Finally what would happen if the worst were to happen? What would happen if you crashed into an object at light speed? Would you be absorbed or would you be vaporized?\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-12-30T00:04:52Z","Content":"\n\u003Cp\u003EFirst of, it\u0027s not possible to travel *at* the speed of light. It\u0027s not advisable to do either, since at that kind of speeds, a grain of dust hits with the force of a large nuclear device.\u003C/p\u003E\u003Cp\u003EAt something like 99.9% the speed of light, I think you can travel to the edge of the Galaxy in a week as seen from your point of view, but by the time you arrive there might not be a galaxy left the edge of which you were traveling to.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-30T00:08:18Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.mpia-hd.mpg.de/~kuiper/Rolf_Kuiper/Research_RHIC_files/First_Gold_Beam-Beam_Collision_Events_at_RHIC_at_100_100_GeV_c_per_beam_recorded_by_STAR.jpg\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E is the sort of thing that happens when two nuclei collide at near-light speed. Collisions with absolutely anything, down to space dust, is going to be really, really bad.\u003C/p\u003E\u003Cp\u003ENavigation you can work around. Combination of inertial navigation and some other cues, like signals from pulsars, would get you to the right general location, and you can slow down well ahead of your destination to make corrections. Compared to all other issues, this is category of engineering problems. They might be tricky, but we have means of solving them. Actually accelerating to light speed and protecting ship from impacts are the more fundamental problems of near-light speed travel.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-30T00:08:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EFirst of, it\u0027s not possible to travel *at* the speed of light. It\u0027s not advisable to do either, since at that kind of speeds, a grain of dust hits with the force of a large nuclear device.\u003Cp\u003EAt something like 99.9% the speed of light, I think you can travel to the edge of the Galaxy in a week as seen from your point of view, but by the time you arrive there might not be a galaxy left the edge of which you were traveling to.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E75,000 years at most isn\u0027t going to do much to the galaxy. It\u0027s still a few billion until we \u0022collide\u0022 with the Andromeda galaxy (the quotations are just because the term \u0027colliding\u0027 isn\u0027t really an apt way of describing it).\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-30T00:11:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENavigation you can work around.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat about avoiding stars (or an other large body for that matter)? To the best of my knowledge, we can only determine a star\u0027s distance to within a few percent, which is quite a large uncertainty as far as navigation goes.\u003C/p\u003E\u003Cp\u003EAnd that is only the things we can easily see.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-12-30T00:15:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003E75,000 years at most isn\u0027t going to do much to the galaxy. It\u0027s still a few billion until we \u0022collide\u0022 with the Andromeda galaxy (the quotations are just because the term \u0027colliding\u0027 isn\u0027t really an apt way of describing it).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou forgot relativity. A week passes for you, but millions if not billions of years may pass in \u0022normal\u0022 time.\u003C/p\u003E\n"},{"CreatedByName":"brooklyn666","CreatedById":88321,"CreatedDateTime":"2013-12-30T00:19:49Z","Content":"\n\u003Cp\u003EThat depends entirely on how you plan on achieving that speed. If you plan on using an artificial wormhole or some sort of Alcubierre Drive, you avoid all of the consequences mentioned above.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-30T00:19:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003EWhat about avoiding stars (or an other large body for that matter)? To the best of my knowledge, we can only determine a star\u0027s distance to within a few percent, which is quite a large uncertainty as far as navigation goes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENumber of stars and other dense objects is so low, that you might as well just take your chances. Navigate far from the stars you know to the best of your ability, and take the chance with rest.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Esome sort of Alcubierre Drive, you avoid all of the consequences mentioned above.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, you don\u0027t. Matter in the path of Warp Drive is still a problem. And we are talking about sub-light travel, not FTL.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-12-30T00:25:29Z","Content":"\n\u003Cp\u003EFull power to the deflector shields!\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-12-30T00:38:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022willwolvescry\u0022 data-cite=\u0022willwolvescry\u0022\u003E\u003Cdiv\u003EMost of our navigation is visual and we wouldn\u0027t be able to see any visual cues since light wouldn\u0027t be able to reach our eyes fast enough. Any auditory cues would also be useless for the same reason. Felt cues may work but by the time we receive them and react it may be too late.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUm, auditory?\u003C/p\u003E\u003Cp\u003EAre you talking about difficulties with the ship displaying information to the crew? That wouldn\u0027t be a problem at all, since they\u0027re not moving relative to one another.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-30T00:42:31Z\u0022 title=\u002212/30/2013 12:42  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 30, 2013\u003C/time\u003E by Seret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2013-12-30T00:59:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EYou forgot relativity. A week passes for you, but millions if not billions of years may pass in \u0022normal\u0022 time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. At 99,9% lightspeed, the Lorentz factor is still only about 22,4, which means that for each \u0022week\u0022 passing for the people on the ship, the stationary universe around them ages about half a year. If you want to get to the edge of the galaxy, you\u0027ll have to go faster than that. At 99,9999% \u003Cem\u003Ec\u003C/em\u003E it would just about be achievable within a human lifetime.\u003C/p\u003E\n"},{"CreatedByName":"willwolvescry","CreatedById":71661,"CreatedDateTime":"2013-12-30T01:18:37Z","Content":"\n\u003Cp\u003EUm, auditory?\u003C/p\u003E\u003Cp\u003EAre you talking about difficulties with the ship displaying information to the crew? That wouldn\u0027t be a problem at all, since they\u0027re not moving relative to one another.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-12-30T01:23:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022willwolvescry\u0022 data-cite=\u0022willwolvescry\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ERelative positioning would still be a problem since light will just like sound does when traveling mach speed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, the speed of light is the same for everybody regardless of how they move. Light and sound do not behave the same.Sound itself is only affected if you\u0027re moving at a different speed from the medium that it\u0027s travelling through, which you wouldn\u0027t be. Within an aircraft moving at supersonic speeds sounds are perfectly normal. If they weren\u0027t how would the cabin crew of the Concorde have served you your champagne?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-30T01:26:00Z\u0022 title=\u002212/30/2013 01:26  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 30, 2013\u003C/time\u003E by Seret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2013-12-30T01:40:57Z","Content":"\n\u003Cp\u003EOn the Lorentz factor and special relativity, there is a neat way to very easily calculate some things:\u003C/p\u003E\u003Cp\u003EYou don\u0027t need the Lorentz factor to do some types of computations at all. The Lorentz factors cancel when calculating flight time from the space ships own frame of reference, thus everything behaves like in the classical scenario as long as no interaction with other objects is considered. Therefore, investing 4 times as much energy into velocity will get you there exactly two times as fast, i.e. in half the time, from your point of view.\u003C/p\u003E\u003Cp\u003EAnd if you travel to anywhere outside your current solar system in comfortable flight times (own frame again) of at most months, then your speed relative to the stars is rather close to c, letting you expect a year per lightyear to happen in the frame of the stars/the galaxy.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-30T01:45:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EYou forgot relativity. A week passes for you, but millions if not billions of years may pass in \u0022normal\u0022 time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, but if you are traveling across the galaxy at near the speed of light, it will take at most 75,000 years of \u0022normal\u0022 time to do it.\u003C/p\u003E\n"},{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2013-12-30T03:18:04Z","Content":"\n\u003Cp\u003EThe impact energy of a single mote of space dust with relative velocity of 1c isn\u0027t so bad. A mote of space dust masses about the same as a bacterium; it would only have an kinetic energy of about 10J. Over time this would sandblast your hull, but otherwise it is not particularly devastating. It also means that the dust exerts a pressure on the hull not unlike aerodynamic drag in an atmosphere; therefore relativistic rockets, if they ever are built, will probably be streamlined, sleek designs.\u003C/p\u003E\u003Cp\u003EBut there would be some pretty extreme radiation hazards for near-light speed travel. At .99c visible light blueshifts into x-rays, which may not be a big problem if you are in the interstellar void but flying through a solar system at that speed would be a death sentence. Even worse is that interstellar gas and dust particles would have energy comparable to high energy cosmic rays, on the order of 100MeV up to 1-3GeV. In unshielded conditions this would equate to human radiation dosages in the tens- to hundreds of thousands of rems per second, which is similar to conditions inside the core of a nuclear reactor. Some of these particles are charged, so they could in principle be deflected with magnetic shields (of course then the problem would be cohabiting with 20 T magnetic fields). To deal with the neutral particles you would need a many meters thick radiation shield made out of water or titanium. Also our solar system is inside a bubble of abnormally low density interstellar medium. In other areas of our galaxy the radiation hazards might be even more extreme, therefore interstellar travel of the far future will probably have galactic navigation routes passing through low density corridors not unlike the hyperspace trade routes from starwars:)\u003C/p\u003E\n"},{"CreatedByName":"brooklyn666","CreatedById":88321,"CreatedDateTime":"2013-12-30T03:38:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003ENumber of stars and other dense objects is so low, that you might as well just take your chances. Navigate far from the stars you know to the best of your ability, and take the chance with rest.\u003Cp\u003ENo, you don\u0027t. Matter in the path of Warp Drive is still a problem. And we are talking about sub-light travel, not FTL.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe title of this thread is \u0022Would it be a bad idea to travel the speed of light?\u0022 So how is that not talking about FTL?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-30T04:53:56Z","Content":"\n\u003Cp\u003EIt helps to read the opening post, not just the title. Author compares it to particles in an accelerator, so he\u0027s obviously talking about very, very close to light speed, yet sub-light.\u003C/p\u003E\n"},{"CreatedByName":"brooklyn666","CreatedById":88321,"CreatedDateTime":"2013-12-30T04:59:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022willwolvescry\u0022 data-cite=\u0022willwolvescry\u0022\u003E\u003Cdiv\u003EWhen we finally do achieve manned light speed travel...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe explicitly stated it right there.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-30T05:13:39Z","Content":"\n\u003Cp\u003EAnd by light speed, he clearly means near-light speed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Eis impossible for manned flights currently and at best we can make particles achieve light speed\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZetaX\u0022 data-cite=\u0022ZetaX\u0022\u003E\u003Cdiv\u003EYou don\u0027t need the Lorentz factor to do some types of computations at all. The Lorentz factors cancel when calculating flight time from the space ships own frame of reference, thus everything behaves like in the classical scenario as long as no interaction with other objects is considered. Therefore, investing 4 times as much energy into velocity will get you there exactly two times as fast, i.e. in half the time, from your point of view.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, actually, it does not. All has to do with the way proper acceleration works. As it turns out, once you are going really, really fast, speeding up gets way easier.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-30T05:16:12Z\u0022 title=\u002212/30/2013 05:16  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 30, 2013\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"brooklyn666","CreatedById":88321,"CreatedDateTime":"2013-12-30T05:16:27Z","Content":"\n\u003Cp\u003ESince he brings up BOTH FTL and near speed-of-light travel, how about we stop quibbling over minutiae?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-12-30T05:28:09Z","Content":"\n\u003Cp\u003EWhere does he \u003Cem\u003Eeven once\u003C/em\u003E mention \u003Cem\u003Efaster\u003C/em\u003E than light?\u003C/p\u003E\n"},{"CreatedByName":"brooklyn666","CreatedById":88321,"CreatedDateTime":"2013-12-30T05:32:29Z","Content":"\n\u003Cp\u003EOk, clearly you\u0027re going to continue on with this, so I\u0027m going to bow out.\u003C/p\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2013-12-30T14:00:15Z","Content":"\n\u003Cp\u003EFor all practical purposes, \u0022light-speed travel\u0022 means near or infinitesimally close to the speed of light. Travelling exactly at light-speed is not FTL, photons do it all the time.\u003C/p\u003E\u003Cp\u003EIt\u0027s actually technically possible to go FTL - just not in a vacuum \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2013-12-30T14:34:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022architeuthis\u0022 data-cite=\u0022architeuthis\u0022\u003E\u003Cdiv\u003EThe impact energy of a single mote of space dust with relative velocity of 1c isn\u0027t so bad. A mote of space dust masses about the same as a bacterium; it would only have an kinetic energy of about 10J. Over time this would sandblast your hull, but otherwise it is not particularly devastating. It also means that the dust exerts a pressure on the hull not unlike aerodynamic drag in an atmosphere; therefore relativistic rockets, if they ever are built, will probably be streamlined, sleek designs.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou cannot use the classical Kinetic Energy formula when calculating kinetic energy for objects moving with relativistic speeds. You either have to plug relativistic mass into the kinetic energy formula, or you have to use the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Kinetic_energy#Relativistic_kinetic_energy_of_rigid_bodies\u0022 rel=\u0022external nofollow\u0022\u003Erelativistic kinetic energy formula.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAny object with any positive value of rest mass would have infinite kinetic energy if it was moving at 1c.\u003C/p\u003E\n"}]}