{"TopicId":58201,"ForumId":55,"TopicTitle":"The \u0026quot;time\u0026quot; problem in career mode (Space Race)","CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-12-30T02:15:38Z","PageNum":1,"Articles":[{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-12-30T02:15:38Z","Content":"\n\u003Cp\u003ESo a lot of people are requesting experiments that take time to complete, or deliver continuous science once deployed.\u003C/p\u003E\u003Cp\u003EHowever, the devs (and I agree with them) have said that this isn\u0027t going to happen, because it would be possible to just time warp, and get all the science instantly.\u003C/p\u003E\u003Cp\u003EThe same issue comes up when budgets are being discussed, how do you have a budget that limits you without just being able to time warp until the next year\u0027s funds come through?\u003C/p\u003E\u003Cp\u003EBasically, for \u0022over time\u0022 science to work, time warp has to be disincentivised somehow.\u003C/p\u003E\u003Cp\u003EMy suggestion for this is for a \u0022Space Race\u0022 with a fictional rival Kerbal nation.\u003C/p\u003E\u003Cp\u003EThey will be progressing along their own path at a certain rate, and it\u0027s your job to stay ahead of them. Waste your budget, and have to time warp to get more money, and you lose precious time to the KSSR in the race to orbit.\u003C/p\u003E\u003Cp\u003E\u0022Losing\u0022 to your rivals could have consequences for your public opinion, or as I\u0027d prefer, it\u0027s just for your own satisfaction.\u003C/p\u003E\u003Cp\u003EAlthough a \u0022show\u0022 space centre for them would be cool, along with spawning landers/space stations/bases, they could just be implemented as a timer, or messages that pop up whenever the rivals accomplish something.\u003C/p\u003E\u003Cp\u003EAny thoughts?\u003C/p\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-12-30T03:17:02Z","Content":"\n\u003Cp\u003ESounds like a good way to discourage timewarp. Maxmaps once said on another website that other space agencies could be possible with some sort of AI system that Squad implemented/will implement. He said he liked my idea of rescuing kerbals from the other space programs to gain reputation, so I think that Squad has at least thought about the idea.\u003C/p\u003E\n"},{"CreatedByName":"Hashbrown66","CreatedById":65106,"CreatedDateTime":"2013-12-30T03:51:36Z","Content":"\n\u003Cp\u003EYeah, that would be pretty fun! (as long as it were optional, of course, to please the newbie-conscious) It would be neat if they could get some smart AI logic in there to assess your skill level and make it harder or easier as you play through.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2013-12-30T04:43:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHowever, the devs (and I agree with them) have said that this isn\u0027t going to happen, because it would be possible to just time warp, and get all the science instantly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends on how slow the science comes in. If you have to do a grand tour three times on low-tech parts to make it so your army of one probe in every biome can finish the tree in 7 days of max time warp, then you could argue that well, you have to do a grand tour two or three times on low tech parts in order to do that. Don\u0027t forget that at low tech, not nearly all of the scientific instruments are available.\u003C/p\u003E\u003Cp\u003EHowever yes, having options at the start of your career mode to select 0..n number of AI factions from a list could be fun. Perhaps some kind of Master Of Orion style diplomacy and swapping of science going on, only without the giant doom stars full of phasors and plasma torpedoes. Work the system on a kind of \u0022give more, get more\u0022 approach, where the more you do, the more that AI factions want to get involved and ally with you. Keep doing stuff, and your allied factions will be willing to do more, and will contribute more to your science pool (and you to theirs).\u003C/p\u003E\u003Cp\u003EAdd to that some individual characteristics for the factions. One or two may be rather unfriendly and not prone to sharing, however they may have top notch scientists and can get you a bunch of extra RP, so long as you do really well and continue to impress them, shall we say.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-30T04:47:55Z\u0022 title=\u002212/30/2013 04:47  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 30, 2013\u003C/time\u003E by technicalfool\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Yakuzi","CreatedById":85181,"CreatedDateTime":"2013-12-30T05:11:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EHowever, the devs (and I agree with them) have said that this isn\u0027t going to happen, because it would be possible to just time warp, and get all the science instantly.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs things are now, many people are spamming/grinding to get research points which IMO is even more of an exploit and considerably less fun than setting up the infrastructure and performing science over time. \u003C/p\u003E\u003Cp\u003EIn another thread I posted some suggestions on how time-warp abuse can be reduced:\u003C/p\u003E\u003Cp\u003E- Science over time (SoT) would exist alongside the current \u0027direct\u0027 acquired science system \u003C/p\u003E\u003Cp\u003E- SoT science points would be acquired at long intervals, possibly with diminishing returns per experiment (or alternatively, increased returns over ever longer time frames)\u003C/p\u003E\u003Cp\u003E- SoT modules would require some tech, so they won\u0027t be available from the start\u003C/p\u003E\u003Cp\u003E- SoT modules can breakdown or would use \u0027lab consumables\u0027 (similar to fuel), so maintenance or resupply missions are required\u003C/p\u003E\u003Cp\u003E- SoT modules can analyze/process \u0027direct\u0027 acquired science over time at a fraction (e.g. 80%) of the total research value\u003C/p\u003E\u003Cp\u003EThis SoT scheme reflects more closely how science actually works and would stimulate satellite networks and orbital/ground research stations. In turn this would encourage Kerbal infrastructure throughout the kerbolar system and other awesomeness.\u003C/p\u003E\u003Cp\u003EThe space race idea is also nice though, would love to see it implemented \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-12-30T12:49:41Z","Content":"\n\u003Cp\u003E\u0022KSSR\u0022 can we keep our races and countries out of ksp similarities?? Please.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-12-30T14:39:18Z","Content":"\n\u003Cp\u003EI was thinking something very simple, no AI, no computer-controlled launches blasting off, flying through space, or anything (although it would probably be possible with a bit of clever coding to add rival spacecraft to the game in certain orbits so you could keep an eye on them). I really was just going for a simple timer, and maybe a pop-up or information box from Wernher von Kerman letting you know what the other Kerbals were working on, and roughly how much time you had before they achieved it (I think this would give you deadlines and things to aim for without overly restricting you. Hear your rivals are planning a Minmus landing and return? You can try and stretch out your budget to get there before them, or you can abandon the race to Minmus and instead focus on launching a probe to Duna. Or just ignore them altogether, but it would give a little sense of urgency and make your budget have some meaning)\u003C/p\u003E\u003Cp\u003EAs an aside (please don\u0027t lock the thread!!), it\u0027s not really in the spirit of the game, and will defnitely never be implemented, but wouldn\u0027t it be fun if the much maligned female Kerbals had a space centre diametrically opposed to the normal KSC, and you could choose at the start of the game whether to play as male or female Kerbals, with your rivals then being the other gender?!\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-12-30T15:37:50Z","Content":"\n\u003Cp\u003EAgreed with Op and with Squad:\u003C/p\u003E\u003Cp\u003EIf the point of science-over-time in ksp is to simulate real world scientific progression, then gaining science merely by having time pass is not interesting because irl science takes time \u003Cem\u003Ebecause things need to be done to make science progress\u003C/em\u003Es, and doing things (explore) takes time.\u003C/p\u003E\u003Cp\u003EThis already is simulated in ksp because you need to fly missions in order to gain science - and doing missions takes time.\u003C/p\u003E\u003Cp\u003ETL;DR: there already is science-over-time, it\u0027s just that you have to actually do something for time to pass, instead of just sitting there watching time go by.\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2013-12-30T16:45:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHowever, the devs (and I agree with them) have said that this isn\u0027t going to happen, because it would be possible to just time warp, and get all the science instantly.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, that\u0027s not automatically the case, firstly, if you want to do long exposure experiments then you need to put yourself in orbit instead of simply flying past a target, time warping doesn\u0027t help for this case. Furthermore, long exposure experiments that take power may not be available depending on your power system. One possibility is to add time sensitive biomes for certain experiments - e.g. you need to take temperature readings in the middle of the day and the middle of the night, necessitating a probe that can power itself and the experiment through the night.\u003C/p\u003E\n"}]}