{"TopicId":58474,"ForumId":16,"TopicTitle":"A few spaceplane issues","CreatedByName":"sledgeweb","CreatedById":80879,"CreatedDateTime":"2014-01-01T15:25:32Z","PageNum":1,"Articles":[{"CreatedByName":"sledgeweb","CreatedById":80879,"CreatedDateTime":"2014-01-01T15:25:32Z","Content":"\n\u003Cp\u003EI have been enjoying building experimental planes recently, but have noticed a few quirks. Are these bugs, or am I doing something wrong?\u003C/p\u003E\u003Cp\u003E1. Stuck to ground. Lately, my planes have trouble lifting off the ground. Once I go off the end or side of the runway, and a downward slope takes the ground out from under me, I can pull up and fly/maneuver. But when I\u0027m in contact with flat ground, I can\u0027t pull up. \u003C/p\u003E\u003Cp\u003E2. I have some large craft with multiple sets of the large thin wings. I put the larger aileron/flaps on the back of them. If I have 2-3 sets, they don\u0027t act in unison. When I press W, some will go up and some down. How can I get them all working the same? I\u0027ve tried rotating the misbehaving pieces. In all cases the symmetry is maintained.\u003C/p\u003E\u003Cp\u003E3. I\u0027ve also has flaps change the way they work after entering/exiting time warp. For example, I take off having to press W to move flap up and pull up. After time warp, W moves flaps down. This is also inconsistent when I leave hangar and go to runway. Even when I don\u0027t change that part, sometimes the W is up and sometimes it\u0027s down.\u003C/p\u003E\u003Cp\u003E4. I saved a spaceplane as a sub assembly and brought it to the rocket building. I built a rocket and wanted to attach my plane to it shuttle style. For some reason the \u0022connection point\u0022 of my plane wasn\u0027t the center of its belly. This was a small simple plane with cockpit, fuselage fuel body, engine all compact and simple. But it wanted to connect sort of off center. I\u0027ve noticed part do this sometimes - any way to fix this?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-01T15:30:06Z\u0022 title=\u002201/01/2014 03:30  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 1, 2014\u003C/time\u003E by sledgeweb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-01T15:48:05Z","Content":"\n\u003Cp\u003E1. Canards near the nose or putting your rear landing wheels more forward towards the center of mass usually help as the plane first needs to pitch a bit before its lift force is high enough to lift it all. It\u0027s also possible to put front landing wheel lower, pitching the front up slightly just as it stands on runway.\u003C/p\u003E\u003Cp\u003E2. Action of control surfaces depends on their position relative to center of mass. If those behind CoM go down, those ahead of CoM go up.\u003C/p\u003E\u003Cp\u003E3. This may be caused by change in center of mass as your engines draw fuel from fuel tanks. It\u0027s possible the rescan is only done occasionally, or after exiting time warp.\u003C/p\u003E\u003Cp\u003E4. Subassemblies are best built attached to some placeholder the way they are supposed to be attached later. Each subassembly can only be attached by its root part which is the first part (of the subassembly) placed in VAB/SPH.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/rhERm\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-01T15:50:23Z\u0022 title=\u002201/01/2014 03:50  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 1, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-01-01T18:03:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sledgeweb\u0022 data-cite=\u0022sledgeweb\u0022\u003E\u003Cdiv\u003EI have been enjoying building experimental planes recently, but have noticed a few quirks. Are these bugs, or am I doing something wrong?\u003Cp\u003E1. Stuck to ground. Lately, my planes have trouble lifting off the ground. Once I go off the end or side of the runway, and a downward slope takes the ground out from under me, I can pull up and fly/maneuver. But when I\u0027m in contact with flat ground, I can\u0027t pull up. \u003C/p\u003E\u003Cp\u003E2. I have some large craft with multiple sets of the large thin wings. I put the larger aileron/flaps on the back of them. If I have 2-3 sets, they don\u0027t act in unison. When I press W, some will go up and some down. How can I get them all working the same? I\u0027ve tried rotating the misbehaving pieces. In all cases the symmetry is maintained.\u003C/p\u003E\u003Cp\u003E3. I\u0027ve also has flaps change the way they work after entering/exiting time warp. For example, I take off having to press W to move flap up and pull up. After time warp, W moves flaps down. This is also inconsistent when I leave hangar and go to runway. Even when I don\u0027t change that part, sometimes the W is up and sometimes it\u0027s down.\u003C/p\u003E\u003Cp\u003E4. I saved a spaceplane as a sub assembly and brought it to the rocket building. I built a rocket and wanted to attach my plane to it shuttle style. For some reason the \u0022connection point\u0022 of my plane wasn\u0027t the center of its belly. This was a small simple plane with cockpit, fuselage fuel body, engine all compact and simple. But it wanted to connect sort of off center. I\u0027ve noticed part do this sometimes - any way to fix this?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk these are common problems people have with aircraft in general so I will see if I can give you some help seeing as all I do is SSTO space planes.\u003C/p\u003E\u003Cp\u003E1- Not generating enough lift to get off the ground. \u003C/p\u003E\u003Cp\u003EIf you could post a pic of the craft with the Center of Lift, and Center of Mass, and the Center of Thrust indicators on it would help. But I can pretty much guess what the problem is. It seems like you have your center of rotation, to far ahead of your landing gear, which is just pushing the rear gear into the runway and not lifting the nose. Try moving the landing gear in the back of the craft closer to the center of mass, this will help with this issue.\u003C/p\u003E\u003Cp\u003E2- Control surfaces misbehaving.\u003C/p\u003E\u003Cp\u003EAs Kasuha said, control surfaces before the center of mass will act opposite of the ones behind the center of mass. If the wings sit on the center of mass then you will have the control surfaces do interesting things. But you can right click on them and set their actions for what they are. If you need them to control pitch then just click YAW and ROLL, this will leave it just for pitch. \u003C/p\u003E\u003Cp\u003E3-Sounds like a moving CoM issue. As fuel drains the CoM will move.\u003C/p\u003E\u003Cp\u003E4- This is all Kasuha here, he builds shuttles. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}