{"TopicId":58509,"ForumId":32,"TopicTitle":"Why landing on Moho is damn difficult","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-01-01T19:10:32Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-01-01T19:10:32Z","Content":"\n\u003Cp\u003EI made several mission to Moho, all crashed. I have problem with orbital insertions?\u003C/p\u003E\u003Cp\u003ELanding on Eve and Duna is easy i can use their atmospheres to break, but Moho has not atmosphere.\u003C/p\u003E\u003Cp\u003ENow I know why there are so few unmanned mission to Mercury:D\u003C/p\u003E\n"},{"CreatedByName":"GamerMitch","CreatedById":83492,"CreatedDateTime":"2014-01-01T19:13:17Z","Content":"\n\u003Cp\u003EI haven\u0027t tried it yet,so i don\u0027t know.But You made a point with the little to no missions part.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-01-01T19:17:15Z","Content":"\n\u003Cp\u003EMoho is evil. It is the \u003Cem\u003EI Want To Be The Guy\u003C/em\u003E of KSP. If you can so much as land there, you will offically be awesome. And if you can return...\u003C/p\u003E\u003Cp\u003EIt has mostly to do with high inclination and huge Delta V requirements.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-01-01T19:28:11Z","Content":"\n\u003Cp\u003EBraking at Moho is murderous because you\u0027re so close to the Sun; a complete transfer will cost you enormous amounts of fuel but if you catch the right window it can be as little as 4km/s (IIRC).\u003C/p\u003E\n"},{"CreatedByName":"sporkafife","CreatedById":38208,"CreatedDateTime":"2014-01-01T19:37:17Z","Content":"\n\u003Cp\u003EThis may sound a little crazy, and I haven\u0027t tried it so it might be a complete bust, but maybe an ion engine would be good to put a probe into Moho orbit. With the sun so close, you could probably get enough power to run it with the smallest solar panel, so the t/w ratio wouldn\u0027t be too terrible. In fact, I wanna go try it now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-01-01T19:38:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EBraking at Moho is murderous because you\u0027re so close to the Sun; a complete transfer will cost you enormous amounts of fuel but if you catch the right window it can be as little as 4km/s (IIRC).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd it\u0027s like you\u0027re lucky, I recently had a 6000 m / s\u003C/p\u003E\u003Cp\u003EI have tried several times and always I ended fuel just before landing.\u003C/p\u003E\u003Cp\u003EMoho is a demanding planet.\u003C/p\u003E\u003Cp\u003EFortunately, the launch window is once a month.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-01-01T19:42:56Z","Content":"\n\u003Cp\u003E\u003Cem\u003ELanding\u003C/em\u003E on Moho is difficult? Try Tylo... It\u0027s getting there thats hard.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2014-01-01T19:44:09Z","Content":"\n\u003Cp\u003EI found landing on Moho was as easy as landing on Vall. I landed first try with this weird flat landing pad with a rover on top.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CEBmP.png\u0022 alt=\u0022CEBmP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s a better view of the landing platform on the Mun:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/n8vwF.jpg\u0022 alt=\u0022n8vwF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe entire rocket looked like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IQkjD.png\u0022 alt=\u0022IQkjD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn orbit around Moho:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rFzf3.png\u0022 alt=\u0022rFzf3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rover system was also used for Eeloo:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5M9GR.png\u0022 alt=\u00225M9GR.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-01T19:50:15Z\u0022 title=\u002201/01/2014 07:50  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 1, 2014\u003C/time\u003E by Giggleplex777\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-01-01T19:47:23Z","Content":"\n\u003Cp\u003EI\u0027ve landed there easy, manually even, what the deal? The problem is Delta V needed just to get to Moho. I done it by using KSPX ion engines or huge nuclear engine powered mother ship assembled in Kerbin orbit with fuel tanks and nuclear engines sheded on the way to moho, and a small lander and orbital docking. Also a Kethane refueling station on Gilly helps because getting to Gilly by way of Eve is like 1000 m/s less then getting directly back to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2014-01-01T21:31:55Z","Content":"\n\u003Cp\u003ELanding on Moho isn\u0027t difficult, but slowing down enough to get captured in orbit prior to landing is a tad tricky.\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2014-01-01T21:51:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sporkafife\u0022 data-cite=\u0022sporkafife\u0022\u003E\u003Cdiv\u003EThis may sound a little crazy, and I haven\u0027t tried it so it might be a complete bust, but maybe an ion engine would be good to put a probe into Moho orbit. With the sun so close, you could probably get enough power to run it with the smallest solar panel, so the t/w ratio wouldn\u0027t be too terrible. In fact, I wanna go try it now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENah. Those things don\u0027t even have enough power to slow down. You would need to use something with greater push. Unless you slow down an increadable amount before hand. One thing to consider would be to get an obit within Eve and refuel there. That way one can have more fuel as well as less need less to stop with.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2014-01-01T23:02:58Z","Content":"\n\u003Cp\u003EYou can reduce the delta-v needed with a slingshot off Eve. \u003C/p\u003E\u003Cp\u003EAll of my \u0022successful\u0022 Moho missions have ended with a suicide burn and no chance of returning. \u003C/p\u003E\u003Cp\u003EAlso, in response to OP, I don\u0027t think that NASA or any other space agency has used aero-braking to get to Mars or any other planet. Mercury\u0027s lack of atmosphere isn\u0027t the obstacle.\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-01-01T23:08:03Z","Content":"\n\u003Cp\u003EYeah, I know exactly what you mean.\u003C/p\u003E\u003Cp\u003EI just made a Moho-Atempt to complete my Easter Egg Collection with the Moholes.\u003C/p\u003E\u003Cp\u003EMoho is in fact not much bigger than the Mun bit it has 2,7m/sÃ‚Â² Ground Acceleration that is pulling on you, what makes Moho like Duna without an atmosphere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt is not so hard to figure out the correct Burnwindow if you are already in Orbit and you want to land but it is quite hairraising when you are pummeling to the ground with 700m/s \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-01T23:25:31Z\u0022 title=\u002201/01/2014 11:25  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 1, 2014\u003C/time\u003E by MalfunctionM1Ke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-01-01T23:09:33Z","Content":"\n\u003Cp\u003EI have sent a rover to Moho some day in the past.\u003C/p\u003E\u003Cp\u003EHowever, it had used almost entirely the fuel of the transfer stage and could only land near the equator(IIRC, I don,t want to try and discover that it can\u0027t after spending more than 20 minutes just for the circularization burn(not counting the transfer burn))!\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2014-01-01T23:37:18Z","Content":"\n\u003Cp\u003ELanding on Moho isn\u0027t too difficult. Its gravity is only 0.275g, less than twice that of Mun. The challenge is matching its orbit in the first place, given the small intercept window; if your ship doesn\u0027t have much thrust, such as an ion-powered ship, then you simply might not have enough time to do a full deceleration before leaving the sphere of influence.\u003C/p\u003E\u003Cp\u003EHere\u0027s the thing that most people don\u0027t get, though. The amount of delta-V you spend to enter a circular orbit just inside a body\u0027s sphere of influence is just how much you\u0027d have to spend matching its orbit outside that window. So you don\u0027t actually have to wait until the intercept to do your burns; if you were to put yourself into a circular orbit somewhere between Moho and Eve, and then set up the intercept from there, you won\u0027t have to do nearly as much thrusting inside the Moho sphere of influence and the delta-V cost difference will be negligible. Likewise, matching Moho\u0027s orbital inclination is best done out at your solar apoapsis, instead of waiting until you\u0027re inside Moho\u0027s intercept window (which\u0027d be at your solar periapsis), and that can save you quite a bit of thrust.\u003C/p\u003E\u003Cp\u003EAlternately, burn just before the window. If you see Moho is moving at X meters per second, and your speed is approaching Y as you near your solar periapsis, it\u0027s not too hard to figure out how long your burn will have to be and you know it\u0027ll be almost purely a periapsis burn. So, do as much of the thrusting as necessary just before entering Moho\u0027s sphere of influence, and just do the fine-tuning once you see the actual intercept.\u003C/p\u003E\n"},{"CreatedByName":"liweih","CreatedById":62796,"CreatedDateTime":"2014-01-02T00:10:45Z","Content":"\n\u003Cp\u003EJust landing is easy, no more difficult than landing on mun. It was the landing into Mohole that really killing me.\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-01-02T00:11:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022liweih\u0022 data-cite=\u0022liweih\u0022\u003E\u003Cdiv\u003EJust landing is easy, no more difficult than landing on mun. It was the landing into Mohole that really killing me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really would like to see a Picture of it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-01-02T01:15:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spatzimaus\u0022 data-cite=\u0022Spatzimaus\u0022\u003E\u003Cdiv\u003EHere\u0027s the thing that most people don\u0027t get, though. The amount of delta-V you spend to enter a circular orbit just inside a body\u0027s sphere of influence is just how much you\u0027d have to spend matching its orbit outside that window. So you don\u0027t actually have to wait until the intercept to do your burns; if you were to put yourself into a circular orbit somewhere between Moho and Eve, and then set up the intercept from there, you won\u0027t have to do nearly as much thrusting inside the Moho sphere of influence and the delta-V cost difference will be negligible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow, I never thought of that. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"A Fat Pokemon","CreatedById":29245,"CreatedDateTime":"2014-01-02T01:46:34Z","Content":"\n\u003Cp\u003EHeh, Moho was even harder to land on after its initial release, with that atmosphere that would overheat your engines if you had your thrust too high. Oh I miss that atmosphere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"flightmaster","CreatedById":32617,"CreatedDateTime":"2014-01-02T02:11:14Z","Content":"\n\u003Cp\u003EI managed to land a manned science mission on Moho but I had to send a refueler down to be able to get it back to Kerbin, that was an absolute nightmare given that my docking node was on the top of the ship. Without sounding too up-myself I managed to create quite a clever system to refuel, however it was only thanks to Mechjeb that I could fine tune my docking.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2014-01-02T02:22:31Z","Content":"\n\u003Cp\u003EI\u0027ve managed a crewed orbital mission but had to send a tanker to refuel and get home. Had that mission had a lander, I wouldn\u0027t have a had a problem. I\u0027ve also sent a robotic probe lander but of course that wasn\u0027t intended to get home.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1342.photobucket.com/user/LameLefty/media/Moho/screenshot120_zpsd2dc9956.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1342.photobucket.com/albums/o777/LameLefty/Moho/screenshot120_zpsd2dc9956.png\u0022 alt=\u0022screenshot120_zpsd2dc9956.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"viktorserecros","CreatedById":58331,"CreatedDateTime":"2014-01-02T03:13:08Z","Content":"\n\u003Cp\u003EI know it sounds weird, but I found landing on Moho easier than Duna. Now, of course, Duna is an easier intercept, but Duna was a harder landing because I kept wanting parachutes to do more work than possible. Moho\u0027s lack of atmosphere forced me to plan for every single m/s. What surprised me about my trip to Moho was pulling it off in career mode without mods (no mod parts, mechjeb, anything useful beyond mainsails and nukes...)\u003C/p\u003E\u003Cp\u003EI haven\u0027t returned in .23 because I\u0027m going through a \u0022why is everything blowing up?\u0022 phase with rocket design.\u003C/p\u003E\n"},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2014-01-02T08:31:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spatzimaus\u0022 data-cite=\u0022Spatzimaus\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHere\u0027s the thing that most people don\u0027t get, though. The amount of delta-V you spend to enter a circular orbit just inside a body\u0027s sphere of influence is just how much you\u0027d have to spend matching its orbit outside that window. .\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut if you want to enter low Moho orbit, you\u0027ll want to time your burn to happen at Moho periapsis to take advantage of the Oberth Effect. Entering orbit at the SOI is much more expensive.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-02T09:06:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeGoat\u0022 data-cite=\u0022ComradeGoat\u0022\u003E\u003Cdiv\u003EBut if you want to enter low Moho orbit, you\u0027ll want to time your burn to happen at Moho periapsis to take advantage of the Oberth Effect. Entering orbit at the SOI is much more expensive.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s of course true, but Moho\u0027s Oberth effect is rather weak, much less than on Kerbin.\u003C/p\u003E\u003Cp\u003EAlso in all my Moho missions, I had to start the decelerating burn some three Moho diameters before the periapsis or I\u0027d overshoot. If the Oberth effect is weak near the surface, it\u0027s almost negligible at that distance.\u003C/p\u003E\u003Cp\u003ETrue, my ship did not have too much TWR.\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-01-02T09:08:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aragosnat\u0022 data-cite=\u0022Aragosnat\u0022\u003E\u003Cdiv\u003ENah. Those things don\u0027t even have enough power to slow down. You would need to use something with greater push. Unless you slow down an increadable amount before hand. One thing to consider would be to get an obit within Eve and refuel there. That way one can have more fuel as well as less need less to stop with.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, I did that once! It\u0027s certainly possible, but it should be noted that I first had to use most of my fuel for getting Moho to fling the probe into an orbit that would give it a cheaper, second encounter later.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/6/65/Moho_flyby.png\u0022 alt=\u0022Moho_flyby.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-02T09:27:37Z\u0022 title=\u002201/02/2014 09:27  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 2, 2014\u003C/time\u003E by Felsmak\u003C/strong\u003E\n\u003C/span\u003E\n"}]}