{"TopicId":58575,"ForumId":16,"TopicTitle":"Dumb question","CreatedByName":"Burnsy5","CreatedById":99528,"CreatedDateTime":"2014-01-02T04:21:22Z","PageNum":1,"Articles":[{"CreatedByName":"Burnsy5","CreatedById":99528,"CreatedDateTime":"2014-01-02T04:21:22Z","Content":"\n\u003Cp\u003EI am trying to land on Ike. Twice now I got an encounter with Duna but when I get into the orange line instead of getting a periphrasis to retro burn away from to create an obit around duna, I have no peri, I am headed for a collision course with Duna, I could land on it but I want to land on the moon. I have an f5 save of my second attempt, is there any way to make a collision course an orbit?\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-01-02T05:04:00Z","Content":"\n\u003Cp\u003EThe moment that you cross into Duna\u0027s SOI you want to create a maneuver node and then play with the up/down and left-right axis (blue and pink ones). You\u0027ll find that you can raise your Pe out of Duna to an orbital height. If you do it as soon as you enter the SOI it will be more dV efficient. With Duna you might want to set the Pe pretty low into the atmo (round 8-10km) so you can aero brake into orbit without needing to do a retrograde burn (exact height is best found with a few trial and error runs). \u003C/p\u003E\u003Cp\u003EThen once you\u0027re in Duna\u0027s orbit you can set up a maneuver for the transfer to Ike, set Ike as a your target and then the green ascending and descending nodes will help you pick the right place to set the maneuver node up. Hope that helps.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-02T07:39:10Z","Content":"\n\u003Cp\u003EIf you enter/exit a SOI at too high time warp, your trajectory after crossing the boundary may change. It\u0027s always recommended to cross SOI boundaries at low time warp.\u003C/p\u003E\u003Cp\u003ERefining the trajectory at the target SOI is possible both after you entered the SOI and long before that while you\u0027re still in interplanetary space or even in your launch SOI. The latter usually requires way less fuel to have the same effect but to see details about the trajectory, it\u0027s usually necessary to have CONIC_PATCH_DRAW_MODE = 0 set up in settings.cfg because it allows viewing the trajectory in target SOI by zooming on it.\u003C/p\u003E\u003Cp\u003EEven though you\u0027re visiting Ike, you may save some fuel by aerobraking in Duna atmosphere, then raising your orbit to encounter the moon. To aerobrake, you need to set your periapsis to about 13 km. It\u0027s a good idea to quicksave at safe distance before you attempt aerobraking.\u003C/p\u003E\n"},{"CreatedByName":"biohazard15","CreatedById":91655,"CreatedDateTime":"2014-01-02T09:19:00Z","Content":"\n\u003Cp\u003EFirstly, aerobrake as stated above, try to aim your Ap at Ike\u0027s orbit. Don\u0027t forget to retract all extended solar panels.\u003C/p\u003E\u003Cp\u003EIf you have a good inclination, you may get lucky and get caught by Ike\u0027s SOI on the first attempt; if not, raise your Pe just above Duna\u0027s atmosphere (42 km), correct your orbit if needed and wait for Ike.\u003C/p\u003E\n"}]}