{"TopicId":58809,"ForumId":55,"TopicTitle":"Fixing Science III: The Discussion Thread that tries to find films I and II","CreatedByName":"datubaman","CreatedById":59494,"CreatedDateTime":"2014-01-04T02:21:24Z","PageNum":1,"Articles":[{"CreatedByName":"datubaman","CreatedById":59494,"CreatedDateTime":"2014-01-04T02:21:24Z","Content":"\n\u003Cp\u003EIt seems that a lot of us here are still unsatisfied by how the current science system works, but aren\u0027t doing a lot of talking to each other to try and figure out how we can fix it. Well, let\u0027s start talking...how can it be fixed?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-01-04T07:55:21Z","Content":"\n\u003Cp\u003EWell, if you\u0027re going to start a discussion, you should probably begin with exactly what you think is wrong with it. There\u0027s already a thread on how it\u0027s too grindy, so you might want to find something else you think is wrong with it. You can\u0027t discuss a solution without a clear problem statement. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-01-04T13:10:17Z","Content":"\n\u003Cp\u003EThere isn\u0027t enough for kerbals and probes to do. Imagine a robotic scoop, A spectrometer, a scale even. With enhanced IVA imagine moving around the science labs, using various instruments to construct an image of what happened to that particular sample and to deciphering its chemical composition. The spectrometer would be a notebook containing all of the various chemical indicators, and an actual spectrometer that would give you the results but YOU would have to decide the soils chemical makeup. The same may be true for probes imagine uploading your results back to KASA, where chemists (the player) would decipher the chemical make up of soil, but the wouldn\u0027t be certain until a manned mission confirmed the data or a sample has been returned.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2014-01-04T21:04:09Z","Content":"\n\u003Cp\u003EBecause science still isn\u0027t actually \u0027doing\u0027 anything. You push a button. Receive bacon. You ran out of bacon? Buy a new thing you can get more button-pushes and bacon with. Ooo, such excitement.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-01-04T21:22:12Z","Content":"\n\u003Cp\u003EMy main problems with the science system are as follows:\u003C/p\u003E\u003Cp\u003E-Not enough experiments to do: There are six. Only four of those are really sized to go on probes, and most planets don\u0027t need one of them. I\u0027d love to be able to see about twice as many, used in different areas for different things. \u003C/p\u003E\u003Cp\u003E-Transmission. Full stop. in the first version it\u0027s exclusively useful, in the new one its almost entirely useless. There need to be experiments which are designed to be transmitted (the temperature, the barometer, etc.), and some which need to be returned.\u003C/p\u003E\u003Cp\u003E-Unlocks: The tech tree is... confusing. Makes little sense (how the hell do we unlock the \u0027Mainsail\u0027s little brother\u0027 before the ACTUAL mainsail?!), and quite a few of the science bits are unlocked way too late unless you rush for them.\u003C/p\u003E\u003Cp\u003E-Science lab: It\u0027s a step in the right direction, but... Sheesh. There are KERBALS ON IT. If we want to get them home, there is currently NO reason to use it!\u003C/p\u003E\u003Cp\u003E-The thing is... I mean, there\u0027s no challenge to it. Like Frost said, push button, receive bacon.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-01-04T21:57:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003E-Science lab: It\u0027s a step in the right direction, but... Sheesh. There are KERBALS ON IT. If we want to get them home, there is currently NO reason to use it!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64665-Look-here%21-I-found-a-use-for-the-lab%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/64665-Look-here%21-I-found-a-use-for-the-lab%21\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat is all.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-01-04T23:25:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64665-Look-here%21-I-found-a-use-for-the-lab%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/64665-Look-here%21-I-found-a-use-for-the-lab%21\u003C/a\u003E\u003Cp\u003EThat is all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, let me rephrase. \u003C/p\u003E\u003Cp\u003EThe lab has two functions. One of which is utterly useless, and the other is a fix to a fix to try and fix the brokenness of the first iteration.\u003C/p\u003E\u003Cp\u003EWhoop de do.\u003C/p\u003E\n"},{"CreatedByName":"jerkypenguin","CreatedById":99919,"CreatedDateTime":"2014-01-05T01:56:30Z","Content":"\n\u003Cp\u003EI love this game. The career mode is awesome - makes you work for the good parts, but the science has reached a point where it makes far more sense to send un-kerballed probes everywhere ( I can pull 1-2x unmanned versus manned with lower resource requirements). Then revisit with kerbals and get like 20 science. How is that cool? Disappointing. I had to make the mun my mistress with unmanned probes to get enough science to get a kerbal there. Great! Now if I send a kerbal, it\u0027s just for sight seeing. \u003C/p\u003E\u003Cp\u003EI think most of the excitement around this game is the idea of manned spacefilght. If I was wrong, NASA\u0027s unmanned plans would get much more public excitement.\u003C/p\u003E\u003Cp\u003ESending kerbals somewhere should be worth far more - it certainly is worth more effort. \u003C/p\u003E\u003Cp\u003EAgain - great game - and I do understand that science is heavily in the works. I shouldn\u0027t have to return with a LEM from Duna to get 3x the science though. (and yes I know science transfer/lab argument - weak).\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-01-05T03:10:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jerkypenguin\u0022 data-cite=\u0022jerkypenguin\u0022\u003E\u003Cdiv\u003E...but the science has reached a point where it makes far more sense to send un-kerballed probes everywhere ( I can pull 1-2x unmanned versus manned with lower resource requirements). Then revisit with kerbals and get like 20 science. How is that cool?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that might be part of the problem. Right now, the only things that NEED a kerbal are EVA and surface samples (the crew report, bizarrely, just needs a seat). Everything else overlaps. It doesn\u0027t help that those two aren\u0027t terribly valuable as far as effort goes.\u003C/p\u003E\n"}]}