{"TopicId":58807,"ForumId":44,"TopicTitle":"If the Apollo computers were less powerful than my phone...","CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-01-04T01:51:40Z","PageNum":1,"Articles":[{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-01-04T01:51:40Z","Content":"\n\u003Cp\u003E...then does that mean, with the right program, I could theoretically run a moon landing with my smartphone? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt blows my mind that this is true. I would love to be able to go back to \u002769 and just plug in my phone or something at Mission Control, while everyone is staring at me like I\u0027m an alien, then I just go on and sit in a swivel chair, running the show myself with the calculator-size device in my hand.\u003C/p\u003E\u003Cp\u003EFurthermore, how much do you think the app would cost that let you run an \u003Cem\u003Eactual\u003C/em\u003E moon landing? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-01-04T01:59:46Z","Content":"\n\u003Cp\u003EYeah. As I pointed out in another thread, you can install Octave on an Android phone. That software is more than capable of doing all the computations you need to do a Moon landing.\u003C/p\u003E\u003Cp\u003EP.S., it\u0027s free. So that should answer your other question. Of course, you\u0027d still need someone with knowledge and experience to actually run the computations.\u003C/p\u003E\n"},{"CreatedByName":"Maxwell Comp","CreatedById":85545,"CreatedDateTime":"2014-01-04T07:17:56Z","Content":"\n\u003Cp\u003EYou probably could.\u003C/p\u003E\u003Cp\u003EThe computers used by Apollo were very specialized, whereas your phone has a general-purpose CPU. Your phone can do much, much more because integrated circuits have advanced tremendously.\u003C/p\u003E\n"},{"CreatedByName":"Kerbin Dallas Multipass","CreatedById":79477,"CreatedDateTime":"2014-01-04T11:12:10Z","Content":"\n\u003Cp\u003EIf you\u0027re really cool you install Minecraft on your smartphone and build the Apollo computer with redstone...\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-01-04T11:50:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbin Dallas Multipass\u0022 data-cite=\u0022Kerbin Dallas Multipass\u0022\u003E\u003Cdiv\u003EIf you\u0027re really cool you install Minecraft on your smartphone and build the Apollo computer with redstone...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could, but it wouldn\u0027t be fast enough to run a moon landing in real time. The Apollo guidance computer ran about 2 MHz while a redstone state switch takes 0.1 seconds. The fastest redstone CPU I\u0027ve ever managed to build ran at 0.71Hz and used a 2 stage pipeline (So branching took almost 3 seconds). Fastest redstone CPU I know of ran at 10 ticks (about 1Hz). So a redstone computer would be about 6 orders of magnitude too slow to land on the moon. Not to mention that it is going to be very hard to make 2048 RAM slots without losing too much ticks to addressing and data retrieval.\u003C/p\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2014-01-04T11:55:58Z","Content":"\n\u003Cp\u003EThere are some online simulators of the Apollo Guidance Computer, it\u0027s fun to play around with these:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://svtsim.com/moonjs/agc.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://svtsim.com/moonjs/agc.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://apollo.spaceborn.dk/dsky-sim.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://apollo.spaceborn.dk/dsky-sim.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2014-01-04T15:19:52Z","Content":"\n\u003Cp\u003EWell, as far as I know Octave is the FOSS alternative to Matlab right? So it means that this: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36476-WIN-KSP-Trajectory-Optimization-Tool-v0-10-Now-with-Rendezvous-Planner%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/36476-WIN-KSP-Trajectory-Optimization-Tool-v0-10-Now-with-Rendezvous-Planner%21\u003C/a\u003E could be theoretically ported to Octave, right? The only problem is to somehow connect your smartphone to the propulsion control and RCS\u003C/p\u003E\n"},{"CreatedByName":"Kerbin Dallas Multipass","CreatedById":79477,"CreatedDateTime":"2014-01-04T19:44:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EYou could, but it wouldn\u0027t be fast enough to run a moon landing in real time. The Apollo guidance computer ran about 2 MHz while a redstone state switch takes 0.1 seconds. The fastest redstone CPU I\u0027ve ever managed to build ran at 0.71Hz and used a 2 stage pipeline (So branching took almost 3 seconds). Fastest redstone CPU I know of ran at 10 ticks (about 1Hz). So a redstone computer would be about 6 orders of magnitude too slow to land on the moon. Not to mention that it is going to be very hard to make 2048 RAM slots without losing too much ticks to addressing and data retrieval.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, you\u0027re saying my idea is impractical?\u003C/p\u003E\u003Cp\u003EDamn! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-04T20:01:34Z","Content":"\n\u003Cp\u003Eyou could probibly land on the moon with a modern microcontroller. like the avr in an arduino. with just an imu, rtc, lcd, and a small keypad.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-01-04T21:27:34Z","Content":"\n\u003Cp\u003EA smartphone has the computing power of a year 2000 desktop pc or better, the Apollo computer was pre-computer era. \u003C/p\u003E\u003Cp\u003ESo it\u0027s hardly a surprise that a smartphone can do what the Apollo computer can do.\u003C/p\u003E\u003Cp\u003EI learned from watching \u0022Moon Machines - The Navigation Computer\u0022 that most navigation calculations where done by computers at mission control, not by the Apollo computer. And perhaps the juciest detail: the software was not written but woven with copper wire and ferrite beads. They didn\u0027t just write machine code, they wrote it with hardware. How\u0027s that for \u0022close to the metal\u0022. Also it took a government-issued fixer to get NASA to take that whole software thing serious (bug fixing, code re-use, project management).\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/vU5G9VsoER8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-01-04T21:48:01Z","Content":"\n\u003Cp\u003EEveryone is ignoring one crucial problem: You can\u0027t just plug an iPad into the Apollo LM, because one was made in 1969 and the other was made in 2010. They would not be able to communicate with each other. It\u0027s like trying to stick a cube into a round hole.\u003C/p\u003E\u003Cp\u003EIf you built a new ship to run off the iPad, though, that\u0027s another story.\u003C/p\u003E\n"},{"CreatedByName":"ThatKerbal","CreatedById":98809,"CreatedDateTime":"2014-01-04T22:00:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EYou could, but it wouldn\u0027t be fast enough to run a moon landing in real time. The Apollo guidance computer ran about 2 MHz while a redstone state switch takes 0.1 seconds. The fastest redstone CPU I\u0027ve ever managed to build ran at 0.71Hz and used a 2 stage pipeline (So branching took almost 3 seconds). Fastest redstone CPU I know of ran at 10 ticks (about 1Hz). So a redstone computer would be about 6 orders of magnitude too slow to land on the moon. Not to mention that it is going to be very hard to make 2048 RAM slots without losing too much ticks to addressing and data retrieval.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEh...Your telling me one right click (dont know phone controls) aiming at a lever with your crosshair and flipping it isn\u0027t faster than the apollo computer\u0027s speed...? If that\u0027s true, I don\u0027t know what world we\u0027ve come to. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-01-04T22:05:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThey would not be able to communicate with each other. It\u0027s like trying to stick a cube into a round hole.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI seem to remember a certain Apollo mission that had just this problem.\u003C/p\u003E\u003Cp\u003E But yes, what you say is true. However, if you had to I\u0027m sure you could jury rig something to get them working together. The real problem is whether you\u0027re doing it here on Earth or in an emergency situation on-board.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-01-04T22:10:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EIf you built a new ship to run off the iPad, though, that\u0027s another story.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe OP\u0027s question was obviously not meant to be literal... If you did want to deal with the logistics of interfacing an iPad or other such device with the old hardware, it would be a lot easier to build and certify an electrical interface to the existing equipment than it would to design and build an entirely new ship around a modern hand-held computer.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2014-01-04T22:31:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EEveryone is ignoring one crucial problem: You can\u0027t just plug an iPad into the Apollo LM, because one was made in 1969 and the other was made in 2010. They would not be able to communicate with each other. It\u0027s like trying to stick a cube into a round hole.\u003Cp\u003EIf you built a new ship to run off the iPad, though, that\u0027s another story.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EAll you would need is an USB \u0026lt; - \u0026gt;parallel analog IO and plug it through voltage adapters to instrument analog output on one side and actuator/valve control input on the other. You would of course need to know the wiring and what signals you need to send/receive, but that\u0027s it. the rest could be done in software.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-01-04T23:09:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EEveryone is ignoring one crucial problem: You can\u0027t just plug an iPad into the Apollo LM, because one was made in 1969 and the other was made in 2010.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027ve obviously never watched Iron Sky.\u003C/p\u003E\u003Cp\u003E(It\u0027s on Netflix, by the way. I highly recommend.)\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2014-01-04T23:22:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aghanim\u0022 data-cite=\u0022Aghanim\u0022\u003E\u003Cdiv\u003EWell, as far as I know Octave is the FOSS alternative to Matlab right? So it means that this: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36476-WIN-KSP-Trajectory-Optimization-Tool-v0-10-Now-with-Rendezvous-Planner%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/36476-WIN-KSP-Trajectory-Optimization-Tool-v0-10-Now-with-Rendezvous-Planner%21\u003C/a\u003E could be theoretically ported to Octave, right? The only problem is to somehow connect your smartphone to the propulsion control and RCS\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, Octave is designed to be mostly compatible with Matlab. But it\u0027s lacking all of the specialized toolboxes, GUI programming, and many other features that essentially any nontrivial Matlab program (such as KSP-TOT) relies on. I suspect KSP-TOT would be easier to port to Python than to Octave, since you can find open-source functional replacements for most of the proprietary Mathworks toolboxes more easily in Python than in Octave. Not to mention performance, size of user-base, online resources, etc... generally you only use Octave if you\u0027re already very attached to Matlab.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-01-04T23:42:51Z","Content":"\n\u003Cp\u003EHm. It might not be so bad. I used to do a lot of code in Matlab, but switched over to Octave in the past few years. I can take a look at it. If it\u0027s just the GUI stuff, it might not be so hard to port.\u003C/p\u003E\u003Cp\u003EEdit: Nope, never mind. These .fig files would be a nightmare to try and port.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-05T00:13:56Z\u0022 title=\u002201/05/2014 12:13  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 5, 2014\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2014-01-05T00:34:11Z","Content":"\n\u003Cp\u003EIt\u0027s not just the GUI stuff, it\u0027s also optimization toolbox, global opt toolbox, several others. You\u0027re also screwed if you ever use classdef-style object oriented programming, which has been in Matlab since 2008 or so but still isn\u0027t released in Octave (I think someone might be working on it in a dev branch somewhere?). Don\u0027t think KSP-TOT needs this, but the toolboxes and GUI are a pain.\u003C/p\u003E\u003Cp\u003EFor a more actively-developed open-source alternative to Matlab (not source-compatible, but with maybe a little more similarity than Python) you can look at Julia. It\u0027s much newer than Python or Octave, has a smaller community (so fewer packages available) than Python but bigger than Octave, and does a lot of fancy stuff with just-in-time compilation so Julia code runs much faster than Python (even PyPy in most cases).\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-01-05T01:17:00Z","Content":"\n\u003Cp\u003EApparently, WinE is being developed for ARM Android. That might be an option for running KSP-TOT along with MCR on an Android device. It won\u0027t be fast, though.\u003C/p\u003E\n"},{"CreatedByName":"longhornchris","CreatedById":70974,"CreatedDateTime":"2014-01-05T01:35:13Z","Content":"\n\u003Cp\u003EWhile the average smart phone is more than capable of doing the math and IO necessary to operate the entire Apollo mission (including the Saturn V launch sequence which had its own computer in the IMU ring) - you would need some sort of IO card to hook in all the sensors, but there\u0027s an excess of CPU power.\u003C/p\u003E\u003Cp\u003EFor reference, the Curiosity rover uses a RAD750 (\u003Ca href=\u0022https://en.wikipedia.org/wiki/RAD750\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/RAD750\u003C/a\u003E), though technically it has 2 with one as a backup. The RAD750 is based on the PowerPC750 that was used in Macs back in the late 90s and generally runs slower (clock speed) than the PPC chips that were common back in the day. Now, if you are asking yourself \u0027Why would NASA use such an antiquated computer?\u0027 the reason is the RAD750 is rad-hard. Your smartphone isn\u0027t.\u003C/p\u003E\u003Cp\u003EDue to the nature of making radiation hard electronics (physics, engineering, and cost) the RAD750 is the current \u0027state of the art\u0027 even though it is 15-20 years behind current terrestrial computers. Put another way the RAD750 can do ~400MIPS, the latest Intel i7 can do ~125,000MIPS (or ~125BIPS). An ARM A7 (reasonable smartphone processor) can do 2850MIPS. While MIPS aren\u0027t the end-all in CPU metrics, they are a decent comparison given the vastly different architectures.\u003C/p\u003E\u003Cp\u003ESo, while the ARM based computer in your smartphone can run circles around the computer in Curiosity, radiation upsets would cause hell with the processing do to bit flips... and there\u0027s a high likelihood of radiation induced latch-ups that will destroy the processor elements.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-01-05T02:35:43Z","Content":"\n\u003Cp\u003ENobody has brought up the most crucial part of this: Computers were important to the Apollo program, but not even NEARLY the most important part. Columbus didn\u0027t even have a computer! I could use my smart phone to sail a ship across the Atlantic!\u003C/p\u003E\u003Cp\u003EApollo was full of the best computers on Earth in the brains of the people running the program and working those (actual) computers. They weren\u0027t saying, \u0022Siri, give me directions to the Moon.\u0022 They were calculating the things KSP does for us, by hand on paper, and entering numbers into the computers that were running software that they (or someone as smart as they) wrote themselves, and then writing that result down on another piece of paper and going to tell Neil and Co that they needed to thrust so far in such a direction in about this amount of time.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-01-05T02:58:49Z","Content":"\n\u003Cp\u003EThat reminds me of a quote by Wernher von Braun that went something along the lines of:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wernher von Braun\u0022 data-cite=\u0022Wernher von Braun\u0022\u003E\u003Cdiv\u003EMan is the best computer we can put aboard a spacecraft... and the only one that can be mass-produced with unskilled labor. \u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-05T03:04:07Z\u0022 title=\u002201/05/2014 03:04  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 5, 2014\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003Cbr\u003EFixed a spelling mistake\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-05T10:28:55Z","Content":"\n\u003Cp\u003EOne of the difficulties in trying to compare Apollo computers to modern ones and say \u0022oh how did they do so much with so little?\u0022 is that there\u0027s a lot of apples and oranges comparison going on given that the Apollo computers were NOT general purpose do-anything processors accessing general-purpose do-anything RAM. When you make a generic \u0022computer\u0022 that\u0027s not hardwired to specific tasks the burden is on the software to do all the heavy lifting. When you make a very specific one-purpose computer that DOES have a lot of things hardwired to specific tasks because it was designed in an era a little bit prior to the prevalence of \u0027general\u0027 do-anything sorts of computers, a large portion of that burden is moved from the software out to the \u0022peripherals\u0022 so to speak.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-01-05T21:03:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003E It\u0027s like trying to stick a cube into a round hole.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can make an adapter for that out of duct tape, a piece of plastic, a piece of cardboard, and an old sock!\u003C/p\u003E\u003Cp\u003E(Gold star for whoever can name whom I\u0027m quoting! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E)\u003C/p\u003E\n"}]}