{"TopicId":58960,"ForumId":55,"TopicTitle":"About Kerbals","CreatedByName":"Nimja","CreatedById":100011,"CreatedDateTime":"2014-01-05T16:44:06Z","PageNum":1,"Articles":[{"CreatedByName":"Nimja","CreatedById":100011,"CreatedDateTime":"2014-01-05T16:44:06Z","Content":"\n\u003Cp\u003EThe Kerbalnaughts have their 2 stats: Bravery and Stupidity. Firstly, after running a few missions, surely they should become braver and smarter? mine don\u0027t seem to do so.\u003C/p\u003E\u003Cp\u003EI also run into the problem of my Kerbals not hanging onto the pods. Could there be a Strength stat to determine how well they can hang on for dear life?\u003C/p\u003E\u003Cp\u003EThank you in advance.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-01-05T17:10:02Z","Content":"\n\u003Cp\u003EFirst of all, Courage and stupidity do almost nothing. It affects the facial expressions ever so slightly, but nothing else.\u003C/p\u003E\u003Cp\u003EAlso, if they don\u0027t hold on, don\u0027t let them out of the pod! Do you see astronauts hangin on the outside of a Soyuz during a launch?\u003C/p\u003E\n"},{"CreatedByName":"TheBadAstronomer","CreatedById":89508,"CreatedDateTime":"2014-01-05T18:24:57Z","Content":"\n\u003Cp\u003EThere\u0027s also a Bads setting, which determines how well they deal with missions(Jeb has Bads enabled). If you\u0027re having trouble hanging on to the side, try sticking a chair on your craft. They will stay in place.\u003C/p\u003E\n"},{"CreatedByName":"Nimja","CreatedById":100011,"CreatedDateTime":"2014-01-05T19:53:49Z","Content":"\n\u003Cp\u003EI mean, Its annoying if you just let them out for a second for EVA reports, and Boom! your stranded. Where is this \u0022Bads\u0022 setting. I would also like to add, what does the uniform color do?\u003C/p\u003E\n"},{"CreatedByName":"TheBadAstronomer","CreatedById":89508,"CreatedDateTime":"2014-01-06T12:44:42Z","Content":"\n\u003Cp\u003EI see what you mean, although I\u0027m not sure how to keep them on the craft. About said BadS setting:There\u0027s a wiki page \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/How_to:_Name_your_Kerbals!\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E if you want to change any aspects of your kerbal, including the BadS setting. Simply follow the instructions, and you\u0027ll be good to go! To be honest, the orange suits don\u0027t mean anything. The only thing they represent is Jebediah, Bill, and Bob, because they were the original crew way back in the early versions of the game.\u003C/p\u003E\u003Cp\u003EI hope this answers your questions. I\u0027m glad to help!\u003C/p\u003E\n"},{"CreatedByName":"Nimja","CreatedById":100011,"CreatedDateTime":"2014-01-06T15:04:43Z","Content":"\n\u003Cp\u003EThanks you.\u003C/p\u003E\n"}]}