{"TopicId":59024,"ForumId":35,"TopicTitle":"[All OS][Java][0.2.19] DataSwitcher- Instance Manager","CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-01-06T02:24:10Z","PageNum":1,"Articles":[{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-01-06T02:24:10Z","Content":"\n\u003Cp\u003E\nDataSwitcher is a Java program for every OS that allows you to have multiple instances of KSP (currently just the folders). How is this useful? It allows for multiple sets of mod installations that you can quickly and easily change between. For example, say you regularly swap between playing stock and playing with a bunch of mods, but occasionally you play on a KMP server. Each time you want to change between them you have to either copy GameData folders that you\u0027ve backed up or you have to delete/reinstall the mods. With DataSwitcher it\u0027s as easy as selecting the instance from a list and pressing Activate!\n\u003C/p\u003E\n\u003Cp\u003E\nI made DataSwitcher because I needed it for that very reason. I had previously written a batch script to handle my multiple mod sets, but it wasn\u0027t easily expandable if I wanted to add another. DataSwitcher is written so you can have as many instances as you would like, can add more quickly and easily, and can swap between them with ease.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t want to reinstall all your mods when you try DataSwitcher? Don\u0027t! The new version lets you import any folder into newly created instances on a per-instance setting! You\u0027ve got nothing to lose by trying it out. Though, make sure to remove the instance if you decide not to use DataSwitcher anymore (or copy the folders back to the KSP folder) as the newest versions use symbolic links.\n\u003C/p\u003E\n\u003Cp\u003E\n(Probable) FAQ:\n\u003C/p\u003E\n\u003Cp\u003E\nQ: What is DataSwitcher?\n\u003C/p\u003E\n\u003Cp\u003E\nA: An application to manage multiple folders for different sets of mod installs.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: Why Java? Java is slow and bulky and annoying and nobody likes it.\n\u003C/p\u003E\n\u003Cp\u003E\nA: Because it\u0027s multi-platform and I know it better than C\u002B\u002B (thanks to playing around with Minecraft modding).\n\u003C/p\u003E\n\u003Cp\u003E\nQ: Will this run on (Linux, Mac OS, a toaster)?\n\u003C/p\u003E\n\u003Cp\u003E\nA: It has been tested on Windows and Linux, but is written primarily on Windows. It should run on anything that runs Java.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: Isn\u0027t this just like [insert addon/program] but lacks 98% of the features?\n\u003C/p\u003E\n\u003Cp\u003E\nA: Maybe, I\u0027ve never used any mod managers or anything like that for KSP. I wrote this because I needed it and thought it would be fun/a good learning experience. I uploaded it for others to use in case they also wanted a tool like this, and to possibly learn from my source code.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: Can I view the source/fork this?\n\u003C/p\u003E\n\u003Cp\u003E\nA: Yes, DataSwitcher is open source and I am allowing forks without asking, as long as I receive attribution. To view the official license (Creative Commons Attribution-ShareAlike 4.0 International) click here: \u003Ca href=\u0022http://creativecommons.org/licenses/by-sa/4.0/legalcode\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://creativecommons.org/licenses/by-sa/4.0/legalcode\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nQ: Where is the source?\n\u003C/p\u003E\n\u003Cp\u003E\nA: \u003Ca href=\u0022http://magico13.net/svn/DataSwitcher\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://magico13.net/svn/DataSwitcher\u003C/a\u003E should have the latest up-to-date source code, otherwise each release I will try to include the source. That link is an SVN repository, and can be checked out just like any other svn repository (using tortoisesvn, or the subversion client in linux)\n\u003C/p\u003E\n\u003Cp\u003E\nQ: I looked at the source, this is not written all that well. What gives?\n\u003C/p\u003E\n\u003Cp\u003E\nA: I have never been formally trained in programming, so it\u0027s all self-taught. As a result, I\u0027m not the most efficient or even that good at programming. But it\u0027s fun to do, and when I\u0027ve got the need for something I can usually write something functional.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: I found a bug! How can I report it?\n\u003C/p\u003E\n\u003Cp\u003E\nA: Probably here on the forum is easiest. I can\u0027t promise to get to it right away, but I will try. Send me the log.txt file that gets created and let me know exactly what you were doing when the bug popped up.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: What else are you planning on doing with this?\n\u003C/p\u003E\n\u003Cp\u003E\nA: I\u0027d like to allow full KSP instances to exist, so you can run multiple versions. Also, save game backing up would be good. I will primarily make changes based on what I need/want, but please offer up your suggestions!\n\u003C/p\u003E\n\u003Cp\u003E\nQ: Where does this place the instances/settings.cfg/log.txt?\n\u003C/p\u003E\n\u003Cp\u003E\nA: As of 0.1.10, in the DataSwitcher folder that gets created in the same folder as the executable. Previously it was in ${HOME}/DataSwitcher\n\u003C/p\u003E\n\u003Cp\u003E\nQ: My instance didn\u0027t load into the list when I started DataSwitcher? What gives?\n\u003C/p\u003E\n\u003Cp\u003E\nA: Check the log.txt! Did you use an illegal character in the name? ; \\ / are all forbidden (probably more), but it doesn\u0027t actually prevent you from using them in the name. If it\u0027s a semi-colon, open the settings.cfg.bak file in notepad and remove the extra ; between the instance name and the game path. Then rename the instance folder to not include the semi-colon and rename settings.cfg.bak to settings.cfg. It should work now.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: What does each button do again?\n\u003C/p\u003E\n\u003Cp\u003E\nA: The \u0022\u002B\u0022 opens the create new instance dialog, the \u0022-\u0022 deletes the currently selected instance, and the \u0022Activate\u0022 button will apply the current instance to the KSP install.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: How can I select multiple folders to import? How about viewing what folders I have selected?\n\u003C/p\u003E\n\u003Cp\u003E\nA: Use the control (ctrl) or shift keys to select multiple files/folders. You can view the current selected ones by hovering your mouse over the \u0022Select Items to Import\u0022 button.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: So I can import any file or folder? Even saves and KSP.exe?\n\u003C/p\u003E\n\u003Cp\u003E\nA: Yes. However, as of 0.2.16 importing KSP.exe or Launcher.exe won\u0027t allow the game to run (not sure why yet). If you import the saves folder, DO NOT USE FALLBACK MODE or you will lose information. You can tell if fallback mode is active by checking the settings.cfg or seeing if there\u0027s an arrow on the icon for the folders in the Kerbal Space Program folder (steam/SteamApps/common/Kerbal Space Program for steam installs). If you don\u0027t want conflicts, every instance should have the same files and folders, if not then switching from one to another may leave links to instances that aren\u0027t supposed to be active (which may be useful somehow).\n\u003C/p\u003E\n\u003Cp\u003E\nQ: What is Fallback Mode and why does it suck?\n\u003C/p\u003E\n\u003Cp\u003E\nA: The normal mode of operation uses symbolic links to reduce the amount of time and space required when activating an instance. As a happy side effect, any changes the game makes to these folders are actually made to the instance (such as saving the game). Fallback mode is for when the system doesn\u0027t support symbolic links or the user is not running as an Administrator. It works by copying the folders directly, which works great for things like the GameData folder as long as no mods or the game make changes to the folder. The instance will not know that changes were made, and so when the instance is changed the changes will be overwritten (in the case of the saves folder, all progress since the instance was created will be lost). In the future I want to try to fix this issue, but in the meantime don\u0027t use fallback mode unless you absolutely have to. If you get the message about insufficient privileges, simply exit and right click DataSwitcher-0.x.y.jar and click \u0022Run as administrator\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: I enabled Fallback Mode and want to disable it!\n\u003C/p\u003E\n\u003Cp\u003E\nA: Locate the settings.cfg file in the DataSwitcher folder. Open it with wordpad/notepad/etc. and change \u0022FallbackMode;true\u0022 to \u0022FallbackMode;false\u0022. Start DataSwitcher and you\u0027re done.\n\u003C/p\u003E\n\u003Cp\u003E\nQ: I told an instance to Always/Never autostart the game and want to change it!\n\u003C/p\u003E\n\u003Cp\u003E\nA: Locate the instances.txt file in the DataSwitcher folder. Open it with wordpad/notepad/etc. and find the name of the instance you want to change. At the very end of the line is a number, it controls the default action for launching the game. 0 means \u0027ask\u0027, 1 means \u0027always\u0027, and 2 means \u0027never\u0027. Change it appropriately (it is always safe to set it to 0 and make the selection from the popup)\n\u003C/p\u003E\n\u003Cp\u003E\nQ: Alright, I\u0027m interested. \u003Cstrong\u003ESo, how do I use this?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA: Simple! Run it (might require java 7), then click the \u0022\u002B\u0022 to add a new instance. You will have to enter a name for the instance and browse to the \u0022Kerbal Space Program\u0022 folder. For steam on Windows and Linux it should autodetect the folder (if anyone knows the Mac steam folder let me know what it is!). The path is saved per instance, not globally. You can optionally import existing folders into the new instance (I highly suggest selecting at least the GameData folder!). Locate the newly made folder and merge the stock GameData folder into the GameData folder located in the instance (already complete if you import it). Add mods into the instance GameData folder as desired. Then press the \u0022Activate\u0022 button with the new instance selected and it will replace the folders in the game directory with the ones in the instance. You can have multiple instances and they won\u0027t interfere with each other.\n\u003C/p\u003E\n\u003Cp\u003E\nPictures (v0.0.1.6), slightly outdated but the GUI is mostly the same:\n\u003C/p\u003E\n\u003Cblockquote lang=\u0022en\u0022\u003E\n\u003Ca href=\u0022//imgur.com/a/BaXhT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWarning:\u003C/strong\u003E This tool manipulates files and folders on your computer and so there is a possibility for data loss. I HIGHLY RECOMMEND BACKING UP YOUR GAME (you can copy and paste the entire KSP folder or just backup GameData and your saves) BEFORE TRYING THIS FOR THE FIRST TIME. I use it myself nearly every day without issue on my primary computer, but under other conditions there could be unexpected problems.\n\u003C/p\u003E\n\u003Cp\u003E\nDownload: \u003Ca href=\u0022https://www.dropbox.com/s/vbvlz4bbztcmv31/DataSwitcher-0.2.19.jar?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EDataSwitcher-0.2.19.jar\u003C/a\u003E (dropbox)\n\u003C/p\u003E\n\u003Cp\u003E\nSource: \u003Ca href=\u0022http://magico13.net/svn/DataSwitcher/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://magico13.net/svn/DataSwitcher/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nChangelog:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\n\n-- 0.2.19 (8/24/15) --\n * Fix for hang caused by files being symlinked as well as directories\n\n-- 0.2.18 (3/7/15) --\n * Fix for creating instances with non-steam KSP.\n * Made folders get backed up prior to deletion until symlink creation is successful, just to further reduce chance of data loss\n\n-- 0.2.17 --\n * Removed adding empty GameData folder to instance on creation to reduce chance of accidentally overwriting your GameData folder\n * Changed import dialog to use a list instead of a file chooser. This should fix issues with trying to import with symbolic links.\n\n-- 0.2.16 --\n * Added fallback for if the user has insufficient privileges to make symbolic links. Falls back to copying the directory. Fixed by running as administrator.\n * Split settings and instances into separate files (I want to add more settings in the future, without conflicting with the instances)\n * Removed Instance Activated popup because of concurrency issues (it would popup before completion)\n * Added progress bar that indicates the progress of copy and delete actions. No longer will you be left wondering what\u0027s going on.\n * Enabled support for any file/folder to be copied/linked to. Currently only GameData is officially supported. If you make/import a saves folder inside each instance, they will also be tracked. ONLY DO THIS WHEN SYMLINKS ARE FUNCTIONING (sufficient privileges), OR ELSE YOU WILL DEFINITLY LOSE SAVES WHEN SWITCHING INSTANCES. This will hopefully be fixed in later versions.\n * Added ability to import any files or folders from the game. Select using the \u0022Select Items to Import\u0022 button. Use shift or control to select multiples. If you hover over it, you can see what items are currently selected. Seems to have issue with the KSP.exe and Launcher.exe.\n * Added support for converting old single file system to two file system\n * Added ability to autostart game after activating an instance. Wait until the main buttons come back before choosing \u0022yes\u0022 or \u0022always\u0022!\n\n-- 0.1.10 --\n * Switched to using symbolic links instead of copying during activation of instance. Saves time, space, and writes!\n * Added autodetection of Steam KSP for Linux (HOME/.steam/...)\n * Changed directory for instances to the DataSwitcher folder created in the same directory as the executable. If you want this to be a configurable parameter, let me know.\n * Added file chooser to the New Instance dialog for Game Path selection. Select the \u0022Kerbal Space Program\u0022 folder (not GameData)!\n * Began adding a status indicator to the main window. Not totally functional yet. \n * Redid versioning. Major-Minor-BuildNumber\n * Copying and deleting is performed on a separate thread now. All buttons are disabled during file operations but the GUI won\u0027t lockup as much anymore when performing file operations.\n * Fixed issue with New Instance dialog in Linux not showing content.\n * Added tracking of the current used instance, which opens the door for save backups. As a result, the current instance is now displayed below the instance list.\n * Small changes to the GUI to widen the instance list and the current instance notifier. New instance is in the bottom left, delete is in the bottom right.\n * Fixed a bug with log.txt creation on first run due to the DataSwitcher folder not existing yet.\n\n-- 0.0.1.7 --\n * Added log.txt file which contains any text that is normally printed to the screen. Send me this along with any bug reports!\n * Added option to import an existing GameData folder from the Game Path\n * Added the version to the log.txt file on startup\n * Prevented creating two instances with identical names.\n\n-- 0.0.1.6 --\n * Initial release. Currently only supports multiple GameData folder instances.\n\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI just recently discovered that you can have CKAN manage each instance independently by importing the CKAN folder along with the GameData folder. I am extremely happy about this, because it will make keeping each instance up to date much, much easier \u003Cimg alt=\u0022:D\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-28T14:54:04Z\u0022 title=\u002201/28/2016 02:54  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 28, 2016\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003Cbr\u003EUpdate link to dropbox\n\u003C/span\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-01-08T05:08:26Z","Content":"\n\u003Cp\u003EI just posted a new release (0.1.10) with some rather substantial changes. I have confirmed that it will run properly on Linux (at least 0.1.9, I didn\u0027t test 0.1.10 on Linux) and so should run on Macs too. I redid versioning a bit to Major.Minor.BuildNumber which I think is a little better. BuildNumber directly corresponds to revision in the svn repository. Some notable changes since the first release:\u003C/p\u003E\u003Cp\u003E * Buttons are disabled when deleting or copying files. If they go grey, just give it a moment. It\u0027s taken nearly 40 seconds on my tablet to do a GameData import, but is 3 seconds on my desktop.\u003C/p\u003E\u003Cp\u003E * Ability to import the current GameData directory (this allows copying an instance by activating it and then creating a new instance with import checked)\u003C/p\u003E\u003Cp\u003E * Use of symbolic links (when the filesytem supports it). This means that activating an instance is much faster and doesn\u0027t use twice the hard drive space.\u003C/p\u003E\u003Cp\u003E * Added current instance indicator and \u0022status\u0022 indicator. The status indicator is still a WIP but will let you know that the program is doing something. GUI lockups won\u0027t be as frequent.\u003C/p\u003E\u003Cp\u003E * Added log.txt file. Please send this to me when reporting bugs.\u003C/p\u003E\u003Cp\u003EThe pictures are a little out of date, but overall functionality is the same.\u003C/p\u003E\u003Cp\u003EAs of right now (a few days after its creation), nobody has replied to this thread (or probably tried DataSwitcher out). For those of you who have looked and possibly considered downloading but chose not to, could you let me know why? I would like to make a program that others find useful, so it would be beneficial to me. I\u0027m always willing to take suggestions (though may not be skilled enough yet to fully implement them). Thank you!\u003C/p\u003E\n"},{"CreatedByName":"FanaticalFighter","CreatedById":77314,"CreatedDateTime":"2014-01-24T02:40:33Z","Content":"\n\u003Cp\u003EI\u0027m trying this out right now! I need to switch between my realistic \u0022challenges\u0022 game data folder and my sort-of stock career folder a lot.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-01-24T19:28:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FanaticalFighter\u0022 data-cite=\u0022FanaticalFighter\u0022\u003E\u003Cdiv\u003EI\u0027m trying this out right now! I need to switch between my realistic \u0022challenges\u0022 game data folder and my sort-of stock career folder a lot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me know what you think! I\u0027ve done some more work on it that isn\u0027t in the public release yet. If you run into issues with the folders not copying correctly (namely issues with the creation of the symbolic links) then try running as an administrator. That issue is recognized in the latest version and will pop up a warning but I have some things I need to fix before releasing it.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-02-06T17:41:34Z","Content":"\n\u003Cp\u003EJust uploaded a new release, 0.2.16, which has a couple new features. A summary of them follows:\u003C/p\u003E\u003Cp\u003E * Added ability to autostart game after activating an instance. Wait until the main buttons come back before choosing \u0022yes\u0022 or \u0022always\u0022! (If installed through steam, it runs through steam, otherwise it runs with the KSP.exe)\u003C/p\u003E\u003Cp\u003E * Enabled support for any file/folder to be copied/linked to. If symlinks are working correctly, then you can have different saves folders for each instance!\u003C/p\u003E\u003Cp\u003E * Added ability to import any files or folders from the game. Select using the \u0022Select Items to Import\u0022 button. Use shift or control to select multiples. If you hover over it, you can see what items are currently selected. Seems to have issue with the KSP.exe and Launcher.exe.\u003C/p\u003E\u003Cp\u003E * Added progress bar that indicates the progress of copy and delete actions. No longer will you be left wondering what\u0027s going on!\u003C/p\u003E\u003Cp\u003E * Split settings and instances into separate files (I want to add more settings in the future, without conflicting with the instances)\u003C/p\u003E\u003Cp\u003E * Removed Instance Activated popup because of concurrency issues (it would popup before completion, just look for \u0022Ready\u0022 in status indicator/buttons being usable again)\u003C/p\u003E\u003Cp\u003E * Added Fallback Mode for if the user has insufficient privileges to make symbolic links. Falls back to copying the directory. Fixed by running as administrator.\u003C/p\u003E\u003Cp\u003EFallback Mode:\u003C/p\u003E\u003Cp\u003EFallback mode is my attempt at making this still useful when you can\u0027t use symbolic links. I haven\u0027t developed it much yet, but in general it sucks and you shouldn\u0027t use it. The symlink method is faster, takes less space, and any changes the game makes to the folders will be reflected automatically in the instance. Fallback mode should only be used when necessary (and a popup will let you know if you may have to enable it because of permissions) and I will try to make it better in future versions.\u003C/p\u003E\u003Cp\u003EIf you have any questions/comments/concerns, just let me know. This will probably be put on the back burner for a little while as I\u0027ve just taken over development of a mod (Kerbal Construction Time) and am also balancing college and a youtube channel. (And want to have some time to actually play KSP!)\u003C/p\u003E\n"},{"CreatedByName":"jcramb","CreatedById":60939,"CreatedDateTime":"2014-02-08T12:32:10Z","Content":"\n\u003Cp\u003EThis mod just NUKED my entire GameData folder and i\u0027ve lost the entire mod setup I had configured... so I am a little hesitant to trust it with my game now. \u003C/p\u003E\u003Cp\u003ECool idea in theory though.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-02-08T16:27:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jcramb\u0022 data-cite=\u0022jcramb\u0022\u003E\u003Cdiv\u003EThis mod just NUKED my entire GameData folder and i\u0027ve lost the entire mod setup I had configured... so I am a little hesitant to trust it with my game now. \u003Cp\u003ECool idea in theory though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m really sorry, but did you make sure to import the GameData folder when creating the instance? Either that or copy the GameData folder from the game into the one located in the DataSwitcher/{Instance Name} folder? Both methods should work just fine and are mentioned in the \u0022How Do I Use This?\u0022 question. Did you receive an error popup when trying to activate the instance? If so, was it the Fallback mode popup and did you choose to enable it or exit? If you exit, I think it still deletes the folders (the error comes in during the symbolic link generation which comes after folder removal).\u003C/p\u003E\u003Cp\u003EIf you got the fallback mode popup and clicked exit, but imported your GameData folder then a perfectly good copy of your GameData folder will be located in DataSwitcher/{Instance Name}/GameData which you can copy back to your game directory.\u003C/p\u003E\u003Cp\u003EOther info, such as operating system, filesystem of hard drive that the game/dataswitcher program are on (if windows and in the C:/ drive then it\u0027s ntfs, if Linux then most likely ext3 or ext4, if Mac then HFS. Secondary hard drives may be FAT32, which doesn\u0027t support symbolic links, all the others do though), and anything else you deem relevant would be of great use to me in trying to see what the issue is.\u003C/p\u003E\u003Cp\u003EA word of warning for anyone trying this, which I have stated in the OP (hmm, maybe I removed that message for some reason, I\u0027ll be adding that back in). Backup your files before testing this. Under normal operation there shouldn\u0027t be any issues, I literally use this every time I play (I\u0027m using it right now to test a plugin I\u0027m developing) so I trust it that much, but I still have a couple back ups just in case.\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2014-09-10T19:51:29Z","Content":"\n\u003Cp\u003EI can\u0027t get the file to run...\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-09-10T19:54:06Z","Content":"\n\u003Cp\u003EDo you have Java installed? It\u0027s a .jar file that has to be run with java (you may have to right click and tell it to run with java)\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2014-09-11T03:07:23Z","Content":"\n\u003Cp\u003EI do have java and I did that, it did nothing.\u003C/p\u003E\u003Cp\u003EI\u0027ll try it with my desktop.\u003C/p\u003E\u003Cp\u003EEdit: It opens on my desktop just not my laptop...\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-09-11T03:43:41Z","Content":"\n\u003Cp\u003EYou may have to run with administrative privileges. Does it generate a log.txt file? And if so, does it contain any errors. I haven\u0027t worked on this in a while (like 7 months) so I don\u0027t remember all the details of all the logs.\u003C/p\u003E\u003Cp\u003EDo your laptop and desktop run different operating systems (like Windows 7 vs Windows 8)?\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2014-09-11T04:10:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EYou may have to run with administrative privileges. Does it generate a log.txt file? And if so, does it contain any errors. I haven\u0027t worked on this in a while (like 7 months) so I don\u0027t remember all the details of all the logs.\u003Cp\u003EDo your laptop and desktop run different operating systems (like Windows 7 vs Windows 8)?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoth my laptop and desktop run Windows 8.1. Also, I can\u0027t run the programs as administrator. I\u0027m not sure why. It might have to due with the fact that I have WinRAR which can open up Jar files and show me the guts of the program.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-09-11T04:38:48Z","Content":"\n\u003Cp\u003EI also have winrar, but I can still right-click, then go to Open With... and then choose java.\u003C/p\u003E\u003Cp\u003EI just did some testing on my win8 computer and also can\u0027t run it as administrator. Apparently it\u0027s because it\u0027s a .jar. I\u0027m going to try a workaround.\u003C/p\u003E\u003Cp\u003EI thought I could write a short batch script that would run it when you run as an administrator, but apparently that also changes the current directory and I can\u0027t use relative paths. Unfortunately, since this is packaged as a jar file (and I don\u0027t think I can really package it as anything else) it might not work in windows 8 if the user isn\u0027t an administrator. It should at least open as a normal user, it just would require fallback mode (and so would still work for your purposes, it would just be slower and you can\u0027t use the saves folder)\u003C/p\u003E\u003Cp\u003EEdit: if you\u0027re comfortable at all with the command line you can run the \u0022cmd\u0022 command as an administrator and then navigate to the directory with DataSwitcher in it, then run \u0022java -jar DataSwitcher-0.2.17.jar\u0022 and it should work fine. But that\u0027s not the most straightforward thing to do for people without command line experience (and for people with it that\u0027s a trivial task)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-11T04:43:54Z\u0022 title=\u002209/11/2014 04:43  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 11, 2014\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2014-09-11T07:19:09Z","Content":"\n\u003Cp\u003EI got it to work, but I\u0027m a little confused on how it works. Should it take out folders inside the gamedata then put the news in?\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-09-11T21:23:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoldForest\u0022 data-cite=\u0022GoldForest\u0022\u003E\u003Cdiv\u003EI got it to work, but I\u0027m a little confused on how it works. Should it take out folders inside the gamedata then put the news in?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d suggest backing up your saves and GameData folder just in case.\u003C/p\u003E\u003Cp\u003EThe easiest thing to do would be to create an instance based on what you have already in GameData. Load up DataSwitcher, press the \u0022\u002B\u0022 button, give it a name and browse to the Game Path (if it doesn\u0027t recognize it already). Note that the game path is to the Kerbal Space Program folder, not GameData. Then select what folders you want to import (GameData is likely one of them, you may also want to import the saves folder if you want separate save games per instance. Use the CTRL key to select multiples). Press Create and it should import the folders (it may take a while. It should say \u0022Copying GameData\u0022 with a progressbar). When that\u0027s finished, go into the DataSwitcher folder (same place as the DataSwitcher jar file) and check to see if there\u0027s a folder with the same name as the instance you created. If you open that folder you should see whatever folders you imported.\u003C/p\u003E\u003Cp\u003EIf you select and Activate the instance you created, it will delete the folders from the main KSP folder and create new links to the folders in the DataSwitcher folder. Any changes made to one will be changed in the other (and it doesn\u0027t take up any more space). That means you can install new mods into the GameData folder in the DataSwitcher folder, or in the normal KSP folder. When you switch to a different instance it makes the link in the KSP folder point to a different folder in the DataSwitcher folder.\u003C/p\u003E\u003Cp\u003EIf you didn\u0027t import any folders you can either delete the instance and make a new one, or manually copy the folders into the instance folder.\u003C/p\u003E\u003Cp\u003EIf you have to use Fallback mode it doesn\u0027t make links but instead copies the folders. That means that whatever changes are made in the KSP folder version aren\u0027t kept in the DataSwitcher version, which is why I don\u0027t suggest using the saves folder in Fallback mode.\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2014-09-11T22:04:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EI\u0027d suggest backing up your saves and GameData folder just in case.\u003Cp\u003EThe easiest thing to do would be to create an instance based on what you have already in GameData. Load up DataSwitcher, press the \u0022\u002B\u0022 button, give it a name and browse to the Game Path (if it doesn\u0027t recognize it already). Note that the game path is to the Kerbal Space Program folder, not GameData. Then select what folders you want to import (GameData is likely one of them, you may also want to import the saves folder if you want separate save games per instance. Use the CTRL key to select multiples). Press Create and it should import the folders (it may take a while. It should say \u0022Copying GameData\u0022 with a progressbar). When that\u0027s finished, go into the DataSwitcher folder (same place as the DataSwitcher jar file) and check to see if there\u0027s a folder with the same name as the instance you created. If you open that folder you should see whatever folders you imported.\u003C/p\u003E\u003Cp\u003EIf you select and Activate the instance you created, it will delete the folders from the main KSP folder and create new links to the folders in the DataSwitcher folder. Any changes made to one will be changed in the other (and it doesn\u0027t take up any more space). That means you can install new mods into the GameData folder in the DataSwitcher folder, or in the normal KSP folder. When you switch to a different instance it makes the link in the KSP folder point to a different folder in the DataSwitcher folder.\u003C/p\u003E\u003Cp\u003EIf you didn\u0027t import any folders you can either delete the instance and make a new one, or manually copy the folders into the instance folder.\u003C/p\u003E\u003Cp\u003EIf you have to use Fallback mode it doesn\u0027t make links but instead copies the folders. That means that whatever changes are made in the KSP folder version aren\u0027t kept in the DataSwitcher version, which is why I don\u0027t suggest using the saves folder in Fallback mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStill a little confused...\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-09-11T22:37:07Z","Content":"\n\u003Cp\u003EOk, I\u0027ll try to be more clear. Is there any specific part that is confusing?\u003C/p\u003E\u003Cp\u003EWhen you run it you first have to create a new instance (with the \u002B button). You give it a name in the first field, locate the Kerbal Space Program folder for the second field, then choose which folders you want to have multiples of. Then you create the instance (I suggest double checking that the folder was created in the DataSwitcher folder after creating it) and activate it. If you want to have a different instance (say, to use a different set of mods. AKA a different GameData folder) you just create a separate instance for that and put whatever mods you want in the GameData folder for that instance (in the DataSwitcher folder). You can then switch between them by selecting and activating the instance (mods) you want to use.\u003C/p\u003E\u003Cp\u003EExample:\u003C/p\u003E\u003Cp\u003EYou currently have a totally stock version of KSP. You go to create a new instance named \u0022Stock\u0022 and the KSP folder is located at \u0022C:\\Program Files (x86)\\Steam\\SteamApps\\common\\Kerbal Space Program\\\u0022. You select the GameData folder to be imported into the new instance. You press \u0022Create\u0022 and it copies the GameData folder to the DataSwitcher folder. You double check that DataSwitcher\\Stock\\GameData exists and has the Squad and NASAMission folders. You then activate the Stock instance and can play KSP with stock as normal.\u003C/p\u003E\u003Cp\u003ELater on you decide to add some mods, but want to have a pristine Stock folder in case you want to use different mods later/want to play stock. The \u0022Stock\u0022 instance is still activated when you open DataSwitcher. You go to create a new instance called \u0022Modded\u0022 with the same KSP folder location as before. You once again select to import the GameData folder. After creating the instance you double check that DataSwitcher\\Modded\\GameData exists and has the Squad and NASAMission folders. You then add your mods to that GameData folder and activate the \u0022Modded\u0022 instance in DataSwitcher. Now when you run KSP you\u0027ll have mods.\u003C/p\u003E\u003Cp\u003EIf you want to play with Stock again, just activate \u0022Stock\u0022 and start KSP. No more mods. You can freely swap between them.\u003C/p\u003E\u003Cp\u003EThe next bit of info is a little more advanced and isn\u0027t necessary at first:\u003C/p\u003E\u003Cp\u003EMaybe later you decide you want to try out another set of mods. If you activate the Stock instance first, then import the GameData folder like before then you\u0027ll only have the Squad and NASAMission folders in it (DataSwitcher\\NewInstance\\GameData). If you activate the Modded instance before creating the new one it will copy everything from the Modded GameData folder into the new one, so you can essentially copy the instance and then add new mods on top of that.\u003C/p\u003E\u003Cp\u003ESo then maybe you have these instances which you can swap between:\u003C/p\u003E\u003Cp\u003EStock\u003C/p\u003E\u003Cp\u003EBasic (created by activating Stock and then creating a new one. Contains visual enhancements/kerbal engineer/KAC/etc)\u003C/p\u003E\u003Cp\u003EModded (created by activating Basic and then adding even more mods)\u003C/p\u003E\u003Cp\u003ETest (created by activating Stock first, then adding new mods you want to try out without having everything else installed)\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2014-09-12T05:04:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EOk, I\u0027ll try to be more clear. Is there any specific part that is confusing?\u003Cp\u003EWhen you run it you first have to create a new instance (with the \u002B button). You give it a name in the first field, locate the Kerbal Space Program folder for the second field, then choose which folders you want to have multiples of. Then you create the instance (I suggest double checking that the folder was created in the DataSwitcher folder after creating it) and activate it. If you want to have a different instance (say, to use a different set of mods. AKA a different GameData folder) you just create a separate instance for that and put whatever mods you want in the GameData folder for that instance (in the DataSwitcher folder). You can then switch between them by selecting and activating the instance (mods) you want to use.\u003C/p\u003E\u003Cp\u003EExample:\u003C/p\u003E\u003Cp\u003EYou currently have a totally stock version of KSP. You go to create a new instance named \u0022Stock\u0022 and the KSP folder is located at \u0022C:\\Program Files (x86)\\Steam\\SteamApps\\common\\Kerbal Space Program\\\u0022. You select the GameData folder to be imported into the new instance. You press \u0022Create\u0022 and it copies the GameData folder to the DataSwitcher folder. You double check that DataSwitcher\\Stock\\GameData exists and has the Squad and NASAMission folders. You then activate the Stock instance and can play KSP with stock as normal.\u003C/p\u003E\u003Cp\u003ELater on you decide to add some mods, but want to have a pristine Stock folder in case you want to use different mods later/want to play stock. The \u0022Stock\u0022 instance is still activated when you open DataSwitcher. You go to create a new instance called \u0022Modded\u0022 with the same KSP folder location as before. You once again select to import the GameData folder. After creating the instance you double check that DataSwitcher\\Modded\\GameData exists and has the Squad and NASAMission folders. You then add your mods to that GameData folder and activate the \u0022Modded\u0022 instance in DataSwitcher. Now when you run KSP you\u0027ll have mods.\u003C/p\u003E\u003Cp\u003EIf you want to play with Stock again, just activate \u0022Stock\u0022 and start KSP. No more mods. You can freely swap between them.\u003C/p\u003E\u003Cp\u003EThe next bit of info is a little more advanced and isn\u0027t necessary at first:\u003C/p\u003E\u003Cp\u003EMaybe later you decide you want to try out another set of mods. If you activate the Stock instance first, then import the GameData folder like before then you\u0027ll only have the Squad and NASAMission folders in it (DataSwitcher\\NewInstance\\GameData). If you activate the Modded instance before creating the new one it will copy everything from the Modded GameData folder into the new one, so you can essentially copy the instance and then add new mods on top of that.\u003C/p\u003E\u003Cp\u003ESo then maybe you have these instances which you can swap between:\u003C/p\u003E\u003Cp\u003EStock\u003C/p\u003E\u003Cp\u003EBasic (created by activating Stock and then creating a new one. Contains visual enhancements/kerbal engineer/KAC/etc)\u003C/p\u003E\u003Cp\u003EModded (created by activating Basic and then adding even more mods)\u003C/p\u003E\u003Cp\u003ETest (created by activating Stock first, then adding new mods you want to try out without having everything else installed)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, I think I get it now.\u003C/p\u003E\n"},{"CreatedByName":"Joshwoo70","CreatedById":111345,"CreatedDateTime":"2014-09-12T11:17:00Z","Content":"\n\u003Cp\u003EThis might help.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://stackoverflow.com/questions/8532925/how-to-start-a-java-jar-with-administrators-privileges-on-windows-7\u0022 rel=\u0022external nofollow\u0022\u003Elink\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"JAFO","CreatedById":132901,"CreatedDateTime":"2015-03-06T03:32:40Z","Content":"\n\u003Cp\u003EAny chance of updating this for Java8?\u003C/p\u003E\u003Cp\u003EThe main window opens, but the Add button does nothing.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-03-06T03:41:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JAFO\u0022 data-cite=\u0022JAFO\u0022\u003E\u003Cdiv\u003EAny chance of updating this for Java8?\u003Cp\u003EThe main window opens, but the Add button does nothing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure! I didn\u0027t realize anyone other than me ever used this. I should be able to do that pretty easily. I should take some time to update this a bit. I\u0027ve thought of a few ways to make it a bit better.\u003C/p\u003E\u003Cp\u003EEdit: So it seems to work fine for me with Java 8, but just to be sure I opened it up in eclipse using Java 8 and rebuilt the jar. I\u0027ll link to that below. It\u0027s otherwise identical to the one in the OP. If you\u0027re still having issues, please let me know what operating system you\u0027re using (I had issues with it in the past on Linux) and maybe send me the log.txt file since it might contain an error message.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/6zb64hzdk5z6mlu/DataSwitcher.jar\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/6zb64hzdk5z6mlu/DataSwitcher.jar\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-06T04:15:37Z\u0022 title=\u002203/06/2015 04:15  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 6, 2015\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JAFO","CreatedById":132901,"CreatedDateTime":"2015-03-06T08:07:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EEdit: So it seems to work fine for me with Java 8, but just to be sure I opened it up in eclipse using Java 8 and rebuilt the jar. I\u0027ll link to that below. It\u0027s otherwise identical to the one in the OP. If you\u0027re still having issues, please let me know what operating system you\u0027re using (I had issues with it in the past on Linux) and maybe send me the log.txt file since it might contain an error message.\u003Cp\u003E\u003Ca href=\u0022http://www./download/6zb64hzdk5z6mlu/DataSwitcher.jar\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/6zb64hzdk5z6mlu/DataSwitcher.jar\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry to report that this has the same problem.. main window opens but Add button does nothing. So I\u0027m guessing it\u0027s something to do with my system, but no idea what that would be.\u003C/p\u003E\u003Cp\u003EWindows 7 64bit, fully up to date.\u003C/p\u003E\u003Cp\u003EJava 8, update 25.\u003C/p\u003E\u003Cp\u003EBeing run from an Administrator account.\u003C/p\u003E\u003Cp\u003ENo log.txt file is being generated.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-03-06T16:40:45Z","Content":"\n\u003Cp\u003EWhen I get home I\u0027ll try with a similar setup. I think my Windows 7 system uses Java 7, but my Windows 8 uses Java 8. It works fine on both for me.\u003C/p\u003E\u003Cp\u003EThe log.txt should be in the DataSwitcher folder that gets made when you start DataSwitcher. If that\u0027s not being made, you might have antivirus software that\u0027s blocking it?\u003C/p\u003E\u003Cp\u003EWhen you click the \u0022\u002B\u0022 button, the window doesn\u0027t appear, correct? Or is it that when you press the \u0022Create\u0022 button, nothing happens? You could try running it through the command line to see if it outputs anything there. Just hold shift and right click on the folder where you have the DataSwitcher jar file. Select the \u0022Open Command Window Here\u0022 or similar action. A black box will appear. Just type (without quotes) \u0022java -jar DataSwitcher-0.2.17.jar\u0022 (using whatever the file is named, which would be DataSwitcher-java8.jar for the new file). It should open the main window like normal, and you might see some text printed to the command window when you try to create a new instance. If you can take a screenshot of that text (assuming there is some) that would be great!\u003C/p\u003E\n"},{"CreatedByName":"JAFO","CreatedById":132901,"CreatedDateTime":"2015-03-07T21:53:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EThe log.txt should be in the DataSwitcher folder that gets made when you start DataSwitcher. If that\u0027s not being made, you might have antivirus software that\u0027s blocking it?\u003C/div\u003E\u003C/blockquote\u003ETurns out the DataSwitcher folder IS being made.. just that my Explorer window didn\u0027t auto-refresh for some reason, so I didn\u0027t spot it at the time. The log file is there.. see below.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EWhen you click the \u0022\u002B\u0022 button, the window doesn\u0027t appear, correct?\u003C/div\u003E\u003C/blockquote\u003ECorrect.\u003Cp\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EYou could try running it through the command line to see if it outputs anything there. Just hold shift and right click on the folder where you have the DataSwitcher jar file. Select the \u0022Open Command Window Here\u0022 or similar action. A black box will appear. Just type (without quotes) \u0022java -jar DataSwitcher-0.2.17.jar\u0022 (using whatever the file is named, which would be DataSwitcher-java8.jar for the new file). It should open the main window like normal, and you might see some text printed to the command window when you try to create a new instance. If you can take a screenshot of that text (assuming there is some) that would be great!\u003C/div\u003E\u003C/blockquote\u003ENo text appears in the console window when I try this.\u003Cp\u003EHere\u0027s the log file:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EStarting DataSwitcher v0.2.17\u003Cp\u003EReading settings file.\u003C/p\u003E\u003Cp\u003EReading instances file.\u003C/p\u003E\u003Cp\u003ELoaded 0 instances.\u003C/p\u003E\u003Cp\u003EException in thread \u0022AWT-EventQueue-0\u0022 java.lang.NullPointerException\u003C/p\u003E\u003Cp\u003E at dataswitcher.GuiConfirmCreate.updateList(GuiConfirmCreate.java:138)\u003C/p\u003E\u003Cp\u003E at dataswitcher.GuiConfirmCreate.\u0026lt;init\u0026gt;(GuiConfirmCreate.java:127)\u003C/p\u003E\u003Cp\u003E at dataswitcher.GuiMain$3.actionPerformed(GuiMain.java:148)\u003C/p\u003E\u003Cp\u003E at javax.swing.AbstractButton.fireActionPerformed(Unknown Source)\u003C/p\u003E\u003Cp\u003E at javax.swing.AbstractButton$Handler.actionPerformed(Unknown Source)\u003C/p\u003E\u003Cp\u003E at javax.swing.DefaultButtonModel.fireActionPerformed(Unknown Source)\u003C/p\u003E\u003Cp\u003E at javax.swing.DefaultButtonModel.setPressed(Unknown Source)\u003C/p\u003E\u003Cp\u003E at javax.swing.plaf.basic.BasicButtonListener.mouseReleased(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.AWTEventMulticaster.mouseReleased(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Component.processMouseEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at javax.swing.JComponent.processMouseEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Component.processEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Container.processEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Component.dispatchEventImpl(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Container.dispatchEventImpl(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Component.dispatchEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.LightweightDispatcher.retargetMouseEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.LightweightDispatcher.processMouseEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.LightweightDispatcher.dispatchEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Container.dispatchEventImpl(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Window.dispatchEventImpl(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.Component.dispatchEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventQueue.dispatchEventImpl(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventQueue.access$400(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventQueue$3.run(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventQueue$3.run(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.security.AccessController.doPrivileged(Native Method)\u003C/p\u003E\u003Cp\u003E at java.security.ProtectionDomain$1.doIntersectionPrivilege(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.security.ProtectionDomain$1.doIntersectionPrivilege(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventQueue$4.run(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventQueue$4.run(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.security.AccessController.doPrivileged(Native Method)\u003C/p\u003E\u003Cp\u003E at java.security.ProtectionDomain$1.doIntersectionPrivilege(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventQueue.dispatchEvent(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventDispatchThread.pumpOneEventForFilters(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventDispatchThread.pumpEventsForFilter(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventDispatchThread.pumpEventsForHierarchy(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventDispatchThread.pumpEvents(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventDispatchThread.pumpEvents(Unknown Source)\u003C/p\u003E\u003Cp\u003E at java.awt.EventDispatchThread.run(Unknown Source)\u003C/p\u003E\u003Cp\u003EWriting instance file.\u003C/p\u003E\u003Cp\u003EWriting settings file.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-03-07T22:40:44Z","Content":"\n\u003Cp\u003EThank you for that! I know what the issue is now, you don\u0027t have KSP through steam so when it sets the default directory to the steam directory it fails. I can reproduce it on my end quite easily now. I\u0027ll get you an update asap.\u003C/p\u003E\u003Cp\u003EEdit: Alright, this one should work properly now! \u003Ca href=\u0022http://www./download/y6z4s49bswd121p/DataSwitcher-0.2.18.jar\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/y6z4s49bswd121p/DataSwitcher-0.2.18.jar\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-07T23:23:33Z\u0022 title=\u002203/07/2015 11:23  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 7, 2015\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"}]}