{"TopicId":59207,"ForumId":55,"TopicTitle":"Pop up of empty pods before launching","CreatedByName":"iamtherik","CreatedById":100286,"CreatedDateTime":"2014-01-07T18:38:02Z","PageNum":1,"Articles":[{"CreatedByName":"iamtherik","CreatedById":100286,"CreatedDateTime":"2014-01-07T18:38:02Z","Content":"\n\u003Cp\u003EHi, I\u0027m new to the forums couldn\u0027t find a thread related to this. I love KSP but I\u0027m always raging when this happens to me: When I\u0027m going to send some missions that aren\u0027t \u0022rescue\u0022 mission I don\u0027t want empty pods in my ship, and even tough I fill my pods for some reason sometimes the pods are empty and I realize this when an in mid fly or in outer space and I don\u0027t know if this is common but I would love to have a pop up when clicking the launch button that says that I\u0027m leaving the construction mode with empty seats and that if I\u0027m sure. Thank you!\u003C/p\u003E\u003Cp\u003Erik \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-01-07T22:56:32Z","Content":"\n\u003Cp\u003EThat would be nice. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2014-01-07T23:11:36Z","Content":"\n\u003Cp\u003EI\u0027ve had the problem where I want a specific pilot but each time my plane falls off the runway and explodes and I go back the HVA and relaunch I have to reselect the pilot I want. I wish each craft would save a preferred crew and make substitutions if necessary. This might fix your problem, a craft would save that you want Kerbals X, Y, and Z in their specific seats and you would only have to set that once. This feature would make even more sense if/when Kerbals have attributes that actually matter. As frustrating as having the wrong crew is, 95% of the time a popup box sounds more annoying that it\u0027s worth.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-07T23:51:30Z","Content":"\n\u003Cp\u003EWhen you go launch the craft from Space Center, the crew window opens every time.\u003C/p\u003E\u003Cp\u003EWhen you go launch the craft from VAB/SPH, you just have to remember to click on the crew button.\u003C/p\u003E\u003Cp\u003EThere\u0027s also \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/63214-VAB-SPH-move-the-Crew-button-next-to-Launch-button\u0022 rel=\u0022external nofollow\u0022\u003Ethis suggestion\u003C/a\u003E which I think would make the matter a bit easier.\u003C/p\u003E\n"},{"CreatedByName":"iamtherik","CreatedById":100286,"CreatedDateTime":"2014-01-08T00:33:12Z","Content":"\n\u003Cp\u003EAnother thing I noticed is that, I also want to launch (now) an empty pod but it keeps getting a kerbal crew for some random reason I still don\u0027t know D: I really have to go to crew the second Im going to hit launch because otherwise I\u0027ll be reverting launch... is so frustrating D:\u003C/p\u003E\u003Cp\u003E^^ keep the good work.\u003C/p\u003E\n"}]}