{"TopicId":59359,"ForumId":36,"TopicTitle":"[WIP] MSI\u0026#039;s Infernal Robotics - Model Rework (v02 Pre-Release Beta)","CreatedByName":"ZodiusInfuser","CreatedById":76163,"CreatedDateTime":"2014-01-09T00:00:17Z","PageNum":38,"Articles":[{"CreatedByName":"Darren9","CreatedById":58062,"CreatedDateTime":"2014-11-08T07:13:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tubal\u0022 data-cite=\u0022Tubal\u0022\u003E\u003Cdiv\u003ETraced the reason my solar arrays keep breaking. Turns out the trusses and tubes start to oscillate when I have extended (stock) solar panels on them. I imagine it\u0027s got something to do with the sun tracking?\u003Cp\u003EI can reproduce it reliably by putting three 2.5m junior trusses on each other, adding solar panels to the tip, extending them, and then go to the space center and back. Only happens during daytime. Happens with both trusses and pipes, although I haven\u0027t tried every variant, but it doesn\u0027t happen with the stock XL girder.\u003C/p\u003E\u003Cp\u003EHere\u0027s an image of it flipping out on a test vessel: \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/69730802/2014-11-07_00001.jpg\u0022 rel=\u0022external nofollow\u0022\u003Elink\u003C/a\u003E. It\u0027s flapping it\u0027s panels like wings.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003ECurious indeed, I just got the same thing to happen. Then tried it with another long truss from a different mod, it seemed to wobble very slightly when I zoomed in on the top of it but then stop after a while. I wonder if the panels are making a force and the IR truss is tuned to resonate it, I\u0027m not sure what else it could be.\n"},{"CreatedByName":"maix","CreatedById":128652,"CreatedDateTime":"2014-11-09T00:42:57Z","Content":"\n\u003Cp\u003Elinks are not available for download mods, update links please\u003C/p\u003E\n"},{"CreatedByName":"Tubal","CreatedById":38146,"CreatedDateTime":"2014-11-09T01:27:03Z","Content":"\n\u003Cp\u003ESome sort of resonance seems likely. I don\u0027t know how joints in ksp are defined so I can\u0027t help with it :/\u003C/p\u003E\n"},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2014-11-13T20:20:58Z","Content":"\n\u003Cp\u003ECan anyone help me with fixing my extendatrons? I have a clean install, but for some reason they don\u0027t want to stick on their nodes.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Ud8e9wxN24g?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2014-11-15T07:44:36Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EWith trial and error I have found that the problem was caused by the Tweakable Everything mod, specificly TweakableAnimateGeneric files. I deleted both and the problem is gone.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wren","CreatedById":99277,"CreatedDateTime":"2014-12-19T03:25:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maix\u0022 data-cite=\u0022maix\u0022\u003E\u003Cdiv\u003Elinks are not available for download mods, update links please\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. Unable to download anything at this time.\u003C/p\u003E\n"},{"CreatedByName":"Saint-Stanislas","CreatedById":72776,"CreatedDateTime":"2014-12-20T14:44:56Z","Content":"\n\u003Cp\u003ESince I saw the Athlete Thruss I wanted to do this :\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s3.postimg.org/dlnb8t483/Foldatron_Arm.jpg\u0022 alt=\u0022Foldatron_Arm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m pretty sure IR is messy while tweakscaling and there are some special config to make for it if we want to use tweakscale. Probably with the node adjustement. \u003C/p\u003E\u003Cp\u003EThis is probably really messy, I didn\u0027t reloaded a ship with it yet, but it\u0027s already buggy in the VAB: the node attach are returning to normal as soon as you copy the part, or open a ship file ( an overscaled will have the node inside the part, and an underscaled will have the node outside of it ). \u003C/p\u003E\u003Cp\u003EI just messed with your scaling definition for the foldatron ( scaleFactors = 0.45, 0.54, 0.67, 0.82, 1.0, 1.22). Over 1.22 it seem to get even more buggy as the part are not moving, and they dont look like they\u0027Re stuck togheter. \u003C/p\u003E\u003Cp\u003EI\u0027m not asking for help or anything, I know where to find the IR documentation and it is in my plans to go through it. Since there\u0027s a special guide for creating IR parts, I\u0027m pretty sure I\u0027m gonna find all the explanation for these behaviors in the docs. I\u0027m just sharing the idea right now because it\u0027s been itching me since I saw the Foldatron and the thrusses ! \u003C/p\u003E\u003Cp\u003EAnd your parts are absolutly beautiful !!! I\u0027m really eager to get the new ones you are working on, they are gorgeous as well ( yes, gorgeous robotic parts ! )\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-12-20T14:56:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Saint-Stanislas\u0022 data-cite=\u0022Saint-Stanislas\u0022\u003E\u003Cdiv\u003EThis is probably really messy, I didn\u0027t reloaded a ship with it yet, but it\u0027s already buggy in the VAB: the node attach are returning to normal as soon as you copy the part, or open a ship file ( an overscaled will have the node inside the part, and an underscaled will have the node outside of it ).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a bug with the current version of TweakScale (1.49). Nothing anyone can fix with config changes.\u003C/p\u003E\n"},{"CreatedByName":"Saint-Stanislas","CreatedById":72776,"CreatedDateTime":"2014-12-20T23:30:14Z","Content":"\n\u003Cp\u003EOk, youhou then it means it\u0027s actually working. \u003C/p\u003E\u003Cp\u003EAny idea of why scaling over 1.22 prevent part from moving ( there like translating just a bit, wich make no sense ).\u003C/p\u003E\u003Cp\u003EZodius since it\u0027s your stuff and your models, would you mind giving the exact proportion between the outside and inside joint of the foldatron insert. I made it visually at 82%, but I feel like the lack of precision is probably breaking the bigger scales because of parts interferences.\u003C/p\u003E\n"},{"CreatedByName":"Darren9","CreatedById":58062,"CreatedDateTime":"2014-12-20T23:48:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Saint-Stanislas\u0022 data-cite=\u0022Saint-Stanislas\u0022\u003E\u003Cdiv\u003EOk, youhou then it means it\u0027s actually working. \u003Cp\u003EAny idea of why scaling over 1.22 prevent part from moving ( there like translating just a bit, wich make no sense ).\u003C/p\u003E\u003Cp\u003EZodius since it\u0027s your stuff and your models, would you mind giving the exact proportion between the outside and inside joint of the foldatron insert. I made it visually at 82%, but I feel like the lack of precision is probably breaking the bigger scales because of parts interferences.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI think unless you\u0027re running that mod that allows parts on the same ship to collide they won\u0027t be interfering, I guessed at 80% for the inside and it looked OK. I\u0027d try doing the larger parts by creating a duplicate and using rescaleFactor to see if that\u0027ll work. From what I\u0027ve done in the past 1.22 shouldn\u0027t be too big to break IR, it\u0027s most likely just what Tweekscale is doing.\n"},{"CreatedByName":"Saint-Stanislas","CreatedById":72776,"CreatedDateTime":"2014-12-21T11:42:19Z","Content":"\n\u003Cp\u003EI came up with 82% because i\u0027m picky \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt a excellent idea to use rescale factor on a new part, I\u0027ll try it too. I didn\u0027t spend too much time testing it yet, so it might be a cfg error or something that kept the part from moving at 1.45 and stuff. Let me know if you get the same behavior when you put all the scales on the same part.\u003C/p\u003E\u003Cp\u003EEDIT: Ok, I\u0027m dumb, didn\u0027t retry it but anyways, the \u0027\u0027bug\u0027\u0027 I was expperiencing with part bigger than 1.22 scale was most probably due to the fact that I didn\u0027T respect the IR building scheme ( attaching part always on the good node, not reversing them without using a reverse mount )\u003C/p\u003E\u003Cp\u003EEDIT: Tried to assemble it correctly, still translating instead of rotating, i\u0027ll try with a new part like you suggested.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s8.postimg.org/619zbv985/Sans_titre.jpg\u0022 alt=\u0022Sans_titre.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-21T13:03:29Z\u0022 title=\u002212/21/2014 01:03  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 21, 2014\u003C/time\u003E by Saint-Stanislas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saint-Stanislas","CreatedById":72776,"CreatedDateTime":"2014-12-23T15:40:50Z","Content":"\n\u003Cp\u003EIt\u0027s working when creating a double of the hinge and changing his rescale factor.\u003C/p\u003E\u003Cp\u003EI have no clue why it wouldn\u0027t work with the original part over a certain size, and I won\u0027t try to figure it out. It\u0027s working like that and that is essentially what I wanted ! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-24T08:37:12Z","Content":"\n\u003Cp\u003EVery interested in these parts, especially the wheels and athletes parts\u003C/p\u003E\n"},{"CreatedByName":"ZodiusInfuser","CreatedById":76163,"CreatedDateTime":"2015-01-07T20:40:11Z","Content":"\n\u003Cp\u003EHi All. Have I missed anything? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs I\u0027m sure some of you will have noticed, I\u0027ve been pretty absent from this project over the last few months. I had a lot of RL commitments from September, meaning I had little time for KSP modding, as thus lost enthusiasm for it. It pleases me to see my parts still in use in various screenshots and videos, despite their unfinished state \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESince we\u0027re in a new year, I thought I\u0027d have a go at starting the project back up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I\u0027m going to take it slow, since I still have those RL commitments I mentioned, but I hope to try and get a number of in-progress parts finished.\u003C/p\u003E\u003Cp\u003EStarting off that goal, here\u0027s a revised version of the landing foot. It turns out the old design clipped through the athlete parts rather badly so needed to be completely redone. Let me know what you think.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://www.cubbyusercontent.com/pl/IR_LandingFoot-Remake.png/_644abc75044d4f5186bbb251dc844ba9\u0022 alt=\u0022_644abc75044d4f5186bbb251dc844ba9\u0022\u003E\u003C/p\u003E\u003Cp\u003EQuestion: Should this have an integrated Light to aid in landing, or not?\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-01-07T20:53:17Z","Content":"\n\u003Cp\u003Easdfgh he\u0027s back! I like the new foot and yes, it should have a light. Would very much help with the last 10 metres or so of descent. Welcome back!\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-01-07T21:10:45Z","Content":"\n\u003Cp\u003EWelcome back. Leg looks cool. Integrated functionality is often a good idea.\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-01-07T22:03:50Z","Content":"\n\u003Cp\u003EWelcome back! Great news and beautiful landing legs.\u003C/p\u003E\n"},{"CreatedByName":"ZodiusInfuser","CreatedById":76163,"CreatedDateTime":"2015-01-07T23:30:53Z","Content":"\n\u003Cp\u003EThanks for the welcomes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I\u0027ll go ahead and include a short range light to the bottom, seeing as people think it will be useful.\u003C/p\u003E\u003Cp\u003EWhile I was away I saw electronicfox\u0027s quadcopter pack, and it got me thinking that perhaps the IR rework could benefit from a propeller part or two. The idea would be that they have the standard rework mounting, allowing you to make foldable multicopters. Do people think this would be worth exploring, or is it beyond the scope of what infernal robotics should be?\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-01-08T00:55:21Z","Content":"\n\u003Cp\u003EThat doesn\u0027t really go with what you\u0027ve been doing.\u003C/p\u003E\n"},{"CreatedByName":"Kerbas_ad_astra","CreatedById":126593,"CreatedDateTime":"2015-01-08T01:16:33Z","Content":"\n\u003Cp\u003EA set of propulsion parts fitting the IR rework visual style could be cool, but Firespitter already has foldable electric propellers and the USI Exploration pack has some very slick electric ducted fans. I think there\u0027s something to be said for limiting IR parts to support and motion, and leaving the end effectors up to other mods.\u003C/p\u003E\u003Cp\u003EOn the other hand, your wheels look stunning, and it\u0027s a good thing they\u0027re in the pipeline, as I\u0027m not aware of any other omniwheels being actively developed/updated (though I sure wouldn\u0027t mind being proven wrong on this point), so maybe a few niche props wouldn\u0027t be a bad idea after all.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-01-08T05:46:55Z","Content":"\n\u003Cp\u003EOoooh! Welcome back! And well, I am not sure how useful that light on landing leg would be after landing. I can always use a light somewhere higher up the craft to have a wider view of the surrounding and still shines on things below.\u003C/p\u003E\u003Cp\u003EBut I imagine that landing leg would make awesome mech feet.\u003C/p\u003E\n"},{"CreatedByName":"rabidninjawombat","CreatedById":108889,"CreatedDateTime":"2015-01-08T06:01:26Z","Content":"\n\u003Cp\u003EReally like the look of those landing legs (and hell yes to the integrated light)\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-01-08T11:58:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EOoooh! Welcome back! And well, I am not sure how useful that light on landing leg would be after landing. I can always use a light somewhere higher up the craft to have a wider view of the surrounding and still shines on things below.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s because some people don\u0027t like or can\u0027t have too many parts because they, like I do, play on a potato.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2015-01-08T12:02:44Z","Content":"\n\u003Cp\u003EHey its good to see you back here, everything alright in RL?\u003C/p\u003E\u003Cp\u003ENice update of the foot, I\u0027m totally for a landing light.\u003C/p\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2015-01-08T13:25:54Z","Content":"\n\u003Cp\u003EGood to see you back - mark me down as another vote for the integrated light.\u003C/p\u003E\n"}]}