{"TopicId":59543,"ForumId":44,"TopicTitle":"Mars colony: water piping","CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2014-01-10T16:26:10Z","PageNum":1,"Articles":[{"CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2014-01-10T16:26:10Z","Content":"\n\u003Cp\u003EThere are many plans for colonizing Mars, by many different groups. I can\u0027t help but wonder how water would be piped between different modules. Is there some way to insulate the pipes enough so that the extremely cold winter conditions wouldn\u0027t freeze the liquid water in the pipes? I think burying the piping would be the best plan, since that\u0027s what we do on earth. Permafrost would make it difficult, so let\u0027s say that option is out. How might this work?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-01-10T16:35:38Z","Content":"\n\u003Cp\u003EBurying is good. And if you will not allow digging in the ground to do so, then just lay the pipes on the ground and cover them with dirt when we cover all the habitat modules with dirt. But mainly, constantly circulate hot water through the pipe loop, from the nuclear reactor to all the hab modules and back as the basic heating system. Tap water out of the loop at each module as needed for use.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-01-10T16:39:40Z","Content":"\n\u003Cp\u003EDefrosting pipes is childs play compared to actually setting up a mars base \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, you have to realize there is very little atmosphere on Mars, so you\u0027d lose very little heat to convection etc. So your water will cool very slowly. You could just slowly circulate it around the base and use it as coolant for other systems and that should keep it liquid.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-10T16:56:14Z","Content":"\n\u003Cp\u003Ei live in alaska (which seems to be the tropics lately) and wherever you have an exposed pipe you usually have to put a heat tape on it. which is just a small low power heater that has one job, keep the pipe from freezing. combined with insulation they are super effective. but given the thin atmosphere the heat transfer characteristics (and correct me if im wrong) would probibly make it hard to disperse waste heat into the atmosphere. so you could probibly just have a heat exchanger on the pipes to dump the waste heat into whatever you are moving over the pipe. this would serve double duty of getting rid of waste heat and keeping pipes from freezing.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-01-10T16:57:31Z","Content":"\n\u003Cp\u003ECoolants eventually get contaminated by bacteria like iron bacteria and fungi.\u003C/p\u003E\u003Cp\u003EWhat you need is good insulation (not a problem) and countercurrent exchange of heat. It\u0027s really not a big deal. Setting up a base in the first place... That is.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Countercurrent_exchange\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Countercurrent_exchange\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Raven.","CreatedById":99340,"CreatedDateTime":"2014-01-10T17:42:40Z","Content":"\n\u003Cp\u003EAs people have already mentioned, if you have a base set up on Mars, then preventing a pipe from freezing is child\u0027s play. We already have the technology in use in various parts of the world. We would just need to pack it, fly it, and land it (easier said than done). Also, with very little magnetosphere and no UV protection, I imagine that you can use the solar radiation to heat the pipes and to provide heat for your base occupants.\u003C/p\u003E\n"},{"CreatedByName":"CougarMagnum","CreatedById":24962,"CreatedDateTime":"2014-01-10T18:28:24Z","Content":"\n\u003Cp\u003EIt wouldn\u0027t be quite as much of a problem as you might originally think. Mars is frigid, but the atmosphere is quite thin (less than 1% Earth\u0027s), which means that very little heat would be lost through conduction and convection. Most of the heat transfer would occur through radiation. As has been suggested, heat tape would probably do the trick anyway. No biggie.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-01-10T19:12:53Z","Content":"\n\u003Cp\u003EIf you have nuclear reactor installed, keeping things warm stops being a problem.\u003C/p\u003E\n"},{"CreatedByName":"Raven.","CreatedById":99340,"CreatedDateTime":"2014-01-10T20:11:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EIf you have nuclear reactor installed, keeping things warm stops being a problem.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my opinion, this is probably not a good idea. Real world nuclear reactors are typically located very close to a body of water for the purposes of cooling (Fukishima for example). These reactors will pump water in from a nearby body of water of which they will then superheat; the water is instantly turned to very hot steam. If you put a reactor on Mars, you would have to have a way to cool it. There\u0027s no fluid water on Mars, meaning that you would have to mine ice in order to feed your reactor or use a much different cooling system, such as a gas system using either helium or CO2. Another thing to consider is that a cooling system merely relocates the heat. You still have to have a way to get rid of it. On earth, that means dumping water from your secondary coolant loop into a body of water. On Mars, this means radiating the heat, which not as effective.\u003C/p\u003E\u003Cp\u003EBasically, you\u0027re right. Keeping things warm stops being a problem. But things getting way too warm becomes your new problem; it would be a martian bar-b-Que. The reactor would very quickly melt down I would imagine. The good news is that Mars is a dead planet, so if your reactor melts down and radiates the landscape you\u0027re not killing anything except yourself.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-01-10T20:37:16Z","Content":"\n\u003Cp\u003EYou can use large radiators on Mars, and/or use the waste heat to melt water.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-01-10T20:50:36Z","Content":"\n\u003Cp\u003EWhat is perhaps an interesting question is whether burying is actually better than suspending them in the thin air, here on earth burying is a no-brainer, but perhaps the thin air changes that. I don\u0027t know.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2014-01-10T21:06:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EIf you have nuclear reactor installed, keeping things warm stops being a problem.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInstead, keeping the reactor the cool becomes a problem - because the same the same thin atmosphere that slows down convection from your water pipe *also* slows down convention from any radiator system for the reactor. It\u0027s a nice problem to have, but it is a problem.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-01-10T22:02:22Z","Content":"\n\u003Cp\u003EBeing that nuclear reactors have been designed for use in space (where you don\u0027t have a source of cooling water available), they could also work on Mars. You just need a proper radiator system.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-10T23:22:43Z","Content":"\n\u003Cp\u003Eyea, dont let the fact that we are still using first and second generation pressurized water reactors be an indication of the state of the art in nuclear technology (perhaps circa 1970, and thats being generous). were probibly going to use a liquid metal cooled reactor with radiators (like the ones flown in space by the soviets, us), and thats assuming we haven\u0027t cracked fusion before we get to mars (neither one seems to be happening any time soon).\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-01-11T01:16:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Raven.\u0022 data-cite=\u0022Raven.\u0022\u003E\u003Cdiv\u003EIn my opinion, this is probably not a good idea. Real world nuclear reactors are typically located very close to a body of water for the purposes of cooling (Fukishima for example). These reactors will pump water in from a nearby body of water of which they will then superheat; the water is instantly turned to very hot steam. If you put a reactor on Mars, you would have to have a way to cool it. There\u0027s no fluid water on Mars, meaning that you would have to mine ice in order to feed your reactor or use a much different cooling system, such as a gas system using either helium or CO2. Another thing to consider is that a cooling system merely relocates the heat. You still have to have a way to get rid of it. On earth, that means dumping water from your secondary coolant loop into a body of water. On Mars, this means radiating the heat, which not as effective.\u003Cp\u003EBasically, you\u0027re right. Keeping things warm stops being a problem. But things getting way too warm becomes your new problem; it would be a martian bar-b-Que. The reactor would very quickly melt down I would imagine. The good news is that Mars is a dead planet, so if your reactor melts down and radiates the landscape you\u0027re not killing anything except yourself.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECommercial nuclear power plants usually use pressurized water reactors (PWR). That\u0027s not the stuff you\u0027d be using in space. It\u0027s huge.\u003C/p\u003E\u003Cp\u003EYou\u0027d use a compact reactor with highly enriched uranium, liquid alkali metal alloy coolant and radiators for cooling.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.etec.energy.gov/Operations/Major_Operations/MajorOpsImages/SNAP_10A_Thermodynamic_cycle.jpg\u0022 alt=\u0022SNAP_10A_Thermodynamic_cycle.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt can be done, and it was actually done. As you can see, the energy is not very high, but sufficient for a small base.\u003C/p\u003E\u003Cp\u003ESuch reactors would obviously have lots of automatic protection systems and would not be prone to steam bubbles, water attacking zirconium, hydrogen explosions and other typical stuff.\u003C/p\u003E\u003Cp\u003EThere is one problem - radiation. Such reactors aren\u0027t shielded. Lots of neutron and gamma radiation would be shining in all directions. The reactor would have to be in a hole or behind a regolith mound.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2014-01-11T11:44:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Raven.\u0022 data-cite=\u0022Raven.\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBasically, you\u0027re right. Keeping things warm stops being a problem. But things getting way too warm becomes your new problem; it would be a martian bar-b-Que. The reactor would very quickly melt down I would imagine. The good news is that Mars is a dead planet, so if your reactor melts down and radiates the landscape you\u0027re not killing anything except yourself.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, obviously, a reactor used to provide heating and electricity for a martian colony would be small enough to be effectively cooled by dumping the waste heat into the colony as heating. So nothing would melt down.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-11T16:16:24Z","Content":"\n\u003Cp\u003Eyou could also potentially use waste heat for extracting water from martian soil. you could actually dump a lot of waste heat into the ground. dig a hole and bury a cooling loop. then have a sub surface membrane capture any moisture liberated in the process.\u003C/p\u003E\n"}]}