{"TopicId":59582,"ForumId":18,"TopicTitle":"Aurora","CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2014-01-10T23:50:54Z","PageNum":1,"Articles":[{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2014-01-10T23:50:54Z","Content":"\n\u003Cp\u003EAs far as I\u0027ve seen, it looks interesting,\u003C/p\u003E\u003Cp\u003EBut I\u0027m installing it and it\u0027s saying stuff about system files and asking me if I want to save files instead it making new ones\u003C/p\u003E\u003Cp\u003EIs it hacking my computer or something?\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-01-11T00:27:32Z","Content":"\n\u003Cp\u003EYes, of course it is hacking your computer ... so the aliens can control it.\u003C/p\u003E\u003Cp\u003EWell, dunno what you mean ... the base of the game is Access and VB, so it might need the Access and VB Runtime-Environments ...\u003C/p\u003E\u003Cp\u003Eso, if you donÃ‚Â´t have Access or Visual Studio on your computer, you might be prompted to install them\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2014-01-11T18:20:22Z","Content":"\n\u003Cp\u003EM\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EYes, of course it is hacking your computer ... so the aliens can control it.\u003Cp\u003EWell, dunno what you mean ... the base of the game is Access and VB, so it might need the Access and VB Runtime-Environments ...\u003C/p\u003E\u003Cp\u003Eso, if you donÃ‚Â´t have Access or Visual Studio on your computer, you might be prompted to install them\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eit starts and everything, but I can\u0027t get it to apear on screen, I only see something when I open this \u0022galaxy view\u0022 thing and then I can\u0027t really do anything, and what I\u0027m guessing is the tutorial game won\u0027t even start\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-01-11T18:47:52Z","Content":"\n\u003Cp\u003EOh I see, it definitely can be confusing for people ...\u003C/p\u003E\u003Cp\u003Eat the beginning (after selecting the game) you only see the menu bar.\u003C/p\u003E\u003Cp\u003EI recommend you use the system map view (F3) as this is the view that you will (want to) be on most of the time \u003C/p\u003E\u003Cp\u003E(there you also have buttons to switch to most of the other screeens, so I guess it may be called the main game window)\u003C/p\u003E\u003Cp\u003EAnother thing that could be important for you may be the Spacemaster-Mode (Spacemaster-Menu-\u0026gt; Spacemaster On).\u003C/p\u003E\u003Cp\u003EIt is partially Cheatmode, but partially also serves to do some \u0022allowed\u0022 things.\u003C/p\u003E\u003Cp\u003EFor example preselecting Techs (when you define/create an Empire, you also have a certain number of Tech points available which you can put into techs (without having to research them ) ... Spacemaster Mode allows you to assign them\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-11T19:01:23Z\u0022 title=\u002201/11/2014 07:01  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 11, 2014\u003C/time\u003E by Godot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JacenHan","CreatedById":57331,"CreatedDateTime":"2014-01-17T07:34:47Z","Content":"\n\u003Cp\u003EWhen you\u0027re installing it, it will ask whether you want to keep the DLLs you have or replace them with it\u0027s own, be sure to hit \u0022Yes\u0022 to keep your files.\u003C/p\u003E\u003Cp\u003EIf you need some help, feel free to post on the official forums, there\u0027s quite a few people there who will gladly answer any questions you have.\u003C/p\u003E\n"}]}