{"TopicId":59669,"ForumId":44,"TopicTitle":"The bend in the SABRE engine: Why is it there?","CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2014-01-11T21:11:51Z","PageNum":1,"Articles":[{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2014-01-11T21:11:51Z","Content":"\n\u003Cp\u003EOne of the distinguishing features of the SABRE engine, is that the whole engine nacelle is bent. Upon doing a small bit of research the only explanation as to why it was bent was that it had something to do with getting more air into the engine, but if this is so, then why isn\u0027t such a bend incorporated in all jet engines?\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-01-11T21:24:49Z","Content":"\n\u003Cp\u003EI think it\u0027s because the wings don\u0027t generate much lift, so the engines have to help by thrusting slightly upwards. However, the air intakes still need to be pointed into the air flow.\u003C/p\u003E\n"},{"CreatedByName":"Kraken tamer","CreatedById":42400,"CreatedDateTime":"2014-01-11T23:00:59Z","Content":"\n\u003Cp\u003EI disagree that pointing the engines in a direction other then the direction of flight would be beneficial. And if they really needed to partially support the weight of the craft with thrust, they could have just pointed the nozzle in the downwards direction and kept the pre-cooler stage strait. My theory (and it\u0027s just a theory) is that they plan to use the shape of the engine as a lifting surface, but I could be horribly wrong.\u003C/p\u003E\n"},{"CreatedByName":"Bunsen","CreatedById":10598,"CreatedDateTime":"2014-01-11T23:19:58Z","Content":"\n\u003Cp\u003EThere are two parts to it: which way the inlet points, and which way the exhaust goes. I think maccollo is right about using thrust to augment the wings\u0027 lift. Most aircraft don\u0027t do that, because when you design something to spend its entire operational life in the atmosphere, it makes sense to give it efficient wings. And other planes\u0027 engines may not be close to the center of mass anyway, so pointing them away from horizontal would create large pitching torques. So Skylon\u0027s nozzles are pointed more downward than other jets.\u003C/p\u003E\u003Cp\u003EThe other half is the inlet. Again, conventional aircraft have more efficient wings, so they fly with a relatively small angle of attack (i.e. the degree to which the nose or wing is pointed above the direction of flight). Small wings and thin air necessitate a large angle of attack. Also, flying at high Mach numbers requires inlets that use shock waves as part of their mechanism of action, and those are much pickier about angle of attack than those designed for subsonic flight. So the inlet has to be aligned with the airflow during high-speed, high-altitude flight, where the angle of attack is quite large.\u003C/p\u003E\u003Cp\u003EYou can see a similar, though less pronounced, bend in the SR-71\u0027s inlets. They\u0027re pointed inward and slightly downward, since the Blackbird also maintained a fairly high angle of attack in the stratosphere and the fuselage would be pushing the air significantly outward by the time it reached the nacelles.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-11T23:22:28Z","Content":"\n\u003Cp\u003Enozzels bend down to keep them pointed into the airflow. the engine also needs to curve to line the thrust vector up with the cg. this is because most of the launch mass is fuel and it will change greately from ground to orbit. so the engines are configured to compensate.\u003C/p\u003E\u003Cp\u003Ealso ninja\u0027d\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-11T23:24:35Z\u0022 title=\u002201/11/2014 11:24  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 11, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kraken tamer","CreatedById":42400,"CreatedDateTime":"2014-01-12T00:31:53Z","Content":"\n\u003Cp\u003ENUKE: I think you may be on to something. It\u0027s difficult to say for sure because some pictures show the engines mounted inline with the low wing and other pictures show the engines mounted above the wing, inline with the center of mass.\u003C/p\u003E\u003Cp\u003EBunsen: I took a hard look at the SR71\u0027s engines. They inlets are angled down, as you say to face the relative airflow. I have no problem accepting this as fact.\u003C/p\u003E\u003Cp\u003EHowever, I still have problems believing that they would angle the nozzles down to compensate for lift produced by the wing. In every aircraft I have flown and seen, the engines are angled the opposite way to make them parallel with the direction of flight. Indeed the SR71 also does this. It\u0027s thrust vector has a negative angle of incidence as you can see in this photo: \u003Ca href=\u0022http://lide.uhk.cz/fim/student/tazlaon1/fotoFull/SR-71%20%285%29.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://lide.uhk.cz/fim/student/tazlaon1/fotoFull/SR-71%20%285%29.jpg\u003C/a\u003E and many others.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-01-12T02:20:33Z","Content":"\n\u003Cp\u003Ei just read the faq on their webpage.\u003C/p\u003E\u003Cp\u003Ewas going to link it but i cant seem to find it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-12T03:29:41Z\u0022 title=\u002201/12/2014 03:29  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 12, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"}]}