{"TopicId":59740,"ForumId":25,"TopicTitle":"Fastest Plane under 1.000m. [WE HAVE REACHED MACH 5!, Tidus Klein at 1,714 m/s]","CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-01-12T13:14:06Z","PageNum":10,"Articles":[{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-02-15T19:10:14Z","Content":"\n\u003Cp\u003EI guess that intake can take as much air as it wants, it\u0027s not completely blocked, even if if\u0027s technicaly behind one. I guess that kind of fairing is OK.\u003C/p\u003E\u003Cp\u003EThe clipped landing gear, I think it\u0027s just because is partialy hidden with a fairing, need more pictures to see!\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-02-15T22:55:59Z","Content":"\n\u003Cp\u003Eya the gear is just blocked by a fairing. uuu do i have to do a run and then land or can i just takeoff and turn around instantly, This thing is a pain to fly that fast. and even harder to land. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: ok I landed it.... blew up some engines coming down but meh ... I also posted a pic of the rear landing gear.\u003C/p\u003E\u003Cp\u003EAll pics added to album.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-15T23:11:24Z\u0022 title=\u002202/15/2014 11:11  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 15, 2014\u003C/time\u003E by Tidus Klein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-02-15T23:59:11Z","Content":"\n\u003Cp\u003Eis the B9 landing gear as indestructible as the stock gear, in that the latter loses physics the second you move to the launchpad or runway?\u003C/p\u003E\n"},{"CreatedByName":"Visari","CreatedById":78487,"CreatedDateTime":"2014-02-16T03:52:03Z","Content":"\n\u003Cp\u003EB9 gear is actually extremely fragile in current state.\u003C/p\u003E\u003Cp\u003EIt requires balance tweaks posted in the B9 thread and other places.\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2014-02-17T12:03:29Z","Content":"\n\u003Cp\u003EThe B9 landing gear on its own is quite robust. Its ability to connect to other parts, however, is quite feeble (without the fixes) and is quite prone to twisting in ways not condusive to travel.\u003C/p\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2014-02-17T14:16:04Z","Content":"\n\u003Cp\u003EThis is not an official entry since I have not landed it and did not break the current non-fairing record....but I\u0027ll get there!\u003C/p\u003E\u003Cp\u003EI do have TV Pizza and Aerospace, so this might actually go a lot faster if I remove that.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i428.photobucket.com/albums/qq9/BubbaWilkins/screenshot20_zps8d7eafe5.png\u0022 alt=\u0022screenshot20_zps8d7eafe5.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-17T14:31:21Z\u0022 title=\u002202/17/2014 02:31  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 17, 2014\u003C/time\u003E by BubbaWilkins\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-02-17T14:56:31Z","Content":"\n\u003Cp\u003EYes I agree using half fairinged planes is breaking physics a bit. But it also makes the plane incredibly unstable, pushing your center of drag or COD heavily to one side ( why do you thing I have 4 small control surfaces on the bottom, when all i would need is 2?)\u003C/p\u003E\u003Cp\u003E Now COD off center is no real problem when your flying at normal speeds at normal altitudes, but at these insane speeds so low a small control surface produces an insane 48 kn of drag, about the same for a turbo jet, and a drag chute at 28. \u003C/p\u003E\u003Cp\u003EAnother thing here is that I\u0027m literally using less then half the engines of the current record holder and going near 200 m/s faster and I know my plane can go faster, I have had her up to 1760 m/s before losing control and blowing up do to insane G loads. and here lies the other problem,\u003C/p\u003E\u003Cp\u003EIn order to go this fast so low you have to to one of two things, MOAR ENGINES, or less drag. ether way you go once you start getting to the extremes of ether end your going to have problems be it structural and fuel related or COD off set,\u003C/p\u003E\u003Cp\u003E The main problem with my end is its high instability and float characteristic, even with 7 SAS\u0027s the plane drifts to one side or side-slip and as soon as it gets higher then 3 degrees to direction of travel X( your past the point of no return. you could fix this with a vertical stabilizer, but then that\u0027s more drag..... now you see the dilemma/ Challenge, how fast can I go with out flying out of control with as little control surfaces as possible.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-17T15:01:12Z\u0022 title=\u002202/17/2014 03:01  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 17, 2014\u003C/time\u003E by Tidus Klein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-02-17T21:14:48Z","Content":"\n\u003Cp\u003EYes, one of the things I considered more genius is to change control surfaces for lots of sas modules, just to reduce drag, as it seems to do more harm at those speeds than some extra weight!\u003C/p\u003E\u003Cp\u003EAlso, I wonder why no one tryed to do a wider design, with all the engines covered behind the front, maybe it\u0027s just a **** \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2014-02-18T02:06:35Z","Content":"\n\u003Cp\u003EHere is my entry. It\u0027s not a winner, but it reaches Mach 2 and is (in my opinion) the best looking entry yet.\u003C/p\u003E\u003Cp\u003EI based this puppy on the F-19 Stealth Fighter, a fictional airplane from an eponymous game.\u003C/p\u003E\u003Cp\u003EVideo!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/pGNdodGdewk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EFinal top speed: 692.8 m/s (Mach 2.045)\u003C/p\u003E\u003Cp\u003EFastest speed is at 5:43\u003C/p\u003E\u003Cp\u003ENotes I have found while testing this thing:\u003C/p\u003E\u003Cp\u003EUsing stock landing gear instead of B9 landing gear gained me almost 20 m/s.\u003C/p\u003E\u003Cp\u003EThe brakes on the default landing gear are pathetic.\u003C/p\u003E\u003Cp\u003EP-wings are hilariously robust.\u003C/p\u003E\u003Cp\u003EAllmoving P-Wings have remarkably little drag.\u003C/p\u003E\u003Cp\u003EIf you want this challenge done without clipping, every entry in the challenge would be disqualified, as all parts \u0022clip\u0022 due to collision meshes not being exactly what the visual entails.\u003C/p\u003E\u003Cp\u003EIt\u0027s very hard to go fast at this altitude, and I think I did just about the best I could with an aerodynamically reasonable aircraft.\u003C/p\u003E\u003Cp\u003EI can\u0027t determine if FAR works on visual mesh or collision mesh...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-18T04:36:16Z\u0022 title=\u002202/18/2014 04:36  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 18, 2014\u003C/time\u003E by TheHengeProphet\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sevant","CreatedById":97597,"CreatedDateTime":"2014-02-18T02:17:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheHengeProphet\u0022 data-cite=\u0022TheHengeProphet\u0022\u003E\u003Cdiv\u003EHere is my entry. It\u0027s not a winner, but it reaches Mach 2 and is (in my opinion) the best looking entry yet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice plane, excellent landing! I couldn\u0027t agree more about the stock gear--both for speed and wimpy brakes. I enjoyed your use of a wing to slow down on the runway.\u003C/p\u003E\u003Cp\u003EAs to embedding video, there is a button labeled \u0022insert video\u0022 in the advanced post window. It will bring up a box for you to paste the video link into. Once you have done this and clicked \u0022ok\u0022, you should see a line similar to this in your post:\u003C/p\u003E\u003Cp\u003E[ VIDEO]\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/pGNdodGdewk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003ETo keep the above text from actually embedding a video, I put a space between the first bracket and the word \u0022VIDEO\u0022. In normal embedding, that space is not present.\u003C/p\u003E\n"},{"CreatedByName":"Sevant","CreatedById":97597,"CreatedDateTime":"2014-02-18T02:24:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tidus Klein\u0022 data-cite=\u0022Tidus Klein\u0022\u003E\u003Cdiv\u003ENOW I CLAM MY PRIZE!!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice job Tidus!\u003C/p\u003E\u003Cp\u003EOP: Is his run officially a new record?\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2014-02-18T04:29:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sevant\u0022 data-cite=\u0022Sevant\u0022\u003E\u003Cdiv\u003ENice plane, excellent landing! I couldn\u0027t agree more about the stock gear--both for speed and wimpy brakes. I enjoyed your use of a wing to slow down on the runway.\u003Cp\u003EAs to embedding video, there is a button labeled \u0022insert video\u0022 in the advanced post window. It will bring up a box for you to paste the video link into. Once you have done this and clicked \u0022ok\u0022, you should see a line similar to this in your post:\u003C/p\u003E\u003Cp\u003E[ VIDEO]\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/pGNdodGdewk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003ETo keep the above text from actually embedding a video, I put a space between the first bracket and the word \u0022VIDEO\u0022. In normal embedding, that space is not present.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! Now I know how to use that feature.\u003C/p\u003E\u003Cp\u003EThe use of the wing to slow down was completely unintentional, as I had to land with the front wheel brake enabled, causing instability. I was so glad when nothing broke, as this was the fourth recording... The first flight had the better landing, but the plane just sailed off the end of the runway after braking the entire length of it.\u003C/p\u003E\n"},{"CreatedByName":"palker","CreatedById":67355,"CreatedDateTime":"2014-02-18T07:49:22Z","Content":"\n\u003Cp\u003EFinally managed to make a plane that can land although i had to sacrifice some speed to get there. I tried many different arrangements even tried to make a swing wing using KAS but nothing really worked so i had to add a piece of wing with low sweep near centre of the aircraft so that i can slow down for landing without that all landings ended in a flip and explosion. Max speed was 2.436 Mach which is about a half of the current record but well at least my plane still looks like an aeroplane. Anyway since i use TV PP i cannot go faster than 1100 m/s on jet power. The last two images in album show what happened when i swapped the central turbojet engine for ramjet and climbed into higher altitude. I almost circumnavigated Kerbin with it but unfortunately ramjet lacks electric generator so i run out of power just before reaching KSC and crashed.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/ZSO5c\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/ZSO5c\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-02-18T12:25:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sevant\u0022 data-cite=\u0022Sevant\u0022\u003E\u003Cdiv\u003ENice job Tidus!\u003Cp\u003EOP: Is his run officially a new record?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell!, I missed his new pictures. I think it\u0027s near the clipping border. Im worried about clipping engines, fuel, sas, anything that significantly reduces the size of the plane in order to reduce drag with FAR, and to give some bigger advantage, but this plane has new features wich are the ones that are giving him the speed edge. So my though is that yes, it\u0027s a new record.\u003C/p\u003E\u003Cp\u003EAnyway, I dont want to be the only \u0022ruler\u0022, you all who participated in this challenge has the word if you think this goes beyond the \u0022standar and normal\u0022 clipping in this game (little clipping in few parts).\u003C/p\u003E\u003Cp\u003EIll update the leaderboard for now\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-02-18T15:02:22Z","Content":"\n\u003Cp\u003EThe only part that\u0027s really partly clipped is the landing gear in the back, do to KSP clipping it when I was turning it to meet the ground right, and the engines are sort of do to again KSP not being good at putting thous small tanks on OTHER then that.......\u003C/p\u003E\u003Cp\u003E(holds up trophy) I WOULD LIKE TO THANK THE ACADEMY....AND ALL THE PEOPLE THAT INSPIRED ME!........myself:D\u003C/p\u003E\n"},{"CreatedByName":"Sevant","CreatedById":97597,"CreatedDateTime":"2014-02-18T19:10:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tidus Klein\u0022 data-cite=\u0022Tidus Klein\u0022\u003E\u003Cdiv\u003E(holds up trophy) I WOULD LIKE TO THANK THE ACADEMY....AND ALL THE PEOPLE THAT INSPIRED ME!........myself:D\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E[Ten Character Limit]\u003C/p\u003E\n"},{"CreatedByName":"TheBobWiley","CreatedById":30280,"CreatedDateTime":"2014-02-18T21:28:53Z","Content":"\n\u003Cp\u003EHi guys, First off, Ive never had luck building planes that A. can lift off before the end of the runway and B. stay straight while flying.\u003C/p\u003E\u003Cp\u003EWith both of these hurdles in mind I saw this challenge and thought, hey, I bet I could build a light plane to go in the \u0022stock\u0022 category (no FAR).... Well here she is, I even grabbed first place while I was at it! - I will upload the video later tonight, takes forever to convert from FRAPs to youtube....\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/pQJpn\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-18T21:37:40Z\u0022 title=\u002202/18/2014 09:37  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 18, 2014\u003C/time\u003E by TheBobWiley\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheBobWiley","CreatedById":30280,"CreatedDateTime":"2014-02-19T00:55:49Z","Content":"\n\u003Cp\u003EAnd the proof! - I just noticed I dipped above 1,000m on take off, but my top speed was reached after I leveled out under the limit. I can redo it if needed.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/1RM28VcRgJg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-02-19T05:43:42Z","Content":"\n\u003Cp\u003Eerrrr... what flight information system are you using? That certainly is not the stock resources box in the video.\u003C/p\u003E\n"},{"CreatedByName":"TheBobWiley","CreatedById":30280,"CreatedDateTime":"2014-02-19T06:52:18Z","Content":"\n\u003Cp\u003EI actually have quite a few mods installed, but none of them change the game play (like FAR). I was using all stock parts on this plane too. The resource panel is KSP Alternate Resource Panel. I also had Mechjeb to keep track of my plane\u0027s drag and air needs, as well as weight and TWR. Im pretty certain stock atmosphere engines can\u0027t go much faster under 1000m without FAR, I had 50 of them going on a plane and it maxed out at 380 no matter what I tried.\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-02-19T13:12:43Z","Content":"\n\u003Cp\u003Eha That\u0027s a cute little plane.....Nice job!\u003C/p\u003E\n"},{"CreatedByName":"ExPatriotMissile","CreatedById":104046,"CreatedDateTime":"2014-02-21T08:43:46Z","Content":"\n\u003Cp\u003EI was working on this challenge with stock parts in the stock flight model and noticed that a much higher velocity can be reached if the plane is shaken violently while under the control of SAS. This single engine craft made it to 400 m/s under 600m altitude, and I even forgot to empty the oxidizer! Is this a bug in the physics engine that other people have noticed?\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/fiHgy\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"TheBobWiley","CreatedById":30280,"CreatedDateTime":"2014-02-21T20:02:22Z","Content":"\n\u003Cp\u003EExPatriotMissile, yes, both me and Hejnfelt accidentally utilize the bug you experienced. It is a part of the infiniglide physics bug. As the plane passes mach 1 in the stock game the planes begin to shake which makes SAS move the control surfaces really fast, which produce lift and reduce drag the more they move, thus going faster. The stock \u0022speed limit\u0022 for air engines under 1000m seems to be right at 360 km/h without abusing any part of the physics bug. I built a super sleek 50 engine powered plane and without it shaking it could not pass 360 km/h, as soon as I nosed up and got the plane shaking it easily passed 400 km/h. This challenge is not good for stock unfortunately \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-02-21T20:16:36Z","Content":"\n\u003Cp\u003EI did a stock (on Vanilla .23 with FAR as the only addon), with no active control surfaces apart from the (slow and low) standard tailplane setup and Delta wings, couldn\u0027t get past 390m/s, period. Even as high as 10km. Didn\u0027t matter how many engines I added - managed to get up to 8 on a pair of Quads.\u003C/p\u003E\n"},{"CreatedByName":"lunait","CreatedById":74383,"CreatedDateTime":"2014-02-23T10:22:51Z","Content":"\n\u003Cp\u003EI found out a neat trick. Technically it\u0027s within the rules of the challenge. The trick is to partially hide the wings within the fairing, so that they don\u0027t generate any drag (but also no lift - however, the plane can still take off from the runway). Then, when you ditch the fairing, the wings start generating drag and lift. Since I\u0027ve noticed that wings are often the parts generating the most drag at high speeds, this can actually help you quite a lot. (NB: This method only seems to work with static wings, i.e. not canards or control surfaces.)\u003C/p\u003E\u003Cp\u003EUsing this method together with the other tricks I\u0027ve seen in this thread, I could get up to ~1400 m/s with this relatively simple plane seen below. I have not yet been able to land it, though.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/OCixl\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve obviously seen people hide other things within fairings, but I don\u0027t know if anyone\u0027s using this trick specifically with wings yet, so I\u0027m sharing it for the common goal of MORE SPEED!!!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T10:34:21Z\u0022 title=\u002202/23/2014 10:34  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by lunait\u003C/strong\u003E\n\u003C/span\u003E\n"}]}