{"TopicId":59829,"ForumId":55,"TopicTitle":"Crew report stacking","CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-01-13T03:59:23Z","PageNum":1,"Articles":[{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-01-13T03:59:23Z","Content":"\n\u003Cp\u003EPlease consider allowing crew reports to \u0027stack\u0027 in a command pod provided they are from different situations\u003C/p\u003E\u003Cp\u003EIt seems incongruous that you can EVA a Kerbal to collect (and subsequently store) any number of (different) reports from outside, including experiment retrievals, but only store one crew report\u003C/p\u003E\u003Cp\u003EIf the report is \u0027storable\u0027, it seems like it should be stackable like any other datum, and not be an exception to the behaviour of \u0027data\u0027 in-game\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-01-13T04:19:39Z","Content":"\n\u003Cp\u003EI would like to see this as well.\u003C/p\u003E\n"},{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2014-01-13T13:18:40Z","Content":"\n\u003Cp\u003EThe crew report is only really valid as data as soon as it is made and transmitted.\u003C/p\u003E\u003Cp\u003EIt is a report on what is happening right now.\u003C/p\u003E\u003Cp\u003EIf you are making a second report then the first has already lost much of its value.\u003C/p\u003E\u003Cp\u003EWould you send a kerbal into space without the means to communicate? Of course not.\u003C/p\u003E\u003Cp\u003EAnd so you would like him to report at significant times during the mission.\u003C/p\u003E\u003Cp\u003EPutting off a report until later would never do.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-01-13T13:46:58Z","Content":"\n\u003Cp\u003EIt makes no sense that you can transmit 10 reports back for 10 science each, but if you don\u0027t transmit you can only get one of those reports. As long as they\u0027re from different biomes you can store ANY NUMBER of ANY EXPERIMENT (including EVA reports, which are essentially crew reports from a space suit instead of a space ship) with one odd exception: Crew Reports.\u003C/p\u003E\u003Cp\u003EI guess Kerbals don\u0027t have pencils and paper in their capsules. Only in their suits. And when they\u0027re buckled in they can\u0027t reach them.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-13T13:52:31Z","Content":"\n\u003Cp\u003EYou can get EVA, collect data from the capsule, enter, and the crew report will be stored into the stored data folder. Any number of crew reports can be held in a capsule this way.\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2014-01-13T21:38:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EYou can get EVA, collect data from the capsule, enter, and the crew report will be stored into the stored data folder. Any number of crew reports can be held in a capsule this way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs noted, this is possible in the game currently with a little fidangle. Removing that extra busy work of exit pod/grab science/reenter pod would be nice, though.\u003C/p\u003E\u003Cp\u003EWhat could be asked for is that all experiments immediately place their results in the command pod \u0022data folder\u0022 after being run (automatically stacking inside as a side effect) rather than keeping them in the part that generated them. This gets complicated, though, since a vessel with only a probe core could not carry data, and vessels with multiple command pods would need a way to select which pod gets the data. It spoils the fun of having a kerbal interact with the science parts to move data around but removes some of the busy work, so... Neutral change, I think.\u003C/p\u003E\u003Cp\u003EI don\u0027t know if it\u0027s a great suggestion, but I think it\u0027s the next logical step to thinking out a solution to the problem laid out in the original post. Solves the problem and makes more aspects of science collection (potentially) easier to manage.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-01-13T21:47:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EYou can get EVA, collect data from the capsule, enter, and the crew report will be stored into the stored data folder. Any number of crew reports can be held in a capsule this way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe the OP is requesting a solution to a problem (I agree that this is a problem). \u003C/p\u003E\u003Cp\u003EWhat you posted is a work-around for the problem. It is not a solution.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-01-13T23:19:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daveroski\u0022 data-cite=\u0022Daveroski\u0022\u003E\u003Cdiv\u003EThe crew report is only really valid as data as soon as it is made and transmitted.\u003Cp\u003EIt is a report on what is happening right now.\u003C/p\u003E\u003Cp\u003EIf you are making a second report then the first has already lost much of its value.\u003C/p\u003E\u003Cp\u003EWould you send a kerbal into space without the means to communicate? Of course not.\u003C/p\u003E\u003Cp\u003EAnd so you would like him to report at significant times during the mission.\u003C/p\u003E\u003Cp\u003EPutting off a report until later would never do.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is not even representative of how it currently works, a Crew Report can be made and stored at any point, then \u0022handed in\u0022 when you recover the vessel, even if you made that report on the launchpad then did a return trip to Eeloo after. Nor are the crew reports things like \u0027after 10 minutes\u0027, \u0027after an hour\u0027, \u0027after a day\u0027, \u0027after a week\u0027, they\u0027re situational, a crew report from the surface of Ike doesn\u0027t become invalid because you later make a report from the surface of Duna, or any sequence of situations.\u003C/p\u003E\u003Cp\u003EThat might work if a crew report could never be stored (which would be fine too, no different a situational condition than barometer requiring atmosphere etc), representing a conversation between the capsule and mission control, requiring a live connection to mission control to even make.\u003C/p\u003E\u003Cp\u003EAnother option would be to make crew reports an automatic running total which accumulates during the mission as the capsule travels, the Kerbals are always making interesting notes (for any non-zero measure) instead of requiring constant micromanagement, and when you get back your \u0027crew report\u0027 is compiled from all the crews experiences\u003C/p\u003E\n"},{"CreatedByName":"JadedStoner","CreatedById":63684,"CreatedDateTime":"2014-01-14T04:04:38Z","Content":"\n\u003Cp\u003ELet\u0027s take this a step further and make Crew Reports part of a Mission Log. This could be the foundation for all the stats monkeys like myself who want to see when/where/how high Jeb was on his last go round. I imagine something like this:\u003C/p\u003E\u003Cp\u003EKerdate 4525.2 - Commander Jeb, personal log. KSP Launchpad: Bill forgot to pack the snacks again. Countdown holding at T-4:20 while the ground crew brings snacky cakes.\u003C/p\u003E\u003Cp\u003EKerdate 4525.9 - Commander Jeb, personal log. Low Kerbin Orbit: Wow... The sun just broke over the horizon, I wept. Bob had these inspirational words, \u0022Hey Jeb, check out this selfie I took with Kerbin!\u0022\u003C/p\u003E\u003Cp\u003EKerdate 4526.4 - Commander Jeb, personal log. 60km east of KSC, splashdown: Damn, reentry was AWESOME!!!! SPAM in a can indeed! See you back at KSC! \u003C/p\u003E\u003Cp\u003EThe game could \u0027geotag\u0027 locations and events like launch, reentry, descent, landing. I want my kerbalnauts earning flight badges for their uniforms!\u003C/p\u003E\n"},{"CreatedByName":"JimmyAgent007","CreatedById":74761,"CreatedDateTime":"2014-01-14T04:37:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JadedStoner\u0022 data-cite=\u0022JadedStoner\u0022\u003E\u003Cdiv\u003ELet\u0027s take this a step further and make Crew Reports part of a Mission Log. This could be the foundation for all the stats monkeys like myself who want to see when/where/how high Jeb was on his last go round. I imagine something like this:\u003Cp\u003EKerdate 4525.2 - Commander Jeb, personal log. KSP Launchpad: Bill forgot to pack the snacks again. Countdown holding at T-4:20 while the ground crew brings snacky cakes.\u003C/p\u003E\u003Cp\u003EKerdate 4525.9 - Commander Jeb, personal log. Low Kerbin Orbit: Wow... The sun just broke over the horizon, I wept. Bob had these inspirational words, \u0022Hey Jeb, check out this selfie I took with Kerbin!\u0022\u003C/p\u003E\u003Cp\u003EKerdate 4526.4 - Commander Jeb, personal log. 60km east of KSC, splashdown: Damn, reentry was AWESOME!!!! SPAM in a can indeed! See you back at KSC! \u003C/p\u003E\u003Cp\u003EThe game could \u0027geotag\u0027 locations and events like launch, reentry, descent, landing. I want my kerbalnauts earning flight badges for their uniforms!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll of this!\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-14T05:35:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EI believe the OP is requesting a solution to a problem (I agree that this is a problem). \u003Cp\u003EWhat you posted is a work-around for the problem. It is not a solution.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you want to keep multiple measurements from your thermometer, you do exactly the same - you go EVA, collect data from the instrument, and store it in the capsule. It does not make much sense that you need to go EVA to collect data from the capsule, but I don\u0027t think it is a problem. It just works the same way as other scientific instruments.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-01-14T06:18:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIf you want to keep multiple measurements from your thermometer, you do exactly the same - you go EVA, collect data from the instrument, and store it in the capsule. It does not make much sense that you need to go EVA to collect data from the capsule, but I don\u0027t think it is a problem. It just works the same way as other scientific instruments.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually that\u0027s what I think the main problem is, the clunky must-go-eva thing. You don\u0027t have to go EVA to scrub the goo containers. There should be a right click option on a (manned only?) capsule to \u0022collect all experiments,\u0022 and one on EVA\u0027d Kerbals as well to collect all the experiments within, say, 5 meters of them.\u003C/p\u003E\u003Cp\u003EAnd Crew Reports should just go into the \u0022collected\u0022 bin as soon as you opt to not transmit them.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-14T06:43:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EAnd Crew Reports should just go into the \u0022collected\u0022 bin as soon as you opt to not transmit them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is that the \u0022collected\u0022 bin is tied to a capsule. And you can have multiple capsules on your ship. You\u0027d need means to select the storage capsule and you\u0027d need means to transfer it between capsules and even between different ships anyway. EVA is not very comfortable but it solves these problems.\u003C/p\u003E\u003Cp\u003EBut it\u0027s true that a capsule could have a function \u0022store data from all experiments\u0022 and it would collect and store both the thermometer data and the crew report. Except people would still complain the crew report is not stored automatically while they want to keep the temperature measurement on the thermometer.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-01-14T07:27:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EAnd Crew Reports should just go into the \u0022collected\u0022 bin as soon as you opt to not transmit them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EThe problem is that the \u0022collected\u0022 bin is tied to a capsule. And you can have multiple capsules on your ship.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow is this a problem? Crew reports are also tied to a capsule. You have 18 capsules on your ship. Your do a crew report in capsule 12 and opt not to send it. It gets stored in capsule 12\u0027s \u0022collected\u0022 bin in exactly the same way as if you went EVA, took the report, and then stored it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou\u0027d need means to select the storage capsule and you\u0027d need means to transfer it between capsules and even between different ships anyway. EVA is not very comfortable but it solves these problems.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, I think I see the problem. You think I want to REMOVE the option for Kerbals to do this stuff EVA. No. That should be a nice, reliable fallback that always works for when you want to do something unconventional (note: I don\u0027t mean \u0022wrong\u0022 or \u0022dumb\u0022 here, just uncommon and impossible to generalize in code beforehand) like transfer a crew report from one capsule to another, same ship or not.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EExcept people would still complain the crew report is not stored automatically while they want to keep the temperature measurement on the thermometer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople will complain no matter what they do \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But I still think that (within reason) the more options available to reduce redundant clicking and juggling of Kerbals, capsules, and experiments around will be beneficial. It\u0027s fine to take the temperature data from the thermometer and store it in the capsule, it\u0027s another to do it in a dozen biomes on all 5 pieces of science equipment plus crew reports.\u003C/p\u003E\u003Cp\u003EI\u0027ve considered strongly putting a Kerbal in a chair on the side of my rocket within reach of all experiments and the capsule, simply for the purpose of collecting experiments and storing them.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-01-14T15:01:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoMrBond\u0022 data-cite=\u0022NoMrBond\u0022\u003E\u003Cdiv\u003EThat is not even representative of how it currently works, a Crew Report can be made and stored at any point, then \u0022handed in\u0022 when you recover the vessel, even if you made that report on the launchpad then did a return trip to Eeloo after. Nor are the crew reports things like \u0027after 10 minutes\u0027, \u0027after an hour\u0027, \u0027after a day\u0027, \u0027after a week\u0027, they\u0027re situational, a crew report from the surface of Ike doesn\u0027t become invalid because you later make a report from the surface of Duna, or any sequence of situations.\u003Cp\u003EThat might work if a crew report could never be stored (which would be fine too, no different a situational condition than barometer requiring atmosphere etc), representing a conversation between the capsule and mission control, requiring a live connection to mission control to even make.\u003C/p\u003E\u003Cp\u003EAnother option would be to make crew reports an automatic running total which accumulates during the mission as the capsule travels, the Kerbals are always making interesting notes (for any non-zero measure) instead of requiring constant micromanagement, and when you get back your \u0027crew report\u0027 is compiled from all the crews experiences\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou know, this is actually a pretty good idea, although instead of an accumulation, simply have it so that whenever a kerbal\u0027s situation changes (ie: low orbit, high orbit, SOI change, landed), a crew report is automatically generated.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-01-15T01:40:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmappedout\u0022 data-cite=\u0022allmappedout\u0022\u003E\u003Cdiv\u003EYou know, this is actually a pretty good idea, although instead of an accumulation, simply have it so that whenever a kerbal\u0027s situation changes (ie: low orbit, high orbit, SOI change, landed), a crew report is automatically generated.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, that\u0027s what I meant by accumulating, that the crew report would just automatically build up over the course of the mission as the capsule transitioned through the various situations.\u003C/p\u003E\u003Cp\u003EIf it remained 100% transmissible you could review and choose to transmit at any time -\u003Cem\u003Eor\u003C/em\u003E- you could treat it like other science (again, for consistency) and have transmission loss (we talked to mission control about it), science lab processed transmission (we added in all the measures, metrics and pictures etc) and recovery amounts (full debrief back at KSC).\u003C/p\u003E\n"},{"CreatedByName":"JadedStoner","CreatedById":63684,"CreatedDateTime":"2014-01-16T05:22:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JimmyAgent007\u0022 data-cite=\u0022JimmyAgent007\u0022\u003E\u003Cdiv\u003EAll of this!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks man! I think some roleplaying aspects would be great. I mean, who didn\u0027t want to be stationed at the helm of the Enterprise-D, sitting next to Ensign Buxom or Ensign Ethnic?\u003C/p\u003E\n"}]}