{"TopicId":60,"ForumId":34,"TopicTitle":"Wobbly rockets - Now 1.09 - 2 metre parts, verniers, payload fairings, MUCH more","CreatedByName":"Sunday Punch","CreatedById":125,"CreatedDateTime":"2011-07-08T22:19:42Z","PageNum":15,"Articles":[{"CreatedByName":"DrLucky","CreatedById":3060,"CreatedDateTime":"2011-08-17T15:38:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI played with that, too. It\u0027s a neato idea and it does work somewhat if you stack the retro and then the decoupler in the same stage (or it used to when the part was first included during KSP 0.8). You still lose velocity, but it kinda works. If anyone knows how to make it work flawlessly, please spill.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just built a test-bed to try out various configurations.\u003C/p\u003E\u003Cp\u003EThe test-bed rocket is pretty simple - I put a lateral tricoupler near the top of a powerful 1m central stage. Then I\u0027d hook whatever test rig to the top or bottom of the lateral.\u003C/p\u003E\u003Cp\u003EThe best results I obtained were the following:\u003C/p\u003E\u003Cp\u003E- decoupler\u003C/p\u003E\u003Cp\u003E- retro\u003C/p\u003E\u003Cp\u003E- rest of stage\u003C/p\u003E\u003Cp\u003EWith the retro staging \u003Cem\u003Ebefore\u003C/em\u003E the decouple, and staging by pressing space twice. This yields a small velocity decrease, but the retro works fine.\u003C/p\u003E\u003Cp\u003EPutting the retro in the stage \u003Cem\u003Ewith\u003C/em\u003E the decoupler and staging them together appears to do nothing; that is, the retro is a dud and the decoupler works fine.\u003C/p\u003E\u003Cp\u003ETrying to stage the retro \u003Cem\u003Elater\u003C/em\u003E than the decoupler does not appear to work.\u003C/p\u003E\u003Cp\u003EBear in mind that the retro is effectively a small solid motor with a 3.33 second fuel supply and the thrust vectored up. Despite the four-flame appearance, it\u0027s really just one thrust, straight up, due to the way KSP works. At any rate, it behaves like any other solid rocket, just backwards.\u003C/p\u003E\u003Cp\u003ETo see the operation of another small solid, try installing a lateral tricoupler under the command module, and put the following stack (bottom to top) on top of each limb of the tricoupler:\u003C/p\u003E\u003Cp\u003E- light decoupler\u003C/p\u003E\u003Cp\u003E- small solid motor\u003C/p\u003E\u003Cp\u003E- 1m parachute adapter\u003C/p\u003E\u003Cp\u003E- parachute\u003C/p\u003E\u003Cp\u003ESet the staging so the the solids fire a stage before the decoupler. Put the parachutes in a stage following the decouplers.\u003C/p\u003E\u003Cp\u003ELike so:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/NjZoC.jpg\u0022 alt=\u0022NjZoC.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EGo to the launch pad, and zoom out a ways.\u003C/p\u003E\u003Cp\u003EWhen you light the first stage, the solids will turn on, but be captive. Once you commit the second stage, the decouplers will let the lit solids go, which will fly away. Let the solids burn out, then activate the chutes. They should hit the pad either side of you if you don\u0027t punch the chutes too early:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/XRvFA.jpg\u0022 alt=\u0022XRvFA.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENow try it again, but move the solids and decouplers into the same stage. Note that the solids never light. You can try it with the solids in a later stage, too, but they don\u0027t work there, either.\u003C/p\u003E\u003Cp\u003ERetros do the same thing as these small solids -- if you don\u0027t light them explicitly \u003Cem\u003Eprior\u003C/em\u003E to separation, they don\u0027t function. Parachutes are the only parts which seem to work (ie: are triggerable) after separation.\u003C/p\u003E\u003Cp\u003EThe good news is that the retros are only 60 thrust for 3.33s, so if you\u0027re using them on a beefy rocket, they won\u0027t do much to your velocity.\u003C/p\u003E\u003Cp\u003EI also played with making a burnable decoupler - I moved the heat tolerance of a few decouplers down to 1 and 100, so that the retro would burn through them when activated. The results were not great; at a tolerance of 1, the decoupler is prone to break spontaneously during lower stage operation. At 100, it takes about as much time to burn through as staging manually would, plus there\u0027s an off-putting explosion (although it works). Perhaps there\u0027s a happy medium, but I didn\u0027t experiment long enough to find it.\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003EOkay; courtesy of someone\u0027s thread about making launchable missiles, I discovered how to make the retros work:\u003C/p\u003E\u003Cp\u003EAdd the line\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EActivatesEvenIfDisconnected = True\u003C/pre\u003E\u003Cp\u003E to the part.cfg for the retro.\u003C/p\u003E\u003Cp\u003ENow you can put it in the stage with the decoupler, and works fine.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-08-17T16:01:57Z","Content":"\n\u003Cp\u003EI don\u0027t see why putting the retro in the same stage as the decoupler wouldn\u0027t work. If you put ullage engines in the same stage as the decoupler, they fire along with it. Maybe it\u0027s something to do with it being on a \u0027discarded\u0027 segment of the rocket?\u003C/p\u003E\u003Cp\u003EAnd what happens if you rearrange the stage itself to have the two solids above the decoupler in the list? Does that make a difference to the order in which the game activates things? It might be that each stage reads from either the top down or the bottom up, sending activation commands to each item in sequence, one or two clock ticks apart, rather than sending simultaneous signals. If that\u0027s the case, then if you put the retrofire pack in the stage sequencer *before* the decoupler, it would get an activation command before the stage is decoupled, and therefore would work.\u003C/p\u003E\u003Cp\u003EI\u0027m certain that at least once, I did get a stage with a retropack to fire its retropack, the decoupler to activate, and ullage engines on the next stage to fire all in one swell foop...\u003C/p\u003E\n"},{"CreatedByName":"DrLucky","CreatedById":3060,"CreatedDateTime":"2011-08-17T16:12:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI don\u0027t see why putting the retro in the same stage as the decoupler wouldn\u0027t work. If you put ullage engines in the same stage as the decoupler, they fire along with it. Maybe it\u0027s something to do with it being on a \u0027discarded\u0027 segment of the rocket?\u003C/p\u003E\u003Cp\u003EAnd what happens if you rearrange the stage itself to have the two solids above the decoupler in the list? Does that make a difference to the order in which the game activates things? It might be that each stage reads from either the top down or the bottom up, sending activation commands to each item in sequence, one or two clock ticks apart, rather than sending simultaneous signals. If that\u0027s the case, then if you put the retrofire pack in the stage sequencer *before* the decoupler, it would get an activation command before the stage is decoupled, and therefore would work.\u003C/p\u003E\u003Cp\u003EI\u0027m certain that at least once, I did get a stage with a retropack to fire its retropack, the decoupler to activate, and ullage engines on the next stage to fire all in one swell foop...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor the record, I did try reordering the parts within the stage, and got the same result each time. I didn\u0027t try it with additional parts in the stage, and who knows, that might matter. It\u0027s pretty clear when the retros fire; they\u0027re not subtle and it lasts for 3\u002B seconds, and I wasn\u0027t able to get them to fire when co-staged with the decoupler.\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003EJust wondering what you might have been using as ullage engines, if I\u0027m going to try and reproduce? I mean, since ullage doesn\u0027t really matter (yet) in KSP, were you using an SRB? Or are you talking about a particular small engine from another parts kit? It might matter...\u003C/p\u003E\u003Cp\u003Ere-edit:\u003C/p\u003E\u003Cp\u003EI built another test-bed, and I\u0027m unable to reproduce the retros igniting unless explicitly lit \u003Cem\u003Ebefore\u003C/em\u003E separation.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Pf4FT.jpg\u0022 alt=\u0022Pf4FT.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI had noticed that at times I wasn\u0027t sure about whether or not the retros had lit, since the decoupler emits some particles as part of its operation. The stack of 6 retros eliminates all doubt \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It gets... bright... when they go off.\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027ve tried staging the retros with the decouplers and solids which remain attached; still no joy. If anyone can reproduce a retro firing with the decoupler, please let us know what you did!\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-08-18T02:24:38Z","Content":"\n\u003Cp\u003EI\u0027ve not reproduced it yet. The ullage engines are from Captain Slug\u0027s Radial Booster pack; they come with spin-stabilization engines and liquid- and solid-fuel vernier booster engines that can be very useful at times on designs with marginal performance...\u003C/p\u003E\n"},{"CreatedByName":"Rocket Surgeon","CreatedById":3719,"CreatedDateTime":"2011-08-18T02:38:54Z","Content":"\n\u003Cp\u003EI just want to say that I\u0027ve noticed that a lot of your parts, Sunday, wobble like jelly, the same as the chute nosecone adaptors mentioned earlier. I think it\u0027s most noticable in the short load-bearing size adaptors.\u003C/p\u003E\n"},{"CreatedByName":"BadManiac","CreatedById":5194,"CreatedDateTime":"2011-08-18T05:25:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd the wiggliness is almost certainly caused by the mass of that part being too low, I\u0027ll try and fix that for the next release.\u003C/div\u003E\u003C/blockquote\u003EI\u0027m eagerly awaiting this! Even tho the \u0027wiggliness\u0027 has caused some catastrophically hilarious launch attempts I\u0027d really like it gone.\u003Cp\u003EThanks for all your hard work Sunday Punch.\u003C/p\u003E\n"},{"CreatedByName":"Sunday Punch","CreatedById":125,"CreatedDateTime":"2011-08-18T12:04:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BadManiac\u0022 data-cite=\u0022BadManiac\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m eagerly awaiting this! Even tho the \u0027wiggliness\u0027 has caused some catastrophically hilarious launch attempts I\u0027d really like it gone.\u003C/p\u003E\u003Cp\u003EThanks for all your hard work Sunday Punch.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes part making is an iterative process, with every release I hope to get closer to perfection. I\u0027m pretty busy with coursework at the moment so the next update might be next week or something. Who knows!\u003C/p\u003E\u003Cp\u003EAnd you\u0027re welcome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Andras","CreatedById":3716,"CreatedDateTime":"2011-08-19T03:13:00Z","Content":"\n\u003Cp\u003ESunday- can you make some 3m nose cones, one with a detachable function, and one with the attachment point up inside the cone so cargo can stick up out of the decoupler below and still be hidden?\u003C/p\u003E\u003Cp\u003ESomething that looks like the top of the Ariane 5 or STS external tank.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2011-08-20T18:57:54Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/aXOQC.png\u0022 alt=\u0022aXOQC.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately having some problems on the lower stages... everything keeps breaking apart, particularly at the 2m - 3m shroud junction... hmmm.\u003C/p\u003E\n"},{"CreatedByName":"Warringer","CreatedById":328,"CreatedDateTime":"2011-08-21T13:16:16Z","Content":"\n\u003Cp\u003EOhhhh... Thats a nice upper stage...\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-08-21T14:10:28Z","Content":"\n\u003Cp\u003EStruts, dude, struts! 8)\u003C/p\u003E\u003Cp\u003ESeriously, I use struts at coupler junctions, which end up looking more like either clamps or ribs on the fairings, and they help a great deal in keeping the rocket from falling apart in flight.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2011-08-22T05:15:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdfox\u0022 data-cite=\u0022rdfox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EStruts, dude, struts! 8)\u003C/p\u003E\u003Cp\u003ESeriously, I use struts at coupler junctions, which end up looking more like either clamps or ribs on the fairings, and they help a great deal in keeping the rocket from falling apart in flight.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll give it a try. I thought the struts were just going to hold the whole thing together...\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2011-08-22T05:37:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warringer\u0022 data-cite=\u0022Warringer\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOhhhh... Thats a nice upper stage...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E More pictures are \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=2051.0\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. It doesn\u0027t do much, but I was looking more for something attractive-looking than capable of interstellar travel.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-08-22T13:55:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027ll give it a try. I thought the struts were just going to hold the whole thing together...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was my initial worry, but they separate when a decoupler is fired. Evidently, they have their own linear shaped charges to cut them, too!\u003C/p\u003E\n"},{"CreatedByName":"Andras","CreatedById":3716,"CreatedDateTime":"2011-08-23T01:10:46Z","Content":"\n\u003Cp\u003EHeh, whoops. I just fired a space probe right though the 2m cargo shell nosecone and they let it slip right out and then closed up behind it like nothing happened. Got the staging a little off but it was an interesting (and non-disasterous) result\u003C/p\u003E\n"},{"CreatedByName":"McLuv","CreatedById":2085,"CreatedDateTime":"2011-08-26T03:11:16Z","Content":"\n\u003Cp\u003EI find the 2m to 2x1m adaptor very problematic. It loves to wobble uncontrollably when connecting two 1m engines to the 2m tanks\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2011-08-26T10:37:55Z","Content":"\n\u003Cp\u003EKnown issue. Until it\u0027s fixed, the best workaround is three struts to hold the adapter firmly to the tank, and then two struts to link the engines to the tank. Makes \u0027em rock-steady.\u003C/p\u003E\n"},{"CreatedByName":"NoXion","CreatedById":7454,"CreatedDateTime":"2011-08-26T12:05:00Z","Content":"\n\u003Cp\u003EApologies if this has already been addressed, but I would really like to know why I can\u0027t seem to find a particular part in this pack:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://1.2.3.12/bmi/i.imgur.com/p7QuZ.jpg\u0022 alt=\u0022p7QuZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m talking about the white SRBs with red text that can be seen in this image with pointy 1m nosecones. I like the look of them and fancy using them in my designs.\u003C/p\u003E\n"},{"CreatedByName":"Andras","CreatedById":3716,"CreatedDateTime":"2011-08-26T14:09:07Z","Content":"\n\u003Cp\u003EYou forgot the image\u003C/p\u003E\n"},{"CreatedByName":"millsw","CreatedById":4053,"CreatedDateTime":"2011-08-26T14:28:33Z","Content":"\n\u003Cp\u003EAhh! Those SRB\u0027s are in Sunday Punches pack, and you have to put a nosecone on BY YOURSELF.\u003C/p\u003E\n"},{"CreatedByName":"NoXion","CreatedById":7454,"CreatedDateTime":"2011-08-27T00:19:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Andras\u0022 data-cite=\u0022Andras\u0022\u003E\u003Cdiv\u003EYou forgot the image\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELoads fine for me.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Millst0ne\u0022 data-cite=\u0022Millst0ne\u0022\u003E\u003Cdiv\u003EAhh! Those SRB\u0027s are in Sunday Punches pack, and you have to put a nosecone on BY YOURSELF.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know you have to add the nosecones during design/construction, but none of the boosters in the Sunday Punch pack I downloaded look the ones in the image from my previous post. Let me show you again:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i78.photobucket.com/albums/j99/NoXion604/boostercomparison.png\u0022 alt=\u0022boostercomparison.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe SRB on the left is the closest-looking one I could actually find in my collection. The one on the right is the one I\u0027m interested in. Notice the differences, such as the flanges (?) and if you look carefully at the bottom of the right-hand image you will notice that the SRB has two red stripes while the one on the left has only one.\u003C/p\u003E\u003Cp\u003EEither a booster has undergone significant mesh and skin changes (which is a shame since I think they could both be present as different boosters), or I\u0027m missing a part somehow.\u003C/p\u003E\n"},{"CreatedByName":"Itchono","CreatedById":3185,"CreatedDateTime":"2011-08-27T01:54:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoXion\u0022 data-cite=\u0022NoXion\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELoads fine for me.\u003C/p\u003E\u003Cp\u003EI know you have to add the nosecones during design/construction, but none of the boosters in the Sunday Punch pack I downloaded look the ones in the image from my previous post. Let me show you again:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i78.photobucket.com/albums/j99/NoXion604/boostercomparison.png\u0022 alt=\u0022boostercomparison.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe SRB on the left is the closest-looking one I could actually find in my collection. The one on the right is the one I\u0027m interested in. Notice the differences, such as the flanges (?) and if you look carefully at the bottom of the right-hand image you will notice that the SRB has two red stripes while the one on the left has only one.\u003C/p\u003E\u003Cp\u003EEither a booster has undergone significant mesh and skin changes (which is a shame since I think they could both be present as different boosters), or I\u0027m missing a part somehow.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECORRECT!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003ESunday Punch re-textured the solid booster in V1.05\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ebut if you look in the kerbal space repository,you\u0027ll find V1.04\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOr look for the posts on the front page\u003C/p\u003E\u003Cp\u003EEDIT: I just checked and sunday punch reskinned the solids in V1.0\u003Cspan\u003E\u003Cstrong\u003E3\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESo you\u0027ll have to check the front page of this topic\u003C/p\u003E\n"},{"CreatedByName":"NoXion","CreatedById":7454,"CreatedDateTime":"2011-08-27T03:29:40Z","Content":"\n\u003Cp\u003EOK, now that \u003Cem\u003Eis\u003C/em\u003E a shame. I think the skins and meshes are sufficiently different for potentially both to count as different booster types. Perhaps if the old booster mesh could still be used was resized so it was midway between the KSP-30 and the KMX Industries Minibooster/RT-10 Solid Fuel Booster? Or maybe it could be taken in the other direction, and become the first 1.75/2m booster?\u003C/p\u003E\u003Cp\u003EThe new booster mesh/skin is certainly good and it\u0027s a part I like to use, but the old version has a junky charm about it.\u003C/p\u003E\n"},{"CreatedByName":"Itchono","CreatedById":3185,"CreatedDateTime":"2011-08-27T14:46:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoXion\u0022 data-cite=\u0022NoXion\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOr maybe it could be taken in the other direction, and become the first 1.75/2m booster?\u003C/p\u003E\u003Cp\u003EThe new booster mesh/skin is certainly good and it\u0027s a part I like to use, but the old version has a junky charm about it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d love to see a 1.75 m booster for Nova\u0027s 1.75m radial clamp\u003C/p\u003E\n"},{"CreatedByName":"Andras","CreatedById":3716,"CreatedDateTime":"2011-08-27T15:45:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Itchono\u0022 data-cite=\u0022Itchono\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027d love to see a 1.75 m booster for Nova\u0027s 1.75m radial clamp\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI posted a cfg edit for a 1.75m solid booster in Nova\u0027s SIDR thread on pg 13 and a new Titan based texture a couple posts later.\u003C/p\u003E\n"}]}