{"TopicId":60005,"ForumId":16,"TopicTitle":"When i build a large ship my game lags and glitches.","CreatedByName":"ThinkOutsideTheHangar","CreatedById":100722,"CreatedDateTime":"2014-01-15T02:05:41Z","PageNum":1,"Articles":[{"CreatedByName":"ThinkOutsideTheHangar","CreatedById":100722,"CreatedDateTime":"2014-01-15T02:05:41Z","Content":"\n\u003Cp\u003EI recently made a large ship (529 parts) but it seems my game can\u0027t handle it. When I remove parts, the debug console says null.reference.exception. Is there any way to fix this or at least ease the stress on my computer? Note: I\u0027m running this game on a alienware X51. I\u0027ve never had this happen before. My game has very good FPS, and doesn\u0027t take long to load.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-01-15T02:10:57Z","Content":"\n\u003Cp\u003EYou could try various texture reduction packs that are out there.\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2014-01-15T02:12:46Z","Content":"\n\u003Cp\u003EKerbal space program isn\u0027t multithreaded. Most (new-ish) computers have several cores, so it can only use one. Which isn\u0027t too much ram.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-01-15T02:13:02Z","Content":"\n\u003Cp\u003EDon\u0027t mean to be patronising but you\u0027ve tried reducing your graphics settings, right?\u003C/p\u003E\n"},{"CreatedByName":"ThinkOutsideTheHangar","CreatedById":100722,"CreatedDateTime":"2014-01-15T02:15:49Z","Content":"\n\u003Cp\u003ENo, that\u0027s not the problem. The graphics is fine. The game itself just collapses in a screaming heap when I load the ship\u003C/p\u003E\u003Cp\u003ESo is there any way I can allocate more ram to KSP? I have 5.88 GB free. Which is a lot.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-15T02:29:31Z\u0022 title=\u002201/15/2014 02:29  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 15, 2014\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003Cbr\u003EMerging sequential posts.\n\u003C/span\u003E\n"},{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-01-15T02:52:39Z","Content":"\n\u003Cp\u003EAs far as I understand, the issue is not hardware, a high end computer will be bottlenecked by the engine\u0027s limitations. 529 parts is a lot, the engine simply can\u0027t keep up with the processing necessary to keep the game running at a stable rate. Do you really need that many parts, or are you just fooling around trying to make it as big as possible?\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-01-15T03:40:58Z","Content":"\n\u003Cp\u003EI\u0027ve made ships with many more parts than that. The game ran slow, but it wasn\u0027t \u0022a screaming heap\u0022 and I\u0027ve got less RAM than that.\u003C/p\u003E\u003Cp\u003EDo you have any mods installed? Some of them can cause the game to really lag up, and I imagine that is exacerbated by large ships.\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2014-01-15T09:48:52Z","Content":"\n\u003Cp\u003ENote that struts are not included in parts count but definitely reduces performance. And mods...\u003C/p\u003E\n"},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2014-01-15T10:19:18Z","Content":"\n\u003Cp\u003EYeah if I manage to crash KSP to desktop its usually like this. The issue doesnt seem to be having lots of parts on my ship, the deal-breaker is when i \u0027pick-up\u0027 a lot of parts in the editor (like trying to save a complex launcher as a SA or adding a piece to the very top of your design). Havent found anything that fixes this particular issue, but it does also seem to occur when reverting such flights and/or sending them to the pad. Any time there are a lot of parts \u0027up in the air\u0027 computationaly.\u003C/p\u003E\u003Cp\u003EKSP is limited to I think 3.5G of ram. At least on a windows platform anyway, you may be able to assign more on a linux rig. As mentioned above, most of the heavy-load is not multi-threaded, so my quad-core actually under performs my old monolithic 2G single core machine. You can try going through control panel and setting the affinity for ksp.exe to restrict it to a single core (i often bump it up to real-time priority at the same time).\u003C/p\u003E\n"},{"CreatedByName":"ThinkOutsideTheHangar","CreatedById":100722,"CreatedDateTime":"2014-02-09T03:03:53Z","Content":"\n\u003Cp\u003EYeah, im fooling around because I\u0027m too lazy to build a space station, so I did the single launch 529 part one. I\u0027ll try docking with MJ.\u003C/p\u003E\n"}]}