{"TopicId":60055,"ForumId":20,"TopicTitle":"Tweakables with modded parts?! (and adding support?)","CreatedByName":"jessyager","CreatedById":100149,"CreatedDateTime":"2014-01-15T16:53:27Z","PageNum":1,"Articles":[{"CreatedByName":"jessyager","CreatedById":100149,"CreatedDateTime":"2014-01-15T16:53:27Z","Content":"\n\u003Cp\u003EI am fairly new to KSP and am currently going 9 million different directions as far as trying to learn and do different things (generally because I try something; strand someone or cause some other kind of random tear in the space time continuum and then have to try to figure out how to fix it :/) so if I am asking this in the wrong section I apologize. Just direct me to the right place \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI notice that for example if I use the stock landing gear while building something I can right click it and tell it to start closed or open, lock steering etc. However with some addon/mod parts I get no options when right clicking. Is there any way to add the tweakable functionality to the parts from addons/mods?\u003C/p\u003E\u003Cp\u003EThe main issue I am having is using the B9 Aerospace Mod. I cannot open the cargo bay for the M2 Body to put anything in it. Also I have the same issue with the 6S Service Compartments Mod. I am unable to open the storage compartment doors to add anything to it. (With the latter I am at least able to add stuff from underneath the module before adding the next component however with the cargo bays this is not the case.\u003C/p\u003E\u003Cp\u003EI am not sure if (since not originally included in game) cargo bays do not have any kind of switch that allow you to open them like any of the tweakable commands or not. But it would be nice to be able to start with addon landing gear stowed like the stock parts as well.\u003C/p\u003E\u003Cp\u003EI appreciate any help anyone can offer, thanks in advance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-01-15T18:18:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jessyager\u0022 data-cite=\u0022jessyager\u0022\u003E\u003Cdiv\u003EIs there any way to add the tweakable functionality to the parts from addons/mods?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. For example, the Kethane drills can be deployed in the VAB. However, this functionality must be added to the underlying part modules (i.e. plugin code).\u003C/p\u003E\n"},{"CreatedByName":"Sethnizzle","CreatedById":22985,"CreatedDateTime":"2014-01-15T18:43:57Z","Content":"\n\u003Cp\u003EMake sure you are running the latest versions of those mods. I use both and know you can open and close them in the vab/sph.\u003C/p\u003E\n"},{"CreatedByName":"jessyager","CreatedById":100149,"CreatedDateTime":"2014-01-15T22:00:26Z","Content":"\n\u003Cp\u003EI am currently running B9 Aerospace vR4.0C and 6S Service Compartment Tubes v1.1. If there are any later versions I am unable to fid them.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-01-15T22:08:22Z","Content":"\n\u003Cp\u003EB9 is not yet updated to 0.23. Don\u0027t ask. Nobody knows when. Bac9 is working on it as far as we know.\u003C/p\u003E\u003Cp\u003EYou can get the B9 SABRE\u0027s and cargo bays working in 0.23 by updating ExsurgentEngineering.dll and Firespitter.dll. You can find all info in the B9 topic or in a topic just like this from yesterday: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66020-B9-0-23-fixes\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/66020-B9-0-23-fixes\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"jessyager","CreatedById":100149,"CreatedDateTime":"2014-01-16T10:07:50Z","Content":"\n\u003Cp\u003EUpdating the 2 DLL\u0027s did allow me to open the Cargo bay in the VAB thx much all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\n"}]}