{"TopicId":60162,"ForumId":25,"TopicTitle":"Hello! I\u0026#039;m going to be running a local (LAN) Challenge - the \u0026quot;KSP Noob Build-Off\u0026quot;!","CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2014-01-16T19:01:37Z","PageNum":1,"Articles":[{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2014-01-16T19:01:37Z","Content":"\n\u003Cp\u003EMy local college is having a semi-competitive LAN party this Saturday. I\u0027ve decided to try to run an event, called the \u0022KSP Noob Build-Off\u0022. \u003C/p\u003E\u003Cp\u003EThe event is simple:\u003C/p\u003E\u003Cp\u003EA group of players who have never played KSP will each be given identical computers, each with a configured \u0027Sandbox\u0027 install of the game. The ONLY mods installed will be Ferram Aerospace and Deadly Reentry.\u003C/p\u003E\u003Cp\u003ESpectators will be seated behind the competitors. NO INSTRUCTIONS WILL BE GIVEN, other than the following:\u003C/p\u003E\u003Cp\u003E\u0022Welcome to Kerbal Space Program. The first player to land three or more Kerbals on the Mun, and return them ALL safely to Kerbin, wins.\u003C/p\u003E\u003Cp\u003EHow hard can Rocket Science be, anyway?\u0022\u003C/p\u003E\u003Cp\u003EIf possible, I will compile and post a side-by-side video of the competition.\u003C/p\u003E\n"},{"CreatedByName":"1096bimu","CreatedById":65460,"CreatedDateTime":"2014-01-16T19:06:20Z","Content":"\n\u003Cp\u003EUnless you\u0027re working with aerospace and engineering majors, this could take some time.....\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2014-01-16T19:24:42Z","Content":"\n\u003Cp\u003EThey\u0027re all going to die if you have deadly reentry.\u003C/p\u003E\n"},{"CreatedByName":"minerman30","CreatedById":63054,"CreatedDateTime":"2014-01-16T19:25:48Z","Content":"\n\u003Cp\u003EOoh, should be fun. 10 points to whoever figures out \u0027moar boosters\u0027 first.\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-01-16T20:13:53Z","Content":"\n\u003Cp\u003EConsidering like 50% of the player-base can\u0027t manage to land on the Mun at all, let alone return safely, I can\u0027t see this going well. Not to mention FAR and DR making it extra difficult.\u003C/p\u003E\u003Cp\u003EI\u0027ve participated in a couple lan competitions and showed a couple friends the game, and it took hours for them to get into a stable orbit even with my help. I can\u0027t imagine being thrust into the game with no knowledge of even the controls and trying to launch, let alone get to the Mun and back.\u003C/p\u003E\n"},{"CreatedByName":"TheAwer","CreatedById":91122,"CreatedDateTime":"2014-01-16T20:22:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xaiier\u0022 data-cite=\u0022Xaiier\u0022\u003E\u003Cdiv\u003EConsidering like 50% of the player-base can\u0027t manage to land on the Mun\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs that right? That seems way off.\u003C/p\u003E\u003Cp\u003EThis would be so fun to watch! You should give them a list of hints before they start, and give a intro to the game (like how to move the camera, what the WASD keys do, how to build something etc.)\u003C/p\u003E\u003Cp\u003EOr you could just skip that and see what happens\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-01-16T20:52:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheAwer\u0022 data-cite=\u0022TheAwer\u0022\u003E\u003Cdiv\u003EIs that right? That seems way off.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E75.64% of statistics are made up on the spot.\u003C/p\u003E\u003Cp\u003EGranted, it\u0027s kind of an educated guess. Really depends on what you define as the player-base. The forums show a slightly-better than Mun capable average, but in general forum users are the upper end of the skill bounds and usually the active forum users are a small minority compared to the main player-base. Extrapolating from there, it would probably be safe to say that 50% of people who play KSP fairly actively cannot with reliability score a Mun landing and return, especially with the aforementioned mods. Also, statistically speaking, the skill curve of players would probably put a majority below the \u0022Mun-capable\u0022 mark.\u003C/p\u003E\n"},{"CreatedByName":"TheAwer","CreatedById":91122,"CreatedDateTime":"2014-01-16T21:04:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xaiier\u0022 data-cite=\u0022Xaiier\u0022\u003E\u003Cdiv\u003EExtrapolating from there, it would probably be safe to say that 50% of people who play KSP fairly actively cannot with reliability score a Mun landing and return\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know about that. I did a manned Mun landing and return successfully in the demo (with a ton of quicksaving and loading though), and I hadn\u0027t been playing that long before that. I had been watching YouTube videos (mostly playthroughs, not tutorials), but anyone else can do that too. Don\u0027t underestimate the power of Youtube tutorials combined with a noob with plenty of time.\u003C/p\u003E\u003Cp\u003EAlso, I would think that people would get tired of a space-themed game if they cannot easily land and return any other planetary body.\u003C/p\u003E\u003Cp\u003EI think it would be safe to say that half of players don\u0027t land on bodies outside the Kerbin (and Mun and Minnimus) SOI though. I haven\u0027t done that yet, and I\u0027ve been playing for a couple of months.\u003C/p\u003E\n"},{"CreatedByName":"barrenwaste","CreatedById":91899,"CreatedDateTime":"2014-01-16T21:08:21Z","Content":"\n\u003Cp\u003EDoesn\u0027t really matter if none get to the mun and back. They can always be graded on how far they got. The first time I played I had trouble making orbit, true, but I did manage a stable orbit. If I can do it I\u0027m sure that others can, too. I would suggest encouraging them to think small, though. Most first time players I see make these huge rockets that can\u0027t even get off the ground, let alone out of atmo.\u003C/p\u003E\n"},{"CreatedByName":"fluffysnowcap","CreatedById":72038,"CreatedDateTime":"2014-01-17T00:05:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022barrenwaste\u0022 data-cite=\u0022barrenwaste\u0022\u003E\u003Cdiv\u003EDoesn\u0027t really matter if none get to the mun and back. They can always be graded on how far they got. The first time I played I had trouble making orbit, true, but I did manage a stable orbit. If I can do it I\u0027m sure that others can, too. I would suggest encouraging them to think small, though. Most first time players I see make these huge rockets that can\u0027t even get off the ground, let alone out of atmo.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOrbit my first try on ksp i failed to get off the pad in any think outer than a body bag and barrenwaste has a good point with start small i woud give then a quick show and tell so thay now what to do but just covering the bare minimal build mode options I.E how to get fule in to rocket and the build more options and size\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-01-17T01:12:27Z","Content":"\n\u003Cp\u003EDeadly Re-entry? o.O.\u003C/p\u003E\u003Cp\u003EIt\u0027d be really funny if one of them actually makes a successful SSTO spaceplane that splits in half and lands the ccokpit module appollo-style with 3 Kerbals.\u003C/p\u003E\u003Cp\u003EBut yeah, DRE is absolutely terrifying (not to mention stronger than realistic).\u003C/p\u003E\u003Cp\u003EI gave KSP\u002BFAR to someone and told them to make something flyable. It took them two hours just to make a rocket that could reach orbit under MY control. Under their\u0027s, it tended to blow itself to tiny pieces at about 15 km.\u003C/p\u003E\u003Cp\u003EYou don\u0027t even want to know what they tried to do in the SPH.\u003C/p\u003E\u003Cp\u003EI suggest giving people this hint: Orange tanks do not make good wing surfaces.\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2014-01-17T02:40:40Z","Content":"\n\u003Cp\u003EI expect to see at least 100 ships that explode before leaving the atmosphere and all those that do manage to achieve orbit will die on the way back down. It would be fun if we could see the craft and place bets on which will explode first.\u003C/p\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2014-01-17T02:51:40Z","Content":"\n\u003Cp\u003Eyou should at least tell them the controls for throttle and staging..\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-01-17T03:13:07Z","Content":"\n\u003Cp\u003EYou will be famous for noob organiser.\u003C/p\u003E\u003Cp\u003EHence make the participant hate KSP. You dont realise that dont you?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-17T11:43:28Z\u0022 title=\u002201/17/2014 11:43  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 17, 2014\u003C/time\u003E by Sirine\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2014-01-17T10:24:23Z","Content":"\n\u003Cp\u003ESeriously, I think you forget how hard KSP is to new players. I needed several days to get to the mun and back. And I allways liked rockets - so I had some basic designs allready in my head and knew several ways to design a munshot (LOR, direct ascent).\u003C/p\u003E\u003Cp\u003EBut ferram and DE? You\u0027ll just see tons of frustrated people. I suggest you leave the mods and declare the fist one to get a living kerbal to the moon winner. This way there is a chance that you find a winner within hours.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-01-17T11:21:47Z","Content":"\n\u003Cp\u003E90% of them would make a rocket and point at the Mun and fly.\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-01-17T12:04:35Z","Content":"\n\u003Cp\u003EIt will be fun to watch but I doubt anyone will be able to do it. Scratch the DRE and they might make it (in a few days, that is).\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2014-01-18T21:19:41Z","Content":"\n\u003Cp\u003EUpdate: We\u0027re having trouble recording / streaming video. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, the first player managed to hit the moon with his 3 kerbals, at approximately 400 meters / second.\u003C/p\u003E\n"}]}