{"TopicId":60429,"ForumId":16,"TopicTitle":"Landing planes.","CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-01-19T19:10:08Z","PageNum":1,"Articles":[{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-01-19T19:10:08Z","Content":"\n\u003Cp\u003EHey folks.\u003C/p\u003E\u003Cp\u003EI was just wondering if anyone had any tips, or could point me at an existing how-to thread on landing planes? Aeroplanes, spaceplanes, whatever - I can build them, fly them, get them to orbit and back where appropriate but I cannot for the life of me land anything but the very lightest stock aircraft!\u003C/p\u003E\u003Cp\u003EAny advice gratefully received.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003EKSK.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-25T15:05:02Z\u0022 title=\u002201/25/2014 03:05  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 25, 2014\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jijonbreaker","CreatedById":101172,"CreatedDateTime":"2014-01-19T19:13:32Z","Content":"\n\u003Cp\u003EUnfortunately, the only thing I truly know about landing planes is essentially the same as landing a real plane. You have to essentially glide down onto where you want to land. To do this, you have to cut back the throttle, and tilt the plane up about 15-20 degrees, so you still attract lift, while slowing down considerably. This will usually end up in a (relatively) smooth landing. This is also why you normally see planes landing on their back wheels first. They are tilting up, so the back touches down before the front.\u003C/p\u003E\n"},{"CreatedByName":"Finwolf","CreatedById":82396,"CreatedDateTime":"2014-01-19T19:17:48Z","Content":"\n\u003Cp\u003EFirst make sure you\u0027re alinged with the runway. Start descending slowly. No more that 5 degrees. You want your nose to be level or a little above the horizon. Your speed should be so you descend while keeping nose pointed above horizon. When you are getting close to the start of the runway start pitching up a little. Make sure you don\u0027t descend too fast. When just about to hit the runway slow your descent so you touch the runway as lightly as possible. Throttle up if necessary. When your rear wheels hit the runway press brake.\u003C/p\u003E\u003Cp\u003EHope this helps.\u003C/p\u003E\u003Cp\u003EEDIT: Use SAS while flying and disable when you\u0027ve touched down.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-19T19:49:42Z\u0022 title=\u002201/19/2014 07:49  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 19, 2014\u003C/time\u003E by Finwolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2014-01-19T19:17:55Z","Content":"\n\u003Cp\u003E-Try a shallower glide, remember to flare before landing. I like to keep it off the ground for as long as possible before touchdown, that ensures a safe landing.\u003C/p\u003E\u003Cp\u003E-Touch down only when under 45m/s if you can help it to ensure that your crew survives in the event of Rapid Unplanned Disassembly.\u003C/p\u003E\u003Cp\u003E-\u003Cem\u003EAlways\u003C/em\u003E put parachutes on your airplane/spaceplane. If it flies like a lawn dart, you\u0027re safe!\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-01-19T19:19:08Z","Content":"\n\u003Cp\u003EBefore flight check the relation between CoM and CoL with empty tanks.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-19T19:31:34Z","Content":"\n\u003Cp\u003EScott Manley had a short series about planes some time ago. I believe you can learn about landing planes just by watching how he does it.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/R-TFRnVyjso?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uo1C3lODTJU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"PirateAE","CreatedById":57902,"CreatedDateTime":"2014-01-19T19:49:53Z","Content":"\n\u003Cp\u003EFor the biggest time flying FSX(Flight sim) i had an issue with not letting the plane react. it really counts when landing; and extends to ksp. What i recomend is to picture a kind of glide slope approch, say at 10 KM out be at or below 5000 M; by 5 KM out you should be at halve that and roughly lined up, and aim to be at a safe landing speed (45M/s decent on stock landing gear) by the time your about 1 KM out and 750-500 M up and as best lined up as you can be. on final approch, flare about 5-10 degrees and drift to the runway keeping your vertical speed controled aim for a final vertical touch down of less than 40M/s. Dont aim to touch your wheels on the numbers, this dosnt happen as often as you think. once you have yoru wheels down start breaking but not so hard to snap your front down, and let the front come down from teh flare and then once all wheels are on the rwy, apply full breaks.\u003C/p\u003E\n"},{"CreatedByName":"jlrdsr","CreatedById":99353,"CreatedDateTime":"2014-01-19T20:11:06Z","Content":"\n\u003Cp\u003EWhat i try to do is come in at a shallow dive, on about 30% throttle, when i get to about 200m up i cut the engine and pull the nose up to about 2 degrees so i start loosing speed, i try to land at less than 100m/s, the slower the better. When im at about 100m i pull the nose up more to about 5 degrees to kill the last of my speed and then level out at the last second and try to tuch down as gentely as i can. This works for me and its quite similar to the kind of approach parth that real aircraft take. Are you useing a joystick? It makes thing soooo much easyer, ive even recovered from flat spins that have been at less then 150m above the ground when they started \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E so id recomend then to anyone with serious aircraft intentions. And what do you mean by big aircraft, how many tonnes?\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2014-01-19T20:22:30Z","Content":"\n\u003Cp\u003EI find landings tend to go a lot better with the wheels pointing down, rather than pointing up. YMMV.\u003C/p\u003E\u003Cp\u003EMore seriously, you have two speed indicators in KSP: The readout just about the navball, which hopefully is in \u0022Surface\u0022 mode and tells you your speed relative to the surface, and the readout to the right of the altimeter which tells you your vertical velocity.\u003C/p\u003E\u003Cp\u003E\u0022Surface\u0022 velocity includes the vertical component, so it can be a little misleading some times. The vertical readout should be close to and slightly below zero, indicating that you\u0027re descending. You want your descent to be as gentle as possible - though the aircraft landing gear bays are stupidly tough (Good for 60m/s I think?) the rest of your craft might not handle the impact so well.\u003C/p\u003E\u003Cp\u003ETry to aim for the near edge of the runway to give yourself adequate time to slow down. Apply brakes as soon as all wheels are on the pavement.\u003C/p\u003E\u003Cp\u003EDisable the brakes on the front wheels to help prevent nose-diving.\u003C/p\u003E\u003Cp\u003ELearn the gliding ability of your craft and cut throttle early, so you come in slow. Nosing up at the last moment can kill a lot of horizontal speed.]\u003C/p\u003E\u003Cp\u003EDo your best to line up with the runway early... very early. KSP\u0027s runway is perfectly east-west so use the navball for help.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Roxette","CreatedById":84963,"CreatedDateTime":"2014-01-19T20:26:33Z","Content":"\n\u003Cp\u003EThis is also a good general guide to landing, covering all the most important aspects:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/_BpIThbOADg?start=41\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-01-19T20:41:50Z","Content":"\n\u003Cp\u003EWhat kind of trouble are you having? If you come down at less then 10m/s \u003Cstrong\u003Evertical speed\u003C/strong\u003E (horizontal speed can be much faster than that) on flat ground, landing gear wheels should be able to absorb the impact. Of course, you\u0027d have to be more gentle with larger planes.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-19T20:52:19Z","Content":"\n\u003Cp\u003E- Realize there is no requirement to land on the KSP runway. So feel free to land in the clear grass zones around KSC (or elsewhere) until you get the hang of it, just watch out for small hills. If you are landing on/around KSC, also watch out for the mountains when approaching from the west as they reach pretty high (so aiming to be less than 5,000m more than 10km out is sometimes an issue).\u003C/p\u003E\u003Cp\u003E- I would not recommend landing with the nose 15 to 20 degrees nose high unless you\u0027ve designed your craft for that.\u003C/p\u003E\u003Cp\u003E- The speed of your touchdown will really depend on your craft. You want to be as slow as possible, but your plane should still be controllable with no more than 5 degrees of AoA (the difference between the prograde marker and the yellow \u0022V\u0022). This should allow your back wheels to touch down first. As someone said, 100 m/s is a descent starting point. 40 m/s might be way to slow for your heavier craft.\u003C/p\u003E\u003Cp\u003E- When you get close to your landing area, you want to use your prograde marker to fly off of. When you\u0027re 50 to 100m up, move your prograde marker to the horizon and slowly zero out your throttle. This should slow you down and let you sink slowly to touchdown. You\u0027ll have to adjust your height and throttle based on how big your craft is. I find using throttle to land helps out a lot if you\u0027re using the keyboard to fly.\u003C/p\u003E\u003Cp\u003E- You can activate your brakes before you land and they will start braking right away. Watch out for the SAS to sneak up here and throw your airplane all over the place.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-01-19T21:39:03Z","Content":"\n\u003Cp\u003ETry to avoid a vertical speed of greater than -5 m/s\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-01-20T03:37:56Z","Content":"\n\u003Cp\u003EIt\u0027s tempting to completely cut throttle before landing, but that can be your downfall if you plane doesn\u0027t generate enough lift at low speeds. You need just enough power to keep your nose up while gradually descending at a few ms. \u003C/p\u003E\u003Cp\u003EI found that practicing just gliding over the ground as low as you dare without actually landing has helped me a lot.\u003C/p\u003E\u003Cp\u003EAlso put reaction wheels in your planes, it helps deal with shifts in COM and gives you more control at lower speeds.\u003C/p\u003E\u003Cp\u003EOnce you\u0027re lined up pay close attention to your vertical speed indicator, if you\u0027re well lined up then you can almost forget about the runway and just try to keep your vertical speed between 0 and -5ms (10 is ok too, just a bit rougher).\u003C/p\u003E\u003Cp\u003EDisable the brake on your front landing gear and just brake with the rear wheels. \u003C/p\u003E\u003Cp\u003EDon\u0027t worry about how much horizontal speed you have so long as your vertical is lower than 5-10ms. You can land at over 150ms horizontal so long as you have enough runway left to brake!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-01-21T19:48:26Z","Content":"\n\u003Cp\u003EThanks everyone. \u003C/p\u003E\u003Cp\u003EI think katateochi nailed it with the warning against cutting your throttle too far and therefore (as others have warned against) coming in with too high a vertical velocity. I\u0027m having a hard time getting my speed below 70m/s anyway (even with my engines switched off), so I\u0027ll try shallow and fast rather than too steep and only-a-little-bit-slower and see how that goes.\u003C/p\u003E\u003Cp\u003ELeaving this thread open for now - more troubleshooting may be required!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-01-25T15:03:35Z","Content":"\n\u003Cp\u003EAhh - the sweet, sweet smell of success! Managed to fly and land an airplane built using Mk3 cockpit and fuselage. Secret was a nice wide undercarriage and (I hate to say this), struts to keep the whole contraption a little more rigid upon landing. Also landing in daylight is way easier (who knew?)\u003C/p\u003E\u003Cp\u003ENext challenge is to build a bigger one, land it, then load it up with right mix of highly explosive propellants to get to orbit!\u003C/p\u003E\u003Cp\u003EThanks for all the advice.\u003C/p\u003E\u003Cp\u003EKSK.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-25T15:10:46Z","Content":"\n\u003Cp\u003ECongrats! I\u0027m glad it all worked out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2014-01-25T17:07:21Z","Content":"\n\u003Cp\u003EOne small tip, for what it\u0027s worth; I parked a rover at the end of each runway and renamed each as a base, using the strip and heading for each. (Ex. \u0022KSC Beacon 09\u0022 for the one at the east end.) Before descent I select the appropriate rover as the plane\u0027s target; makes it easier to find the runway from over the horizon and line up early.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2014-01-25T18:10:31Z","Content":"\n\u003Cp\u003EBuild your plane with the rear wheels as close to the wingtips and as far back as practical (within the confines of needing tone able to rotate to lift off).\u003C/p\u003E\u003Cp\u003EUnlock steering on the nose wheel only, and disable brakes on the nose wheel only. This aids stability on the ground.\u003C/p\u003E\u003Cp\u003ELand with a positive angle of attack, to slow your horizontal speed as much as possible.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-01-26T12:25:45Z","Content":"\n\u003Cp\u003EPics or it didn\u0027t happen. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/fXmpE#0%5D\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-26T12:27:55Z\u0022 title=\u002201/26/2014 12:27  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 26, 2014\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zaky133","CreatedById":17719,"CreatedDateTime":"2014-01-26T14:23:15Z","Content":"\n\u003Cp\u003EPro tip: I find that if you keep pitching up while braking, you are less likely to tip over\u003C/p\u003E\n"},{"CreatedByName":"palioxis1248","CreatedById":100635,"CreatedDateTime":"2014-01-26T14:45:49Z","Content":"\n\u003Cp\u003EI usually clear the mountains west of KSC travelling at 1000\u002B m/s, so my landing technique may not apply for everyone.\u003C/p\u003E\u003Cp\u003E1. Pull up ten degrees with throttle on full, until the point where your orbit touches the ground overshoots KSC and is in the sea.\u003C/p\u003E\u003Cp\u003E2. Level off, cut power and glide towards KSC. Roll left and right as needed to adjust your prograde marker. Some bank-and-yank may also be required, depending on the plane.\u003C/p\u003E\u003Cp\u003E3. When the KSC drops into visual range (a bunch of flickering pixels), begin lining up with the runway, which should be a more line-ish collection of pixels. Bank-and-yank conservatively.\u003C/p\u003E\u003Cp\u003E4. All this while, keep the plane more or less level. It may be necessary to occasionally fire up the engines, if you\u0027ve done some extreme maneuvering.\u003C/p\u003E\u003Cp\u003E5. When you can finally see the landing lines, point your plane at the number on the runway (can\u0027t remember what it was, 06?)\u003C/p\u003E\u003Cp\u003E6. Descend, slowly pitching up as needed to avoid losing too much altitude. This is generally just a matter of gut feeling.\u003C/p\u003E\u003Cp\u003E7. When in close vicinity to runway, release gear (but not before, to reduce drag and increase glide time). Begin pulling up above the horizon, to decrease vertical speed.\u003C/p\u003E\u003Cp\u003E8. Turn on landing lights (U as default). This helps gauge distance above the runway. You could also just use shadows, but lights are easier on the eyes.\u003C/p\u003E\u003Cp\u003E9. Keep pulling up slightly until vertical speed is somewhere between -2.5m/s to -7.5m/s\u003C/p\u003E\u003Cp\u003E10. Hold attitude until the wheels touch ground, then activate parking brakes. Landing speeds of less than 100m/s are usually fine. If your plane has any drogue chutes, deploy them a moment before the wheels hit ground.\u003C/p\u003E\u003Cp\u003E11. If the plane veers, activate SAS and Yaw left and right to steer the landing gear.\u003C/p\u003E\u003Cp\u003EIn a worst case scenario, i.e. something happens with plane while sliding along runway at unsafe speeds, JUMP!! (It works 50% of the time.)\u003C/p\u003E\n"},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2014-01-26T14:56:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zaky133\u0022 data-cite=\u0022zaky133\u0022\u003E\u003Cdiv\u003EPro tip: I find that if you keep pitching up while braking, you are less likely to tip over\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe tipping force often comes from pivoting forward onto the nose wheel.\u003C/p\u003E\u003Cp\u003EAn easier way to avoid this is just disable the nose wheel brake in the SPH, using tweakbles.\u003C/p\u003E\u003Cp\u003EInstant stability!\u003C/p\u003E\n"},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2014-01-26T15:23:42Z","Content":"\n\u003Cp\u003EOthers have commented on a slow, nose-up approach to scrub off your horizontal velocity. Here\u0027s what it looks like if you get it right: my Labrys Mk-III spaceplane gliding into a landing. It landed at about 20 m/s, SAS held the nose wheel off for a bit longer, and it drifted to an uncomplicated stop. Obviously it lands a bit faster with fuel on board, but a good design should still be able to glide to a landing at about 30 m/s horizontal.\u003C/p\u003E\u003Cp\u003EKerbal Engineer Redux really helps with this (as seen here on the left):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.sarahlizzy.com/LabrysLanding.png\u0022 alt=\u0022LabrysLanding.png\u0022\u003E\u003C/p\u003E\n"}]}