{"TopicId":60466,"ForumId":44,"TopicTitle":"What direction should NASA go after SLS?","CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-01-20T02:19:15Z","PageNum":5,"Articles":[{"CreatedByName":"crazyewok","CreatedById":97592,"CreatedDateTime":"2014-01-21T22:22:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathsoul097\u0022 data-cite=\u0022Deathsoul097\u0022\u003E\u003Cdiv\u003ECrazyewok, the op said: \u0022where should NASA go after SLS\u0022. Meaning after the SLS is finished. The SLS (If done correctly) should be in service for a VERY long time. Meaning we can still use it after it was finished. After the Space shuttle was completed, NASA didn\u0027t just go and say: \u0022Yay, we finished it. Now to make its replacement.\u0022 No. They went and kept on using it for decades.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EErm yeah hense why I took \u0022after the SLS program is finnished\u0022 to mean 30-50 years in the future. I took after SLS to mean after the program rather after the first one flys.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-21T22:30:18Z\u0022 title=\u002201/21/2014 10:30  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 21, 2014\u003C/time\u003E by crazyewok\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2014-01-21T23:35:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022crazyewok\u0022 data-cite=\u0022crazyewok\u0022\u003E\u003Cdiv\u003EFor what purpose though ? As it wont really sort the main problem out, Earth to orbit cost. That the BIG problem. We can get to mars on chems. For a simple manned mission NERVA is just a nice luxury.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re right, Earth to orbit is a big part of the cost problem. NERVA has probably 3 times the specific impulse of a chemical rocket, this means that for the same delta-v mission to Mars the required mass ratio drops by half. Which is a way of saying you can do the mission with like 6 multi-billion dollar SLS launches instead of 12. If the development costs are less than the cost of building and launching 6 SLS\u0027s (which seems likely), then NERVA is anything but a luxury.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-01-22T01:44:42Z","Content":"\n\u003Cp\u003EI would develop SSTO capabilities for light cargo and crew transport, but keep SLS for heavier capabilities\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-01-22T02:55:32Z","Content":"\n\u003Cp\u003EHow about canceling SLS, what if it gets canceled? I would just cancel it and start working with ESA and try to coordinate to creat a common launch vehicle (CLV).\u003C/p\u003E\u003Cp\u003EThis would be based on the Ariane 5, or perhaps the Falcon 9, maybe Atlas 5? This would allow for flexible designs ranging from 9 metric tons to 30 metric tons, thus allowing for the construction of an orbital vehicle to go to Mars/Moon. No heavy launchers! And I would also accelerate the CCDev program, and try to persuade congress to accept an increase in budget to about 30 billion (double what I would start with). I would also help the ESA with a manned program, and get the RSA in on the CLV. I woud promote mass-production of CLV components to allow for amortization of the costs, as well as 3D printing, to get some rapid prototyping in.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-01-22T05:17:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022crazyewok\u0022 data-cite=\u0022crazyewok\u0022\u003E\u003Cdiv\u003ENibb31 is right politicaly it wont get off the ground. It is the best way, but the best isnt all ways popular and popularity in this day and age is all that matters. And the masses are violenty opposed to anything nuclear rational or not. \u003Cp\u003EWe can dream though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay then, lets swap Orion-style propulsion with, say, VASIMR. My point was, for long-range missions such as Mars manned missions, new and powerful propulsion systems must be developed, otherwise travel time would be significant. Orion was the highest-performing systems I knew of, which is why I put it as an example. Should better systems arrive, I would happily use it instead.\u003C/p\u003E\u003Cp\u003EThe MSL Curiosity rover takes months on a single one-way trip to Mars. Is it more effective to supply manned missions for that long, plus their stay and return trip, or is it better to develop new propulsion systems to reduce the journey to a matter of days, rather than months?\u003C/p\u003E\u003Cp\u003EI myself would favor the latter.\u003C/p\u003E\n"},{"CreatedByName":"Roastduck","CreatedById":98490,"CreatedDateTime":"2014-01-25T06:52:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EI agree. It is getting a lot tedious. I know it is a bit of a stretch, but maybe we could ask the mods to sticky an Orion thread and make it a rule that all discussion about project Orion goes there and there only? I don\u0027t think the rule would affect a lot of people. After all, there\u0027s really only one member on these forums who keeps bringing it up and subjecting the rest of us to the same arguments over and over, ad nauseam.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/4JpEPPN.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/4JpEPPN.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt the very least, can we at least agree to stop referring to it as \u0022Orion\u0022 (yes, I know that was the name given to it originally) and instead refer to it as nuclear pulse propulsion? I suggest this because the capsule NASA is designing to be used with SLS is called Orion.\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2014-01-25T07:20:20Z","Content":"\n\u003Cp\u003EMars, to stay. Use some of the Mars Direct architecture and technologies to make it possible. Also, do more than one launch per year... that\u0027s just stupid and drives up the price per unit for the rocket.\u003C/p\u003E\u003Cp\u003EMaybe do some NEO scouting missions, but it depends on if there\u0027s a suitable candidate.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-01-26T00:55:10Z","Content":"\n\u003Cp\u003EMaybe exploration of Earth\u0027s Trojan?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/2010_TK7\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/2010_TK7\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EResources should be fairly simplex To mine and send back to the earth or moon\u003C/p\u003E\n"}]}