{"TopicId":60558,"ForumId":20,"TopicTitle":"Best mods integrating with tech tree","CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-01-20T22:22:24Z","PageNum":1,"Articles":[{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-01-20T22:22:24Z","Content":"\n\u003Cp\u003ESo, what mods (i mostly mean various rocket parts packs) integrate with career mode tech tree well?\u003C/p\u003E\u003Cp\u003ENot disbalancing game, but adding variety and enrihing gameplay experience.\u003C/p\u003E\u003Cp\u003EKSP interstellar maybe? Or B9?\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-01-20T23:36:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003ESo, what mods (i mostly mean various rocket parts packs) integrate with career mode tech tree well?\u003Cp\u003ENot disbalancing game, but adding variety and enrihing gameplay experience.\u003C/p\u003E\u003Cp\u003EKSP interstellar maybe? Or B9?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENova Punch works nicely on the tech tree. It gives you several choices of mid size engines and fuel tanks early on in the tech tree. You even get a probe right away but will quickly learn how useless it can be without extra batteries or solar panels.\u003C/p\u003E\u003Cp\u003EKW rocketry also works well.\u003C/p\u003E\u003Cp\u003EEither way, use just one mod at a time for career. If you install the mod after starting a career game, each mod part will have to be researched individually to activate them. Not to worry, it won\u0027t cost any additional science points.\u003C/p\u003E\n"},{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-01-26T15:29:19Z","Content":"\n\u003Cp\u003ENovaPunch has some good stuff in it, but it\u0027s rockets are over powered when compared with stock designs. They have better TWR and ISP, which in and of itself isn\u0027t so bad, but in career mode they often over shadow their stock analog because they appear on the same node, or before.\u003C/p\u003E\n"},{"CreatedByName":"RadHazard","CreatedById":80815,"CreatedDateTime":"2014-01-26T18:54:03Z","Content":"\n\u003Cp\u003EKSP Interstellar is a great mod for extending the end-game portion of career mode. Almost all of the parts in that mod are in their own nodes in the tech tree, further down the end than the stock tree goes. Most of the engines included in that pack are fairly overpowered compared to stock engines, but I would consider it balanced extremely well due to the extra research requirements to unlock them and the fact that most of the more powerful engines require dedicated resource collection missions. It doesn\u0027t do much at all for the early game, but once you get to the point where you\u0027ve already unlocked most of the stock tech tree, it gives you a lot more stuff to do. I would definitely recommend it.\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-01-26T19:38:51Z","Content":"\n\u003Cp\u003EI just added the explorer probe, Geiger counter and Explorer rocket to FASA, its at the beginning of the tech tree. It adds a little more flavor for when your first starting out without being too overpowered. That combined with KSP Interstellar, really fills out the tech Tree nicely.\u003C/p\u003E\n"}]}