{"TopicId":60630,"ForumId":16,"TopicTitle":"How much science can you store in modules?","CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-01-21T18:22:59Z","PageNum":1,"Articles":[{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-01-21T18:22:59Z","Content":"\n\u003Cp\u003EI\u0027ve got my first \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64251-Jool-Mission-Discovery-2-A-Space-Oddity-%28updated-1-18-14%29\u0022 rel=\u0022external nofollow\u0022\u003Eship to Jool\u003C/a\u003E with a cupola, 2 man lander can, hitchhiker and mobile lab. How much science can I bring back, and is there a limit based on the type of research (say, Goo vs. Temp)?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-21T21:19:08Z\u0022 title=\u002201/21/2014 09:19  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 21, 2014\u003C/time\u003E by Soda Popinski\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"aeTIos","CreatedById":17032,"CreatedDateTime":"2014-01-21T18:42:41Z","Content":"\n\u003Cp\u003EThere is no limit other than \u0022max. 1 experiment of the same type\u0022.\u003C/p\u003E\n"},{"CreatedByName":"LongbowEOD","CreatedById":22817,"CreatedDateTime":"2014-01-21T19:39:09Z","Content":"\n\u003Cp\u003EI just brought home a mission with at least 10 gravioli experiments stored in my lander can. You can\u0027t have completely identical experiments though. So 1 experiment per instrument per biome, including that, for example, \u0022in space low over the Mun\u0027s Midlands\u0022 counts as different from \u0022in space high over the Mun\u0027s Midlands\u0022 counts as different from \u0022in space high over the Mun\u0027s Highlands.\u0022 At least, it counts as different for the Gravioli detector. Different instruments have different effective biomes.\u003C/p\u003E\u003Cp\u003EI did also notice that the Goo Canisters (and I assume the Science Jr.) say they will become inoperable if you take the data out.\u003C/p\u003E\u003Cp\u003EEd- Clarified instruments and biomes.\u003C/p\u003E\n"},{"CreatedByName":"Rhalellan","CreatedById":93958,"CreatedDateTime":"2014-01-21T20:03:49Z","Content":"\n\u003Cp\u003EHow do you get the data from the Science Lab to the lander can? I never get that option.\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-01-21T21:20:18Z","Content":"\n\u003Cp\u003EThanks!\u003C/p\u003E\u003Cp\u003EI assume processing the science in the lab has no effect on non-transmitted data.\u003C/p\u003E\n"},{"CreatedByName":"Zwer.ch","CreatedById":88958,"CreatedDateTime":"2014-01-22T18:49:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhalellan\u0022 data-cite=\u0022Rhalellan\u0022\u003E\u003Cdiv\u003EHow do you get the data from the Science Lab to the lander can? I never get that option.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETwo options:\u003C/p\u003E\u003Cp\u003Ea) the science data is stored in its experiment (i.e. within the Goo container). It doesn\u0027t matter if it\u0027s processed by the MPL or not*, it will still be present in the Goo container. If you return on planning only your capsule w/o the Goo container, then EVA to the Goo container and click on it. You get an option to take the experiment data out. When entering back into the capsule, all data taken by your Kerbal will be stored in the capsule.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E you explicitely store experiment data to the MPL, i.e. a surface example your Kerbal has in it\u0027s hands. That\u0027s only possible by EVA though. Taking it back to the capsule is the same as in a)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Soda Popinski\u0022 data-cite=\u0022Soda Popinski\u0022\u003E\u003Cdiv\u003EI assume processing the science in the lab has no effect on non-transmitted data.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, doesn\u0027t matter at all. Only reason to take the MPL with you when planning for return-trips is to clean-out the Goo container and the SC-9001 lab. I.e. you can visit with a single Goo container and the MPL different MÃƒÂ¼n biomes. To do so, observe the Goo in a biome, take the data out of it, store it in the capsule and clean-out/reset the Goo container with the MPL.\u003C/p\u003E\u003Cp\u003EGiven the high weight of the MPL, you\u0027d just take more Goo containers with you instead \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Z\u003C/p\u003E\u003Cp\u003E* note: you don\u0027t need to transfer any experiment content to the MPL for processing, as long as the experiment is attached to the MPL\u0027s vessel.\u003C/p\u003E\n"}]}