{"TopicId":60912,"ForumId":18,"TopicTitle":"Castle of the Winds Online - The classic roguelike made into an MMO.","CreatedByName":"leptoon","CreatedById":71789,"CreatedDateTime":"2014-01-24T05:23:06Z","PageNum":1,"Articles":[{"CreatedByName":"leptoon","CreatedById":71789,"CreatedDateTime":"2014-01-24T05:23:06Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://www.byond.com/games/banners/20296.jpg\u0022 alt=\u002220296.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been trying to complete this game for almost seven years. I was able to work on it for a few months in 2007 then I resumed development in 2012, but shortly I was forced to halt development due to my lack of time and working capital to hire other people to help me. But now, with at least a year of free time ahead of me, I want to get this game completed. After the game is in a complete state, adding new content periodically will be a simple matter.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDescription of the original game...\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u0022Castle of the Winds is a cult classic RPG for Windows. At the beginning of the game, you have ability points that you can distribute between three characteristics, and you can choose your hero\u0027s gender. The storyline is linear and the gameplay and inventory system are cunningly simple. In contrast to the cities, the dungeons are almost monochrome, and the graphics throughout the game are minimalist. It may not look like much, but something about it makes it surprisingly fun. There are two volumes in this game, with only the first volume playable in the shareware version.\u0022\u003C/p\u003E\u003Cp\u003EPlease note, the following game images are not representative of the final game. They are for demonstration purposes only (however, they are functional and you can test the game yourself if you want).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://3b4efb995be6c5c64252-c03f075f8191fb4e60e74b907071aee8.r12.cf1.rackcdn.com/960598_1390492673.4341_multi.jpg\u0022 alt=\u0022960598_1390492673.4341_multi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E(From the right: myself, my then co-dev and his friend sometime in Aug. 2012)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMy goals...\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EMy main objective with this project is to create an online, multi-player experience using the Build Your Own Net Dream (BYOND) framework, based entirely in the setting of the original single-player game. This is the basic idea that I plan to expand on with additional features and functionality.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://3b4efb995be6c5c64252-c03f075f8191fb4e60e74b907071aee8.r12.cf1.rackcdn.com/960598_1390492814.8981_multi.jpg\u0022 alt=\u0022960598_1390492814.8981_multi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Character creation, note the custom color. This is currently for the characters underwear.)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFirst and foremost, I want to make the game exactly like the original but better.\u003C/strong\u003E What does better mean, you ask? SFX, for starters. That\u0027s right. CotW with sound!!! (and music too) Secondly, I plan to expand the game to make it a true MMO. I\u0027ll be adding new cities, new monsters, weapons, armor, spells, etc. I was given the source code of the original CotW by Rick Saada himself so my online version of CotW will have many of the same features as the original. Updated graphics for new towns and equipment are also planned, but everything from the original game will stay the same graphically.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://s3.amazonaws.com/ksr/assets/001/556/521/fb25cc43a8af1bdcd0151375d70e1ba1_large.jpg?1390511960\u0022 alt=\u0022fb25cc43a8af1bdcd0151375d70e1ba1_large.jpg?1390511960\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Shop GUI showing drag and drop interface. Note the four types of currency.)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI also plan to add several new things to bring the game up-to-date.\u003C/strong\u003E This will include a PvP system, player houses with purchasable furniture and storage, entire classes of new weapons, armor, spells and monsters, plus randomly generated dungeons. There will be literately hundreds of new items with mostly the same traditional feel as the old ones. I also plan to add an extensive quest and NPC system, and expand on the storyline set in the original CotW.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://3b4efb995be6c5c64252-c03f075f8191fb4e60e74b907071aee8.r12.cf1.rackcdn.com/960598_1390492727.938_multi.jpg\u0022 alt=\u0022960598_1390492727.938_multi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E(drag and drop character equipment management)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThis game will be revolutionary.\u003C/strong\u003E Maybe not from a AAA standpoint, but as far as BYOND games go, this game will include many advanced features that are not found in any other BYOND-based RPG. CotWO will push the boundaries of the BYOND framework and by utilizing the social networking of the BYOND community, new players will be able to find CotWO easily and begin playing immediately without installing any additional software. CotWO will be the first ever persistent MMO released on the BYOND framework. There will be only one server, it will be online at all times (with scheduled down time for maintenance) and all players will be able to interact with each other through persistent accounts, across the entire game. Previously, BYOND games used personally hosted private servers or sometimes dedicated servers with persistent character data. This meant that if the person hosting the server you were playing on decided to stop hosting it, you lost your game progress and had to begin again on a different server. The difference with CotWO is that there will always be only one game world, only one set of data and only one server host.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDo you want to know more?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EPlease visit the BYOND hub. \u003Ca href=\u0022http://www.byond.com/games/Leptoon/COTWO\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.byond.com/games/Leptoon/COTWO\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe following Google Docs documents can show you the current state of development and the features that are being working on. Please note, these are both a bit outdated since I halted development in 2012.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPowers Graph\u003C/strong\u003E - Skills or abilities in CotWO are called powers. There will be active powers and passive powers. The active powers can mostly be learned with spell books that can be purchased (combat and healing powers) and the passive powers can only be learned by reaching a certain base attribute level (strength, intelligence, constitution or dexterity). This means players that wish to specialize in magic can level up their intelligence and unlock better passive powers related to magic, while never seeing powers related to strength or vice versa. Some powers have only one level while others have up to five (each level increasing the effectiveness of the power). For every base attribute point you gain for defeating enemies or completing dungeon quests, you will also receive a power skill point. Power skill points can be used to train powers from level 1 to (up to) 5.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/drawings/d/19GI3NptOR3_Ul0R6yWI2cH7pQqhxgmrjX9hNHJk5bV0/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/drawings/d/19GI3NptOR3_Ul0R6yWI2cH7pQqhxgmrjX9hNHJk5bV0/edit?usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETo Do List\u003C/strong\u003E - This is a list of features and functions that are (or were) currently in development.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/spreadsheet/ccc?key=0Aq143hp2GlZidFlXS3RDWWpHdGw2MXRPelZKRmxLa1E\u0026amp;\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/spreadsheet/ccc?key=0Aq143hp2GlZidFlXS3RDWWpHdGw2MXRPelZKRmxLa1E\u0026amp;\u003C/a\u003E;usp=sharing\u003C/p\u003E\u003Cp\u003EPlease feel free to add me on Facebook or message me here on the forum. I\u0027m always eager to hear new ideas and suggestions.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.facebook.com/leptoon\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.facebook.com/leptoon\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe game runs on BYOND but if you don\u0027t have it, that\u0027s totally okay. Just download the .RAR file below and run the executable. It will download and install Byond then immediately connect you to my CotWO server.\u003C/p\u003E\u003Cp\u003EDownload: \u003Cspan style=\u0022color:#A9A9A9;\u0022\u003EMirror 1 | Mirror 2\u003C/span\u003E (New mirrors coming soon.)\u003C/p\u003E\u003Cp\u003EIf you already have BYOND installed, please click \u003Ca rel=\u0022external nofollow\u0022\u003Ethis link\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ECurrent Status: Version 0.11 ALPHA\u003C/p\u003E\u003Cp\u003EEstimated Projected Completion Date: 12/31/2014\u003C/p\u003E\u003Cp\u003EServer Status: \u003Cspan style=\u0022color:#00FF00;\u0022\u003EOnline\u003C/span\u003E (As of 01/23/2014)\u003C/p\u003E\u003Cp\u003EI have submitted a Kickstarter campaign to raise enough money to hire a graphic designer and a sound producer, and maybe another code developer. It\u0027ll be approved in a few days then I\u0027ll post it. If you\u0027re interested in helping out, please feel free to PM me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-24T05:34:55Z\u0022 title=\u002201/24/2014 05:34  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 24, 2014\u003C/time\u003E by leptoon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MrRichard999","CreatedById":207156,"CreatedDateTime":"2020-09-06T20:55:45Z","Content":"\n\u003Cp\u003E\nTried contacting Leptoon about this project on Steam only to get blocked by him.... This thing is dead in the water. Luckily for those wanting to run Castle of the Winds and other 16-bit Windows games in Windows 10 there is a great solution! Thanks to Otya128, https://github.com/otya128/winevdm/releases/tag/v0.7.0\n\u003C/p\u003E\n"}]}