{"TopicId":60969,"ForumId":21,"TopicTitle":"Ulysses - Duna Exploration Command Craft","CreatedByName":"MilkToast","CreatedById":82136,"CreatedDateTime":"2014-01-24T22:25:50Z","PageNum":1,"Articles":[{"CreatedByName":"MilkToast","CreatedById":82136,"CreatedDateTime":"2014-01-24T22:25:50Z","Content":"\n\u003Cp\u003EI\u0027ve been in KSP for about a year or so - launched a whole lot of things - massive stations, rovers to eeloo, and so on.\u003C/p\u003E\u003Cp\u003EWhat I\u0027ve never done is any form of orbital construction.\u003C/p\u003E\u003Cp\u003ESo I decided that rather than fly a series of small ships, I\u0027d build a big one.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/2DY00\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EMeet Ulysses, my (excessively, in my opinion) large exploration command craft.\u003C/p\u003E\u003Cp\u003EUlysses masses just a nudge over three hundred tons, and has a part count of 452 (before final strutting, this\u0027ll likely change).\u003C/p\u003E\u003Cp\u003EI assembled it in eight launches over five days:\u003C/p\u003E\u003Cp\u003E-Command Module - The command module houses a science lab, a three-kerbal can, and four large solar panels on struts for power generation.\u003C/p\u003E\u003Cp\u003E-Cargo Module - The cargo module is the smallest and lightest segment - merely a short truss with multiple docking ports radiating out from a central axis. All the sub-craft are mounted here.\u003C/p\u003E\u003Cp\u003E -Ike Lander - This is a small lander, designed to shuttle from low Duna orbit to Ike and back, potentially several times. This one is an SSTO (which isn\u0027t really hard to do on an airless moon).\u003C/p\u003E\u003Cp\u003E -Duna Lander - A larger, more powerful lander designed to descend to Duna, and return. This lander has many drop tanks, so this is a one-time trip for it.\u003C/p\u003E\u003Cp\u003E -Duna Rover - A medium-size rover that will deorbit and land under its own power. More for fun than anything\u003C/p\u003E\u003Cp\u003E -Science Return Craft (2x) - Two of these small pods are mounted to one rack on Ulysses - these are simple, fast craft designed to return all the science gathered. \u003C/p\u003E\u003Cp\u003E-Propulsion Module - The simplest of the modules - this is a large tank with eight nuclear engines mounted on spars. Fully fueled, it\u0027ll provide approximately 1.5m/s2 of acceleration.\u003C/p\u003E\u003Cp\u003E -Drop Tanks - Behind the propulsion module, I docked another tank with four double tanks on decouplers. I\u0027ll drop these two at a time as I progress on my tour.\u003C/p\u003E\u003Cp\u003EGetting all this docked in orbit was the biggest challenge I\u0027ve ever had. While I have MechJeb installed to help with orbits, I did all the docking by hand. Only one mishap - the drop tanks (roughly 160 tons) was parked close by a single Poodle engine - I was coming in at about 250 m/s on a transfer orbit, and shed about half that speed before plowing directly into the main structure of the ship. Sadly, I reverted the launch before taking a picture - but there were two ships in orbit for a moment.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission Plan:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m going to Duna! We\u0027ll park in a low Duna orbit after aerobraking (suggestions on how low to take such a large ship?). We\u0027ll deploy the lander and rover, visit some anomalies (I\u0027ve got a probe en route already to find some), and return the science. \u003C/p\u003E\u003Cp\u003EAfterwards, I figure I\u0027ll shed the cargo module and dock the command to the propulsion module, and fly it to Laythe. Not quite sure what\u0027ll happen there, but I\u0027ll probably launch a separate mission in parallel.\u003C/p\u003E\u003Cp\u003EThings I need to figure out:\u003C/p\u003E\u003Cp\u003E-My Hohmann transfer to Duna opens in 209 days. For slight role-playing reasons, I\u0027d rather not timewarp like that. I\u0027d like to depart sooner, using a non-optimal orbit. Any tools around to do this? Any ideas on best ways to accomplish this?\u003C/p\u003E\u003Cp\u003E-Strutting. Gotta launch a small ship up to \u0022service\u0022 Ulysses before it departs - it needs some serious strutting done through the KAS mod. Why didn\u0027t I think of this before? Particularly those engines - they wave all over the place at full throttle.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETravel Log\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDeparted Kerbin orbit in a non-Hohmann transfer - did this in two stages - a six-hundred m/s ejection burn (including Munar gravity assist) that put me just outside Kerbin SOI, and a longer transfer burn to Duna. With top acceleration a hair over 1.7 m/s2, this is going to be a loooong ejection burn.\u003C/p\u003E\u003Cp\u003EWe went with the non-Hohmann transfer to allow for a quicker travel time - I\u0027ve got a satellite enroute I\u0027d like to catch up to.\u003C/p\u003E\u003Cp\u003EAbout the time I completed the munar assist, I discovered a stowaway! Jonming Kerman had rode up with the Duna Lander Module, but never got off. In the huge personnel shuffle that occured post-launch, I must have forgotten to let him off. So, now I\u0027ve got SIX kerbals, instead of five. I think we\u0027re gonna roll with this. Unfortunately, we no longer have enough supplies to keep my guys alive on their long mission - supplies will have to be fast-tracked to Duna at considerable expense to meet the guys there.\u003C/p\u003E\u003Cp\u003EUpdates to follow!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-27T22:26:29Z\u0022 title=\u002201/27/2014 10:26  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 27, 2014\u003C/time\u003E by MilkToast\u003C/strong\u003E\n\u003Cbr\u003EThe stowaway\n\u003C/span\u003E\n"},{"CreatedByName":"Genolution","CreatedById":54840,"CreatedDateTime":"2014-01-26T06:21:54Z","Content":"\n\u003Cp\u003EAh yes, I remember my first mothership \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Congrats. Now go everywhere!\u003C/p\u003E\n"},{"CreatedByName":"Bedwind","CreatedById":101903,"CreatedDateTime":"2014-01-26T07:29:20Z","Content":"\n\u003Cp\u003EI thought I was doing pretty good with my little rinky-dink multipart ship. I need to catch up!\u003C/p\u003E\n"}]}