{"TopicId":61187,"ForumId":55,"TopicTitle":"What I would change in \u0026quot;What not to suggest\u0026quot;","CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2014-01-26T16:48:46Z","PageNum":1,"Articles":[{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2014-01-26T16:48:46Z","Content":"\n\u003Cp\u003EOk, I think two things in \u0022what not to suggest\u0022 should\u0027t be there. First thing: links to the mods. If devs couldn\u0027t add things, that are already in mods, there wouldn\u0027t be any rover parts, space station parts etc. or any progress, because everything is already added in the mod. Second thing: New parts and tech trees: some of them are really orginal and could improve realism and gameplay.\u003C/p\u003E\n"},{"CreatedByName":"iamaphazael","CreatedById":49843,"CreatedDateTime":"2014-01-26T16:54:59Z","Content":"\n\u003Cp\u003EBear in mind that \u0022what not to suggest\u0022 is not the same as \u0022never going to happen\u0022. There are a lot of ideas out there that are really good ideas, and the devs know they are really good ideas, and are probably already thinking about how to make happen, that keep getting suggested over and over again. In fact, looking over the list, there are at least a couple of things that are planned features (or have at least been planned features at some point in the past), as well as some things that have been explicitly stated as \u0022will not happen\u0022.\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-01-26T18:52:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iamaphazael\u0022 data-cite=\u0022iamaphazael\u0022\u003E\u003Cdiv\u003EBear in mind that \u0022what not to suggest\u0022 is not the same as \u0022never going to happen\u0022. There are a lot of ideas out there that are really good ideas, and the devs know they are really good ideas, and are probably already thinking about how to make happen, that keep getting suggested over and over again. In fact, looking over the list, there are at least a couple of things that are planned features (or have at least been planned features at some point in the past), as well as some things that have been explicitly stated as \u0022will not happen\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. OP should be paying attention as it specifically states this.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-01-26T21:06:37Z","Content":"\n\u003Cp\u003EPrecisely. The WNTS list is not here to tell you what won\u0027t happen. It\u0027s simply a list of ideas that were a) suggested many, many times, and have been noted down by the devs and do not need to be suggested again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E are too vague and unprecise c) have been confirmed to not be in the game.\u003C/p\u003E\u003Cp\u003EFor this later state, you can identify it with ideas that are followed with an asterisk (*)\u003C/p\u003E\u003Cp\u003ELinks to mods are not there to say that the devs are not going to do it and that this is the replacement. The game is still in development. Links to mods are simply there to say \u0022This item is on the wnts fore *\u003Cem\u003Ereasons\u003C/em\u003E* but a modder has done this if you want to try it.\u0022\u003C/p\u003E\u003Cp\u003EAs for \u0022more parts\u0022 this falls under the second clause. It\u0027s simply to vague. More parts wil be added eventually. Suggesting \u0022mo4r parts pls\u0022 is not being of a huge help in many ways. But if you read the WNTS post carefully, you\u0027ll have noticed that precise and specific ideas are welcomed.\u003C/p\u003E\u003Cp\u003EThe WNTS List is \u003Cem\u003Enot\u003C/em\u003E restricitve measure. The WNTS is there to inform you of which ideas have already been suggested or turned down, all of this in the goal of helping you guys find new and original ideas.\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2014-01-27T14:17:51Z","Content":"\n\u003Cp\u003ESorry. didn\u0027t read the end, but about tech trees, you could do the same as you did with parts - if someone draw new tech tree that is better than the old one you souldn\u0027t close it. And i know that \u0022What not to suggest\u0022 isn\u0027t here to tell what will not be implemented.\u003C/p\u003E\n"},{"CreatedByName":"iamaphazael","CreatedById":49843,"CreatedDateTime":"2014-01-27T14:54:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bartekkru99\u0022 data-cite=\u0022bartekkru99\u0022\u003E\u003Cdiv\u003E- if someone draw new tech tree that is better than the old one you souldn\u0027t close it\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey wouldn\u0027t. People are free to modify the tech tree and to post their versions of it on here, as far as I know. What they don\u0027t want is people saying either \u0022You guys should re-do the tech tree!\u0022 or \u0022Here is a redone tech tree I made. You should make it stock!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Atoning Unifex","CreatedById":58766,"CreatedDateTime":"2014-01-27T14:56:34Z","Content":"\n\u003Cp\u003EMaybe they should add \u0027Changes to What not to suggest\u0027 to the What not to suggest list... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-01-27T15:00:12Z","Content":"\n\u003Cp\u003Eif i understand correctly from various mod posts, it is OK to constructively discus things that are on the already suggested list but not suggest them again and again.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-27T15:19:37Z","Content":"\n\u003Cp\u003EWe have two lists here:\u003C/p\u003E\u003Cp\u003E- What Not to Suggest - if you suggest it, your suggestion will be locked because we don\u0027t want to see such suggestions here\u003C/p\u003E\u003Cp\u003E- Already Suggested - many people came with that many times already so if you do, it\u0027s not new and it won\u0027t change much\u003C/p\u003E\u003Cp\u003EI believe these two lists should not overlap. WNTS list should IMO only contain things that were explicitly denied by developers as that means (usually) there\u0027s no point in suggesting them. I don\u0027t think anything else should be forbidden to be suggested. After all, if more people come with the same (or similar) suggestion is an indication that there\u0027s real interest in that feature in the community. By discouraging players to do so, you\u0027re getting rid of that useful indicator.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-01-27T16:28:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EWe have two lists here:\u003Cp\u003E- What Not to Suggest - if you suggest it, your suggestion will be locked because we don\u0027t want to see such suggestions here\u003C/p\u003E\u003Cp\u003E- Already Suggested - many people came with that many times already so if you do, it\u0027s not new and it won\u0027t change much\u003C/p\u003E\u003Cp\u003EI believe these two lists should not overlap. WNTS list should IMO only contain things that were explicitly denied by developers as that means (usually) there\u0027s no point in suggesting them. I don\u0027t think anything else should be forbidden to be suggested. After all, if more people come with the same (or similar) suggestion is an indication that there\u0027s real interest in that feature in the community. By discouraging players to do so, you\u0027re getting rid of that useful indicator.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe WNTS and already suggested list are two different things.\u003C/p\u003E\u003Cp\u003EThe difference mainly lies within the fact that the already suggested list is an unofficial list that simply serves as a reference for links to posts of things that have been suggested a few times.\u003C/p\u003E\u003Cp\u003EThe WNTS is a list of things that we\u0027ve heard enough of and that do not need to be suggested again.\u003C/p\u003E\u003Cp\u003EThe already suggested list is just a reference to go and contribute to the existing threads about an idea. It does not say \u0022don\u0027t suggest this again\u0022, it says \u0022here, if you had this idea, there\u0027s already a discussion about it going on\u0022. WNTS just says \u0022we already know, keep brainstorming.\u0022\u003C/p\u003E\u003Cp\u003EYou are right that both should not overlap, and they don\u0027t so far IMO. One says \u0022don\u0027t\u0022, the other says \u0022go here\u0022.\u003C/p\u003E\u003Cp\u003EIt\u0027s also important to say that the WNTS has been aroudn for much much longer than the already suggested list. And again, the already suggested list was made to a request of Capt\u0027n Skunky to have a repository of links to useful threads.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-27T18:31:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stupid_chris\u0022 data-cite=\u0022stupid_chris\u0022\u003E\u003Cdiv\u003EThe WNTS and already suggested list are two different things.\u003Cp\u003EThe difference mainly lies within the fact that the already suggested list is an unofficial list that simply serves as a reference for links to posts of things that have been suggested a few times.\u003C/p\u003E\u003Cp\u003EThe WNTS is a list of things that we\u0027ve heard enough of and that do not need to be suggested again.\u003C/p\u003E\u003Cp\u003EThe already suggested list is just a reference to go and contribute to the existing threads about an idea. It does not say \u0022don\u0027t suggest this again\u0022, it says \u0022here, if you had this idea, there\u0027s already a discussion about it going on\u0022. WNTS just says \u0022we already know, keep brainstorming.\u0022\u003C/p\u003E\u003Cp\u003EYou are right that both should not overlap, and they don\u0027t so far IMO. One says \u0022don\u0027t\u0022, the other says \u0022go here\u0022.\u003C/p\u003E\u003Cp\u003EIt\u0027s also important to say that the WNTS has been aroudn for much much longer than the already suggested list. And again, the already suggested list was made to a request of Capt\u0027n Skunky to have a repository of links to useful threads.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see much difference between \u0022we already know\u0022 and \u0022here\u0027s more of this\u0022, because for both clearly there is certain prior discussion.\u003C/p\u003E\u003Cp\u003EI also see locking a thread as a rough action and it definitely gives that feel of \u0022shut up, this is not welcome here\u0022. Most of the WNTS thread does not link to prior suggestions, majority of links are to mods instead.\u003C/p\u003E\u003Cp\u003EAlready suggested list gives postitive feeling, while what not to suggest list gives negative feeling. Even though WNTS is here longer, I believe \u0022already suggested\u0022 is better approach.\u003C/p\u003E\u003Cp\u003EI also think that if you don\u0027t want to suppress discussion but want to keep suggestions clean, you could merge new instances of old suggestions instead of locking them. References in the \u0022already suggested\u0022 list could be useful for that.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-01-28T01:18:31Z","Content":"\n\u003Cp\u003EThere is often little point in merging new suggestions into old, because a very large portion of the time the new suggestions are exact duplicates or even less detailed than previous suggestions. If they have something new to add, then sure, but other than that there really tends to be no point. We\u0027d just end up with a very long thread with 90% of the posts being exact duplicates.\u003C/p\u003E\u003Cp\u003EThings on the WNTS are also sometimes closed because they are a touchy topic and seem to always devolve into arguments (e.g., the whole multiplayer thing prior to Squad announcing it was a plan). Things that are planned may also be there to discourage generalised suggestions, but if (for example) someone came along with a really focused and detailed idea of how to implement certain facets of multiplayer (as opposed to simply saying \u0022give us multiplayer\u0022), then we would almost certainly leave it open.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-28T01:20:52Z\u0022 title=\u002201/28/2014 01:20  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 28, 2014\u003C/time\u003E by vexx32\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-01-28T01:43:21Z","Content":"\n\u003Cp\u003EThe main reason threads are being closed here if they are on the WNTS is simply to keep some form of order and cleaness.\u003C/p\u003E\u003Cp\u003EThis subforum is amongst the top five most active along with the general and addon forums. The devs are already quite busy. If the goal of this forum is to bring up new ideas, the amount of old and already known ideas has to be minimal for them to browse this forum easily when theyfind the time to.\u003C/p\u003E\u003Cp\u003EIf your interpretation of it is \u0022shut up this isn\u0027t welcomed\u0022, you are quite wrong. I don\u0027t even see how that makes sense.\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2014-10-12T18:29:46Z","Content":"\n\u003Cp\u003Ecan someone close that thread?\u003C/p\u003E\n"}]}