{"TopicId":61310,"ForumId":16,"TopicTitle":"Non-Hohmann Transfer Orbits","CreatedByName":"MilkToast","CreatedById":82136,"CreatedDateTime":"2014-01-27T20:28:21Z","PageNum":1,"Articles":[{"CreatedByName":"MilkToast","CreatedById":82136,"CreatedDateTime":"2014-01-27T20:28:21Z","Content":"\n\u003Cp\u003EI\u0027ve got a ship I would love to get to Duna soon. \u003C/p\u003E\u003Cp\u003EThe nearest Hohmann transfer window is in 209 days (thank you Kerbal Alarm Clock) - with travel time of a month or so, I\u0027m looking at 250 days to get there.\u003C/p\u003E\u003Cp\u003EWhat I\u0027d like to do is get there sooner - leave BEFORE the window. I do not want to timewarp - rather, I\u0027ve got a ship already enroute from the last transfer window, and I\u0027d love to get there shortly after it does.\u003C/p\u003E\u003Cp\u003EI\u0027m looking for tips and thoughts on how to do it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T06:47:57Z\u0022 title=\u002201/29/2014 06:47  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by MilkToast\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"User Unrelated","CreatedById":74021,"CreatedDateTime":"2014-01-27T20:34:03Z","Content":"\n\u003Cp\u003EYou don\u0027t HAVE to leave during departure windows.\u003C/p\u003E\u003Cp\u003Echeck out the launch planner...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethe shortest time that it says you would need to get there (from LKO, to LDO) is 38 days (with the optimal Dv minimization taking between 50 and 60 days)\u003C/p\u003E\u003Cp\u003EYou would need a mega heap of Dv, but you should be able to get there sooner... I\u0027m not quite sure what method to use, though.\u003C/p\u003E\u003Cp\u003EProbably just pack way more Dv than you need, and ham-fist your way over there.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-01-27T20:46:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022User Unrelated\u0022 data-cite=\u0022User Unrelated\u0022\u003E\u003Cdiv\u003EYou don\u0027t HAVE to leave during departure windows.\u003Cp\u003Echeck out the launch planner...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethe shortest time that it says you would need to get there (from LKO, to LDO) is 38 days (with the optimal Dv minimization taking between 50 and 60 days)\u003C/p\u003E\u003Cp\u003EYou would need a mega heap of Dv, but you should be able to get there sooner... I\u0027m not quite sure what method to use, though.\u003C/p\u003E\u003Cp\u003EProbably just pack way more Dv than you need, and ham-fist your way over there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe shortest I\u0027ve ever seen someone get to duna is around 4 days or 6. forgot\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-01-27T21:57:33Z","Content":"\n\u003Cp\u003EAs long as you can put your trajectory through Duna\u0027s orbit while it is there, you can transfer. If Duna is pretty far ahead, you can only wait, or you will have to throw your orbit far out to wait for an intercept. I would just time warp until the launch window. \u003C/p\u003E\u003Cp\u003EAlso, you can launch 2 ships in the same window, and the second one to depart can get there first, it just depends on the trajectory. If you missed the launch window by too much, there\u0027s not much you can do.\u003C/p\u003E\n"},{"CreatedByName":"Zuni","CreatedById":85203,"CreatedDateTime":"2014-01-27T22:04:35Z","Content":"\n\u003Cp\u003EThe best way is to do a hohmann. The easiest way is to strap a mainsail to a capsule, turn infinite fuel on and burn towards Duna until you get there.\u003C/p\u003E\n"},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2014-01-28T00:46:09Z","Content":"\n\u003Cp\u003EIf you\u0027re nearer the last launch window than the next one, it\u0027s easy: just burn past it until you get an intercept, keeping your perihelion at Kerbin.\u003C/p\u003E\u003Cp\u003EIf you\u0027re nearer the next launch window than the last one, it\u0027s harder, because you\u0027ll have to lower your perihelion to speed your orbit up and catch it up. You might even have to resort to a manoeuvre node to get an intercept, or something.\u003C/p\u003E\u003Cp\u003EAnyway, you can always get there, more or less. As someone said above, you just have to arrange to be in the same bit of space at the same time it is. Treat it like orbital rendezvous, only bigger, because that\u0027s what it is.\u003C/p\u003E\n"},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2014-01-28T01:08:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tank Buddy\u0022 data-cite=\u0022Tank Buddy\u0022\u003E\u003Cdiv\u003EAs long as you can put your trajectory through Duna\u0027s orbit while it is there, you can transfer. If Duna is pretty far ahead, you can only wait, or you will have to throw your orbit far out to wait for an intercept. I would just time warp until the launch window. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot true. You just need to exit Kerbin such that your perihelion is lower than Kerbin\u0027s orbit by a suitable amount so you can catch Duna up, and your aphelion gets the intercept. It\u0027s still faster than waiting for the window.\u003C/p\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2014-01-28T04:15:35Z","Content":"\n\u003Cp\u003EThe Hohmann transfer from Kerbin to Duna comes around about every 227 days. If you\u0027re 209 days from the next transfer, that means you\u0027re only about 18 days past the last transfer. The Duna launch window is pretty big, so you should still be able to launch right now without a big delta-v penalty. For example, if I use the calculator in my sig to find a launch window on day 84 (18 days after the first optimal launch window, which occurs on day 66) I get an ejection delta-v of 1162 m/s vs the optimal ejection delta-v of 1046 m/s, so you\u0027re only getting a penalty of about 120 m/s for launching late. Now, if you aren\u0027t doing an aerocapture, you may have a greater penalty on the insertion side because you will end up catching up to Duna with a greater relative velocity (in my example it ended up being 1189 m/s vs 647 m/s). I should also note the time of flight for the later launch is much longer (120 days vs 66 days), but you\u0027ll still get there earlier than if you waited for the next window to come around.\u003C/p\u003E\u003Cp\u003EThe bottom line is (1) launch windows are bigger than you think, and (2) you can always get from point a to point b, it\u0027s just a matter of how much delta-v you have to spend.\u003C/p\u003E\n"},{"CreatedByName":"MilkToast","CreatedById":82136,"CreatedDateTime":"2014-01-29T06:47:45Z","Content":"\n\u003Cp\u003E@Alexmun - Very helpful. That calculator is a piece of work.\u003C/p\u003E\u003Cp\u003EI went ahead and did the burn two or three days later, at slightly greater expense. \u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"}]}