{"TopicId":61451,"ForumId":34,"TopicTitle":"Mod bundler for \u0026quot;Real Solar System\u0026quot; (DEFUNCT)","CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-01-29T03:00:00Z","PageNum":3,"Articles":[{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-13T04:37:32Z","Content":"\n\u003Cp\u003EOoh, I\u0027ll think on that! I love what you\u0027ve done so far with RftS. I\u0027m learning a ton, even if it is an alternate history. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Makes me want to dig more into what *really* happened!\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-02-13T05:16:59Z","Content":"\n\u003Cp\u003EI don\u0027t think you have the patch for FASA in this, the explorer probe got 12 km before running out of fuel...\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-02-13T06:47:13Z","Content":"\n\u003Cp\u003Ejamis: cool! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EExplorer patch isn\u0027t done yet, that\u0027s probably why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-02-13T07:28:58Z","Content":"\n\u003Cp\u003EDamn lol, I wanted it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-13T14:55:23Z","Content":"\n\u003Cp\u003ENote that I don\u0027t use all the mods that the bundler supports (like FASA), so even when a patch is released, I may or may not even notice. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Please don\u0027t be shy about bringing these things up, because there are a LOT of mods involved, and I\u0027m bound to miss announcements.\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-14T00:52:20Z","Content":"\n\u003Cp\u003EWhew! Another update. Sorry these are coming so fast, but I think we\u0027re approaching the level of polish I envisioned for this. You\u0027ll need to grab the latest in order to take advantage of the mods I added. Please let me know if you find anything broken!\u003C/p\u003E\n"},{"CreatedByName":"tocooljim","CreatedById":62521,"CreatedDateTime":"2014-02-14T01:59:01Z","Content":"\n\u003Cp\u003EHey first off, I love this bundler. This is a wonderful tool for those that have played KSP for awhile and look for challenges. \u003C/p\u003E\u003Cp\u003EWith that said, I was wondering if you can add the alternate configs for RSS. They are linked in the top, for example, the 1/10th rescale. \u003C/p\u003E\u003Cp\u003EAlso, perhaps you can also include Kerbal ISP difficulty plugin. This will go good with those that want play normal kerbal but with realistic ISP and such.\u003C/p\u003E\u003Cp\u003EKeep up the good work, and perhaps this can be expanded into a much more full mod configer. \u003C/p\u003E\u003Cp\u003EOh PS. Planetfactory?\u003C/p\u003E\n"},{"CreatedByName":"tocooljim","CreatedById":62521,"CreatedDateTime":"2014-02-14T02:07:49Z","Content":"\n\u003Cp\u003EFirst off this is a wonderful project and makes the ease of use for RSS easy. My first suggestion is perhaps you can add the alternate configs for RSS. Also can you include \u0022Kerbal ISP difficulty scaler\u0022 which will help when using RSS with stock kerbal or not using RSS at all. Also supporting planetfactory would be nice addition! \u003C/p\u003E\u003Cp\u003EThis is a wonderful tool for those who are looking for the additional difficulty in making Jeb trying to get to orbit.\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-14T03:33:34Z","Content":"\n\u003Cp\u003E@tocooljim, good suggestion. Now that the bundler is maturing, I\u0027ll see about getting those alternate configs working. The ISP difficulty scalar is a good one, too.\u003C/p\u003E\n"},{"CreatedByName":"tocooljim","CreatedById":62521,"CreatedDateTime":"2014-02-14T03:44:51Z","Content":"\n\u003Cp\u003EHaha sorry about the two posts. On my phone. I look forward to it! Your tool has so many tools I use in general that it makes it a one click deal. Also one more suggestion add B9 and procedual wings. Ok for real. Thats all my suggestions haha.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2014-02-14T04:47:51Z","Content":"\n\u003Cp\u003ENice! \u003C/p\u003E\u003Cp\u003EYou should have PM\u0027d me, I would have put a link on the RPL page.\u003C/p\u003E\u003Cp\u003EI\u0027ll do so next update. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-14T05:07:48Z","Content":"\n\u003Cp\u003E@tocooljim - done. The alternate RSS configs are now available to select, as is the Kerbal ISP Difficulty Scaler. (I\u0027m going to have to start rethinking how I\u0027ve got the mods categorized...it\u0027s starting to feel kind of arbitrary.)\u003C/p\u003E\u003Cp\u003E@MedievalNerd - thanks! I\u0027d really appreciate that!\u003C/p\u003E\n"},{"CreatedByName":"tocooljim","CreatedById":62521,"CreatedDateTime":"2014-02-14T07:26:05Z","Content":"\n\u003Cp\u003E@jamis - I noticed there is a bug with RT2, you have it downloading the fixed DLL, but not downloading the rest of the actual mod. So when you try to play with RT2, it is all brokeded. You will need to first download the one from spaceport, then install the community fix after. \u003C/p\u003E\u003Cp\u003EAlso,can you add TAC-Fuel Balancer. I am on a roll I think lol.\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-14T13:25:23Z","Content":"\n\u003Cp\u003E@tocooljim, oops! Thanks for catching that. I\u0027ve got that fixed now, and also added the fuel balancer mod.\u003C/p\u003E\n"},{"CreatedByName":"usulrasolas","CreatedById":86541,"CreatedDateTime":"2014-02-14T20:12:15Z","Content":"\n\u003Cp\u003EGreat work! Everything is definitely starting to show some polish!\u003C/p\u003E\u003Cp\u003E@tocooljim The only thing I see with b9 is the amount of \u0022fixing\u0022 that it requires. If it gets into the bundler and has all the fixes that\u0027d be amazing! But b9 in its current state is one of the more fiddly mods to get set up right in .23 or rss.\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-14T21:39:10Z","Content":"\n\u003Cp\u003ERe: B9, if someone who\u0027s actually set up B9 wouldn\u0027t mind helping out, I wouldn\u0027t mind adding it to the bundler. One of the benefits of having a bundler is being able to centralize and standardize the \u0022fiddly bits\u0022, so it seems like it might be a pretty good fit. But since I\u0027ve never so much as installed it myself, I might not be the best person to have a go at making it work in the bundler.\u003C/p\u003E\u003Cp\u003EAlso, re: procedural wings, I\u0027ll see about adding those, too.\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-15T00:53:19Z","Content":"\n\u003Cp\u003EI added two alternate manifest files to the OP: one for the v6-pre1 release of \u0022Real Solar System\u0022 (with the actual map of Earth, instead of Kerbin), and one for the beautiful Alternis Kerbol mod. I hesitate to get into the business of making lots of alternate manifest files, because there\u0027s no way I\u0027ll be able to maintain them, but maybe these get can others inspired to try their hand.\u003C/p\u003E\n"},{"CreatedByName":"sjgold","CreatedById":101414,"CreatedDateTime":"2014-02-16T06:48:32Z","Content":"\n\u003Cp\u003EHi there...\u003C/p\u003E\u003Cp\u003EI just did a re-install of my machine... I can not get the .bat file to do anything nor can I get the .jars to execute by running the commands at the cmd prompt (no surprise on that one). I do have Java installed at updated... Are there any dependencies I am missing?\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-16T14:23:32Z","Content":"\n\u003Cp\u003E@sjgold, can you try the following:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E Open a command prompt\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E change to the directory where you installed the bundler\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E run the .bat file from that directory\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhat error message is printed to the terminal when the batch file runs?\u003C/p\u003E\u003Cp\u003ESorry for the wrinkles. Hopefully this one proves straightforward to iron out.\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2014-02-16T15:23:22Z","Content":"\n\u003Cp\u003EI love it! I now don\u0027t have to go through and manually download and install the mods I want. Thank you! It has made modding the game a whole lot easier!\u003C/p\u003E\n"},{"CreatedByName":"sjgold","CreatedById":101414,"CreatedDateTime":"2014-02-16T18:29:17Z","Content":"\n\u003Cp\u003EWell, this is a surprise...\u003C/p\u003E\u003Cp\u003E\u0027java\u0027 is not recognized as an internal or external command,\u003C/p\u003E\u003Cp\u003Eoperable program or batch file.\u003C/p\u003E\u003Cp\u003EI have some other Java stuff installed (minecraft) and its working... Its obviously on my side... I assume I need to add the java directory to my path... going to google how to do that in windows7 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"usulrasolas","CreatedById":86541,"CreatedDateTime":"2014-02-16T19:15:35Z","Content":"\n\u003Cp\u003ECheck if both 32bit and 64bit are installed. If you run a 64 bit windows then you need both for command line tools to work right.\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-16T20:18:57Z","Content":"\n\u003Cp\u003E@sjgold, the simplest \u0022solution\u0022 I\u0027ve found for this is to just go and download/reinstall Java. I\u0027m only vaguely familiar with Windows setups, but I suspect that the Java apps you\u0027ve got installed aren\u0027t relying on the command-line, and so perhaps a Java install was done that didn\u0027t include command-line setups. (If anyone is more familiar with Windows\u002BJava than me, please clarify this! Especially, I\u0027d love to know if there\u0027s something I can do with the bundler that would eliminate this confusion.)\u003C/p\u003E\n"},{"CreatedByName":"Gawin","CreatedById":97161,"CreatedDateTime":"2014-02-17T15:43:54Z","Content":"\n\u003Cp\u003EAm I the only one that has the batch file crash and then nothing else happen. It is also crashing so fast I can not get a report from it.\u003C/p\u003E\n"},{"CreatedByName":"jamis","CreatedById":84719,"CreatedDateTime":"2014-02-17T17:12:25Z","Content":"\n\u003Cp\u003EGawin,\u003C/p\u003E\u003Cp\u003ESo far, that happens because you don\u0027t have Java installed (or installed in a way that the bundler needs). My recommendation is to go to \u003Ca href=\u0022https://www.java.com/en/download/manual.jsp\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.java.com/en/download/manual.jsp\u003C/a\u003E and download and install Java (even if you\u0027ve already got it installed), and then see if that helps things at all.\u003C/p\u003E\u003Cp\u003EIf it does not help, you\u0027ll need to open a command prompt, change to the folder where you installed the bundler, and run the batch file manually. If you need instructions for how to do that, let me know and I\u0027ll be happy to be more explicit.\u003C/p\u003E\u003Cp\u003ESorry for the problems. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"}]}