{"TopicId":61474,"ForumId":25,"TopicTitle":"Breaker One-nine...!","CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-01-29T10:49:13Z","PageNum":1,"Articles":[{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-01-29T10:49:13Z","Content":"\n\u003Cp\u003EA signal! It\u0027s not on any of our usual frequencies, in fact the only reason it was detected is because Jeb spilled coffee on the comms panel. Unfortunately, we don\u0027t know what it says, as it\u0027s in a completely... alien... language.\u003C/p\u003E\u003Cp\u003EOur radio guy, Kerboni, has made the approximate range from Kerbin as 0.00km, outbound, which means it was coming from somewhere on the surface and directed into space. Long range satellite triangulation has it coming from somewhere on the Northern ice cap. Your mission, should you decide to accept it, is to go there and investigate whatever you find and bring back ground samples from the vicinity of whatever\u0027s up there.\u003C/p\u003E\u003Cp\u003EThere are, however, a few problems with equipment:\u003C/p\u003E\u003Cp\u003E- You don\u0027t have access to rockets. All we have in the shop is a rack of air breathing jets and liquid fuel systems.\u003C/p\u003E\u003Cp\u003E- Oxidiser is NOT available.\u003C/p\u003E\u003Cp\u003E- We have no robot probes to give for this mission, and we only have one cockpit which we were going to use for an aerobrake test prior to the Duna mission but we\u0027ll let you have that for this one - it takes precedence right now.\u003C/p\u003E\u003Cp\u003E- All our external command chairs are down with a problem with the suit heating systems, so they\u0027re not available either.\u003C/p\u003E\u003Cp\u003E{SPUDHEAD} The area in question is located near 81 57N, 128 39W, in a mountainous region which makes unsuitable conditions for a longstrip landing. I would suggest some sort of STOL aircraft. {/SPUDHEAD}\u003C/p\u003E\u003Cp\u003E**Normal \u0022no \u0027sploits\u0022 rules apply.**\u003C/p\u003E\u003Cp\u003EMission completion:\u003C/p\u003E\u003Cp\u003ESpecs of your aircraft (photo in hangar with info would be nice)\u003C/p\u003E\u003Cp\u003EPhoto of aircraft in flight\u003C/p\u003E\u003Cp\u003EPhoto of aircraft landed at scene\u003C/p\u003E\u003Cp\u003EPhoto of your crew disembarked at scene\u003C/p\u003E\u003Cp\u003EShot of ground sample science\u003C/p\u003E\u003Cp\u003EPhoto of your aircraft landed back at KSC or The Island strip, crew disembarked in front of aircraft\u003C/p\u003E\u003Cp\u003EShot of Mission Completion screen (F3)\u003C/p\u003E\u003Cp\u003EAll screenshots should show the MET (Mission Elapsed Time) clock in the top left corner.\u003C/p\u003E\u003Cp\u003EThis is intended as a fun mission, the parameters are set, a specific coordinate is given to travel to and return from with science. Free mods but remember you\u0027re restricted in terms of the powerplants and control mechanisms available to you. Of course, depending on what you find up there, you might want to leave a guard contingent to make sure nobody else stakes a claim...?\u003C/p\u003E\u003Cp\u003EMy first run:\u003C/p\u003E\u003Cp\u003EThe TransKerbal Heavy Airlift: 8 B9 stock variable inline intakes, 8 B9 stock jets.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://scontent-b-cdg.xx.fbcdn.net/hphotos-prn2/t31/1524025_400098066792863_1804138342_o.jpg\u0022 alt=\u00221524025_400098066792863_1804138342_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe wings were 2 clicks up angle and the cruise attitude was \u002B9.1 degrees at 470m/s@15,000m. So a pretty severe angle of attack, and I\u0027d have to say a pretty inefficient design - though for some unknown reason I made the ice cap having burned less than 2500 LF, I had expected to be doing the landing with shy of half left. At that rate I could circumnavigate Kerbin just by setting cruise attitude and going making dinner \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith gear down: yes, a tailhook and lots of pods dropping out of the engines and wingtips, this thing wanted to bounce and skid sideways down the runway, it needed all the tyres it could get.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-ash3/t31/1532093_400098013459535_123578399_o.jpg\u0022 alt=\u00221532093_400098013459535_123578399_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne problem I found with this particularly unimaginative design is that it doesn\u0027t handle fairly average airbreather altitude very well. In fact, at 18220m it flamed out one side completely and went into a powered flat spin, this was the inevitable result:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-prn1/t31/1557335_400098000126203_988139665_o.jpg\u0022 alt=\u00221557335_400098000126203_988139665_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...yes, directly over the landing site! I had planned on just doing an aerial survey as this plane had a ridiculous takeoff roll (it required the entire runway) and a minimum takeoff roll, fully laden, of 135m/s! No way would it have done a short landing on ice and rotate to take off again in the same short stretch.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T18:28:47Z\u0022 title=\u002201/29/2014 06:28  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by ihtoit\u003C/strong\u003E\n\u003Cbr\u003Eexample (failed) mission\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-29T11:00:06Z","Content":"\n\u003Cp\u003EBullet list of rules and restrictions would be nice, it\u0027s not hard to miss an important bit in load of free text not relevant to execution.\u003C/p\u003E\u003Cp\u003EHow do we win this anyway? Fastest time? Lightest craft? Most Kerbals?\u003C/p\u003E\u003Cp\u003EWhat about mods?\u003C/p\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-01-29T11:08:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EBullet list of rules and restrictions would be nice, it\u0027s not hard to miss an important bit in load of free text not relevant to execution.\u003Cp\u003EHow do we win this anyway? Fastest time? Lightest craft? Most Kerbals?\u003C/p\u003E\u003Cp\u003EWhat about mods?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethere ya go, not so much fixed as clarified.\u003C/p\u003E\n"}]}