{"TopicId":61484,"ForumId":55,"TopicTitle":"Fix Ridiculous No Gravity Blow Ups","CreatedByName":"Dyderich","CreatedById":93625,"CreatedDateTime":"2014-01-29T13:35:40Z","PageNum":1,"Articles":[{"CreatedByName":"Dyderich","CreatedById":93625,"CreatedDateTime":"2014-01-29T13:35:40Z","Content":"\n\u003Cp\u003ECreating a rover for the Mun and delivering it was pretty decent...figured I would drive the vehicle over to my lunar lander area from the landing (ended up across the moon with the rover so was going to be a long drive but no big deal)....but the mechanics on the vehicle is an issue that is game breaking...\u003C/p\u003E\u003Cp\u003EAre you kidding me? My rover will not break or when it does, it just flips constantly....I get acceleration to light speed in a matter of seconds even though I am not doing anything except steering...you bank just 1 degree the rover flips....are you kidding me? \u003C/p\u003E\u003Cp\u003EIf this was what a rover was all about the lunar landing on the Moon would have been a disaster....I can understand no atmos/etc...but the physics here are ridiculous...the vehicle should not be propelling itself all over the Mun trying to launch itself into space or just generally acting in ways you would never fathom it acting like...\u003C/p\u003E\u003Cp\u003EThese machines should be fairly slow going as was the lunar rover which Nasa used....so the part about constantly flipping and wanting to accelerate to light speed is crazy and should be removed - have it working a bit more realistically. My design was low to the ground slightly taller than the lunar rover with a decent wide base - but on the Mun it means diddly squat as the gravity of the Mun propels the rover constantly 45 degree or so in directions it appears to want me to go, rather than where I am slowly meandering to or should I say want to meander to..\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T15:45:17Z\u0022 title=\u002201/29/2014 03:45  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by vexx32\u003C/strong\u003E\n\u003Cbr\u003ERefrain from profanity, please.\n\u003C/span\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-01-29T18:12:21Z","Content":"\n\u003Cp\u003EYou have made a bad rover. Dont blame the devs for anything except proper friction. Also, each part servers different purposes.\u003C/p\u003E\n"},{"CreatedByName":"Andrew Hansen","CreatedById":82311,"CreatedDateTime":"2014-01-29T19:19:10Z","Content":"\n\u003Cp\u003ETry making sure the wheels are angled the correct way. You may have to rotate them in the Spaceplane Hanger with the WASD or Q and E keys.\u003C/p\u003E\n"},{"CreatedByName":"Atoning Unifex","CreatedById":58766,"CreatedDateTime":"2014-01-29T19:19:16Z","Content":"\n\u003Cp\u003EI must admit I\u0027ve had problems with rovers too (on the mun - not bothered going to others with rovers). It appears that only with a \u003Cem\u003Every\u003C/em\u003E long base can you get real stability. I\u0027ve also found that using the docking mode combined with SAS (you obviously need a reasonable torque on the vehicle) can keep the rover pretty stable but still turning and breaking can be tricky at speeds.\u003C/p\u003E\u003Cp\u003EI do agree that there does appear to be a distinct lack of any friction on the wheels, which causes the vehicle to race off on even gentle slopes. \u0027Proper\u0027 friction to me would cause a gradual deceleration.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-01-29T19:31:42Z","Content":"\n\u003Cp\u003ESet rover controls to the numpad keys and you good to go!\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-29T20:35:35Z","Content":"\n\u003Cp\u003EWASD keys on rovers affect both wheels and torque control. Then it depends on how your rover control is oriented what it may cause. One of good ideas for driving rovers is to switch to docking mode - that will allow you to drive your rover with SAS turned ON, making it more stable, and not affecting the SAS function by WASD keys.\u003C/p\u003E\u003Cp\u003EThe best solution is of course what tetryds mentioned, reassigning rover keys to numpad or e.g. IJKL keys (if you don\u0027t have RCS on your rover), making both torque control and wheel control available separately.\u003C/p\u003E\n"}]}