{"TopicId":61585,"ForumId":16,"TopicTitle":"SSTO Orange Tank Orbital Refuel-er?","CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-01-30T13:10:49Z","PageNum":1,"Articles":[{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-01-30T13:10:49Z","Content":"\n\u003Cp\u003EHi, \u003C/p\u003E\u003Cp\u003EI\u0027m building a massive mothership in orbit with 4 Orange Tanks with spaceplanes, rovers, landers, satelites docked. My question is after I used up the fuel to go to Jool or something like that and back, is it possible to Refuel the tanks with SSTO spaceplanes?\u003C/p\u003E\u003Cp\u003EMy guess that the plane would need to go to LKO 100km with a full/half orange tank and dock to transfer fuel; then return to KSC with the now empty tank safely. If anyone has ever done it, can you post me links/pics? I need tips for the SSTO constructions. Also no mods beside Mechjeb...\u003C/p\u003E\u003Cp\u003EThanks a bunch\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-31T07:38:33Z\u0022 title=\u002201/31/2014 07:38  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 31, 2014\u003C/time\u003E by m4rt14n\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Keymaster89","CreatedById":100480,"CreatedDateTime":"2014-01-30T13:32:43Z","Content":"\n\u003Cp\u003EI think it\u0027s possible, but u have consume a good amount of fuel in the process that was meant to go in the mothership because u\u0027ll need for sure a good number of jets and engines to make that mass able fly.\u003C/p\u003E\u003Cp\u003ESSTO IMO aren\u0027t good for resupply, but as orbital bus for Kerbals and little payload lifter are perfect.\u003C/p\u003E\u003Cp\u003EU should consider, instead of doing 8 or more SSTO flys, to build a single 4 orange tank refueler module... launch it, refuel and then destroy it or recycle it as a new tanker station...\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T13:50:15Z","Content":"\n\u003Cp\u003EHmm, I have not tried to deliver such a large payload with a space plane yet. It is completely possible. I have been delivering tanks via rocket because a space plane of this kind would be quite large. So the main problem will be maneuvering and docking in orbit. But again, completely possible. I think there are several youtube videos of people delivering orange tanks, but they are quite large.\u003C/p\u003E\u003Cp\u003EBut maybe I\u0027ll take up this new challenge. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: By the way, if you\u0027re just looking for SSTO, you can do that with a rocket instead of a space plane and it will be a bit simpler. It won\u0027t necessarily be fully recoverable like a space plane, but you can make SSTO rockets with TurboJet boosters.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T13:58:34Z\u0022 title=\u002201/30/2014 01:58  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-01-30T13:56:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBut maybe I\u0027ll take up this new challenge. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll race you to it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T13:59:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4rt14n\u0022 data-cite=\u0022m4rt14n\u0022\u003E\u003Cdiv\u003EI\u0027ll race you to it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe tonight, haha!\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-30T14:38:42Z","Content":"\n\u003Cp\u003EOkay...so you\u0027re wanting to build a spaceplane that can deliver the equivalent of an X200-32 (largest grey tank) and RCS, and possibly extra Liquid Fuel cannisters, right?\u003C/p\u003E\u003Cp\u003EThat\u0027s eighteen tonnes for the tank, 1.1 tonnes for each extra Mk1 Fuselage (I\u0027ve had problems attaching Mk2 Fuselages radially, otherwise I\u0027d be recommending thems) - say four for 4.4 tonnes, the large RCS tank weighs 3.4 tonnes, eight RCS blocks weigh 0.4 tonnes aggregate, the RCL-01 probe core weighs 0.5 tonnes, a pair of small battery packs will weigh 0.01 tonnes, and a pair of unshielded solar panels weigh .035 tonnes. Total mass of all this crap is 26.745 tonnes. I\u0027ma gonna say you need three Turbojets for that, three Mk2 Fuselages in the core, two pairs of wing connectors, five pairs of swept wings, two pairs of small control surfaces for elevons, a pair of AV-R8 Winglets for canards, another pair of AV-R8s for rudders, landing gear and a total of 34 ram air intakes. Total mass should be 34.625 tonnes. I\u0027d recommend breaking the single largest grey tank into four FL-T800 (long skinny tanks) and putting them away from the centerline. \u003C/p\u003E\u003Cp\u003EI dunno - that sounds like it\u0027d work to me, though for rendezvous and docking you might consider adding a low thrust engine to the end of the FL-T800s, say a pair of 48-7S. Unless you want to do all your rendezvous and docking maneuvers on RCS only (which, trust me, you probably don\u0027t have time for). Downside to that - you\u0027d be taking the fuel for docking out of what you meant to send up as payload. I have no qualms suggesting you do that with the big RCS tank, since that almost always has waaaaaaay much more than you need for docking purposes. Might suggest an extra pair of FL-T100s though specifically for rendezvous maneuvers. Shouldn\u0027t screw up anything.\u003C/p\u003E\u003Cp\u003ENow, 26.745 tonnes in a rocket is easy. Slap on a big stack decoupler, another probe core, an X200-8 and a 48-7S; you don\u0027t need much more since all you\u0027re doing is a rendezvous and docking - that adds another 5.5 tonnes of equipment, for 32.245 tonnes total payload. An SSTO booster for that would mass about 830 tonnes and consist of seven stacks of three orange tanks equivalent of fuel and a Mainsail each. Make sure they\u0027re \u003Cstrong\u003Ewell\u003C/strong\u003E strutted. Throttle back as necessary after the gravity turn to keep it around the top of the green zone of the gee meter and you should be golden.\u003C/p\u003E\u003Cp\u003EThe spaceplane option sounds easier to me - at least, it sounds like it\u0027d take fewer overall parts; then again, I\u0027m only partially confident about the \u0022design\u0022 I outlined above. Both are valid solutions, though.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-30T14:48:55Z","Content":"\n\u003Cp\u003Em4rt1n, the ammount of fuel you want to lift is a challenge for SSTOs. Record weight I\u0027ve seen an SSTO lift was 40 tons, but it was using some totally unrealistic techniques (it had the wings copied so it was really two wings for the size of 1 and had an over 8-1 intake engine ratio, using B9). Sans rediculous techniques, best payload I\u0027ve ever seen was 15 tons.\u003C/p\u003E\u003Cp\u003ENow, I\u0027ve tried without air hogging and wing clipping to deliver one of my standard fuel cans (standard docking port and 1.25-2.5m adapter OR Sr. docking port, large RCS tank, orange tank, same docking port setup on other end). I can put that in orbit without asparagus, as the whole thing, including rednezvous/docking upper stage, weighs less than 50 tons, which is starting to push my limits of single layer parallel staging.\u003C/p\u003E\n"},{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-01-30T15:16:12Z","Content":"\n\u003Cp\u003ECan you half a tank refuel, use the rest for fuel maybe? Is it easier to launch vertical then coast down to land?\u003C/p\u003E\n"},{"CreatedByName":"dualmaster","CreatedById":102257,"CreatedDateTime":"2014-01-30T15:18:26Z","Content":"\n\u003Cp\u003EThis is actually something I\u0027ve been working on for a little while - I want an SSTO that can put an orange tank and one of the large RCS fuel tanks into orbit. Thus far I\u0027ve come pretty close - I\u0027ve managed to rendezvous without ~80% of an orange tank remaining. Unfortunately, it requires some excessive air hogging which I find kinda lame. Without air hogging it will be pretty tough.\u003C/p\u003E\u003Cp\u003EI don\u0027t have any pics at the moment, but I\u0027ll see if I can get some later.\u003C/p\u003E\n"},{"CreatedByName":"SuperBigD60","CreatedById":76047,"CreatedDateTime":"2014-01-30T15:22:18Z","Content":"\n\u003Cp\u003EYou know, if you\u0027d allow FAR and B9, this challenge becomes trivial\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-30T16:13:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4rt14n\u0022 data-cite=\u0022m4rt14n\u0022\u003E\u003Cdiv\u003ECan you half a tank refuel, use the rest for fuel maybe? Is it easier to launch vertical then coast down to land?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou might be able to - I suppose I did forget the bit where you have to switch over to rockets for the final ascent and all that. The big difference there is one of your own personal gratification: the spaceplane is \u0022reusable\u0022, the rocket I suggested is most certainly not, but on the other hand it\u0027d be almost 100% guaranteed to reach your mothership still fully loaded.\u003C/p\u003E\n"},{"CreatedByName":"1greywind","CreatedById":82369,"CreatedDateTime":"2014-01-30T16:21:11Z","Content":"\n\u003Cp\u003EWith stock parts ~36 ton payload to LKO SSTO lifter will be somethat 200 ton on runway and 300-350 parts (~150 parts for wings, 100 for engines, intakes, fuel lines, rest for fuelage and auxilary).\u003C/p\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2014-01-30T17:00:05Z","Content":"\n\u003Cp\u003EI have done this. The Procedural Wings mod works miracles with making large spaceplanes. And a SSTO can get payload fractions over 30%, so on the runway I would expect it to be in the 120-150t range. Don\u0027t be afraid to use large engines like the Mainsail or T30 clusters for the rocket stage.\u003C/p\u003E\n"},{"CreatedByName":"dualmaster","CreatedById":102257,"CreatedDateTime":"2014-01-30T18:12:46Z","Content":"\n\u003Cp\u003EHere is my Hogger Refueler at 100 km orbit with almost a full orange tank and a large RCS tank.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/uh46J\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ECan\u0027t seem to figure out the right tags to get it to show up here.\u003C/p\u003E\u003Cp\u003EAnyways, it obviously abuses air hogging and also has some clipping via cubic octagonal struts (mostly for the sake of appearance rather than necessity). Still, it flies pretty well and was fun to make!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-28T13:28:23Z\u0022 title=\u002202/28/2014 01:28  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 28, 2014\u003C/time\u003E by dualmaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T18:26:31Z","Content":"\n\u003Cp\u003EWell, I already have SSTO rockets that carry an 80t payload with about 30% payload ratio (260ish tons).\u003C/p\u003E\u003Cp\u003EI\u0027ve already started work on a space plane capable of lifting a full orange tank (36t). My goal is better than 40% payload ratio or it won\u0027t be worth it with a space plane. I\u0027ve seen larger payloads, but this is my start. So ultimately I\u0027m aiming for around 70-80 tons on the runway. All stock.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T18:28:43Z\u0022 title=\u002201/30/2014 06:28  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-30T18:29:39Z","Content":"\n\u003Cp\u003EGood luck - 70t is about the mass I had on the Auk III and I never could get that one off the ground for all the structural problems it had.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T19:41:00Z","Content":"\n\u003Cp\u003EMy initial prototype currently weighs a bit over 72 tons. It\u0027s flown above 25km and needs more work, but so far it\u0027s on track.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-01-30T19:53:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EWell, I already have SSTO rockets that carry an 80t payload with about 30% payload ratio (260ish tons).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECraft file? I\u0027m still playing-around optimising pure-rocket launch vehicles but 30% with jet assist has to be worth it. I want to complete my \u0027set\u0027 first because over about 10t my VAB jet designs have become \u0027moar\u0027 spam :-( Love to see how you\u0027re doing it. In the meantime, as you know, I\u0027ve been playing with spaceplanes when rocket-launch after rocket-launch has got boring. The hope is that this\u0027ll better inform my rocket designs though - while they\u0027re fun spaceplanes are too much of a pain to get into orbit for me to use regularly. ... At least while resuability isn\u0027t really an issue.\u003C/p\u003E\n"},{"CreatedByName":"1greywind","CreatedById":82369,"CreatedDateTime":"2014-01-30T20:31:33Z","Content":"\n\u003Cp\u003ECheck this - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67870-Heavy-SSTO-lifter-(-40-ton-payload-to-LKO)-prototype\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/67870-Heavy-SSTO-lifter-(-40-ton-payload-to-LKO)-prototype\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EI have not yet finished work on it, but it is already able to deliver 1 orange tank to LKO.\u003C/p\u003E\n"},{"CreatedByName":"Alistone","CreatedById":60032,"CreatedDateTime":"2014-01-30T20:47:03Z","Content":"\n\u003Cp\u003EI\u0027ve beel playing around with this idea for the past few days. \u003C/p\u003E\u003Cp\u003EAs a spaceplane my large orange tanks are difficult to control; difficult to land; a bit unstable as wing wiggle can ripple them apart.\u003C/p\u003E\u003Cp\u003EThe wheels are a real pain too; since it is soo heavy it is very difficult to land without destroying the wheels (and most everything else).\u003C/p\u003E\u003Cp\u003EI was transitioning to trying to make a \u0022shuttlecraft\u0022 that could take of vertically to avoid the wheel problem, but that brings it\u0027s own set of challenges (flipping over).\u003C/p\u003E\u003Cp\u003EIt\u0027s going to take a lot of work, but I think it can be done stock. Just before coming to work today I had a \u0022umbrella\u0022 design that was relatively stable 10 TJE on \u0022T\u0022s symetrically (VAB) above the orage tank (low CoG relative to thrust to keep it upright) and pulled an orange tank easily to over 20,000 before returning to KSP to land.\u003C/p\u003E\u003Cp\u003EFuture improvements incoming to push it further into space; but I assume you\u0027d be satisfied if it was a VTOL craft instead of a traditional spaceplane.\u003C/p\u003E\u003Cp\u003EI don\u0027t do \u0022clipping\u0022 and I don\u0027t use mods, so it is particularly challenging and figuring out the transition to rocket propulsion will likely involve some explosions during testing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jedensuscg\u0022 data-cite=\u0022jedensuscg\u0022\u003E\u003Cdiv\u003EI am coming to the conslusion fast that if I want to build a usable and decent looking SSTO space plane, I am going to have to do away with my aversion to enabling clipping.\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T20:49:14Z\u0022 title=\u002201/30/2014 08:49  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by Alistone\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T22:53:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003ECraft file? I\u0027m still playing-around optimising pure-rocket launch vehicles but 30% with jet assist has to be worth it. I want to complete my \u0027set\u0027 first because over about 10t my VAB jet designs have become \u0027moar\u0027 spam :-( Love to see how you\u0027re doing it. In the meantime, as you know, I\u0027ve been playing with spaceplanes when rocket-launch after rocket-launch has got boring. The hope is that this\u0027ll better inform my rocket designs though - while they\u0027re fun spaceplanes are too much of a pain to get into orbit for me to use regularly. ... At least while resuability isn\u0027t really an issue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m sorry. I must retract my statement slightly. My 80t lifter isn\u0027t an SSTO yet, but it does have a 30% payload ratio. I\u0027ve been iterating designs of a family of 20t, 40t, 60t, 80t lifters and the 60/80t aren\u0027t SSTO. They are currently two stage as I ditch the jets during ascent (with parachutes to recover). The rocket portion finishes orbital ascent/insertion, then acts as a tug for docking/deorbit. So my 80t design is not an SSTO.\u003C/p\u003E\u003Cp\u003EI don\u0027t have a file hoster at the moment, but here\u0027s a picture of my 20t lifter (also about 30% payload). It\u0027s probably a better picture to show anyway as it\u0027s a little cleaner and you can see what\u0027s going on better. It\u0027s designed to ditch the TurboJets, but you can also hold onto them if you desire. It wasn\u0027t meant to be reusable, so no guarantees on landing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nn7wYvi.jpg\u0022 alt=\u0022nn7wYvi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I\u0027ve just kept scaling this up. Turns out whatever rocket fuel you have up top, you\u0027ll need on the bottom (plus a little as the payload gets bigger). Also, if I wanted to use this as an SSTO it needs adjustment to the RCS system.\u003C/p\u003E\u003Cp\u003EEDIT: I added an orbital shot too. Not the best ascent, but here it is in 80x80 orbit with about 150ish dV left. It was designed to have 500 dV left after ditching the TurboJets.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T23:07:31Z\u0022 title=\u002201/30/2014 11:07  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T23:11:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EI want to complete my \u0027set\u0027 first because over about 10t my VAB jet designs have become \u0027moar\u0027 spam :-( \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends on what you mean by moar spam. On my rockets I have been using only 1 intake per engine, but it takes a lot of engines to lift 240\u002B tons (which is what my 80t lifter weighs right now). I haven\u0027t spent a lot of time on the 80t because my goal has been to make a 100t lifter with TurboJet boosters. Past 40t the rocket actually becomes the weak link and tears itself apart. The TurboJets start producing too much thrust at high altitude and you have to pay attention to acceleration and payload mass or it crushes itself.\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-01-30T23:48:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat\u0027s eighteen tonnes for the tank, 1.1 tonnes for each extra Mk1 Fuselage (I\u0027ve had problems attaching Mk2 Fuselages radially, otherwise I\u0027d be recommending thems) - say four for 4.4 tonnes, \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you aren\u0027t going to use Mk2 or Mk3 fuselages then you are better off removing the oxidizer from rocket fuel tanks, other than round-8s and oscar-Bs they have a better ratio than the MK1 fuselage.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-31T00:52:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhomphaia\u0022 data-cite=\u0022Rhomphaia\u0022\u003E\u003Cdiv\u003EIf you aren\u0027t going to use Mk2 or Mk3 fuselages then you are better off removing the oxidizer from rocket fuel tanks, other than round-8s and oscar-Bs they have a better ratio than the MK1 fuselage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s true, but you also sacrafice some structural integrity using rocket tanks. So care needs to be taken when placing.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-31T01:09:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EThat\u0027s true, but you also sacrafice some structural integrity using rocket tanks. So care needs to be taken when placing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThree words: Kerbal Joint Reinforcement.\u003C/p\u003E\u003Cp\u003ENever have I had a problem with a serially staged rocket since installing that.\u003C/p\u003E\n"}]}