{"TopicId":61687,"ForumId":16,"TopicTitle":"How do you transition from jet to rocket in a spaceplane without spinning?","CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-31T11:29:13Z","PageNum":1,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-31T11:29:13Z","Content":"\n\u003Cp\u003EWith any sort of spaceplane design, you come to a point during the flight where the air thins out to the point where you need to turn off the air-breathing engines and switch to a rocket engine.\u003C/p\u003E\u003Cp\u003EI have never been able to do this without either spinning uncontrollably at the moment of transition, or leaving the engines off long enough that a large amount of the vessel\u0027s momentum is lost to drag during the transition period.\u003C/p\u003E\u003Cp\u003EIf I wait for the engines to flameout on their own in a twin engine plane, they generally don\u0027t flameout at exactly the same time as each other, leading to uncontrollable spin from the few seconds of uneven thrust when one engine was on and the other was not.\u003C/p\u003E\u003Cp\u003EIf I hit \u0027x\u0027 to kill the engines first, they take too long to spool down to zero and I lose too much momentum waiting for that.\u003C/p\u003E\u003Cp\u003EIf I try to kill the engines just before the flameout, by watching the air intake\u0027s rightclick menu and as it starts getting dangerously close to zero using a pre-assigned action group that I assigned to the \u0022toggle\u0022 action on the engines when hitting ALT-1, then only one of the two engines turns off when I do it! Even though the two engines are built with symmetry and are the \u0022same\u0022 engine as far as the action group tab is concerned, only the left engine actually toggles off when I use ALT-1. Thus, uncontrolled spin results.\u003C/p\u003E\u003Cp\u003EIt\u0027s one of the infuriating things about spaceplanes and it\u0027s the reason I never use them despite having over 1000 hours in the game. I think if this was solvable they\u0027d be usable. And clearly it has to be solvable because other people use them. I just don\u0027t understand how they\u0027re making the two jet engines cutoff at the same time to avoid the spin.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-01T01:14:13Z\u0022 title=\u002202/01/2014 01:14  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 1, 2014\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-31T11:36:43Z","Content":"\n\u003Cp\u003EAll my spaceplanes up to now (not that many of them) are capable of getting orbital speeds in upper atmosphere. So I fly at ~40 km, raise my apoapsis to ~150 km, coast to apoapsis and circularize there. It gives plenty of time to do any switching.\u003C/p\u003E\u003Cp\u003EI also usually use designs with odd number of jet engines (3 or 1) and switch off all but one engine in higher atmosphere. That solves any problem with unbalanced thrust.\u003C/p\u003E\u003Cp\u003ETo effectively switch engines, use action groups. One key to activate your rocket engine, one or more keys to activate/deactivate your jet engines. Deactivating a jet engine makes it to spool down immediately too, getting rid of a lot of problems.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-31T11:49:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EAll my spaceplanes up to now (not that many of them) are capable of getting orbital speeds in upper atmosphere. So I fly at ~40 km, raise my apoapsis to ~150 km, coast to apoapsis and circularize there. It gives plenty of time to do any switching.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow on earth do you get them to have air above about 20km? I\u0027ve tried additional intakes but that is bugged because they don\u0027t spread to the engines correctly and only one of the engines gets all the additional air when you do that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI also usually use designs with odd number of jet engines (3 or 1) and switch off all but one engine in higher atmosphere. That solves any problem with unbalanced thrust.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere do you fit the rocket that is needed? At some point you do need one, to lift periapsis after you get to your apopasis. I was trying to put the rocket in as the middle center piece.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETo effectively switch engines, use action groups. One key to activate your rocket engine, one or more keys to activate/deactivate your jet engines. Deactivating a jet engine makes it to spool down immediately too, getting rid of a lot of problems.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the action groups aren\u0027t toggling both the two engines in a symmetry group like they should. They\u0027re only toggling one of them. This is the solution I was trying but that problem made it not work as a solution.\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-01-31T12:00:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBut the action groups aren\u0027t toggling both the two engines in a symmetry group like they should. They\u0027re only toggling one of them. This is the solution I was trying but that problem made it not work as a solution.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is a known issue that if you assign an action group to a symmetry grouped part, then later remove and replace the part the action group only acts for one. Setting up action groups should be the final stage of the build.\u003C/p\u003E\n"},{"CreatedByName":"uui8457","CreatedById":96312,"CreatedDateTime":"2014-01-31T12:03:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E But the action groups aren\u0027t toggling both the two engines in a symmetry group like they should. They\u0027re only toggling one of them. This is the solution I was trying but that problem made it not work as a solution.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my action group for transisting I turn off the Jet engines, close all the intakes and start my rocket engine(s)\u003C/p\u003E\u003Cp\u003EWhen closing all the intakes at the same time, the engines cut off immediately and doesn\u0027t make my plane spin, no matter what.\u003C/p\u003E\u003Cp\u003EAre you sure you have both of the engines in your action group? If you for example attached them one-by-one without symmetry and then clicking on just one of them for the action group, only one will of course acctually turn off.\u003C/p\u003E\u003Cp\u003EHope you get it sorted out! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-31T12:04:04Z","Content":"\n\u003Cp\u003EHmm. I just did an experiment and it turns out I only get the \u0022one engine toggle\u0022 problem when I build the craft in this order:\u003C/p\u003E\u003Cp\u003E1 - Turn off bi-symmetry.\u003C/p\u003E\u003Cp\u003E2 - Attach fuel tank to left side of plane (getting only a tank on the left side because symmetry is off)\u003C/p\u003E\u003Cp\u003E3 - Attach air intake to fuel tank (getting only a tank on the left side because symmetry is off)\u003C/p\u003E\u003Cp\u003E4 - Attach jet engine to fuel tank (getting only a tank on the left side because symmetry is off)\u003C/p\u003E\u003Cp\u003E5 - click action group tab.\u003C/p\u003E\u003Cp\u003E6 - click jet engine.\u003C/p\u003E\u003Cp\u003E7 - assign \u0022toggle engine\u0022 to action group 1.\u003C/p\u003E\u003Cp\u003E8 - Turn on bi-symmetry.\u003C/p\u003E\u003Cp\u003E9 - Detach original fuel tank from left side and reattach it now that symmetry is turned on - causing it to clone the entire tree of parts from there on down and make a copy of it on the right side.\u003C/p\u003E\u003Cp\u003EThat may seem like a weird way to do it but it\u0027s sometimes necessary because it won\u0027t let you attach parts, thinking there\u0027s phantom collisions with other parts, unless you build the entire structure one-sided and then clone it later.\u003C/p\u003E\u003Cp\u003EIf on the other hand I build it in THIS order, it works:\u003C/p\u003E\u003Cp\u003E1 - Turn on bi-symmetry.\u003C/p\u003E\u003Cp\u003E2 - Attach fuel tank to left side of plane (getting a matching one on the right side too because of symmetry)\u003C/p\u003E\u003Cp\u003E3 - Attach air intake to fuel tank (getting a matching one on the right side too because of symmetry)\u003C/p\u003E\u003Cp\u003E4 - Attach jet engine to fuel tank (getting a matching one on the right side too because of symmetry)\u003C/p\u003E\u003Cp\u003E5 - click action group tab.\u003C/p\u003E\u003Cp\u003E6 - click jet engine.\u003C/p\u003E\u003Cp\u003E7 - assign \u0022toggle engine\u0022 to action group 1.\u003C/p\u003E\u003Cp\u003EBut unfortunately it\u0027s not always possible to build it that way because of the \u0022refuse to let you attach parts symmetrically that you CAN attach one at a time\u0022 bug.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-31T12:09:21Z\u0022 title=\u002201/31/2014 12:09  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 31, 2014\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-31T12:16:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhomphaia\u0022 data-cite=\u0022Rhomphaia\u0022\u003E\u003Cdiv\u003EIt is a known issue that if you assign an action group to a symmetry grouped part, then later remove and replace the part the action group only acts for one. Setting up action groups should be the final stage of the build.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat sounds like the problem I\u0027m having. I\u0027ve just never encountered it before. The strange thing is that even when I tried re-assigning the action group after symmetrizing it still has the problem. I have to delete the jet engines entirely and re-attach new ones (thus clearing off the previous action groups for it) before I can get proper symmetry from its action group. If I just go into action group 1, remove the action, and then re-assign it, with the engines still there, they still lack symmetry in the action groups. Only removing the engine any putting a new one one in its place seems to make it \u0022forget\u0022 the buggy data and allow the action groups to have symmetry.\u003C/p\u003E\u003Cp\u003EOnce the game has gotten it in its head that the part\u0027s action groups should not be symmetrical, that mistaken notion stays true for that part from then on, even if you try to reassign its action groups after finishing the build. You have to throw that part away and go get a new part from the parts bin to break free from the problem.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-31T12:56:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EHow on earth do you get them to have air above about 20km? I\u0027ve tried additional intakes but that is bugged because they don\u0027t spread to the engines correctly and only one of the engines gets all the additional air when you do that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy last \u0022plane\u0022 used 4 intakes and one engine. The trick is going very fast. Trying to get above 25 km if you\u0027re below ~1500 m/s is pointless. And the other trick is decreasing the throttle. As you already go at near orbital speed, you don\u0027t need lift or much thrust. And when the engine is at low throttle it can go with the little air it gets.\u003C/p\u003E\u003Cp\u003ESome time ago I had a ship with six intakes and one engine and it was still able to \u0022pulse\u0022 at 60 km. 0.23 resource optimizations made these things really easier, although they introduced other problems.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EWhere do you fit the rocket that is needed? At some point you do need one, to lift periapsis after you get to your apopasis. I was trying to put the rocket in as the middle center piece.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERocket engines don\u0027t flameout one by one. So I mount them in pairs, symmetrically.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EBut the action groups aren\u0027t toggling both the two engines in a symmetry group like they should. They\u0027re only toggling one of them. This is the solution I was trying but that problem made it not work as a solution.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlready discussed as I can see - you need to either set it up as the last thing, or re-apply the setting after adjustments. Just open the action group, remove the action and put it back. That\u0027ll put both engines in again.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-31T13:01:35Z\u0022 title=\u002201/31/2014 01:01  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 31, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-31T13:02:59Z","Content":"\n\u003Cp\u003EOnce I\u0027ve opened up my intakes and my air starts getting down into the questionable zone (around 0.05-0.07 per engine), I start monitoring thrust levels from the engines. When I start noticing uneven thrust, I throttle back a little bit, and I keep this up until I\u0027m down to about 1/3 thrust or I note that I\u0027ve stopped accelerating. Only then do I light the rockets. I still keep the jets going at that point and continue to throttle back - at that point, the important thing is that you continue accelerating. \u003C/p\u003E\u003Cp\u003EThrottling back avoids flame out.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-31T13:22:16Z","Content":"\n\u003Cp\u003EWorking around the symmetry bug seems to have made this a lot easier. It\u0027s working now and I got it into orbit. I still have no idea how to make intakes go to the correct engines so I can\u0027t make high altitude multi-intake setups work, but at least I can get both engines to shut off at once now.\u003C/p\u003E\u003Cp\u003EI still have the annoying problem that planes flip over on their backs in utterly unrealistic ways but that\u0027s a later problem and a seperate topic. (Yes, I know I\u0027m supposed to put the lift a bit behind the center of mass. I build balsa gliders as a hobby. That doesn\u0027t seem to be the cause of the flipping.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-31T13:26:35Z\u0022 title=\u002201/31/2014 01:26  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 31, 2014\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-31T13:25:16Z","Content":"\n\u003Cp\u003EI think \u003Ca href=\u0022http://i.imgur.com/vTqjCQo.png\u0022 rel=\u0022external nofollow\u0022\u003Ethis picture\u003C/a\u003E tells the story. Notice the altitude, pitch, speed, and throttle level. The ship is still accelerating.\u003C/p\u003E\u003Cp\u003EIt\u0027s \u003Ca href=\u0022http://i.imgur.com/ogQ0w9a.jpg\u0022 rel=\u0022external nofollow\u0022\u003Every light ship\u003C/a\u003E, but it can be done with bigger crafts, too. \u003C/p\u003E\u003Cp\u003EFunny thing is, I found it most comfortable to do the piloting from map view. Because when you get to your accelerating altitude, you want to stop ascending or descending and it\u0027s easiest done in map view by keeping the apoapsis (later periapsis) in your close vicinity by adjusting the pitch.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-31T13:31:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EI still have no idea how to make intakes go to the correct engines so I can\u0027t make high altitude multi-intake setups work\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can\u0027t. Intake air is distributed like electricity. The only way to ensure it is going to the correct engine is to have only one engine active.\u003C/p\u003E\u003Cp\u003EBy the way, the same problems are here with ion engines. If you don\u0027t have sufficient electricity supply, ion engines will cease to function one by one, regardless of their placing or symmetry.\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-01-31T13:54:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EWorking around the symmetry bug seems to have made this a lot easier. It\u0027s working now and I got it into orbit. I still have no idea how to make intakes go to the correct engines so I can\u0027t make high altitude multi-intake setups work, but at least I can get both engines to shut off at once now.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIntake air is provided to the engines in order of placement, the engine placed last will be starved first. Even with symmetry the game counts one engine as being placed before the other.\u003C/p\u003E\u003Cp\u003EIf you have an odd number of air breathing engines you can work around the issue by placing the central engine last and taking your throttle cues from it.\u003C/p\u003E\u003Cp\u003EWith an even number of engines, you either need to cut the throttle before this becomes an issue or provide enough control authority to counteract the imbalance. (reaction wheels or a HUGE rudder)\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-31T15:04:52Z","Content":"\n\u003Cp\u003EIs there any way to force a jet engine to change the normal fuel depletion rules such that it tries to take from the backmost fuel tank first? I think my flipping over problem is happening because the front fuel tanks drain first and this moves the center of mass back as the fuel is used. I tried a yellow fuel hose going from the back tank to the front tank to try to replenish from the back to the font but that makes no difference. It always removes fuel from the front first. With a single engine design I can use the mouse to counter this and transfer fuel during flight with the engine on, but with two engines I cause asymmetry by trying to do that since I can only move one side at a time.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2014-01-31T15:27:13Z","Content":"\n\u003Cp\u003ERight click on the tank you want to reserve, then click the green triangles next to the fuel (and oxidizer, if there) bars; that shuts down fuel flow out of that tank. Now that Tweekables are in play, you can do that in the VAB/SPH and have it persist into flight.\u003C/p\u003E\u003Cp\u003EWhen you need the fuel/oxidizer again, right click on the tank and re-enable flow by clicking on the red circle-bars next to the fuel bars.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-31T15:36:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EIs there any way to force a jet engine to change the normal fuel depletion rules such that it tries to take from the backmost fuel tank first? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a lot of options if you understand \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64362-Fuel-Flow-Rules-%280-23%29\u0022 rel=\u0022external nofollow\u0022\u003Ehow fuel distribution works\u003C/a\u003E. But what exactly is needed to do depends on your plane design.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-31T15:39:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Anton P. Nym\u0022 data-cite=\u0022Anton P. Nym\u0022\u003E\u003Cdiv\u003ERight click on the tank you want to reserve, then click the green triangles next to the fuel (and oxidizer, if there) bars; that shuts down fuel flow out of that tank. Now that Tweekables are in play, you can do that in the VAB/SPH and have it persist into flight.\u003Cp\u003EWhen you need the fuel/oxidizer again, right click on the tank and re-enable flow by clicking on the red circle-bars next to the fuel bars.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat does it. Thanks. I\u0027m not very familiar with many of the new 0.23 tweakables.\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2014-01-31T18:15:24Z","Content":"\n\u003Cp\u003EJust want to quickly but in here.\u003C/p\u003E\u003Cp\u003EA great tool that mechjeb has is a \u0022prevent Flameout\u0022 tool. Although i dont use mechjeb much any more I found this to make piloting space planes alot easier as you dont have to worry about your throttle.\u003C/p\u003E\u003Cp\u003EIt also has an intake control option too that opens intakes when you need them.\u003C/p\u003E\u003Cp\u003ESometimes these little tools can make the tedious job of getting an ssto into space that little less troublesome. I find it takes a little bit of the guesswork out...in fact i mightr go redownload mechjeb just for this!\u003C/p\u003E\u003Cp\u003EAnother troublesome thing I find with space planes is sometimes at higher altitudes (and also sometimes at lower altitudes but i find this rare) that if you yaw whilst in flight one intake will suddenly pull your plane left or right and get a bit more air whilst causing another intake to have less thuss causing a flameout and spin.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-31T18:17:37Z\u0022 title=\u002201/31/2014 06:17  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 31, 2014\u003C/time\u003E by vetrox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2014-01-31T18:41:21Z","Content":"\n\u003Cp\u003EEditing symmetrical parts after they have been assigned to action groups breaks the action group assignment and only applies to the root part.\u003C/p\u003E\u003Cp\u003E1) All intakes contribute to the air pool and all engines draw from the pool. If you have an issue where only one engine is running, than you only have enough air to run one engine.\u003C/p\u003E\u003Cp\u003E2) Intake air is a function of velocity as much as anything. you don\u0027t just climb to 20k meters and then run flat out. You level out between 10-15 and let your velocity increase as you slowly climb higher. I have many craft with only 1:1 intake/engine setups which can get above 20k without flaming out, but they are usually travelling 1500m/s before I get that high.\u003C/p\u003E\u003Cp\u003E3) CoM and CoL are both dynamic. what works at takeoff and low altitude may not work all that well at high speed and high altitude. Even mass lost to just fuel burn can throw a craft out of balance.\u003C/p\u003E\u003Cp\u003E4) Remember that control surfaces lose their control authority in the higher/thinner atmosphere. Make sure you have reaction wheels or RCS.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-02-01T01:12:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BubbaWilkins\u0022 data-cite=\u0022BubbaWilkins\u0022\u003E\u003Cdiv\u003EEditing symmetrical parts after they have been assigned to action groups breaks the action group assignment and only applies to the root part.\u003Cp\u003E1) All intakes contribute to the air pool and all engines draw from the pool. If you have an issue where only one engine is running, than you only have enough air to run one engine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is very broken logic because unlike the other parts that use this resource distribution algorithm, jet engines can run partially effectively on partial air. This algorithm only makes sense when a part\u0027s resource requirements follow an all or nothing boolean logic, not when they scale across a gradient. When they scale across a gradient this algorithm guarantees uneven distribution any time the resource supply is between 100% and 0% of what is needed. I\u0027ve found that adding air intakes LOWERS the effective altitude at which I can use jets because of this algorithm. I have to shut them down the moment the air intakes drops to 95% of the needed amount, instead of leaving them on up to about 5-10%.\u003C/p\u003E\u003Cp\u003EI hope the devs don\u0027t classify this behavior as \u0022correct\u0022. I hope they understand it\u0027s a problem.\u003C/p\u003E\n"}]}