{"TopicId":61691,"ForumId":55,"TopicTitle":"Suggestion of mechanic at launch pad","CreatedByName":"John2","CreatedById":102331,"CreatedDateTime":"2014-01-31T13:04:13Z","PageNum":1,"Articles":[{"CreatedByName":"John2","CreatedById":102331,"CreatedDateTime":"2014-01-31T13:04:13Z","Content":"\n\u003Cp\u003EHi, May i suggest that we get rid of the 1 second sudden drop at the launch pad? I\u0027ve tried lots of method and pretty much cover my spaceship with struts \u002B stabilizer enhancer, still, with that sudden drop, the whole thing fall apart. Is there a reason that we \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u0022NEED\u0022\u003C/span\u003E\u003C/strong\u003E that? or is it actually a bug?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Nobody","CreatedById":64303,"CreatedDateTime":"2014-01-31T15:43:53Z","Content":"\n\u003Cp\u003EI am pretty sure the drop your seeing is physics(gravity more specifically) kicking in and it is pretty important to the functioning of the game. When you build a ship in the VAB or SPH physics are not applied to the ship so when you move to the pad it has to get added before launch.\u003C/p\u003E\u003Cp\u003EIf you add screen shots of the ships that fall apart someone might be able to help you find the design flaw causing it.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-01-31T15:45:16Z","Content":"\n\u003Cp\u003EYou can also check the flight log which may help you identify which part is failing. It\u0027s likely to be a decoupler, as they always seem to be bothersome for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlternatively, you may want to check our Kerbal Joint Reinforcement, which is a mod which strengthens up the joints between parts so you can build more realistic-looking rockets (ie: tall and thin, rather than short and wide) more easily.\u003C/p\u003E\n"},{"CreatedByName":"Kermunist","CreatedById":63745,"CreatedDateTime":"2014-01-31T20:21:46Z","Content":"\n\u003Cp\u003EIt is a bit odd to watch. How about:\u003C/p\u003E\u003Cp\u003E0) draw splash screen that obscures everything\u003C/p\u003E\u003Cp\u003E1) set all joints unbreakable\u003C/p\u003E\u003Cp\u003E2) Apply gravity/physics\u003C/p\u003E\u003Cp\u003E3) wait ~1 sec for everything to settle\u003C/p\u003E\u003Cp\u003E4) remove splash screen\u003C/p\u003E\u003Cp\u003E5) set breakable joints\u003C/p\u003E\u003Cp\u003EThat way, the dynamic shock of physics being applied won\u0027t break anything. If the rocket can\u0027t hold itself together under static gravity, it basically falls apart as soon as the player sees it.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-01-31T22:35:12Z","Content":"\n\u003Cp\u003EI\u0027ve suggested this before, and basically got told the same \u0022you aren\u0027t using enough struts\u0022 thing.\u003C/p\u003E\u003Cp\u003EOn the one hand, more struts helps. On the other hand, I bet if you took a real aircraft or rocket and suddenly dropped it onto the concrete in the same way that KSP seems to do, it wouldn\u0027t fair so well.\u003C/p\u003E\u003Cp\u003EI\u0027d certainly like to see some kind of gradual fade-in for gravity at launch, at least for the vehicle in focus. Start at zero G, take one or two seconds to reach standard G, then give the player control. If the rocket still falls apart, \u003Cem\u003Ethen\u003C/em\u003E you can tell me \u0022not enough struts\u0022 and I\u0027ll believe you.\u003C/p\u003E\n"},{"CreatedByName":"spinomonkey","CreatedById":102142,"CreatedDateTime":"2014-02-03T03:36:17Z","Content":"\n\u003Cp\u003EI kinda agree, if I build a spaceplane and the rear end is lower to the ground then the front end, it drops upon being loaded onto the runway. Most of the time the plane can handle it- but I\u0027ve had a few times when the plane actually broke a wing or what not. Now, I agree you can just add a few struts... but it just seems like the simple solution should be- there is no drop upon loading because the gravity itself is already calculated.\u003C/p\u003E\n"},{"CreatedByName":"mikeydz","CreatedById":93894,"CreatedDateTime":"2014-02-03T08:56:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John2\u0022 data-cite=\u0022John2\u0022\u003E\u003Cdiv\u003EHi, May i suggest that we get rid of the 1 second sudden drop at the launch pad? I\u0027ve tried lots of method and pretty much cover my spaceship with struts \u002B stabilizer enhancer, still, with that sudden drop, the whole thing fall apart. Is there a reason that we \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u0022NEED\u0022\u003C/span\u003E\u003C/strong\u003E that? or is it actually a bug?\u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf your rocket is covered in struts (SAS won\u0027t help with your problem, since it\u0027s for helping stabilize your ship when it\u0027s in motion, ie after launch) and still breaks once physics kicks in, may I suggest your problem isn\u0027t lack of struts, but a poorly designed ship.\u003C/p\u003E\u003Cp\u003E1st, are you playing career or sandbox? If sandbox, use the launch support towers to keep your ship from falling onto the launchpad. If you don\u0027t, and your ship is heavy, your engine(s) will blow up when it lands hard, collapsing your entire rocket usually. If playing career, you shouldn\u0027t need to build heavy rockets that will be prone to disassemble for your initial science gathering needs.\u003C/p\u003E\u003Cp\u003E2nd, when asking for help, it\u0027s generally helpful to post a pic of a design you are having a problem with. without a pic, it\u0027s hard to visualize the problem, and have someone offer a potential solution.\u003C/p\u003E\u003Cp\u003E3rd, if you haven\u0027t already, check out youtube tutorial videos. Scott Manley is a good starting point for how-to vids on you tube. Start there.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-02-03T09:26:10Z","Content":"\n\u003Cp\u003EDeadly Reentry has a feature that stabilises physics on jumping to your ship out of timewarp, or on the launch pad.\u003C/p\u003E\u003Cp\u003EOn the other hand, if you don\u0027t like your ships breaking, Deadly Reentry may not be the ideal mod for you!\u003C/p\u003E\n"},{"CreatedByName":"S4qFBxkFFg","CreatedById":83727,"CreatedDateTime":"2014-02-03T10:11:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spinomonkey\u0022 data-cite=\u0022spinomonkey\u0022\u003E\u003Cdiv\u003EI kinda agree, if I build a spaceplane and the rear end is lower to the ground then the front end, it drops upon being loaded onto the runway. Most of the time the plane can handle it- but I\u0027ve had a few times when the plane actually broke a wing or what not. Now, I agree you can just add a few struts... but it just seems like the simple solution should be- there is no drop upon loading because the gravity itself is already calculated.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThing is, if the front/rear gear are at different heights, \u003Cem\u003Esomething\u003C/em\u003E is going to drop or jump no matter where it starts. Have you tried tilting it in the SPH just before launch? Pick it up by the cockpit and Shift\u002BW or Shift\u002BS, then raise/lower it so that the gear are all touching the hangar floor (the suspension should help here).\u003C/p\u003E\u003Cp\u003E[joke]Alternatively, we can just have a crane in the game which literally drops the craft onto the runway from however high it was in the SPH when the player pressed the launch button.[/joke]\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-02-03T16:07:58Z","Content":"\n\u003Cp\u003EErm, build a better ship because if that breaks it, it wouldn\u0027t survive in flight either.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-02-03T16:32:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022coolitic\u0022 data-cite=\u0022coolitic\u0022\u003E\u003Cdiv\u003EErm, build a better ship because if that breaks it, it wouldn\u0027t survive in flight either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow about we grab a Saturn V and drop it from a couple of meters on it\u0027s rocket nozzles? I\u0027m pretty sure it would break way beyond normal repairs, and I don\u0027t think it was a bad design.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-02-03T16:51:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022coolitic\u0022 data-cite=\u0022coolitic\u0022\u003E\u003Cdiv\u003EErm, build a better ship because if that breaks it, it wouldn\u0027t survive in flight either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem isn\u0027t with the design, it\u0027s with the way KSP starts up. You get a step change in force on all components when gravity loads, which stresses them way outside their standard operating parameters.\u003C/p\u003E\n"},{"CreatedByName":"mikeydz","CreatedById":93894,"CreatedDateTime":"2014-02-03T18:08:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EThe problem isn\u0027t with the design, it\u0027s with the way KSP starts up. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, we don\u0027t KNOW that in the case of the OP because we haven\u0027t seen a pic of what he\u0027s trying to launch. Personally, I think he\u0027s trying to launch a relatively large ship without launch clamps. But until he posts a pic of the design, and probably one of the flight summary screen, we can\u0027t know what he OP\u0027s true issue is.\u003C/p\u003E\n"}]}