{"TopicId":61805,"ForumId":55,"TopicTitle":"Reliability rating","CreatedByName":"falconek","CreatedById":28606,"CreatedDateTime":"2014-02-01T10:49:13Z","PageNum":1,"Articles":[{"CreatedByName":"falconek","CreatedById":28606,"CreatedDateTime":"2014-02-01T10:49:13Z","Content":"\n\u003Cp\u003EIn real life one of the biggest problems in space missions is malfunctioning equipment. Virtually every mission has bigger or smaller technical problems, and it\u0027s no wonder, considering what extreme conditions this equipment needs to survive.\u003C/p\u003E\u003Cp\u003EHow about you copy a nice idea from Buzz Aldrin Race Into Space, and add reliability rating to every part. This rating could be improved by research on certain parts and by using them more (for instance if you have several succesful launches with LV-T30, the next batch of LV-T30 will be more reliable). \u003C/p\u003E\u003Cp\u003EThen you can add different types of malfunctions with different effects (premature ignition of a stage, engine didn\u0027t fire, leak of propellant... and many more, including malfunctions or science and communication equipment). Some of these would be fatal, and some would let you recover and continue mission with limited scope (like you won\u0027t have enough dv to reach that planet AND it\u0027s moon, but you can still reach the planet). \u003C/p\u003E\u003Cp\u003EOf course this feature could be optional, and adjusted in game options even to the point of competely turning it off. Similar features can be seen in flight sims, like Lock-On, where you can even set probability of colliding with a bird.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-02-01T11:32:38Z","Content":"\n\u003Cp\u003ESo basically you\u0027re suggesting random failures?\u003C/p\u003E\u003Cp\u003ESQUAD has repeatedly stated it does not want and random events in KSP. Perhaps that\u0027s why it\u0027s on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003EWhat not to suggest\u003C/a\u003E list.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-02-01T11:38:12Z","Content":"\n\u003Cp\u003Eits not a random failure if you launch a space mission with an untested part! it failed because you launched with an untested part. therefore its not random at all. of course once jeb has destroyed it a couple times (and earned some science in the process), it becomes reliable. this would actually be a good way to reward conducting test flights with science. this is up there with levelable parts and trl modeling.\u003C/p\u003E\u003Cp\u003Ei see \u0022random failures\u0022 being the game engine decided to throw a monkey wrench into your mission because of a dice roll. but im all for failures caused by stupidity. so you might unlock a part and it would have the same rating except maybe it overheats, or it is too weak structurally, or the power requirements are ludicrous, or the efficiency is not there. all this stuff would be in the parts information tab, so you can see that something is not right with it. you might build an unmanned test flight (or have a really good abort system) and test the parts. science would be rewarded each time you identify a problem with a part (this would require you fly, have the part fail, and recover it), also the part will be improved. this is part of running a real space program and would be a welcome addition to the game in my book.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-01T11:52:03Z\u0022 title=\u002202/01/2014 11:52  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 1, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-02-01T11:52:12Z","Content":"\n\u003Cp\u003Eit is random, unless you are suggesting that all launches using a part that\u0027s not been used in x previously successful launches fail.\u003C/p\u003E\u003Cp\u003EWhich of course means all launches always fail as there\u0027d never be a successful launch...\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-02-01T12:06:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eit is random, unless you are suggesting that all launches using a part that\u0027s not been used in x previously successful launches fail.\u003Cp\u003EWhich of course means all launches always fail as there\u0027d never be a successful launch...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly.\u003C/p\u003E\u003Cp\u003EIf a part may or may not fail at any indeterminate point it is random. That\u0027s what random means.\u003C/p\u003E\u003Cp\u003EIf you would suggest new untested parts could fail similarly to engines overheating or parts breaking due to excessive stress I am all for it. Those kinds of failures are predictable and can be avoided, either by a better design or by piloting. Parts blowing up for no apparent reason would add nothing to the game and would only cause a flood complains on the forum.\u003C/p\u003E\n"},{"CreatedByName":"crazyewok","CreatedById":97592,"CreatedDateTime":"2014-02-01T13:50:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003ESo basically you\u0027re suggesting random failures?\u003Cp\u003ESQUAD has repeatedly stated it does not want and random events in KSP. Perhaps that\u0027s why it\u0027s on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003EWhat not to suggest\u003C/a\u003E list.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell they should make it moddable then so those of us who DO want a challenge can have it.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-02-01T14:43:43Z","Content":"\n\u003Cp\u003EI like my failures being caused solely by me failing to engineer the craft successfully. Not caused by some random dice roll due to no fault of mine!\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-02-01T15:23:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022crazyewok\u0022 data-cite=\u0022crazyewok\u0022\u003E\u003Cdiv\u003EWell they should make it moddable then so those of us who DO want a challenge can have it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s incorrect to use the term \u0022challenge\u0022 to refer to a failure you have no control over and isn\u0027t your fault when it happens. The main reason random reliability failures for parts is a bad idea in KSP is because the design and manufacture of those parts is entirely out of the player\u0027s hands. UNLIKE in a real space program. If the manufacturing process is creating parts that fail, there are people who\u0027s job it is to fix that. In the real world if a manufactured part fails, there are human beings ultimately responsible somewhere in the chain. In KSP that is not true.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2014-02-01T15:29:42Z","Content":"\n\u003Cp\u003EWait, so every time you use a part that hasn\u0027t been \u0022tested before\u0022 will fail? That\u0027s not an incentive to use it in flight. And once it has been tested it will never fail?\u003C/p\u003E\u003Cp\u003EWhat\u0027s to stop me from \u0022testing\u0022 my parts on the launch pad?\u003C/p\u003E\n"},{"CreatedByName":"crazyewok","CreatedById":97592,"CreatedDateTime":"2014-02-01T17:08:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhat\u0027s to stop me from \u0022testing\u0022 my parts on the launch pad?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me think? Hmmmm CAUSE THATS WHAT THEY DO! If you notice they do test parts on the ground and on unmanned craft before sticking a brand new part on a manned craft.\u003C/p\u003E\n"},{"CreatedByName":"falconek","CreatedById":28606,"CreatedDateTime":"2014-02-01T17:14:52Z","Content":"\n\u003Cp\u003EAs I see it, it forces you to engineer simpler and more redundnat solutions. If you take into account, that a part may fail, you may want to consider backup systems, or emergency scenarios. Also, there is risk magement involved. You can run short, easy missions, untill certain part will reach decent level of reliability.\u003C/p\u003E\n"},{"CreatedByName":"Nobody","CreatedById":64303,"CreatedDateTime":"2014-02-01T17:29:17Z","Content":"\n\u003Cp\u003EI am against the random dice rolls to see if a part fails. A mod for that might work for those who want things to go boom for no reason.\u003C/p\u003E\u003Cp\u003EFailure due to environmental conditions I could live with for example, having a planet with much higher atmospheric pressure than Kerbin could crush a mk1 lander can(description says it wouldn\u0027t do well in atmo) like a sub going to deep in the ocean. That wouldn\u0027t be a case of random failure but going beyond the designed operating conditions and encourage the use of probes to test the waters.\u003C/p\u003E\n"},{"CreatedByName":"Z-Man","CreatedById":96549,"CreatedDateTime":"2014-02-01T17:34:41Z","Content":"\n\u003Cp\u003ESo, how would \u0022testing\u0022 a new part be fun gameplay?\u003C/p\u003E\n"},{"CreatedByName":"minerman30","CreatedById":63054,"CreatedDateTime":"2014-02-01T17:44:04Z","Content":"\n\u003Cp\u003EI have two ideas that could make random failures more realistic to implement.\u003C/p\u003E\u003Cp\u003EFirst, the kind of mission-ruining failures that people are afraid of would be extremely rare. I\u0027m thinking on the order of 0.1%-0.01% chance of failure for things like engines and fuel tanks.\u003C/p\u003E\u003Cp\u003ESecond, there would be more minor failures that could be repaired by kerbals, such as solar panels (things like the rotation function getting jammed) and reaction wheels. This would mean that a well-designed ship should be able to complete a mission even if parts break down, and it would make manned missions more reliable.\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2014-02-01T18:21:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022minerman30\u0022 data-cite=\u0022minerman30\u0022\u003E\u003Cdiv\u003EFirst, the kind of mission-ruining failures that people are afraid of would be extremely rare. I\u0027m thinking on the order of 0.1%-0.01% chance of failure for things like engines and fuel tanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust because a catastrophic failure is rare doesn\u0027t make it any more fun. Plus, from a game design perspective there\u0027s a point when you want to make something so rare that you have to wonder if it\u0027s worth adding to the game at all.\u003C/p\u003E\u003Cp\u003EThese random failure threads (besides being on the \u0022do not suggest\u0022 list) are the polar opposite of the \u0022simulator\u0022 threads \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66371-Simulator\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/66371-Simulator\u003C/a\u003E. The folks who want a simulator function are frustrated that they spend so much time flying a mission to Moho only to learn their lander doesn\u0027t have enough TWR... Adding bigger engines to your lander will be the least of your problems if your fuel tank randomly fails and starts leaking oxidizer.\u003C/p\u003E\n"},{"CreatedByName":"minerman30","CreatedById":63054,"CreatedDateTime":"2014-02-01T18:24:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nholzric\u0022 data-cite=\u0022nholzric\u0022\u003E\u003Cdiv\u003EJust because a catastrophic failure is rare doesn\u0027t make it any more fun. Plus, from a game design perspective there\u0027s a point when you want to make something so rare that you have to wonder if it\u0027s worth adding to the game at all.\u003Cp\u003EThese random failure threads (besides being on the \u0022do not suggest\u0022 list) are the polar opposite of the \u0022simulator\u0022 threads \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66371-Simulator\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/66371-Simulator\u003C/a\u003E. The folks who want a simulator function are frustrated that they spend so much time flying a mission to Moho only to learn their lander doesn\u0027t have enough TWR... Adding bigger engines to your lander will be the least of your problems if your fuel tank randomly fails and starts leaking oxidizer.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see. So maybe we only have the minor repairable failures.\u003C/p\u003E\n"},{"CreatedByName":"MajorThomas","CreatedById":94499,"CreatedDateTime":"2014-02-01T18:49:43Z","Content":"\n\u003Cp\u003EI\u0027m with Nuke, let new parts have a \u0022testing\u0022 phase during which they have a failure rate. Say, initially 10-20%. But after a few missions where the part did not fail, the failure rate drops to zero. And you are told the expected reliability of the part, and how many successful flights it\u0027s had, before you use it in the VAB.\u003C/p\u003E\u003Cp\u003EAnd, for those who don\u0027t want to deal with part failures (design and piloting failures already being present) have the option to make all parts 100% reliable. But for advanced users, part testing and reliability would be FUN!\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-02-01T18:51:42Z","Content":"\n\u003Cp\u003ESome people have come up with some interesting idea\u0027s. I especially like what Nobody said a few posts ago: Failures due to exceeding environmental tolerances. Those kinds of failures are predictable, consistent and avoidable.\u003C/p\u003E\u003Cp\u003EI also partially liked what minerman30 suggested: Part failure that can be repaired. The part I didn\u0027t like in this is the random factor. If that randomness would be changed by degradation over time it again becomes consistent and predictable. Once the part wears out it fails, not before.\u003C/p\u003E\u003Cp\u003EAll this got me thinking and then I remembered the recent \u0022Expanding the Kerbal\u0022 suggestion: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67315-Expanding-the-Kerbal\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/67315-Expanding-the-Kerbal\u003C/a\u003E. It talks about different Kerbal jobs; pilot, scientist and of course engineer. See where I am going with this yet? Repairing degraded parts could be an ideal job for the engineer. Regular Kerbals should of course also be able to make repairs. Engineers should be able to repair to the full 100% or perhaps even past that.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-01T19:02:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022falconek\u0022 data-cite=\u0022falconek\u0022\u003E\u003Cdiv\u003EIn real life one of the biggest problems in space missions is malfunctioning equipment.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think KSP lacks this kind of challenge. Launch clamps failing to hold their load, shake on deploying a rocket on launchpad, ships getting destroyed on revert, aircraft being dropped on runway from height... There\u0027s plenty of failures involved already. I don\u0027t think any more should be added.\u003C/p\u003E\n"},{"CreatedByName":"xrayfishx","CreatedById":76147,"CreatedDateTime":"2014-02-01T20:30:23Z","Content":"\n\u003Cp\u003EIf random failures were to be added to the game, I\u0027d see it be something like this:\u003C/p\u003E\u003Cp\u003EFirst time you use of a part there\u0027s a 20% chance of failure each second. Each time you use that part, the chance becomes 5 times smaller. So the second use would have a 4% chance of failure each second, then 0.8 etc etc. Eventually the chance would become so small it doesn\u0027t really matter. Also, a failure wouldn\u0027t mean that the part blows up or sth. What I mean is that nearly all failures would be something you can deal with, for example an engine only being able to put out 70% of rated thrust, or a solar panel not folding up completely. And there should be difficulty settings so you can turn off failures you can\u0027t deal with, such as an SRB exploding or an engine turning off. Or turn off all failures, for that matter. Everyone would be happy this way. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EI don\u0027t think KSP lacks this kind of challenge. Launch clamps failing to hold their load, shake on deploying a rocket on launchpad, ships getting destroyed on revert, aircraft being dropped on runway from height... There\u0027s plenty of failures involved already. I don\u0027t think any more should be added.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is different kind of failures, and they always happen right after/before the craft finishes loading and usually end up with reverting, fixing and redoing. They are glitches, real life doesn\u0027t have glitches.\u003C/p\u003E\u003Cp\u003EBack on topic, though (because Tex_NL\u0027s signature perfectly describes this thread), I don\u0027t think that in the beginning a part should fail every time, or that not recovering the malfunctioning part should be necessary. Firstly, even if the part does not fail, the post-flight inspection would reveal what _almost_ went wrong and if the part isn\u0027t recovered, then since the failure is most likely in atmosphere, at least in the beginning, then the engine blowing to bits leaves behind the bits that can, again, be inspected (that, btw, is how aircraft crashes are investigated).\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-02-02T13:08:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nholzric\u0022 data-cite=\u0022nholzric\u0022\u003E\u003Cdiv\u003EJust because a catastrophic failure is rare doesn\u0027t make it any more fun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn fact making them rare makes them LESS fun. Because it then becomes unreasonable to expect players to have experience with it, so that when it does happen players feel as if the game betrayed them unfairly. \u003C/p\u003E\u003Cp\u003EAlso, think of the tech support nightmare. The game *already* has a few bugs that cause things that should never happen to happen, like space stations exploding the moment you load them from the tracking center because collision detection \u0022turns on\u0022 before all the variables got fully populated yet. Now imagine the flood of people reporting \u0022my rocket blew up for no reason\u0022 as a bug, and then tech support having to try to sift through which of the complaints are intentionally unreliable behavior and which are bugs? Deliberately creating random failures would mask the behavior of real bugs.\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-02-02T21:38:47Z","Content":"\n\u003Cp\u003ERandom failures will never be implemented.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-02-02T22:27:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Z-Man\u0022 data-cite=\u0022Z-Man\u0022\u003E\u003Cdiv\u003ESo, how would \u0022testing\u0022 a new part be fun gameplay?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehow many test pilots hate their job?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-02-02T22:58:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MajorThomas\u0022 data-cite=\u0022MajorThomas\u0022\u003E\u003Cdiv\u003EI\u0027m with Nuke, let new parts have a \u0022testing\u0022 phase during which they have a failure rate. Say, initially 10-20%. But after a few missions where the part did not fail, the failure rate drops to zero. And you are told the expected reliability of the part, and how many successful flights it\u0027s had, before you use it in the VAB.\u003Cp\u003EAnd, for those who don\u0027t want to deal with part failures (design and piloting failures already being present) have the option to make all parts 100% reliable. But for advanced users, part testing and reliability would be FUN!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei need to reiterate that im not talking about having random failures. im talking more about having newly unlocked parts in a weakened, unrefined state. you might even have a little gauge or even a bit of comical text to discrive the state of a part. say you get a new engine. this engine might have twice the heat production and half the structural integrity of the refined version. the part info window will display the strength and heat ratings. you may have a trl gauge to indicate level of refinement. you might also have some engineer\u0027s notes. first time you fly it:\u003C/p\u003E\u003Cp\u003E\u0022brand new part with brand new bugs!\u0022\u003C/p\u003E\u003Cp\u003Eupon having an overheat (and returning data):\u003C/p\u003E\u003Cp\u003E\u0022we fixed the overheating problem, but it still looks a little weak\u0022\u003C/p\u003E\u003Cp\u003Eoverheat problem fixed!\u003C/p\u003E\u003Cp\u003E\u002B50 science!\u003C/p\u003E\u003Cp\u003Eupon having a structural failure (and returning data):\u003C/p\u003E\u003Cp\u003E\u0022this part is as good as it can be\u0022\u003C/p\u003E\u003Cp\u003Estructural problem fixed!\u003C/p\u003E\u003Cp\u003E\u002B50 science!\u003C/p\u003E\u003Cp\u003Eat this point the part is reliable. \u003C/p\u003E\u003Cp\u003Eevery part would have 2 or 3 \u0022bugs\u0022 which you can \u0022fix\u0022 for science and a better part. the engineer notes will provide hints about what the problems the part may be. a smart player would conduct test flights to exploit these problems for science. it also makes abort procedures important so that data can be returned to the engineers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-03T02:07:04Z\u0022 title=\u002202/03/2014 02:07  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 3, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"}]}