{"TopicId":62032,"ForumId":16,"TopicTitle":"Hohmann vs Ballistic","CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-02-03T09:38:05Z","PageNum":1,"Articles":[{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-02-03T09:38:05Z","Content":"\n\u003Cp\u003EThis is more of a curiosity...\u003C/p\u003E\u003Cp\u003EWhat\u0027s a better option for interplanetary orbital transfers? Ballistic, or Hohmann? Is it better to wait for a window and send your ship on a ballistic course, or to say \u0022meh\u0022 and launch anytime, performing a solar Hohmann transfer when it is ideal.\u003C/p\u003E\u003Cp\u003EHere\u0027s my thinking:\u003C/p\u003E\u003Cp\u003EHohmann transfer:\u003C/p\u003E\u003Cp\u003E- don\u0027t have to wait for a window\u003C/p\u003E\u003Cp\u003E- \u0022easier\u0022 to match inclination\u003C/p\u003E\u003Cp\u003E- total flight time longer\u003C/p\u003E\u003Cp\u003E- potentially less course corrections?\u003C/p\u003E\u003Cp\u003EBallistic:\u003C/p\u003E\u003Cp\u003E- Need a transfer window\u003C/p\u003E\u003Cp\u003E- all inclination changes can be performed at the initial burn\u003C/p\u003E\u003Cp\u003E- \u0022fire and forget\u0022 method.\u003C/p\u003E\u003Cp\u003EMainly what I\u0027m wondering is if there is any Delta-V savings at all with either method (Oberth, maybe?), and which would take more time. I suspect the Hohmann transfer would be more temporally expensive as you\u0027d have to orbit the sun at least once to get an encounter... but then, you\u0027d have to wait for a window anyway if you waited in LKO for a ballistic trajectory.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-03T10:20:59Z","Content":"\n\u003Cp\u003EHohmann transfer is a method to change your orbital paramteres. It does not guarantee you rendezvous with anything but it can be phased so you rendezvous in several orbits.\u003C/p\u003E\u003Cp\u003EBallistic transfer is a method to rendezvous with another object on a different orbit. It usually costs more dv but guarantees you rendezvous within single orbit time.\u003C/p\u003E\u003Cp\u003ERendezvous using Hohmann transfer - if done right - costs less dv but takes more time than Ballistic.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-03T10:26:23Z\u0022 title=\u002202/03/2014 10:26  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 3, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-02-03T10:27:24Z","Content":"\n\u003Cp\u003EThe idea is the same.\u003C/p\u003E\u003Cp\u003EBallistic is the \u0022straight\u0022 path to your target planet.\u003C/p\u003E\u003Cp\u003EThe other option would be to escape to solar orbit first, then perform a Hohmann transfer to your target\u0027s orbit.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-02-03T12:34:44Z","Content":"\n\u003Cp\u003EHoffman transfer from low Kerbal orbit directly to an intercept is the most efficient of all. Finding that transfer window is the most difficult part for planning that maneuver.\u003C/p\u003E\u003Cp\u003ELacking the mods to calculate that move, one can place a probe into solar orbit and using the Add Maneuver Mode, find the intercept window. Then, when that window arrives, take advantage of that window to launch your manned flights to those locations.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-03T12:58:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zeppelinmage\u0022 data-cite=\u0022zeppelinmage\u0022\u003E\u003Cdiv\u003EThe idea is the same.\u003Cp\u003EBallistic is the \u0022straight\u0022 path to your target planet.\u003C/p\u003E\u003Cp\u003EThe other option would be to escape to solar orbit first, then perform a Hohmann transfer to your target\u0027s orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn general, ballistic transfer is every transfer where you apply impulses only at certain points and spend most time of the transfer coasting. \u003C/p\u003E\u003Cp\u003ETransfer which is not considered ballistic is transfer where impulse is applied over considerable time. These transfers are used e.g. for ion probes.\u003C/p\u003E\u003Cp\u003EMeaning, every Hohmann transfer is ballistic. Not every ballistic transfer is Hohmann transfer, though.\u003C/p\u003E\u003Cp\u003EExample of ballistic transfer which is not Hohmann transfer:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Orbital_General_Transfer.svg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/File:Orbital_General_Transfer.svg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI think you\u0027re getting confused by terminology used in Alexmoon\u0027s calculator. In fact, all it calculates are ballistic transfers, the only difference is number of impulses applied - two or three.\u003C/p\u003E\u003Cp\u003EHohmann transfer is special case of ballistic transfer where two impulses are applied and both are in direction parallel to current orbital velocity. From this point of view (with some generalisation), all \u0022ballistic\u0022 transfers provided by Alexmoon\u0027s calculator are Hohmann transfers.\u003C/p\u003E\u003Cp\u003E_______________________________________\u003C/p\u003E\u003Cp\u003ENow with terminology out of the way, what I would consider \u0022Hohmann\u0022 interplanetary transfer would be achieving escape orbit which touches the target orbit in single point, then adjusting orbital period at that point to achieve rendezvous with the target at that point some next orbit. Meaning nothing prevents you doing the initial burn in your intial body\u0027s vicinity, and your final braking burn in your destination body\u0027s vicinity, using Oberth effect to your advantage. These transfers take usually considerably more time than transfers calculated by Alexmoon\u0027s calculator, and when done correctly, may cost considerably less dv.\u003C/p\u003E\u003Cp\u003EAlexmoon\u0027s calculator calculates values for transfer for any time. The \u0022window\u0022 is the time when the transfer can be performed for minimal (within certain period) value of dv. The \u0022hohmann\u0022 transfer described above has similar windows, there are places where the transfer costs less dv and places where the same transfer costs more dv. For instance when doing Hohmann transfer to Moho, starting opposite to Moho\u0027s periapsis will cost you way less dv than starting at the opposite point.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-03T13:08:59Z\u0022 title=\u002202/03/2014 01:08  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 3, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-02-03T13:18:08Z","Content":"\n\u003Cp\u003EOkay, forget the terminology. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I\u0027m just trying to compare methods of reaching a target destination. I just wanted a label that made sense for each. Since you could technically apply \u0022Hohmann\u0022 and \u0022Ballistic\u0022 to both.\u003C/p\u003E\u003Cp\u003EAt any rate, this is what I\u0027m trying to find out. I just loaded up a \u0022test\u0022 flight to Jool, with maneuver nodes.\u003C/p\u003E\u003Cp\u003E\u0022Ballistic\u0022:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/V7yGRXK.png\u0022 alt=\u0022V7yGRXK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDelta-V: 2086.1 m/s\u003C/p\u003E\u003Cp\u003EFlight time: 272 days\u003C/p\u003E\u003Cp\u003EWait time: 100 days\u003C/p\u003E\u003Cp\u003E\u0022Hohmann\u0022:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cib0sDs.png\u0022 alt=\u0022cib0sDs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETotal Delta-V: 4050.7\u003C/p\u003E\u003Cp\u003EFlight time: 369 days\u003C/p\u003E\u003Cp\u003EWait time: 0 days\u003C/p\u003E\u003Cp\u003E(Three maneuvers: 1: exit Kerbin SOI, 2: inclination change, 3: Jool encounter.)\u003C/p\u003E\u003Cp\u003E* Both flights leave Kerbin in the same direction - prograde into Kerbin\u0027s orbital path.\u003C/p\u003E\u003Cp\u003E* I computed the \u0022ballistic\u0022 path first, so technically the \u0022100 days\u0022 occurred before launch of the \u0022Hohmann\u0022 option. But that shouldn\u0027t affect the final comparison, IMO.\u003C/p\u003E\u003Cp\u003ENow I acknowledge my KSP skills are less than ideal, and these are likely pretty gross estimations. But for this particular flight, it costs nearly twice the delta-V to save three days. My question is... is this true in all cases?\u003C/p\u003E\u003Cp\u003EAlso, the \u0022Hohmann\u0022 option could concievably include gravitational slingshots. The cost to exit Kerbin SOI was 1244 m/s. Would it save anything to launch \u0022right away\u0022, perform slingshots over those \u0022extra\u0022 100 days, and arrive in Jool spending only 1200 m/s?\u003C/p\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-02-03T13:22:45Z","Content":"\n\u003Cp\u003EJust noticed your edit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003ENow with terminology out of the way, what I would consider \u0022Hohmann\u0022 interplanetary transfer would be achieving escape orbit which touches the target orbit in single point, then adjusting orbital period at that point to achieve rendezvous with the target at that point some next orbit. Meaning nothing prevents you doing the initial burn in your intial body\u0027s vicinity, and your final braking burn in your destination body\u0027s vicinity, using Oberth effect to your advantage. These transfers take usually considerably more time than transfers calculated by Alexmoon\u0027s calculator, and when done correctly, may cost considerably less dv.\u003Cp\u003EAlexmoon\u0027s calculator calculates values for transfer for any time. The \u0022window\u0022 is the time when the transfer can be performed for minimal (within certain period) value of dv. The \u0022hohmann\u0022 transfer described above has similar windows, there are places where the transfer costs less dv and places where the same transfer costs more dv. For instance when doing Hohmann transfer to Moho, starting opposite to Moho\u0027s periapsis will cost you way less dv than starting at the opposite point.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m actually not using that calculator. Rather Kerbal Alarm Clock for transfer windows. I\u0027m just comparing options, which would be better in terms of \u0022flight time\u0022 vs \u0022delta-v\u0022. Also, your first option would be more akin to a bi-elliptic transfer, would it not? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-03T13:47:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zeppelinmage\u0022 data-cite=\u0022zeppelinmage\u0022\u003E\u003Cdiv\u003EAlso, your first option would be more akin to a bi-elliptic transfer, would it not? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDefinitely not, bi-elliptic transfer consists of three impulses, first of which is rising the apoapsis to very high value.\u003C/p\u003E\u003Cp\u003EExample of bi-elliptic transfer:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Bi-elliptic_transfer.svg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/File:Bi-elliptic_transfer.svg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(not a very good example, bi-elliptic transfer can only save dv when there is great difference between initial and destination orbit radius)\u003C/p\u003E\u003Cp\u003EIn my approach the trajectory is always between the two orbits.\u003C/p\u003E\n"},{"CreatedByName":"Jasmir","CreatedById":76744,"CreatedDateTime":"2014-02-03T14:27:49Z","Content":"\n\u003Cp\u003EHi Zeppelinmage,\u003C/p\u003E\u003Cp\u003Ea \u003Cem\u003EHohmann-Transfer\u003C/em\u003E is a well-definined thing to alter orbits (not planes!) with low energy use. See here: \u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Hohmann_transfer_orbit.svg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/File:Hohmann_transfer_orbit.svg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you want to rendevouz with a object a other orbit, you can archive it with a \u003Cem\u003Etimed Hohmann-Transfer\u003C/em\u003E. It still has a low energy use, but you has to wait for a transfer-window.\u003C/p\u003E\u003Cp\u003EThe picture \u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Orbital_General_Transfer.svg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/File:Orbital_General_Transfer.svg\u003C/a\u003E instead shows a random -high energy- target interception. For this, you don\u0027t have do wait for a transfer-window, but you will waste a lot of fuel. Don\u0027t do that.\u003C/p\u003E\u003Cp\u003EIf you needes to change your plane, things get complicated. In general, you want to do this on a point where your speed is \u003Cem\u003Elowest\u003C/em\u003E. That means -if you go to jool- do the planechange at the apoapsis of you transferorbit, during your injection-burn in the targetorbit. Or if you go to moho, do it on your ejectionburn on your kerbin-departure. The problem is, to find a transferwindow that allows that. To make it easyer, most missions do a midway-coursecorrection.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-02-03T20:11:25Z","Content":"\n\u003Cp\u003EI just wait for launch windows. It makes ship requirements much less demanding.\u003C/p\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-02-03T22:52:22Z","Content":"\n\u003Cp\u003EI know the basics; my interplanetary flights have all been \u0022direct\u0022 flights at transfer windows with mid-course corrections. Akin to my \u0022Ballistic\u0022 picture above.\u003C/p\u003E\u003Cp\u003EI\u0027m wondering if there\u0027s any reason to use a different method; the \u0022Hohmann\u0022 picture above. In my example, I spent twice the DV to save three days\u0027 flight time via solar orbit. Again, I admit I am less than skilled in optimizing flights, and my numbers may not be 100% representative.\u003C/p\u003E\u003Cp\u003EI understand all maneuvers should be performed at ideal speed locations (periapsis/apoapsis); but if your orbit is largely circular, wouldn\u0027t that difference would be negligible? (all my orbits above are close to circular.) Interestingly, the \u0022Ballistic\u0022 option makes all necessary maneuvers at once (acceleration and inclination change) for a direct injection into the target SOI, and costs far less. Doing straight prograde accelerations with a separate normal/anti-normal inclination change via solar orbit costs twice as much.\u003C/p\u003E\u003Cp\u003EWhere does that extra DV come from? Is it simply due to changing frame of reference (SOI)? Wouldn\u0027t my vessel\u0027s velocity relative to the sun be the same, regardless of what SOI I\u0027m in? Therefore, the required delta-v should be the same?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-03T23:24:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zeppelinmage\u0022 data-cite=\u0022zeppelinmage\u0022\u003E\u003Cdiv\u003EDoing straight prograde accelerations with a separate normal/anti-normal inclination change via solar orbit costs twice as much.\u003Cp\u003EWhere does that extra DV come from?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn a triangle, one side is always shorter than the sum of the two others. That\u0027s also the reason why doing multiple orbital maneuvers in a single burn usually costs less dv than doing them separately.\u003C/p\u003E\u003Cp\u003EAlso, burning in a vicinity of a large body (most importantly Kerbin, Eve, Jool, but it applies to all bodies in the system, just at different rates) is adding more kinetic energy to your orbit than burning in interplanetary space (unless you\u0027re close to Sun). This is called Oberth effect.\u003C/p\u003E\u003Cp\u003EHowever, many maneuvers cost different dv based on where in the orbit you perform them. If you clump maneuvers together, you\u0027re very likely making some of them in less-than-optimal place and that lowers the saving. That\u0027s also why in Alexmoon\u0027s calculator, the plane-change trajectory is sometimes more efficient than ballistic. Because otherwise the \u0022ballistic\u0022 transfer has the plane-align maneuver distributed among the two remaining burns, ejection and injection, and thanks to principles above the sum is lower than doing them separately and in their optimal location.\u003C/p\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-02-03T23:46:36Z","Content":"\n\u003Cp\u003Ea\u003Csup\u003E2\u003C/sup\u003E\u002Bb\u003Csup\u003E2\u003C/sup\u003E=c\u003Csup\u003E2\u003C/sup\u003E.\u003C/p\u003E\u003Cp\u003EI didn\u0027t think Oberth would make a 2000 m/s difference... and the trig wouldn\u0027t \u003Cem\u003Edouble\u003C/em\u003E the cost either.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-02-03T23:59:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zeppelinmage\u0022 data-cite=\u0022zeppelinmage\u0022\u003E\u003Cdiv\u003Ea\u003Csup\u003E2\u003C/sup\u003E\u002Bb\u003Csup\u003E2\u003C/sup\u003E=c\u003Csup\u003E2\u003C/sup\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eremember the Pythagorean theorem is only for right triangles. What Kashua is talking about when he says the sum of two sides of a triangle exceed the length of third is a separate theorem is true regardless of the angle between the sides. You can see it, though, in the Pythagorean though, because if a\u003Csup\u003E2\u003C/sup\u003E\u002Bb\u003Csup\u003E2\u003C/sup\u003E=c\u003Csup\u003E2\u003C/sup\u003E, then a \u002B b \u0026gt; c.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zeppelinmage\u0022 data-cite=\u0022zeppelinmage\u0022\u003E\u003Cdiv\u003EI didn\u0027t think Oberth would make a 2000 m/s difference... and the trig wouldn\u0027t \u003Cem\u003Edouble\u003C/em\u003E the cost either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe Oberth effect can have a massive effect on the amount of fuel that is used to change orbits. The way this makes sense in my head is that, when a vessel is trying to take advantage of the Oberth effect, it\u0027s burning when it\u0027s close to a planetary body when the proportion of it\u0027s orbital energy is kinetic energy. So when you burn \u0022x\u0022 amount of dV, you\u0027re getting x\u003Csup\u003E2\u003C/sup\u003E more kinetic energy out of it (from KE = 1/2mV\u003Csup\u003E2\u003C/sup\u003E). It\u0027s been my experience that Oberth leads to huge savings in dV when used properly, dropping dV requirements by more than half. I forget the exact math, but I want to say I\u0027ve used Oberth to reduce some interplanetary dV costs to 1/3 or 1/4 the costs of just using direct transfers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-04T00:04:28Z\u0022 title=\u002202/04/2014 12:04  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 4, 2014\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-02-04T00:19:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003Eremember the Pythagorean theorem is only for right triangles. What Kashua is talking about when he says the sum of two sides of a triangle exceed the length of third is a separate theorem is true regardless of the angle between the sides. You can see it, though, in the Pythagorean though, because if a\u003Csup\u003E2\u003C/sup\u003E\u002Bb\u003Csup\u003E2\u003C/sup\u003E=c\u003Csup\u003E2\u003C/sup\u003E, then a \u002B b \u0026gt; c.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI focused on Pythagoras since prograde vs normal is a right angle. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ethe Oberth effect can have a massive effect on the amount of fuel that is used to change orbits. The way this makes sense in my head is that, when a vessel is trying to take advantage of the Oberth effect, it\u0027s burning when it\u0027s close to a planetary body when the proportion of it\u0027s orbital energy is kinetic energy. So when you burn \u0022x\u0022 amount of dV, you\u0027re getting x\u003Csup\u003E2\u003C/sup\u003E more kinetic energy out of it (from KE = 1/2mV\u003Csup\u003E2\u003C/sup\u003E). It\u0027s been my experience that Oberth leads to huge savings in dV when used properly, dropping dV requirements by more than half. I forget the exact math, but I want to say I\u0027ve used Oberth to reduce some interplanetary dV costs to 1/3 or 1/4 the costs of just using direct transfers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKE = 1/2mV\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003EThat makes much more sense. And reading the wiki...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wikipedia\u0022 data-cite=\u0022wikipedia\u0022\u003E\u003Cdiv\u003EHowever, integrating this is often unnecessary if the burn duration is short. For example as a vehicle falls towards periapsis in any orbit (closed or escape orbits) the velocity relative to the central body increases. Briefly burning the engine (an \u0022impulsive burn\u0022) prograde at periapsis increases the velocity by the same increment as at any other time (\u003Cimg src=\u0022https://upload.wikimedia.org/math/5/a/e/5aef16cbecb887c48ad84c1fd89002a8.png\u0022 alt=\u00225aef16cbecb887c48ad84c1fd89002a8.png\u0022\u003E\u003Cspan style=\u0022font-family:sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E). However, since the vehicle\u0027s kinetic energy is related to the \u003C/span\u003E\u003C/span\u003E\u003Cem\u003Esquare \u003C/em\u003E\u003Cspan style=\u0022font-family:sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003Eof its velocity, this increase in velocity has a disproportionate effect on the vehicle\u0027s kinetic energy; leaving it with higher energy than if the burn were achieved at any other time.\u003C/span\u003E\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Csup\u003ESo Oberth \u003C/sup\u003E\u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Csup\u003Ecan\u003C/sup\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Csup\u003E basically halve the delta-v requirement relative to not having a body present at all. Which explains the above, and the fact it is \u003C/sup\u003E\u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Csup\u003Ealways\u003C/sup\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Csup\u003E advantageous to perform as many burns as possible as close to your parent body as possible. \u003C/sup\u003E\u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}