{"TopicId":62226,"ForumId":55,"TopicTitle":"Career Mode Motive","CreatedByName":"Strikerklm96","CreatedById":102539,"CreatedDateTime":"2014-02-05T05:51:03Z","PageNum":1,"Articles":[{"CreatedByName":"Strikerklm96","CreatedById":102539,"CreatedDateTime":"2014-02-05T05:51:03Z","Content":"\n\u003Cp\u003EThe following is an idea mainly related to Career Mode. It relates THREE popular subjects (losing, observatories, contracts), so I thought it deserved its own thread.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EThreatening Meteor(s):\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EImagine there is a meteor on a collision course with Kerbin, and it will do serious damage if it hits, but you don\u0027t have the technology to stop it! This could be a potential motive for the Career Mode, or at least another motive along with others.\u003C/p\u003E\u003Cp\u003EThe Idea: Meteors threaten Kerbin. To find their locations and get a warning before they hit and cause (***EVENTS***), you have to advance your observatory tech. This observatory tech includes satellites in orbit, and upgrading your Command Center.\u003C/p\u003E\u003Cp\u003ETo stop the meteors, you have 4 meteor related items which are outlined below.\u003C/p\u003E\u003Cp\u003ETo solve a meteor problem you have the following solutions. Each one is progressively higher on the tech tree.\u003C/p\u003E\u003Cp\u003EI: \u003Cem\u003EBattering Ram\u003C/em\u003E: Ancient technology attached to a rocket makes it pretty effective!\u003C/p\u003E\u003Cp\u003EII: \u003Cem\u003ELV-N Firecracker\u003C/em\u003E: A LV-N engine with its fuel consumption rate switched to \u0022Really Fast\u0022.\u003C/p\u003E\u003Cp\u003EIII: \u003Cem\u003EKerbal Kompressor\u003C/em\u003E: Presses a bunch of Kerbals into a block, ready to be shipped at a low flat rate.\u003C/p\u003E\u003Cp\u003EIIII: \u003Cem\u003EBEAM\u003C/em\u003E: Apparently it shoots at rocks. A note on the side says \u0022Launch into orbit asap!\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E***EVENTS***:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EContracts are related because people will pay you to stop a meteor from hitting them. \u003C/p\u003E\u003Cp\u003EMoney Loss because it hits your suppliers of items, causing price increase, or hits your Command Center. There don\u0027t need to be locations on Kerbin, a meteor will just be about to hit and it will just hurt some random supplier or institution that doesn\u0027t physically exist.(unless you stop it)\u003C/p\u003E\u003Cp\u003EThere are 3 kinds of meteor.\u003C/p\u003E\u003Cp\u003ESmall: Minor Consequences (Minor Money Loss and Contracts), can be deflected with Battering Ram, or destroyed with LV-N Firecracker. A little harder to spot than the rest, least warning.\u003C/p\u003E\u003Cp\u003EMedium: Pretty Serious Consequences (Lots of Money Loss and Contracts), can be destroyed with LV-N Firecracker. Easy to spot, reasonable time to react.\u003C/p\u003E\u003Cp\u003ELarge: Cause Most Serious Consequences (Life Ending, aka you lose). Cannot be stopped except with BEAM, you must evacuate Kerbin using the Kerbal Kompressor. Impossibly easy to spot, lots of time to react.\u003C/p\u003E\u003Cp\u003EBEAM stops all Meteors and is a permanent solution, so long as its in orbit. But its hardest to get.\u003C/p\u003E\u003Cp\u003EAs for what happens after you evacuate Kerbin, any of the following work: \u003C/p\u003E\u003Cp\u003EWin,\u003C/p\u003E\u003Cp\u003ELand back at Kerbin and resume like normal(it was life ending, not planet destroying),\u003C/p\u003E\u003Cp\u003ELand on a new planet and automatically get your base recreated there, and hope to get BEAM before the next one hits.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EWhy I think this idea is good:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDifficulty of Career can easily be adjusted by increasing or decreasing the frequency of meteors, as well as time before the first Large Meteor Impact, and successive impacts.\u003C/p\u003E\u003Cp\u003EIs a pretty good motive for why these green Kerbals are trying to go into space.\u003C/p\u003E\u003Cp\u003EMakes good use of Contracts, Losing, Money, and Observatories, if you like those things.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAs a final note\u003C/span\u003E, lots of these ideas can be switched around and or taken out:\u003C/p\u003E\u003Cp\u003EMaybe there should only be one meteor that you are trying to stop from the beginning, its only life ending, and once you solve it, your free.\u003C/p\u003E\u003Cp\u003EMaybe there should not be a final solution, and its a constant threat.\u003C/p\u003E\u003Cp\u003EMaybe there should never be a Life Ending meteor, only minor damaging ones that hurt money and contracts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-05T16:20:26Z\u0022 title=\u002202/05/2014 04:20  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 5, 2014\u003C/time\u003E by Strikerklm96\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Strikerklm96","CreatedById":102539,"CreatedDateTime":"2014-02-06T19:18:38Z","Content":"\n\u003Cp\u003EAny thoughts?/Bump\u003C/p\u003E\n"},{"CreatedByName":"ReptilianGameplays","CreatedById":65831,"CreatedDateTime":"2014-02-07T04:16:50Z","Content":"\n\u003Cp\u003ERandom events of damage ain\u0027t the best thing you can ask in this game... Yet. I guess.\u003C/p\u003E\n"},{"CreatedByName":"Syous","CreatedById":39100,"CreatedDateTime":"2014-02-07T15:03:10Z","Content":"\n\u003Cp\u003EIn the real world we have no need for an imminent threat to develop our space program...\u003C/p\u003E\n"},{"CreatedByName":"Strikerklm96","CreatedById":102539,"CreatedDateTime":"2014-02-07T16:58:50Z","Content":"\n\u003Cp\u003EThey are also random events of profit and science.\u003C/p\u003E\n"}]}