{"TopicId":62358,"ForumId":32,"TopicTitle":"Where can I get started?","CreatedByName":"kacperrutka26","CreatedById":18849,"CreatedDateTime":"2014-02-06T16:50:19Z","PageNum":1,"Articles":[{"CreatedByName":"kacperrutka26","CreatedById":18849,"CreatedDateTime":"2014-02-06T16:50:19Z","Content":"\n\u003Cp\u003EHello! You guys probably haven\u0027t seen me here for quite a few months/weeks due to the fact I didn\u0027t feel like posting here much. \u003C/p\u003E\u003Cp\u003EI recently got a new PC which made me want to play KSP again (on my old one I used to get 15 fps on lowest settings, now I get about 100 on medium settings). I have played every version so far from 0.13 but as time went on I really didn\u0027t feel like playing because every update became laggier and laggier until now. \u003C/p\u003E\u003Cp\u003EMy main question is, how can I get started into KSP again? I used to be fairly good (My first ever docking attempt was without RCS, it was successful too) but now I really don\u0027t know how to build rockets and such. I have started a sandbox world and a career worlds but as I said, I really don\u0027t know how to use all these parts to my advantage of going to other planets and such.\u003C/p\u003E\u003Cp\u003EAll help is appreaciated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EP.S: If this is in the wrong place, sorry. I haven\u0027t used the forum for a few months.\u003C/p\u003E\n"},{"CreatedByName":"Nobody","CreatedById":64303,"CreatedDateTime":"2014-02-06T17:08:26Z","Content":"\n\u003Cp\u003EIf your being overwhelmed by the number of parts start in career mode. That will restrict the parts available while you get back into the game and where the recent new content has been focused. Start simple and do science to fill out the tree for more parts.\u003C/p\u003E\u003Cp\u003ETrial and error will teach you how to build better. Don\u0027t be afraid to blow up some Kerbals since it is for the greatest of reasons \u0027SCIENCE\u0027.\u003C/p\u003E\n"},{"CreatedByName":"McDaddy23","CreatedById":76122,"CreatedDateTime":"2014-02-06T17:14:47Z","Content":"\n\u003Cp\u003EIf you\u0027re into video tutorials, Scott Manley recently made some updated tutorials about career mode. \u003C/p\u003E\u003Cp\u003EHere\u0027s a link:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLYu7z3I8tdEmqpOkQZCl5SZB5t0vXuxE0\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"iaminapeartree","CreatedById":102591,"CreatedDateTime":"2014-02-06T17:40:35Z","Content":"\n\u003Cp\u003EIm sure it will be like riding a bicycle. Just play a lot and it should come back to you.\u003C/p\u003E\n"},{"CreatedByName":"qromodynmc","CreatedById":87139,"CreatedDateTime":"2014-02-06T18:07:36Z","Content":"\n\u003Cp\u003EI will recommend you to play career mode from start to end. I was playing sandbox all the time,but I wasnt able to use rockets efficiently,After I start to career,I learned new ways to make rockets,And Learned to use them efficiently \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2014-02-06T18:20:37Z","Content":"\n\u003Cp\u003EAs others said, start with Career Mode to get back into it - it eases you back into different parts, and you have to learn to build a rocket with what you have, rather than all the parts.\u003C/p\u003E\u003Cp\u003EThe hardest thing starting Career Mode is what to do to get Science! Science being needed to unlock new parts. When in-flight Right-Click on various parts of your craft to see if there are new options available, like \u0022Crew Report\u0022 on the capsule or \u0022Observe Mystery Goo\u0022 on the Mystery Goo Canisters.\u003C/p\u003E\n"},{"CreatedByName":"Boris_T_Roach","CreatedById":27512,"CreatedDateTime":"2014-02-06T18:56:41Z","Content":"\n\u003Cp\u003EStart with a simple design, a capsule, a fuel tank and an engine. \u003C/p\u003E\u003Cp\u003EThen press the launch button and see how easy it is to control on its way up into the sky.\u003C/p\u003E\u003Cp\u003EAfter the fuel runs out and rocket stops going up, ponder the meanings of parachutes as your rocket and luckless occupant plunge ever downwards.\u003C/p\u003E\u003Cp\u003EAfter that , its just a matter of adding more fuel tanks/engines/struts/SRBs/staging thingies/more crew, extra parachutes/launch stabilishers/solar panels/landign legs/spell checkers/ and finally basking in the warm glow of a ship that finally in orbit\u003C/p\u003E\u003Cp\u003EOr just basking in the warm glow of your ship hitting the ground 22.6 seconds after launch \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EBoris\u003C/p\u003E\n"},{"CreatedByName":"Tripzter","CreatedById":75335,"CreatedDateTime":"2014-02-07T05:55:20Z","Content":"\n\u003Cp\u003EUnless you\u0027re running a 3d monitor 100fps is only burning up your video card.. enable the vsync.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-02-07T07:42:28Z","Content":"\n\u003Cp\u003EMy recommendation: Start with the basics, regardless of mode. A MK1 Capsule, an upper stage with an LV-T45, a lower stage with three LV-T30\u0027s, and three radially attached boosters.\u003C/p\u003E\u003Cp\u003EIf you\u0027re running Career mode, prioritize unlocks that have science gear in \u0027em. Otherwise, be planning to make lots of return trips.\u003C/p\u003E\u003Cp\u003EOr, become an oddball like me, and fly everywhere with spaceplanes. Lots of \u0027em. Start by trying simple things, like building a plane that can get off the runway, then one that can fly without engaging SAS (cause they fixed that so it isn\u0027t instant flappy-spam syndrome with your control surfaces anymore), then trying to get to space in a proper MSTO (Multi Stage to Orbit), and once you\u0027re comfortable, make a space station, dock a few planes, and attempt SSTO (Single Stage to Orbit) and docking with your new station.\u003C/p\u003E\u003Cp\u003EAlso, landing on planets and moons can be fun. If you\u0027re doing Career Mode, your big three are Kerbin, the Mun, and Minmus. Why? They have biomes which each can be exploited for science. You\u0027ll likely deal with Kerbin on your first few flights, but soon, it\u0027ll be for your landings. The Mun, well, it got re-surfaced and it\u0027s no longer the endless flat paradise it once was. Someone went around and punched a bunch of dirty great craters into it. Minmus, well, I\u0027ll let you know once I manage to land something on it without my poor landing skills getting the crew stranded.\u003C/p\u003E\u003Cp\u003EThere are a few planets/moons with atmosphere, which can be fun with spaceplanes to go investigate. Bring lots of rocket fuel if you do.\u003C/p\u003E\u003Cp\u003ELanding legs now have suspension, so say goodbye to rough landings resulting in a sudden bounce and parts flying. Also say goodbye to your engine if you build a craft heavier than the landing legs. 0.23 brought in Tweakables, and I think you can jam the suspension with it. You can also reduce thrust of any engine now for proper power-balancing.\u003C/p\u003E\u003Cp\u003EA lot has changed, but KSP, at its core, is still KSP. You\u0027ll get back in the swing of things.\u003C/p\u003E\n"}]}