{"TopicId":62826,"ForumId":25,"TopicTitle":"KSC Time Trial Chalenge","CreatedByName":"mpink","CreatedById":57827,"CreatedDateTime":"2014-02-10T21:39:37Z","PageNum":1,"Articles":[{"CreatedByName":"mpink","CreatedById":57827,"CreatedDateTime":"2014-02-10T21:39:37Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ERules\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou must start on the runway and become airborne as soon as you can to trigger the flight timer (dropping from a tower at the start should do this).\u003C/p\u003E\u003Cp\u003EYou must pass under the walkway in the R\u0026amp;D department.\u003C/p\u003E\u003Cp\u003EYou must do 1 circle of the VAB.\u003C/p\u003E\u003Cp\u003EYour time is taken when you safely land a kerbal on the Helipad on top of the VAB and stop moving (Just the kerbal i dont care about the craft).\u003C/p\u003E\u003Cp\u003EYou must list any plugins that you use.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELeader-board\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E2:27 - MPink\u003C/p\u003E\u003Cp\u003EIm sure iv seen one or two race type challenges before but im considering making a little racing mod and thought this would be a good tester as to peoples interest.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMy Entry\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI was using the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/68206-0-23-Im-a-Cupcake-Wannabe\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EIm a Cupcake Wannabe\u003C/span\u003E\u003C/a\u003E plugin.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/cVorxljlKSg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ELanded and stopped at 2:27 on the flight clock. Im not superhuman the video is played back at 3X speed and still isnt in true game time. My poor old abused computer \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI look forward to seeing your attempts. Dont be afraid to post failures as almost making it can be very inspiring too.\u003C/p\u003E\u003Cp\u003EI know this time can be smashed with not to much effort but doing it on film is a different matter \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EGood luck, have fun, and please put an ejection system on your craft !\u003C/p\u003E\n"},{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-02-10T22:37:50Z","Content":"\n\u003Cp\u003Ewhat mod do you use to keep your plane hovering with those radial engines and the jets?\u003C/p\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-02-11T00:03:55Z","Content":"\n\u003Cp\u003Em1sz:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mpink\u0022 data-cite=\u0022mpink\u0022\u003E\u003Cdiv\u003EI was using the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/68206-0-23-Im-a-Cupcake-Wannabe\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EIm a Cupcake Wannabe\u003C/span\u003E\u003C/a\u003E plugin.\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/cVorxljlKSg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is an awesome piece of kit!\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T08:25:07Z","Content":"\n\u003Cp\u003EWhat if I make kOS do it for me?\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T08:26:58Z","Content":"\n\u003Cp\u003EHmm... I wonder if I can do this with a sportscar and an ejector seat!\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T08:29:40Z","Content":"\n\u003Cp\u003EAlso, racing mod sounds awesome. I recommend making a start and finish line, a combo start-finish line that can set multiple laps, a restart button that uses the quicksave functionality, an auto-screenshot function that take screens at checkpoints....\u003C/p\u003E\u003Cp\u003EAlso, the start line, finish line, and checkpoints should be dynamically controllable boxes that if you enter, it counts.\u003C/p\u003E\n"},{"CreatedByName":"mpink","CreatedById":57827,"CreatedDateTime":"2014-02-13T19:05:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhat if I make kOS do it for me?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELOL why not. I think it would probably be harder to script than to fly.\u003C/p\u003E\u003Cp\u003EId still give you a run for you money.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHmm... I wonder if I can do this with a sportscar and an ejector seat!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow that would be cool and id love to see it.\u003C/p\u003E\u003Cp\u003EYou have me thinking now..... You would need to be a very good shot with that seat but maybe just maybe it could be done predictably. Its defiantly a jeb style of getting to the VAB.\u003C/p\u003E\u003Cp\u003ENot sure about making tight turns though but brakes would help a lot.\u003C/p\u003E\u003Cp\u003EThe current course is very flexible and dose not force you to do anything in an order just to achieve the 2 tasks before landing/crashing into the pad.\u003C/p\u003E\u003Cp\u003EThe circle should be done below VAB roof height but is very flexible.\u003C/p\u003E\u003Cp\u003EMy Thoughts on a mod are to make a gate command pod.\u003C/p\u003E\u003Cp\u003EYou could then move a constructed gate into a position and set it in place with a lock button.\u003C/p\u003E\u003Cp\u003EAdding multiple gates would make the course and the lock could fix the gate in place off the ground.\u003C/p\u003E\u003Cp\u003EPassing through a gate could trigger a screen shot or 3 and a change of target to the next gate.\u003C/p\u003E\u003Cp\u003EHummmmm a Restart system is a good call.\u003C/p\u003E\u003Cp\u003EI was planning on using the game clock and just spawning your craft in the center of the 1st gate.\u003C/p\u003E\u003Cp\u003EThat way you would just revert to spawn and start again but i see that could be problematic if im not very very careful with the spawn position.\u003C/p\u003E\u003Cp\u003EIts just thoughts at the mo but it sounds like it should be easy.\u003C/p\u003E\u003Cp\u003EIv got sketchy memories of a 2d rocket game in my youth. There were a few versions of it going around and 1 had multiplayer gate racing system.\u003C/p\u003E\u003Cp\u003EI suspect it would be a shed load harder in 3d but probably just a matter of practice.\u003C/p\u003E\u003Cp\u003EIm trying to think of places / features that would make good tracks. Id bet there are some good mountain canyons on kerbal and theres some cool spots on the moon too.\u003C/p\u003E\u003Cp\u003ELoL canyon moon racing might look a bit like a deathstart trench run. Any thoughts about places to checkout for making tracks would be great too.\u003C/p\u003E\u003Cp\u003EThe most frightening thought is what Orbital Racing would look like. Trying to thread the needle doing like 2000M/S.\u003C/p\u003E\n"}]}