{"TopicId":62868,"ForumId":44,"TopicTitle":"Drive Your Car Like a Rocket?","CreatedByName":"Right","CreatedById":80269,"CreatedDateTime":"2014-02-11T07:24:55Z","PageNum":1,"Articles":[{"CreatedByName":"Right","CreatedById":80269,"CreatedDateTime":"2014-02-11T07:24:55Z","Content":"\n\u003Cp\u003EDear Rocket Scientists, \u003C/p\u003E\u003Cp\u003EThis is a question for those of you who have a good understanding of the principle mechanics at work in rocket flight.\u003C/p\u003E\u003Cp\u003EThe popular belief is that driving a car uphill slowly saves fuel (all other things being equal). However, based on the knowledge I use to play KSP, I believe its quite the reverse. As you probably know, getting from the launch pad to a low circular orbit is best done as fast as possible (assuming you\u0027re not moving faster than terminal velocity). Rockets with thrust:weight ratios of 1.1 at launch are wasting a lot of dV. If you translate this logic to a car, then moving uphill at terminal velocity would be the most economical, right?\u003C/p\u003E\u003Cp\u003E(Again, this is assuming all things being equal; car engine has the same efficiency at various speed, total friction is equal, etc.)\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-02-11T07:34:23Z","Content":"\n\u003Cp\u003EAFAIK, the reason you wanba get to orbit as fast as possible is that Isp is lower in atmo.\u003C/p\u003E\n"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2014-02-11T07:34:38Z","Content":"\n\u003Cp\u003EThats... a lot of assumptions in the last line.\u003C/p\u003E\n"},{"CreatedByName":"Kerbin Dallas Multipass","CreatedById":79477,"CreatedDateTime":"2014-02-11T07:58:27Z","Content":"\n\u003Cp\u003EYou want to get your rocket into orbit as fast as possible because (unlike in your car example) you are constantly fighting gravity.\u003C/p\u003E\u003Cp\u003EImagine a 1000 lbs rocket that is hovering above the launchpad. It has to constantly generate 1000 lbs of thrust to stay where it is and not fall down. This energy is completely wasted since your rocket is not doing any useful physical work - its not gaining any altitude (potential energy) nor speed (kinetic energy) for the fuel you are spending.\u003C/p\u003E\u003Cp\u003EEven if the rocket is gaining altitude: this useless thrust has to be applied as long as the rocket is on its way to orbit (simplified), so it makes sense to reduce the amount of time spent in flight.\u003C/p\u003E\u003Cp\u003EA car on a hill works differently since it is mechanically \u0022locked\u0022 to the ground. Lets take the hovering example from above: If you just stopped and parked the car sideways it would not roll down the hill. You do not spend any energy to avoid it from rolling down the hill. \u003C/p\u003E\u003Cp\u003ESo, since the car is not wasting any thrust on gravity it doesnt matter how much time it spends in the process of going uphill.\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-02-11T08:22:03Z","Content":"\n\u003Cp\u003EBut assuming you don\u0027t put the car in park, you do need to expend fuel keeping it from rolling back down the hill. This is very obvious to those of us who drive (or drive) stick and ever visited San Francisco. So it is fighting gravity, just not to the same extent as a rocket.\u003C/p\u003E\u003Cp\u003EIt is an interesting problem. But as stated, all things are not equal. Like with a rocket, wind resistance increases as the car speeds up, to the point where most of your fuel is spent fighting it when at freeway speeds (this is why hybrids typically get better gas mileage driving city, because braking energy is recouped, but air resistance isn\u0027t).\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-02-11T08:50:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Soda Popinski\u0022 data-cite=\u0022Soda Popinski\u0022\u003E\u003Cdiv\u003EBut assuming you don\u0027t put the car in park, you do need to expend fuel keeping it from rolling back down the hill. This is very obvious to those of us who drive (or drive) stick and ever visited San Francisco. So it is fighting gravity, just not to the same extent as a rocket.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not that. For steady ascent, you need to apply a force to counter weight (or its component). Force applied over distance is work, and force applied over time is impulse. Now, work is pretty much fixed. There is the weight of the vehicle, and there is the height you need to ascent. Can\u0027t do anything about that. But impulse depends on duration. Now, the question is how \u0022expensive\u0022 the impulse is. Car pushes off form Earth. That\u0027s almost infinitely heavy. Impulse from \u0022infinitely\u0022 heavy object is free, because no matter how much force you apply to Earth, you aren\u0027t accelerating it, so you aren\u0027t doing any work. But if you have a very light reaction mass, like rocket\u0027s exhaust, suddenly, impulse is very expensive. So total energy you need depends on time more than altitude you need to gain.\u003C/p\u003E\u003Cp\u003EAs a result, energy requirement for a climbing car is independent of velocity, until we factor in drag. Similarly, until we factor in drag, rocket\u0027s climb is optimal when it is as rapid as possible. Once we factor in drag, you end up with optimal climb speed for a rocket being terminal velocity, and for car, as slow as possible.\u003C/p\u003E\u003Cp\u003EOf course, that\u0027s not exactly true. It takes fuel just to idle the engine. So with a real car, there is optimal speed as well. On level ground, between idle losses and drag, it works out to be something like 50mph (depends a LOT on the car, but that\u0027s the general ballpark figure.) As you climb, that figure drops fast. So for any reasonably steep hill \u0022as slow as possible\u0022 might not be far from truth.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-11T09:05:10Z","Content":"\n\u003Cp\u003EI always thought of it like this:\u003C/p\u003E\u003Cp\u003E- Vehicle speed scales linearly with engine rpm.\u003C/p\u003E\u003Cp\u003E- Fuel usage scales fairly linearly with engine rpm in a frictionless environment (like when you run the engine on a test stand).\u003C/p\u003E\u003Cp\u003E- Combined friction from wheels, aerodynamic drag, slip etc. increase exponentially with vehicle speed.\u003C/p\u003E\u003Cp\u003E- Going uphill while keeping fuel input constant slows you down.\u003C/p\u003E\u003Cp\u003ETherefore:\u003C/p\u003E\u003Cp\u003E- Maintaining speed while going uphill requires more fuel input.\u003C/p\u003E\u003Cp\u003E- Going faster, regardless of uphill or not, worsens your gas mileage.\u003C/p\u003E\u003Cp\u003EFinally leads to:\u003C/p\u003E\u003Cp\u003E- Going uphill fast is less fuel efficient than going uphill slowly.\u003C/p\u003E\n"},{"CreatedByName":"Kruleworld","CreatedById":69697,"CreatedDateTime":"2014-02-11T10:55:42Z","Content":"\n\u003Cp\u003EI thought this was going to be a thread about this (mythbuster\u0027s Rocket Impala).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cdn.static.ovimg.com/episode/342141.jpg\u0022 alt=\u0022342141.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2014-02-11T11:27:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E- Going faster, regardless of uphill or not, worsens your gas mileage.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. Theres a sweet spot. Go too slow and you waste fuel keeping the engine running longer than is necessary. Go too fast and you waste fuel fighting more air resistance than you have to. Depending on the vehicle, the most efficient speed is between 40 and 60 mph. The most efficient speed uphill should be slightly different, I believe slightly faster because time spent on the hill is more expensive than time spent on the flat, but most advice on the internet says the opposite.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-02-11T11:48:47Z","Content":"\n\u003Cp\u003EAlso, having to downshift because you\u0027re going too slowly will make the engine run at higher RPM, and therefore waste fuel. I would hazard a guess that the optimum speed would be the lowest you could manage and still stay in the highest gear without stalling, although I could be wrong.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-11T12:48:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EI always thought of it like this:\u003Cp\u003E- Vehicle speed scales linearly with engine rpm.\u003C/p\u003E\u003Cp\u003E- Fuel usage scales fairly linearly with engine rpm in a frictionless environment (like when you run the engine on a test stand).\u003C/p\u003E\u003Cp\u003E- Combined friction from wheels, aerodynamic drag, slip etc. increase exponentially with vehicle speed.\u003C/p\u003E\u003Cp\u003E- Going uphill while keeping fuel input constant slows you down.\u003C/p\u003E\u003Cp\u003ETherefore:\u003C/p\u003E\u003Cp\u003E- Maintaining speed while going uphill requires more fuel input.\u003C/p\u003E\u003Cp\u003E- Going faster, regardless of uphill or not, worsens your gas mileage.\u003C/p\u003E\u003Cp\u003EFinally leads to:\u003C/p\u003E\u003Cp\u003E- Going uphill fast is less fuel efficient than going uphill slowly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I take from that that going faster is less fuel efficient than going slowly. Nothing to do with the hill. Yeah you\u0027re going to burn more fuel if you go faster up the hill than when you don\u0027t, but that\u0027s just because you\u0027re going faster, not because you\u0027re going up the hill.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-11T13:10:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DonLorenzo\u0022 data-cite=\u0022DonLorenzo\u0022\u003E\u003Cdiv\u003EYeah you\u0027re going to burn more fuel if you go faster up the hill than when you don\u0027t, but that\u0027s just because you\u0027re going faster, not because you\u0027re going up the hill.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. Going uphill takes extra energy, meaning extra fuel. Just try it with your own car: drive along a level road at a fixed speed, and then keep your foot\u0027s position on the pedal perfectly steady as you start going uphill. You still burn the same amount of fuel, but your car slows down. If you want the car to hold its speed, you must depress the pedal further, meaning you spend more fuel. This is independent of speed. Going uphill costs fuel because you go uphill.\u003C/p\u003E\u003Cp\u003EIn physics terms: Energy is always transformed, never lost or gained. Going uphill is equal to raising your potential energy. That energy has to come from somewhere. It comes either from your vehicle\u0027s kinetic energy (you slow down) or from your vehicle\u0027s chemical energy (you expend more fuel).\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-11T14:06:55Z","Content":"\n\u003Cp\u003EOfcourse it costs fuel to go uphill, it doesn\u0027t technically say so in my post, but that\u0027s not the point we\u0027re contending here is it? \u003C/p\u003E\u003Cp\u003EWhat we\u0027re talking about is that \u003Cstrong\u003Egiven that we\u0027re going up a hill\u003C/strong\u003E is it more or less efficient to do so whilst accelerating/holding a steady speed/slowing down? I was operating under the assumption that it would be a given that\u003C/p\u003E\u003Cp\u003EA: Normal fuel expenditure increase for higher speeds aren\u0027t interesting, it\u0027s the hillclimb we\u0027re talking about, not general car efficiency\u003C/p\u003E\u003Cp\u003EB: Going up the hill will cost more than not going up the hill in the first place\u003C/p\u003E\u003Cp\u003EWith those in mind, the question becomes: \u0027When going faster, is less or more energy expended \u003Cstrong\u003Eto climb the hill\u003C/strong\u003E. You go faster and for sure pay for that, but does \u003Cstrong\u003Eclimbing the hill\u003C/strong\u003E become more/less energy expensive depending on the rate at which you do so (as with rockets).\u003C/p\u003E\u003Cp\u003EIf that\u0027s not what this is all about and instead it\u0027s about whether or not going up or faster costs energy, I\u0027ll see myself out and you can go ahead and figure that out \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MrZayas1","CreatedById":95654,"CreatedDateTime":"2014-02-11T15:05:31Z","Content":"\n\u003Cp\u003EInteresting question, and plus my family works with cars a bunch but i don\u0027t really think that is true. If i am not mistaken, your engine uses more fuel the faster you go i am sure. I believe that in this case Isp is kind of the same thing so i will use it in this example. Although there are definitely some minor things (fuel entry to combustion chamber) but the more you apply the gas pedal, the more gas you use, so going uphill slowly would consume less fuel! The isp of a car is actually variant because when you travel slower your car uses less gas and more efficiently, and when you go faster you use it faster and less efficiently, if you wanted to compare this to a rocket, then you could show how you would try to stay at about 200m/s velocity upwards when you are going through the atmosphere so you use most of your fuel in the less dense part of the atmosphere rather than using all the energy to get through the thick part. In a car, aerodynamics doesn\u0027t really make any sense (like quantum mechanics and gravity) so think about how the engine works. An engine uses the combustion of the fuel to provide the energy needed to push your wheels. So when you do this it is slower at slower speeds, and you get the most out of your fuel because your engine is being more concerned on fuel economy. When your engine is at full throttle it is more focused on getting fuel in the chamber and giving you speed rather than being efficient, so this is why most people drive uphill slowly. I hope this kind of helps answer your question, if you find anything wrong with it feel free to correct me, i am pretty smart for a 15 year old but everyone makes mistakes! Hope you have a great day!\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-02-11T16:12:40Z","Content":"\n\u003Cp\u003E@MrZayas1,\u003C/p\u003E\u003Cp\u003EWhile quantum mechanics may not make sense in car dynamics, gravity and aerodynamics is certainly important in several cases. This one, a car going uphill, is one case where gravity is not negligible.\u003C/p\u003E\u003Cp\u003EA car, no matter where it is, experiences gravity on a constant direction (downwards). This is opposed by the Earth\u0027s normal force pushing on the car, as the result of its downward force via gravity, by Newton\u0027s third law. The normal force, however, is always perpendicular to the surface being applied force, no matter at what angle the force was applied. As a result, when the car is on a sloped surface, this normal force has a horizontal component, facing away from the upper side of the slope. If a car is to stand still on this slope with no brakes, it would have to counter this force with energy from its engine, lest it would roll backwards.\u003C/p\u003E\u003Cp\u003EAs you pointed out, disregarding the aerodynamic components, cars spend more energy per unit of distance when going at higher speed, due to various internal friction losses. Logically, going slower, in such cars, means getting more fuel efficiency.\u003C/p\u003E\u003Cp\u003EOn the uphill scenario, there is a dilemma. Go too fast, and you\u0027ll waste fuel via internal losses inherent from high-speed driving. Go too slow, and you\u0027ll lose too much energy trying to overcome the normal force\u0027s horizontal component as explained, by staying on the hill area for too long. If the car were to stop in the middle of the hill without using the brakes, it would waste fuel keeping itself still, despite not moving at all.\u003C/p\u003E\u003Cp\u003EAs previous posts explained, there is a sweet spot; an optimal, most efficient speed at which to climb a hill, specific to the car model and the gradient/steepness of the hill.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2014-02-11T17:12:22Z","Content":"\n\u003Cp\u003EIf fuel use scales up with acceleration, and there\u0027s no air resistance, a car going up hills is pretty much like a spacecraft in orbit. At the bottom of the hill it moves fastest and at the top it moves slowest. Just like the Oberth effect, if you want to speed up the car, the most efficient way to do it is to accelerate when it\u0027s already moving fastest, at the bottom of the hill. Adding in air resistance and internal resistance, that conclusion still stands but there\u0027s an upper limit where too much acceleration means too much friction. So the most fuel efficient way to traverse a certain distance across hills is to keep the fuel flow relatively constant most of the time (to counter air resistance) but use extra fuel at the bottom of a hill (enough to make it past the top). The speed at which you should go depends on your car\u0027s internal resistance (and air resistance).\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2014-02-11T18:28:08Z","Content":"\n\u003Cp\u003EWhen you go downhill (and dont put your car into neutral or or just coast with the clutch depressed) you use almost no fuel [mindblown?] (it may even be zero fuel but i forget)\u003C/p\u003E\u003Cp\u003EAlso, as with speed, theres a sweetspot (just noticed this has been mentioned several times) to get optimal fuel use up a hill. This is why i get pissed off at old biddies leaving their cars in second gear revving its balls off so I end up following them in second gear eating all my fuel nom nom nom.\u003C/p\u003E\u003Cp\u003EAlso at what speed to you start the ascent up the hill? From a standing start you may as well just give it the beans and burn some rubber whilst you\u0027re there. Accelerating slowly up a hill from standstill is pretty wastefull. Get up to speed as fast as possible. Manufacturers put a rev limiter in your car for this very reason.\u003C/p\u003E\u003Cp\u003EIf your hitting the hill at 70mph and its a slight incline then you may as well just leave your foot where it is on the pedal and lose a bit of speed. Your forward momentum will keep you going for a while.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-11T18:32:04Z\u0022 title=\u002202/11/2014 06:32  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 11, 2014\u003C/time\u003E by vetrox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T21:32:33Z","Content":"\n\u003Cp\u003EThe difference between a wheel and a rocket is that a wheel\u0027s exhaust velocity is always equal to the vehicle\u0027s surface velocity and it has infinite propellant but limited fuel.\u003C/p\u003E\u003Cp\u003EGranted, car exhaust is hot and does provide thrust (your car is a type of very inefficient aspirated rocket that diverts most of it\u0027s useful energy to an alternator.)\u003C/p\u003E\u003Cp\u003ESo basically the Oberth effect is neutralized for normal wheels.\u003C/p\u003E\u003Cp\u003ENow, on a dirt, gravel, or snow road, this might not be true. It becomes perfectly possible to increase your Isp \u003C/p\u003E\u003Cp\u003Ewhich decreases fuel efficiency...\u003C/p\u003E\u003Cp\u003ESo wheeled vehicles can essential ignore rocket physics. They can\u0027t get nothing for something or something for less than it should cost like a rocket can. We should be thankful. If cars had an exhaust velocity of 3.5 km/s, you would spend 100 times more fuel maintaining 35 m/s than a car does. Cars are extremely fuel efficient compared to rockets. The \u0022delta-v\u0022 of a car built like s rocket, 63% fuel, accelerating to 80 mph smoothly and repeatedly with the same efficiency as a rocket, would be around 2800000 m/s in air. 1% the speed of light.\u003C/p\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2014-02-11T21:34:48Z","Content":"\n\u003Cp\u003EI don\u0027t know where you people get this idea that 50mph is the mpg sweet spot for cars. I drive a 20 year old s-10 pickup, not the most gas efficient vehicle ever, and through thousands of miles I can say with certainty that it gets the best mileage at 70-75 mph. You want to stay in top gear at a low rpm while holding a constant speed to max your gas mileage, on a hill that sweet spot moves up the rpm range if not disappears entirely and thus it is better to get past the hill as fast as possible. After all you are not climbing to space the hill is short and you can probably cost down the backside at idle.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T22:16:34Z","Content":"\n\u003Cp\u003EIt is however fairly efficient to burn pretty aggressively while going up a hill as long as you make sure your velocity is near zero at the top so that you won\u0027t have to brake to go below the speed limit or lose all of your potential energy to kinetic energy to air friction.\u003C/p\u003E\u003Cp\u003ESo A: you shouldn\u0027t fly over the top of a hill because air drag consumes energy proportional to the cube of your speed.\u003C/p\u003E\u003Cp\u003EB: you shouldn\u0027t accelerate if you will need to brake more because of it to stay near the speed limit/the speed you are wanting to go.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T22:25:00Z","Content":"\n\u003Cp\u003EAlso, as cars wear, they get less efficient at low speeds due to increased mechanical friction. However, older cars are also often less aerodynamic as well.\u003C/p\u003E\u003Cp\u003EIn the extreme slow end, we have brand new boxy vehicles that don\u0027t weigh much. Without air conditioning and such, these vehicles are optimized for speeds of about 25 mph.\u003C/p\u003E\u003Cp\u003EOn the other end, we have vehicles that are crushing their rusty axles with many tonnes of weight but are relatively aerodynamic. These can be optimized for speeds at 80 mph or more.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T22:35:25Z","Content":"\n\u003Cp\u003EBy the way, despite superlative aerodynamic efficiency and a massive bulk, a Tesla Model S still maxes out efficiency around 30 mph due to it having almost no internal friction.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T23:20:12Z","Content":"\n\u003Cp\u003EAlso, if you are driving a Tesla, the regenerative braking means that you can feel free to fly over hills.\u003C/p\u003E\u003Cp\u003ESo normal braking is like a parachute, regen is like going up a hill.\u003C/p\u003E\u003Cp\u003ESpeaking of which, a Tesla\u0027s 85 kWh battery has the equivalent energy of a Tesla at about 15 km above the Earth, which means it is impossible to completely recharge from a dead battery on regen, and that everywhere on Earth\u0027s surface is within reach of a Tesla charged at sea level.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-11T23:32:37Z\u0022 title=\u002202/11/2014 11:32  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 11, 2014\u003C/time\u003E by Pds314\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-02-11T23:34:49Z","Content":"\n\u003Cp\u003EAlso, did you know that when you drive east, it is more efficient to go slightly slower. This is however negligible. It is also easier to skid going east. Finally, it is more efficient to go east.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-11T23:41:09Z\u0022 title=\u002202/11/2014 11:41  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 11, 2014\u003C/time\u003E by Pds314\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbin Dallas Multipass","CreatedById":79477,"CreatedDateTime":"2014-02-12T00:01:26Z","Content":"\n\u003Cp\u003EAerodynamic drag at higher speeds is always significantly higher. \u003C/p\u003E\u003Cp\u003EHowever, fuel efficiency for most combustion engines you find in a car is best when operated at full throttle in the lowish rpm spectrum (1500 or something). From a pure engine point of view you would get the best efficiency when going up a really steep hill in a high gear, pedal to the floor.\u003C/p\u003E\n"}]}