{"TopicId":62905,"ForumId":51,"TopicTitle":"[Video] Kethane on Minmus - first time adventures","CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2014-02-11T20:43:51Z","PageNum":1,"Articles":[{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2014-02-11T20:43:51Z","Content":"\n\u003Cp\u003EHere\u0027s a quick video of my Kethane operation as it stands. I\u0027m running completely stock except for Kethane and KAS (Kerbal Attachment System), and of KAS, I\u0027m only using the basic winch \u002B ports to mimic fuel hoses. This really feels like a fuel depot at this point.\u003C/p\u003E\u003Cp\u003EThis is kind of a test for me to learn recording and publishing videos, mostly to document. Enjoy:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=UU2Z2tzCnJ9abruareA3JPuA\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EKethane drilling rig on Minmus.\u003C/p\u003E\u003Cp\u003ERefuelling shuttle.\u003C/p\u003E\u003Cp\u003EOrbital fuel depot.\u003C/p\u003E\u003Cp\u003ERefine kethane on Minmus into traditional fuels. Bring it all up to orbital station using the shuttle. Keep refueling station full by transferring all fuel from shuttle into orbital depot. I only need about 200 units of fuel remaining (out of 1440 capacity) in the shuttle to land back at the Minmus drilling rig. Refuel shuttle to courier back to the orbital depot. Rinse, repeat as necessary. \u003C/p\u003E\u003Cp\u003EThis was my first experience with Kethane, and my Minmus station is my test-bed for the future. Lessons learned here will help me place a kethane mining facility on all bodies around the kerbol system in order to support deep-space missions. Next target will probably be Duna. But I would like to have one even down on Moho and possibly Gilly, if kethane exists there.\u003C/p\u003E\u003Cp\u003ELots of lessons learned here. First and foremost? If you plan on developing a craft that constantly transfers fuel back and forth, go with a single large tank and not multiple small tanks. The smaller tanks may look prettier, but they get annoying quick having to fill or drain them all. My quad-RCS tanks will be replaced with a singular one on future missions. Also, wheels are unnecessary on Minmus. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-12T02:30:40Z\u0022 title=\u002202/12/2014 02:30  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 12, 2014\u003C/time\u003E by mellojoe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2014-02-12T04:31:12Z","Content":"\n\u003Cp\u003E((edit)) Please be kind, as this was my first time doing actual commentary. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But let me know what you guys think.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-02-12T06:01:55Z","Content":"\n\u003Cp\u003EGood video, informative commentary. I gave it a thumbs up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI notice you were wondering about the best way to go about doing kethane. Here\u0027s what I\u0027ve learned from messing with it myself:\u003C/p\u003E\u003Cp\u003EThe way the numbers work, it\u0027s more fuel-efficient to move raw kethane than finished product. So, if you\u0027re drilling on the ground and refueling ships at an orbital station, it\u0027s best to have the refining unit and its power plant in space at the fuel station. You can same more fuel by no moving drills, refineries, and their power plants, too. Thus, the most efficient way of creating an orbital fuel station is to have the refinery and its power plant on the orbital station, the drills and their power on the ground, and a stripped-down kethane tanker flying between them. If you also put a refinery on the drilling rig, then the tanker can refuel at both ends of the trip so only has to carry fuel for a 1-way trip, meaning it can be a bit lighter and thus more efficient.\u003C/p\u003E\u003Cp\u003EIf you only run the drilling rig when the tanker is connected to it, the drilling rig can be a very minimal thing with 1 each of the smallest tanks. This is because you pump kethane and/or product into the tanker as quickly as the rig\u0027s making it, so no need for big tanks on the rig. Likewise, the orbital refinery just needs the refinery unit itself plus 1 of the smallest kethane tanks, and only runs when the tanker is docked. The tanker pumps into the refinery\u0027s little kethane tank, the refinery converts it to product as fast as it\u0027s coming in, and you pump the product into the storage tanks as fast as you make it.\u003C/p\u003E\u003Cp\u003EIf you have a high-gravity planet and a low-gravity moon, then you might want to do separate kethane operations for each of them. The one on the moon would refuel ships that stay in space while the one on the planet would refuel stuff that lands on or stays on the planet.\u003C/p\u003E\u003Cp\u003EFinally, scanning for kethane. Doing it from polar orbit covers the whole planet but the more of the planet you cover, the longer it takes. And seriously, there are few things in the game less fun than scanning for kethane. So if you know you\u0027re never going to land near the poles, don\u0027t scan from polar orbit. Instead, scan just the tropics from like a 30-35^ orbit. This will show you all the kethane you might actually use and takes way less time than doing the polar orbit. Plus, because the probe doesn\u0027t have to make so big a plane change, it might have enough fuel left to go scan another moon.\u003C/p\u003E\n"}]}