{"TopicId":62900,"ForumId":36,"TopicTitle":"Kerbal Construction Time/StageRecovery Dev Thread","CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-02-11T19:11:39Z","PageNum":6,"Articles":[{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-27T02:14:21Z","Content":"\n\u003Cp\u003EI\u0027m loving this mod! Only issue I\u0027m having is that a mini version of my rocket (With all the effects active) appears horizontally over the R\u0026amp;D building, and the things with launch effects don\u0027t have launch effects.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-27T03:04:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003EI\u0027m loving this mod! Only issue I\u0027m having is that a mini version of my rocket (With all the effects active) appears horizontally over the R\u0026amp;D building, and the things with launch effects don\u0027t have launch effects.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe floating rockets over the R\u0026amp;D center is a known issue (discussed a few pages back) that I don\u0027t currently know how to fix. It\u0027s a side effect of having to load the ships to get to their parts, which I do only in the Space Center in order to avoid them being loaded (and causing real issues) in the flight scene. In the future I may write my own method for loading ships into parts, or I may find a better one. Until then the mini ships will appear, but should be harmless, just possibly annoying. You\u0027ll notice that every single ship in a build list or in storage will be piled on top of each other, as a result of the loading.\u003C/p\u003E\u003Cp\u003EWhat do you mean by \u0022the things with launch effects don\u0027t have launch effects\u0022? Can you clarify that some more, perhaps with screenshots if it would help? Is this an issue on the launchpad, or is it with the floating ships? If it\u0027s the floating ghost ships, then I\u0027m not going to worry about it, for the above mentioned reasons.\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-27T05:48:12Z","Content":"\n\u003Cp\u003EI still had it safe \u003Ca href=\u0022https://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u003C/a\u003E 4 large SRBs with a fitting on top to make the chute look good, with it set to slow to 6m/s in the realchutes editor. I had even used smartparts to make them deploy to try that even though the docs say it isn\u0027t needed. I think it just doesn\u0027t like me, or doesn\u0027t like some other mod in some way.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2014-03-27T11:42:35Z","Content":"\n\u003Cp\u003EOk got my log files, need to figure out how to post them when I get home tonight. I watched the bit in question all the way down, it\u0027s getting deleted at 22k which is standard for unloaded suborbital debris right?\u003C/p\u003E\u003Cp\u003Eand personally I think the rocket over the space center is kinda kewl. If you can figure how how/why it spawns where it does and just make it do so in a suitable building, now that would be even better!\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-27T17:48:46Z","Content":"\n\u003Cp\u003EI think it might have to do with another mod changing something. Looking at the logs, KCT doesn\u0027t even attempt to recover them (which is weird, even without parachutes it should display something as long as certain conditions are met.) I see that at least one of the boosters was set as the active vessel after separation, but am not sure if that\u0027s related. I also am only seeing two boosters actually being destroyed from the ship \u0022Data Currier\u0022 due to being in atmosphere (and also some debris from a minmus satellite crashing into minmus, which entertained me for some reason). I\u0027m going to list the requirements for it to attempt to recover the boosters, which may help somehow:\u003C/p\u003E\u003Cp\u003Ev is the vessel that is destroyed (the booster)\u003C/p\u003E\u003Cp\u003Eif (v != null \u0026amp;\u0026amp; v.mainBody.bodyName == \u0022Kerbin\u0022 \u0026amp;\u0026amp; v.name.Contains(\u0022(Unloaded)\u0022) \u0026amp;\u0026amp; v.altitude \u0026lt; 35000 \u0026amp;\u0026amp; (v.situation == Vessel.Situations.FLYING || v.situation == Vessel.Situations.SUB_ORBITAL) \u0026amp;\u0026amp; !v.isEVA \u0026amp;\u0026amp; !v.isActiveVessel)\u003C/p\u003E\u003Cp\u003EIn pseudocode:\u003C/p\u003E\u003Cp\u003EThe vessel must not be null (it must exist)\u003C/p\u003E\u003Cp\u003EIt must be in Kerbin\u0027s SOI\u003C/p\u003E\u003Cp\u003EIt must be unloaded (not active/on rails, this happens when it gets outside of 2.5km)\u003C/p\u003E\u003Cp\u003EIt must be below 35km\u003C/p\u003E\u003Cp\u003EIt must be flying in atmosphere or at least on a suborbital trajectory (it has to crash)\u003C/p\u003E\u003Cp\u003EIt has to not be an EVA\u0027d kerbal\u003C/p\u003E\u003Cp\u003EIt has to not be the active vessel\u003C/p\u003E\u003Cp\u003EOne issue could be restricting it to suborbital, as a booster with an AP of \u0026gt;70km and a PE of \u0026gt;0 is probably not considered suborbital, however your main vessel isn\u0027t even switched to sub orbital (from flying) until after the boosters are destroyed (so likely not the cause in this instance).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECould anyone experiencing issues with booster recovery please try this version and then get me their KSP.log and output_log.txt files after the boosters should be recovered?\u003C/strong\u003E It adds some extra debug info that will possibly help me diagnose the issues (and also changes the height up to 70km instead of 35).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/j7oc199q7th7v1t/KCT_Debug.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/j7oc199q7th7v1t/KCT_Debug.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThank you all for your help! Sorry about the issues :/\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-28T00:25:18Z","Content":"\n\u003Cp\u003EI had it going to active to see if the chute deployed. I was try to try all kinds of possibilities to figure out what might be going on. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027ll get the test file and do a launch tonight and get you the log files. This is really a great mod adding a lot of flavor, and can see even greater advantages once the economy is implemented as well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: Did it sooner than I thought I could, so did a launch just to get the logs for you ASAP.\u003C/p\u003E\u003Cp\u003EKSP.log: \u003Ca href=\u0022https://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eoutput_log.txt: \u003Ca href=\u0022https://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-28T01:01:38Z\u0022 title=\u002203/28/2014 01:01  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 28, 2014\u003C/time\u003E by JeffreyCor\u003C/strong\u003E\n\u003Cbr\u003Einclude log files after test\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-28T01:00:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003E\u003Cem\u003ESNIP\u003C/em\u003E\u003Cp\u003EWhat do you mean by \u0022the things with launch effects don\u0027t have launch effects\u0022? Can you clarify that some more, perhaps with screenshots if it would help? Is this an issue on the launchpad, or is it with the floating ships? If it\u0027s the floating ghost ships, then I\u0027m not going to worry about it, for the above mentioned reasons.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpecifically the sparklers from the Space Shuttle Main Engine mod after the ship has been loaded onto the launchpad and is ready to be launched. \u003Cimg src=\u0022http://i.imgur.com/aNhjdq5.png\u0022 alt=\u0022aNhjdq5.png\u0022\u003E if you look below the main engine (Attached the the launch clamp) there is one of the sparklers from the Space Shuttle Main Engine mod that is supposed to be shooting sparks, but is not (Despite being in a pre-launch condition)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-28T01:03:01Z\u0022 title=\u002203/28/2014 01:03  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 28, 2014\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-28T01:28:14Z","Content":"\n\u003Cp\u003EI can see the confusion with your prior postings. That isn\u0027t part of the native game, that is part of a mod. I\u0027m sure including the name of the mod for your tower, clamps, and effects would help with any narrowing down of the cause or how to correct. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-28T01:35:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeffreyCor\u0022 data-cite=\u0022JeffreyCor\u0022\u003E\u003Cdiv\u003EI can see the confusion with your prior postings. That isn\u0027t part of the native game, that is part of a mod. I\u0027m sure including the name of the mod for your tower, clamps, and effects would help with any narrowing down of the cause or how to correct. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Launch towers are from\u003Ca href=\u0022http://kerbalspaceprogram.com/gemini-and-mercury-frizzank-aeronautical-space-administration-fasa/\u0022 rel=\u0022external nofollow\u0022\u003E FASA\u003C/a\u003E, and the sparklers are from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55985-0-23-16-Mar-Space-Shuttle-Engines-V1-2-Bugfixes-and-minor-improvements\u0022 rel=\u0022external nofollow\u0022\u003ESSME \u003C/a\u003Emod. There are others (Including but not limited to NP, B9, and AIES) but I haven\u0027t had an issue before.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-28T02:14:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeffreyCor\u0022 data-cite=\u0022JeffreyCor\u0022\u003E\u003Cdiv\u003E Did it sooner than I thought I could, so did a launch just to get the logs for you ASAP.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, so this time you launched something called \u0022Shuttle\u0022 right? What was attached to this one? I see some radial decouplers getting destroyed that for some reason are not unloaded when they get destroyed. These ones are not getting recovered because they aren\u0027t unloaded (their names don\u0027t include \u0022(unloaded)\u0022). Later on you stage again and there are at least two different pieces of debris. These both are being processed correctly (but don\u0027t appear to have any parachutes as their terminal velocity is 78 m/s) which means that the mod itself is still functioning correctly at that point (sometimes there\u0027s an issue and the mod just totally stops functioning afterward).\u003C/p\u003E\u003Cp\u003ESo the issue with this one seems to be that they aren\u0027t unloaded, but they were at something like 15km. Very strange. I\u0027m going to try not using v.name and instead using v.vesselName. I\u0027m not sure if that will change anything though. Can you get me the craft file? Maybe I can reproduce it on my end and then I can see if I can fix it, instead of continuously asking you to try things and then send me the logs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003ESpecifically the sparklers from the Space Shuttle Main Engine mod after the ship has been loaded onto the launchpad and is ready to be launched. if you look below the main engine (Attached the the launch clamp) there is one of the sparklers from the Space Shuttle Main Engine mod that is supposed to be shooting sparks, but is not (Despite being in a pre-launch condition)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, I\u0027m not sure what would be causing that. I\u0027m going to do the same thing I ask of everyone and ask you for your logs. Perhaps there\u0027s (somehow) an issue with how I place Kerbals in the ship after the ship is on the pad, or with having to load the ship in the space center scene. If it\u0027s just a visual bug though, I\u0027m not going to have it too high on my priority list (no offense, but right now I don\u0027t have the time to fix every little bug when this is still under heavy development. The game breaking bugs are my main priority atm)\u003C/p\u003E\u003Cp\u003EAlso, a reminder for everyone. I\u0027m currently taking a small break from development as I am quite swamped with school. Please see this post for more information:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php?p=1031205#post1031205\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php?p=1031205#post1031205\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso, 0.23.5 adds timewarp to KSC and the Tracking Station, so the jump to complete will be gone and I can just timewarp to complete! I am very happy about that addition \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-28T02:41:30Z","Content":"\n\u003Cp\u003EYes, the first stage was separated using an action group and smart part fuel sensor consisting of 4 SRBs with top mount chutes mounted by radial decouplers . Second stage triggered manually, 5 tank/engine cluster without chutes on a stack decoupler. \u003C/p\u003E\u003Cp\u003EI am very glad to test anything, come up with different ships with any sort of specs needed to test different aspects. Here is also the craft file for my shuttle, though it does use some mods so that could be an issue going from one install to another. \u003Ca href=\u0022https://www.dropbox.com/s/o2dqg8175j8izw9/Shuttle.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/o2dqg8175j8izw9/Shuttle.craft\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2014-03-28T03:55:10Z","Content":"\n\u003Cp\u003EAck, apparently godaddy doesn\u0027t like these files. Can you PM me an email addy magico? (I hate dropbox)\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-28T16:09:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003EAck, apparently godaddy doesn\u0027t like these files. Can you PM me an email addy magico? (I hate dropbox)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not seeing anything happening at all with that part, same as for JeffreyCor. One thing that I\u0027m noticing about both of them is that it looks like they\u0027re being staged automatically using Smart Parts. I am starting to suspect it as the culprit, but am not yet sure. Were the fairings staged with smart parts, or was it the booster (or both)? \u003C/p\u003E\u003Cp\u003EWait, you didn\u0027t switch to it and follow it down that way did you? It won\u0027t be recovered if it\u0027s the active vessel. I can\u0027t tell if that\u0027s what got destroyed by deadly reentry or if that was something else.\u003C/p\u003E\u003Cp\u003EI\u0027m not entirely sure what\u0027s going on. It could be smart parts staging things differently and the boosters somehow not getting \u0022(unloaded)\u0022 in their name, thereby not passing that check. I need that check to make sure they\u0027re being destroyed by being unloaded and not from crashing into each other (both use the same function). If you are using smart parts (JeffreyCor or CatastrophicFailure), could you try without it and just stage manually and see if that helps? If so, then I can focus my efforts on getting compatibility with it.\u003C/p\u003E\u003Cp\u003ECould you also use the debug build I mentioned earlier, if it\u0027s not too much trouble, the extra bit of information it outputs will possibly help diagnose the issues. It\u0027s just the .dll file, if you extract it like you would normally and overwrite the old one it will be fine. Don\u0027t delete the old folder first. Thanks for your assistance. I wish I had more time to test things, since I don\u0027t really have a chance to try this out myself.\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-28T20:41:14Z","Content":"\n\u003Cp\u003EOn the ones with fairings I have the smart parts for both boosters and fairings. I will launch the shuttle again to test for you with the smart parts removed and stage the SRB sep manually and upload the logs for you today so it can be as close to equal for comparing as possible. I have the debug build still installed and will keep it there so I have it ready to go for any testing you need.\u003C/p\u003E\u003Cp\u003EManual SRB sep done. \u003C/p\u003E\u003Cp\u003EKSP.log: \u003Ca href=\u0022https://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eoutput_lot.txt: \u003Ca href=\u0022https://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-28T21:14:48Z\u0022 title=\u002203/28/2014 09:14  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 28, 2014\u003C/time\u003E by JeffreyCor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-28T22:38:09Z","Content":"\n\u003Cp\u003EThat having the same problem it seems. For some reason it\u0027s saying the vessel name is \u0022radialDecoupler\u0022 instead of \u0022[ship Name] Debris (Unloaded)\u0022 which is throwing it off. Would you kindly try this version and repeat the same procedure? (btw, you can just simulate the launch. It does the recovery then too, but when you revert it \u0022forgets\u0022). The only difference is what name I reference in the vessel (I also am printing each name I can access, there are 3 total, so hopefully one of them will be right).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/fseste9fd933tsu/KCTDebug1.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/fseste9fd933tsu/KCTDebug1.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis issue is really frustrating, but at least it seems like we know what the issue is, just not yet how to solve it. (the issue is just the name the debris is being given after decouple)\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-29T02:09:11Z","Content":"\n\u003Cp\u003EGlad to help! Put the new file in and did a simulated launch with the same ship and procedure as the last time. Here\u0027s the logs for you\u003C/p\u003E\u003Cp\u003EKSP.log: \u003Ca href=\u0022https://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eoutput_log.txt: \u003Ca href=\u0022https://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-29T02:26:15Z","Content":"\n\u003Cp\u003EWell, darn. The different names I can apparently get are these: \u003C/p\u003E\u003Cp\u003E[LOG 18:48:14.425] radialDecoupler\u003C/p\u003E\u003Cp\u003E[LOG 18:48:14.426] Shuttle Debris\u003C/p\u003E\u003Cp\u003E[LOG 18:48:14.427] Shuttle Debris\u003C/p\u003E\u003Cp\u003EWhich none of them are formatted correctly and only the first one ever gets the (unloaded) part added to their name. I think I\u0027m going to have to come up with a different set of conditions. Instead of checking the name, I\u0027m going to try to check if vessel.loaded is false. Another debug version for you, when you get time.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/k887iawvok4sqvl/KCTDebug2.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/k887iawvok4sqvl/KCTDebug2.zip\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-29T03:51:11Z","Content":"\n\u003Cp\u003EOkey Dokey, another simulated launch with the same ship using the new file.\u003C/p\u003E\u003Cp\u003EKSP.log: \u003Ca href=\u0022https://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eoutput_log.txt: \u003Ca href=\u0022https://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-29T16:50:07Z","Content":"\n\u003Cp\u003EFor whatever reason it looks like they aren\u0027t being unloaded before being destroyed, even though the action of them being unloaded is what destroys them. I\u0027ll have to do some sort of workaround I guess. The one I\u0027m thinking might work is checking (in addition to the other checks) that the altitude above the surface is greater than a buffer of 10 meters while also not being landed and is also below 35km. I fear that will \u0022recover\u0022 boosters that collide with each other and are destroyed, which wouldn\u0027t make sense. Before trying that though, let me try seeing if the vessel is \u0022packed\u0022. That may work better and I just thought of it while typing this.\u003C/p\u003E\u003Cp\u003EThis hopefully will be the last one... \u003Ca href=\u0022http://www./download/1wsw8l5bvc5o7g5/KCTDebug3.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/1wsw8l5bvc5o7g5/KCTDebug3.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOnce again, thank you for your help. If I weren\u0027t busy with school right now I could do more of the testing myself. I did test that this one will recover boosters that normally are recovered, so this method might work. If the vessels aren\u0027t being packed before destruction though, it\u0027s going to be more difficult.\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-29T19:23:13Z","Content":"\n\u003Cp\u003EI am very happy to help all I can. I wish I knew more on programming to be of better assistance, but being in finals time it makes any additional learning unrelated to those subjects have to be on hold. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I used the same ship again without any changes done to it to duplicate everything as before and noted SRB sep occurred just over 12k and they stayed visible until 5k away from the ship. Sometimes strange little things actually help.\u003C/p\u003E\u003Cp\u003EKSP.log: \u003Ca href=\u0022https://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eoutput_log.txt: \u003Ca href=\u0022https://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-29T19:39:16Z","Content":"\n\u003Cp\u003EI would like to point you to this set of output from the KSP.log file:\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.249] [KCT] Vessel being destroyed, listing information:\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.250] radialDecoupler\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.251] Shuttle Debris\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.252] Shuttle Debris\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.253] Kerbin\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.254] 16167.6203737071\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.255] -1\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.256] False\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.256] True\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.257] True\u003C/p\u003E\u003Cp\u003E[LOG 11:51:39.258] flying\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E[LOG 11:51:39.259] [KCT] Found realchute module on parachuteLarge\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E[LOG 11:51:39.260] chute area: 3525.652\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E[LOG 11:51:39.261] dragC: 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E[LOG 11:51:39.262] [KCT] Using RealChute Module! Drag/Mass ratio: 56.3295452308007\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E[LOG 11:51:39.264] [KCT] Recovered parts from Shuttle Debris\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhich means it is working properly now! The last debug version should be fine to play with, but perhaps later tonight I will get an official update out. Assuming everything doesn\u0027t suddenly break.\u003C/p\u003E\u003Cp\u003EAlso, your chute area is huge! I only require a drag to mass ratio of like 8 or 9 to recover, which in my testing has been appropriate for a less than 10 m/s landing. When configuring the chutes were you using just the mass of the boosters? It certainly doesn\u0027t hurt to have larger chutes, but it\u0027s just something I noticed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf CatastrophicFailure could perhaps test the latest debug version and let me know if his issue has been fixed, it would be greatly appreciated! I\u0027m assuming he is having the same issue as you are, JeffreyCor.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-29T19:40:49Z\u0022 title=\u002203/29/2014 07:40  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 29, 2014\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-29T23:10:56Z","Content":"\n\u003Cp\u003EI believe it had read in the docs that it needed to be slower than 10m/s for recovery, so I wanted to make sure it had a buffer \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E With the current version of RealChutes instead of entering the size, you enter the tons (or let it determine it itself) and speed and the thing figures out the size itself. Since that version came out I\u0027ve never even looked at the size of the chutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E For the booster chutes I used the listed mass on the parts list, rounded up, and set desired speed to 6m/s for a relatively gentle landing for a tossed off part. \u003C/p\u003E\u003Cp\u003EI\u0027ll try the current test version out more during actual play later today both with and without smart parts and let you know if anything funky happens. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EUpdate: The good news is it does indeed seem to be recovering the parts, yeay! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E However, it also seems to be recovering parts even that don\u0027t have chutes. I\u0027ve been using some with just nosecones rather than chute cones and I\u0027m seeing them in the parts list. Not too sure what may be triggering the recovery, if something else is slowing them down, or just what is going on with that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-31T07:07:59Z\u0022 title=\u002203/31/2014 07:07  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 31, 2014\u003C/time\u003E by JeffreyCor\u003C/strong\u003E\n\u003Cbr\u003EUpdated info\n\u003C/span\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-31T13:56:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeffreyCor\u0022 data-cite=\u0022JeffreyCor\u0022\u003E\u003Cdiv\u003EHowever, it also seems to be recovering parts even that don\u0027t have chutes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, that\u0027s certainly weird. I didn\u0027t change the actual recover requirements, only the initial check for if a vessel is possibly recoverable. I\u0027m going to ask you to do the thing you\u0027re so good at doing now: can you get me the logs? I\u0027m curious as to if the stock drag is really high or something. It would have to be in the hundreds, and is usually 0.2 for something without parachutes.\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-03-31T15:52:18Z","Content":"\n\u003Cp\u003EIf it\u0027s something weird, it must be me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027m putting up my logs from last night which I\u0027m pretty sure should have something in them with it. I did at least 1 or 2 launches with parts that only had nosecones. I only noticed it when I was looking though my parts list and saw the engines and rechecked if I had put chutes on them. It could just be some really crazy thing happening to me, but certainly wanted to let you know since it seems related to the fix I was test out.\u003C/p\u003E\u003Cp\u003EKSP.log: \u003Ca href=\u0022https://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8pg7fz8wbc1ajyq/KSP.log\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eoutput_log.txt: \u003Ca href=\u0022https://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/afrjfgt8f1xr2ix/output_log.txt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-03-31T17:06:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeffreyCor\u0022 data-cite=\u0022JeffreyCor\u0022\u003E\u003Cdiv\u003EIf it\u0027s something weird, it must be me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027m putting up my logs from last night which I\u0027m pretty sure should have something in them with it. I did at least 1 or 2 launches with parts that only had nosecones. I only noticed it when I was looking though my parts list and saw the engines and rechecked if I had put chutes on them. It could just be some really crazy thing happening to me, but certainly wanted to let you know since it seems related to the fix I was test out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI looked through the KSP.log but couldn\u0027t find any instance where anything was being recovered. Did you cancel a vessel that uses parts from the inventory? Because that would give you back those parts. If you notice it happening again, let me know and send me the logs. Recovery of things that shouldn\u0027t be recovered is a serious bug if it\u0027s occurring. Thanks for testing this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}