{"TopicId":62942,"ForumId":25,"TopicTitle":"An Affordable Space Program: making the reusable spacecraft pay off.","CreatedByName":"SirJoab","CreatedById":78834,"CreatedDateTime":"2014-02-12T04:56:27Z","PageNum":5,"Articles":[{"CreatedByName":"SirJoab","CreatedById":78834,"CreatedDateTime":"2014-04-03T01:46:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EGreat challenge SirJoab, let\u0027s see if you can get more entrants now that you\u0027ve been stickied\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2014-04-03T19:21:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E* No solid fuel boosters, as they cannot be refueled.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I design and screen how I recover and attach boosters to the rocket can we pretend they can be refueled?\u003C/p\u003E\n"},{"CreatedByName":"SirJoab","CreatedById":78834,"CreatedDateTime":"2014-04-03T22:00:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003EIf I design and screen how I recover and attach boosters to the rocket can we pretend they can be refueled?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm... I\u0027m interested. Would you mind making a small demonstration? One question though, why not just make liquid-fuel boosters to do the job?\u003C/p\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2014-04-04T13:01:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SirJoab\u0022 data-cite=\u0022SirJoab\u0022\u003E\u003Cdiv\u003EHmm... I\u0027m interested. Would you mind making a small demonstration? One question though, why not just make liquid-fuel boosters to do the job?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn next week, right now I have to calculate few things and find a way to connect rocket stages, if that is even possible without decouplers.\u003C/p\u003E\u003Cp\u003EMain idea is shown here (I am not doing Ares rockets, just taking inspiration from it)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ksj.mit.edu/sites/default/files/images/tracker/2009/NASA-ConstellationAresRockets.jpg\u0022 alt=\u0022NASA-ConstellationAresRockets.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAres I stage 1 is used as booster in Ares V.\u003C/p\u003E\u003Cp\u003EAres I stage 2 is used as stage 2 in Ares V lite.\u003C/p\u003E\u003Cp\u003EAres V and Ares V lite stage 1 is designed for heavy payloads, from my initial tests with new parts it should go ~45 tons without stacking fuel and engines in clusters.\u003C/p\u003E\u003Cp\u003EStill have to design Ares V stage 2 and Ares I first stage.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2014-04-04T13:29:01Z","Content":"\n\u003Cp\u003EThe question is: how do you want to decouple and recover the boosters with the limitation that the KSP engine deletes objects beyond ~2.5km distance within the atmosphere (or at least to a certain altitude)?\u003C/p\u003E\u003Cp\u003EI am also pondering to create a 2nd entry - probably some bigger plane-like SSTO attempt. You know, gotta try and test the new parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe CLAW also offers new reload/refuel mechanisms.\u003C/p\u003E\u003Cp\u003EI mean why dock the payload when you can grab it?\u003C/p\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2014-04-04T13:38:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordFjord\u0022 data-cite=\u0022LordFjord\u0022\u003E\u003Cdiv\u003EThe question is: how do you want to decouple and recover the boosters with the limitation that the KSP engine deletes objects beyond ~2.5km distance within the atmosphere (or at least to a certain altitude)?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is not a problem, all you need is to attach remote command unit to for example booster and you have new vehicle that won\u0027t be deleted \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordFjord\u0022 data-cite=\u0022LordFjord\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI am also pondering to create a 2nd entry - probably some bigger plane-like SSTO attempt. You know, gotta try and test the new parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe CLAW also offers new reload/refuel mechanisms.\u003C/p\u003E\u003Cp\u003EI mean why dock the payload when you can grab it?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea CLAW gave me new ideas. Well if I fail building rocket I will probably finish my SSTO Phoenix.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2014-04-04T14:04:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003EThat is not a problem, all you need is to attach remote command unit to for example booster and you have new vehicle that won\u0027t be deleted \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you sure with this? Probe core and even manned separated vessels disappear after said distance. At least in 0.23.\u003C/p\u003E\u003Cp\u003EMy tests for a science bomber some month ago (para drop small probes with science gear on Kerbin) failed - all probes disappeared. When I switched to a probe after drop, the manned plane disappeared.\u003C/p\u003E\n"},{"CreatedByName":"Keldaria","CreatedById":106284,"CreatedDateTime":"2014-04-04T18:28:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SirJoab\u0022 data-cite=\u0022SirJoab\u0022\u003E\u003Cdiv\u003EHmm... I\u0027m interested. Would you mind making a small demonstration? One question though, why not just make liquid-fuel boosters to do the job?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust for purity sake, I\u0027d recommend separate leader boards for people who need a VAB to reassemble their craft, otherwise its not really fair to those who designed craft that didn\u0027t need the VAB to reload payload (and/or fuel) to relaunch.\u003C/p\u003E\u003Cp\u003ETo be completely honest, its not hard to develop a reusable launch vehicle if all you need to do is recover the parts, just develop a 2 stage system with boosters that separate before you start your gravity turn and have parachutes that auto deploy on staging. I\u0027d be curios to see any attempt mind you because I tend to draw inspiration from others but I just think using the VAB to reassemble recovered pieces, sort of defeats the purpose of this challenge in my mind.\u003C/p\u003E\u003Cp\u003EA huge portion of this challenge has always been reloading/fueling the launch vehicle, so if you could for instance show me that you can reassemble and reload (payload) and refuel liquid propellants without entering the VAB, then I\u0027d say it would probably be fair to allow the use of hyperedit or something to refuel solid boosters... but then again this isn\u0027t my challenge so take my opinion for what its worth (probably nothing lol).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-04T18:33:57Z\u0022 title=\u002204/04/2014 06:33  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 4, 2014\u003C/time\u003E by Keldaria\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-04T19:07:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Keldaria\u0022 data-cite=\u0022Keldaria\u0022\u003E\u003Cdiv\u003EA huge portion of this challenge has always been reloading/fueling the launch vehicle, so if you could for instance show me that you can reassemble and reload (payload) and refuel liquid propellants without entering the VAB, then I\u0027d say it would probably be fair to allow the use of hyperedit or something to refuel solid boosters... but then again this isn\u0027t my challenge so take my opinion for what its worth (probably nothing lol).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the other hand, you spawn big fuel tanks to refuel your rocket, right? Spawn some spare SRBs at the same time, and manually attach them, and you dont need to recover them. SRBs are dirt cheap anyway, according to VAB prices...\u003C/p\u003E\n"},{"CreatedByName":"gchristopher","CreatedById":106024,"CreatedDateTime":"2014-04-04T23:54:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EOn the other hand, you spawn big fuel tanks to refuel your rocket, right? Spawn some spare SRBs at the same time, and manually attach them, and you dont need to recover them. SRBs are dirt cheap anyway, according to VAB prices...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat doesn\u0027t sound right to me. If you attach SRBs that just fall into the ocean, that\u0027s not reuse. Those big refueling tanks never leave the ground as part of any launch system. The game just doesn\u0027t provide fuel trucks, so we have to make them. \u003C/p\u003E\u003Cp\u003EI think the point of the challenge was pretty clearly to land and reuse absolutely every bit of mass that goes into ascent. Allowing spawning new disposable SRBs invites trivial abuses like having your launch vehicle just being a pod sitting on top of 100 boosters that are \u0022reused.\u0022 \u003C/p\u003E\u003Cp\u003EI agree with Keldaria, hyperedit refueling of solid rocket boosters that somehow make it back to the launch pad sounds like a reasonable way to treat it as reusable, but it has to be the exact SAME booster that goes up each flight. That\u0027s the same restriction that applies to every engine, fuel tank, coupler and strut that comprise the rest of the vehicles.\u003C/p\u003E\n"},{"CreatedByName":"gchristopher","CreatedById":106024,"CreatedDateTime":"2014-04-05T00:18:17Z","Content":"\n\u003Cp\u003EYou people that finished stations already are amazing. I\u0027m close, but this is so HARD!\u003C/p\u003E\u003Cp\u003EI don\u0027t know if it\u0027s all the docking and undocking, switching between vessels and the space center a million times, or the 23.5 update, or micro space gremlin krakens, but the reusable fleet is really starting to feel the effects of being in use for so many missions.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RoXI7W2.jpg\u0022 alt=\u0022RoXI7W2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, parts have started to drift from their attachment points. When I switch to the combined vehicle in orbit, it immediately experiences phantom forces and slowly rolls to the left. SAS doesn\u0027t seem to notice. I\u0027m glad that at least I stuck to all stock parts!\u003C/p\u003E\u003Cp\u003EIt\u0027s still flyable, but some of the thrust and lift vectors are a little bit off, so I can\u0027t go above 2/3 throttle on landing or else it gets confused and nosedives. Also, you have to gently roll right continually in flight to overcome the phantom roll effect.\u003C/p\u003E\u003Cp\u003EHang in there little spaceship, only two flights to go!\u003C/p\u003E\u003Cp\u003E(Edit, I\u0027m almost 100% sure there\u0027s never been a \u0022structural failure\u0022 message, crash or contact with the ground. I\u0027m pretty sure the vehicle damage is from updates or quirks with the physics engine or part tree rebuilds during docking. It\u0027s been through dozens of docking cycles.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-05T00:23:55Z\u0022 title=\u002204/05/2014 12:23  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 5, 2014\u003C/time\u003E by gchristopher\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mecha Pants","CreatedById":58006,"CreatedDateTime":"2014-04-05T01:24:03Z","Content":"\n\u003Cp\u003EIf I remember correctly, solid rocket boosters stay active even when empty, and hyperedit refueling immediately causes them to reignite/explode.\u003C/p\u003E\n"},{"CreatedByName":"SirJoab","CreatedById":78834,"CreatedDateTime":"2014-04-05T03:18:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Keldaria\u0022 data-cite=\u0022Keldaria\u0022\u003E\u003Cdiv\u003EA huge portion of this challenge has always been reloading/fueling the launch vehicle, so if you could for instance show me that you can reassemble and reload (payload) and refuel liquid propellants without entering the VAB, then I\u0027d say it would probably be fair to allow the use of hyperedit or something to refuel solid boosters... but then again this isn\u0027t my challenge so take my opinion for what its worth (probably nothing lol).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI completely agree. I would have to make a separate leaderboard for anyone using new boosters from the VAB or SPH as part of their refueling process. Hyperedit on the ground for the solid boosters would be more acceptable. \u003C/p\u003E\u003Cp\u003EBut... I\u0027m going to wait and see what people come up with before setting this in stone. There are some pretty creative people around here. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mecha Pants","CreatedById":58006,"CreatedDateTime":"2014-04-05T04:04:37Z","Content":"\n\u003Cp\u003EWorking on an entry of my own, but have run into a bit of a snag. I had planned to use the ARM claw as an extremely forgiving cargo hook for my spaceplane, but it seems for a fraction of a second physics turn off as it grabs. This makes my spaceplane and cargo loader/refueler clip through the runway and fall into the subsurface ocean. I\u0027m going to have to do more experimentation to figure out a way past it.\u003C/p\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2014-04-05T04:40:40Z","Content":"\n\u003Cp\u003EWow gchristopher, that\u0027s quite a bit of machinery you\u0027ve got there. The spaceplane that splits in half lands the center lifter back at KSC? It seems like just having parachutes would be simpler, but then again it\u0027s really cool how everyone comes up with their own unique solution.\u003C/p\u003E\u003Cp\u003EI\u0027m also working on an entry, currently trying to work out the problems before starting the space station for real. In my current design, the ship lands horizontally, accepts its payload on its nose, then pushes itself back to vertical for takeoff using a downward pointing engine in the front.\u003C/p\u003E\u003Cp\u003ECurrently its payload is limited by this step: anything that it can push into the vertical position, it can bring to orbit. Long payloads also are a problem: the solar boom in the picture could barely be lifted even though it weighs only a few tons. It can lift about 12 if the payload is short.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AEGjbI0l.png\u0022 alt=\u0022AEGjbI0l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pNwJEV2l.png\u0022 alt=\u0022pNwJEV2l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yVy1cKZl.png\u0022 alt=\u0022yVy1cKZl.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-05T06:31:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gchristopher\u0022 data-cite=\u0022gchristopher\u0022\u003E\u003Cdiv\u003EThat doesn\u0027t sound right to me. If you attach SRBs that just fall into the ocean, that\u0027s not reuse. Those big refueling tanks never leave the ground as part of any launch system. The game just doesn\u0027t provide fuel trucks, so we have to make them. \u003Cp\u003EI think the point of the challenge was pretty clearly to land and reuse absolutely every bit of mass that goes into ascent. Allowing spawning new disposable SRBs invites trivial abuses like having your launch vehicle just being a pod sitting on top of 100 boosters that are \u0022reused.\u0022 \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you can reattach 100 solid boosters without recovering your craft, get back in the air, and not spin out of control from misaligned docking ports, I\u0027d call that a win. It\u0027s an \u0022abuse\u0022 that\u0027s far harder than simply pumping more fuel into your tanks.\u003C/p\u003E\n"},{"CreatedByName":"Keldaria","CreatedById":106284,"CreatedDateTime":"2014-04-05T17:11:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EIf you can reattach 100 solid boosters without recovering your craft, get back in the air, and not spin out of control from misaligned docking ports, I\u0027d call that a win. It\u0027s an \u0022abuse\u0022 that\u0027s far harder than simply pumping more fuel into your tanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not really about that, it\u0027s more about staying true to the challenge of reusable spacecraft. Otherwise the challenge would be to assemble a craft outside the VAB. Nobody is denying that reassembly of a vehicle outside the VAB isn\u0027t hard but it can be abused, such as by creating a small control vehicle that is reusable and just reattached to payloads that contain the primary lift functions.\u003C/p\u003E\u003Cp\u003EAt the end of the day I think you should try whatever you think is appropriate for the challenge and let SirJoab determine how valid of a setup it is for the challenge. Something designed where you have to reattach a few freshly spawned SRB to your main craft may be perfectly fine, especially if you spawn them 1 at a time and use a single, none recovered vehicle to capture and move them to your rocket for attachment.\u003C/p\u003E\u003Cp\u003EAlso sdj64 that\u0027s awesome, I had thought about attempting a launch stage that lands horizontal and tilts back to vertical but I nixed the idea pretty fast because I could get the tilt function right with a detachable engine and I didn\u0027t want to carry the extra weight of the tilt engine back and forth to orbit. Also my designs never incorporate the payload into the tilt, that would have gotten attached after but that is an awesome solution because it would probably be easier to attach in a horizontal application. So kudos to you for making that work, it looks awesome.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-04-05T17:38:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gchristopher\u0022 data-cite=\u0022gchristopher\u0022\u003E\u003Cdiv\u003EYou people that finished stations already are amazing. I\u0027m close, but this is so HARD!\u003Cp\u003EI don\u0027t know if it\u0027s all the docking and undocking, switching between vessels and the space center a million times, or the 23.5 update, or micro space gremlin krakens, but the reusable fleet is really starting to feel the effects of being in use for so many missions.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/RoXI7W2.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/RoXI7W2.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, parts have started to drift from their attachment points. When I switch to the combined vehicle in orbit, it immediately experiences phantom forces and slowly rolls to the left. SAS doesn\u0027t seem to notice. I\u0027m glad that at least I stuck to all stock parts!\u003C/p\u003E\u003Cp\u003EIt\u0027s still flyable, but some of the thrust and lift vectors are a little bit off, so I can\u0027t go above 2/3 throttle on landing or else it gets confused and nosedives. Also, you have to gently roll right continually in flight to overcome the phantom roll effect.\u003C/p\u003E\u003Cp\u003EHang in there little spaceship, only two flights to go!\u003C/p\u003E\u003Cp\u003E(Edit, I\u0027m almost 100% sure there\u0027s never been a \u0022structural failure\u0022 message, crash or contact with the ground. I\u0027m pretty sure the vehicle damage is from updates or quirks with the physics engine or part tree rebuilds during docking. It\u0027s been through dozens of docking cycles.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey! Your entry has been a true pleasure to follow, hang in there and get it done, we are all cheering for you! (even if your payload capacity is likely to put you over my scores \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E). Second, I also saw that bug, my fuel lines were touching the ground by the end, but were the only part affected. I think it\u0027s the slight \u0022jump\u0022 the ships do when docking and aligning themselves without regards for physics: if something physics-less (like fuel lines or struts) was out of place before physics got annulled, it stays there when the other parts are re-loaded in neutral positions, and ends up completely wrong, but reading to teh game as still connected where it was before. Just a guess, though, but it actually is cool... Wear and tear indeed! And your method being so amazingly complicated (that\u0027s short of a compliment, I love that splitting SSTO and the absurd fact that it is NOT the main launcher), you were bound to be hit harder by it. Hope you get to the finish line!\u003C/p\u003E\u003Cp\u003EAlso to the SRB guys and the bright luminary that suggested this is an easy challenge: have you considered that everything outside the 2.5km physics range that is not either landed or in a stable-ish orbit outside the atmosphere gets destroyed by the game as if it had crashed? So yeah, \u0022simple\u0022 two-stage designs have to leave their first stage in a sufficiently high suborbital trajectory that they can circularize with the second before the first one hits the atmosphere again to land it. Or, and this is even more difficult, leave the second stage in a sufficiently high suborbital trajectory that the first stage can land before you have to circularize its orbit. Go ahead, try for yourselves, and if you make it work you will be very welcome to post your exploits here. I guarantee you will have a much greater respect to all the people that have finished this challenge regardless of score!\u003C/p\u003E\u003Cp\u003ERune. We are proving the Shuttle lesson, in a way, aren\u0027t we?\u003C/p\u003E\n"},{"CreatedByName":"Keldaria","CreatedById":106284,"CreatedDateTime":"2014-04-05T22:30:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso to the SRB guys and the bright luminary that suggested this is an easy challenge: have you considered that everything outside the 2.5km physics range that is not either landed or in a stable-ish orbit outside the atmosphere gets destroyed by the game as if it had crashed? So yeah, \u0022simple\u0022 two-stage designs have to leave their first stage in a sufficiently high suborbital trajectory that they can circularize with the second before the first one hits the atmosphere again to land it. Or, and this is even more difficult, leave the second stage in a sufficiently high suborbital trajectory that the first stage can land before you have to circularize its orbit. Go ahead, try for yourselves, and if you make it work you will be very welcome to post your exploits here. I guarantee you will have a much greater respect to all the people that have finished this challenge regardless of score!\u003C/p\u003E\u003Cp\u003ERune. We are proving the Shuttle lesson, in a way, aren\u0027t we?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell for the record, no I hadn\u0027t considered that since I typically haven\u0027t tried to recover stages within that range, and my builds for this challenge so far have only been SSTO so I can\u0027t say I really thought about that aspect but none the less point taken and challenge accepted. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/GTD9n\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI present to you the 2STO payload lifter, I placed a dummy payload of 3 science labs plus docking ports for a total tonnage of just over 10.5 tons. First stage launches straight up and pushes to about 185k, second stage detaches, does an RCS burn to gain space then a gravity turn burn to reach a stable orbit. I then switched back to the first stage and followed it to landing. Then back at my second stage, I got abit overly critical about the eccentricity of my orbit so I used RCS burns to stablize it at around 175k. Then detached the payload, RCS burned to give me some space to work and set it for landing as well. Now i did use MechJeb for landings, I must admit I\u0027m not really good at the fine adjustments in general and tend to overcorrect. But my piloting skills suck, I don\u0027t question that =P.\u003C/p\u003E\u003Cp\u003EAll in all I wasn\u0027t disappointed with the exercise but I still found it a bit easier to achieve this sort of payload delivery than I was having with my original launch vehicle I was tinkering with. It looks like I may have inadvertently created a 2 stage reusable rocket as a result of this experiment, just need to setup a way to refuel and find a better pilot than me to lift off the second stage and carefully reattach it to the first and a crane to reload the payload. I was quite happy with the landing sites of the different stages, I think I\u0027ll keep them there.\u003C/p\u003E\u003Cp\u003EI might revisit this again someday in the future as I do like the concept of a 2 stage lifter that is fully reusable but I\u0027m happy with this for now. Link below contains the craft file if anyone else is interested in tinkering.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/jv66t66kfdq0a43/2STO.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/jv66t66kfdq0a43/2STO.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENow I do want to say this, I never intended to say or imply that doing things certain ways were not interesting or not in some way hard. I honestly enjoy seeing everyone\u0027s creations and if a 2 stage SRB creation was posted (even one that needed a VAB to recombine \u0026amp; refuel) I would honestly be as interested in seeing how it was accomplished as much as the next creation. My only thought was that the idea of using a VAB to recombine and refuel somehow feels like cheating after all the other entries went to great lengths to not use it. I still respect the attempt, but out of fairness for the other entries I feel those should be kept on a separate leader board or marked on the existing leader board as \u0022VAB used\u0022 if their entries are scored.\u003C/p\u003E\u003Cp\u003EAlso I very much agree, we\u0027re learning the lessons of the shuttle with this challenge and that\u0027s why I like it =)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-05T22:47:04Z\u0022 title=\u002204/05/2014 10:47  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 5, 2014\u003C/time\u003E by Keldaria\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-05T23:24:41Z","Content":"\n\u003Cp\u003EI\u0027ve got a design for a 2STO that can easilly handle a Science Lab, using the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75272\u0022 rel=\u0022external nofollow\u0022\u003EStock Engine Rebalance\u003C/a\u003E, stages connected by docking ports for reassembilly, and landing both stages back at the launch site. Reassembilly and attaching the next cargo are what I\u0027m currently hung up on.\u003C/p\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2014-04-06T00:10:47Z","Content":"\n\u003Cp\u003EIsn\u0027t the hardest part of the 2 stage design getting the second stage back on top of the first stage? (and getting the payload on top of that)\u003C/p\u003E\u003Cp\u003EYou could make a two stage rocket craft with two side boosters that are attached to the core via docking ports. That way the side boosters and the core could both land upright on legs, and a rover with a docking port at the right height could dock them back together without needing to raise or lower anything. You would still need some way of getting the payload on top though.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-06T01:13:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sdj64\u0022 data-cite=\u0022sdj64\u0022\u003E\u003Cdiv\u003EIsn\u0027t the hardest part of the 2 stage design getting the second stage back on top of the first stage? (and getting the payload on top of that)\u003Cp\u003EYou could make a two stage rocket craft with two side boosters that are attached to the core via docking ports. That way the side boosters and the core could both land upright on legs, and a rover with a docking port at the right height could dock them back together without needing to raise or lower anything. You would still need some way of getting the payload on top though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is landing *both* boosters. Perhaps if you could RCS the boosters together and land them as one unit?\u003C/p\u003E\u003Cp\u003EMy current approach is to have the upper stage having a surface TWR of \u0026lt;1 including payload. This lets it circularize with plenty of time to get back to the booster, and lets it skycrane a payload. Unfortunately, I\u0027ve been having probems getting a Sr docking port to dock under kerbin gravity\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T01:18:48Z\u0022 title=\u002204/06/2014 01:18  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by Rakaydos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Keldaria","CreatedById":106284,"CreatedDateTime":"2014-04-06T03:36:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sdj64\u0022 data-cite=\u0022sdj64\u0022\u003E\u003Cdiv\u003EIsn\u0027t the hardest part of the 2 stage design getting the second stage back on top of the first stage? (and getting the payload on top of that)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, Re-docking the second stage is a problem, I was able to do it on mine but it took me few tries and a good portion of fuel each try, even after getting my second stage on top of the first (which it helped that my first stage was fairly wide and flat) it took a few times jumping up and down on the docking port for it to truly take. At any rate I couldn\u0027t imagine having to do that process multiple times after each orbit... I\u0027m thinking I might adjust the second stage to fit under my first (I know, Ironic isn\u0027t it?) and have it clamp in like my other proof of concept. Let the first stage take me into space without any gravity turn, then release and back away my second stage with RCS and then proceed like normal. The under mounting of smaller stages and payload makes it easier in my opinion to connect outside of the VAB, even if your still using a docking port to connect, it should be easier to rover under a rocket and boost straight up to connect than to try and land on or build a crane to service the exact height. Of course that relies on me being able to design a primary stage that is wide enough to slip smaller stages/payload between the 4 \u0022Legs\u0022 and/or design a rover that can fit between them as well to move it into position...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sdj64\u0022 data-cite=\u0022sdj64\u0022\u003E\u003Cdiv\u003EYou could make a two stage rocket craft with two side boosters that are attached to the core via docking ports. That way the side boosters and the core could both land upright on legs, and a rover with a docking port at the right height could dock them back together without needing to raise or lower anything. You would still need some way of getting the payload on top though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EThe problem is landing *both* boosters. Perhaps if you could RCS the boosters together and land them as one unit?\u003Cp\u003EMy current approach is to have the upper stage having a surface TWR of \u0026lt;1 including payload. This lets it circularize with plenty of time to get back to the booster, and lets it skycrane a payload. Unfortunately, I\u0027ve been having probems getting a Sr docking port to dock under kerbin gravity\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I was first putting together my original 2STO design, I had intended to use an under mounted mainsail engine for second stage which meant I would have had to use side mounted tanks in a similar fashion to the boosters that you mention, but I quickly revised that plan when I couldn\u0027t think of an intelligent way to make all the tanks disconnect and remain 1 piece. I hadn\u0027t thought about having the boosters recombine themselves after being decoupled, I\u0027d love to see somebody put that in action, I would try myself but I\u0027m not good enough with RCS docking to dock before I hit the atmosphere again (I\u0027m one of those people that does his docking at 0.1m/s)..\u003C/p\u003E\u003Cp\u003EAt any rate, I might have to tinker with my design some more tomorrow if I can find the time. I really want to see if combining my 2 designs would work as intended or not.\u003C/p\u003E\n"},{"CreatedByName":"gchristopher","CreatedById":106024,"CreatedDateTime":"2014-04-06T07:18:41Z","Content":"\n\u003Cp\u003EWell, at least I have more fun failures to share!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EOCDMor.jpg\u0022 alt=\u0022EOCDMor.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe RCS tug (\u0022Alaskan Mosquito Mark I\u0022) was just a little bit too large to dock the cupolas in position, so I sent a little scaffold up with the second cupola delivery flight. Kinda an extension that was intended to hold the cupola at arm\u0027s length and a more convenient orientation. I\u0027ll have plenty to say about why I hate cupolas when this is over. \u003C/p\u003E\u003Cp\u003EBuuuut, the scaffold docking port joints are way, way too floppy for reasonable RCS operation. SAS is out of the question, because it just oscillates wildly if you turn it on. \u003C/p\u003E\u003Cp\u003ESo, I downloaded the MechJeb source code and made a few changes to address \u003Ca href=\u0022https://github.com/MuMech/MechJeb2/issues/316\u0022 rel=\u0022external nofollow\u0022\u003Ethe backing up bug\u003C/a\u003E and see if I could reduce the wobble. \u003C/p\u003E\u003Cp\u003EMaybe it\u0027s time to send up \u0022Alaskan Mosquito Mark II, the Claw Edition!\u0022 I wonder if grabbing stuff with the claw would be a better option if some idiot decided to send a space station up in 20 different pieces and put it all together in orbit. Sending up the KerblArm (Mark III) isn\u0027t an option until Infernal Robotics recovers from the 23.5 update.\u003C/p\u003E\u003Cp\u003E(Edit: well, that took 10 minutes to investigate. Claws are way, WAY better. Guess I\u0027d better get around to deorbiting and sending up another mission.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T07:31:31Z\u0022 title=\u002204/06/2014 07:31  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by gchristopher\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mecha Pants","CreatedById":58006,"CreatedDateTime":"2014-04-07T17:56:17Z","Content":"\n\u003Cp\u003EI\u0027ve given up on my previous attempt with claws, and I\u0027ve run into another snag with my smaller, lighter SSTO spaceplane.\u003C/p\u003E\u003Cp\u003EIf I have one station module that is significantly larger than my SSTO\u0027s payload space, is it acceptable for me to attach it to the top of my first lift with a decoupler, provided all further modules use the docking port in the cargo bay?\u003C/p\u003E\u003Cp\u003EFor demonstration:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nIHLk8y.png?3\u0022 alt=\u0022nIHLk8y.png?3\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe actual cargo bay is between the engine intake nacelles and is about as big as a mk2 fuselage section. I can fit single kerbal pods and small sub-assemblies, but not the lab or habitat units needed for an entry. so I decided to try and lift it this way.\u003C/p\u003E\u003Cp\u003EFor the record, I\u0027m surprised it even flies with that thing stuck on top.\u003C/p\u003E\n"}]}