{"TopicId":63161,"ForumId":39,"TopicTitle":"Missions to Mun and Minmus","CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-14T04:39:56Z","PageNum":1,"Articles":[{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-14T04:39:56Z","Content":"\n\u003Cp\u003E(This really happened, and I felt like making a story about it... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E)\u003C/p\u003E\u003Cp\u003ESo I was just derping around in my career save when I was like \u0022Now how am I supposed to get science?\u0022 I have been to just about every biome except badlands, which badlands are somewhat hard to get to, and aren\u0027t too rewarding. My mission to Eve failed as I tried to do it without finding an encounter, and my ships were barely getting me out of orbit. I watched some of Scott Manley\u0027s tutorials, which I tried but were no help, so I decided it was time to go to the Mun, and Minmus.\u003C/p\u003E\u003Cp\u003EI used Jebediah, since Bob was stuck in orbit trying to get to Eve, and Bill was a victim for my Time warp probe. The time warp probe\u0027s purpose was so I could use any of the timewarp speeds no matter how close my ships were to Kerbin. I *was* going to take it down, but then I realized that I didn\u0027t equip a Parachute so I would have less mass, even though parachutes are practically weightless...\u003C/p\u003E\u003Cp\u003ESo, the Mun trip was easy. Getting to the Mun was so easy, it was hard getting to Minmus because I kept getting Mun encounters. Anyway, I used one of Scott Manley\u0027s tutorial ships, but I got to the Mun in my own way. I used Scott Manley\u0027s ship, and blasted off, the trip was pretty normal, but I didn\u0027t get into the Mun\u0027s orbit like I was hoping. Just a passby. I got around 100 science, although not what I was hoping. I blasted back to Kerbin then.\u003C/p\u003E\u003Cp\u003EGetting to Minmus, on the other hand, was pretty hard. Not because it was farther out, but because I kept making a lot of stupid mistakes. It took four tries. On the first ship, I realized I was using the same ship I used for the timewarp probe. In other words, it didn\u0027t have a parachute, so I was like \u0022You know what? Screw it\u0022 and I reverted the mission. The second time, I was being really fuel inefficient and I just reverted to save time. The third time, I used timewarp x100000 and I crashed into Kerbin. Then I ragequit for an hour then went to playing Minecraft until I was ready to build some more failures. The forth time went surprisingly smoothly. I got really close to see one of Minmus\u0027 biomes, unlike with the moon. I also just got to look at Minmus up close, which was pretty cool... I had way more fuel than I needed, So I cut my orbit back to Kerbin, put all my data in the capsule, did an EVA, and I was ready to head home, being extremely careful with timewarp to prevent what happened last time. I then decoupled the capsule and was ready to head home. I would not go much faster than x1000 timewarp for over 3 seconds, and I ended up using the parachute at 5000 meters instead of 500 to prevent dying because I was so scared after my last attempts... Anyway, I landed in some highlands, right behind the mountains that you see clearly from the KSC, which was surprising.\u003C/p\u003E\u003Cp\u003EAfter that mission, I was back to having nothing to do. I got some more rocketry tech which means using the Skipper engine and 2 medium size fuel tanks, I can get to orbit easily with no problems. I decided to explore one of the monoliths near KSC and did some testing with the new engine and fuel tank. Although I forgot a decoupler on one of them and... R.I.P. Bill. Died from coming down too fast on a massive rocket that I was testing asparagus staging on, because with the 200 science I got from Minmus, I bought the better rocketry, but I also got that fueling tech where you get fuel ducts. Anyway, my asparagus staging test had a nasty result, and at the same time I had to kill Bob in my timewarp probe since there was no way to get him back anyway. And now my next mission is to try to get an encounter with another planet, and get Aerospace tech later, but I don\u0027t think I\u0027ll need it... I also might try to land on Minmus, because my Mun success went to new landing gear.\u003C/p\u003E\u003Cp\u003EThe end \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-15T02:13:55Z","Content":"\n\u003Cp\u003EActually I realized that I never really took down the time warp probe... Looks like I\u0027m unable to save Jeb from the doom of the \u0022Terminate mission\u0022 button in mission control\u003C/p\u003E\n"}]}