{"TopicId":63198,"ForumId":44,"TopicTitle":"SRB Retro-rockets for cars as an emergency braking system?","CreatedByName":"szputnyik","CreatedById":84032,"CreatedDateTime":"2014-02-14T19:10:25Z","PageNum":1,"Articles":[{"CreatedByName":"szputnyik","CreatedById":84032,"CreatedDateTime":"2014-02-14T19:10:25Z","Content":"\n\u003Cp\u003ELet\u0027s say you\u0027re driving on the highway and suddenly a traffic-stopping accident happens in front of you, or you notice a developing traffic jam too late and you\u0027re about to run into stopped or slowly moving cars. You floor the brake pedal, the tires squeal, but it\u0027s just not strong enough to stop you in time, you either underestimated your speed, the magnitude of the situation, or the accident just happened too quickly. Suddenly, two SRB rockets ignite on the front bumper of the car, quickly decelerating it and stopping the collision.\u003C/p\u003E\u003Cp\u003EWould a system like this work good for cars as an added safety measure?\u003C/p\u003E\n"},{"CreatedByName":"iamaphazael","CreatedById":49843,"CreatedDateTime":"2014-02-14T19:22:07Z","Content":"\n\u003Cp\u003EUsing an SRB would be a bad choice. Consider that once it\u0027s lit, it will burn all of its fuel until there\u0027s none left, generating thrust the whole time. As the speeds and conditions (eg the weight of occupants/cargo in the car at the time) of emergency situations are highly variable, an SRB charge might either not provide enough impulse, or provide too much and cause the car to end up moving in reverse, which could be bad. If you want a rocket-propelled safety device, a throttleable liquid fuel setup is the way to go.\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2014-02-14T19:25:46Z","Content":"\n\u003Cp\u003EWhat good is stopping if you incinerate your victims...err other drivers?\u003C/p\u003E\n"},{"CreatedByName":"John Nowak","CreatedById":67890,"CreatedDateTime":"2014-02-14T19:31:07Z","Content":"\n\u003Cp\u003EDrag chutes would seem a much safer option.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-14T20:01:12Z","Content":"\n\u003Cp\u003EYou don\u0027t stop. You make it go up. Plop a LES on top of your car and be done with it, I\u0027m sure it\u0027d be doable to make the seats detach from the rest of the vehicle, probably even in time if it activates at the same time an airbag would. Yeah you\u0027d be screwed in a tunnel, but if you\u0027re really worried about that, put a sensor or something that checks it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jordanpumah","CreatedById":47395,"CreatedDateTime":"2014-02-14T20:08:26Z","Content":"\n\u003Cp\u003Ei\u0027ve always thought the best way to stop a car dead in it\u0027s track would be like some sort of heavy duty metal pole that shoots out of the car at a certain angle so that it shoots into the ground, although going from 80 to 0 in 3 milliseconds might be a bit jarring.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-14T20:15:14Z","Content":"\n\u003Cp\u003EYeah, that\u0027s basically the same as the crash you\u0027re trying to prevent \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Except no protection from crumple zones (yours and the other guy\u0027s!). As always, making a steel cage that survives highway-impacts is relatively easy, it\u0027s the squishy humans inside that don\u0027t deal with that so well. Cars get all mangled and crushed up not because we can\u0027t make them stronger, but because the crumpling and folding is a good way to dissipate energy, much better than instantly stopping dead. Incidentally the bit around the human doesn\u0027t crumple nearly as readily, for obvious reasons.\u003C/p\u003E\u003Cp\u003EIf you are deadset on forward firing SRBs, I would calibrate them to take off say 25m/s and not trigger above speeds of 20m/s. In the case of going faster, the impact isn\u0027t averted but significantly reduced. Good enough.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-14T20:18:43Z","Content":"\n\u003Cp\u003EAny opinions on whether designing a SRB that gives a car a 10g acceleration for 250ms? Would that short of a firing duration present a design problem?\u003C/p\u003E\n"},{"CreatedByName":"SuperFastJellyfish","CreatedById":57985,"CreatedDateTime":"2014-02-14T20:24:36Z","Content":"\n\u003Cp\u003EThere are too many failures of this setup that could easily hurt innocent bystanders or yourself for this to ever be implemented. First one off the top of my head would be an SRB explodes and throws shrapnel and burning chemicals in all directions.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-14T20:25:49Z","Content":"\n\u003Cp\u003EClearly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen again, much the same might be said of the automobile itself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2014-02-14T20:39:33Z","Content":"\n\u003Cp\u003EI did some quick googling, but couldn\u0027t find an answer. What would the shelf life a booster like this be? I recall solid rockets have kind of an expiration date, but I don\u0027t know what it is with current technology.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-02-14T20:48:12Z","Content":"\n\u003Cp\u003EPutting explosives and detonators in the bumper to burn during crashes... Well, at the very least it\u0027ll justify Michael Bay movies.\u003C/p\u003E\u003Cp\u003EIt could probably work, but I think the main reason it\u0027ll never be implemented is politics. Giving people easy access to explosives will probably make a few branches of the government very nervous.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-02-14T20:53:08Z","Content":"\n\u003Cp\u003EThere are a range of problems.\u003C/p\u003E\u003Cp\u003EFirst, if you go with a retro rocket, you don\u0027t go with SRB. You go with a hybrid. Much safer, and you can control burn duration. That said, rockets are just bad for this. A typical car is about 1.5T. At highway speeds you\u0027d want to kill at least 55mph of forward speed. (That would bring you to safe collision speeds even if brakes completely fail. Otherwise, with brakes you might be able to stop fully.) Your hybrid\u0027s I\u003Csub\u003ESP\u003C/sub\u003E is going to be around 300s. That means your rocket is going to have more than 12kg of fuel. This is a) Expensive, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Presents huge risk in case you can\u0027t avoid collision.\u003C/p\u003E\u003Cp\u003EThis part can be solved. You don\u0027t actually need high I\u003Csub\u003ESP\u003C/sub\u003E here, so you can bring a bunch of inert reaction mass with you. Say, water. Water can be sprayed from the front in a way that makes it relatively safe at moderate distance. You\u0027d still need a rocket to push the water out, but it\u0027d be a much smaller rocket. Say, you have 50L of water in your retro jets. Now you can get away with less than 1kg of propellant to push it out. This can be contained even if it decides to explode. The whole system would probably add about 100kg to your car\u0027s total mass, but if it would make it significantly safer, that would be acceptable.\u003C/p\u003E\u003Cp\u003EOn to the next problem. Your tires can decelerate you at about 1g. If you are flying at 70mph, that gives you braking time of 3.2 seconds. Basically, by the time you realize that you need to brake and you can\u0027t make it, it\u0027s really too late. \u0022Lets just fire these automatically!\u0022 Alright, say I\u0027m driving on a freeway. There is a slow moving vehicle in front of me, so I\u0027m going to shift lanes. Just as I start, retro rockets fire, spin me out of control, and put me in the middle of the lane at zero speed. That\u0027s a great situation to be in on a freeway. Now, you could probably come up with some way to make this work, like use the radar, make sure closing speed is too fast to stop, \u003Cem\u003Eand\u003C/em\u003E the driver is applying full brakes. But even that might create new hazards. So it\u0027s a question of whether this can even help you in more cases than it would hurt you. Which brings me to my next point.\u003C/p\u003E\u003Cp\u003EYou are in traffic. You need to stop. You do, thanks to the retrorockets. But what about the guy behind you? Unless he has a similar system installed, he\u0027s still plowing ahead at 70mph, and probably just starting to apply brakes. And suddenly, he has a stationary car in front of him. Now he slams into you at probably higher speed than you would have slammed into somebody, drags you forward, and quite possibly pushes you into something as well as getting rear-ended himself. You\u0027ve just turned what could have been a two car collision into a pileup.\u003C/p\u003E\u003Cp\u003EIs that always going to happen? No. But the odds of such outcome increase with speed, and therefore, it\u0027s more likely than not in all of the situations where it would have a chance of saving your life, rather than just your car. And don\u0027t forget. The main purpose of all safety features is to save lives of people, not reduce damage to cars. If we worried about cars, we could just make their frames tougher. They\u0027d survive minor collisions much better. They\u0027d kill driver at higher speed collision, but even then a lot of the spare parts would be recoverable. That seems much easier than retro rockets. But again, that\u0027s just not the point.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-14T23:12:10Z","Content":"\n\u003Cp\u003EAll excellent points. A world in which cars have rockets would still be good though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne thing I don\u0027t quite understand, why do you invoke the tires and their braking capacity? The deceration due to rockets doesn\u0027t have to act through the tires, so why is their performance important?\u003C/p\u003E\n"},{"CreatedByName":"Kerbin Dallas Multipass","CreatedById":79477,"CreatedDateTime":"2014-02-14T23:30:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou are in traffic. You need to stop. You do, thanks to the retrorockets. But what about the guy behind you? Unless he has a similar system installed, he\u0027s still plowing ahead at 70mph, and probably just starting to apply brakes. And suddenly, he has a stationary car in front of him. Now he slams into you at probably higher speed than you would have slammed into somebody, drags you forward, and quite possibly pushes you into something as well as getting rear-ended himself. You\u0027ve just turned what could have been a two car collision into a pileup.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI regard this argument as invalid. You could say that about any form of braking improvement or even improved tyres with better grip. \u0022The guy behind me\u0022 is never an excuse for plowing into the car/pedestrian/obstacle in front of you.\u003C/p\u003E\u003Cp\u003ESecondly: All automatic brake assist system are designed to trigger in quite exactly the moment when a collision is unavoidable. So, without the system you would come to a sudden standstill as well, the potential pileup problem is exactly the same.\u003C/p\u003E\n"},{"CreatedByName":"panzerknoef","CreatedById":90599,"CreatedDateTime":"2014-02-14T23:42:40Z","Content":"\n\u003Cp\u003EAll I can think of with this is:\u003C/p\u003E\u003Cp\u003E(In KSP style)\u003C/p\u003E\u003Cp\u003E*Is that a traffic jam, Bob?\u003C/p\u003E\u003Cp\u003E- I don\u0027t know, it\u0027s not very clear...\u003C/p\u003E\u003Cp\u003E* Oh nooooo it is! Stop car stop!\u003C/p\u003E\u003Cp\u003E-Jeb, pull the brakes we\u0027re gonna crash!\u003C/p\u003E\u003Cp\u003E-pulls brakes-\u003C/p\u003E\u003Cp\u003E*It\u0027s not enough Bob, we wont make it!\u003C/p\u003E\u003Cp\u003E- activate the braking SRB\u0027s quickly!\u003C/p\u003E\u003Cp\u003E*Yeah!\u003C/p\u003E\u003Cp\u003E-activates SRB\u0027s car stops...-\u003C/p\u003E\u003Cp\u003E-Phew, That was close!\u003C/p\u003E\u003Cp\u003E* It sure was Bob, but... Is that smoke I see coming from the car in front of us?\u003C/p\u003E\u003Cp\u003E- Well, it looks like it...\u003C/p\u003E\u003Cp\u003E* Oh my gosh! That car is on fire! The SRB\u0027s must\u0027ve torched it!\u003C/p\u003E\u003Cp\u003E- Darn, run Jeb, Ruuuuunnn!!!\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EThe News: Hundreds die, many more wounded due to devastating traffic jam fire. Cause unknown.\u003C/p\u003E\u003Cp\u003ESo far the cutting edge braking technology.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2014-02-15T00:43:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzerknoef\u0022 data-cite=\u0022panzerknoef\u0022\u003E\u003Cdiv\u003E* Oh my gosh! That car is on fire! The SRB\u0027s must\u0027ve torched it!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, the plume from the SRB\u0027s is going to be a significant problem. And the exhaust is generally... neither pleasant or healthy.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-02-15T01:38:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbin Dallas Multipass\u0022 data-cite=\u0022Kerbin Dallas Multipass\u0022\u003E\u003Cdiv\u003EI regard this argument as invalid. You could say that about any form of braking improvement or even improved tyres with better grip. \u0022The guy behind me\u0022 is never an excuse for plowing into the car/pedestrian/obstacle in front of you.\u003Cp\u003ESecondly: All automatic brake assist system are designed to trigger in quite exactly the moment when a collision is unavoidable. So, without the system you would come to a sudden standstill as well, the potential pileup problem is exactly the same.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u003Cem\u003Eonly\u003C/em\u003E improvements on the market currently that allow you to brake faster than the car behind you are spikes and chains. Everything else just removes the driver error. As well as both of these are useful only in limited situations, ones where people tend to drive very differently to begin with, and come with limitations and/or requirements to carry a clear sign identifying such a feature on your car in many jurisdictions. And this is for the precise reason that such cars can stop better than somebody behind them.\u003C/p\u003E\u003Cp\u003EFurthermore, even if we consider systems like ABS actual assists, despite the fact that a skilled driver can stop just as well or better, they are, generally, incremental improvements. You might say that going from .3g to .9g is a lot, but it\u0027s nothing like going from .9g to 5g. Not only is the increment higher, the reaction time is also reduced dramatically. Which means that it is plain impossible for a driver behind you to stop unless they are driving half a football field behind you.\u003C/p\u003E\u003Cp\u003EFinally, there is the question of velocity difference. Say I\u0027m driving without ABS with someone who is driving with one. I drive only 2s behind at highway speeds. Say, 70mph. Person in front of me slams the brakes. He decelerates at .9g. I slam my brakes .5s later and decelerate at .3g. Car in front of me has time to stop, and I slam into the back going 43mph. Given that it\u0027s an impact into a car of similar mass, my car is trashed, but I\u0027m completely unharmed, save for a bruise from the airbag.\u003C/p\u003E\u003Cp\u003EOr, lets say, I\u0027m completely careless, and I ride the guy\u0027s bumper just .5s behind. In that scenario, assuming I\u0027m a careless driver, collision happens just 2s after he began braking. But he doesn\u0027t have time to slow down all the way, and I still slam into him at only 31mph of relative velocity. No matter how things go from there on, I\u0027m fine. And so are people further behind.\u003C/p\u003E\u003Cp\u003ENow, lets suppose that instead of braking at .9g, the car in front suddenly pulls a 5G maneuver. In the .5s scenario above, even braking at .9g, I slam into car in front still going 63mph. Ever seen a collision at 63mph? Or the aftermath. I\u0027d be lucky to survive that, and even that, only if car in front of me is of similar mass. Passengers in that car would also be lucky to live through this collision. (If I\u0027m driving a semi, they\u0027re all dead.) At 2s, lead, provided nothing goes wrong, I have time to stop. But given a 2s lead, the front car would also be able to stop safely, and everyone would be fine.\u003C/p\u003E\u003Cp\u003ETo put it in simplest terms, it is generally going to be safer for the front car to crash then slow that abruptly if other cars on the road don\u0027t have similar capability.\u003C/p\u003E\u003Cp\u003EFinally, it is almost impossible to say what actually is an inevitable collision. If a car 1s in front of me slams into a concrete block and stops instantly, I can still swerve around it. In many cases, it\u0027s going to be \u003Cem\u003Eway\u003C/em\u003E safer than stopping. At .5s I can still swerve around if I already began the maneuver. To come to a stop from 70mph in less than .5s, the car would have to undergo acceleration of over 6g. That\u0027s assuming that there is zero lag in firing the engines, which is not going to be true. So realistically, we\u0027d be looking at what, 7-8g? That gives a stopping distance of about 12m. That\u0027s about the length of the impact absorbing barriers on the freeway. Ever seen a car ram into these? It\u0027s survivable. That\u0027s kind of the point. But the car\u0027s trashed. And that\u0027s with impact distributed over the entire front of the car. Now you want that load to be focused on just the rockets. So just what sort of a frame are you planning to attach these to?\u003C/p\u003E\u003Cp\u003ESo we have to consider lower deceleration rates. Something like 4-5g should be doable. But this requires predicting inevitable collision more than a second ahead. How does the system know if I\u0027m planning to swerve? If it\u0027s safe to swerve? If swerving or braking is more likely to get me killed? Am I even alert enough to react this fast? Guess wrong, and the system kills the driver who would have otherwise escaped the collision. Now, being useless is one thing. When the system designed to protect actually causes deaths, and fairly frequently, that\u0027s a very bad system.\u003C/p\u003E\u003Cp\u003EThe only way to use retro-rockets as an actual safety feature is that all cars are operated by AI linked into a swarm that can coordinate traffic. Then, in the worst case scenario, such a system would be in position to decide if it\u0027s prudent to fire retro-rockets. But I suspect, with such a system in place, need for this would be very rare.\u003C/p\u003E\n"},{"CreatedByName":"UnthinkableThinker","CreatedById":83885,"CreatedDateTime":"2014-02-15T01:53:54Z","Content":"\n\u003Cp\u003ESure, you can strap on SRBs to stop a car, but what about the people inside the car itself? Inertia. Airbags, bumpers, all are made to increase the time of the contact, that\u0027s what keeps the passengers alive (or at least tries to) inside the car during a collision. I believe the best way to avoid crashes, especially high speed crashes such as in highways, are what I call \u0022Intelligent highways\u0022, and they must work along cars, to detect a recent collision and once the car is located in that radius (let\u0027s say a 1km radius), the system fires and reduces the speed of all of the cars in that area, very similar to the Yellow Flag we see on races, except this will all be done through computer systems and automatically, so basically the car will slow itself down, whether the driver wants it or not.\u003C/p\u003E\n"},{"CreatedByName":"Drunken Hobo","CreatedById":52000,"CreatedDateTime":"2014-02-15T02:20:31Z","Content":"\n\u003Cp\u003EImagine Alfa Romeo made one...\u003C/p\u003E\n"},{"CreatedByName":"Justy","CreatedById":69055,"CreatedDateTime":"2014-02-15T02:57:10Z","Content":"\n\u003Cp\u003EI read a novel in the early 1990\u0027s about a supertanker collision, oil spill, and firestorm off the coast of British Columbia. It was, shall we say, not the greatest piece of literature ever penned by man. But as a last-ditch measure to try to avoid the collision, the novel\u0027s brand new top of the line bigger than ever supertanker did feature emergency braking rockets to try to bring its stopping distance down to something reasonable. (of course, it wasn\u0027t enough. It\u0027d be a short novel if it was.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunken Hobo\u0022 data-cite=\u0022Drunken Hobo\u0022\u003E\u003Cdiv\u003EImagine Alfa Romeo made one...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESafest rocket ever... the ignition will never work! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbin Dallas Multipass","CreatedById":79477,"CreatedDateTime":"2014-02-15T03:34:37Z","Content":"\n\u003Cp\u003ELet\u0027s make one thing clear: A computer would have to detect imminent impact and this detection mechanism would have to be foolproof and 99.9% reliable. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ridS396W2BY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ESentences quoted in quotes are quoted from K^2\u003C/p\u003E\u003Cp\u003E\u0022Which means that it is plain impossible for a driver behind you to stop unless they are driving half a football field behind you.\u0022\u003C/p\u003E\u003Cp\u003EHalf a (american) football field is 50 yards, is that correct? That\u0027s 45m\u003C/p\u003E\u003Cp\u003E\u0022Finally, there is the question of velocity difference. Say I\u0027m driving without ABS with someone who is driving with one. I drive only 2s behind at highway speeds. Say, 70mph.\u0022\u003C/p\u003E\u003Cp\u003E2s at 70mph is 62 meters. Assuming 1 shock second until your foot is on the brake pedal you have less than half a football field to come to a stop or you crash. Fact of life, sorry.\u003C/p\u003E\u003Cp\u003EI do not see the problem keeping a 45m distance to the car in front of me. Half a football field is not that much in a car.\u003C/p\u003E\u003Cp\u003E\u0022I ride the guy\u0027s bumper just .5s behind.\u0022\u003C/p\u003E\u003Cp\u003EAre we still at 70mph? Thats a distance of 15m. One would describe it as one car length. At this speed this is roadrage.\u003C/p\u003E\u003Cp\u003E\u0022Finally, it is almost impossible to say what actually is an inevitable collision. If a car 1s in front of me slams into a concrete block and stops instantly, I can still swerve around it.\u0022\u003C/p\u003E\u003Cp\u003EThe point where you can still swerve around things can be defined by physics. We are debating a hypothetical rocket decelerator which, unlike automatic wheel braking, does not rely on wheel to ground friction but has a predictable deceleration force in any condition.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-15T03:58:51Z\u0022 title=\u002202/15/2014 03:58  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 15, 2014\u003C/time\u003E by Kerbin Dallas Multipass\u003C/strong\u003E\n\u003Cbr\u003E-since\n\u003C/span\u003E\n"},{"CreatedByName":"FanaticalFighter","CreatedById":77314,"CreatedDateTime":"2014-02-15T04:24:08Z","Content":"\n\u003Cp\u003EThat idea can only come from KSP players xD.\u003C/p\u003E\u003Cp\u003ENo, it\u0027ll be a bad way to stop a car. Not just SRBs, but any type of rocket. For one, rocket exhaust velocities have to be enormous, and I mean REALLY enormous. You\u0027d kill the guys in front of you a lot faster than an accident would.\u003C/p\u003E\n"},{"CreatedByName":"Kerbin Dallas Multipass","CreatedById":79477,"CreatedDateTime":"2014-02-15T05:36:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FanaticalFighter\u0022 data-cite=\u0022FanaticalFighter\u0022\u003E\u003Cdiv\u003EThat idea can only come from KSP players xD.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWalk up to a stranger and ask that person what he/she thinks about an explosive charge stored in their steering wheel which will explode directly in their face in case of an accident. It\u0027s safe because there is a 0.08 mm membrane separating you from the explosion.\u003C/p\u003E\u003Cp\u003EAnd.. yes, if it blows up spontaneously it can kill you or will break your arms. It will definitely break your thumbs.\u003C/p\u003E\u003Cp\u003EMost of us do have cars with airbags.\u003C/p\u003E\n"},{"CreatedByName":"FanaticalFighter","CreatedById":77314,"CreatedDateTime":"2014-02-15T09:24:20Z","Content":"\n\u003Cp\u003E(Actually, in India, Airbags are still not that common)\u003C/p\u003E\n"}]}