{"TopicId":63400,"ForumId":15,"TopicTitle":"[SOLVED] Texture show in Unity but invisible in KSP","CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2014-02-16T18:24:00Z","PageNum":1,"Articles":[{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2014-02-16T18:24:00Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI am missing something for sure, if I import a texture and set the material in Unity like ksp/diffuse all is right, but in game it appear as it would have wrong normal ( some faces are invisible ), while exporting the model with no UVmap from blender show correct in game ( but of course with no texture )\u003C/p\u003E\u003Cp\u003EWhat am I doing wrong?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-18T18:18:13Z\u0022 title=\u002202/18/2014 06:18  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 18, 2014\u003C/time\u003E by brusura\u003C/strong\u003E\n\u003Cbr\u003Erewrote it...\n\u003C/span\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2014-02-17T22:12:19Z","Content":"\n\u003Cp\u003ESooo trying to narrow down the problem I made a simple cylinder 10 meters long and 2 meters large, mapped every faces of it then imported in unity and then in ksp all is working fine, what I see is that with my original model I see two materials in unity when in blender I got only one, why is that? Can I get rid of it somehow? I guess that is what causing the problem.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hG8RwlX.png\u0022 alt=\u0022hG8RwlX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RsqiWuG.png\u0022 alt=\u0022RsqiWuG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI got the mk2 model using a plugin for blender made by taniwha \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43513-Blender-mu-import-export-addon\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/43513-Blender-mu-import-export-addon\u003C/a\u003E , maybe something dirty left behind during the import?\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-02-17T23:15:55Z","Content":"\n\u003Cp\u003EWhat are your material import settings in Unity? They should be on the first tab of the inspector when you click on the \u0022mk2bay\u0022 file in your Assets/mk2bay folder. You can try changing the settings or turning off import materials and see what happens.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-02-18T01:48:32Z","Content":"\n\u003Cp\u003EYou can get rid of one in Unity just be changing size to 1 under Mesh Renderer -\u0026gt; Materials\u003C/p\u003E\u003Cp\u003ESize is how big the material list is (2 elements) \u003C/p\u003E\u003Cp\u003EThe second one will be deleted so change the first one as needed (suggest KSP/Bumped Specular based on your current choices)\u003C/p\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2014-02-18T15:15:56Z","Content":"\n\u003Cp\u003EThink I got it, my model has 3 meshes, for testing purpose I had partially unwrap only one of these meshes, for his mesh some faces were not texturized at all, so when importing, unity see one mesh with UVmap data but not for all faces of the mesh so unity create a new material out of nowhere for the faces with no UVmap.\u003C/p\u003E\u003Cp\u003ESo I went back in blender unwrapped all the faces for the mesh and now unity import only one material as intended and in ksp the model is showing correct and texturized\u003C/p\u003E\n"},{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2014-02-25T02:22:53Z","Content":"\n\u003Cp\u003EDoes anyone know how to get multiple textures in one mesh? For me, Unity makes moar materials when scared, so I end up having a ship full of materials and most not showing because KSP is KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2014-03-03T21:52:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Naten\u0022 data-cite=\u0022Naten\u0022\u003E\u003Cdiv\u003EDoes anyone know how to get multiple textures in one mesh? For me, Unity makes moar materials when scared, so I end up having a ship full of materials and most not showing because KSP is KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou need to separate out the mesh that you are applying the other materials too. I just found out the hard way my self that KSP only allows one material per mesh. For instance, the outside of my Carrier hull and the doors are all fine in KSP but the inside was still part of the main mesh and I added a separate material so I could use a whole new sheet for the inside. That works fine everywhere else but KSP. I had to separate the inside mesh from the outside using \u003Cem\u003Eseparate by selection\u003C/em\u003E in Blender. Then I was able to use another sheet and not have invisible cargo bay. The Hotkey is \u0022P\u0022 in edit mode.\u003C/p\u003E\n"}]}