{"TopicId":63413,"ForumId":16,"TopicTitle":"Tips on how to go interplanetary!","CreatedByName":"Disco","CreatedById":98549,"CreatedDateTime":"2014-02-16T19:48:00Z","PageNum":1,"Articles":[{"CreatedByName":"Disco","CreatedById":98549,"CreatedDateTime":"2014-02-16T19:48:00Z","Content":"\n\u003Cp\u003EIve been wondering how nooby I am that I havent even gone to other planets yet... The thing is, I cant come up with a rocket for interplanetary space travel.\u003C/p\u003E\u003Cp\u003ECould you sent me some good designs (that can lift a decent load I want to make a base on Duna) KWrocketry rockets would be even better!\u003C/p\u003E\u003Cp\u003EThanks for reading!\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-16T20:10:53Z","Content":"\n\u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E will help you plan your missions. \u003Ca href=\u0022http://alterbaron.github.io/ksp_aerocalc/\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E will help if your destination has an atmosphere. And here\u0027s a \u003Ca href=\u0022http://i.imgur.com/IV8rzue.png\u0022 rel=\u0022external nofollow\u0022\u003Econvenient dV map\u003C/a\u003E. for help with how much to get there. Now, for interplanetary, it\u0027s best to build in orbit so that you are not really limited by size, but if you build bigger I suggest getting \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/53134-Kerbal-Attachment-System-%28KAS%29-0-4-5-Struts-pipes-part-containers-and-more-%280-23%29?highlight=Kerbal\u002BAttachment\u002BSystem\u0022 rel=\u0022external nofollow\u0022\u003EKAS\u003C/a\u003E so that you can add Struts on EVA.\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-02-16T20:17:05Z","Content":"\n\u003Cp\u003EI\u0027m gonna get ninja\u0027d on this post anyway...so be it. Interplanetary is pretty much a function of \u0022what do you want to do first\u0022.\u003C/p\u003E\u003Cp\u003EWhat you might try is a combination craft - do two or three launches and dock them in orbit. Have one for the transfer stage, one as the lander/excursion module, and possibly a supply stage for extra fuel if you think you need it. Here\u0027s a good method for building a transfer stage -\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/QzzzR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EYou can also do it in one big thwack, though by necessity that means building bigger rockets. I sent these off to Duna after doing a number of tests on MÃƒÂ¼n for a challenge:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/aeEWF\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo what exactly would you like to do first?\u003C/p\u003E\u003Cp\u003EEDIT: Yep. Ninja\u0027d. Taki117 has given you the tools you need to do planning for interplanetary missions; hopefully my first imgur album will be of some use as well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-16T20:19:15Z\u0022 title=\u002202/16/2014 08:19  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 16, 2014\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2014-02-16T22:16:55Z","Content":"\n\u003Cp\u003EFor your first trip, anything that large is overengineered. Use only one LV-N and make a much smaller lander for one Kerbal.\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2014-02-17T02:10:58Z","Content":"\n\u003Cp\u003EIf it\u0027s your first trip...\u003C/p\u003E\u003Cp\u003EAn FL800 with an LV-N is capable of doing a Duna flyby if you can get it into LKO first.\u003C/p\u003E\n"},{"CreatedByName":"Disco","CreatedById":98549,"CreatedDateTime":"2014-02-23T18:59:08Z","Content":"\n\u003Cp\u003EAll I want to do is get a lander to duna, then I want to make a base there.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-02-23T19:27:56Z","Content":"\n\u003Cp\u003EI suggest unmanned probes/rovers first, to get the hang of it. Then go and do it with Kerbals. If you are up to it. For some reason, I am attached to the darn things and I would never send them interplanetary without a \u003Cem\u003Ereal\u003C/em\u003E ship, multipart, quite large.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-02-23T19:38:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Disco\u0022 data-cite=\u0022Disco\u0022\u003E\u003Cdiv\u003EAll I want to do is get a lander to duna, then I want to make a base there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, build a lander with about 2500-3000m/s in the tank. You need about 1500m/s to get back up off Duna and, if you have \u0022enough\u0022 parachutes (see below), 500-1000m/s to land because the engines have to burn a lot until all the chutes open, and then some at the end, too. You also need enough thrust so TWR \u0026gt;1 on Duna (use Kerbal Engineer Redux for that), and \u0022enough\u0022 parachutes (use the Parachute Calculator website for that). Almost all of Duna\u0027s surface is about 2500m so \u0022enough\u0022 parachutes is when they\u0027ll have you hitting the ground at about 10-20m/s, which is enough for your engines to stop you at the last moment. If you land at lower elevation, you\u0027re even better off.\u003C/p\u003E\u003Cp\u003EOh, and build the lander low and wide. There\u0027s hardly any flat ground on Duna so expect to land on a steep hillside.\u003C/p\u003E\u003Cp\u003ENow you need a transfer stage to get the lander to and from Duna. Assuming you aerocapture at both ends of the trip, allow about 1500m/s to get to Duna and about 1200m/s to get back home. Call it an even 3000m/s in the transfer stage (while pushing the lander) to be totally safe.\u003C/p\u003E\u003Cp\u003EThen you need to get the lander and the transfer stage into LKO, either in 1 piece or launched separately and docked in orbit. Basically a function of how big a lifter you want to deal with.\u003C/p\u003E\u003Cp\u003EThat\u0027s pretty much it in terms of ship design. As for navigation, if you can get to Mun you can get to Duna. There\u0027s only the added complication of having to wait for a launch window and putting the ejection node in the right place on your orbit around Kerbin. As for aerocapturing, get just inside the orbit of Ike or Mun (depending on where), quicksave, and put your Pe at your best guess of what you need. Then see what happens and if it doesn\u0027t work out, F9, change the Pe up or down a bit, and try again. 11-12km usually works for Duna, 35-40km usually work for Kerbin.\u003C/p\u003E\u003Cp\u003EThe above aerocapture altitudes assume you\u0027re trying to get into low orbit and will land later. This isn\u0027t necessary at Kerbin; the air is thick enough you can set your Pe at 20km and come straight in for a landing. But this usually isn\u0027t a good idea at Duna. For your 1st Duna landing, aerocapture into an orbit below 100km and burn it down to about 50km circularized. Then do your de-orbit burn to hit somewhere no less than 1/4 of the way around Duna from where you do the burn. You\u0027ll land about 1 finger\u0027s width west of that point if you have the map view zoomed in all the way when you do this. Pop drogues early, pop mains early, and you\u0027ll also have to burn at fairly high throttle most of the way until the mains fully deploy. It\u0027s a bit disconcerting because you\u0027re screaming along at very high speed and fairly low altitude but it works.\u003C/p\u003E\u003Cp\u003EGood luck.\u003C/p\u003E\n"},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-02-24T03:19:57Z","Content":"\n\u003Cp\u003EYou will want to look at this site\u0027http://flyonbudget.onegiantleap.info/chapter8.html#aerobraking\u003C/p\u003E\u003Cp\u003EHelped me in my missions big time. You also really need kerbal engineer. The delta-V readouts are super important\u003C/p\u003E\n"},{"CreatedByName":"Guapo","CreatedById":33162,"CreatedDateTime":"2014-02-24T21:15:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003E\u0022Long live the Confederation\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHah. Why am I not surprised an old EV hand would be doing impossible things around the KSP forums? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-02-24T22:03:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Guapo\u0022 data-cite=\u0022Guapo\u0022\u003E\u003Cdiv\u003EHah. Why am I not surprised an old EV hand would be doing impossible things around the KSP forums? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure I follow...that quote\u0027s intended as a reference to the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EWing Commander\u003C/span\u003E novel \u0022Action Stations\u0022 by William R. Forstchen. I have done \u003Ca href=\u0022http://www.lulu.com/spotlight/capi3101?searchTerms=\u0026amp;pageOffset=1\u0022 rel=\u0022external nofollow\u0022\u003Ea thing or two\u003C/a\u003E related to \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EWing Commander\u003C/span\u003E before, though unofficially. \u003C/p\u003E\u003Cp\u003EI wouldn\u0027t necessarily say I do impossible things, either. Improbable perhaps.\u003C/p\u003E\u003Cp\u003E(Bill\u0027s standby quote in my save game is, of course, a reference to the Enya song \u0022Orinoco Flow\u0022, which was arguably one of the most annoying pieces of music ever written IMHO. I don\u0027t think it shows up in the Constipation XI mission report I posted previously though.)\u003C/p\u003E\u003Cp\u003EI digress from the topic, of course. Apologies to all.\u003C/p\u003E\u003Cp\u003EGeschosskopf\u0027s advice is sound; a lander with 2500-3000 m/s of delta-V and at least three kN of thrust per tonne is what you need (preferably you\u0027d want closer to five kN per tonne but you can still take off with three). With that basic transfer stage I posted previously (the BZ-52 \u0022tutorial\u0022), you could easily make a Duna round-trip with a lander weighing up to 58 tonnes and with a comfortable margin for error. Put RCS on your lander, launch the transfer stage and lander seperately, dock them in Kerbin orbit and off you go. Of cours, that\u0027s just one way of doing it; you could just as easily incorporate all the elements into a single launch.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-24T22:11:52Z\u0022 title=\u002202/24/2014 10:11  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 24, 2014\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"}]}