{"TopicId":63456,"ForumId":36,"TopicTitle":"What\u0026#039;s wrong with my part?","CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-17T05:05:12Z","PageNum":1,"Articles":[{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-17T05:05:12Z","Content":"\n\u003Cp\u003EIt looks like it has its own light shining on it. The texture is just light gray and black, so it shouldn\u0027t be from that. I\u0027m using the KSP diffuse shader and the texture is exported as a .tga compressed, but I got the same results with a .mbm. Is this because I haven\u0027t included a normal map?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/3282299796684959489/102CB96836B4BDBE4343F0C476983F37BC1BE016/\u0022 alt=\u0022102CB96836B4BDBE4343F0C476983F37BC1BE016\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Razorcane","CreatedById":66919,"CreatedDateTime":"2014-02-17T05:59:37Z","Content":"\n\u003Cp\u003EWhat 3D program do you use?\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-17T06:47:01Z","Content":"\n\u003Cp\u003EI use Blender.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-02-17T06:51:16Z","Content":"\n\u003Cp\u003EI think it might be Unity in this case, is the shader set to Diffuse instead of KSP\\Diffuse?\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-17T12:58:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoMrBond\u0022 data-cite=\u0022NoMrBond\u0022\u003E\u003Cdiv\u003EI think it might be Unity in this case, is the shader set to Diffuse instead of KSP\\Diffuse?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I\u0027m certain it\u0027s set to KSP\\Diffuse. Now that I\u0027ve got the process down, I\u0027ll make a new part from start to finish. Maybe I mucked something up while I was trying to get it to work.\u003C/p\u003E\n"},{"CreatedByName":"SasquatchM","CreatedById":11888,"CreatedDateTime":"2014-02-17T13:46:17Z","Content":"\n\u003Cp\u003EIs the edge split not set up correctly?\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-17T14:04:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SasquatchM\u0022 data-cite=\u0022SasquatchM\u0022\u003E\u003Cdiv\u003EIs the edge split not set up correctly?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s possible since I don\u0027t know what that is, haha. How do I set it up correctly?\u003C/p\u003E\n"},{"CreatedByName":"Lumicide","CreatedById":83042,"CreatedDateTime":"2014-02-17T15:17:05Z","Content":"\n\u003Cp\u003EDid you export as .obj, or .fbx? I noticed those sorts of shading issues in Unity with .obj exports, but they weren\u0027t there in .fbx.\u003C/p\u003E\n"},{"CreatedByName":"Porkjet","CreatedById":92433,"CreatedDateTime":"2014-02-17T15:50:41Z","Content":"\n\u003Cp\u003EIs the tip still bright outside the VAB or if you rotate it around?\u003C/p\u003E\u003Cp\u003ETo me it looks like a shading thing, which is quite a problem on cones. The shading smooths over the tip of the cone and tries to make it look round. Which is why your tip is bright, the light source in the VAB comes from above. You can\u0027t even do edgebreaks on cone tips since you just want a shading break in the tip and I don\u0027t know if any program can do this on a single point. You can work around this by adding a ring of lines close to the tip, this will move the rounded shading way up to the tip and the rest of the cone should look OK. So its best you make the tip slightly \u0027blunt\u0027. Another way is to let the whole thing as it is and add a normal map to force the shading to look like a cone, if you know how to do that.\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-17T15:53:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lumicide\u0022 data-cite=\u0022Lumicide\u0022\u003E\u003Cdiv\u003EDid you export as .obj, or .fbx? I noticed those sorts of shading issues in Unity with .obj exports, but they weren\u0027t there in .fbx.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI saved it from Blender as a .blend straight into the Unity assets folder.\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-17T16:02:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Porkjet\u0022 data-cite=\u0022Porkjet\u0022\u003E\u003Cdiv\u003EIs the tip still bright outside the VAB or if you rotate it around?\u003Cp\u003ETo me it looks like a shading thing, which is quite a problem on cones. The shading smooths over the tip of the cone and tries to make it look round. Which is why your tip is bright, the light source in the VAB comes from above. You can\u0027t even do edgebreaks on cone tips since you just want a shading break in the tip and I don\u0027t know if any program can do this on a single point. You can work around this by adding a ring of lines close to the tip, this will move the rounded shading way up to the tip and the rest of the cone should look OK. So its best you make the tip slightly \u0027blunt\u0027. Another way is to let the whole thing as it is and add a normal map to force the shading to look like a cone, if you know how to do that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, it\u0027s like that from multiple angles. No, I don\u0027t know how to do a normal map. I\u0027ll try a cylinder and see if the lighting is different. Thanks for the insight.\u003C/p\u003E\u003Cp\u003EDo you have a link to a simple normal mapping tutorial using Blender?\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-02-17T19:46:58Z","Content":"\n\u003Cp\u003ETry going to object mode\u003C/p\u003E\u003Cp\u003ESelect all\u003C/p\u003E\u003Cp\u003Eset [shade Smooth]\u003C/p\u003E\u003Cp\u003Eadd Modifier\u0026gt;Edge Spilt\u0026gt;Apply\u003C/p\u003E\u003Cp\u003EModifier is the small blue spanner, usually on the right panel\u003C/p\u003E\n"},{"CreatedByName":"Razorcane","CreatedById":66919,"CreatedDateTime":"2014-02-17T19:54:51Z","Content":"\n\u003Cp\u003EDoes Blender have smoothing groups? That would probably fix the issue. Edge Split sounds a little dodgy, as if it actually splits edges, which causes lots of problems when you triangulate.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-02-17T22:59:04Z","Content":"\n\u003Cp\u003EYou can set smooth/flat shading per vertex (or is it per face?) in Blender if you like, I found that level of manual minutiae just excruciating\u003C/p\u003E\u003Cp\u003EThe Edge Split modifier isn\u0027t too bad though, it doesn\u0027t split everything, you can set custom tolerances for when an edge gets split before applying\u003C/p\u003E\u003Cp\u003EUnity also does mesh optimisation on import which I haven\u0027t run into any troubles with yet (that where not of my own making)\u003C/p\u003E\n"},{"CreatedByName":"Razorcane","CreatedById":66919,"CreatedDateTime":"2014-02-18T01:41:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoMrBond\u0022 data-cite=\u0022NoMrBond\u0022\u003E\u003Cdiv\u003EYou can set smooth/flat shading per vertex (or is it per face?) in Blender if you like, I found that level of manual minutiae just excruciating\u003Cp\u003EThe Edge Split modifier isn\u0027t too bad though, it doesn\u0027t split everything, you can set custom tolerances for when an edge gets split before applying\u003C/p\u003E\u003Cp\u003EUnity also does mesh optimisation on import which I haven\u0027t run into any troubles with yet (that where not of my own making)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea that sounds like a bad thing in my line of work, since I work with mainly high-poly meshes(100k\u002B) I can\u0027t believe that Blender, being as feature filled as it is, lacks a set of smoothing groups for meshes. It\u0027s probably the most handy tool in my work, and it amazes me that it lacks that. It also sounds like a bad thing for games as well, as splitting edges doubles vertices, which uses more resources. It also presents problems when unwrapping meshes and painting them in external programs like MARI, where you paint directly on the mesh.\u003C/p\u003E\u003Cp\u003EAs for the OP, I suggest switching to something like 3DS Max or Maya. Both of those are industry standard tools and you\u0027ll get everything you need to keep things like this from happening. I really have no place making comments in this thread though, as I am partially biased because of my involvement in said industry. I\u0027m sure Blender is a very powerful tool, but it has some pretty barbaric methods of solving problems like these, which I find troublesome. There might be scripts that allow for better smoothing options though, so you might want to try those.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-02-18T02:01:49Z","Content":"\n\u003Cp\u003EThere could certainly be better ways of handling it in Blender that I\u0027m simply not aware of, my knowledge of Blender could charitably be described, at best, as poor, although I enjoy experimenting with it as time permits\u003C/p\u003E\u003Cp\u003EBlender is also free, so comparing its feature-set to something like Maya, which starts at ~$800 USD, well I\u0027m sure you\u0027re getting a lot of features for your $800, but it\u0027s tough to beat the features-per-dollar ratio when the dollars are zero. There are plenty of custom scripts and help for Blender through its community, I should really find one for adjusting origin orientation to help with animations.\u003C/p\u003E\u003Cp\u003EI don\u0027t know why you would run Blenders ES-Modify before unwrapping, that\u0027d be torture (UV unwrapping is already torturous at the best of times to start with). It should be the last thing you do before loading it up in Unity (according to what I\u0027ve read/seen so far anyway).\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-18T04:40:20Z","Content":"\n\u003Cp\u003EYeah, my budget for messing around and modding KSP is exactly $0. I\u0027m going to keep messing around in Blender. I tried a cylinder with the same results.\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-02-18T23:18:46Z","Content":"\n\u003Cp\u003EOkay, this looks better. I think it would help if I just had a more detailed texture, but it\u0027s normal mapped now and it takes shadows just fine. Time to make something more complicated!\u003C/p\u003E\u003Cp\u003EThanks to everyone who offered advice and suggestions.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/3282299796727388248/F960E19D12D490CCB1CBD6A995ADB1B27098EDB4/\u0022 alt=\u0022F960E19D12D490CCB1CBD6A995ADB1B27098EDB4\u0022\u003E\u003C/p\u003E\n"}]}