{"TopicId":63499,"ForumId":55,"TopicTitle":"Advanced graphics settings","CreatedByName":"I2Y","CreatedById":62009,"CreatedDateTime":"2014-02-17T17:28:58Z","PageNum":1,"Articles":[{"CreatedByName":"I2Y","CreatedById":62009,"CreatedDateTime":"2014-02-17T17:28:58Z","Content":"\n\u003Cp\u003EHello SQUAD!\u003C/p\u003E\u003Cp\u003EIs there any plans to implement more transparent advanced render settings but not just \u0022simple\u0022, \u0022good\u0022, \u0022fantastic\u0022 etc? It would be great to have an options to use \u0022low settings\u0022 but with shadows/anisotropic filtering enabled for integrated graphics. Is there any plans to implement FXAA in game? I use injector currently and it works great. But I\u0027m not very happy with the fact that FXAA injector also applies to UI. I would be superb to use FXAA with everything except UI layer... is that possible?\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-02-17T18:57:44Z","Content":"\n\u003Cp\u003EDo we have a config file? If we do, it should give you enough of what you ask for.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-02-17T19:04:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022coolitic\u0022 data-cite=\u0022coolitic\u0022\u003E\u003Cdiv\u003EDo we have a config file? If we do, it should give you enough of what you ask for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe do, but it doesn\u0027t address the FXAA issues and it isn\u0027t really a good alternative to a more complete settings menu. Most people probably don\u0027t know about, or want to hassle with, the settings.cfg file (most people probably won\u0027t even be able to open it). \u003C/p\u003E\u003Cp\u003EAnd having a specific setting for ocean terrain would make a world of difference in how well the game runs for many people. Most computers can handle the solid-ground terrain settings at default or high, but the ocean terrain levels screw everything up and require a work-around to get good performance at high terrain settings.\u003C/p\u003E\n"},{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2014-02-17T19:32:13Z","Content":"\n\u003Cp\u003EI agree, working with laptops isnt very nice when combined with KSP (laggg)\u003C/p\u003E\n"},{"CreatedByName":"I2Y","CreatedById":62009,"CreatedDateTime":"2014-02-18T02:00:08Z","Content":"\n\u003Cp\u003EI do know about config file. And I already made custom terrain setting which is a mix of \u0022default\u0022 poly count and \u0022low\u0022 view range. It resulted in quite good performance boost on Intel HD Graphics 3000 and same terrain details as on default settings with the shorter range of view.\u003C/p\u003E\u003Cp\u003EI was talking about this settings \u003Ca href=\u0022http://docs.unity3d.com/Documentation/Components/class-QualitySettings.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://docs.unity3d.com/Documentation/Components/class-QualitySettings.html\u003C/a\u003E Is there any way to create my own quality preset and use it in game?\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2014-02-18T03:03:13Z","Content":"\n\u003Cp\u003EI wouldn\u0027t doubt that there are some plans to make better settings but I don\u0027t think they are really high on the list.\u003C/p\u003E\n"},{"CreatedByName":"austincurr","CreatedById":31939,"CreatedDateTime":"2014-02-18T12:01:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022leax256\u0022 data-cite=\u0022leax256\u0022\u003E\u003Cdiv\u003EI wouldn\u0027t doubt that there are some plans to make better settings but I don\u0027t think they are really high on the list.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut if it can produce big performance improvements for some people...\u003C/p\u003E\n"}]}