{"TopicId":63551,"ForumId":16,"TopicTitle":"Fuel lift for orbital refuel station.","CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-02-18T03:23:06Z","PageNum":1,"Articles":[{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-02-18T03:23:06Z","Content":"\n\u003Cp\u003EHi I am looking for any ideas how to make a rocket that can lift 3 Rockomax X200-32 Fuel Tank put together up to 200,000 m orbit where my refuel station is around kerbin. \u003C/p\u003E\u003Cp\u003Ethank you for any ideas.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2014-02-18T03:45:36Z","Content":"\n\u003Cp\u003EYou might want to do it with a few separate launches to make it easier. I usually do that instead of taking twice as long to make something to do it in one launch.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-18T03:57:53Z","Content":"\n\u003Cp\u003EThat payload is quite nice, because you still have a lot of options how to get it into orbit. With 4-5 fuel tanks, you would already require a lot of boosters or excessive asparagus staging, because the stock engines are not powerful enough.\u003C/p\u003E\u003Cp\u003EFor example, my heavy lifter should be able to get the fuel tanks (and a docking port and the parts required for docking) to a rendezvous at 200 km orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/tanker_launch.jpg\u0022 alt=\u0022tanker_launch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBasically there are four boosters in asparagus configuration, five Mainsail engines, some radial engines, and a lot of fuel. Here is another picture of the \u003Ca href=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/raketti.jpg\u0022 rel=\u0022external nofollow\u0022\u003Elifter after booster separation\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2014-02-18T04:02:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Billyk88\u0022 data-cite=\u0022Billyk88\u0022\u003E\u003Cdiv\u003EHi I am looking for any ideas how to make a rocket that can lift 3 Rockomax X200-32 Fuel Tank put together up to 200,000 m orbit where my refuel station is around kerbin. \u003Cp\u003Ethank you for any ideas.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat payload is about 100 tons (give or take extra for RCS, reaction wheels, probe cores, girders, etc). With a payload fraction of 15% for an asparagus-staged rocket, you should have a launch mass of about 750 t. Six mainsail-powered boosters and a core with 4 LV-T45s and 8 LV-T30s should lift that comfortably. For equal fuel on each stack, give each 2 orange tanks and one of the smallest 2.5m tanks on the bottom.\u003C/p\u003E\u003Cp\u003ENow add struts as necessary.\u003C/p\u003E\u003Cp\u003EIf you want it serial-staged, you\u0027ll probably need 900-1000 tons of rocket: 9 mainsails in the first stage would be a good choice for getting it off the pad.\u003C/p\u003E\u003Cp\u003ENow might be a good time to read up on construction techniques for large vehicles, such as thrust plates. In addition, if you don\u0027t have a fast computer (or even if you do) you should consider downloading Kerbal Joint Reinforcement. On large vehicles, probably the biggest contributor to CPU-melting part counts is the huge number of struts required.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-18T04:14:56Z\u0022 title=\u002202/18/2014 04:14  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 18, 2014\u003C/time\u003E by Armchair Rocket Scientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-18T04:34:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Armchair Rocket Scientist\u0022 data-cite=\u0022Armchair Rocket Scientist\u0022\u003E\u003Cdiv\u003EThat payload is about 100 tons (give or take extra for RCS, reaction wheels, probe cores, girders, etc).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENote that the fuel tanks were X200-32s, not Jumbo-64s. That\u0027s why I said the payload is nice, as you can still handle it without super-heavy lifter construction techniques.\u003C/p\u003E\n"},{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-02-18T04:44:20Z","Content":"\n\u003Cp\u003EI am in career mode so I do not have the mainsail engine or the big orange tanks. thanks for the ideas but any ideas for career mode lifts?\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-02-18T05:24:44Z","Content":"\n\u003Cp\u003EWhen I wanted to push 90 tons of equipment out to Jool early in my career I needed a monster drive section. Here\u0027s how I launched it:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yBdw6kI.png\u0022 alt=\u0022yBdw6kI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe final payload is a bundle of 7 Rocko 32\u0027s with a Skipper (130 tons). Has roughly 4600 dV in the first two stages so its not burning payload fuel. Its all Rocko 32\u0027s and skippers, so you should be able to adapt a smaller design for your purposes.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-18T05:56:11Z","Content":"\n\u003Cp\u003ECareer mode makes things more complicated. Two X200-32 fuel tanks and some struts can easily replace a jumbo tank, so your real problem is the lack of powerful engines. If you don\u0027t have Mainsails, you probably don\u0027t have cubic octagonal struts either, so clusters of small engines are much harder to set up.\u003C/p\u003E\u003Cp\u003EYou could try something like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/boosters_for_boosters.jpg\u0022 alt=\u0022boosters_for_boosters.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E- The core has three X200-32 fuel tanks and a Skipper engine.\u003C/p\u003E\u003Cp\u003E- Around the core there are six boosters with two X200-32 fuel tanks and a Skipper engine each.\u003C/p\u003E\u003Cp\u003E- There are two large solid fuel boosters attached to each of the main boosters.\u003C/p\u003E\u003Cp\u003E- The payload has one extra X200-8 fuel tank to account for the mass of the other components you may need.\u003C/p\u003E\u003Cp\u003EAll boosters fire at liftoff. The core engine is ignited when the solid fuel boosters are separated. In this configuration, the lifter has barely enough fuel to reach orbit, so some tweaking is needed. You may also want to add some Rockomax 24-77 radial engines to the payload for orbital maneuvers.\u003C/p\u003E\n"},{"CreatedByName":"breakthrough","CreatedById":75359,"CreatedDateTime":"2014-02-18T07:46:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003E...you probably don\u0027t have cubic octagonal struts either, so clusters of small engines are much harder to set up.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAn FL-R10 RCS Fuel Tank (the probe sized inline mounting one) only weighs 0.05 tons empty, can surface attach, and has nodes on both ends. Its much lower in the tech tree and besides not being weightless can do anything a cubic strut can. \u003C/p\u003E\u003Cp\u003EAlso, even though the starting girder segment has some weight to it, a six way symmetry cluster of LV-T30\u0027s is still better than a mainsail, even with the extra ton or so in mounting equipment.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-18T08:21:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022breakthrough\u0022 data-cite=\u0022breakthrough\u0022\u003E\u003Cdiv\u003EAn FL-R10 RCS Fuel Tank (the probe sized inline mounting one) only weighs 0.05 tons empty, can surface attach, and has nodes on both ends. Its much lower in the tech tree and besides not being weightless can do anything a cubic strut can. \u003Cp\u003EAlso, even though the starting girder segment has some weight to it, a six way symmetry cluster of LV-T30\u0027s is still better than a mainsail, even with the extra ton or so in mounting equipment.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t have the space to attach engines radially, when you have a core stage surrounded by boosters. You also can\u0027t attach multiple FL-R10s to the bottom of a fuel tank without part clipping, which many people consider cheating. Six LV-T30s attached with modular girder segments have 2.25 tonnes more mass and 14% less thrust than a Mainsail, and they come without thrust vectoring.\u003C/p\u003E\n"},{"CreatedByName":"breakthrough","CreatedById":75359,"CreatedDateTime":"2014-02-18T13:15:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EYou don\u0027t have the space to attach engines radially, when you have a core stage surrounded by boosters. You also can\u0027t attach multiple FL-R10s to the bottom of a fuel tank without part clipping, which many people consider cheating. Six LV-T30s attached with modular girder segments have 2.25 tonnes more mass and 14% less thrust than a Mainsail, and they come without thrust vectoring.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KZI5CDA.png\u0022 alt=\u0022KZI5CDA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBoth the TT70 decoupler and sepatrons will be available if you have the parts the OP has.\u003C/p\u003E\u003Cp\u003EAs for the Mainsail, I did indeed forget that I always mount a LV-T45 on the node and put the girders\u002BLV-T30s around it. You are right that the thrust will be lower, but 1.2 TWR will make orbit just as well as 2 will. In addition to that, the Isp will be far higher and is far more important once you are in orbit.\u003C/p\u003E\n"},{"CreatedByName":"beardysi","CreatedById":59944,"CreatedDateTime":"2014-02-18T14:00:34Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022https://scontent-a-lhr.xx.fbcdn.net/hphotos-ash3/t1/1922438_10153819863575084_1166895661_n.jpg\u0022 alt=\u00221922438_10153819863575084_1166895661_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI managed to get 5 oranges up (full) in one go a while back... (think it was in 0.19) though it did take me the guts of a week to get it right! Each of the outer tanks had a stage consisting of 2 orange tanks and cluster of LVT-30\u0027s around a central LVT-45. Outside those was a layer of mainsail LRB\u0027s. It was an absolute ***** to fly (and dock with my fuelling station!) but it did the job. Sadly I don\u0027t think I\u0027ve got any pics of the finished station... \u003C/p\u003E\u003Cp\u003EJust about scraped a 75k orbit and I sent down a heavy tug to bring it up to the station.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-18T21:19:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022breakthrough\u0022 data-cite=\u0022breakthrough\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://i.imgur.com/KZI5CDA.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/KZI5CDA.png\u003C/a\u003E\u003Cp\u003EBoth the TT70 decoupler and sepatrons will be available if you have the parts the OP has.\u003C/p\u003E\u003Cp\u003EAs for the Mainsail, I did indeed forget that I always mount a LV-T45 on the node and put the girders\u002BLV-T30s around it. You are right that the thrust will be lower, but 1.2 TWR will make orbit just as well as 2 will. In addition to that, the Isp will be far higher and is far more important once you are in orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow try adding those engine clusters to all of the 4 or 6 boosters as well. It\u0027s probably doable, but it takes a lot of effort. We were talking about lifting large loads, so we should be aiming at something like a Mainsail at the core and at each of the boosters. And while TWR 1.2 gets you eventually to the orbit, it will waste a lot of fuel before that. 1.5 to 2.5 is generally the best range, until you are high in the atmosphere, moving almost horizontally.\u003C/p\u003E\n"}]}