{"TopicId":63604,"ForumId":16,"TopicTitle":"Why it my Kerbal floating away during EVA\u0026#039;s?","CreatedByName":"FourtyTwo","CreatedById":103807,"CreatedDateTime":"2014-02-18T16:26:34Z","PageNum":1,"Articles":[{"CreatedByName":"FourtyTwo","CreatedById":103807,"CreatedDateTime":"2014-02-18T16:26:34Z","Content":"\n\u003Cp\u003ESorry for what I\u0027m sure is an incredibly newb question. I\u0027ve only been playing for two days now and have been watching Youtube videos etc, but I can\u0027t figure out why my Kerbal keeps letting go of the spacecraft while doing EVA\u0027s to gain science over the various land types on Kerbin. I\u0027ll successfully survey about 3 or so types before he gives up lol. I\u0027m on my 5th relaunch because he keeps floating off! What am I doing wrong? Thank you in advance for the help! Hoping to get this done so I can set my sights on the moons!\u003C/p\u003E\n"},{"CreatedByName":"Wijbrandus","CreatedById":62681,"CreatedDateTime":"2014-02-18T19:48:44Z","Content":"\n\u003Cp\u003EI always hit F5 (quick save) before going EVA because of this. Then if he lets go, you can immediately F9 to restore your save.\u003C/p\u003E\u003Cp\u003EYou aren\u0027t doing anything wrong. Kerbals sometimes get distracted by the cosmos, and forget to grab the rail. (Bug.)\u003C/p\u003E\n"},{"CreatedByName":"sciguyCO","CreatedById":100264,"CreatedDateTime":"2014-02-18T19:54:27Z","Content":"\n\u003Cp\u003EA couple of things:\u003C/p\u003E\u003Cp\u003E1) Hitting \u0022R\u0022 while on EVA activates your Kerbal\u0027s jetpacks. So if they do float away, you can get them back to your capsule. Use WASD to go forward / back / left / right and Shift / Ctrl to go Up / Down. Space re-orients the kerbal to be in-line with the current camera position (his back to you). Once you\u0027re close to the hatch, you can hit \u0022F\u0022 to grab on and \u0022F\u0022 again to re-enter the pod.\u003C/p\u003E\u003Cp\u003E2) The root cause to your \u0022letting go\u0022 problem is probably stuff mounted too close to the hatch. With nothing around that, when you go EVA the Kerbal should always be attached to the little ladder built into the command pod. Hitting the space bar lets go to do a full EVA. But if there\u0027s something by the hatch, when the Kerbal exits and \u0022spawns\u0022 outisde the ship, there\u0027s some collision that takes place. The best-case scenario has them just let go of the ladder and float there in range to hit \u0022F\u0022 to grab on. The worst case I\u0027ve seen had the little green guy get flung violently away from the ship. \u003C/p\u003E\u003Cp\u003EI run into this a lot becuase I like to have the little sensors (thermometer / gravioli / etc.) close by the hatch to retrieve the science easier. I now always do some launch pad tests to make sure they\u0027re far enough away to remove the possibility of clipping.\u003C/p\u003E\n"},{"CreatedByName":"Mr.Rocket","CreatedById":80241,"CreatedDateTime":"2014-02-18T20:28:35Z","Content":"\n\u003Cp\u003EAre you in space yet? Kerbals cannot hang on to ladders at very high speeds while in the atmosphere, though i forget what the speed limit is\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-02-18T22:00:41Z","Content":"\n\u003Cp\u003EThey will let go on their own if you move around too much on the ladder. Also, some of the capsules are more prone to kerbals unintentionally letting go. Especially if you have anything attached next to the hatch/ladder (as mentioned above).\u003C/p\u003E\u003Cp\u003EThe other thing that is annoying is how they sometimes orient themselves up/down on the wrong axis in relation to the hatch/ladder making it more difficult to grab on. If you press space bar, the kerbal will orient to the camera view.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-19T12:22:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EIf you press space bar, the kerbal will orient to the camera view.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am experimenting with the \u0022Kerbals orient to camera\u0022 option disabled in game settings. Works quite well for me. Translation works as usual, just rotation is totally manual too, two axes (roll and pitch) being controlled by pulling the Kerbal\u0027s head with the mouse.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-02-19T13:49:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EI am experimenting with the \u0022Kerbals orient to camera\u0022 option disabled in game settings. Works quite well for me. Translation works as usual, just rotation is totally manual too, two axes (roll and pitch) being controlled by pulling the Kerbal\u0027s head with the mouse.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll have to try that. I get really frustrated sometimes when they don\u0027t want to orient rotationally \u0022up/down\u0022 and you end up pointing head first at the hatch.\u003C/p\u003E\n"},{"CreatedByName":"Serratus","CreatedById":12069,"CreatedDateTime":"2014-02-19T15:52:43Z","Content":"\n\u003Cp\u003EI\u0027d add yet another possibility from my experience - lag. I sometimes have my Kerbals fail to grab the mobility enhancers (don\u0027t know what You mean by \u0022ladders\u0022 since there are none in KSP) when I\u0027m working on bigger ships, or have lag (yellow timer) for any other reason. Makes steering them hard too.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-19T23:47:51Z","Content":"\n\u003Cp\u003E-Press R to turn on your EVA jetpack\u003C/p\u003E\u003Cp\u003E-Kerbals will fall off in the atmosphere if you don\u0027t have an actually ladder attached to your ship.\u003C/p\u003E\u003Cp\u003E-If a small item is covering the capsule\u0027s hatch, it will launch your Kerbal away from the ship and make it impossible to get back on.\u003C/p\u003E\n"},{"CreatedByName":"Jank","CreatedById":97123,"CreatedDateTime":"2014-02-20T01:06:01Z","Content":"\n\u003Cp\u003EPress F to Grab On, immediately after exiting on EVA. My Kerbals never seem to hold onto the ladder when they exit, unless I do this every time without fail. Then they never float off.\u003C/p\u003E\n"},{"CreatedByName":"RolanDecoy","CreatedById":39933,"CreatedDateTime":"2014-10-27T13:10:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wijbrandus\u0022 data-cite=\u0022Wijbrandus\u0022\u003E\u003Cdiv\u003EI always hit F5 (quick save) before going EVA because of this. Then if he lets go, you can immediately F9 to restore your save.\u003Cp\u003EYou aren\u0027t doing anything wrong. Kerbals sometimes get distracted by the cosmos, and forget to grab the rail. (Bug.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think this is the best answer, as it happens on pods even without other components added. I found this however to occur more often on the 64 bit version. Increasing time for physics seems to solve the problem partially... Especially annoying if you want the crew report from upper atmosphere while in a rapid descent.\u003C/p\u003E\u003Cp\u003EYour pilot will still \u0027slide\u0027 across the ladder even in zero-g, but they don\u0027t seem to be locked to the ladder properly. And yes, this still happens in the Economic Boom update.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-27T13:14:36Z\u0022 title=\u002210/27/2014 01:14  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 27, 2014\u003C/time\u003E by RolanDecoy\u003C/strong\u003E\n\u003C/span\u003E\n"}]}