{"TopicId":63659,"ForumId":55,"TopicTitle":"Kerbin biomes-thing doesn\u0026#039;t make sense; suggestion for first phase of the career mode","CreatedByName":"255","CreatedById":60654,"CreatedDateTime":"2014-02-19T02:23:30Z","PageNum":1,"Articles":[{"CreatedByName":"255","CreatedById":60654,"CreatedDateTime":"2014-02-19T02:23:30Z","Content":"\n\u003Cp\u003EThe biome thing is cool but it shouldn\u0027t apply to Kerbin since it\u0027s your own planet, it just doesn\u0027t make sense, everything should be already discovered by ground exploration.\u003C/p\u003E\u003Cp\u003EIn the first phase of the game you should gain points placing satellites and doing in-orbit experiments. Which leads to this request: having more experiments-part, probes, and solar panels, and having all this right from the start.\u003C/p\u003E\u003Cp\u003EFeel free to discuss, everyone.\u003C/p\u003E\n"},{"CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2014-02-19T02:34:41Z","Content":"\n\u003Cp\u003EThere is always something new to learn, take Earth for instance, our beautiful home, we are discovering more things on Earth almost everyday. Rocks, sand, minerals, etc. Biomes are just a place on a celestial body. I suspect we haven\u0027t discovered every biome on Earth.\u003C/p\u003E\n"},{"CreatedByName":"Kruleworld","CreatedById":69697,"CreatedDateTime":"2014-02-19T02:44:21Z","Content":"\n\u003Cp\u003EI don\u0027t think the observations are being done at ground level, but in the upper atmosphere, which humans first did with hot air balloons. I assume this was the first tests they did when starting the rocket age.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-02-19T03:10:13Z","Content":"\n\u003Cp\u003EHere\u0027s a challange: play carear mode without using the VAB. (and no cheating by building a normal rocket on the runway).\u003C/p\u003E\u003Cp\u003EOnce you unlock turbofans, you can explore the world, trying to get enough science for turbojets and Spaceplanes.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-02-19T03:28:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kruleworld\u0022 data-cite=\u0022Kruleworld\u0022\u003E\u003Cdiv\u003EI don\u0027t think the observations are being done at ground level, but in the upper atmosphere, which humans first did with hot air balloons. I assume this was the first tests they did when starting the rocket age.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s nice to pretend but it\u0027s hard to keep on pretending when you get science for picking up dirt off the launch pad. It\u0027s also a bit hard to swallow that you take a science Jr in your rocket fire it up into the stratosphere, land it hundreds of KM away so you can take a surface reading, and then recover the vessel. Presumably someone had to drive a truck or take a plane or something to go get the vessel to recover it. Why didn\u0027t they just drive the Science Jr out there to begin with? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-02-19T04:33:58Z","Content":"\n\u003Cp\u003EFrom the carear tech tree:\u003C/p\u003E\u003Cp\u003E\u0022We knew about electricity before we invented rockets. The real breakthrough was putting electricity ON the rocket.\u0022\u003C/p\u003E\u003Cp\u003EJust cause i was resonable to do so, doesnt mean Kerbals actually DID it.\u003C/p\u003E\n"},{"CreatedByName":"Orionkermin","CreatedById":91013,"CreatedDateTime":"2014-02-19T04:43:03Z","Content":"\n\u003Cp\u003EI like to think of the tests done on kerbin as control groups for future studies in space. Things like surface samples could be considered astronaut training, even the Apollo astronauts had to be taught what to look for and the best way to collect samples. Sure they didn\u0027t fly rockets out to do their training, but I think most would agree KSP is more game than simulation. Just my two cents.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-02-19T05:02:07Z","Content":"\n\u003Cp\u003EKeep in mind that science is one of the three \u0022currencies\u0022 that will eventually be in the game and that it will likely be more useful later on than for simply unlocking the tech tree, especially since you\u0027ll be able to trade it for other currencies. Therefore, it only makes sense to have as much science available in as many places as possible, no matter how silly you think it is.\u003C/p\u003E\u003Cp\u003EAlso, we have way too many probe parts, I want more capsules. Probes are terrible and boring.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-02-19T05:23:17Z","Content":"\n\u003Cp\u003Eand another \u0022KSP must be made much harder so new players can\u0027t progress and eventually threaten my superior skill level\u0022 rant...\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-02-19T07:22:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAlso, we have way too many probe parts, I want more capsules. Probes are terrible and boring.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI love probes, but I want more capsules. 2-man, 4-man, lander cans of those sizes, each combo of sizes on top and bottom, etc. More more more!\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-19T08:08:06Z","Content":"\n\u003Cp\u003EI think the gist of the current system is fine. Maybe scrub the \u0027Launchpad\u0027 biome (or change it so it gives 0 science), but instead have something like a \u0027Target Zone\u0027 1km outside the KSC which would count as a separate biome to get some easy science.\u003C/p\u003E\u003Cp\u003ESure, on the surface of things home planet surface samples seem ridiculous, but just recently researchers went out and asked people around the globe to sample the oceanwater in their vicinity and do basic science on it. There\u0027s always something to be learned. Whether that\u0027ll pertain directly to \u003Cstrong\u003Erocket\u003C/strong\u003E development though.. \u003C/p\u003E\u003Cp\u003EThe fact of the matter is this, new players will start designing rockets, these rockets will not immediately go into orbit or even space, they will however fall down in many different places. The first bits of the science system cater to this phase of the game, and that\u0027s perfectly fine. In fact, in my RSS Career game (see signature) I was darn happy I had some science to get close to home, but I digress..\u003C/p\u003E\u003Cp\u003ESure, some things are quirky, like how rockets are apparently the only way to get things there and not the recovery truck (I think I mention as much in one of my videos), but a real problem? hardly, it\u0027s still a game about designing rockets to go places after all.\u003C/p\u003E\n"},{"CreatedByName":"255","CreatedById":60654,"CreatedDateTime":"2014-02-19T11:47:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eand another \u0022KSP must be made much harder so new players can\u0027t progress and eventually threaten my superior skill level\u0022 rant...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eand\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DonLorenzo\u0022 data-cite=\u0022DonLorenzo\u0022\u003E\u003Cdiv\u003EThe fact of the matter is this, new players will start designing rockets, these rockets will not immediately go into orbit or even space, they will however fall down in many different places. The first bits of the science system cater to this phase of the game, and that\u0027s perfectly fine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point.\u003C/p\u003E\u003Cp\u003ESo maybe we could have both ways of starting to gain science points: biomes AND satellites and more experiment-parts right from the start. I just don\u0027t think is good being forced to pick stuff from the ground when you want to do stuff in orbit. Picking up samples gives way more points than flying over places.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-19T11:52:55Z\u0022 title=\u002202/19/2014 11:52  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 19, 2014\u003C/time\u003E by 255\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sjwt","CreatedById":9268,"CreatedDateTime":"2014-02-19T11:57:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DonLorenzo\u0022 data-cite=\u0022DonLorenzo\u0022\u003E\u003Cdiv\u003EI think the gist of the current system is fine. Maybe scrub the \u0027Launchpad\u0027 biome (or change it so it gives 0 science), but instead have something like a \u0027Target Zone\u0027 1km outside the KSC which would count as a separate biome to get some easy science..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI love the Launchpad/Runway and KSC Bioms, have you tried launching a rocket and landing back a those places? The issue is that you can just spawn on these places to get easy science, the solution? Dont do it!\u003C/p\u003E\u003Cp\u003EI get those Bioms, the Grasslands,Shores and Water ones with a single stage single SRB on full.. use the customizable amounts and levels to be able to hit the mountain region as well! Tis fun to try and hit them!\u003C/p\u003E\n"},{"CreatedByName":"JimmyAgent007","CreatedById":74761,"CreatedDateTime":"2014-02-19T14:39:15Z","Content":"\n\u003Cp\u003EYou dont even need science to get into space, anyone else see the first level tech grand tour of the system? Science is a moot point until .24 comes out.\u003C/p\u003E\u003Cp\u003EAlso i agree with the \u0022if you dont like it dont do it\u0022 solution to all these kinds of problems.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-02-19T15:40:49Z","Content":"\n\u003Cp\u003EOne word: Calibration.\u003C/p\u003E\u003Cp\u003EThe gravioli detector even explicitly says this.\u003C/p\u003E\n"}]}