{"TopicId":63763,"ForumId":32,"TopicTitle":"Looking for a time acceleration calculator.","CreatedByName":"XOIIO","CreatedById":100854,"CreatedDateTime":"2014-02-20T05:21:20Z","PageNum":1,"Articles":[{"CreatedByName":"XOIIO","CreatedById":100854,"CreatedDateTime":"2014-02-20T05:21:20Z","Content":"\n\u003Cp\u003EHey everyone, I was wondering if anyone has made a time acceleration calculator, something that you put the number of years/days in (ideally both) and the level of time acceleration you are at, and give you a real world equivelent. This would be great because if you are waiting for 5 years to get to a node, you could set an alarm on your phone and come back just in time. I have mechjeb piloting it but I still like to be there for the burns.\u003C/p\u003E\u003Cp\u003EI thought it would work to guess it was in minutes and seconds for years/days, but I set an alarm for three minutes and only one year passed (roughly). It does seem right though when I was looking at in in just days, perhaps I just made a mistake.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-20T05:24:27Z\u0022 title=\u002202/20/2014 05:24  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 20, 2014\u003C/time\u003E by XOIIO\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-02-20T05:27:02Z","Content":"\n\u003Cp\u003EJust use Kerbal Alarm Clock.\u003C/p\u003E\u003Cp\u003EAnd I\u0027m pretty sure the time is the same as our time, so just divide the time till event by the time warp.\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-02-20T06:12:35Z","Content":"\n\u003Cp\u003EI would second the opinion of use kerbal alarm clock. you can set it to not only kill timewarp when it reaches the node but to also pause the game so even if your gone for an hour longer than needed you still wont have missed your node. although I cant think of any transfer window off the top of my head that would need a 5 year wait other than a weierd one like minimum energy transfer from jool to eeloo or something. that could take a while for a perfect alignment.\u003C/p\u003E\u003Cp\u003EThat said you can get a quick guestimate of how much real time is needed for a few standard lengths of time on the KSP wiki on timewarp. \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Time_warp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Time_warp\u003C/a\u003E table at botom of the page.\u003C/p\u003E\n"},{"CreatedByName":"steffen_anywhere","CreatedById":64915,"CreatedDateTime":"2014-02-20T06:33:47Z","Content":"\n\u003Cp\u003EKerbal Alarm Clock is good, but to be honest can you not calculate that yourself?? It is easier than calculating thrust to weight ratios...which is very easy still.\u003C/p\u003E\n"},{"CreatedByName":"Noticeably FAT","CreatedById":43401,"CreatedDateTime":"2014-02-20T18:50:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022steffen_anywhere\u0022 data-cite=\u0022steffen_anywhere\u0022\u003E\u003Cdiv\u003EKerbal Alarm Clock is good, but to be honest can you not calculate that yourself?? It is easier than calculating thrust to weight ratios...which is very easy still.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuite often with KSP \u0022Can\u0022 and \u0022Have any desire to do it\u0022 are often not the same thing.\u003C/p\u003E\n"}]}