{"TopicId":63772,"ForumId":16,"TopicTitle":"How do I make a stock bearing in ksp?","CreatedByName":"burnoutforzai","CreatedById":93344,"CreatedDateTime":"2014-02-20T08:56:23Z","PageNum":1,"Articles":[{"CreatedByName":"burnoutforzai","CreatedById":93344,"CreatedDateTime":"2014-02-20T08:56:23Z","Content":"\n\u003Cp\u003EHi There People,\u003C/p\u003E\u003Cp\u003EI have recently been looking at how to make a stock bearing in ksp (for a challenge) and I was looking around the forums but there was no tutorial to be found on it.\u003C/p\u003E\u003Cp\u003ENot to be a bit annoying but I was wondering if one of you guys could make a tutorial in the tutorial section of the forums.\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003EBurn\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-22T11:33:57Z\u0022 title=\u002202/22/2014 11:33  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 22, 2014\u003C/time\u003E by burnoutforzai\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-02-20T14:28:03Z","Content":"\n\u003Cp\u003EWell, you just make an assembly with a hole in it that surrounds the part you\u0027re using as the axle. There are a bunch of ways to do this, like with various structural pieces, lander legs, those blue stack separator rings, etc. The spinning assembly and the axle have to start out connected by some sort of decoupler.\u003C/p\u003E\u003Cp\u003EThe main problem with stock bearings is that once you separate the parts with the decoupler, you have no physical connection between them anymore, meaning you now have 2 separate ships (if both parts have control parts) or 1 ship and 1 piece of uncontrollable debris. So you have to take that into account in the design, depending on what you\u0027re trying to do with it.\u003C/p\u003E\u003Cp\u003EThere are probably better ways of making stock bearings but the above has worked for me in the very limited applications I had for them.\u003C/p\u003E\n"},{"CreatedByName":"burnoutforzai","CreatedById":93344,"CreatedDateTime":"2014-02-20T14:37:30Z","Content":"\n\u003Cp\u003EOk thanks very much\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2017-01-18T10:29:57Z","Content":"\n\u003Cp\u003E\nThis ancient post shows up first when you search Google for \u0022ksp stock bearing\u0022 and  while the answer is technically correct, the result will be beyond doubt complex, troublesome and take a lot of work to get right. Finding a comprehensive, competent manual takes quite a bit of time, so let me provide a link to one.\n\u003C/p\u003E\n\u003Cp\u003E\nThis video shows one neat and simple stock bearing based on Stayputniks clipped into Mk0 tanks, which are placed inside Mk1 structural fuselage; the fuselage is capped with a Z-1000 battery, sandwiched between the bearing and a reaction wheel attached to the rotor but offset far enough not to clip into the battery; the RW acts as a motor too. The axle (Mk0 tanks) and the tube (fuselage) are connected with a separator which explodes upon separation.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/goEH48u4bkk?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}