{"TopicId":63829,"ForumId":44,"TopicTitle":"? 2 Cannon balls are dropped at the same time...","CreatedByName":"travis575757","CreatedById":83941,"CreatedDateTime":"2014-02-20T23:38:41Z","PageNum":1,"Articles":[{"CreatedByName":"travis575757","CreatedById":83941,"CreatedDateTime":"2014-02-20T23:38:41Z","Content":"\n\u003Cp\u003ESo i have a question, 2 Cannon balls are dropped at the same time, they are both made of iron, BUT 1 is bigger (more mass and greater surface area) than the other, which one hits the ground first.\u003C/p\u003E\u003Cp\u003EI have heard this and would think that the smaller one would hit the ground first because it encounters less air resistance. Would this be correct because i have been hearing that they would hit the ground at the same time because they are both facing the same acceleration due to gravity 9.81 m/s. But one is larger and would face more friction thus going slower right?\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-02-20T23:44:22Z","Content":"\n\u003Cp\u003EThe smaller one will hit the ground first, albeit by a marginal amount.\u003C/p\u003E\n"},{"CreatedByName":"travis575757","CreatedById":83941,"CreatedDateTime":"2014-02-20T23:45:07Z","Content":"\n\u003Cp\u003EThanks i needed to make sure.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-02-21T00:19:51Z","Content":"\n\u003Cp\u003EOf course, in a vacuum, they would fall at the same rate regardless of mass, size, and so forth. This actually can be proven by dropping a brick and a feather in a vacuum- they both fall at the same rate. SCIENCE.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-02-21T00:21:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maximus97\u0022 data-cite=\u0022Maximus97\u0022\u003E\u003Cdiv\u003EOf course, in a vacuum, they would fall at the same rate regardless of mass, size, and so forth. This actually can be proven by dropping a brick and a feather in a vacuum- they both fall at the same rate. SCIENCE.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn a vacuum, the large would hit first because it\u0027s bigger and the edge would touch the floor first. If instead they were both the same size but different masses, they would hit the ground at the same time as well.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-02-21T00:22:42Z","Content":"\n\u003Cp\u003EIn air, larger one will fall a little bit faster. It has larger area, but also more mass. Area increases as square of the size, but mass is going to increase as a cube. So a weight-to-drag ratio is higher for larger cannonball, giving it faster fall speed.\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2014-02-21T08:36:01Z","Content":"\n\u003Cp\u003EThis is a subject that took me a little while to get my head around a few years back, but I\u0027ll try to explain it.\u003C/p\u003E\u003Cp\u003EIn air, 2 objects with 2 different masses will have their own terminal velocities resulting from air resistance. The more massive object will not reach terminal velocity before the less massive object and so will continue to accelerate towards the Earth \u0027s centre of gravity until it too reaches terminal velocity; therefore, the more massive object will hit the ground first.\u003C/p\u003E\u003Cp\u003EThis I could accept; it made sense. A vacuum used to be more confusing but it\u0027s actually easy to understand if you think about it. Let\u0027s take those two different masses from the atmosphere and stick them a hundred metres above the Moon. Both will fall at exactly the same rate due to the negligible atmosphere at the Lunar surface and the equal gravitational pull on each object. The way I visualise this is a bit unusual but helpful. Consider the effect of gravity on all of the individual atoms of each mass; each atom is identical and merely clustered together with others of their kind, all of them being equally affected by the gravitational field, so a larger cluster of these atoms won\u0027t fall at a greater rate than a smaller cluster. This is a bit of an odd explanation and I\u0027m sure someone else has something better, but it\u0027s the way I can understand it; even two masses composed of different elements (say... lithium and osmium) would fall at the same rate despite their differing densities.\u003C/p\u003E\u003Cp\u003EYou can test the vacuum portion in KSP (aerodynamic model of the game is questionable); probably the best contrast would be a small fuel tank compared to a jumbo tank (I\u0027ll leave the logistics to you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E) descending to the surface of Mun. You\u0027ll see both fall at the same rate.\u003C/p\u003E\u003Cp\u003EHope this helped \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-02-21T09:52:00Z","Content":"\n\u003Cp\u003EReplace one of the iron balls with a feather and you will get your answer.\u003C/p\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2014-02-21T12:02:09Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/-4_rceVPVSY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAlready experimented.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Entropy","CreatedById":66320,"CreatedDateTime":"2014-02-21T13:43:00Z","Content":"\n\u003Cp\u003EIn vacuum, the two balls would fall at the same rate. This was experimentally proven by Apollo 15, where a hammer and feather were dropped on the surface of the moon. An atmosphere tends to throw a wrench in the system.\u003C/p\u003E\u003Cp\u003EBut this is science, you can experiment and find out for yourself. I imagine water balloons would be easier to acquire than cannonballs and yield similar results. We can talk theory all we want here, but let\u0027s get some real data to work with.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-21T14:14:19Z\u0022 title=\u002202/21/2014 02:14  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 21, 2014\u003C/time\u003E by Mr. Entropy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lodestar","CreatedById":101720,"CreatedDateTime":"2014-02-21T14:28:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr. Entropy\u0022 data-cite=\u0022Mr. Entropy\u0022\u003E\u003Cdiv\u003EBut this is science, you can experiment and find out for yourself.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep... unfortunately, over the years there are a bunch of anomalous results: elongated objects were observed to fall slightly faster than compact objects, even in a vacuum; objects with the same mass but made from metals with different atomic weights were observed to fall at different rates; objects falling over a mass of water were observed to fall faster; etc. Sure, in most cases the results couldn\u0027t be replicated and assumed to be an error after that, but there\u0027s still a few unexplained weird cases left. Eventually, they pile up enough that people start talking about a fifth force again, but then the weirder cases are explained (like the Pioneer anomaly), and the issue cools down again.\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-02-22T07:34:25Z","Content":"\n\u003Cp\u003EAir drag is proportional to cross sectional area which is proportional to r^2\u003C/p\u003E\u003Cp\u003EGravitational force is proportional to mass which is proportional to volume which is proportional to r^3\u003C/p\u003E\u003Cp\u003Er^3 goes up faster than r^2 with increasing r, thus gravitational force goes up faster than drag force in your scenario.\u003C/p\u003E\u003Cp\u003EYes, the larger ball would fall faster.\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2014-02-22T07:47:51Z","Content":"\n\u003Cp\u003EIn pure mechanical (I guess that is the right word) physics, ALWAYS ignore factors such as air resistance. That falls under aerodynamics, not physics.\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2014-02-22T07:54:36Z","Content":"\n\u003Cp\u003Enow, one way we could properly demonstrate this on Earth, would be to drop two cannon balls that were the same size but different weights, say one\u0027s made of iron and the other Uranium. You would see that they would still fall at the same rate.\u003C/p\u003E\u003Cp\u003EI would not want to be the person holding the Uranium cannonball though.\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-02-22T07:58:49Z","Content":"\n\u003Cp\u003EUranium cannonball would fall quicker in an atmosphere. Greater density=greater acceleration with drag present. If not convinced in the case of a uranium and iron cannonball, throw a nerf ball into the experiment and see if you are convinced then.\u003C/p\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2014-02-22T09:07:34Z","Content":"\n\u003Cp\u003ESo if I took 1kg of iron and placed it an a magical sphere of zero mass and 2kg of feathers and compacted them into an identical magical sphere and dropped them in atmosphere, the feathers would land first?\u003C/p\u003E\u003Cp\u003EI don\u0027t think so.\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-02-22T09:21:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022falofonos\u0022 data-cite=\u0022falofonos\u0022\u003E\u003Cdiv\u003ESo if I took 1kg of iron and placed it an a magical sphere of zero mass and 2kg of feathers and compacted them into an identical magical sphere and dropped them in atmosphere, the feathers would land first?\u003Cp\u003EI don\u0027t think so.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut it would be the case. If one wouldn\u0027t consider air resitance, they would fall with the same accelaration, because only gravity works on the objects, and so the masses cancel.\u003C/p\u003E\u003Cp\u003Em*a = m*g\u003C/p\u003E\u003Cp\u003Ea = g\u003C/p\u003E\u003Cp\u003EThe mass doesn\u0027t play in. But with air resistance:\u003C/p\u003E\u003Cp\u003Em*a = m*g - F_AirResistance\u003C/p\u003E\u003Cp\u003Ea = g - F_AirResistance / m\u003C/p\u003E\u003Cp\u003ESince the air resistance is independent of mass, the mass of the object doesn\u0027t cancel from the equation. So Objects with greater mass fall faster in Atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"LordOfTheOrbits","CreatedById":101867,"CreatedDateTime":"2014-02-22T10:26:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt. Hunt\u0022 data-cite=\u0022Capt. Hunt\u0022\u003E\u003Cdiv\u003Enow, one way we could properly demonstrate this on Earth, would be to drop two cannon balls that were the same size but different weights, say one\u0027s made of iron and the other Uranium. You would see that they would still fall at the same rate.\u003Cp\u003EI would not want to be the person holding the Uranium cannonball though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWrong. The kinetic energy of an object is speed times mass. Air resistance only cancels out the same amount of kinetic energy from both cannon balls and because the iron ball has a larger mass and therefore more kinetic energy, it will lose the same amount of energy, but less speed.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-02-22T12:00:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordOfTheOrbits\u0022 data-cite=\u0022LordOfTheOrbits\u0022\u003E\u003Cdiv\u003EWrong. The kinetic energy of an object is speed times mass. Air resistance only cancels out the same amount of kinetic energy from both cannon balls and because the iron ball has a larger mass and therefore more kinetic energy, it will lose the same amount of energy, but less speed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEnergy is not the best way to think about this. This isn\u0027t strictly wrong, but the object that falls faster is going to experience greater resistance, and therefore, have more work done by it by drag than the slower object. So energy loss to drag is not equal. Because energy and drag are both monotonic functions of velocity, and in fact, both are roughly quadratic, the object with more mass still ends up traveling faster despite losing more energy, and so you\u0027re not wrong, but it\u0027s needlessly complicated.\u003C/p\u003E\u003Cp\u003EIt\u0027s much easier to just look at accelerations. Given equal sizes and shapes, heavier object experiences higher acceleration, and so ends up falling faster.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-02-22T14:11:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EIn a vacuum, the large would hit first because it\u0027s bigger and the edge would touch the floor first.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhoops, sorry. I\u0027m assuming the cannon balls were dropped from the same height or were the same size but had differing masses. In any case, they would fall \u003Cem\u003Eat the same rate\u003C/em\u003E in a vacuum.\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-22T14:14:40Z","Content":"\n\u003Cp\u003Ewhy not make three cannonballs, all the same size, but different mass\u003C/p\u003E\u003Cp\u003E1. iron\u003C/p\u003E\u003Cp\u003E2. osmium (even denser than uranium! yay!)\u003C/p\u003E\u003Cp\u003E3. lighter-than-air foam\u003C/p\u003E\u003Cp\u003EThey all experience the same g, so they should all hit the ground first right? Who still isn\u0027t convinced that that is in fact NOT the case?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-22T15:19:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordOfTheOrbits\u0022 data-cite=\u0022LordOfTheOrbits\u0022\u003E\u003Cdiv\u003EWrong. The kinetic energy of an object is speed times mass. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWrong. Kinetic energy is 1/2 mass times speed squared. You\u0027re thinking of momentum, which is related but not the same.\u003C/p\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2014-02-22T15:19:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DonLorenzo\u0022 data-cite=\u0022DonLorenzo\u0022\u003E\u003Cdiv\u003Ewhy not make three cannonballs, all the same size, but different mass\u003Cp\u003E1. iron\u003C/p\u003E\u003Cp\u003E2. osmium (even denser than uranium! yay!)\u003C/p\u003E\u003Cp\u003E3. lighter-than-air foam\u003C/p\u003E\u003Cp\u003EThey all experience the same g, so they should all hit the ground first right? Who still isn\u0027t convinced that that is in fact NOT the case?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept the lighter than air foam ball would float....\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2014-02-22T16:44:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022falofonos\u0022 data-cite=\u0022falofonos\u0022\u003E\u003Cdiv\u003EExcept the lighter than air foam ball would float....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eno kidding!\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-02-22T23:17:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022falofonos\u0022 data-cite=\u0022falofonos\u0022\u003E\u003Cdiv\u003ESo if I took 1kg of iron and placed it an a magical sphere of zero mass and 2kg of feathers and compacted them into an identical magical sphere and dropped them in atmosphere, the feathers would land first?\u003Cp\u003EI don\u0027t think so.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am not sure exactly what you mean by magical spheres, but I think what you mean is to take the 2kg of feathers and compact them until they occupied the same volume as 1 kg of iron. In your situation, the feather ball would have twice the density of the iron ball and would accelerate more quickly in an atmosphere.\u003C/p\u003E\u003Cp\u003ELet\u0027s do some grade 11 physics: ÃŽÂ£F=ma. Your sum of forces are Gravity and air resistance. There are various methods of modelling air resistance, but the largest term is always proportional to cross sectional area. Stick a constant in front and we\u0027ve got an equation of F(drag)=CA where C is the modelling constant and A is the cross sectional area. F(gravity), as established by Newton is quite easy near the surface of the Earth. F(grav)=mg where g is 9.8m/s^2\u003C/p\u003E\u003Cp\u003EOk, let\u0027s put together the equation of motion for these spheres in freefall. ÃŽÂ£F=F(Grav)\u002BF(drag) and if we define down as positive then this becomes ÃŽÂ£F=|F(Grav)|-|F(drag)|=mg-CA=ma. Let\u0027s divide everything by m to make it easier to read: a=g-CA/m The cross sectional areas being equal, you can see quite plainly by inspection that a larger mass in the denominator in the second term makes CA/m smaller, and thus more of g is \u0022left\u0022 to go towards the object\u0027s acceleration.\u003C/p\u003E\u003Cp\u003ENote: The above argument is only valid for objects of identical shape and size with differing masses in the presence of an atmosphere.\u003C/p\u003E\n"}]}