{"TopicId":63972,"ForumId":55,"TopicTitle":"Ability to store experiments on probes","CreatedByName":"firefueled","CreatedById":72026,"CreatedDateTime":"2014-02-22T15:59:53Z","PageNum":1,"Articles":[{"CreatedByName":"firefueled","CreatedById":72026,"CreatedDateTime":"2014-02-22T15:59:53Z","Content":"\n\u003Cp\u003EThe ability to store experiments on probes is a small change that would impact hugely on game play.\u003C/p\u003E\u003Cp\u003EThe objective here is, while on a far away manned mission, send all the experiments you gathered back to Kerbin, on a much smaller and lighter craft.\u003C/p\u003E\u003Cp\u003EAn alternative to storing science on probes is to provide a small, light-weight science storage unit that can be attached to a probe. The unit would draw a constant amount of electricity, to preserve the experiments.\u003C/p\u003E\u003Cp\u003EThis option would open the possibility to go a very long exploration mission carrying a bunch of small probes, which could be sent back periodically as you gathered science.\u003C/p\u003E\u003Cp\u003EWouldn\u0027t it be fun to be on the ground of Eve and watch you little science-filled probe shoot up to the sky, relatively effortlessly, on it\u0027s merry way back to Kebin?\u003C/p\u003E\n"},{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2014-02-22T16:08:19Z","Content":"\n\u003Cp\u003EIn a sense this can already be done, you just have to pretend that a mk1 lander can is your storage container... and that you also put a probe command module on it so you don\u0027t have to send a Kerbal home...\u003C/p\u003E\u003Cp\u003Estep 1 : rendezvous with the probe you want to send home\u003C/p\u003E\u003Cp\u003E 2 : send a kerbal on eva from the main vessel\u003C/p\u003E\u003Cp\u003E3 : now on eva, right click the science things \u002B the main module and click take data\u003C/p\u003E\u003Cp\u003E4 : now right click on the mk1 lander can on your probe and click \u0022store data\u0022\u003C/p\u003E\u003Cp\u003E5: send your probe on its way and put the kerbal back in the main vessel...\u003C/p\u003E\n"},{"CreatedByName":"Serratus","CreatedById":12069,"CreatedDateTime":"2014-02-22T17:45:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nemrav\u0022 data-cite=\u0022Nemrav\u0022\u003E\u003Cdiv\u003EIn a sense this can already be done, you just have to pretend that a mk1 lander can is your storage container[...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo we can\u0027t, but probes IRL theoretically could store digital data, if not samples. OPs argument is for realism, not game mechanic - at least that\u0027s how I see it. And I support it.\u003C/p\u003E\u003Cp\u003EOne thing for balance sake:\u003C/p\u003E\u003Cp\u003E1) probe bodies CAN\u0027T store actual physical samples, only digital ones like instrument readings;\u003C/p\u003E\u003Cp\u003E2) they CAN\u0027T analyze the samples (and data) like the mobile lab does (this is so that there is a valid reason for sending manned missions);\u003C/p\u003E\u003Cp\u003E3) and last they CAN\u0027T \u0022take in\u0022 experiments - automated craft have to either transmit experiments, or physically return it to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2014-02-23T00:38:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Serratus\u0022 data-cite=\u0022Serratus\u0022\u003E\u003Cdiv\u003ENo we can\u0027t, but probes IRL theoretically could store digital data, if not samples. OPs argument is for realism, not game mechanic - at least that\u0027s how I see it. And I support it.\u003Cp\u003EOne thing for balance sake:\u003C/p\u003E\u003Cp\u003E1) probe bodies CAN\u0027T store actual physical samples, only digital ones like instrument readings;\u003C/p\u003E\u003Cp\u003E2) they CAN\u0027T analyze the samples (and data) like the mobile lab does (this is so that there is a valid reason for sending manned missions);\u003C/p\u003E\u003Cp\u003E3) and last they CAN\u0027T \u0022take in\u0022 experiments - automated craft have to either transmit experiments, or physically return it to Kerbin.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt would be interesting to have a \u0022Sample Return Canister\u0022 part that could store a set number of experiments, similar to \u003Ca href=\u0022https://en.wikipedia.org/wiki/Luna_16\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Luna_16\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"firefueled","CreatedById":72026,"CreatedDateTime":"2014-02-23T01:50:03Z","Content":"\n\u003Cp\u003EYeah. This would benefit both game play and realism. The instrumentation science could simply be stored on a probe, while the live experiments, in a \u0022canister\u0022.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2014-02-23T03:56:31Z","Content":"\n\u003Cp\u003EI don\u0027t see any reason to add many of the suggested features to currently existing probes, but I think new probes should be added with these functionalities. A probe that can handle experiments could also be one that has other storage space for small equipment and such, and it would take up more space than a normal probe of its power.\u003C/p\u003E\n"}]}