{"TopicId":64036,"ForumId":50,"TopicTitle":"KerbalGuides #1: Guide to unlocking the entire tech tree in 1-3 days (Discontinued)","CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-23T07:08:36Z","PageNum":1,"Articles":[{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-23T07:08:36Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003EYour new space program\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOnce you make your new career mode space program, there isn\u0027t much to do with the parts you are supplied. It\u0027s impossible to get to space. So what do you do? May sounds stupid, but your first science points will come from an unexpected place-The Launchpad. Start by clicking on the tall cube building, known as the \u003Cstrong\u003EVAB\u003C/strong\u003E or \u003Cstrong\u003EV\u003C/strong\u003Eehicle \u003Cstrong\u003EA\u003C/strong\u003Essembly \u003Cstrong\u003EB\u003C/strong\u003Euilding. Right now there is no purpose for any of the other buildings. You can feel free to explore though. In the Vehicle Assembly Building, you can build rockets. The VAB is the only building you will have use for right now. In the \u003Cstrong\u003ESPH\u003C/strong\u003E or \u003Cstrong\u003ES\u003C/strong\u003Epace \u003Cstrong\u003EP\u003C/strong\u003Elane \u003Cstrong\u003EH\u003C/strong\u003Eangar, you can build space planes, which are basically sideways rockets with parts like wings and air intakes, which you unlock later in the tech tree. In the \u003Cstrong\u003ER\u0026amp;D\u003C/strong\u003E facility, or the \u003Cstrong\u003ER\u003C/strong\u003Eesearch \u003Cstrong\u003EA\u003C/strong\u003End \u003Cstrong\u003ED\u003C/strong\u003Eevelopement facility, you can upgrade the tech tree, look at how much science you have, and look and science archives. The tech tree unlocks new parts for you, which you will spend your science points on. The science archives show your science reports and experiments data. The runway is where you launch space planes, but you have none. The launch pad is obviously where you launch rockets, but unless you have already started career mode, you probably won\u0027t have any rockets to load. The Astronaut Complex is where you hire astronauts. We will start at the VAB. The Tracking Station is where you can look through the Solar System, otherwise known as the Kerbol System, and look at all your flights and all the planets.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003EYour first ship\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EClick on the VAB. On the left is where you choose rocket parts. On the bottom right is staging. On the top right is where you can choose to launch, save, etc. The tier 0 tech tree gives you limited parts: Command Pod mk1, LV-T30 Liquid Fuel Engine, RT-10 Solid Fuel Booster, FL-T200 Fuel tank, Modular Girder Segment, mk16 Parachute, and Communotron 16. The Command Pod mk1 is where your crew will sit. You need this to use your rocket. Above the capsule selection window, there are tabs letting you choose which category of parts you are looking for. The LV-T30 Liquid Fuel Engine is a liquid fuel engine which runs on fuel you must supply with the FL-T200 Fuel Tank or any other fuel tank you have available. The RT-10 Solid Fuel Booster is a solid fuel rocket which runs on solid fuel which is already supplied in the rocket. You cannot add additionally fuel tanks to give these more fuel. All the fuel tanks in the game only work for liquid fuel engines or thrusters which you will be introduced to later in the game. You probably won\u0027t have a use for the Modular Girder Segment. It is just a girder for holding stuff on, with no other purpose then that. The mk16 Parachute is what you will need to attach on the top of your rockets to keep them from crashing into the ground. I advise you to \u003Cstrong\u003ENOT\u003C/strong\u003E use the Communotron 16 unless you are on a mission where you aren\u0027t intending to return home. The Communotron 16 uses a lot of ElectricCharge and usually only gives you a fraction of the science you would get by recovering the ship. Recoverying means you land it safely at Kerbin. Kerbin is the Kerbal Space Program representation of Earth. ElectricCharge is basically electricity. Early in the game, you generate ElectricCharge through using liquid fuel boosters. Now, click on the Command Pod mk1 to insert it into the ship-building area. Now you have built your first rocket. You aren\u0027t going anywhere, just launch it with the green button in the top right corner. You are now on the launch pad. Now right click on the capsule and click the \u0022Crew Report\u0022 button. From that you get 1.5 science. Nothing much. Now in the bottom right corner you see the Kerbal that you are using. Kerbals are the inhabitants of Kerbin. Move your mouse over the Kerbal, and click \u0022EVA\u0022. Before you do anything else, right click your kerbal and do an EVA report. 5.6 science is a pretty good amount when just starting career mode. Now right click the capsule and \u0022Store Experiments\u0022. Now press space bar and get off of the Capsule. From here, you can take a surface sample, do another EVA, or plant a flag. Do \u003Cstrong\u003ENOT\u003C/strong\u003E plant a flag, as it might mess up future ships by tipping them over, or the flag might just explode on contact. Now that you are on the surface of the Launchpad, do an EVA and a surface sample. You can use the WASD keys to move around. Now, walk up to the capsule\u0027s hatch and press F to grab onto the ship. Press F again to get in. Now, see at the top where it says 72 m? That means you are 72 meters above sea level. Once you are in you ship, mouse of where it says 72 m and another button will pop up saying \u0022Recover Vessel\u0022. Click on that button. And we earned 18.5 science just from that one mission! We are now back at the \u003Cstrong\u003EKSC\u003C/strong\u003E or \u003Cstrong\u003EK\u003C/strong\u003Eerbal \u003Cstrong\u003ES\u003C/strong\u003Epace \u003Cstrong\u003EC\u003C/strong\u003Eenter.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003EUnlocking Tech\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhat do we do with 18.5 science? Well, we can head over to the R\u0026amp;D facility which appears to be right below the VAB, where we build our first rocket. In the R\u0026amp;D facility, you will notice 2 tabs at the top left. Technology and Science archives. You can click on Science archives and look at your progress. For the technology tab, we can look at our current tech tree. The green square is the tier 0 tech, which we start with. The grey square is tech that we are available to unlock. Transparent dark grey squares which you will see later mean you can\u0027t yet research that until you research other technologies. Click on the grey square, and in the bottom right click \u0022Research [5 Science]\u0022. It will give you 4 new parts but take away 5 of your science, leaving you with 13.5. You will never need 0.5 science for anything, but it means you are closer to 1 extra science point. By researching that, you unlock FL-T400 Fuel Tank, FL-T100 Fuel Tank, Mystery Goo\u003Csup\u003ETM\u003C/sup\u003E Containment Unit, and the TR-18A Stack Decoupler. The FL-T400 Fuel tank and FL-T100 Fuel Tank are basically different sized fuel tanks, carrying more or less fuel. The Mystery Goo is another science experiment. The TR-18A Stack Decoupler adds staging, a big part to building massive and powerful rockets. With 13 science left, we have nothing left to research. The other techs cost 15, 18, and 20 science to research. Different experiments such as the Mystery Goo will give you science. You can also get science from Crew Reports, EVA Reports, and surface samples.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003ELaunching your first ship\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ENow press the red button in the upper right corner to go back to the KSC. Now go back into the VAB. This time we will be launching a rocket. You will probably still have your Command Pod mk1 in there. If you don\u0027t, insert another one. Now, look through the different part tabs and what they have. Remember the part tabs are in the top left. Now, go to the utilities tab and add the mk16 Parachute. Click on it, and move your mouse across the ship-building area. You will see that you are dragging the parachute. Move the parachute to the top of the ship. Click when the parachute turns green, meaning you are able to place it there. On the bottom left, you will notice some buttons. The green ones on the very bottom don\u0027t have much use right now. The ones above those, going from left to right, are the Symmetry buttons and the Angle Snap. The Symmetry button kind of looks like a pizza when you click on it. Clicking on the angle snap will turn it from a circle into a hexagon. You will usually want to keep it as a hexagon to keep your ship symmetrical. Click the symmetry button until it shows 2 triangles. This means what you put on one side of the ship will appear evenly on the other sides. Now. Right click to pan the camera until you are looking directly at the right or left side of the ship. Place a goo container on one side, and if it goes correctly, it should appear on the other side too. Now, go to the structural section, and click on the decoupler. Drag it and place it right under your ship. Now, go to the propulsion section and click on the\u003C/p\u003E\u003Cp\u003EFL-T400 Fuel Tank and place it right under the decoupler. Under that fuel tank add a LV-T30 Liquid Fuel Engine. You are done with your first rocket! Build it in this exact order and it should all go fine. Now click the launch button and try it! Wait for the pink light in the bottom left corner to turn green. Then hold shift. You will notice your throttle on the center bottom of your screen is going up. Wait until it is all they way up. You need throttle to launch liquid fuel rockets. Before you launch, right click the goo and click \u0022Observe Mystery Goo\u0022. You get 3.0 science. Now press space bar and launch your first rocket! Right after it launches, observe the other mystery go. Do \u003Cstrong\u003ENOT\u003C/strong\u003E observe the mystery goo that you observed at the launch pad. Observe the other one. 7.0 science. Now do a crew report from the command pod. Your work is done for now, just wait until your liquid fuel is drained, and your engine stops. Once your engine stops due to lack of fuel, press space bar to decouple the liquid fuel booster. Do \u003Cstrong\u003ENOT\u003C/strong\u003E try doing an EVA in the atmosphere above the surface. You will fall off your ship and die! After your liquid fuel booster has been decoupled, press space bar again to deploy the parachute. Hopefully you reached around 13,000-14,000 meters. If not, that\u0027s ok. All that matters is that you get the good science from the crew report and goo container. In the upper left, you will notice a couple of sideways arrows. That is the timewarp. It speeds up time to make long journeys only take a few minutes. You can use the time warp here to speed up time until you get to around 700 meters. Then turn off time warp. The parachute deploys 500 meters above the surface, and if you are timewarping when it deploys, the parachute will get blown off and you will fall down and die. When in the atmosphere, you can use the physics timewarp which goes up x4 the normal speed. When you are in space doing interplanetary space travel, you can travel up to x100,000 normal speed. Be careful to not blow off your parachute, or you will have to start over. When your parachute is deployed, you can timewarp until right before you hit the surface or you might explode. The crew report should give you 3.5 science. The goo experiment from the launch pad should earn you 3 science. The goo experiment from \u0022flying at Kerbin\u0022 should earn you 7 science. By recovering a vessel that \u0022survived a flight\u0022, you should earn 5 science just from that. We just earned 18.5 science from that mission and we should now have 32 science! Use 15 science and research \u0022Survivability\u0022. We will unlock the LV-909 Liquid Fuel Engine, LT-1 Landing Struts, and the mk2-R Radial Mount Parachute. We won\u0027t have much need for the radial mount parachute or landing struts for a while.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003EIn part 2, we will learn how to get into space and into orbit, as well as building new kinds of ships and more of the tech tree!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003ETo see my list of tutorials, click \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entries/1327-The-KerbalGuides-Series-Guides-on-how-to-do-various-things-in-KSP!\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003Ehere\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003E!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E--It turns out, I\u0027m not making a part 2. It\u0027s so hard, I write one paragraph then *something* causes the pages to refresh, making me lose the entire paragraph. This happened about 10 times and I gave up trying when my ship failed because of a glitch that hardly ever happens. And it was a flight that was about 20 minutes long. And I had to re-do it to keep goiSo yeah, I will continue making tutorials, but this series is discontinued.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-24T03:01:09Z\u0022 title=\u002202/24/2014 03:01  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 24, 2014\u003C/time\u003E by Clockwork13\u003C/strong\u003E\n\u003Cbr\u003EForgot something\n\u003C/span\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-02-23T15:10:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Clockwork13\u0022 data-cite=\u0022Clockwork13\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003EYour new space program\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E...The launch pad is obviously where you launch rockets, but unless you have already started career mode, you probably won\u0027t have any rockets to load. ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery good tutorial so far! As for the quote, I think you meant something like \u0022unless you have already been playing in career mode\u0022 , in regards to having existing craft files in the VAB.\u003C/p\u003E\u003Cp\u003ELooking forward to your continuation of this series!\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-24T03:01:27Z","Content":"\n\u003Cp\u003ESeries discontinued.\u003C/p\u003E\n"},{"CreatedByName":"generalguy26","CreatedById":83881,"CreatedDateTime":"2014-02-24T03:04:01Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:14px;text-align:left;\u0022\u003E[deleted]\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-21T23:57:36Z\u0022 title=\u002203/21/2023 11:57  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 21, 2023\u003C/time\u003E by generalguy26\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-24T03:34:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022generalguy26\u0022 data-cite=\u0022generalguy26\u0022\u003E\u003Cdiv\u003ERather than discontinuing the series, why not get someone else to do it (not me)?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I guess that would work.\u003C/p\u003E\u003Cp\u003EAnyway any experienced players who want to continue the series can PM me that they are going to.\u003C/p\u003E\n"}]}