{"TopicId":64149,"ForumId":16,"TopicTitle":"Stupid Question- orbit direction","CreatedByName":"Stewcumber","CreatedById":79928,"CreatedDateTime":"2014-02-24T10:37:56Z","PageNum":1,"Articles":[{"CreatedByName":"Stewcumber","CreatedById":79928,"CreatedDateTime":"2014-02-24T10:37:56Z","Content":"\n\u003Cp\u003EAll planets and moon in KSP orbit anticlockwise when looked from top down. Th is kind of \u0027left / east\u0027 when looking from the KSC in default map view. Do I want to be orbiting Kerbin in a clockwise (i.e \u0027intercepting Mun\u0027) or anticlockwise (i.e. catching up to the Mun) direction for trips to Mun and Minmus?\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-02-24T10:54:50Z","Content":"\n\u003Cp\u003E1. It is always easier to launch into an anti-clockwise orbit from Kerbin because you gain momentum (300m/s ?) from the existing rotation of the world.\u003C/p\u003E\u003Cp\u003E2. To go to Mun/Minmus you need to raise your apoapsis until it reaches their orbit. IE; burn prograde at the opposite point in your Kerbin orbit - whichever way around it is.\u003C/p\u003E\u003Cp\u003E3. When you get to the target you\u0027ll probably want to circularise your orbit around it. This is easier if you\u0027re \u0027catching up a bit\u0027 rather than \u0027whizzing past in the opposite direction\u0027.\u003C/p\u003E\u003Cp\u003ESo - \u003Cem\u003Ealways*\u003C/em\u003E orbit Kerbin anti-clockwise.\u003C/p\u003E\u003Cp\u003E[*Unless you don\u0027t want to]\u003C/p\u003E\u003Cp\u003EPS: waves from the coast further East of you :-)\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-24T12:04:57Z","Content":"\n\u003Cp\u003EAnticlockwise will have lower delta-V requirements, so it\u0027s usually the way to go. Less energy to launch, same energy to transfer, less energy to capture and land. \u003C/p\u003E\u003Cp\u003EWhen you do an anticlockwise Mun or Minmus transfer, you\u0027ll notice that you don\u0027t catch up to them, they catch up to you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-24T13:52:25Z","Content":"\n\u003Cp\u003EIn all honesty it really doesn\u0027t matter. you will spend a little more dV to get into a clockwise orbit around Kerbin (And any other body you are orbiting) because of the rotation of the planet. (For kerbin it is 174m/s, for the mun it is 9m/s) but considering most rockets are over engineered anyway it\u0027s not that big a loss. The issue comes when landing. If you are orbiting with the planets rotation (Anti-clockwise) then you will have to put the point at which your orbit intersects the ground before the point where you plan to touchdown. (Undershoot your LZ) whereas for a clockwise orbit you will need to overshoot the LZ.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-02-24T14:23:23Z","Content":"\n\u003Cp\u003EAlso, I think orbiting and intercepting retrograde can shorten your flight time.\u003C/p\u003E\u003Cp\u003EMy first landings on the Mun were retrograde, because it is pretty easy to literally line up and crash onto the surface. The orbital alignment felt much less complex than trying to \u0022meet up and orbit\u0022 when I was first learning how.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-02-25T01:08:34Z","Content":"\n\u003Cp\u003EIf you go anti-clockwise (prograde with respect to the planet\u0027s rotation), you\u0027ll be overtaking the moons from behind, with a bit of speed boost from the planet\u0027s rotation. If you go clockwise (retrograde), you\u0027ll be fighting the planet\u0027s rotation and scrambling to manage a head-on collision when you arrive at the moons. Therefore, it\u0027s easier to go prograde for the same reason that planes take off over the bow of a carrier and land on a carrier by approaching the ship from behind.\u003C/p\u003E\n"},{"CreatedByName":"pantner","CreatedById":83119,"CreatedDateTime":"2014-02-25T11:04:04Z","Content":"\n\u003Cp\u003Ecan\u0027t remember the names for the directions, but I\u0027ve seen people say that if going interplanetary then for the outer solar system you should turn to 90 degrees for your gravity turn, if you are going to the inner solar system then you should turn to 270 degrees.\u003C/p\u003E\n"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2014-02-25T11:28:55Z","Content":"\n\u003Cp\u003EIt doesn\u0027t matter either way: launching east (90) saves you ~ 300dV\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-25T11:34:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pantner\u0022 data-cite=\u0022pantner\u0022\u003E\u003Cdiv\u003Ecan\u0027t remember the names for the directions, but I\u0027ve seen people say that if going interplanetary then for the outer solar system you should turn to 90 degrees for your gravity turn, if you are going to the inner solar system then you should turn to 270 degrees.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it\u0027s better to go East for both scenarios. The dV saved by building on Kerbin\u0027s rotational speed rather than working against it is beneficial whether you\u0027re heading inbound or outbound. The only difference is where in your orbit you do your interplanetary burn (angle to prograde).\u003C/p\u003E\n"}]}