{"TopicId":64147,"ForumId":44,"TopicTitle":"oberth effect","CreatedByName":"JtPB","CreatedById":103925,"CreatedDateTime":"2014-02-24T09:48:16Z","PageNum":4,"Articles":[{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-02-25T16:41:00Z","Content":"\n\u003Cp\u003EActually I meant say an AP of 150k and a PE of 80k, then setting a node to burn to encounter between PE and AP, since you would have more velocity than in a circular orbit where AP and PE velocity are the same. (or setting the maneuver node on the \u0022bottom\u0022 half of the orbit, where velocity is higher). Although I don\u0027t really know if the velocity in that case would be higher than a circular velocity, I\u0027m making a pretty big assumption.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-25T16:43:16Z\u0022 title=\u002202/25/2014 04:43  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 25, 2014\u003C/time\u003E by xcorps\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2014-02-25T16:46:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003EWhy wouldn\u0027t you want an elliptical orbit to transfer to a satellite in the same SOI of Kerbin? Getting an elliptical is easier than climbing to altitude then burning for circular then burning incline then burning for Hohmann transfer isn\u0027t it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think just about anything wold be easier than what you just described...\u003C/p\u003E\u003Cp\u003EFor starters, you\u0027re almost always better off leaving the launchpad at or close to the inclination you want. If you time it right (launch just before KSC passes under the ascending/descending node of the target) you can match orbital planes very closely right from the start, and the extra dV you miss out on by not going due east is more than made up for by not trying to change your inclination later.\u003C/p\u003E\u003Cp\u003EYou don\u0027t always need to circularize immediately after reaching orbit and then proceed to a transfer maneuver. If you time it right you can go directly to the desired orbit.\u003C/p\u003E\u003Cp\u003EIf you must change your inclination by a lot after you\u0027re in orbit, you want to be going slow... so raise your Ap way, way up, change inclination, then lower it back down. If you only need a relatively small change, you can usually combine that into your transfer burn with minimal penalty.\u003C/p\u003E\u003Cp\u003EUltimately, unless your timing is perfect, you DO want your orbit to be slightly more or less elliptical than the target\u0027s... with either your Ap or Pe matching. This will mean your orbital periods will be slightly different and allow the two craft to eventually meet up.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-25T16:46:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003EActually I meant say an AP of 150k and a PE of 80k, then setting a node to burn to encounter between PE and AP, since you would have more velocity than in a circular orbit where AP and PE velocity are the same. (or setting the maneuver node on the \u0022bottom\u0022 half of the orbit, where velocity is higher). Although I don\u0027t really know if the velocity in that case would be higher than a circular velocity, I\u0027m making a pretty big assumption.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would just be splitting the transfer burn into two separate burns, compared to burning from an 80kmx80km orbit. The burn to make your orbit 150kmx80km would be identical to the start of a transfer burn, the second burn at periapsis would be the same as the finish of a single burn, so I don\u0027t think there\u0027d be any net gain.\u003C/p\u003E\u003Cp\u003EUnless, I suppose, your TWR is low enough that a significant part of the transfer burn would be away from periapsis, then it might be worthwhile.\u003C/p\u003E\n"},{"CreatedByName":"Nathair","CreatedById":102894,"CreatedDateTime":"2014-02-25T16:56:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003EStationary planets aren\u0027t actually very common, you know...\u003C/div\u003E\u003C/blockquote\u003EIn this context that doesn\u0027t seem to be true. \u0022Rogues\u0022 are looking very common, quite a bit more common than planets that actually do orbit stars.\u003Cp\u003ENot that that has anything to do with KSP...\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-02-25T16:57:08Z","Content":"\n\u003Cp\u003EWhat\u0027s a good margin for Incline? I\u0027ve been getting it to zero because I read somewhere it was important. I usually get into orbit around Kerbin with less than 1.5 difference, mostly less than 1 with respect to the Mun.\u003C/p\u003E\u003Cp\u003EThe reason I\u0027m curious is I\u0027m having difficulty getting Kerbonauts back from the Mun, I have no trouble at all with Minmus or probes.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-02-25T17:31:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nathair\u0022 data-cite=\u0022Nathair\u0022\u003E\u003Cdiv\u003EIn this context that doesn\u0027t seem to be true. \u0022Rogues\u0022 are looking very common, quite a bit more common than planets that actually do orbit stars.\u003Cp\u003ENot that that has anything to do with KSP...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0026lt;pedantic\u0026gt;Not orbiting a star doesn\u0027t mean its \u0022stationary\u0022. Everything in the galaxy is orbiting around the galactic centre and even extra-galactic rogues are still moving (and constantly being accelerated by gravity).\u0026lt;/pedantic\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"AlexisBV","CreatedById":81911,"CreatedDateTime":"2014-02-25T17:34:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe Oberth effect allows us to get more kinetic energy change from the same amount dV spent, and it is the kinetic energy change that is important. Think of dV as the currency spent to buy a change in kinetic energy. The Oberth effect allows you to buy at a discount.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome explanation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2014-02-25T19:35:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003E\u0026lt;pedantic\u0026gt;Not orbiting a star doesn\u0027t mean its \u0022stationary\u0022. Everything in the galaxy is orbiting around the galactic centre and even extra-galactic rogues are still moving (and constantly being accelerated by gravity).\u0026lt;/pedantic\u0026gt;\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENothing is stationary, and everything is stationary. As always, it depends on your point of view, or frame of reference to be pedantic.\u003C/p\u003E\u003Cp\u003EIt\u0027s all relative \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BrianMcNett","CreatedById":91783,"CreatedDateTime":"2014-02-25T19:52:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JtPB\u0022 data-cite=\u0022JtPB\u0022\u003E\u003Cdiv\u003Ecould you explain to me what exactly happens in oberth effect, \u0026amp; why it happens? (graphic illustration may very help)\u003Cp\u003Ei tried to read about it on wikipedia but i understood nothing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPut as basically as possible:\u003C/p\u003E\u003Cp\u003EIf your rocket is already in motion, acceleration along the direction of that motion is more efficient. Prograde burns at periapsis use less energy (because you are already in motion in that direction). Low altitude burns use less energy (because you are moving faster at low altitude than at a higher altitude). If you are standing still and fire your engines, you burn with the minimum efficiency. The same amount of force from a standstill gives you less delta-v than that equal amount of force if you are already in motion.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/U3oJhGgWog0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gEra14FVD4o?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-25T20:02:44Z","Content":"\n\u003Cp\u003E*Sigh* Oberth works for both prograde and retrograde, and Oberth does not change delta-V but instead increases kinetic energy change from expending delta-V.\u003C/p\u003E\u003Cp\u003EThis happens because the relationship between speed and kinetic energy is not linear, being \u0022in motion in that direction\u0022 has nothing to do with it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-25T20:07:40Z\u0022 title=\u002202/25/2014 08:07  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 25, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-02-25T20:19:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ESo you can see, that even though the same delta V was expended, the change in kinetic energy is an order of magnitude larger when burning at periapsis due to the Oberth effect.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst off, I think we\u0027re talking past each other a bit here, which I\u0027ll get into later. But for the moment, I\u0027m afraid I have to disagree with your math above. Those calculations have nothing to do with the Oberth Effect. What you\u0027ve done is simple vector addition, demonstrating the physical \u0022leverage\u0022 that causes you to make Ap changes at Pe anyway, Oberth or not. Also, you only added vectors at the point of the burn (Ap or Pe), without taking into account the resulting velocity change at the other end of the of the burn (Pe or Ap) caused by the burn.\u003C/p\u003E\u003Cp\u003EAnyway, back to Oberth being merely a fuel-efficiency thing we need not worry about.....\u003C/p\u003E\u003Cp\u003EEnergy isn\u0027t something you can measure directly, but only indirectly by its effects. That\u0027s why we have so many different types of energy: kinetic energy, thermal energy, gravitational potential energy, chemical potential energy, etc., each of which indirectly measures energy by looking changes in speed, temperature, altitude, etc.\u003C/p\u003E\u003Cp\u003EPhysically, spaceflight boils down simply to just moving from 1 orbit to another. You move from high orbits to low orbits, or parking to transfer orbits, etc., but you\u0027re always in an orbit (even if you\u0027re on the ground). All orbits have velocities directly associated with them, meaning spaceflight is all about changing the ship\u0027s velocity when and as needed to move from 1 orbit into the next. Because of this, kintetic energy is what\u0027s important to rockets; they convert the chemical potential energy in their fuel into kinetic energy to give them the velocity they need for the desired orbit. Thus, delta-V is the currency of spaceflight.\u003C/p\u003E\u003Cp\u003EHowever, it\u0027s essential to understand that the delta-V required to move from an arbitrary point along Orbit A into desired Orbit B is exclusively a function of vector math. The specifics of the ship involved have no effect at all on the delta-V required; all ships of whatever size and TWR require the same delta-V to make the same trip between the same 2 end points. You can easily see this is true in the game by switching to a new ship and plotting a maneuver for it before doing anything else to it. You will see the amount of delta-V required but the burn time will say \u0022N.A.\u0022 because the game doesn\u0027t know the TWR of the ship until you burn its engines. Thus, you don\u0027t need to know anything about the ship to determine the amount of delta-V needed for a maneuver.\u003C/p\u003E\u003Cp\u003EBut anyway, the delta-V required to do any given burn is determined solely by vector math. When creating, moving, and tweaking thrust direction gizmos on maneuver nodes, the game is doing vector math under the hood and you\u0027re just seeing the sums of the vectors.\u003C/p\u003E\u003Cp\u003ENow, given this, there\u0027s Oberth. Oberth has nothing to do with the amount of delta-V required by a burn; that\u0027s solely a vector math thing. Obeth therefore can only come into play during the burn. Oberth can\u0027t change the fixed amount of delta-V required by the burn, so the only benefit he can provide is making the burn more efficient. The ONLY way to make a burn more efficient is by allowing the ship to consume less fuel to reach its required delta-V total than the stats of its engine/fuel system would dictate on their own.\u003C/p\u003E\u003Cp\u003EAssuming the engine runs full throttle the whole burn, the rate of fuel consumption is constant throughout due to the engine\u0027s fixed vacuum Isp. Therefore, the only way to reduce the amount of fuel consumed in the burn is to make the burn time shorter. But the amount of delta-V required is still the same regardless of burn time. Therefore, the only way to decrease burn time for the fixed amount of delta-V is to accelerate faster, so you \u0022delta your V\u0022 faster. Which essentially means Oberth, if he exists in the game, is providing you with extra thrust.\u003C/p\u003E\u003Cp\u003EThe \u003Ca href=\u0022https://en.wikipedia.org/wiki/Oberth_effect\u0022 rel=\u0022external nofollow\u0022\u003EOberth Effect wiki page\u003C/a\u003E says this right off the top:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EThe Oberth effect occurs because the propellant has more usable energy due to its kinetic energy on top of its chemical potential energy. The vehicle is able to employ this kinetic energy to generate more mechanical power\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIOW, a given ship with a given engine burns X amount of fuel and gets Y amount of change in Ek purely from the combustion. Oberth then adds an extra amount Z of Ek change on top of this. Thus, the total Ek change is Y (from the fuel alone) \u002B Z (from Oberth). The mass change in burning the fuel is the same for both so both Y and Z can only be measured as changes in velocity AKA delta-V. So there it is: Oberth gives you more delta-V per unit of fuel burned than you get from the fuel alone. Therefore, Oberth is a fuel-efficiency thing. \u003C/p\u003E\u003Cp\u003E===============\u003C/p\u003E\u003Cp\u003EIn practical KSP gameplay terms, Oberth makes no difference to how we do things. If the game takes Herr Oberth into account, it does so totally \u0022under the hood\u0022 and there\u0027s nothing we can do about it. We create and manipulate a maneuver node, doing vector math under the hood, and this determines the delta-V required by the burn. We place our Pe\u0027s as low as possible and do our Ap-affecting burns there because the vector math says this minimizes the delta-V required. That this is also the best way to benefit from Herr Oberth, assuming he\u0027s in the game, is just icing on the cake. The presence or absence of Oberth doesn\u0027t change the way we do business. Hence, there\u0027s no point worrying about him. If he\u0027s there, we save some fuel. If he\u0027s not, then we don\u0027t. But we\u0027re still going to put our nodes where we do either way.\u003C/p\u003E\u003Cp\u003EBut despite it being immaterial, some folks might still lie awake at night stewing over Oberth is really in the game. Determining this will require some math I\u0027m afraid. Put a ship in LKO and create for it a prograde burn node of say 2000m/s or more. The bigger the better. Note the burn time the game calculates. Now you can calculate the burn time yourself, ignoring Oberth, and if yours is longer, then Oberth is in the game. You can also calculate the final mass of the rocket after the burn, then have MJ do the burn and see how the final mass comes out in the game. If your mass is lower, then Oberth is in the game.\u003C/p\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2014-02-25T20:51:52Z","Content":"\n\u003Cp\u003EA lot of people have mentioned that the Oberth effect gives you more energy for the same dV, but not many people have explained where that extra energy comes from. When you\u0027re accelerating a rocket, you\u0027re accelerating your remaining propellant as well as your payload. Your fuel is moving as fast as the rest of the rocket is, and as a result is has kinetic energy. Additionally, as your lift your propellant up into space and away from the planet, it\u0027s gaining potential energy. Typically we think of the energy in fuel as purely chemical energy that is released when the fuel is burned, however all three components must be added together to find the total available energy of the propellant.\u003C/p\u003E\u003Cp\u003EWhen we make a burn at periapsis (prograde for simplicity), several things are happening:\u003C/p\u003E\u003Cp\u003E1: We\u0027re combusting our propellant, extracting its latent chemical energy and using it to accelerate the exhaust gases out the nozzle and consequently accelerating our spaceship.\u003C/p\u003E\u003Cp\u003E2: We\u0027re at the lowest point in our orbit, meaning our spaceship has the lowest potential energy. Potential energy isn\u0027t really something that we can use to accelerate our spacecraft in a helpful way, so we want to trade it off for increased kinetic energy and more speed, which we can use.\u003C/p\u003E\u003Cp\u003E3: Since we\u0027re moving fastest at periapse, our propellant has the highest possible kinetic energy before it\u0027s burned (oftentimes this kinetic energy dwarfs its chemical energy!). When it exits the rocket nozzle, its velocity is equal to our current orbital velocity minus the rocket\u0027s exhaust velocity. When the rocket is traveling near the exhaust velocity, this number gets small, meaning our exhaust is left with a relatively small amount of kinetic energy. The best case scenario is when we\u0027re traveling exactly at the exhaust velocity - we\u0027re essentially leaving our exhaust motionless in space. Since energy is conserved in the rocket-exhaust system, our ship gains all the kinetic energy that our exhaust loses, and we fly away with the most possible energy extracted from our propellant.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003Elots of things!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you\u0027re a little confused about what exactly the Oberth effect is. You\u0027re talking about how it increases fuel efficiency, and you\u0027re technically right about that, but not in the way you explained. The Oberth effect can\u0027t magically increase the chemical energy available in the fuel, or the exhaust velocity of your engine. It doesn\u0027t do that in real life, and it doesn\u0027t do that in KSP. The reason burns higher velocity are more efficient is that your rocket is extracting the maximum total energy, chemical and kinetic, from your fuel.\u003C/p\u003E\u003Cp\u003EAdditionally, saying that the Oberth effect increases the dV from a burn is incorrect, because you\u0027re wrongly equating orbital energy and dV. If my spaceship is capable of an average acceleration of 10m/s^2, and I burn my engine for 10 seconds, I will be going 100m/s faster than I was before the burn. It doesn\u0027t matter what my initial speed was, accelerating at a given rate for a given time will always result in the same change in velocity. However, the same change in velocity does not always give you the same change in orbital energy.\u003C/p\u003E\u003Cp\u003EIt\u0027s not some magic device that makes your engine better, it\u0027s just a name for a specific consequence of physics.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-25T21:25:35Z\u0022 title=\u002202/25/2014 09:25  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 25, 2014\u003C/time\u003E by MockKnizzle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Oskar-","CreatedById":78952,"CreatedDateTime":"2014-02-25T22:15:11Z","Content":"\n\u003Cp\u003EI\u0027ll jump in here to just lay out the basics in a way that I figured out to help me understand why this occurs. That was actually for race car performance simulation stuff, but physics are of course the same for everything.\u003C/p\u003E\u003Cp\u003EPower = Energy / time\u003C/p\u003E\u003Cp\u003EEnergy = Force * distance\u003C/p\u003E\u003Cp\u003Evelocity = distance / time\u003C/p\u003E\u003Cp\u003EForce = mass * acceleration\u003C/p\u003E\u003Cp\u003E(now some of those variables represent physically measurable entities, and some are purely imaginary mathematical values, but that\u0027s not important here)\u003C/p\u003E\u003Cp\u003ESo:\u003C/p\u003E\u003Cp\u003EP=E/t, and E=F*s, so:\u003C/p\u003E\u003Cp\u003EP=F*s/t, but v=s/t, so:\u003C/p\u003E\u003Cp\u003EP=Fv, but F=ma, so:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP=mav\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EPower = mass * acceleration * velocity\u003C/p\u003E\u003Cp\u003ESo, if you produce some acceleration on some mass, then the faster that mass is going, the more power is used/produced/converted.\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t matter if it\u0027s a rocket, a volleyball, a race car, a proton in a particle accelerator, or a bullet. It doesn\u0027t matter if this acceleration is produced by throwing some mass in some direction, by a magnetic force, by gravity, or whatever.\u003C/p\u003E\u003Cp\u003ERockets conveniently work by pushing on mass that is initially traveling at the same speed as the engine, so the acceleration is constant (for a given force and mass), regardless of v.\u003C/p\u003E\u003Cp\u003ESo the end result is; \u003Cstrong\u003Eif you burn at double the velocity, your engine produces twice as much power\u003C/strong\u003E! (with the same amount of fuel used, with the same Isp, naturally)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-25T23:06:48Z\u0022 title=\u002202/25/2014 11:06  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 25, 2014\u003C/time\u003E by Oskar-\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2014-02-25T22:19:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBut despite it being immaterial, some folks might still lie awake at night stewing over Oberth is really in the game. Determining this will require some math I\u0027m afraid. Put a ship in LKO and create for it a prograde burn node of say 2000m/s or more. The bigger the better. Note the burn time the game calculates. Now you can calculate the burn time yourself, ignoring Oberth, and if yours is longer, then Oberth is in the game. You can also calculate the final mass of the rocket after the burn, then have MJ do the burn and see how the final mass comes out in the game. If your mass is lower, then Oberth is in the game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESadly the maneuver node\u0027s burn time estimation doesn\u0027t take the rising TWR as you burn fuel into account, so this won\u0027t work. You might be able to use Kerbal Engineer though, it gives you a calculated dV of your current fuel load. If you burn what KE says is 1000m/s of fuel and gain 1010m/s velocity, say Hi to Oberth. KE does \u003Cem\u003Enot\u003C/em\u003E change those dV numbers based on your current speed or location, so it at least is definitely not Oberth Aware.\u003C/p\u003E\u003Cp\u003EPersonally I\u0027d be extremely surprised if the devs put Oberth in.\u003C/p\u003E\u003Cp\u003EYou could always ask them.\u003C/p\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2014-02-25T22:58:17Z","Content":"\n\u003Cp\u003EIf KSP abides by normal Newtonian physics, then the Oberth effect is \u003Cem\u003Eby default\u003C/em\u003E in the game. You don\u0027t have to code up anything special. It is a consequence of physics, nothing more. Doppler effect, Hall effect, Leidenfrost effect, Oberth effect... all of these are simply interesting (and useful) consequences of the underlying physical framework of the universe.\u003C/p\u003E\n"},{"CreatedByName":"Nathair","CreatedById":102894,"CreatedDateTime":"2014-02-25T23:00:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003E\u0026lt;pedantic\u0026gt;Not orbiting a star doesn\u0027t mean its \u0022stationary\u0022. Everything in the galaxy is orbiting around the galactic centre and even extra-galactic rogues are still moving (and constantly being accelerated by gravity).\u0026lt;/pedantic\u0026gt;\u003C/div\u003E\u003C/blockquote\u003EThe explicit context of the comment we were quoting was \u0022stationary planets\u0022 vs \u0022planet orbiting another body\u0022, not \u003Cem\u003Emy\u003C/em\u003E fault if the original was a gross misuse of the term \u0022stationary\u0022. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-02-25T23:47:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EThat\u0027s true, but if you do burn near the periapsis, you are utilizing Oberth effect.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E100% agree, you then get a double boost, but we shouldn\u0027t conflate the two, its complicated enough already.\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-02-26T00:02:02Z","Content":"\n\u003Cp\u003ELots of people don\u0027t seem to be getting this, I will try to explain with an example that can be verified in game. The bi-elliptic transfer\u003C/p\u003E\u003Cp\u003ELet\u0027s say we have launched a satellite, the launch vehicle has delivered it to a circular orbit at an altitude of 100km. The intended orbit of the satellite is a circular orbit at an altitude of 10000km\u003C/p\u003E\u003Cp\u003EFor a simple Hohmann transfer an 830m/s would raise the apoapsis to the desired altitude, then at apoapsis a 374m/s burn would circularize. a total of 1204m/s required to make the transfer.\u003C/p\u003E\u003Cp\u003EBut lets say we make a longer initial burn, 917m/s instead of 830. this will raise our apoapsis almost to the edge of Kerbins SOI\u003C/p\u003E\u003Cp\u003EThen when we reach that apoapsis we make a 71m/s prograde burn. this will raise the periapsis to the desired altitude. \u003C/p\u003E\u003Cp\u003EFinally when we reach that periapsis we need a 192m/s burn to circularize.\u003C/p\u003E\u003Cp\u003EThe same transfer was made for 1180m/s \u003C/p\u003E\u003Cp\u003EWe burned for longer in the fast 100km orbit, and also we were going faster when we circularized. Whe the target orbits SMA is large enough compared to the initial orbit (*12), the gains in the circularization burn, more than make up for the extra cost in the initial burn.\u003C/p\u003E\u003Cp\u003EThis is the Oberth effect in action.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-26T00:27:19Z\u0022 title=\u002202/26/2014 12:27  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 26, 2014\u003C/time\u003E by Rhomphaia\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2014-02-26T00:13:05Z","Content":"\n\u003Cp\u003EI kind of doubt that the KSP engine models the kinetic energy change of the fuel, personally. Or even the kinetic energy of the fuel in the first place. Or even the \u003Cem\u003Eenergy\u003C/em\u003E of the fuel, really.\u003C/p\u003E\u003Cp\u003EIf you want to have doppler effect in a game, you have to code it. It\u0027s not there by default. Photons are not being simulated, nor are sound waves, nor are any other waves. No waves = no doppler.\u003C/p\u003E\u003Cp\u003ENor is the hall effect, as there are no electrons in KSPs physics model.\u003C/p\u003E\u003Cp\u003EThe Leidenfrost effect certainly isn\u0027t in KSP, as \u003Cem\u003Etemperature\u003C/em\u003E is barely modeled, let alone state transitions.\u003C/p\u003E\u003Cp\u003EThe underlying physical framework of the universe is not what KSP is running! KSP is running a simulation, there\u0027s a very large difference. Not only that, but it\u0027s running an extremely simplified simulation. The planets don\u0027t have gravity for the same reason the real universe does (unless the \u0022real universe\u0022 is a simulation too of course), nor do the atmospheres exist for the same reason or in the same way. Same goes for water. Same goes for electricity. Same goes for fuel. That\u0027s a doozy really!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EFuel is not burnt in KSP, and there is no exhaust.\u003C/em\u003E The engines exert a push of a given amount in a given direction when they are running, to do so there must be a positive value in variable X. For every Y milliseconds the engine runs at Z throttle, it lowers the value in X by Z * whateverTheEngineLowersTheFuelByAtFullThrottleAtThis\u0022Atmospheric\u0022Pressure.\u003C/p\u003E\u003Cp\u003EThere is no chemical reaction, there is no expansion chamber, there is no exhaust. You can tell easily that this is the case by the fact that KSP will run on a single CPU core.\u003C/p\u003E\u003Cp\u003EEver tried to do a liquid flow analysis on a consumer PC? Actually simulating those particles takes a hell of a lot of resources. Far, far, far more than a single consumer CPU core can manage in real time.\u003C/p\u003E\u003Cp\u003EKSP is a wonderful game and I love it deeply, but don\u0027t confuse a game-type \u0022simulation\u0022 with an actual model of the underlying physical framework of the universe.\u003C/p\u003E\n"},{"CreatedByName":"MoonMan22","CreatedById":78400,"CreatedDateTime":"2014-02-26T00:27:22Z","Content":"\n\u003Cp\u003EThe effect has to do with making your burns deep inside the gravity well without entering the atmosphere. Here is a video that does a pretty good job of explaining it.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gEra14FVD4o?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-26T00:35:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EFirst off, I think we\u0027re talking past each other a bit here, which I\u0027ll get into later. But for the moment, I\u0027m afraid I have to disagree with your math above. Those calculations have nothing to do with the Oberth Effect. What you\u0027ve done is simple vector addition, demonstrating the physical \u0022leverage\u0022 that causes you to make Ap changes at Pe anyway, Oberth or not. Also, you only added vectors at the point of the burn (Ap or Pe), without taking into account the resulting velocity change at the other end of the of the burn (Pe or Ap) caused by the burn.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m happy to discuss this further, my understanding of the Oberth effect certainly could be flawed. I\u0027m not a rocket scientist by training or profession, I only play one in KSP.\u003C/p\u003E\u003Cp\u003EThe math I posted is certainly simplified, as it assumes an instantaneous burn among other things. But it is a valid approximation of the Oberth effect. It really is simple vector addition. Certainly, when at the other apsis of the orbit, the speed will be very different than when the burn occured, but, and this is the important part, \u003Cem\u003Ethe total orbital energy of the craft will be the same.\u003C/em\u003E Orbital energy is the sum of the potential energy (a function of mass, gravitational force, and altitude) and kinetic energy (a function of mass and the square of speed). So whatever energy is added at one apsis will still be present at the other apsis, it will just have a different distribution between potential and kinetic.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnyway, back to Oberth being merely a fuel-efficiency thing we need not worry about.....\u003Cp\u003EEnergy isn\u0027t something you can measure directly, but only indirectly by its effects. That\u0027s why we have so many different types of energy: kinetic energy, thermal energy, gravitational potential energy, chemical potential energy, etc., each of which indirectly measures energy by looking changes in speed, temperature, altitude, etc.\u003C/p\u003E\u003Cp\u003EPhysically, spaceflight boils down simply to just moving from 1 orbit to another. You move from high orbits to low orbits, or parking to transfer orbits, etc., but you\u0027re always in an orbit (even if you\u0027re on the ground). All orbits have velocities directly associated with them, meaning spaceflight is all about changing the ship\u0027s velocity when and as needed to move from 1 orbit into the next. Because of this, kintetic energy is what\u0027s important to rockets; they convert the chemical potential energy in their fuel into kinetic energy to give them the velocity they need for the desired orbit. Thus, delta-V is the currency of spaceflight.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECareful here, you need to remember that delta-V is not a measure of energy, it is a measure of potential velocity change. Delta-V is in units of m/s, energy is in units of Joules, which is shorthand for kg*m\u003Csup\u003E2\u003C/sup\u003E/s\u003Csup\u003E2\u003C/sup\u003E. Obviously, these are not interchangeable units. It is possible to consume delta-V without changing orbital energy, by burning in a direction perpendicular to prograde (normal, antinormal, radial, antiradial and all points between). The eccentricity or inclination will change, but the sum of potential and kinetic energy will not.\u003C/p\u003E\u003Cp\u003EI\u0027m sure you are familiar with the Tsiolkovsky rocket equation for calculating delta-V, and that the only factors used in calculating delta-V are initial mass, final mass and specific impulse. You\u0027ll note that speed does not appear in that equation, so delta-V obviously does not vary with speed, ever. So it cannot be that the Oberth effect, which is speed related, changes the amount of delta-V in a given craft.\u003C/p\u003E\u003Cp\u003EIt can be easily demonstrated that the amount of energy extractable from a given amount of delta-V varies with speed, and this is the heart of the Oberth effect. Consider the following:\u003C/p\u003E\u003Cp\u003ETwo identical 1-ton craft perform a 100m/s prograde burn consuming 0.1t of propellant, with one (F) having an initial speed of 200m/s and the other (S) having an initial speed of 100m/s. Let\u0027s calculate their change in kinetic energy:\u003C/p\u003E\u003Cp\u003EDelta-KE\u003Csub\u003EF\u003C/sub\u003E = E\u003Csub\u003EF-Final\u003C/sub\u003E - E\u003Csub\u003EF-Initial\u003C/sub\u003E\u003C/p\u003E\u003Cp\u003E= 1/2m\u003Csub\u003EFinal\u003C/sub\u003Ev\u003Csub\u003EFinal\u003C/sub\u003E\u003Csup\u003E2\u003C/sup\u003E - 1/2m\u003Csub\u003EInitial\u003C/sub\u003Ev\u003Csub\u003EInitial\u003C/sub\u003E\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E= 1/2*0.9*300\u003Csup\u003E2\u003C/sup\u003E - 1/2*1.0*200\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E= 40,500 - 20,000\u003C/p\u003E\u003Cp\u003E= 20,500 KJ\u003C/p\u003E\u003Cp\u003EDelta-KE\u003Csub\u003ES\u003C/sub\u003E = E\u003Csub\u003ES-Final\u003C/sub\u003E - E\u003Csub\u003ES-Initial\u003C/sub\u003E\u003C/p\u003E\u003Cp\u003E= 1/2m\u003Csub\u003EFinal\u003C/sub\u003Ev\u003Csub\u003EFinal\u003C/sub\u003E\u003Csup\u003E2\u003C/sup\u003E - 1/2m\u003Csub\u003EInitial\u003C/sub\u003Ev\u003Csub\u003EInitial\u003C/sub\u003E\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E= 1/2*0.9*200\u003Csup\u003E2\u003C/sup\u003E - 1/2*1.0*100\u003Csup\u003E2\u003C/sup\u003E\u003C/p\u003E\u003Cp\u003E= 18,000 - 5,000\u003C/p\u003E\u003Cp\u003E= 13,000 KJ\u003C/p\u003E\u003Cp\u003EFrom this, it should be clear that the faster a craft is going, the more kinetic energy is extracted from a given amount of delta-V. This is because of the non-linear, geometric relationship between speed and kinetic energy.\u003C/p\u003E\u003Cp\u003ELet\u0027s refine that example. Instead of two craft, make it one craft in an eccentric orbit with a speed 100m/s at apoapsis and 200m/s at periapsis. The same calculations above apply. But, you may ask, how can the energy delivered by the burn vary for the same craft in one orbit? Where does the energy come from? Doesn\u0027t that violate conservation of energy?\u003C/p\u003E\u003Cp\u003EThe answer is that our fuel contains more than just chemical energy. It contains potential energy, kinetic energy, and chemical energy. Let\u0027s look at these more closely:\u003C/p\u003E\u003Cp\u003EChemical energy is the most familiar, and is a fixed quantity. This is extracted to complete the burn.\u003C/p\u003E\u003Cp\u003EPotential energy is based on altitude, and cannot be changed in our instantaneous burn, so we cannot use this energy.\u003C/p\u003E\u003Cp\u003EKinetic energy is based on the square of speed, which can be utilized via the Oberth effect.\u003C/p\u003E\u003Cp\u003EAt apoapsis, more of the fuel\u0027s total energy is \u0022locked away\u0022 in potential energy, where it cannot be used to change our orbital energy. Less of it is kinetic energy, which can be used.\u003C/p\u003E\u003Cp\u003EAt periapsis, less of the energy is in potential energy where it cannot be used and more of it is kinetic energy, which can be.\u003C/p\u003E\u003Cp\u003ESo, while total energy remains the same at both apses, the energy that can be used to change orbital energy is greatest at periapsis, when the largest fraction of the fuel\u0027s total energy is kinetic.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHowever, it\u0027s essential to understand that the delta-V required to move from an arbitrary point along Orbit A into desired Orbit B is exclusively a function of vector math. The specifics of the ship involved have no effect at all on the delta-V required; all ships of whatever size and TWR require the same delta-V to make the same trip between the same 2 end points. You can easily see this is true in the game by switching to a new ship and plotting a maneuver for it before doing anything else to it. You will see the amount of delta-V required but the burn time will say \u0022N.A.\u0022 because the game doesn\u0027t know the TWR of the ship until you burn its engines. Thus, you don\u0027t need to know anything about the ship to determine the amount of delta-V needed for a maneuver.\u003Cp\u003EBut anyway, the delta-V required to do any given burn is determined solely by vector math. When creating, moving, and tweaking thrust direction gizmos on maneuver nodes, the game is doing vector math under the hood and you\u0027re just seeing the sums of the vectors.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree that my math is not complete, as I was trying to make an example in which all the numbers were simple and no calculus was involved.\u003C/p\u003E\u003Cp\u003EHowever, it\u0027s generally good form when criticizing someone\u0027s math to provide better math to replace it. All you\u0027ve provided is some vague handwaving about vector math (and claiming that vector addition is not vector math!). So I will ask you respectfully to either provide better math for my example or accept it as a reasonable approximation.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENow, given this, there\u0027s Oberth. Oberth has nothing to do with the amount of delta-V required by a burn; that\u0027s solely a vector math thing. Obeth therefore can only come into play during the burn. Oberth can\u0027t change the fixed amount of delta-V required by the burn, so the only benefit he can provide is making the burn more efficient. The ONLY way to make a burn more efficient is by allowing the ship to consume less fuel to reach its required delta-V total than the stats of its engine/fuel system would dictate on their own.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOberth most certainly \u003Cem\u003Edoes\u003C/em\u003E change the amount of delta-V required, that\u0027s the whole point!\u003C/p\u003E\u003Cp\u003EHere\u0027s the thing: delta-V doesn\u0027t change your orbit directly, it changes your speed, which affects your total orbital energy. This is an important distinction, because differing amounts of energy are contained in a m/s depending on how fast you\u0027re going (see my math example above again).\u003C/p\u003E\u003Cp\u003EThis is trivial to test in KSP. Put identical ships into circular orbits at differing altitudes (and thus differing speeds). You will agree, I\u0027m sure that the higher orbit is a higher energy orbit (it cost more dV to get there) even though its speed is lower. Now plot an interplanetary transfer to the same target from both orbits and you\u0027ll see that the higher orbit requires more delta-V, even though it\u0027s a higher energy orbit and is attempting to transfer to the same target. The reason for this is that more of its fuel\u0027s energy is trapped as potential energy which doesn\u0027t help us, while the lower orbiting ship\u0027s fuel has more kinetic energy which does help us. (Incidentally, this also demonstrates that Oberth is alive and well in KSP)\u003C/p\u003E\u003Cp\u003EYou might be wondering how delta-V maps work if transfers cost different amounts from different orbits. The answer is to look closely at the map. It \u003Cem\u003Ealways\u003C/em\u003E specifies the altitude of the low orbit that is the first node away from a body. Which means the velocity is known, and thus the Oberth effect can be taken into account. You\u0027ll also notice that there are no circularization nodes between two bodies, only transfers and escape/captures. The map is assuming you will make your entire transfer burn from the low orbit to fully harness Oberth\u0027s advantage.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAssuming the engine runs full throttle the whole burn, the rate of fuel consumption is constant throughout due to the engine\u0027s fixed vacuum Isp. Therefore, the only way to reduce the amount of fuel consumed in the burn is to make the burn time shorter. But the amount of delta-V required is still the same regardless of burn time. Therefore, the only way to decrease burn time for the fixed amount of delta-V is to accelerate faster, so you \u0022delta your V\u0022 faster. Which essentially means Oberth, if he exists in the game, is providing you with extra thrust.\u003Cp\u003EThe \u003Ca href=\u0022https://en.wikipedia.org/wiki/Oberth_effect\u0022 rel=\u0022external nofollow\u0022\u003EOberth Effect wiki page\u003C/a\u003E says this right off the top:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EThe Oberth effect occurs because the propellant has more usable energy due to its kinetic energy on top of its chemical potential energy. The vehicle is able to employ this kinetic energy to generate more mechanical power\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIOW, a given ship with a given engine burns X amount of fuel and gets Y amount of change in Ek purely from the combustion. Oberth then adds an extra amount Z of Ek change on top of this. Thus, the total Ek change is Y (from the fuel alone) \u002B Z (from Oberth). The mass change in burning the fuel is the same for both so both Y and Z can only be measured as changes in velocity AKA delta-V. So there it is: Oberth gives you more delta-V per unit of fuel burned than you get from the fuel alone. Therefore, Oberth is a fuel-efficiency thing. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are assuming that a larger change in kinetic energy equals a larger change in velocity, which is not so. Two equal changes in velocity can have differing changes in kinetic energy, depending on the initial velocity, because kinetic energy is proportional to the square of velocity. The fuel consumed in both changes is the same, though.\u003C/p\u003E\u003Cp\u003ESorry for this very long and wordy post, but you obviously put a lot of time and thought into yours and I felt I should do the same. If you see where I\u0027ve made an error or obvious misstep, please point it out. It is entirely possible that I don\u0027t understand this as well as I think I do.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-02-26T00:37:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MockKnizzle\u0022 data-cite=\u0022MockKnizzle\u0022\u003E\u003Cdiv\u003EI think you\u0027re a little confused about what exactly the Oberth effect is. You\u0027re talking about how it increases fuel efficiency, and you\u0027re technically right about that, but not in the way you explained. The Oberth effect can\u0027t magically increase the chemical energy available in the fuel, or the exhaust velocity of your engine. It doesn\u0027t do that in real life, and it doesn\u0027t do that in KSP. The reason burns higher velocity are more efficient is that your rocket is extracting the maximum total energy, chemical and kinetic, from your fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought that\u0027s what I said \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAdditionally, saying that the Oberth effect increases the dV from a burn is incorrect, because you\u0027re wrongly equating orbital energy and dV. If my spaceship is capable of an average acceleration of 10m/s^2, and I burn my engine for 10 seconds, I will be going 100m/s faster than I was before the burn. It doesn\u0027t matter what my initial speed was, accelerating at a given rate for a given time will always result in the same change in velocity. However, the same change in velocity does not always give you the same change in orbital energy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI never said Oberth increased, or in fact had anything to do with, the delta-V of the burn. The delta-V of the burn is the amount that vector math dictates is needed to move from your current orbit to the desired orbit. For any given burn, this is a fixed amount due to the geometry of the situation. The question is, how much fuel does the ship need to burn to change its velocity by the amount needed?\u003C/p\u003E\u003Cp\u003EYou cannot measure energy directly. You can only infer its presence from the changes it causes. In the case of kinetic energy, you measure it mostly by noting the change in velocity before and after, because in most cases, the mass change is way less significant than the square of the velocity. So if Oberth does anything at all for you, it will give you a greater change in velocity than the engine itself would have from burning a given amount of fuel. In real life, Oberth does this by sucking Ek out of the exhaust and applying it to the ship, which makes the ship go faster, which is the measurable result.\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-02-26T00:56:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EI thought that\u0027s what I said \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003Cp\u003ESo if Oberth does anything at all for you, it will give you a greater change in velocity than the engine itself would have from burning a given amount of fuel. In real life, Oberth does this by sucking Ek out of the exhaust and applying it to the ship, which makes the ship go faster, which is the measurable result.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, The Oberth effec does not let you increase the DeltaV available to your ship. rathe an understanding of the effect lets you minimize the deltaV requirements for a given maneuver. Check my \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/70685-oberth-effect?p=991141\u0026amp;viewfull=1#post991141\u0022 rel=\u0022external nofollow\u0022\u003Eprevious post\u003C/a\u003E for a working example\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2014-02-26T01:18:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EFuel is not burnt in KSP\u0027 date=\u0027 and there is no exhaust.[/i\u0027] The engines exert a push of a given amount in a given direction when they are running, to do so there must be a positive value in variable X. For every Y milliseconds the engine runs at Z throttle, it lowers the value in X by Z * whateverTheEngineLowersTheFuelByAtFullThrottleAtThis\u0022Atmospheric\u0022Pressure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot that it matters, because Oberth manifests itself anyway simply because the game understands and implements basic Newtonian physics. It does not require additional simulation.\u003C/p\u003E\u003Cp\u003EForce = Mass * Acceleration. Engines provide the force, the ship has mass, and therefore the ship is given an acceleration.\u003C/p\u003E\u003Cp\u003EWork = Force * Distance. Engine provides force, the ship is moving (at an ever increasing rate.) Work is being done even if the game does not explicitly calculate it.\u003C/p\u003E\u003Cp\u003EThe engine \u0022burns\u0022 a certain amount of fuel every second. During that second, the ship will cover some finite distance (S = V*t \u002B 0.5*a* t^2). Therefore, that amount of fuel can be equated to a certain distance traveled, as a function of velocity and acceleration.\u003C/p\u003E\u003Cp\u003ESince engine force is constant, and fuel use per distance traveled is a function of velocity and acceleration, then the faster you are moving the more distance you travel per second. And since fuel use rate is also constant, then the faster you travel, the farther you travel per unit of fuel consumed.\u003C/p\u003E\u003Cp\u003ETherefore! Since work is force multiplied by \u003Cem\u003Edistance\u003C/em\u003E, and the faster you are going the larger the distance \u003Cem\u003Eper unit fuel consumed\u003C/em\u003E, then the faster you are going the more work is being done \u003Cem\u003Eper unit fuel consumed\u003C/em\u003E. And you never had to actually calculate energy or work for this to happen - it just \u003Cem\u003Ehappens\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003ELet\u0027s glue all of that together:\u003C/p\u003E\u003Cp\u003EWork = delta-Ek = delta-(0.5 * Mass * Velocity^2) = Force * Distance = Force * (Velocity * Time \u002B 0.5 * Acceleration * Time^2)\u003C/p\u003E\u003Cp\u003EIt\u0027s pretty easy to see that the change in kinetic energy (and therefore the change in velocity) is dependent upon your \u003Cem\u003Ecurrent\u003C/em\u003E velocity. That\u0027s Oberth \u003Cem\u003Ewrit large\u003C/em\u003E and you don\u0027t need to do any special simulation to make it work.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EOberth most certainly \u003Cem\u003Edoes\u003C/em\u003E change the amount of delta-V required, that\u0027s the whole point!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, no it does not. You seem to be confusing delta-V as some sort is discrete physical quantity, rather than a convenient way to express specific energy (energy per unit mass) of the craft. If you are in an orbit at R1 and want to be in an orbit at R2, you need to change the \u003Cem\u003Especific energy\u003C/em\u003E of your craft by some amount. You effectively do that by changing your velocity (since conservation of momentum prohibits you from magically decreasing your mass without consequence) which is expressed \u0022delta-V\u0022 - literally \u0022the change in velocity.\u0022 Oberth can\u0027t affect the amount you need to change your specific energy, only how much fuel you need to spend to make it happen.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-02-26T01:19:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EI never said Oberth increased, or in fact had anything to do with, the delta-V of the burn.\u003C/strong\u003E The delta-V of the burn is the amount that vector math dictates is needed to move from your current orbit to the desired orbit. For any given burn, this is a fixed amount due to the geometry of the situation. The question is, how much fuel does the ship need to burn to change its velocity by the amount needed?\u003Cp\u003EYou cannot measure energy directly. You can only infer its presence from the changes it causes. In the case of kinetic energy, you measure it mostly by noting the change in velocity before and after, because in most cases, the mass change is way less significant than the square of the velocity. \u003Cstrong\u003ESo if Oberth does anything at all for you, it will give you a greater change in velocity than the engine itself would have from burning a given amount of fuel.\u003C/strong\u003E In real life, Oberth does this by sucking Ek out of the exhaust and applying it to the ship, which makes the ship go faster, which is the measurable result.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe need a /kerbalheaddesk ... the bolded parts are directly contradictory.\u003C/p\u003E\u003Cp\u003EThe Oberth effect does not increase delta-v in the slightest, but alters the NEEDED delta-v by altering the energy state of the orbit by a greater amount when at periapsis (and therefore at a higher speed relative to the body being orbited). You know what, if you want a rehash of the math, look at somebody else\u0027s post...\u003C/p\u003E\n"}]}