{"TopicId":64180,"ForumId":32,"TopicTitle":"Do you SAS your Aircraft?","CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-02-24T20:04:28Z","PageNum":1,"Articles":[{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-02-24T20:04:28Z","Content":"\n\u003Cp\u003EWhen you build aircraft, do you put reaction wheels in them?\u003C/p\u003E\u003Cp\u003EI don\u0027t play with FAR, but I\u0027m interested to hear from both FAR and non-FAR (close?) players.\u003C/p\u003E\u003Cp\u003EI do, actually quite a few in large or very fast aircraft. Generally its about 1 reaction wheel per jet engine but on some of my really big SSTOs I\u0027ve used more. \u003C/p\u003E\u003Cp\u003EI find it helps in a number of ways; \u003C/p\u003E\u003Cp\u003E- Reducing the impact of flame-out spins, or at least enabling faster correction if you spin out of control. \u003C/p\u003E\u003Cp\u003E- It helps compensate for a shift in COM in large aircraft as the fuel is used or when carrying different payloads. This has helped quite a lot with keeping large SSTO\u0027s steady during re-entry to the lower atmo and stopping them from tumbling.\u003C/p\u003E\u003Cp\u003E- On very high speed craft I\u0027ve found it helps with maneuverability and just keeping them steady. This is with craft that are so fast (200ms\u002B at sea level) that large control surfaces cause them to vibrate and judder, with a couple of reaction wheels I can use small control surfaces (and get rid of juddering) and still have control.\u003C/p\u003E\u003Cp\u003EBut I do feel this is perhaps not strictly plane! I mean real aircraft don\u0027t have gyroscopes do they? \u003C/p\u003E\u003Cp\u003EWhat do you think?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-02-24T20:11:54Z","Content":"\n\u003Cp\u003EI\u0027ve never added reaction wheels to an aircraft, but I certainly use the torque from and cockpits or crew pods it has. I know some people like to disable that torque to just fly with aerodynamic controls.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-24T20:15:05Z","Content":"\n\u003Cp\u003EDo I sass my aircraft?\u003C/p\u003E\u003Cp\u003EOf course I do.\u003C/p\u003E\u003Cp\u003ENow do I actually SAS my aircraft?\u003C/p\u003E\u003Cp\u003EI do on the initial accleration into orbit, but not on the runway and below 5K meters.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-24T20:17:23Z\u0022 title=\u002202/24/2014 08:17  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 24, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-02-24T20:15:27Z","Content":"\n\u003Cp\u003EI\u0027ve never really thought of using reaction wheels on aircraft, I can see how there would be advantages though, but then my planes don\u0027t tend to be very large.\u003C/p\u003E\u003Cp\u003EMost real aircraft use gyros for instruments, and some like \u003Ca href=\u0022https://en.wikipedia.org/wiki/Stratospheric_Observatory_for_Infrared_Astronomy\u0022 rel=\u0022external nofollow\u0022\u003ESOFIA\u003C/a\u003E use gyros for stability.\u003C/p\u003E\n"},{"CreatedByName":"WhiteKnuckle","CreatedById":101722,"CreatedDateTime":"2014-02-24T20:17:48Z","Content":"\n\u003Cp\u003EFor space planes it\u0027s a must for me. Lets you rotate the craft quickly without wasting RCS fuel (so you don\u0027t have to carry much of it) or if you run out of RCS you could even pull off a docking maneuver with the main engines if you\u0027re good.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-02-24T20:20:02Z","Content":"\n\u003Cp\u003EI always just throw one on without thought of how it will affect my plane/SSTO.\u003C/p\u003E\n"},{"CreatedByName":"Cakeofruit","CreatedById":73238,"CreatedDateTime":"2014-02-24T20:44:02Z","Content":"\n\u003Cp\u003Ei use it a lot because i play with a keyboard and the sas make softer correction to the flap and stuff. \u003C/p\u003E\u003Cp\u003EIt\u0027s less mess and less imput control from me witch lead to a better flight.\u003C/p\u003E\u003Cp\u003EI just speak of rocket and space shuttle. \u003C/p\u003E\u003Cp\u003EUnder FAR and with plane, SAS is bad ( i\u0027m new to FAR) it tends to wooble like hell !\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2014-02-24T20:45:56Z","Content":"\n\u003Cp\u003EYes. and even then they\u0027re almost uncontrollable. \u003C/p\u003E\u003Cp\u003EI pretty much don\u0027t do airplanes anymore.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2014-02-24T20:55:38Z","Content":"\n\u003Cp\u003EYes, most real planes have the equivalent of something similar anyway.\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-02-24T21:06:29Z","Content":"\n\u003Cp\u003EI find the extra reaction torque to be useful in FAR. Particularly in the upper atmo where control surfaces are less effective.\u003C/p\u003E\u003Cp\u003EIn FAR I\u0027ve also found procedural wings/control surfaces to be much more stable under SAS control than stock or B9 wings. They don\u0027t flap as much, and I can fine tune them for even better stability.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-02-24T21:10:09Z","Content":"\n\u003Cp\u003EI do, under FAR and stock. It\u0027s just a little extra control authority, which can be helpful.\u003C/p\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2014-02-24T21:33:05Z","Content":"\n\u003Cp\u003EI use them sparingly on spaceplanes and rarely on ordinary atmospheric planes.\u003C/p\u003E\u003Cp\u003EIt can be nice to just wrench the plane around to point where I want it to go, but I try to rely on control surfaces as they\u0027re lighter and can provide lift.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2014-02-24T22:06:48Z","Content":"\n\u003Cp\u003EI usually put a reaction wheel on my spaceplanes, to save on RCS propellant and help with stability in the upper atmosphere when the air\u0027s too thin to let the flaps bite in properly.\u003C/p\u003E\u003Cp\u003EI very rarely put a reaction wheel on my low-altitude aircraft, though; aerodynamics tend to be enough down in the soup.\u003C/p\u003E\u003Cp\u003EI \u003Cem\u003Ealways\u003C/em\u003E fly with SAS enabled, however. I\u0027m not a terrible pilot, but I\u0027m not quite good enough an engineer to build a good bird that\u0027s both maneuverable and dynamically stable without some fly-by-wire assistance.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-02-24T22:11:05Z","Content":"\n\u003Cp\u003EOut the wazoo. Because I like to turn via yaw. And I\u0027m probably also bad at planes.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-02-24T22:28:57Z","Content":"\n\u003Cp\u003EReaction wheels? No. I also disable them on aircraft cockpits while in the atmosphere. If I don\u0027t have enough control authority without them I consider the aircraft design to be fundamentally flawed. \u003C/p\u003E\u003Cp\u003ESAS? Yes, I use SAS while flying aircraft, but without the overly strong (and borderline cheatingly so) reaction wheels it can only use thrust vectoring and the control surfaces to maintain a heading.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-02-24T22:54:20Z","Content":"\n\u003Cp\u003EI don\u0027t use SAS on aircraft very often, if it is a SSTO or a airship (I play non-stock) I will use reactionwheels (unless it is a SSTO airship, don\u0027t ask.)\u003C/p\u003E\n"},{"CreatedByName":"Torham234","CreatedById":58574,"CreatedDateTime":"2014-02-24T23:14:30Z","Content":"\n\u003Cp\u003EI use FAR.\u003C/p\u003E\u003Cp\u003EGenerally, I find it a bad idea to actually engage the SAS system in the atmosphere, since it tends to freak out a lot. For SSTO\u0027s however, its very useful once you leave the atmosphere. You just have to balance your craft well so that you don\u0027t need the sas switched on. Joystick helps a lot.\u003C/p\u003E\n"},{"CreatedByName":"RSwordsman","CreatedById":78678,"CreatedDateTime":"2014-02-24T23:23:47Z","Content":"\n\u003Cp\u003EBelow a certain altitude in FAR, I find SAS to conflict with the control surfaces in an unwanted harmonic fashion which makes the plane flap itself to pieces. Once I get into the thinner air around 15-20 kilometers, however, it does come in very handy.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-02-24T23:28:40Z","Content":"\n\u003Cp\u003EYep, I add SAS modules to all of my aircraft. I will admit that I started the practice before I realized that the command pods had their own reaction wheels, but I\u0027ve continued to use them. \u003C/p\u003E\u003Cp\u003EI use them to strongarm my aircraft into behaving. Heck, I put like 5 of them on my Stock-game VTOL to make landing even remotely feasible after traveling at speed.\u003C/p\u003E\u003Cp\u003EAlso, I started the practice before I loaded up FAR. I haven\u0027t spent a LOT of time with aircraft in FAR, but I think I\u0027ll be sticking with it. The few that I have made in FAR shake like crazy, and the SAS modules somewhat mitigates the problem.\u003C/p\u003E\n"},{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2014-02-25T00:55:48Z","Content":"\n\u003Cp\u003EI add them as needed and fly with SAS when needed. There is no real rule. But for example space- and aircraft with VTOL abilities usually get more SAS power. Basically it\u0027s a question of the aircrafts total weight and role. Yet i always create my airplanes with CoG sitting right in the geometric center of the tank configuration, so that the aircraft is flyable without SAS throughout it\u0027s whole mission if needed. When i fly just for fun a little bit around i usually fly without SAS. When i launch a spaceplane to go into orbit at least the heavy ones (around 14t/rapier) i use SAS during ascend and go do other stuff.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-02-25T02:09:33Z","Content":"\n\u003Cp\u003EI used to use SAS to smooth out the response to controls. It was like a fly-by-wire system that prevented jerkiness. However, since they revised SAS a few versions back, I can not abide the way SAS turns completely off every time you make the tiniest control input, causing the plane to lurch violently. I REALLY wish they would re-include the old avionics nosecone, which made planes a breeze to fly.\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2014-02-25T02:16:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EI used to use SAS to smooth out the response to controls. It was like a fly-by-wire system that prevented jerkiness. However, since they revised SAS a few versions back, I can not abide the way SAS turns completely off every time you make the tiniest control input, causing the plane to lurch violently. I REALLY wish they would re-include the old avionics nosecone, which made planes a breeze to fly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe that they still have the old SAS module included in the game, you just need to edit the config file for the avionics nosecone.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-02-25T02:21:33Z","Content":"\n\u003Cp\u003EThanks Lazro, but you are underestimating my incompetence with things like that. I once broke my PC while trying to install a super-easy-do-it-yourself soundcard. If it\u0027s not stock, I don\u0027t want to mess with it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EuSouONumero345","CreatedById":40840,"CreatedDateTime":"2014-02-25T02:50:05Z","Content":"\n\u003Cp\u003EI don\u0027t usually build aircrafts, but most of my rockets have ASAS, some uses the reaction wheel, E.g small orbit-capable rockets, small \u0022go-anywhere\u0022 probes(Ion engines).\u003C/p\u003E\n"},{"CreatedByName":"Whatshtisthis","CreatedById":42775,"CreatedDateTime":"2014-02-25T13:04:46Z","Content":"\n\u003Cp\u003EDon\u0027t really use reaction wheels on planes unless it\u0027s VTOL or really large.\u003C/p\u003E\u003Cp\u003EI do fly with SAS activated.\u003C/p\u003E\n"}]}