{"TopicId":64449,"ForumId":25,"TopicTitle":"BSC: Aeris 4a - AND THE WINNER IS:","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2014-02-27T20:42:22Z","PageNum":3,"Articles":[{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2014-03-02T11:55:19Z","Content":"\n\u003Cp\u003EHm..I have to say I\u0027m suprised that we allready have so many entries. I was worried a bit, because I allways hat serious trouple constructing a spaceplane, that we might have only very few entries.\u003C/p\u003E\u003Cp\u003EHowever spaceplanes seem to be in vogue.\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2014-03-02T12:49:45Z","Content":"\n\u003Cp\u003ENamed after it\u0027s extensive canard use, the Mallard is designed first and foremost for easy docking. To that end, the docking port is inline with the cockpit, avoiding confusing navball changes and allowing intuitive RCS control. RCS is well balanced and the Mallard\u0027s short, stubby, compact design allows for operation at crowded \u0026amp; cramped space stations.\u003C/p\u003E\u003Cp\u003EAnother innovation of the Mallard is it\u0027s single button toggle between air breathing and vacuum modes of operation. This setup, achieved by shutting down rocket engines on initial launch stage, allows for a single button (1) to toggle modes, shutting down air intakes (to reduce drag) and the single flameout-friendly jet engine at the same time as igniting rocket engines. A further press of this single button opens up air intakes, spools up the jet engine, and kills the rocket engines. It is hoped this single button toggle design makes the Mallard as intuitive as a Rapier equipped plane.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EVote Mallard!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Og3oF\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EFeatures\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESingle button (1) toggle between atmosphere/vacuum and back to atmosphere operation\u003C/p\u003E\u003Cp\u003ETake off at sub 90m/s\u003C/p\u003E\u003Cp\u003EBalanced RCS, docking port inline with cockpit and compact design for easy docking\u003C/p\u003E\u003Cp\u003ESingle jet engine keeps craft stable in the event of flameout\u003C/p\u003E\u003Cp\u003ETwin RAM intakes feeding the single jet allow for ~35km ceiling and ~2km/s velocity before need for rocket power\u003C/p\u003E\u003Cp\u003EAbort system uses stabilising landing legs to prevent cockpit rollover upon landing\u003C/p\u003E\u003Cp\u003ELKO orbit easily achievable with 1/3rd jet fuel and 3/4 rocket fuel remaining\u003C/p\u003E\u003Cp\u003EJust enough fuel to orbit the Mun and return safely to Kerbin should you wish\u003C/p\u003E\u003Cp\u003EFront brakes disabled to prevent squirrely landings\u003C/p\u003E\u003Cp\u003ENo clipping (well, no debug menu clipping, dorsal and ventral canards may be a bit clippy for some tastes)\u003C/p\u003E\u003Cp\u003E51 parts, 11.5 tons (wet)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EAction Groups (as noted in in-game description)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E(1) toggles between air and space modes (toggling jet/rocket engines and air intakes)\u003C/p\u003E\u003Cp\u003E(2) toggles ladder\u003C/p\u003E\u003Cp\u003E(3) toggles ventral solar panel\u003C/p\u003E\u003Cp\u003E(Backspace/Abort) kills all engines, decouples capsule, jettisons forward canards (to prevent odd infiniglide issue under parachute), deploys chute, lowers stabilising legs\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ECraft file\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0BzCQMKilmnyaTkx2dkExaG5QQVU/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EIs here\u003C/a\u003E. Go on. You know you want it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-06T12:01:36Z\u0022 title=\u002203/06/2014 12:01  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 6, 2014\u003C/time\u003E by MiniMatt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JABUSCUS","CreatedById":100812,"CreatedDateTime":"2014-03-02T15:01:34Z","Content":"\n\u003Cp\u003EMost planes would explode if you tried to land it in a canyon, I did not plane my reentry well, but it is not fragile. Also, it has a lot of lift, and it is my first competition\u003C/p\u003E\n"},{"CreatedByName":"JABUSCUS","CreatedById":100812,"CreatedDateTime":"2014-03-02T15:15:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pds314\u0022 data-cite=\u0022Pds314\u0022\u003E\u003Cdiv\u003EOne wonders what sort of advantages this thing really has over the Stock Aeris 4A? It is bigger, more technologically costly, from the sound of it, more fragile, neither is meant to carry a significant payload, and it seems to have a more limited range despite carrying the same number of Kerbals.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe contest is open to anyone, and most of the spaceplanes here don\u0027t carry cargo, so I don\u0027t see the problem with mine. Things can be revised, that is the beauty of making planes.\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-03-02T15:40:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exothermos\u0022 data-cite=\u0022Exothermos\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://i.imgur.com/Yho0mdf.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Yho0mdf.png\u003C/a\u003E\u003Cp\u003EThis is a spit-polished version of my very first successful spaceplane, \u0022Speedy Box\u0022.\u003C/p\u003E\u003Cp\u003EIt does not use any intake stacking or aggressive part clipping (some very mild aesthetic clipping is present). No \u0027advanced\u0027 building techniques either: no cubic struts. What you see is what you get! As such it does not fly on jets at extreme high altitudes, but the inclusion of RAPIER engines has greatly improved the performance of the original craft. The plane is capable of relatively high orbits (the above pic was taken just shy of a 300k orbit), and is stable and responsive in all regimes. RCS and a small docking port are included.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/HMqsArl.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/HMqsArl.png\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EHere is the flight profile:\u003C/p\u003E\u003Cp\u003EClimb on all 4 engines to 20k and 800kph. Accelerate while climbing slowly to 25k. Make sure to slowly throttle back to keep all four engines burning. Turn off Turbojets at 25k. Continue 100% throttle slow climb on RAPIERs. At approx 30k and 1800kph, RAPIERs will change modes; close intakes and climb at 50 degrees to desired Apoapsis. Deploy Solar panels when above 60k. Reenter at 10 degrees nose up relative to prograde pip.\u003C/p\u003E\u003Cp\u003EIt is possible to get even higher performance out of the craft if one wanted to juggle the engine types at the 30km threshold, but it is more work than it seems to be worth.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/ewewq5t5tm3gcm1/A%20Speedy%20Box%20SSTO.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EDownload Craft File\u003C/span\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks like you may have uploaded the wrong craft as well. This version seems to have Aerospikes instead of RAPIERs\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-03-02T16:18:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UpsilonAerospace\u0022 data-cite=\u0022UpsilonAerospace\u0022\u003E\u003Cdiv\u003E...I\u0027m done. I can\u0027t go any further without overworking this.\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EThe Plover\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E[pictures are nice, but I\u0027m not posting them AGAIN here. I value everyone\u0027s computers.]\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFeatures!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u0026gt;Super simple! Only 42 parts.\u003C/p\u003E\u003Cp\u003E\u0026gt;Intuitive flight path to orbit! You can flub up and still have fuel left to do the job.\u003C/p\u003E\u003Cp\u003E\u0026gt;Good at gliding! It can land at under 45 m/s.\u003C/p\u003E\u003Cp\u003E\u0026gt;No intake spam! Only two ram air intakes.\u003C/p\u003E\u003Cp\u003E\u0026gt;Easy to reverse-engineer! Almost no part clipping.\u003C/p\u003E\u003Cp\u003E\u0026gt;Fast! Gets to orbit in six minutes or so.\u003C/p\u003E\u003Cp\u003EThe Plover is specifically aimed at beginners. It is very, very easy to launch it to orbit. It is built so that beginners can see every single part, and have a better idea of how they fit together. Its non-clippy nature makes it a cinch to build, and its surprisingly powerful thrust system is quite effective at launching to orbit in record time. It has limited range - it can only reliably return from a 100km orbit. But it\u0027s a joy to fly.\u003C/p\u003E\u003Cp\u003EIn addition, the Plover is the safest SSTO I have ever built. It not only has a working abort system \u003Cstrong\u003Ebut also\u003C/strong\u003E a full-body parachute system. This allows it to safely land on water, eject from dangerous situations and encourage beginning pilots to try again. [No other craft on the challenge has both of these. Some call it overkill. I call it Progress!]\u003C/p\u003E\u003Cp\u003EMost of the people that have participated so far have added a docking port. I have instead chosen to make the Plover safe and easily flyable. The truth is, the Plover doesn\u0027t need a docking port to teach the basics of spaceplane mechanics. It does, however, need the best abort/landing systems as it can get, so that beginner pilots won\u0027t kill their beloved grinning green guys.\u003C/p\u003E\u003Cp\u003E.craft file! \u003Ca href=\u0022https://www.dropbox.com/s/t1nl9xmdei9b8fc/Plover%20SSTO.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003Ehttps://www.dropbox.com/s/t1nl9xmdei9b8fc/Plover%20SSTO.craft\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEdited my original post. Rest assured, the only reason why I didn\u0027t include the craft file the first time was because of a parachute bug. It\u0027s fixed now.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-03-02T16:56:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xeldrak\u0022 data-cite=\u0022Xeldrak\u0022\u003E\u003Cdiv\u003EYes, you can edit your entry as long as the building phase is active. Once we start voting, you are stuck with what you posted \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh good. I was wanting to make a minor tweak to the Auk...\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-03-02T16:59:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xeldrak\u0022 data-cite=\u0022Xeldrak\u0022\u003E\u003Cdiv\u003EHm..I have to say I\u0027m suprised that we allready have so many entries. I was worried a bit, because I allways hat serious trouple constructing a spaceplane, that we might have only very few entries.\u003Cp\u003EHowever spaceplanes seem to be in vogue.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI imagine a lot of us are posting up our first successful spaceplane designs...which were generally focused on the notion of \u0022get it into orbit\u0022. That seems to have been the point of the Aeris 4a (except for the fact that it generally sucks). Just my opinion.\u003C/p\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2014-03-02T17:06:36Z","Content":"\n\u003Cp\u003EIt\u0027s nice to see this challenge series gaining enough reputation to be stickied \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAh well, I made a new design for it. Granted, besides getting into orbit it doesn\u0027t do much... craft file and pictures later today! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i998.photobucket.com/albums/af109/Ravenchant/KSP/screenshot1383_zps7db37078.png\u0022 alt=\u0022screenshot1383_zps7db37078.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2014-03-02T17:33:20Z","Content":"\n\u003Cp\u003EMy latest prototype:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Gs70lFG.png\u0022 alt=\u0022Gs70lFG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m still struggling to build something that can match Rune\u0027s White Dart. :/\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-02T18:51:52Z","Content":"\n\u003Cp\u003EAfter looking at all these entries and rereading the rules I\u0027m gathering this is just a simple spaceplane popularity contest, not a \u0022build a better Aeris-4a\u0022 challenge. In retrospect I probably should have entered a different plane.\u003C/p\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2014-03-02T19:29:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003Ea simple spaceplane popularity contest\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI intend to take voting seriously and assess designs on their merits. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile in LKO...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BzUvgt0.png\u0022 alt=\u0022BzUvgt0.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2014-03-02T20:07:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhomphaia\u0022 data-cite=\u0022Rhomphaia\u0022\u003E\u003Cdiv\u003ELooks like you may have uploaded the wrong craft as well. This version seems to have Aerospikes instead of RAPIERs\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow in the world...? Thank you. Fixed.\u003C/p\u003E\n"},{"CreatedByName":"barrenwaste","CreatedById":91899,"CreatedDateTime":"2014-03-02T20:08:28Z","Content":"\n\u003Cp\u003EThe Aeris 4A-1 was made specifically for this challenge. It\u0027s design is meant to keep as much of it\u0027s original look as possible while making it a platform that has better handling and updated buildcraft. It includes a light introduction to air hogging and action groups while remaining true to the Aeris line of aesthetic.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-02T20:13:28Z\u0022 title=\u002203/02/2014 08:13  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 2, 2014\u003C/time\u003E by barrenwaste\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-03-02T20:10:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022barrenwaste\u0022 data-cite=\u0022barrenwaste\u0022\u003E\u003Cdiv\u003EThe Aeris 4-A was made specifically for this challenge. It\u0027s design is meant to keep as much of it\u0027s original look as possible while making it a platform that has better handling and updated buildcraft. It includes a light introduction to air hogging and action groups while remaining true to the Aeris line of aesthetic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what I tried doing, I gave the SSTO a R.A.P.I.E.R. for ease of use, and much better aerodynamics to allow for better and easier handling in atmosphere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-03-02T20:20:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Giggleplex777\u0022 data-cite=\u0022Giggleplex777\u0022\u003E\u003Cdiv\u003EI\u0027m still struggling to build something that can match Rune\u0027s White Dart. :/\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow, that speaks volumes to my ears, thanks! I \u003Cem\u003Ewill\u003C/em\u003E try whatever you come up with, that\u0027s for sure.\u003C/p\u003E\u003Cp\u003ERune. The risk of posting soon is that then you give people something to shoot for... and there\u0027s always someone better at everything out there, right?\u003C/p\u003E\n"},{"CreatedByName":"Tarmenius","CreatedById":16990,"CreatedDateTime":"2014-03-02T20:27:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003E ... [seems like this is] not a \u0022build a better Aeris-4a\u0022 challenge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003E ... HarvesteR intended the Aries 4a to be hard to fly\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the source of my own design dilemmas. The Aeris-4a has obvious flaws, but they\u0027re there on purpose: to inspire the player to tweak and experiment with the design while measuring whether the player has a handle on the standard ascent profile for SSTO spaceplanes. Given it\u0027s true purpose, the Aeris-4a is actually an excellent craft. So, I\u0027m faced with a choice: do I recreate the original craft\u0027s intent or make an easy-to-use craft that has few flaws, potentially gaining more votes?\u003C/p\u003E\u003Cp\u003EEither approach seems like a valid design choice, but one will result in a significantly different kind of craft from the other. How then do we compare entries that serve such different purposes?\u003C/p\u003E\u003Cp\u003EThankfully, we still have a few days left in the build phase. With 15\u002B SSTO spaceplanes already in my hangar, I may just pick my personal favorite and throw it into the mix \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn a somewhat-related note, I\u0027ll be very glad when .24 comes out. The Inline Clamp-o-tron is quite dangerous now and some of my designs have been made unusable by the incredibly bendy connections!\u003C/p\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2014-03-02T20:42:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tarmenius\u0022 data-cite=\u0022Tarmenius\u0022\u003E\u003Cdiv\u003EGiven it\u0027s true purpose, the Aeris-4a is actually an excellent craft. So, I\u0027m faced with a choice: do I recreate the original craft\u0027s intent or make an easy-to-use craft that has few flaws, potentially gaining more votes?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think players would be much better served with stock craft that worked well. Show what works and say \u0022beat this!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2014-03-02T22:59:11Z","Content":"\n\u003Cp\u003EPresenting the \u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EStrela IV\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://bit.ly/1dR681X\u0022 rel=\u0022external nofollow\u0022\u003EDOWNLOAD\u003C/a\u003E link here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/oN32r\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s simple, it\u0027s nothing special, and it flies well. There\u0027s enough oxidizer on board for a Mun flyby, and plenty of jet fuel. I added a light on the upper side after taking the pictures (to aid with docking), but it\u0027s not too conspicuous. Speaking of dockings... 47 units of monoprop are enough for most, right? ...right?\u003C/p\u003E\u003Cp\u003E- Wet mass: slightly under 11 tons\u003C/p\u003E\u003Cp\u003E- Part count: 38\u003C/p\u003E\u003Cp\u003E- Action groups: all there in the description \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I\u0027m not planning to get into finals this time around, but at least I won\u0027t melt anyones computer. Have fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2014-03-03T00:21:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ravenchant\u0022 data-cite=\u0022Ravenchant\u0022\u003E\u003Cdiv\u003ESpeaking of dockings... 47 units of monoprop are enough for most, right? ...right?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI reckon about 5 units on a small craft - I tend to add one of the small white radial monoprop tanks if I intend to dock a spaceplane more than once. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m about a third of the way through flight testing the entries submitted so far, \u0027cause I\u0027m serious about trying them all even if I do only have one measly vote. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E So much clipping abuse doesn\u0027t seem like good stock replacement. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s a great range of performance from the ones I\u0027ve tried. I\u0027m building up a couple of parking rings around Kerbin. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWas pleased by the Cormorant - I think I did something wrong during the ascent, but anyway, it didn\u0027t make the 500kmx500km orbit ring I was aiming at and I ended up landing on the side of a mountain in the dark.\u003C/p\u003E\u003Cp\u003EI\u0027m getting a locked parts message on tigik\u0027s plane.\u003C/p\u003E\n"},{"CreatedByName":"ssTALONps","CreatedById":28889,"CreatedDateTime":"2014-03-03T02:41:10Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EWaited for this challenge to come!!!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./view/xqcb512bwovvmpz/ARX-6%20Volley%20SSTO.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EARX-6E Volley\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/rZhB0\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EThe bit more updated \u0027E\u0027 variant has many interesting features.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cstrong\u003ENo intake spam \u0026amp; wing stacking\u003C/strong\u003E Ã¢â‚¬â€œ You seriously want beginners to play with space-fairing biplane or spam-like-hell intakes? Nah.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003ENo turbojet engine\u003C/strong\u003E Ã¢â‚¬â€œ Use of basic jet will greatly expand beginners\u0027 cognition of SSTO spaceplane design.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003E80x80km orbit insertion within 10 min\u003C/strong\u003E Ã¢â‚¬â€œ Rapid orbital deployment, cause I\u0027m Korean and don\u0027t want to spend 10 min in atmosphere.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EHefty fuel capacity\u003C/strong\u003E - ~700m/s of dV for standard version, \u002B1.5km/s of dV for turbojet version after orbital insertion.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EGround refuel capable\u003C/strong\u003E Ã¢â‚¬â€œ Total re-usability. Beginners should learn how to dock after landing and design specific refuel vehicles.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EReliability\u003C/strong\u003E Ã¢â‚¬â€œ Easy to fly and has almost same dV after orbit insertion. Tail-strike proof, no asymmetric flame out, balanced RCS ports.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EH-tail\u003C/strong\u003E - Enhanced roll performance due to v-stabs tangential to angular movement around roll axis. Also has extreme yaw authority and ease of docking.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003ENeat VDP\u003C/strong\u003E - Everything from action groups to ascent profile is neatly described within Vehicle Description Panel.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EDesign technique\u003C/strong\u003E - Canard\u0027s angle of incidence, engine clustering in VAB \u0026amp; using sub-assembly, H-tail, landing gear position, etc. Everything you should learn.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EEngine Swap-able\u003C/span\u003E\u003C/strong\u003E - \u003Cstrong\u003ENow this is unique to Volley, I\u0027ve never seen any other craft capable of this feat. Description below.\u003C/strong\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis Tie-fighter-ish light weight(16t) SSTO is perfect for beginners to play with and develop combined building \u0026amp; piloting skills.\u003C/p\u003E\u003Cp\u003EEven with smaller airframe, the \u003Cstrong\u003EARX-6E Volley\u003C/strong\u003E nevertheless performs better than \u003Cstrong\u003EAeris-4a\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EAn unique feature of the Volley is Engine Swap-ability.\u003C/span\u003E\u003C/strong\u003E \u003Cstrong\u003ESwap basic jet for turbojet and you can achieve orbit with 2x dV but at the penalty of \u002B50% time to orbit.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis is possible mainly due to ARX series\u0027 high vacuum dV combined with advantage of light airframe weight of the Volley.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETurbojet ascent profile is not included.\u003C/strong\u003E This is intended as to allow beginners to try-and-error standard shallow turbojet ascent profile. \u003C/p\u003E\u003Cp\u003EI achieved \u003Cstrong\u003E1.5km/s dV\u003C/strong\u003E after orbital insertion with my own ascent profile.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFor those who want to test out, check VDP. You only have to get rid of oxidizers from all FL-T100 tanks, swap engine and assign action group.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou may try the same with RAPIER engine, but I\u0027m highly dubious of that.\u003C/p\u003E\u003Cp\u003EAs for relatively but not-that-much high part count (86), I added 10 struts between fuselage and wings for increased airframe rigidity.\u003C/p\u003E\u003Cp\u003EYou don\u0027t want your aircraft to disintegrate upon hard landing, right?\u003C/p\u003E\u003Cp\u003E3x 48-7S cluster was made in VAB using cubic struts and imported to SPH by sub-assembly, a trick which I think beginners must know about.\u003C/p\u003E\u003Cp\u003ECompared with \u0027D\u0027 version, the \u0027E\u0027 version slightly lacks in on-orbit dV but has 4 minutes more fuel for basic jet engine.\u003C/p\u003E\u003Cp\u003EI also reconfigured lower wing layout. Now it has body flaps.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EInitially, I was going to upload turbojet version. \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHowever, \u003C/strong\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003Efor the sake of diversity,\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E I chose to upload standard basic jet version as I believe it stands its own place among other great designs.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe ARX-6E Volley is dual-engine serviceable after all \u003C/strong\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI\u0027m open for performance evaluations and suggestions.\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-07T02:09:10Z\u0022 title=\u002203/07/2014 02:09  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 7, 2014\u003C/time\u003E by ssTALONps\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2014-03-03T08:14:15Z","Content":"\n\u003Cp\u003EHmmm...it\u0027s tough to choose just one design to submit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere are so many different ways you can approach this. I think I\u0027ve got one though.\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2014-03-03T13:36:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAfter looking at all these entries and rereading the rules I\u0027m gathering this is just a simple spaceplane popularity contest, not a \u0022build a better Aeris-4a\u0022 challenge. In retrospect I probably should have entered a different plane.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is something that has *perhaps* tended to appear in a lot of the BSC challenges although I also get the impression it has lessened \u003Cstrong\u003Ea lot\u003C/strong\u003E lately. I\u0027ve said this before but it bears repeating, use your vote wisely according to your own criteria, but don\u0027t pay too much heed to the result of the votes if you have an entry in the comp - the joy of these challenges is in learning new tricks, discovering/stealing new engineering solutions, being awed by the craftsmanship of making things look good without resorting to (in my mind) un-BSC-like excessive clipping or multi-hundred part monsters. \u003Cstrong\u003EHitching your motivation for these competitions to the vote result risks frustration and denies you the simple joy of merely participating.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUltimately we all have more important things in our life to worry about than an internet space plane vote so choose what you\u0027re going to worry about (eg the mortgage, the kids, your exams) and what you\u0027re simply going to enjoy (eg BSC challenges).\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u0022Build a better Aeries-4a\u0022 is genuinely what I think most if not all entrants have done. Trouble is, we all have different priorities on what we wish to improve. Some people will wish it had more DV, some will wish it had more crew capacity, or carried more science, or was easier to fly, or faster to reach orbit, or easier to dock, or easier to land. Because one design can\u0027t address all these without also making the craft heavier, more complex, more part hungry etc, any entrant, and the eventual \u0022winner\u0022 will still serve as a springboard, an inspiration for players to adapt and build from.\u003C/p\u003E\u003Cp\u003EPersonally I could live with the Aeries 4-a\u0027s single crew capacity, it\u0027s lack of science, and it\u0027s modest role appropriate DV, but wasn\u0027t keen on it\u0027s unbalanced docking or it\u0027s large physical size (I tend to build my space stations too cramped). I also felt the atmospheric flight handling could be improved a bit, action groups could be simpler, an abort system would be nice, and, \u003Cstrong\u003Ecrucially, it lacked a really cool little antenna which automatically extends on take-off\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003ESo I built \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71015-BSC-Aeris-4a-Yes-it-s-spaceplane-time%21?p=998941\u0026amp;viewfull=1#post998941\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Ethe Mallard\u003C/strong\u003E\u003C/a\u003E to address all these issues as best I could (especially the antenna). Others will look to fix other deficiencies, and others will look to fix the same ones I did but make a better job of it (and I\u0027ll subsequently steal their tricks!).\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-03T14:50:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAfter looking at all these entries and rereading the rules I\u0027m gathering this is just a simple spaceplane popularity contest, not a \u0022build a better Aeris-4a\u0022 challenge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s been this way for a while already. There are certain rules how the craft should be built but judges are free to impose their own rules on top of it or just judge according to their own rules which they may make up on the fly. So lack of science tools was a disadvantage in one of BSC challenges, and advantage in another. \u003C/p\u003E\u003Cp\u003EPersonally I\u0027m participating more to have a try at designing something I have not tried to design and fly yet. Nobody shares my opinion on what is \u0022newbie-friendly\u0022 and my results so far correspond to that.\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2014-03-03T16:20:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MiniMatt\u0022 data-cite=\u0022MiniMatt\u0022\u003E\u003Cdiv\u003EThis is something that has *perhaps* tended to appear in a lot of the BSC challenges although I also get the impression it has lessened \u003Cstrong\u003Ea lot\u003C/strong\u003E lately.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn reflection I think this first sentence suggests a greater problem than actually exists. Looking back on the BSC challenges I can only really think of one (diplomacy forbids stating which) where *my* first thought of the winning entry is \u0022doesn\u0027t really fit my perception of BSC\u0022. Finalists have been packed with genuinely worthy contenders - but that is not to say those that didn\u0027t reach the finals or win the competition weren\u0027t worthy; the standard in these challenges, across all entrants, is consistently extremely high and often the only thing separating candidates becomes quite personal preferences.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tarmenius\u0022 data-cite=\u0022Tarmenius\u0022\u003E\u003Cdiv\u003EThis is the source of my own design dilemmas. The Aeris-4a has obvious flaws, but they\u0027re there on purpose: to inspire the player to tweak and experiment with the design while measuring whether the player has a handle on the standard ascent profile for SSTO spaceplanes. Given it\u0027s true purpose, the Aeris-4a is actually an excellent craft. So, I\u0027m faced with a choice: do I recreate the original craft\u0027s intent or make an easy-to-use craft that has few flaws, potentially gaining more votes?\u003Cp\u003EEither approach seems like a valid design choice, but one will result in a significantly different kind of craft from the other. How then do we compare entries that serve such different purposes?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m of the opinion that anything any of us make will be imperfect simply because everybody\u0027s needs, whims, and preferences are different and no craft can fulfil all engineering priorities equally. Rather than engineering in imperfections for the player to fix I prefer the approach of keeping a craft straightforward such that a new player can visually understand how it works and thus how they can improve it themselves to fit their own preferences and needs.\u003C/p\u003E\u003Cp\u003EI recall being a living breathing example of this whilst deciding how to cast my final vote in the BSC VTOL challenge - I saw flaws (petty flaws admittedly, but I\u0027m a petty man!) in Giggleplex\u0027s design but the inherent strength of the design really made me want to play around with it to \u0022improve\u0022 those failings and the clarity of the design made it simple to do so:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MiniMatt\u0022 data-cite=\u0022MiniMatt\u0022\u003E\u003Cdiv\u003EOK. Had another quick play with all the finalist\u0027s entries (excluding my own).\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/68586-BSC-Rocket-powered-VTOL-Final-vote%21?p=967821\u0026amp;viewfull=1#post967821\u0022 rel=\u0022external nofollow\u0022\u003EThoughts from page 14\u003C/a\u003E largely still remain.\u003C/p\u003E\u003Cp\u003EI came back to thinking \u0022What are stock craft for?\u0022 They should be fun to play with sure, but they should also be inspiration for players\u0027 own creations. A new player should be able to see how they work and say \u0022hey! that\u0027s a neat idea! I\u0027m borrowing that!\u0022. And perhaps in a way a stock craft should be imperfect, a new player should be able to think \u0022I reckon I can improve that!\u0022.\u003C/p\u003E\u003Cp\u003EThen I realised.\u003Cstrong\u003E I am a new player.\u003C/strong\u003E Only been here since Summer 2013, still haven\u0027t actually been to half of the planetary bodies available.\u003C/p\u003E\u003Cp\u003EAll three of my brethren finalists have made fine craft worthy of being stock, all have inspired, and all I think I could tweak a bit. But with which craft did I as a new player actually do this? It was Giggleplex\u0027s entry. I\u0027ve already stolen the method (s)he used for radially mounting 48-7S engines via small docking ports (and I\u0027ve no doubt (s)he likewise \u0022stole\u0022 that from someone else\u0027s idea way back). I\u0027ve already thought \u0022I reckon I can improve on this\u0022 - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/68586-BSC-Rocket-powered-VTOL-Final-vote%21?p=969306\u0026amp;viewfull=1#post969306\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Eand went ahead and did just that\u003C/strong\u003E\u003C/a\u003E (in my mind) because it was fun to do so.\u003C/p\u003E\u003Cp\u003EI\u0027ve treated Giggleplex\u0027s craft like a stock craft. I\u0027ve stolen bits from it, and I (reckon I) have improved it. Demonstrably therefore, Giggleplex\u0027s craft is, to me, a stock craft and as such gets my final vote.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"}]}