{"TopicId":64524,"ForumId":55,"TopicTitle":"Make kerbals in EVA able to connect two points with EAS-4 struct connectors and...","CreatedByName":"manuelasa1999","CreatedById":10304,"CreatedDateTime":"2014-02-28T15:58:57Z","PageNum":1,"Articles":[{"CreatedByName":"manuelasa1999","CreatedById":10304,"CreatedDateTime":"2014-02-28T15:58:57Z","Content":"\n\u003Cp\u003EHi KSP players, today iÃ‚Â´m writting you to make a suggestion, make Make kerbals in EVA able to connect two points with EAS-4 struct connectors and fuel ducts.\u003C/p\u003E\u003Cp\u003EIf you are an experienced rocket builder you may know that when two big vessels are docked in orbit they become difficult to control, for that i suggest to make kerbals in\u003C/p\u003E\u003Cp\u003EEVA to be able to put EAS-4 conectors and then your docked vessels will become more stable and controlable, I also suggest kerbals in EVA become able to put\u003C/p\u003E\u003Cp\u003Efuel ducts because if you have many landers in the surface of a planet/moon and you need to exchange the fuel it could be very usefull to be able to connect them like if you\u003C/p\u003E\u003Cp\u003Ehave a hose.\u003C/p\u003E\u003Cp\u003EI know that to make more stable dockings we can use tri-couplers with docking ports in each of the sides.\u003C/p\u003E\u003Cp\u003ESorry for my english IÃ‚Â´m from Spain\u003C/p\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2014-02-28T16:02:44Z","Content":"\n\u003Cp\u003EYour english is excellent.\u003C/p\u003E\u003Cp\u003EI would love to see this functionality in the stock game as well. It\u0027s very, very useful.\u003C/p\u003E\u003Cp\u003EFor the moment, check out \u0022Kerbal Attachment System\u0022 (KAS), a mod which lets you do just what you\u0027re describing.\u003C/p\u003E\n"},{"CreatedByName":"Roxette","CreatedById":84963,"CreatedDateTime":"2014-02-28T16:03:49Z","Content":"\n\u003Cp\u003EA lot of that can be done with \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-2-kas-kerbal-attachment-system-v0-1/\u0022 rel=\u0022external nofollow\u0022\u003Ethe Kerbal Attachment System MOD\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDamn that ninja problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-28T16:04:51Z","Content":"\n\u003Cp\u003EYou might want to try the Kerbal Attachment System mod, I think it provides what you\u0027re asking for.\u003C/p\u003E\u003Cp\u003EApart of that, controlling stations in space is matter of clever design and patience, I never ran into issues which couldn\u0027t be solved without struts.\u003C/p\u003E\u003Cp\u003EEdit: major ninja overload here on forums \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LiveHereNow","CreatedById":94582,"CreatedDateTime":"2014-02-28T16:05:06Z","Content":"\n\u003Cp\u003EI like this idea as it really expands the free-space function of EVA (versus terrestrial EVA). Many NASA missions that included EVA were to repair, replace, upgrade, reinforce, etc. Not only would it be useful in the game, but it mirrors much of what is done during EVA in real space programs.\u003C/p\u003E\n"},{"CreatedByName":"manuelasa1999","CreatedById":10304,"CreatedDateTime":"2014-02-28T16:27:51Z","Content":"\n\u003Cp\u003EYes what i was describing was similar to the KAS mod maybe with few modifications to make it more similar to the \u0022KSP vanilla\u0022 building and flying method, itÃ‚Â´s like autopilots, the idea of have some flying data like semi major axis and phase angle is OK but the idea of introduce a full autopilot to \u0022KSP vanilla\u0022 like MechJeb would destroy the charm of the \u0022KSP vanilla\u0022 flying method\u003C/p\u003E\u003Cp\u003ESorry for my English again, iÃ‚Â´m from Spain.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-28T16:43:20Z","Content":"\n\u003Cp\u003EI suspect the next release, with its stronger joints, will make struts between docked vessels less necessary.\u003C/p\u003E\n"}]}