{"TopicId":64554,"ForumId":44,"TopicTitle":"House Committee Chairman Encourages NASA To Send Crew Flyby Mars in 2021","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-28T22:54:05Z","PageNum":2,"Articles":[{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2014-03-01T15:57:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sauron\u0022 data-cite=\u0022Sauron\u0022\u003E\u003Cdiv\u003EHrmm. It\u0027s a tricky one. A flyby seems unsatisfying in a way (not least to the astronauts involved), but interplanetary flight is a hell of a thing, and forcing the development of the essential stuff required for further missions is probably a good thing. If they aren\u0027t doing a free-return perhaps a visit to phobos would be in order as well?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt might not be too hard to \u0022piggyback\u0022 a small probe for Phobos on this mission. Plus, having a crewed vehicle so close by would mean that they could act as mission control for the probe, with nearly real-time control.\u003C/p\u003E\u003Cp\u003EActually... this is starting to sound pretty clever, somebody send this to NASA!\u003C/p\u003E\n"},{"CreatedByName":"deadshot462","CreatedById":13659,"CreatedDateTime":"2014-03-01T16:04:47Z","Content":"\n\u003Cp\u003EI\u0027ll remain patient on this one. Most of the time, someone in the government announces a grand new mission, and it gets discarded a few months later.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-03-01T16:08:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roastduck\u0022 data-cite=\u0022Roastduck\u0022\u003E\u003Cdiv\u003EI feel like there is no benefit to a manned flyby versus an unmanned flyby, other than the PR boost. If you\u0027re going to commit a crew to such a long flight, you might as well land them there so they can do SCIENCE on the surface.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis exactly. While a voyage to fly past Mars and Venus would certainly get attention, if there\u0027s little scientific value there\u0027s no point committing 2-3 people to an excruciatingly long voyage.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-03-01T16:18:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022deadshot462\u0022 data-cite=\u0022deadshot462\u0022\u003E\u003Cdiv\u003EI\u0027ll remain patient on this one. Most of the time, someone in the government announces a grand new mission, and it gets discarded a few months later.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E This isn\u0027t even an announcement, it\u0027s one guy in congress. There\u0027s very little support in congress, there\u0027s none from the president, and there\u0027s not even real support in NASA. It\u0027s close to a miracle it didn\u0027t drop completely off of everybody\u0027s radar the moment Tito realised he hadn\u0027t got a chance doing it privately.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-03-01T16:20:26Z","Content":"\n\u003Cp\u003EThe amount of new science might be small, but the engineering value of the journey would be immense.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-03-01T16:27:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EThe amount of new science might be small, but the engineering value of the journey would be immense.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E What engineering value? You could learn exactly as much by leaving the spacecraft in earth orbit for the same length of time. Even the radiation would be pretty much the same if it was at sufficient altitude.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-03-01T16:28:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EAs stated several times during the conference, this is also a issue of national pride. Congress is feeling the pressure from the President and the wide public to maintain its space leadership and get to Mars first than let China do it. It\u0027s quite interesting as to how after the Chang\u0027e 3 landed, NASA was given a bigger budget and Congress starts to pressure NASA to \u0022rush\u0022 the SLS and have it in service earlier. This may end in another space race, I\u0027m not sure. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Bread and Games\u0022 may have something to do with it, distract the population from internal problems (failing economy, increasing government coercion and abuse of power, etc. etc. by giving them a spectacle to look at.\u003C/p\u003E\u003Cp\u003EBetter a space race than a foreign war (of which the US already has one ongoing anyway) someone may be thinking.\u003C/p\u003E\u003Cp\u003EIt\u0027s been done since the Roman era at the very least (though they didn\u0027t try for a space race literally of course).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003E The US Public has feelin of suspicion and negavity towards the Chinese government and many of my friends think of it as a oppressive communist regime.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd they\u0027d be right to think so. US government drawing attention away from itself by declaring a foreign enemy helps them a lot, see above as to why.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EHowever, on a funner fact, several representatives and people at the hearing have admitted that they have greater political ambitions. One of the scientists (Same one who wants to explore moons of Jupiter) is on the books for potential nomination as NASA director. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds quite plausible, up and down the line in the group of proponents, down the the chairman him/herself. Playing Santa with other peoples\u0027 money in order to get a nicer job is always a popular game among politicians, especially near election time.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EAnyways, I personally believe that this is not about science, but about the technology. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd you\u0027d be wrong. Some people believed Apollo was about the science, and for some people it was. But for the decision makers, those that decided what the mission would look like, when it would fly, who would fly it, etc. etc. it was 100% politics and this one would be no different.\u003C/p\u003E\u003Cp\u003EApollo got some scientific instruments on the later missions so NASA and congress could redirect money from other programs to keep it going past the date it had stopped having political significance as a program, but that was a side show, not the main thing, and everyone involved knew it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EEven if it does fail, we still have a nice deep space outpost orbiting a Lagrange point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd one we can\u0027t get to as the mission hardware will have been ordered destroyed, as the mission hardware for Apollo was, for political reasons (no doubt someone will come up with an excuse, a new single stage to orbit reusable vehicle comes to mind, can\u0027t have a far cheaper throwaway rocket sitting in the production lines that can compete with it and launch for half the cost per pound).\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-03-01T16:32:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWhat engineering value? You could learn exactly as much by leaving the spacecraft in earth orbit for the same length of time. Even the radiation would be pretty much the same if it was at sufficient altitude.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m thinking mainly of the life support system. We\u0027ve never flown a system designed to keep people alive in deep space.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-03-01T16:33:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EI\u0027m thinking mainly of the life support system. We\u0027ve never flown a system designed to keep people alive in deep space.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would that be any different from a system designed to keep people alive in MEO?\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-03-01T17:10:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWhy would that be any different from a system designed to keep people alive in MEO?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMEO can still be replenished. If possible you\u0027d certainly want to test it in Earth orbit before chancing your hand at an interplanetary mission. But the stated goal is to develop and validate tech capable of making interplanetary journeys. Testing a subset of the systems required for a landing by doing a flyby would be a good way to simplify the problem (thereby reducing risk) while still fully validating some the most safety critical systems.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-01T17:30:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThis isn\u0027t even an announcement, it\u0027s one guy in congress. There\u0027s very little support in congress, there\u0027s none from the president, and there\u0027s not even real support in NASA. It\u0027s close to a miracle it didn\u0027t drop completely off of everybody\u0027s radar the moment Tito realised he hadn\u0027t got a chance doing it privately.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery little?\u003C/p\u003E\u003Cp\u003EThere was a reason this was a full committee hearing, not a subcommittee hearing. More than one person testifed, and more than several Congressmen proclaimed their support for this mission. It\u0027s much, much more than that. NASA itself has a movement going for a manned Mars flyby by 2021, and I hope it will prevail. The President himself has yet to release a statement, don\u0027t be so quick to judge.\u003C/p\u003E\u003Cp\u003EI\u0027m actually thinkign this has a legitimate chance to get off the ground.\u003C/p\u003E\u003Cp\u003EAnd personally, this is just me, but I would rather live in a nation with a corrupt government, increasing poverty, and tons of issues and controversies with an successful space program than a utopian society that has given up on space exploration. It may be Bread and Circuses, but its well worth the cost.\u003C/p\u003E\u003Cp\u003E@Kryten. I\u0027ll guess you dislike beyond-LEO manned spaceflight \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-01T17:33:04Z\u0022 title=\u002203/01/2014 05:33  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 1, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sauron","CreatedById":69931,"CreatedDateTime":"2014-03-01T17:37:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jfull\u0022 data-cite=\u0022jfull\u0022\u003E\u003Cdiv\u003EIt might not be too hard to \u0022piggyback\u0022 a small probe for Phobos on this mission. Plus, having a crewed vehicle so close by would mean that they could act as mission control for the probe, with nearly real-time control.\u003Cp\u003EActually... this is starting to sound pretty clever, somebody send this to NASA!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s been proposed already. I\u0027m not putting out new ideas here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Phobos is attractive for a number of reasons (and it\u0027s a shame the Russians botched Phobos-Grunt. That information would really come in handy in making a better argument either way):\u003C/p\u003E\u003Cp\u003E-Easy to land on (duh)\u003C/p\u003E\u003Cp\u003E-A rubble pile (probably) which means you could bury a habitat easily with minimal hardware. \u003C/p\u003E\u003Cp\u003E-Potential for ISRU (use it as a propellant depot) rather than carting stuff up from Mars\u0027 gigantic gravity well.\u003C/p\u003E\u003Cp\u003E-A good base to carry out unmanned operations on Mars\u0027 surface--Curiousity moves so very slowly in large part because the humans in the loop are so far away. You could probably get a rover moving a respectable fraction of 1 MPH (I know it sounds trivial but it\u0027d be a huge improvement over what we have now) if you had a human less than a few light seconds away.\u003C/p\u003E\u003Cp\u003E-Use established hardware for visiting very small space rocks (probably) since we should have some practice.\u003C/p\u003E\u003Cp\u003E-A phobos lander is essentially a big MMU (if that) whereas a Mars lander/return vehicle is immense with all the associated penalties to ship design of carrying said extra weight using crappy chemical engines.\u003C/p\u003E\u003Cp\u003ESo in certain regards, Phobos may actually be a better Mars base than Mars.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-01T17:42:49Z\u0022 title=\u002203/01/2014 05:42  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 1, 2014\u003C/time\u003E by Sauron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-01T18:21:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sauron\u0022 data-cite=\u0022Sauron\u0022\u003E\u003Cdiv\u003EIt\u0027s been proposed already. I\u0027m not putting out new ideas here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Phobos is attractive for a number of reasons (and it\u0027s a shame the Russians botched Phobos-Grunt. That information would really come in handy in making a better argument either way):\u003Cp\u003E-Easy to land on (duh)\u003C/p\u003E\u003Cp\u003E-A rubble pile (probably) which means you could bury a habitat easily with minimal hardware. \u003C/p\u003E\u003Cp\u003E-Potential for ISRU (use it as a propellant depot) rather than carting stuff up from Mars\u0027 gigantic gravity well.\u003C/p\u003E\u003Cp\u003E-A good base to carry out unmanned operations on Mars\u0027 surface--Curiousity moves so very slowly in large part because the humans in the loop are so far away. You could probably get a rover moving a respectable fraction of 1 MPH (I know it sounds trivial but it\u0027d be a huge improvement over what we have now) if you had a human less than a few light seconds away.\u003C/p\u003E\u003Cp\u003E-Use established hardware for visiting very small space rocks (probably) since we should have some practice.\u003C/p\u003E\u003Cp\u003E-A phobos lander is essentially a big MMU (if that) whereas a Mars lander/return vehicle is immense with all the associated penalties to ship design of carrying said extra weight using crappy chemical engines.\u003C/p\u003E\u003Cp\u003ESo in certain regards, Phobos may actually be a better Mars base than Mars.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot only that, but in 2020, the new NASA rover is being considered as a component for a sample return mission.\u003C/p\u003E\u003Cp\u003EThe crew could swing by Mars, pick up the sample, release the Phobos lander, control operations on Mars, then swing out. There is much science to be gained from this.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-03-01T18:51:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EMEO can still be replenished.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re missing the point. We\u0027re talking a real test of long-term life-support here; it\u0027s not like there\u0027s something forcing us to send up replenishment flights if the craft is close enough to do so. The only real difference in that scenario was if something went wrong with the life-support system, people wouldn\u0027t inevitably die.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EVery little?There was a reason this was a full committee hearing, not a subcommittee hearing. More than one person testifed, and more than several Congressmen proclaimed their support for this mission.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Missions don\u0027t run on proclamations of support. There\u0027s little inclination in congress of anyone being willing to actually fund such a mission.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003ENot only that, but in 2020, the new NASA rover is being considered as a component for a sample return mission.\u003Cp\u003EThe crew could swing by Mars, pick up the sample, release the Phobos lander, control operations on Mars, then swing out. There is much science to be gained from this.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can\u0027t just \u0027pick up\u0027 or \u0027drop off\u0027 something from a flyby trajectory. We\u0027re talking relative velocities in the multiple km/second range here.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-03-01T19:07:35Z","Content":"\n\u003Cp\u003EWe could smack something into Phobos, might be interesting. But we could do that without people being there.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-01T19:10:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EYou\u0027re missing the point. We\u0027re talking a real test of long-term life-support here; it\u0027s not like there\u0027s something forcing us to send up replenishment flights if the craft is close enough to do so. The only real difference in that scenario was if something went wrong with the life-support system, people wouldn\u0027t inevitably die.\u003Cp\u003E Missions don\u0027t run on proclamations of support. There\u0027s little inclination in congress of anyone being willing to actually fund such a mission.\u003C/p\u003E\u003Cp\u003EYou can\u0027t just \u0027pick up\u0027 or \u0027drop off\u0027 something from a flyby trajectory. We\u0027re talking relative velocities in the multiple km/second range here.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELittle inclination?\u003C/p\u003E\u003Cp\u003EWhat do you call the 80 million in premiliary work for the Europa probe? Or the budget deal that allocated more funding for NASA than was originally asked? For the fact that Congress passed a bill to prevent future presidents from canceling the SLS/Orion? \u003C/p\u003E\u003Cp\u003EThat\u0027s progress. Congress is softening up to Spaceflight, and several members of Congress have admitted to having a genuine interest in space travel. Come on, it\u0027s a freaking body of 435 educated people with university degrees, at least one or two should have a true interest in NASA. However, it is Beig turned into another political slugfest with alot of Democrats rallying behind it and a lot of Republicans still demanding a moonbase, obviously still sore from the death of Constellation.\u003C/p\u003E\u003Cp\u003EI have no idea otherwise about how NASA will \u0022pick up\u0022 the sample (But it\u0027s been suggested) , but they could attach a small probe to the space craft and eject it when in range of Phobos.\u003C/p\u003E\u003Cp\u003ETake a leap of faith or two.\u003C/p\u003E\u003Cp\u003EIt\u0027s a new start for Congress. They wouldn\u0027t have been doing this twenty years ago, would they?\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2014-03-01T21:00:04Z","Content":"\n\u003Cp\u003EHas anyone speculated on what kind of craft would be used for this?\u003C/p\u003E\u003Cp\u003EWould it be a scaled down MTV/Copernicus type vehicle, or perhaps something closer to a scaled up Deep Space Habitat:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/4/4d/ISS-Derived_Deep_Space_Habitat_with_CPS.jpg\u0022 alt=\u0022ISS-Derived_Deep_Space_Habitat_with_CPS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, will this require the use of an NTR or could it be done with a chemical rocket?\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-03-01T21:12:38Z","Content":"\n\u003Cp\u003EIf it\u0027s 2021, you\u0027re looking at block I SLS. Forget hab modules; it\u0027d barely be able to put Orion alone on a flyby trajectory.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-03-01T21:13:29Z","Content":"\n\u003Cp\u003EDefinitely chemical rockets, no time to develop one or get the public swayed.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-01T21:19:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EIf it\u0027s 2021, you\u0027re looking at block I SLS. Forget hab modules; it\u0027d barely be able to put Orion alone on a flyby trajectory.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is why putting it at 2021 will make the SLS Blocks avaliable earlier with more funding. \u003C/p\u003E\u003Cp\u003EHowever, that funding will have to come from somewhere, and that somewhere will likely be Planetary Science.\u003C/p\u003E\u003Cp\u003EBut the EML-2 outpost can be launched with a Block I cargo rocket, atleast, thats what Boeing says. \u003C/p\u003E\u003Cp\u003E@jfull: It is possible with chemical rockets.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-01T21:22:34Z\u0022 title=\u002203/01/2014 09:22  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 1, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2014-03-01T21:22:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EAnd personally, this is just me, but \u003Cstrong\u003EI would rather live in a nation with a corrupt government, increasing poverty, and tons of issues and controversies\u003C/strong\u003E with an successful space program than a \u003Cstrong\u003Eutopian society\u003C/strong\u003E that has given up on space exploration. It may be Bread and Circuses, but its well worth the cost.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI find this hilariously ironic in that the point of a utopian society, if you live in one, is that you don\u0027t need these programs to keep \u0022advancing\u0022 Ã¢â‚¬â€ and even if you wanted to do so anyway, you should have the resources at hand if it\u0027s truly a perfect society as is the definition of utopia. Basically, you\u0027re only interested in spectacle and the \u003Cem\u003Efeeling\u003C/em\u003E of supporting something you think is so great Ã¢â‚¬â€ I guess I shouldn\u0027t be surprised considering your name.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-01T21:24:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Accelerando\u0022 data-cite=\u0022Accelerando\u0022\u003E\u003Cdiv\u003EI find this hilariously ironic in that the point of a utopian society, if you live in one, is that you don\u0027t need these programs to keep \u0022advancing\u0022 Ã¢â‚¬â€ and even if you wanted to do so anyway, you should have the resources at hand if it\u0027s truly a perfect society as is the definition of utopia. Basically, you\u0027re only interested in spectacle and the \u003Cem\u003Efeeling\u003C/em\u003E of supporting something you think is so great Ã¢â‚¬â€ I guess I shouldn\u0027t be surprised considering your name.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, my point was that it is better to live in a society with issues but that will keep advancing science, because that society will get somewhere someday, than a utopian society without internal issues but suppresses science actively, becuase that society will just fail someday inevitably.\u003C/p\u003E\u003Cp\u003EI suck at making analogies.\u003C/p\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2014-03-01T21:27:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003ENo, my point was that it is better to live in a society with issues but that will keep advancing science, because that society will get somewhere someday, than a utopian society without internal issues but suppresses science actively, becuase that society will just fail someday inevitably.\u003Cp\u003EI suck at making analogies.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue enough, I guess. But then what happens when the troubled society inevitably fails as well?\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-03-01T21:28:57Z","Content":"\n\u003Cp\u003ELet\u0027s ignore that the planetary budget wouldn\u0027t cover even a fraction of that for now, and pretend your proposal could come to fruition. So, we\u0027ve got the very first flight of a new rocket model, with at least one entirely unflown engine, lofting a hastily-developed hab module and a spacecraft that has never flown crewed before on a mission of a duration no closed eclss system has ever acheived, so some astronauts can see Mars out of a window for maybe an hour. And for that all that\u0027s been lost are all of the Mars probes returning real science that\u0027d be likely to be operational at that point. Does that really seem like a good idea to you?\u003C/p\u003E\n"},{"CreatedByName":"GJames","CreatedById":58866,"CreatedDateTime":"2014-03-01T21:57:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003ELet\u0027s ignore that the planetary budget wouldn\u0027t cover even a fraction of that for now, and pretend your proposal could come to fruition. So, we\u0027ve got the very first flight of a new rocket model, with at least one entirely unflown engine, lofting a hastily-developed hab module and a spacecraft that has never flown crewed before on a mission of a duration no closed eclss system has ever acheived, so some astronauts can see Mars out of a window for maybe an hour. And for that all that\u0027s been lost are all of the Mars probes returning real science that\u0027d be likely to be operational at that point. Does that really seem like a good idea to you?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESometimes you can\u0027t really get any further with an argument, especially if all parties involved have clear-set views. This pretty much happens on most of the threads here. Why not just stop repeating yourselves and let everyone have their own views? Discussion is great, but too often it degenerates into something almost like squabbling.\u003C/p\u003E\u003Cp\u003EAlso Kryten, not singling you out or aiming to cause offence, but your post was kinda a good example...\u003C/p\u003E\n"}]}