{"TopicId":64574,"ForumId":44,"TopicTitle":"Orbital Museum","CreatedByName":"MeticulousMitch","CreatedById":34869,"CreatedDateTime":"2014-03-01T03:33:56Z","PageNum":1,"Articles":[{"CreatedByName":"MeticulousMitch","CreatedById":34869,"CreatedDateTime":"2014-03-01T03:33:56Z","Content":"\n\u003Cp\u003EYour task is to create an \u003Cstrong\u003Eorbital museum\u003C/strong\u003E that will preserve modern cultural and scientific artifacts for millions of years.\u003C/p\u003E\u003Cp\u003EPrimary objectives of the museum would be:\u003C/p\u003E\u003Cp\u003E1.) \u003Cstrong\u003EStability.\u003C/strong\u003E The museum needs to remain in an indefinitely stable orbit, so as to avoid colliding with the earth or moon or being ejected into interplanetary space. Propose Geosynchronous/Lagrangian, etc.\u003C/p\u003E\u003Cp\u003E2.)\u003Cstrong\u003E Preservation.\u003C/strong\u003E The museum must protect its contents from radiation in the long-term, and possibly incorporate a pressurized section for the preservation of biological samples.\u003C/p\u003E\u003Cp\u003E3.) \u003Cstrong\u003EEase of access.\u003C/strong\u003E Easily achievable orbits are preferred over orbits which are difficult to reach. Furthermore the design of the station should probably facilitate easy access to the items on board.\u003C/p\u003E\u003Cp\u003E4.) \u003Cstrong\u003EVisibility.\u003C/strong\u003E If possible the museum should be visible in the night sky with the naked eye, so that it is easily rediscovered after civilization-ending catastrophe.\u003C/p\u003E\u003Cp\u003EFeel free to speculate on how to achieve the above points, as well as what artifacts such a museum might contain:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBooks?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EVehicles?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWebsites?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBiological specimens?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EArtwork?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EFilms?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EExamples of certain technology?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHow large might this station be, and how much would it cost to construct?\u003C/p\u003E\u003Cp\u003EFinally, if you have a better idea for preserving our current civilization, propose it. It may be better to have multiple museums, or even a different concept entirely.\u003C/p\u003E\u003Cp\u003EIf some intriguing ideas come out of this I will create 3D artwork depicting such a station.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-03-01T03:39:27Z","Content":"\n\u003Cp\u003EI think leaving something like that in orbit would make it vulnerable. I think building, for instance, on the moon would provide better chances of survival - especially if you dig in. The lack of atmosphere would prevent wear, as long as you take radiation and (micro)meteorites into account, but both of those can be avoided by going underground. The moon itself would provide a huge shield.\u003C/p\u003E\n"},{"CreatedByName":"Headhunter09","CreatedById":67393,"CreatedDateTime":"2014-03-01T04:07:19Z","Content":"\n\u003Cp\u003EKind of reminds me of \u003Ca href=\u0022http://starslip.chainsawsuit.com/\u0022 rel=\u0022external nofollow\u0022\u003EStarslip\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EI would probably bury it in an asteroid (provides shielding, structural support, heatsink, raw materials, etc.), and put the asteroid in a highly stable orbit, or near a Lagrange point. I would also keep it fairly nondescript, and leave markers on other celestial bodies or on the Earth that would allow a reasonably advanced civilization to pinpoint the asteroid\u0027s location.\u003C/p\u003E\u003Cp\u003EOne big problem with some sort of long-term storage is accounting for the fact that languages and even thought systems will change radically in even a few thousand years. This was addressed partially in the documentary Into Eternity.\u003C/p\u003E\u003Cp\u003EI guess the best way to reliably store any data would be clay tablets, since that has been the most effective long-term storage to date.\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-03-01T11:04:18Z","Content":"\n\u003Cp\u003E1) The orbit would be strictly circular and altitude would be greater than any atmospheric effects (Maybe 10000 km)\u003C/p\u003E\u003Cp\u003E2) The station would have lead shielding. Lots of it and it would be an inch thick.\u003C/p\u003E\u003Cp\u003EWe\u0027re not gonna mess around with pressurization. Vacuum is a pretty good method of preservation.\u003C/p\u003E\u003Cp\u003E3) The station would have airlocks and be rated for pressurization, as well as have highly generalized air fittings for adding air. (think the vacuum lines in your chemistry lab. Any rubbery line shoved overtop will form a seal)\u003C/p\u003E\u003Cp\u003EThe station would also have an east-orbit exactly over the equator, making it easy to dock to.\u003C/p\u003E\u003Cp\u003EIn terms of docking, the station would have a large flat circular magnetic washer docking port. The inside radius would be large enough for two people in spacesuits and the outside radius would be much, much larger. You\u0027d still have to get inside with a spacesuit.\u003C/p\u003E\u003Cp\u003EAs far as access to items on board: The items would be restricted to items that can survive a vacuum, and they would be secured in a simple and easy to remove fashion.\u003C/p\u003E\u003Cp\u003E4) The station\u0027s skin would have a texture of many spheres, and painted white or some other reflective colour. The bumpy texture should reflect light in every direction.\u003C/p\u003E\u003Cp\u003EI would store data in a strictly binary fashion. Nothing stands the test of time like data stored in binary and any civilization that could reach the station would have obviously figured out the benefits of binary and would be able to decode it without too much trouble. Perhaps crystal discs? MAgnetic tape would be a poor choice. \u003C/p\u003E\u003Cp\u003EEvery component of the station (including the lead shielding) should have information etched onto it. Lots of math would be nice, since that\u0027s handy to any civilation. Maybe the proof of Fermat\u0027s last theorem? \u003C/p\u003E\u003Cp\u003EIt would be nice to provide them with a dictionary, although that\u0027s a moot point as far as application goes.\u003C/p\u003E\u003Cp\u003EDNA sequences. Store as many dna sequences as possible. That can\u0027t be rederived.\u003C/p\u003E\n"},{"CreatedByName":"Headhunter09","CreatedById":67393,"CreatedDateTime":"2014-03-01T17:03:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sillychris\u0022 data-cite=\u0022Sillychris\u0022\u003E\u003Cdiv\u003EI would store data in a strictly binary fashion. Nothing stands the test of time like data stored in binary and any civilization that could reach the station would have obviously figured out the benefits of binary and would be able to decode it without too much trouble. Perhaps crystal discs? MAgnetic tape would be a poor choice. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow can you be sure people in the future would know to scan any high-density format (nanoscopic etchings, crystal lattices, etc)? In the past, people have burned scrolls as kindling at archaeological digs because they didn\u0027t recognize that they contained information.\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-03-01T17:53:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Headhunter09\u0022 data-cite=\u0022Headhunter09\u0022\u003E\u003Cdiv\u003EHow can you be sure people in the future would know to scan any high-density format (nanoscopic etchings, crystal lattices, etc)? In the past, people have burned scrolls as kindling at archaeological digs because they didn\u0027t recognize that they contained information.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t need to be high density, if just needs to be binary.\u003C/p\u003E\u003Cp\u003EIf I scribble down a bunch of ones and zeroes on a piece of paper, it\u0027s still stored as binary.\u003C/p\u003E\u003Cp\u003EAlso, I feel I can safely conclude that any civilization that can attain spaceflight will at some point figure out how to extract data from whatever medium we store it in... especially if we leave instructions in the form of pictures.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-03-01T19:06:20Z","Content":"\n\u003Cp\u003ENice ideas, but the only one who mention what to put inside was Sillychris. \u003C/p\u003E\u003Cp\u003EBut when I thought in a space museum I imagine more icon stuffs. Like Voyager.\u003C/p\u003E\u003Cp\u003EI would keep the voyager traveling untouch like its now, so I would put a string some meters around with a \u0022No Trespassing\u0022 sign (museum style), matching voyager speed. \u003C/p\u003E\u003Cp\u003EI sort of satisfy all requirements. Is in orbit (around galaxy), there is not much radiation problems there, kinda visible and in the future you can go with your ship and your kids, stop at side and gaze at our first instruments which open our eyes and knowledge, still in duty with its mission.\u003C/p\u003E\n"},{"CreatedByName":"Transits","CreatedById":104718,"CreatedDateTime":"2014-03-01T21:11:23Z","Content":"\n\u003Cp\u003EWhat I would do is attach the museum to the end of a space elevator in, say... Northern Brazil, then It would allow easy access to and fro. Also, you could have large fields of solar panels connected to the museum to provide power and you could use an oxygen generator to provide oxygen (take gases from the atmosphere up the elevator and use them to provide plants with photosynthesis along with the energy from the solar panels), and gravity could be generated by a rotating torus.\u003C/p\u003E\n"},{"CreatedByName":"MeticulousMitch","CreatedById":34869,"CreatedDateTime":"2014-03-01T23:41:49Z","Content":"\n\u003Cp\u003EIt\u0027s difficult to imagine a space elevator lasting millions of years without maintenance, especially considering factors like continental drift. We also don\u0027t know how to build one yet.\u003C/p\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2014-03-02T02:10:22Z","Content":"\n\u003Cp\u003EHaul an asteroid back to HEO and bore the museum into it. Assuming a density \u003Ca href=\u0022http://meteorites.wustl.edu/id/density.htm\u0022 rel=\u0022external nofollow\u0022\u003Earound 3.2g/cm^3\u003C/a\u003E for stony meteorites, and a 600,000,000g or 600 ton asteroid pushed by ion engines, we get a volume of roughly 188 m^3. Could presume, from there, that we have a roughly spheroid shape: solving for radius of a perfect spherical body gives us a \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eradius\u003C/span\u003E of ~3.5 meters, a \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ediameter\u003C/span\u003E of ~7 meters. This \u003Ca href=\u0022http://www.space.com/20610-nasa-asteroid-capture-mission-infographic.html\u0022 rel=\u0022external nofollow\u0022\u003Esounds like\u003C/a\u003E it is within the boundaries of NASA\u0027s proposed asteroid capture mission, except for the large detail that we are hauling to HEO rather than Lunar orbit.\u003C/p\u003E\u003Cp\u003EAssuming that\u0027s possible, this would give us enough room for maybe a really small module for use as a museum, using the rock as a radiation and dust shield. It would probably cost on the order of however much the asteroid recovery does, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Asteroid_Retrieval_and_Utilization\u0022 rel=\u0022external nofollow\u0022\u003Eest. around $3 billion\u003C/a\u003E, plus however much it will cost to send the module up there along with drilling equipment and maybe astronauts to install it all and give everything the once-over. Cost of launching an SLS is \u003Ca href=\u0022http://www.nbcnews.com/id/49019843/ns/technology_and_science-space/\u0022 rel=\u0022external nofollow\u0022\u003Eest. around $500 million\u003C/a\u003E so I\u0027ll assume in the neighborhood of $2 billion for actual museum installation because of the new equipment. This puts us at $5 billion to do it all.\u003C/p\u003E\u003Cp\u003EWill it be visible with the naked eye? Maybe if the asteroid were painted with some highly reflective material, or sheathed in a large structure made of Mylar, for instance.\u003C/p\u003E\u003Cp\u003EAlternatively, we could skip the hauling asteroid part and install the museum at an asteroid that\u0027s already close to home, \u003Ca href=\u0022https://en.wikipedia.org/wiki/2010_TK7\u0022 rel=\u0022external nofollow\u0022\u003E2010TK7\u003C/a\u003E at solar L4. 300m diameter gives us more room to work with at distance-based cost of visibility and accessibility.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe museum itself:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe museum will contain digital and analogue data stored in several types for redundancy. We will have records, sturdy plates, shelves of books, some genetic information, and a few exemplary pieces of technology.\u003C/p\u003E\u003Cp\u003EWe should have at least one record that demonstrates how humans speak. We could record speakers saying letters aloud, or phonemes, or Chinese characters, something to that effect. At the same time, we should include with this record a written list of all things spoken, so our future listeners can figure out what they\u0027re hearing. Other records, like the one included on the Voyagers, would be nice.\u003C/p\u003E\u003Cp\u003ESturdy physical plates of some sort should be used for recording important text, maybe in conjunction with the records. We could engrave important works of art onto them, maybe encoding color data in the depth of the engraving at each pixel.\u003C/p\u003E\u003Cp\u003EOur paper library most critically will have picture books. Clear, to-the-point illustrations should show what the basic words of our written languages mean, at least sufficiently that the reader will be able to use the dictionary. After this we will have mix of language learning books, historically important fiction, philosophy, science and mathematical texts, history books. Among these books we may have some containing punchcards.\u003C/p\u003E\u003Cp\u003EGenetic material could be stored in a heavily shielded container in the center of the museum. Refrigerating it \u003Ca href=\u0022http://www.nature.com/news/dna-has-a-521-year-half-life-1.11555\u0022 rel=\u0022external nofollow\u0022\u003Ecan allow it to stay readable for more than a million years\u003C/a\u003E if the asteroid remains cold enough.\u003C/p\u003E\u003Cp\u003EWe store petabytes digitally if we can perfect formats such as \u003Ca href=\u0022http://www.southampton.ac.uk/mediacentre/news/2013/jul/13_131.shtml\u0022 rel=\u0022external nofollow\u0022\u003Elaser-baked glass\u003C/a\u003E and \u003Ca href=\u0022http://phys.org/news162061022.html\u0022 rel=\u0022external nofollow\u0022\u003Eiron-in-CNT memory\u003C/a\u003E that promise incredible information density and more than a million years of life. If that doesn\u0027t turn out, we engrave the data in metal or ceramic, or maybe punchcards as before. Even if they can\u0027t hold much, we could keep them to serve as examples of stored data formats.\u003C/p\u003E\u003Cp\u003ETechnology-wise, we may want to include a few actual computers. Not sure what else.\u003C/p\u003E\u003Cp\u003EFinal note. Digital records, like human language, will need to come with a way to decode them. On a sturdy physical medium, like metal sheets, we should draw clear diagrams, something like a picture book that shows how we read and write and process digital information. Computer architectures, maybe? Lists of characters and their corresponding numerical values in various text encoding formats like Unicode, ASCII, etc.\u003C/p\u003E\u003Cp\u003EWhat do you all think?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-02T02:26:31Z\u0022 title=\u002203/02/2014 02:26  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 2, 2014\u003C/time\u003E by Accelerando\u003C/strong\u003E\n\u003Cbr\u003Echanged \u0026quot;orion vehicle\u0026quot; to SLS\n\u003C/span\u003E\n"},{"CreatedByName":"Jordanpumah","CreatedById":47395,"CreatedDateTime":"2014-03-02T02:53:09Z","Content":"\n\u003Cp\u003EDeleted because I am really tired and the thing that was here was kinda stupid.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-02T02:55:14Z\u0022 title=\u002203/02/2014 02:55  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 2, 2014\u003C/time\u003E by Jordanpumah\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Transits","CreatedById":104718,"CreatedDateTime":"2014-03-02T10:33:29Z","Content":"\n\u003Cp\u003EA space elevator could have robots doing maintenance on the center of mass (where most tensile force will be happening), these (I given moderate AI) could make it last a hugely long time.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-03T12:16:58Z","Content":"\n\u003Cp\u003EOrbit is a particularly bad place to put such a museum. Somewhere on or below Earth\u0027s surface is far, far safer from the many hazards of space. If you want redundancy from Earth-destroying events, the surface of some other body is safer than an orbiting station.\u003C/p\u003E\u003Cp\u003EOne of the main reasons for making such a museum, in my opinion, is to help bootstrap civilization if we ever have a cataclysmic fall. It\u0027s not much help for that if you need basic space travel to access it.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-03-03T13:25:39Z","Content":"\n\u003Cp\u003EExactly. If as the OP posted, your objective is stability, preservation, ease of access and visibility, then a high Earth orbit is probably one of the poorest places to put it.\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-03-03T15:13:36Z","Content":"\n\u003Cp\u003EPut in on the Moon, and draw a massive target with titanium oxide powder. That way, anybody on Earth could see the gigantic sign pointing to where the museum is.\u003C/p\u003E\u003Cp\u003EClay tablets are easy to build for a neolithic or bronze age civilization. In our day and age, etching on silicon, diamond or alumina isn\u0027t very difficult and would result in a much sturdier support. Also, a big chunk of alumina is pretty useless, and alumina is common and cheap, so you don\u0027t risk tomb raiders to melt it or sell it for scrap. They might steal it and sell it as an archeological artifact though, but it stands a better chance of staying intact.\u003C/p\u003E\u003Cp\u003EI would make tablets of with different \u0027font\u0027 size, with the biggest one at the entrance and containing the most basic information, like instructions, alphabets, etc. That way, the explorers would first discover the instruction manual, and seeing tablets with smaller and smaller characters would know they need to look for microscopic engraving on the ones that look smooth.\u003C/p\u003E\u003Cp\u003EBinary coding seems the most logical way to store data for the far future. I would write in an uninterrupted line, like a snake or a spiral, to avoid confusing on how to read a big matrix. The trick they used in SETI, using a number of bits that is the product of two primes so that aliens would spontaneously arrange them in a rectangle and see the picture is a very good idea, and I would include it, at least for some of the first tablets.\u003C/p\u003E\u003Cp\u003EIn the fine print, but still readable with the naked eye data, I would include a hard-copy of wikipedia and a few dictionaries, including pictures. With such a document, you could learn the language and discover pretty much the complete civilization. Obviously, you would need to select the most useful articles and make them stand out, so that future translators don\u0027t waste too much time reading transformer movie or assassin\u0027s creed article before they can understand the language and basic cultural aspects.\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-03-03T21:45:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EOrbit is a particularly bad place to put such a museum. Somewhere on or below Earth\u0027s surface is far, far safer from the many hazards of space. If you want redundancy from Earth-destroying events, the surface of some other body is safer than an orbiting station.\u003Cp\u003EOne of the main reasons for making such a museum, in my opinion, is to help bootstrap civilization if we ever have a cataclysmic fall. It\u0027s not much help for that if you need basic space travel to access it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEver heard of plate tectonics? No museums getting subducted in space! (Note: This forum thinks subducted isn\u0027t a word) \u003C/p\u003E\u003Cp\u003EAlso, I think restricting access until a civilization got space faring capabilities would seriously improve the odds of them not wrecking everything.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-03-03T21:52:44Z","Content":"\n\u003Cp\u003EIn space, the museum would need to constantly adjust its orbit. Unlike KSP, Orbits aren\u0027t stable indeffinitely. In Earth orbit you have to worry about the gravity of the Earth, Moon, Sun, Jupiter, and if you plan to keep something there for very, very long, the gravity of all inner and most outter planets too.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-03T22:04:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sillychris\u0022 data-cite=\u0022Sillychris\u0022\u003E\u003Cdiv\u003EEver heard of plate tectonics? No museums getting subducted in space! (Note: This forum thinks subducted isn\u0027t a word) \u003Cp\u003EAlso, I think restricting access until a civilization got space faring capabilities would seriously improve the odds of them not wrecking everything.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe know enough about the location of fault lines to put it someplace safe. Or make multiple facilities, likely still cheaper than a single orbiting facility.\u003C/p\u003E\u003Cp\u003EAnd restricting access to spacefarers only woud like mean that if civilization falls, it will stay fallen.\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-03-03T22:31:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EWe know enough about the location of fault lines to put it someplace safe. Or make multiple facilities, likely still cheaper than a single orbiting facility.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe know enough to predict near future geologically stable zones, yes. However, introduce any kind of geologic time scale and it becomes impossible to predict. The entire surface of the Earth has been recycled at some point in its history with the oldest rocks being very rare. It would take one hell of a lucky guess to stick a museum in a spot that escapes all tectonics for all time (If that\u0027s even possible on a planet as geologically active as Earth). \u003C/p\u003E\u003Cp\u003EAlso: Erosion. Water and wind will wear down anything we can ever make.\u003C/p\u003E\u003Cp\u003EBesides, the OP asked for ideas of an \u003Cstrong\u003Eorbital\u003C/strong\u003E museum, and he didn\u0027t list price as a judgement criteria. This museum may very well be for the benefit of ET life stumbling upon our planet. Worried about bolide impacts with your orbital museum? Give it an automated defense system. You can\u0027t shoot down getting subducted into the freaking mantle.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EAnd restricting access to spacefarers only woud like mean that if civilization falls, it will stay fallen.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut at least records of our civilization are preserved instead of being turned into shanty huts and cheap memorabilia by struggling survivors in the short term aftermath.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2014-03-03T23:10:00Z","Content":"\n\u003Cp\u003EI support the Moon Museum ideas. The Moon is (relatively) easy to get to, very visible, and will stick around for a while. Of course, it is a bit of a target for any passing meteor which decides to hit the surface. As such, one structure on the surface is rather vulnerable to future meteor strikes. So perhaps we could build one main museum with the bulk of our culture, but then place several copies (or at least references to the main museum\u0027s things) in other regions, as well as maps to the main museum and the other satellites, in case their locations were lost due to meteor strikes. All these facilities would be located underground, but have structures on the surface showing where they are. I also like the idea of painting the Moon, perhaps put a fundamental mathematical law in symbolic form on it, so that future civilizations understand that it was not a natural process which created the markings on the Moon, and that they ought to develop space travel so that they could see what we left for them.\u003C/p\u003E\u003Cp\u003EI now have an idea for a science fiction book/movie/video game in which a future civilization discovers these markings and sets out to discover our museums on the Moon.\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-03-03T23:19:44Z","Content":"\n\u003Cp\u003ELMFAO \u0022professional lithobraker!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-03-04T09:37:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sillychris\u0022 data-cite=\u0022Sillychris\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBesides, the OP asked for ideas of an \u003Cstrong\u003Eorbital\u003C/strong\u003E museum, and he didn\u0027t list price as a judgement criteria. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is typical space-cadet behavior of coming up with a cool idea that involves spaceships and rockets, and then looking for a reason to do it. Usually, when you then isolate the problem that you are trying to solve, you find out that either it has lots of far easier and cheaper solutions than putting stuff on big rockets, or that there was no real problem to begin with.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-03-04T21:27:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ESomewhere on or below Earth\u0027s surface\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat, then we\u0027d have the movie \u003Cem\u003ENational Treasure\u003C/em\u003E happen in real life.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-03-04T21:29:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sillychris\u0022 data-cite=\u0022Sillychris\u0022\u003E\u003Cdiv\u003EEver heard of plate tectonics? No museums getting subducted in space! (Note: This forum thinks subducted isn\u0027t a word) \u003Cp\u003EAlso, I think restricting access until a civilization got space faring capabilities would seriously improve the odds of them not wrecking everything.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, your browser doesn\u0027t think it\u0027s a word. If the forum had a word database, \u0022Kerbal\u0022 would work automatically.\u003C/p\u003E\n"},{"CreatedByName":"Headhunter09","CreatedById":67393,"CreatedDateTime":"2014-03-04T22:31:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EWhich is typical space-cadet behavior of coming up with a cool idea that involves spaceships and rockets, and then looking for a reason to do it. Usually, when you then isolate the problem that you are trying to solve, you find out that either it has lots of far easier and cheaper solutions than putting stuff on big rockets, or that there was no real problem to begin with.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re right of course. Thought experiments are fairly pointless, since you would never see them occur in any variety of reality.\u003C/p\u003E\u003Cp\u003EThought experiments ask you to place a series of artificial constraints on your thinking for the purpose of entertainment, encouraging thought, discussion, etc. \u003C/p\u003E\u003Cp\u003EPointing out the fact that it is a thought experiment is both useless and obnoxious.\u003C/p\u003E\n"}]}