{"TopicId":64615,"ForumId":39,"TopicTitle":"Hyphen- a space station.","CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-03-01T15:27:45Z","PageNum":1,"Articles":[{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-03-01T15:27:45Z","Content":"\n\u003Cp\u003EBefore she could get a job working \u003Cem\u003Einside\u003C/em\u003E a space station, Alexia had to get a job \u003Cem\u003Emaking\u003C/em\u003E a space station. No-one had thought of a space station in Kerbin orbit since the destruction of Pistol-Ancrese about 53 years ago, so she had to convince some very powerful people to take her seriously.\u003C/p\u003E\u003Cp\u003E\u0022Would Alexia Kerman please proceed to the high sector, thank you.\u0022\u003C/p\u003E\u003Cp\u003EShe knew the system was extremely flawed, the religious high elders of Ermon decided on everything and they didn\u0027t take too kindly to scientists such as herself. \u003C/p\u003E\u003Cp\u003E\u0022Alexia S. Kerman, you have an idea you wish to put forward to us then?\u0022 the supreme elder said grimly, like he had far better things to do,\u003C/p\u003E\u003Cp\u003E\u0022Yes, your elder, I propose a space station in orbit around Kerbin.\u0022\u003C/p\u003E\u003Cp\u003E\u0022And how would such an idea benefit society?\u0022\u003C/p\u003E\u003Cp\u003EShe knew he really meant \u0022And how would such an idea benefit me?\u0022\u003C/p\u003E\u003Cp\u003E\u0022We don\u0027t have accurate knowledge of how materials and Kerbals react in 0g your elder, much is to be learned from this.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Really now? But I\u0027m afraid we think that the only valid source of such knowledge is the divine scriptures, don\u0027t you?\u0022\u003C/p\u003E\u003Cp\u003EDamn it, they used their favorite line. If she said no she would be in religious imprisonment, if she said yes she\u0027d get denied.\u003C/p\u003E\u003Cp\u003E\u0022Yes, I suppose bu-\u0022\u003C/p\u003E\u003Cp\u003E\u0022Then it is settled, your application is denied\u0022\u003C/p\u003E\u003Cp\u003E\u0022But your elder I-\u0022\u003C/p\u003E\u003Cp\u003E\u0022I said DENIED!\u0022 the high elder shouted, \u0022Miss Kerman! Didn\u0027t you learn manners? Now leave this room at ONCE!\u0022\u003C/p\u003E\u003Cp\u003EShe began to walk out of the room, no matter what, if it didn\u0027t conform to their bigoted views on Ermonism, it would not even have a drawing board to go back to.\u003C/p\u003E\u003Cp\u003E\u0022So, how\u0027d the viewing go?\u0022 It was her friend and close ally, Jordan.\u003C/p\u003E\u003Cp\u003E\u0022Terrible, actually, they didn\u0027t even listen.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You know that already, they\u0027re trained not to listen\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah, I suppose, I just wish there was someway to get past them\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well if society changes maybe there will, in about 2783 years\u0022\u003C/p\u003E\u003Cp\u003EWell that was the beginning of a story, tell me what you think and let me know of ideas.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-03-02T08:34:59Z","Content":"\n\u003Cp\u003EInteresting start and quite a bit different to the Space Race style of story we get a lot of here. I could see this being less about space travel and more about the actual kerbals - look forward to seeing more if you get the time!\u003C/p\u003E\n"},{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-03-15T19:05:10Z","Content":"\n\u003Cp\u003EThe drive home was a long one, 342 km in the baking hot desert to her home in Virkeran city, but she used every minute of it thinking of as many little niches she could find in the system. Her application was denied, but that didn\u0027t forbid her from carrying it out anyway, although it did put her in an incredibly awkward position of funding. Where could she get funding? It was illegal to fund anything the high elders denied, and there were few things worse than having the high elders have an excuse to arrest you. \u003C/p\u003E\u003Cp\u003EAh,well, she\u0027d have to think about it tomorrow, she had more pressing issues in mind. Like the Religious Police force blocking the road.\u003C/p\u003E\u003Cp\u003EAs she stopped her Phantom-OCC 4x4 beside the roadblock she was probed by questions,\u003C/p\u003E\u003Cp\u003E\u0022Hello officer, what can I help you with?\u0022\u003C/p\u003E\u003Cp\u003E\u0022We need you to step out of your vehicle and answer any questions we ask you, is that clear?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Er, yes, I- I suppose.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Do you have any affiliation with Francis Roman?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Who?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Don\u0027t \u0027Who?\u0027 me girl, Do you have any affiliation with the branded heretic Francis Roman?\u0022\u003C/p\u003E\u003Cp\u003E\u0022No! I don\u0027t even know the man!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Good...Are you a firm believer in the scripted law?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes...and...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Because a certain Mr. Roman has tried to spread word that Treus 7:24 is invalid and immoral. Would you mind showing your faith by reciting that particular Iocene?\u0022\u003C/p\u003E\u003Cp\u003E\u0022All guidance shall be rested on the elders and high elders and no-one shall question it, for it is the command of the savior.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well done child, the savior looks down kindly on you. Dismissed.\u0022\u003C/p\u003E\u003Cp\u003EAs she passed through the gate she began to wonder about where to go next, she needed petrol for the rest of the way home, but as she glance at her watch she found what needed to come first.\u003C/p\u003E\u003Cp\u003EChurch.\u003C/p\u003E\u003Cp\u003EA brutally restrictive thing, church. While she drove down to the nearest stretch of road to the temple she saw many R.P.F units patrolling around, looking to find anyone out after the service begins, she saw a large of path filled with slow, lumbering church goers, the elders showing up at the last minute, all before she got within 600 meters of the temple. She was one of the last ones inside, so the service began almost instantaneously.\u003C/p\u003E\u003Cp\u003E\u0022To the highest power, we pray to thee for guidance, so we may prosper in our glorious days.\u0022\u003C/p\u003E\u003Cp\u003E\u0022So we may prosper in our glorious days.\u0022\u003C/p\u003E\u003Cp\u003EPraying was a ritual that was hard to enjoy, even by the most adamant supporters, at times like these; The desert heat pressing down on everybody inside, the round glass dome above the building concentrating sunlight on the people far below, the R.P.F patrolling the inside to make sure everything was normal, the whole lot made her grouchy and tired by the end of it.\u003C/p\u003E\u003Cp\u003EBy the time she got back on the road it was getting on into the late afternoon and she was feeling terrible after another roadblock.\u003C/p\u003E\u003Cp\u003E\u0022Honestly, you don\u0027t need two roadblocks on one piece of road!\u0022\u003C/p\u003E\u003Cp\u003EIt was another 5 hours, sundown at this time of year, before she got into the outskirts of Virkeran city but by now the novelty of roadblocks had worn off. Why so many? Is it all for one guy? Perhaps this Francis Roman was to be listened to after all...\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-03-16T11:13:59Z","Content":"\n\u003Cp\u003EGreat stuff! I liked the bits and pieces of scripture and doctrine and I could almost feel the heat and airlessness inside that church.\u003C/p\u003E\n"},{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-03-16T11:54:21Z","Content":"\n\u003Cp\u003ETorrents of snow came pelting down onto the research base as the two researchers came inside.\u003C/p\u003E\u003Cp\u003E\u0022Damion, Norman, CQ-65\u0022\u003C/p\u003E\u003Cp\u003E\u0022Roman, Francis, XC-25\u0022\u003C/p\u003E\u003Cp\u003EThe machine bleeped as it let in the two hooded men through a blast proof door and into the main compound where there were large mugs of cocoa waiting for them on their desks. Francis slipped a note to his co-worker before heading off down to the simulation lab to run some tests on new designs of rockets that could be used in the military. \u003C/p\u003E\u003Cp\u003E\u0022S81c- mark 9. S81d- mark 10. S81e- mark 8. Standard payload, 10 megaton nuclear unit. God, this is boring.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah, well, those tests \u003Cem\u003Eare\u003C/em\u003E needed on the 19:00 report. And besides, you\u0027ve only got to do until the S95 series.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I suppose, S82a- mark 10. S82b- mark 7. Wait, hang on.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Got something Francis?\u0022\u003C/p\u003E\u003Cp\u003E\u0022I think I have, S82a can carry the same load as a satellite, into orbit.\u0022\u003C/p\u003E\u003Cp\u003E\u0022A satellite? Come off it!\u0022\u003C/p\u003E\u003Cp\u003E\u0022No, think about it. We could start making scientific endeavors in space rather than just looking at how something could kill your family and irradiate your home.\u0022\u003C/p\u003E\u003Cp\u003EAs Damion was making his way upstairs he read the note Francis had given him.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EDamion,\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EScience needed,\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOn the run,\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EGet Alexia.\u003C/em\u003E \u003C/p\u003E\u003Cp\u003E\u0022Alexia? She\u0027s thousands of kilometers away!\u0022\u003C/p\u003E\u003Cp\u003EHe shook his head in disbelief as he made his way to phone and called Alexia\u0027s mobile.\u003C/p\u003E\u003Cp\u003E*beep* *beep* *beep*\u003C/p\u003E\u003Cp\u003E\u002210700 triple 8.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Alexia? Is that you?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Damion? I thought you were in the arctic!\u0022\u003C/p\u003E\u003Cp\u003E\u0022I am, and I need your help.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Why?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Have you heard of Francis Roman?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah, they\u0027ve set up roadblocks around the country to catch him.\u0022\u003C/p\u003E\u003Cp\u003E\u0022HAH! Yeah! He\u0027s in the arctic with me and he says he can launch a satellite into orbit, but your the only person he can trust.\u0022\u003C/p\u003E\u003Cp\u003EAlexia was shocked, this was just the thing she needed.\u003C/p\u003E\u003Cp\u003E\u0022Why me?\u0022\u003C/p\u003E\u003Cp\u003E\u0022He heard about your report on space stations in orbit. He says he can get the launch facilities for you if you help him with his science goal.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I\u0027m in\u0022\u003C/p\u003E\u003Cp\u003EShe put down the phone and was close to tears.\u003C/p\u003E\u003Cp\u003EIt was what she had dreamed of, coming true.\u003C/p\u003E\n"},{"CreatedByName":"Th_","CreatedById":101351,"CreatedDateTime":"2014-03-18T01:16:48Z","Content":"\n\u003Cp\u003EThis is extremely well-written! I like the idea of kerbals being these heavily-religious race rather than a naturally curious one, like most other stories portray. Keep up the good work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-03-22T12:49:07Z","Content":"\n\u003Cp\u003E\u0022Three, two, one, Mark\u0022\u003C/p\u003E\u003Cp\u003E*FIZZLE* *BOOM*\u003C/p\u003E\u003Cp\u003E\u0022God dammit! I need these engines to be up and running for the first flight!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Everything alright Francis?\u0022\u003C/p\u003E\u003Cp\u003EAlexia handed over a mug of Kofey.\u003C/p\u003E\u003Cp\u003E\u0022No. These engines always break down!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Have you tried reinstalling te bearings?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes! Twice! I think the rotor fan keeps getting clogged.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You could try and get a cleaning system.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Where would I put it though?\u0022\u003C/p\u003E\u003Cp\u003E\u0022You could mount it on the outside of the rotor fan.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Or you could try refining the fuel.\u0022\u003C/p\u003E\u003Cp\u003EIt was Damion walking out onto the ice flats with even more flasks of Kofey.\u003C/p\u003E\u003Cp\u003E\u0022Hmm, that might work. How would I do it though?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Centrifuge off some liquid hydrogen and oxygen and place that in the tank.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Rather than regular kerosene?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes, kerosene is a very inefficient fuel. I\u0027m a chemist, I should know.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I\u0027ll get the workshop lads to hook me up with some. Thanks.\u0022\u003C/p\u003E\u003Cp\u003EAs Francis dashed off down to the chemistry deck Alexia and Roman walked over to the steaming hunk of metal that was ,technically, C.L.F.R 0.616.\u003C/p\u003E\u003Cp\u003E\u0022You can see where the rotor blade keeps breaking\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah, right on the shaft. You really think liquid hydrogen and liquid oxygen would stop this?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes, the exhaust keeps heating the internal core too hot, and thus when it clogs and breaks it destroys the structure entirely. Look, you can see where the broken rotor has smashed and melted it\u0027s casing, causing total internal collapse.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Couldn\u0027t we make it out of a more heat resistant material?\u0022\u003C/p\u003E\u003Cp\u003E\u0022In theory that would solve most of the problems but we\u0027re getting to the limits already.\u0022\u003C/p\u003E\u003Cp\u003ETHE NEXT DAY\u003C/p\u003E\u003Cp\u003E\u0022OK, test of the C.L.F.R 0.7, this time with liquid oxygen and liquid hydrogen fueling. Three, two, one, Mark.\u0022\u003C/p\u003E\u003Cp\u003E*FIZZLE* *WHOOOSSSSSHHHHHHHHH*\u003C/p\u003E\u003Cp\u003ETiming at 5...10...15...20...25...30...fuel nearly out...35, cut out!\u0022\u003C/p\u003E\u003Cp\u003E*THUNK*\u003C/p\u003E\u003Cp\u003E\u0022Perfect flight! Heat signature nominal throughout the flight, stress capabilities exceeding expectations, we have our first proper test!\u0022\u003C/p\u003E\n"},{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-03-29T18:52:09Z","Content":"\n\u003Cp\u003EFrancis was tied up with anxiety, this was the first proper rocket they had built. C.L.F.R 0.711 engine, VN-400l fuel tank, DXNY-223 decouplers and a specially fitted computer monitoring\u003C/p\u003E\u003Cp\u003Edevice with a radio antenna attached, the Detached Rocketry Control System version 4, or DRCS-4. All of the systems had been properly tested and the rocket was attached to the launch pad with 2 large clamps that would release 0.1 seconds before take off. 10 minutes to go, the ground crew was scurrying about left right and center trying to fix minor issues, establish a constant radio stream to the rocket, removing the thermonic insulation that kept the fuel from evaporating all before the final moments. By 2 minutes all foreseeable problems had been fixed and the rocket was ready to leave kerbin. \u0022T-5, 4, ignition sequence start, 3, 2, 1, separation nominal, we have liftoff of the Anatolia 1 rocket! Designed to touch the stars!\u0022\u003C/p\u003E\u003Cp\u003EFrancis took a big sigh of relief, the rocket had taken off successfully! All communications with the on-board computer were perfect as the internal heat sensors and pressure sensors showed that the new, cleaner fuel had managed to stop critical failure.\u003C/p\u003E\u003Cp\u003E\u0022See that?\u0022 Damion asked while pointing at the now white blur moving steadily upwards, \u0022That\u0027s your progress right there. The engineering of you and your team have gotten 20 tonnes of explosives into space!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Are getting.\u0022 replied Francis \u0022We\u0027re not there yet.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Just you wait and see! 2 decades from now you might even land on the MÃƒÂ¼n!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Or aboard a space station\u0022 Whispered Alexia.\u003C/p\u003E\u003Cp\u003ESorry for small update. Will probably do more quick short ones than hard-to-make long ones.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-03-29T19:34:39Z","Content":"\n\u003Cp\u003EJust some friendly criticism:\u003C/p\u003E\u003Cp\u003EI like your vivid descriptions, they really convey the whole \u0027Conform\u0027 feeling of the setting. However, in writing a dystopia like this, an important thing is to not be preachy. You can just feel it pushing the theme of \u0022THEOCRACIES ARE BAD, KAY?!\u0022 down your throat, and that can be a turn-off even to people who agree with you. Still, it\u0027s an interesting idea, and I hope to see more!\u003C/p\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-04-04T16:05:51Z","Content":"\n\u003Cp\u003EThis is a bit preachy. \u003C/p\u003E\u003Cp\u003EThe only thing I\u0027m getting out of this is \u0022RELIGION IS BAD K?\u0022\u003C/p\u003E\n"},{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-04-04T16:12:26Z","Content":"\n\u003Cp\u003E\u0022Orbit secured, how\u0027s it going up there?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Amazing, I can see more of Kerbin than anyone since the 1960\u0027s\u0022\u003C/p\u003E\u003Cp\u003EThe crackling transmission abruptly ended with a sharp crack as Anatolia IV disappeared behind the planet. One orbit had been completed by Rouge in the tense moments since liftoff, and now kerbalkind was back to the stars .\u003C/p\u003E\u003Cp\u003E\u0022Did you hear about Frequency Aerospace? They\u0027ve just launched a kerbal into space themselves.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I heard! It appears we have someone on our tail.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I wonder how Rouge is doing...\u0022\u003C/p\u003E\u003Cp\u003E---UP IN ANATOLIA IV---\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThis is the diary of Rouge Desmond Kerman,\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EToday I went into orbit! My craft has officially passed over the same spot of land! I feel so happy. There was one moment of the launch where I thought I would die in a cascade of rocket debris and fire, but luckily that didn\u0027t happen! Anyway, time to note down some important events. Theorodica has now launched a full scale hunt for Francis Roman. I just hope he\u0027s alright. A couple of planes got hit by a missile off the coast of Agraristan. And, best bit of all, the U.P.A.R (United Protectorate of the Arctic Region) has officially gained recognition from the Kerbal Grand Council and is currently being assisted by Medwedia. I think that\u0027s all. Rouge out! \u003C/em\u003E \u003C/p\u003E\u003Cp\u003ERouge sighed as he closed the recorder. This was one of the best moments of his life, but it would soon end. Coming up over the southern Agraristanian ocean was the point he would have to engage his engines in order to land at the ice flats that the base was located.\u003C/p\u003E\u003Cp\u003E\u00225, 4, 3, 2, 1, mark. Re-ignition. Burn count 10, 15, 20, 30, 40, 50. Engines cut. Trajectory pointed over to the ice flats.\u0022 \u003C/p\u003E\u003Cp\u003E*THUNK* \u003C/p\u003E\u003Cp\u003ENow decoupled, Rouge could see the stage that had put him into orbit drift slowly past as he readied the craft for reentry.\u003C/p\u003E\n"},{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-04-06T17:09:41Z","Content":"\n\u003Cp\u003E\u0022Mission Control, I see fire.\u0022\u003C/p\u003E\u003Cp\u003E\u0022OK Rouge, that\u0027s to be expected. Can I get some readings?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Patching through now.\u0022\u003C/p\u003E\u003Cp\u003EThe computer whirred as it calculated weather the situation was bad or not. \u003C/p\u003E\u003Cp\u003E\u0022Everything nominal except heat patterns. 9.83% above safety margin and rising.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Re-orienting.\u0022\u003C/p\u003E\u003Cp\u003EThe reentry was stressful, despite a mere 2 minutes before touchdown at the ice fields the maneuvers seemed to take an eternity to take action. Beads of sweat ran down Rouge\u0027s face as the gyroscopic stabilization unit put the craft more heat-shield first.\u003C/p\u003E\u003Cp\u003E\u0022That any better?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Marginally, it\u0027s stopped rising and has fell to 7.13% above safety margin, try to get it more center on.\u0022\u003C/p\u003E\u003Cp\u003E\u0022It\u0027s stopped going below 6.92% Will that kill me?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hard to say at the present time, 30 seconds left till you start shedding heat.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Come on Rouge you son of a Kerm, you can do this.\u0022 He muttered to himself as he started engaging landing procedures.\u003C/p\u003E\u003Cp\u003E\u0022Parachute deployment in 45 seconds and counting.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Gotcha.\u0022\u003C/p\u003E\u003Cp\u003E\u0022...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Control, repeat.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Y..t..f.a...s...a.b.d\u0022\u003C/p\u003E\u003Cp\u003E\u0022Control, repeat.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Engage parachutes now!\u0022\u003C/p\u003E\u003Cp\u003EHe was startled so it took him a few seconds to respond. Parachutes billowing upwards he felt a huge jolt as one of the ripped free.\u003C/p\u003E\u003Cp\u003E\u0022Rouge! Abort 3! Abort 3! Fire descent eng..s.a.w.d\u0022\u003C/p\u003E\u003Cp\u003EThen static.\u003C/p\u003E\u003Cp\u003E\u0022Control, repeat. Control, repeat! I said repeat Kod Damnit!\u0022\u003C/p\u003E\u003Cp\u003EThe abort engines kicked in as a final jolt threw him into blackness.\u003C/p\u003E\u003Cp\u003E-------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003EOn mission controls end.\u003C/p\u003E\u003Cp\u003E\u0022Parachute deployment in 45 seconds and counting.\u0022\u003C/p\u003E\u003Cp\u003EA faint crackle returned before a reply came in \u0022Gotcha\u0022\u003C/p\u003E\u003Cp\u003E\u0022Wait! You\u0027re too fast! Abort!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Control, repeat.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You\u0027re too fast! Abort failsafe 1!\u003C/p\u003E\u003Cp\u003E\u0022Control, repeat.\u0022\u003C/p\u003E\u003Cp\u003E\u0022ENGAGE PARACHUTES NOW!\u0022 Francis yelled as all telemetry returned failure.\u003C/p\u003E\u003Cp\u003E\u0022Rouge! Abort 3! Abort 3! Fire descent engines! one of your parachutes has failed! Dammit!\u0022\u003C/p\u003E\u003Cp\u003E\u0022What is it Francis?\u0022 said Alexia as she rushed into the control room.\u003C/p\u003E\u003Cp\u003E\u0022Rouge\u0027s comm\u0027s line is dead, his last telemetry readings gave failure on altitude, speed, heat and pressure and the on-board computer has stopped responding!\u0022\u003C/p\u003E\u003Cp\u003E\u0022We\u0027ll have to scout out the crash site.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Agreed, fetch the jeeps and let\u0027s head out of here.\u0022\u003C/p\u003E\n"},{"CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2014-05-18T19:36:09Z","Content":"\n\u003Cp\u003EVery very nice! Recommend you have some ancestor of one of our KSP heroes appear at some point. Example idea: Magus von Kerman\u003C/p\u003E\n"},{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-05-21T16:21:34Z","Content":"\n\u003Cp\u003EThe bumpy ride over the ice ridges twisted Alexia\u0027s nerves. Rouge was almost certainly dead. She knew that. But this certainty didn\u0027t help her.\u003C/p\u003E\u003Cp\u003E\u0022Alexia, I see smoke, 30\u003Csup\u003Eo\u003C/sup\u003E clockwise. About 1.9 kilometers away.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0027So, we\u0027ve found it.\u0027\u003C/em\u003E she thought, \u003Cem\u003E\u0027we\u0027ve found the crashed ship of our first astronaut\u0027\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u0022Alexia, don\u0027t beat yourself up about it, rouge\u0027s death was tragic, but it was not any particular person\u0027s fault. We checked, double-checked and triple-checked all systems. Rouge knew that. He wouldn\u0027t want you to go on like this.\u0022 said Roman\u003C/p\u003E\u003Cp\u003EMaybe he was right. All systems \u003Cem\u003Ewere\u003C/em\u003E stress checked more times than can be counted.\u003C/p\u003E\u003Cp\u003E\u0022If everything was perfected, then tell me why his ship heated up past the safety margin and the parachute was torn off.\u0022 Alexia replied her voice trembling.\u003C/p\u003E\u003Cp\u003E\u0022We need to investigate the crash site to be sure, but we think it was due to a dodgy entry angle and fast winds that ripped the parachute off its cord.\u0022\u003C/p\u003E\u003Cp\u003EOne thing was for sure, they were going to find out soon.\u003C/p\u003E\n"},{"CreatedByName":"FlamingPotatoes","CreatedById":35731,"CreatedDateTime":"2014-06-01T09:25:24Z","Content":"\n\u003Cp\u003EChadley Kerman had a quiet life. Nothing was too much hassle. He made his wage from the rocketry steel in the town far below and he lived in a group of 7 houses clustered on a hill.\u003C/p\u003E\u003Cp\u003EOne thing that was particularly special, at least to him, was his wife Tiffany, who was about to have a child. His child.\u003C/p\u003E\u003Cp\u003E4 days later as he came home from work, Chadley noticed a small wailing coming from his home. He rushed in to find his wife slumped in bed holding a little baby kerbal in her arms. This young Kerbal had a dazzling spray of red hair, like none seen before. They both set on a name almost instantly, Rouge. The tiny kerbal sat in a small cot drifting off to sleep as his mother sang to him. \u0022You will shine, you will be bright. Like a rocket in the night. When you fall you\u0027ll think you\u0027re done, but Rouge I know you\u0027ll never give up.\u0022\u003C/p\u003E\u003Cp\u003E------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003E\u0022Rouge! Are you alive?\u0022 yelled Alexia as they jumped out of the jeep near the blackened hulk of steel. \u003C/p\u003E\u003Cp\u003E\u0022Yes, what a great question to ask!\u0022 replied Francis \u0022Now pass me the metal saws, we need to get this open!\u0022\u003C/p\u003E\u003Cp\u003EOne by one they cut open sections of metal until they reached the inside of the cabin and saw Rouge lying there, unconscious and battered but not mortally wounded.\u003C/p\u003E\u003Cp\u003E\u0022Get him out of here! Relay a message back to base! Get the examination crews to have a look at this cabin!\u0022 \u003C/p\u003E\u003Cp\u003E\u0022Yes sir! Outbound squad Alpha to hometown, Outbound squad Alpha to hometown.\u0022\u003C/p\u003E\u003Cp\u003EA quiet, crackling audio came through the other side \u003Cem\u003E\u0022Outbound squad Alpha, this is hometown, what is your message?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u0022We\u0027re outside the wreckage of the Anatolia I capsule, the Anatolia IV. Send engineering squads Alpha, Bravo, Charlie and Echo to examine\u0022\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022Roger that, they\u0027re on their way.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003EBlackness, inky blackness\u003C/p\u003E\u003Cp\u003ELike a squid. I like squids. Or should I say liked?\u003C/p\u003E\u003Cp\u003EAm I dead? I might be, maybe. No-ones said, \u0022come towards the light\u0022\u003C/p\u003E\u003Cp\u003EWell, there is no light, only blackness. Like a squid, or an octopus.\u003C/p\u003E\u003Cp\u003EDid I like octopuses? I think I did. They\u0027re like squids. And I like squids.\u003C/p\u003E\u003Cp\u003EAny sound? No? Wait...There is something.\u003C/p\u003E\u003Cp\u003E\u0022Rouge, come to!\u0022\u003C/p\u003E\u003Cp\u003EWhat was that? Was it a squid?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Rouge! Come to!\u0022\u003C/p\u003E\u003Cp\u003EHold on, I remember that voice.\u003C/p\u003E\u003Cp\u003ESlowly, rouge opened his eyes.\u003C/p\u003E\u003Cp\u003E\u0022Where am I?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hospital\u0022 said Alexia, smiling down at him.\u003C/p\u003E\u003Cp\u003E\u0022At least I\u0027ll be taken care of. I had one hell of a nap.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Rouge, you almost burnt up in the atmosphere.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hmm, did I? Oh well. And tell the doctors to get me a fish tank with a squid in it. Oh, and I would like fried calamari for lunch.\u003C/p\u003E\n"}]}