{"TopicId":64730,"ForumId":51,"TopicTitle":"Mod Virgin - Career playing with \u0026quot;Better Than Starting Manned\u0026quot;","CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-02T19:45:11Z","PageNum":2,"Articles":[{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-05T15:11:03Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EOscar 3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ENot much to report on this one. I sent up another Oscar probe to try and find more Mun biomes, this time by circling the equater. Unfortunately it only found one new biome, the East Farside Crater. I could (and I guess will at some point) send another Oscar to polar orbit around the Mun but for now I\u0027ll spend some of my science to move on. I\u0027m going to unlock the heatshield and begin some work on testing sample return.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Tm2HCyg.png\u0022 alt=\u0022Tm2HCyg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe parts you see are an odd little stabilizer (it seems to attach radially to anything, hard to accurately position it), another fin, the 1.25m heatshield and the 1.25 nosecone. In stock I wouldn\u0027t be touching the aerodynamic branch of the tech tree until I was done the rest - first get a good chunk of the bottom (science) then grab a good chunk of the top (rocketry). But in BTSM everything seems to have a needful purpose.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-05T21:03:47Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPapa 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhile Papa 1 will collect real science it is also an engineering test mission for a number of components. With access to the heat shield I want to road test a complete sample recovery system, the first sample being taken from high orbit around Kerbin. I\u0027ve taken the existing Oscar ship and lightened the load by removing most of the batteries and then moved the guidance system into the orbital module. The top is modified into a sample return system with the probe core, heat shield, parachute and the experiments I want to return. The battery is for weight balance with the goo container and the GravMax is providing ballast equal to some instruments I might add later. I might as well find out now if a bigger parachute is required.\u003C/p\u003E\u003Cp\u003EWith more then enough delta-v (I skip the third stage entirely and only do a small burn with the orbital module) the whole thing is launched up to 255 km where a sample is taken. The sample return module seperates and falls back to Kerbin. To fully test it I\u0027ve taken a number of steps:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe module is oriented down, to determine if the return package will be able to reorient itself through drag (from a large distance it may be impossible to determine the correct orientation for the heat shield before seperation)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe battery power is turned off to kill the probe before entry, to ensure the parachute works automatically in BTSM (my automatic chute deployment was perfected during my probe career)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe launch was aimed for a water landing to test the impact on everything\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEverything works as planned and I get another 50 science. The return system is viable to bring back a sample from the Mun, it just needs to be on a return path before power runs out.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2kNWWss.png\u0022 alt=\u00222kNWWss.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/w87Ev4N.png\u0022 alt=\u0022w87Ev4N.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/9wCwlRL.png\u0022 alt=\u00229wCwlRL.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/XxXVtjV.png\u0022 alt=\u0022XxXVtjV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Bn8JDSv.png\u0022 alt=\u0022Bn8JDSv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext on the agenda I will probably be testing a slightly larger launcher to send a sample return mission from Mun orbit (it won\u0027t need all the delta-v, but I want to test a launcher that can be used for a lander). Maybe I\u0027ll carry 2 GravMax instruments like in the test run and make a polar approach to get that data and return it (rather then pack batteries to transmit it).\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-06T03:12:23Z","Content":"\n\u003Cp\u003EWhile building the ship that will first undertake a proving flight to go around the Mun and return with a sample before being fitted with landing gear for a landing and return I\u0027ve used some science to unlock another item, Heavy Rocketry. I had some motives for unlocking this as I was considering if I could use the T200 tank in a particular way but it turned out I couldn\u0027t (more on that after the pic). I did get the T30 engine which I\u0027ve taken on an undocumented flight I\u0027ll call Quebec 0 - just the engine, a fuel tank, batteries and a probe core in order to check its performance. The T30 has the same characteristics as it does in stock. That means that it doesn\u0027t overheat when you throttle over 80% and so you can get all 215 thrust out of it. It also weighs 0.25 less then the T15. This is an interesting part of BTSM, it definitely has some parts (like the initial battery and the T15 and LV405 engines) that are deliberately inferior versions of stuff you\u0027ll be able to improve later on. The T15 feels like it is essentially the experimental version of the T30, mirroring the real development of a space program.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YfRscZ2.png\u0022 alt=\u0022YfRscZ2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway I really needed some delta-v despite carrying lots of weight (batteries and other essential equipment add up fast in BTSM) and I was thinking of using my docking ports to radially mount the T200 tanks. However I discovered you can\u0027t radially mount the docking ports in BTSM - in fact there are a lot of little adjustments that seem to be designed to prevent you from skipping technology by taking advantage of stock mechanics. For example I found out you can\u0027t transfer fuel manually. Instead after unlocking Heavy Rocketry I can see a new tech for 160pt that in addition to giving me some more engines (the T45, LV909 and Poodle) it also gives me a fuel pump. That means I need electricity to move fuel and only in certain ways!\u003C/p\u003E\u003Cp\u003EBecause of all of this my current rocket is rather big - the launcher has the same basic layout as Oscar just fatter but the lander is probably the first time in a very long time that I\u0027ve mounted multiple engines on a lander, and it\u0027s because I can\u0027t move or otherwise manage fuel in a magic way like you can in stock. My lander needs lots of delta-v to move those batteries. I did the numbers for putting some batteries on the transfer stage so I could get rid of the cells used for the 4-8 hour trip to the Mun but it wasn\u0027t enough so I ended up with multiple engines to avoid having to land a skyscrapper lander from all the fuel it needed to carry.\u003C/p\u003E\u003Cp\u003EIf all goes according to plan I should have a chance to fly Quebec 1 soon on a low orbit polar pass of the Mun, taking GravMax readings near the poles and performing Goo experiments in low and high Mun orbit before swinging around and returning them to Kerbin. As long as there are no issues (I still have concerns about the heatshield being able to hold against a Munar return) I\u0027ll unlock the landing legs, adjust the instruments (weight and balance of the return package will remain the same) and begin the first of the Romeo series launches to explore the Mun\u0027s surface.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-06T21:09:57Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EQuebec 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis mission is a prelude to a full Mun landing (I\u0027m not sure if I should name that series Quebec 2-... or go to Romeo, the changes in design will be minimal). This mission will gather some important orbital data from the Mun including Goo experiments from low and high orbit and take GravMax readings (which will be stored instead of transmitted) from the poles. It will then depart the Mun and provide a final dry run for the reentry system (while the instruments will change for the landing I\u0027ve been careful to nail down the exact weight of the return capsule).\u003C/p\u003E\u003Cp\u003EThe only thing I\u0027m really missing for a full landing on this mission is landing gear and the Double-C which I\u0027ll get once I earn just 2 more science and unlock the landing tech. The launcher follows a design like Oscar and Papa only bigger. The first stage is expanded from 12 to 16 engines (4 clusters of 4) and the fuel per engine has been doubled along with some minor reconfiguration of the fin and launch clamp placement to match the geometry. The second stage is almost identical to Oscar (4 radial engines and 1 center) except that it adds the small monopropellent tanks used on the smaller November version of that stage. The 3rd booster stage is reconfigured, it no longer has the guidance or RCS tank (monopropellent for launch was moved to the 2nd stage) but it has been expanded with 2 more engines and 50% more fuel, making it look like a fueled up version of the November 2nd stage. \u003C/p\u003E\u003Cp\u003EThis last booster will actually be used for both the circulization burn and the injection burn and should have just about enough fuel for the capture burn too. The payload is a lander using a center T400 tank and LV405 engine and 3 identical radial tanks with engines. I could have had less fuel in the lander, but it came down to layout - I needed more fuel then what I wanted to stack vertically (too tall and the lander risks tipping) but I didn\u0027t want to have just 2 pods (not as stable) and the pods needed to have the same amount of fuel as the center tank to maximize efficiency.\u003C/p\u003E\u003Cp\u003ESince people sometimes ask about how the design process works here is the excel file. There is a big space between the lander and the next stage, I originally had a transit stage with a single LV405 engine but working the numbers (and imagining the even taller skyscrapper that the single tall transit stage would have created) I found it was easier to beef up the third stage so it could deleted. My notes show I had considered putting some batteries on the transit stage to power my trip to the Mun (then discard them before landing). This would have required some careful micromanaging of which batteries where enabled and as the staging was changed I ended up with a lander with the right number of batteries and the delta-v working out ok so I didn\u0027t go back and rebalance the battery placement. And yes I was being very generous with how much time certain operations would take, I didn\u0027t want to get that far and run out of power.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/u1BRXpP.png\u0022 alt=\u0022u1BRXpP.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/uktDhfV.png\u0022 alt=\u0022uktDhfV.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/hZBJbjZ.png\u0022 alt=\u0022hZBJbjZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launch goes fine. With SAS it becomes pretty standard. The gravity turn worked well with my velocity close to 1900 m/s as I approached the AP and 420 m/s needed to circulize. The third stage kicked in just before the coast phase so I had accurate readouts on how long the burn would be. That meant there was plenty of fuel for the transfer to the Mun. Since I wanted to pickup some more gravity readings, and the only places I was sure I\u0027d find some new biomes was at the poles I did a modified burn out to the Mun, adding a small normal burn so that I\u0027d be roughly above the Mun during the encounter so I could enter polar orbit. Entering the Mun\u0027s SOI a correction is made to get a more exact polar orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ej32uTN.png\u0022 alt=\u0022ej32uTN.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/TjmZnTp.png\u0022 alt=\u0022TjmZnTp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/85epHiy.png\u0022 alt=\u002285epHiy.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/wsdkgnK.png\u0022 alt=\u0022wsdkgnK.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/b2w0q0y.png\u0022 alt=\u0022b2w0q0y.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo far things are going well. I\u0027m only 5.5 hours into the flight and I\u0027m in orbit around the Mun. The T30 engines are the first engines I have that generate power (the T15 doesn\u0027t) and during their burns have extended my battery range by just over an hour (at 5.5 hours in my batteries have only had 4.4 hours depleted). While there are a few drops of fuel left in the transfer stage I eject it. Passing over the poles I find gravity readings for both the Poles and a difficult to snap area called the Polar Lowlands. Like the Highland Craters they seemed to be blink and you\u0027ll miss them as they flew over. I also performed my goo experiments.\u003C/p\u003E\u003Cp\u003EIn theory I could head back with all my science but first, since this is a copy of the lander minmus the legs I want to get test its descent performance before I have to do it for real. I was essentially following an Apollo 10 profile where I would bring the lander in close to the surface and then abort and ascend back into orbit. I wanted to check if the lander was maneuverable enough or if the monopropellent supply would be an issue. Maneuverability was maybe not as good as with a light reaction wheel oriented lander that I usually use, but the reaction wheels so far in BTSM just wouldn\u0027t be enough. The monopropellent attitude control does over correct a bit but it is managable. The only minor issue I could identify after decending to 5km and then turning east to make an ascending burn was that the outer engines did begin to overheat when run at maximum for an extended period of time such as the ascent and circulization burn. Fortunately I don\u0027t see any longer burns and I always have the option of throttling down - the overheating wouldn\u0027t affect the landing. Thrust to weight is good enough to ensure I can quickly slowdown.\u003C/p\u003E\u003Cp\u003ELeaving the Mun I still had plenty of fuel (since I didn\u0027t do a complete landing) and half my battery power. At this stage I did have a concern because I had read the description of a part that is available to be unlocked for 180pts. The large heatshield (1000 points of protection instead of 250 on the small one I have) is suggesting that it is more suited for the velocity of a Mun return - does that mean my small heatshield might not be enough? To be safe I setup a 40 km PE for my return to Kerbin. I also released the return capsule at this time despite having enough batteries to make it all the way back to Kerbin - I want to replicate the conditions of a proper flight. Decoupling at that stage had a big effect on my orbit, moving the PE down by 2 km.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wrjR5Y3.png\u0022 alt=\u0022wrjR5Y3.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/AdCMm8b.png\u0022 alt=\u0022AdCMm8b.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/yhaZhpD.png\u0022 alt=\u0022yhaZhpD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe return to Kerbin took a while. Passing the first time shaved a few points off the heatshield and lowered my orbit to 1.7 million meters. The second pass lowered it to 368 km, raising the heatshield temperature to ove 800 C but not doing any major damage. The final pass, with my PE now at about 34 km brought me down with the heatshield reaching a temperature of 930 C before beginning to drop down even as the heatshield melted away. Over 90% of the heatshield was taken off (21 / 250 left) but the sample capsule survived reentry and parachuted safely to the ground.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FdAFTGz.png\u0022 alt=\u0022FdAFTGz.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QAuwhtU.png\u0022 alt=\u0022QAuwhtU.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/wa0UUq9.png\u0022 alt=\u0022wa0UUq9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I gained 150 science (50 x 2 for Goo, 25 x 2 for GravMax). I\u0027ll now be prepping a Mun landing that will carry a Goo container, 2Hot and Double-C (I think it will carry a PresMat too since I need a little bit of ballast and I might as well see if it does anything)\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-07T00:45:42Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EQuebec 2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis one is going to the Mun. As I mentioned in my last post it will be the same ship but reconfigured for landing for 6 landing legs (I only get the light probe ones for now, the normal sized ones are very soon in the tech tree), one goo container replaced with a battery and the GravMax\u0027s have been replaced with a DoubleC, 2Hot and PresMat which is coming along for weight but since I\u0027m taking it I might as well see if it can be used. The launch goes normally though I didn\u0027t manage to super precise gravity turn so this time the circularization is closer to 700 m/s. I\u0027m going on a flat course to the Mun so there is no inclination work. \u003C/p\u003E\u003Cp\u003EWhen I arrive at the Mun the day side is facing away from Kerbin (Mun is roughly between Kerbin and the sun) so I do my capture burn with the intent of landing before I even complete half an orbit. The landing target is the largest biome (other then the Midlands) that I can spot from space. Given how I had to farm all the science around Kerbin and then GravMax scans around the Mun I want to make sure I\u0027m picking up the biomes immediately so that the Midlands are available if I send a probe and can\u0027t find a better landing site. At 10 km it looks like I\u0027ll be landing near the edge of a small crater inside the larger one (the faint white rim in the lower right of the last picture).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ofx2RNy.png\u0022 alt=\u0022ofx2RNy.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/omWfTP0.png\u0022 alt=\u0022omWfTP0.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/TtCFGZO.png\u0022 alt=\u0022TtCFGZO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs I get closer it becomes apparent I\u0027m coming down on the wall of the crater and a few meters from the ground it\u0027s clear that it\u0027s too steep for my liking. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PO6DANi.png\u0022 alt=\u0022PO6DANi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI push toward the left, down toward the flat bottom of the crater. I\u0027m applying small amounts of thrust to hover a dozen meters over the surface as I coast down the hill before turning right to cancel out my horizontal velocity and prepare to land.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2f0E5qB.png\u0022 alt=\u00222f0E5qB.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe landing is at less then 2 m/s so nothing gets damaged. The ground is still slightly inclined and the ship didn\u0027t have a perfect orientation or lateral velocity but the low speed makes it all work. On the surface I can answer my first question which is what is the Mun\u0027s science multiplier. Turns out it is 6x assuming we take the Kerbin\u0027s atmosphere as 1x and Kerbin and Mun orbit as 2x. The Double-C turns out to have a data value of 50, making the reading worth 300 science. My 2Hot with its base value of 4 is only worth 24 science but it\u0027s something. The most surprising result is that the PresMat works on the Mun, 48 science! This means I might need to check if the PresMat works in orbit of Kerbin or the Mun too (it would be a very small amount of science at this point but knowing if it can be used in orbit of a body would be useful for future missions). There is another detail that I didn\u0027t notice until the return trip when I was reviewing data. None of the readings list a biome, they are just Surface of the Mun. That means there are no seperate Mun biomes to land in which radically alters my plans. I had assume I would need to send multiple Quebec series probes to the Mun to farm the data needed to inch along the tech tree. Instead I got more data then I was expecting and found out that I only need to come back when I can do a manned landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4lZjP6v.gif\u0022 alt=\u00224lZjP6v.gif\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ITywGae.png\u0022 alt=\u0022ITywGae.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt this point I still have lots of battery power but limited fuel thanks in part to changing the landing zone at the last minute. Until I got to the point in the return where I reviewed the science data I was already planning how many batteries I should remove in order to give the probe more delta-v (the answer was I would remove 6 batteries, reducing the lander mass by 1.8 tons). With the limited fuel situation I launch up and perform a limited circulization. I really just want to reach the point \u0027in front\u0027 of the Mun (another 90 degrees from my landing position to make my burn out of its SOI. At that point I make another burn to leave and enter orbit around Kerbin with a PE of 1.8 million meters.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kgLUR0n.png\u0022 alt=\u0022kgLUR0n.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/PJOK93Q.png\u0022 alt=\u0022PJOK93Q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe reentry burn runs into a bit of a snag. I run out of fuel with the PE still at 262 km. Fortunately I still have over half a tank of monopropellent and burning a quarter of that lowers my PE to 38 km to match the actual PE used in Quebec 1. Since I have enough battery power to reach Kerbin twice (but not enough to have circled around to the AP for a more efficient burn) I don\u0027t detach until I\u0027m about to enter the atmosphere. That way the decoupler has minimal effect on my PE. The results are nearly identical to Quebec 1 with 2 braking passes followed by a descent. Even the heatshield loses almost exactly the same amount of shielding.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iSk4vhf.png\u0022 alt=\u0022iSk4vhf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere are various things to unlock at this point. Unlocking Electronics gives me the DTS-M1 comm dish. I may need to more closely compare its stats but I think the difference between it and the start antenna is that the new dish is about 40% lighter and transmits about 50% faster (but at the same cost in power). I could be wrong about the last two parts though. With that unlocked I can see a lot of new things such as advanced stackable battery packs, crew modules and other toys. One issue is that this mod introduces a lot of stats on parts to the point where there is actually a scrollbar to see them all. Unfortunately on the tech tree you can\u0027t operate the scrollbar (moving the mouse toward it gets rid of the tooltip). In the VAB you can scroll though it\u0027s a bit ackward because the clicks are registered in two places. Because of this I can\u0027t see the quantity of life support carried by the new pods (and I can\u0027t see a supplimentary life support container on the tech tree yet)\u003C/p\u003E\u003Cp\u003EObviously I won\u0027t be back at the Mun immediately (except for maybe a flyby if the PresMat turns out to work in orbit). I will probably invest in better batteries and make a trip to Minmus orbit, I\u0027m not sure how many missions I will send there in order to unlock enough technology that I feel confident in making a manned Mun landing. I really need more life support to make that work though since my current little pod only has enough for 200 minutes. One of the pods does however include space suits (but no jetpacks) so I could perform EVAs in Kerbin orbit if I got it.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-07T18:37:14Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ERomeo 1-2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHaving discovered that the PresMat barometer can be used outside of an atmosphere (at least on the surface of the Mun) and with new battery technology unlocked I decided to create a mission to determine if the PresMat could be used in orbit too. Since I wanted some science regardless my plan is to also test the longer lasting batteries by getting a probe all the way out of Kerbin\u0027s SOI while still holding enough charge to transmit back temperature information.\u003C/p\u003E\u003Cp\u003EThe design of Romeo 1 is based on the Quebec launcher, with the lander replaced by a minimal probe and a lot of batteries (over 10,000em). It has a PresMat and a 2Hot as well as the new fold down antenna whose performance I can evaluate. Finally it uses a new probe core which uses half the power of my previous one. Overall the probe should have about 3 days of power not including transmissions. Since the destinations are Kerbin orbit, Mun orbit and orbit around the Sun I plot a Mun gravity assist that is scheduled to take me out of Kerbin\u0027s SOI in 1 day 9 hours.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7YAfPr5.png\u0022 alt=\u00227YAfPr5.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/cSUdKTh.png\u0022 alt=\u0022cSUdKTh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt turns out I can use the PresMat in low orbit though high orbit doesn\u0027t work. Since none of these locations are valid PresMat biomes in the stock game I get to read entirely new messages.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/P2pXzJx.png\u0022 alt=\u0022P2pXzJx.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/jDJpDFx.png\u0022 alt=\u0022jDJpDFx.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/fiijeBH.png\u0022 alt=\u0022fiijeBH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGetting out into orbit around the Sun gives me another temperature reading, though it looks like the Sun doesn\u0027t have the huge multiplier it does in stock. Romeo 1 is left to circle the Sun, though at some point it may get a gravity assist from Kerbin or Eve (the Mun assist seemed to put it close to Eve\u0027s orbit).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003ERomeo 2 uses the same design, though I moved the instruments and communications dish to the top and added a GravMax. I will be flying out to Minmus to perform an orbital survey. The trip out is normal - I match inclination with Minmus and then burn to reach it. Arriving at Minmus\u0027s SOI I make a 10 m/s correction in order to line up my orbit as close as possible.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8Mbtq3o.png\u0022 alt=\u00228Mbtq3o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMinmus orbit turns out to be the same multiplier as Kerbin and Mun orbit, so I won\u0027t be making the huge science leaps you can in stock. In fact even as I\u0027m unlocking items in the 180pt tier (science costs are rebalanced, each their doubles so it looks like 90 \u0026gt; 180 \u0026gt; 360 instead of 90 \u0026gt; 160 \u0026gt; 300) I\u0027m still only bringing in enough science on a mission to unlock one or two items. This is a big difference from stock where as soon as you start landing on the Mun you bring back these huge science gains that let you jump through the tech tree. Finding biomes with the GravMax is much easier on Minmus. I quickly pickup the Slopes, Midlands, Lowlands and the Greater, Great, Lesser and just normal Flats.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2tzE2SL.png\u0022 alt=\u00222tzE2SL.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/zeKaVfj.png\u0022 alt=\u0022zeKaVfj.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/nB4zU0s.png\u0022 alt=\u0022nB4zU0s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI know that one or more regions of Minmus are refered to as the Highlands (I\u0027ve landed there before) but I don\u0027t seem to find it around the equater. I also know there is at least one polar biome (maybe 2 like the Mun). Since I have lots of fuel I do an inclination change after one orbit. The change is such that I should actually hit Minmus after passing the Pole. This is deliberate since with my other readings done and lots of fuel I might as well try a soft landing and transmit with the instruments I have. I get my Poles gravity reading and as I near the ground seperate the bulky transit stage to give myself better attitude control.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RHgQCjd.png\u0022 alt=\u0022RHgQCjd.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/hHztWPs.png\u0022 alt=\u0022hHztWPs.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/d8T7iqD.png\u0022 alt=\u0022d8T7iqD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanding is successful and I can transmit temperature and barometric pressure information from the surface. I still didn\u0027t find the Highlands and I\u0027ve got fuel so I roll and bit and manage to take off again in the low gravity. I end up pushing my suborbital path around until it becomes a complete elliptical orbit with a very low PE and a high orbit AP. I\u0027m out of fuel now but I do manage to find the Highlands with the gravity scanner before leaving low orbit. All that is left now is to dispose of the probe. Since I still have charge and monopropellent I wait until I reach the AP and then lower the PE into Minmus. At the time I lower my PE the ships electrical charge is running low, about 2 hours left. That creates an interesting situation as it is hard to tell if the ship will run out of power first (which damages the probe core, you can\u0027t revive them in BTSM) or crash. It really comes down to the wire, the ship losing charge 71 seconds before impact.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/M7e6rFh.png\u0022 alt=\u0022M7e6rFh.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/BH8mgXe.png\u0022 alt=\u0022BH8mgXe.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/mNBOhwa.png\u0022 alt=\u0022mNBOhwa.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll probably advance in the tech tree to start some more manned operations next, in preparation to reach the Mun. I can also see (at the 360pt tier) my first solar panel. It\u0027s not very strong but I could use it to fly to a probe to Eve or Duna. I also see a mapping instrument at that tier, I\u0027ll need more missions complete before I even consider unlocking it (still need at least 2 different manned tech, better heatshield and the solar panel at minimum)\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-07T20:34:10Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ESierra 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis was a manned mission to test out space suits. I\u0027ve unlocked 3 techs, one which provided me with a large heatshield (and some plane components I won\u0027t use), another which unlocked the Apollo 3 kerbal capsule and the last which unlocked space suits, the bigger lander can (requires 2 to pilot) and some landing parts like bigger legs, radial chute and landing radar.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/igsqzS5.png\u0022 alt=\u0022igsqzS5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEveryone was excited to start the flight, this would be the first spacewalk!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ihMnfXx.png\u0022 alt=\u0022ihMnfXx.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/qZf1dgg.gif\u0022 alt=\u0022qZf1dgg.gif\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/bJ1xi68.png\u0022 alt=\u0022bJ1xi68.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately not much was accomplished. First the EVA control is a bit weird in BTSM. When you click EVA the camera view changes \u003Cem\u003Ebut\u003C/em\u003E the control focus doesn\u0027t actually switch to the kerbal that is now on the ladder (even though it shows a message saying to \u0027press space to let go\u0027). You need to use [ ] to switch to the kerbal before you press any keys that would do something bad on the spacecraft. The second is that apparently without jetpacks I can\u0027t make an EVA report while doing a spacewalk (I did double check on the surface of Kerbin and apparently I can take an EVA report or sample while standing on dry land). I even tried letting go of the ladder and I still couldn\u0027t do an EVA report (Lemger and Gusbin would have used the pods RCS to bring the hatch to him if Hanemone had drifted to far from the handles to grab them again). \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0mfykGy.png\u0022 alt=\u00220mfykGy.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/6Uux1Gu.png\u0022 alt=\u00226Uux1Gu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo until I land on the Mun or unlock jetpacks (which are probably somewhere in the aerodynamics branch knowing how important stuff is being placed there just to make sure I unlock it) there won\u0027t be any EVA reports. Since I\u0027ve used up my science I guess I\u0027ll either need to start planning a manned Mun landing or an unmanned Minmus landing/sample return.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-07T20:41:20Z\u0022 title=\u002203/07/2014 08:41  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 7, 2014\u003C/time\u003E by Dave Kerbin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-08T19:38:59Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ETango 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI need some more science to improve my set of engine, fuel and structural parts to prepare for launching a manned Mun mission with large radius stacking. There are currently two sources of science that I know about that I can reach with my current technology. One is to perform a Goo return mission from just beyond Kerbin\u0027s SOI. That mission would return 150 science based on the data I collected from Romeo 1 though there may be a few questions about whether the heatshield would hold up. That\u0027s not enough science to unlock even one item though, so Tango is going to my alternate source of science which is to get Goo sample returns from Minmus and surface seismograph readings (Romeo 2 already collected temperature and barometric data from the surface). That mission should return at least 550 science plus whatever data can be found examining a capsule returned from the surface of Minmus.\u003C/p\u003E\u003Cp\u003EI\u0027m again using the same launch platform as Quebec. Fuel isn\u0027t as important as battery power this time. I could almost make it work with just one T400 tank but the batteries can\u0027t be radially mounted to the tank (the tank can be radially mounted to the batteries) which would have forced a really tall lander which you know I don\u0027t like. I\u0027m using the larger 2.5m heatshield I unlocked for my manned mission. It may provide better protection for the return from Minmus. The science package is really simple, stacked up top are 3 Goo containers and a single Double-C to be returned to Kerbin. There is an SAS system it\u0027s mounted at the very bottom of the probe along with 2 of my new radial monopropellent tanks. The engines are still LV405s, one of the techs I want to unlock will give me the improved LV909 along with some other engines like the LV-T45 and the Poodle.\u003C/p\u003E\u003Cp\u003EThe flight out to Minmus is by the book, though the actual travel time I get is a bit long, 1 day 20 hours, about 10 hours longer then my target time. In theory I have about 48 hours of power but with the transit stage attached that number is not fixed. Each of the T30 engines has an alternator so when that stage is fired up to 100% it is generating almost 8 minutes of power for every second it is running. This means that probes sent out on the platform leave orbit with a full charge. Arriving at Minmus 2 of the Goo containers are exposed in orbit and the probe settles into low orbit with the transit stage still attached and with fuel still in the tank.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XnCYxhA.png\u0022 alt=\u0022XnCYxhA.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/26fhKPK.png\u0022 alt=\u002226fhKPK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe descent is a little interesting. While I\u0027d normally use some remaining fuel in a transit stage to aid in deorbiting in this case it took on special significance since I was running below the mark on power and above on fuel. The more of that transit fuel I could burn the more I could regenerate the power cells. This led to the clucky transit stage being used for almost the entire descent. With about 50L of fuel left and at 300m I was forced to drop it and try to alter the landers heading a bit with RCS translation. You can see the result of keeping the transit stage until the lander was about 300m from the ground.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0YsQ1rO.png\u0022 alt=\u00220YsQ1rO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3OQM7Sx.gif\u0022 alt=\u00223OQM7Sx.gif\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/rdtzfVV.gif\u0022 alt=\u0022rdtzfVV.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the ground the last Goo container is used as well as the Double-C. I\u0027ve got all the science I came for so it\u0027s time to leave. There is plenty of fuel (enough that I could land a second time) and about 10 hours of power. It\u0027s straight forward to take off and exit Minmus\u0027s orbit before lowering my PE for Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oPZQyup.png\u0022 alt=\u0022oPZQyup.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/hyPMY9q.png\u0022 alt=\u0022hyPMY9q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith reentry set to 36 km it follows the same pattern as previous returns with the probe making 2 braking passes flying as an unpowered mass before entry and automatic parachute deployment. I get enough science to complete the 180pt tier of the tech tree which should be everything I need to go to the Mun. Beyond that I\u0027ll need 360 science per node to unlock the life support tech needed to reach Minmus and solar panels to allow probes to go beyond Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IIrwVW1.png\u0022 alt=\u0022IIrwVW1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aybILLa.png\u0022 alt=\u0022aybILLa.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/5dEeF0k.png\u0022 alt=\u00225dEeF0k.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-08T23:47:14Z","Content":"\n\u003Cp\u003ESo anyway there is some work on to get ready for the manned Mun mission. The operating parameters of the Keel Haul are being tested and the procedure for moving Kerbals and science between pods (internally) in being checked. There is assembly being done in the VAB but there will likely need to be adjustments, at the moment it\u0027s just much too tall to think it can fly straight. Even zoomed out in the VAB it\u0027s not even close to fitting on the screen from the side.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JaAu0pm.png\u0022 alt=\u0022JaAu0pm.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Rbe3Rvo.png\u0022 alt=\u0022Rbe3Rvo.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/qGAMbcC.png\u0022 alt=\u0022qGAMbcC.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sciuris","CreatedById":98369,"CreatedDateTime":"2014-03-09T06:11:01Z","Content":"\n\u003Cp\u003EI enjoyed reading these reports. It\u0027s interesting to see how someone else chooses to progress through the BTSM tech tree. One thing I noticed is that you don\u0027t mention anywhere about picking up crew reports from low orbit. They are biome-sensitive, and so worth a considerable chunk of science all-together. If you missed them, then it\u0027s impressive that you were able to progress fine regardless.\u003C/p\u003E\u003Cp\u003EGood luck with the Mun landing!\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-09T17:03:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sciuris\u0022 data-cite=\u0022Sciuris\u0022\u003E\u003Cdiv\u003EI enjoyed reading these reports. It\u0027s interesting to see how someone else chooses to progress through the BTSM tech tree. One thing I noticed is that you don\u0027t mention anywhere about picking up crew reports from low orbit. They are biome-sensitive, and so worth a considerable chunk of science all-together. If you missed them, then it\u0027s impressive that you were able to progress fine regardless.\u003Cp\u003EGood luck with the Mun landing!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did miss that the orbital crew reports where biome specific in BTSM. I actually noticed a few times an \u0027over water\u0027 report when I was reviewing the science archives but it never clicked that it was a biome specific orbital report. Working it out I have a choice now - I could proceed with my manned mission (I think the craft is ready to go) using all the tech up to 180pts, or I could do a pair of low orbit missions to gather the missing crew reports (excluding the badlands which I never seem to find) and then do that sun orbit Goo experiment. That would give me exactly 360 science (30 * 7 \u002B 150) which could be used to unlock Field Science. The small lander can would greatly reduce the weight of my manned Mun mission.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3MlyacV.png\u0022 alt=\u00223MlyacV.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/fLbc498.png\u0022 alt=\u0022fLbc498.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2Y6myZH.png\u0022 alt=\u00222Y6myZH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny thoughts?\u003C/p\u003E\n"},{"CreatedByName":"Sciuris","CreatedById":98369,"CreatedDateTime":"2014-03-09T18:15:51Z","Content":"\n\u003Cp\u003EDon\u0027t forget the Mun biomes as well. Of course, you don\u0027t need anything more for the Mun landing, so you might as well go ahead with that. Just remember that you can perform and store multiple crew reports in the command module, so pick those up while you are orbiting Kerbin and the Mun. If the mission lands safely, you should start Tech 7 with an insane amount of science!\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-09T18:32:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sciuris\u0022 data-cite=\u0022Sciuris\u0022\u003E\u003Cdiv\u003EDon\u0027t forget the Mun biomes as well. Of course, you don\u0027t need anything more for the Mun landing, so you might as well go ahead with that. Just remember that you can perform and store multiple crew reports in the command module, so pick those up while you are orbiting Kerbin and the Mun. If the mission lands safely, you should start Tech 7 with an insane amount of science!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter your first post that was my plan. The 2 kerbals would go down in the LM and land on the Mun. While waiting for the CM to circle around for the best launch-to-dock window I would be switched back to the CM to do crew reports, mirroring the experiments done by the CM pilot for Apollo.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-09T20:28:50Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EUniform 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe first launch attempt for the Mun mission ran into some problems with the first stage booster.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nWcYsYN.png\u0022 alt=\u0022nWcYsYN.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/h4u1SFE.png\u0022 alt=\u0022h4u1SFE.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/6ZfOLr8.png\u0022 alt=\u00226ZfOLr8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rocket had difficulty maintaining its heading and 2 of the 4 booster modules snapped free under the stress. 1st stage is shutdown and 2nd stage engages to stabilize flight.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ueXTYXs.png\u0022 alt=\u0022ueXTYXs.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/bMfHcyf.png\u0022 alt=\u0022bMfHcyf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe LM is undocked with mixed results, not enough horizontal seperation can be created in time. The CM then seperates and parachutes safely to the ground.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jhXwFCC.png\u0022 alt=\u0022jhXwFCC.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/x7GrXFg.gif\u0022 alt=\u0022x7GrXFg.gif\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/UWpqaWW.png\u0022 alt=\u0022UWpqaWW.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/jiBwvTJ.png\u0022 alt=\u0022jiBwvTJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe lack of thrust vectoring in the Keel Haul engines could be a major problem, there may just be too much thrust to counter with regular attitude control.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-10T01:09:20Z","Content":"\n\u003Cp\u003E\u0022So it\u0027s a lack of thrust vectoring huh?\u0022 the guys over at the VAB said in response to my concerns. \u0022We\u0027ve got you covered\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nGaA0kQ.png\u0022 alt=\u0022nGaA0kQ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-10T22:42:24Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EUniform 2 (Part 1)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe first stage has been replaced and the 2nd stage has been tweaked. I might have moved the lander down so it wasn\u0027t on top of the command module, but the risks associated with how it would need to be strapped in below and retrieved vs the risk involved with extra complexity of a launch abort didn\u0027t seem worth it. The new first stage is half the height of the old one but fatter. Instead of each module containing two booster assemblies there are now three to a module. 4 modules, 3 assemblies each, each assembly containing 4 LV-T45 engines for a total of 48 engines. 48 thrust vectoring engines makes it very stable removing the need for RCS at this point in the flight (which is good because RCS and fins didn\u0027t seem to be enough against all that mass). The revised second stage adds a center stabilizing engine (a Poodle) with enough fuel to approximately equal the burn time of the other engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qMUjMiV.png\u0022 alt=\u0022qMUjMiV.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/XIMmSpE.png\u0022 alt=\u0022XIMmSpE.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ThH1Rjm.png\u0022 alt=\u0022ThH1Rjm.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/LZSCO7P.png\u0022 alt=\u0022LZSCO7P.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn orbit some crew reports are taken while the inclination is fine tuned and the injection burn is setup. It\u0027s a complex job keeping track of 3 tasks at once so it\u0027s a good thing there are three kerbals on board. With the exception of Tundra and Poles this catches me up on the Kerbin orbital crew reports. The 2nd stage booster assists with the injection burn (saving some fuel on the CM) and then the Command Module takes over. I don\u0027t want to waste too much time or fuel. The command module has just short of 24 hours of life support - that number is mostly limited by how far the batteries can be stretched. The lander module has about 3 hours of life support and a small excess of power. It also carries 80% of the combined crafts monopropellent reserves. The tank in the CM will remained locked down unless the LM is operating seperately. The CM\u0027s fuel supply is limited - it has enough to make the journey with the LM and return alone but not much else. The LM has plenty of fuel to ensure a safe landing and so it can take whatever steps are required to dock with the CM before life support runs out. However I couldn\u0027t figure out a way to rig fuel flow and a hatch between the LM and CM without compromising stability. That means extra fuel in the LM can\u0027t be reused (I did the calcuations and it just wasn\u0027t practical from a number of angles to try using the LM\u0027s engine to perform the exit burn from the Mun).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lteWRAB.png\u0022 alt=\u0022lteWRAB.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/8n69pll.png\u0022 alt=\u00228n69pll.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/GJMFSfK.png\u0022 alt=\u0022GJMFSfK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUpon arriving at the Mun observations are made of the surface. Once in low orbit Lemgur and Gusbin use the tunnel to transfer to the landing module. The LM\u0027s batteries are brought to full charge and the snack containers are filled with supplies from the CM. The LM detaches ahead of its planned deorbit point to put some distance from the CM without using additional propellent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0j3Jccb.png\u0022 alt=\u00220j3Jccb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EQg9Or3.png\u0022 alt=\u0022EQg9Or3.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/bhix7Z1.png\u0022 alt=\u0022bhix7Z1.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-11T00:46:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EUniform 1 (Part 2)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith the LM seperated it begins descending to the Midlands in an area just north of what I believe are the Twin Craters. The LM is powered by a single LV909 so it needs to burn off speed early to avoid crashing. With BTSM it has landing radar which can be turned on and gives a tone to tell you the ground is getting closer. Apart from telling me when I was within 3000m of the ground I didn\u0027t find it as much help. I\u0027m not sure if you right click the part with the radar you can see a readout of the true altitude like you can in IVA view. If that\u0027s the case it would be more useful but I just landed by sight - I already landed a probe here earlier with no special instruments so this shouldn\u0027t be harder. The LM has a very nice low center of gravity and big landing legs. It gets a solid touchdown on the first try, no bounce or roll.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zTWvZGf.png\u0022 alt=\u0022zTWvZGf.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/3snVn3c.png\u0022 alt=\u00223snVn3c.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/rVALNL6.png\u0022 alt=\u0022rVALNL6.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/SQpHbaU.png\u0022 alt=\u0022SQpHbaU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGusbin carefully descends the ladder and takes the first cautious steps on the Mun\u0027s surface. After he does not explode Lemger joins him. The EVA report is worth a whopping 450 science though the surface sample is only worth 150. However the Surface sample is biome specific some more then one could be collected - they are very close to one of the Midland Craters but life support in the packs is limited and I don\u0027t want to make such a sudden change in mission plan. If I run low on science however I could return to the Mun for more samples.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ntr4o60.png\u0022 alt=\u0022ntr4o60.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Kvxg7T5.png\u0022 alt=\u0022Kvxg7T5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile up in orbit Hanemone is making observations about the surface as he orbits back around to the landing site. After he passes overhead the LM takes off into a lower orbit to quickly catch up with the CM. A burn is immediately calculated to bring the CM and LM to within 2 km of each other. At that point the orbit of the LM is brought into near sync with the CM (canceling out most of their relative velocity) and leading them to meet after the LM has traveled 3/4 of the way around the Mun from it\u0027s launch on the surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/usvyYYy.png\u0022 alt=\u0022usvyYYy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ntr3zWC.png\u0022 alt=\u0022ntr3zWC.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/odlLbOO.png\u0022 alt=\u0022odlLbOO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDocking is straight forward. It\u0027s actually been a long time since I\u0027ve done an RCS docking. I make some minor adjustments to my approach and then switch over to the CM to order him to turn and face his docking port toward the incoming LM. Since I\u0027m rationing RCS in the CM it\u0027s a slow turn and the LM is now within 50m and approaching at 4.2 m/s. Switching back to the LM I don\u0027t have time to adjust so I slow down instead. The two ships are now about 10m apart but seperated laterally. Since I can\u0027t fly straight in I switch to chase view so I can fly better by eye. I push in on a lateral approach at a slower speed (0.2 m/s) so that the docking port can handle it. Coasting to 3m I give a puff of reverse thrust before contact. The one thing I\u0027ve forgotten in this time is SAS - as soon as the docking port begins to attract the SAS starts firing thrusters to try and correct attitude. I immediately shut it off and the ships dock. Now alternatively I could have turned both ships towards each other when they where stopped and flown straight in but that would have used more RCS and I really didn\u0027t want to use the thrusters on the CM unless absolutely necessary.\u003C/p\u003E\u003Cp\u003E[table]\u003C/p\u003E\u003Cp\u003E[tr]\u003C/p\u003E\u003Cp\u003E [td]\u003Cimg src=\u0022http://i.imgur.com/GU44IX3.png\u0022 alt=\u0022GU44IX3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6Urip2F.gif\u0022 alt=\u00226Urip2F.gif\u0022\u003E[/td]\u003C/p\u003E\u003Cp\u003E [td]\u003Cimg src=\u0022http://i.imgur.com/ITFAVUs.png\u0022 alt=\u0022ITFAVUs.png\u0022\u003E[/td]\u003C/p\u003E\u003Cp\u003E[/tr]\u003C/p\u003E\u003Cp\u003E[/table]\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-11T01:50:49Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EUniform 2 (Part 3)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith the ships docked everyone moves back to the command module. All the samples and observations are transported as well before the lander begins to be stripped of usable resources - life support, power and monopropellent are stolen from the lander to top up the CM. The electricity is welcome as it was being used up faster then life support (this was known at the design stage, the ship didn\u0027t carry enough power by itself to use all the life support supplies) but now looks to be equalized. Since the CM spent two orbits with only one kerbal it\u0027s also saved a small amount of life support which combined with the life support taken from the LM has probably extended it by another 2 hours.\u003C/p\u003E\u003Cp\u003EAfter the exit burn has been planned I line up the ship on the same plane as the maneuver and then start a slow spin. The reason for this is that I\u0027m still drawing from the LM\u0027s monopropellent tanks with the CM tanks full and the valves closed. In the current spin the ship will come back around to the node where a small thrust can stop it. Before that happens however the LM will be released so that the centrifugal force can carry it away and far behind the CM (relative to the direction it intends to fire the engine) without spending any fuel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kAmbqzV.png\u0022 alt=\u0022kAmbqzV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SxKEXag.png\u0022 alt=\u0022SxKEXag.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe command module burns to exit the Mun\u0027s SOI, leaving the LM in stable orbit. After that the CM lowers its Kerbin PE to 25 km and begins the 7 hour journey back home. As it nears the atmosphere the CM battery is brought to full charge by transfering power from the service module batteries and then the service module is ejected. It would have probably been safer to eject it sooner to avoid flying debris but I was focusing on battery power. The entry angle also speed u\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mFcjX2b.png\u0022 alt=\u0022mFcjX2b.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/UILBamG.gif\u0022 alt=\u0022UILBamG.gif\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/amEHDZr.png\u0022 alt=\u0022amEHDZr.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/G3E51lk.png\u0022 alt=\u0022G3E51lk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I\u0027ve earn enough science to unlock 3 different techs. I\u0027ll definitely be unlocking the solar panel (needed for probes going beyond Kerbin) and the advanced landing tech (which includes both the lander can and the life support recycler which I\u0027ll need to reach Minmus). I think I\u0027ll also unlock the tech in the middle of those two offering a mapping instrument.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/a0aYMCe.png\u0022 alt=\u0022a0aYMCe.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-11T12:06:53Z","Content":"\n\u003Cp\u003EWell the starter solar panels are not much. You\u0027ll need several tons of them (all facing the sun) just to power a probe core. For a manned trip to Minmus I\u0027ll either need more batteries (probably 5 to 6 times as many) or better solar cells. I can also see the next tier of techs (which cost 1800 science!) which include an external life support pod (more life support supplies). Based on those numbers and the solar data I won\u0027t be going beyond Kerbin\u0027s orbit with a manned mission for quite a while, I\u0027ll need to focus my research in advancing my unmanned probes. To do that I\u0027ll probably start mopping up the left over science in the Kerbin system.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-11T14:41:04Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EUniform 3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis is a short reuse and technology testing mission. For this mission the Uniform command module recieves some minor modifications - 2 batteries are removed to make room for a life support recycling unit which will be tested on this mission. Additional monopropellent tanks and communications gear is also added to the command module. This mission will also test the new Variable Wavelength Surface Imaging Scanner. Since the lander module won\u0027t be used the scanner can be bolted on in place of the docking port (this means the interior hatch will be welded shut, limiting the command module to just one escape route via the side hatch). The mission will only be to Kerbin orbit, to test the scanner, life support unit and to pickup the 2 polar crew reports so along with the existing weight reduction the 1st stage booster won\u0027t be needed. Since it will also be shorter duration and in Kerbin orbit only one crew member is needed - this reduces the risk since I am slightly concerned about the placement of the recycling unit. It must be connected directly to the command pod and that means it will need to fit between the heatshield and the command pod. Along with the scanner this adds weight and might affect the reentry dynamics.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XFV87XT.png\u0022 alt=\u0022XFV87XT.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/e4Mbqir.png\u0022 alt=\u0022e4Mbqir.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2Ri1hY7.png\u0022 alt=\u00222Ri1hY7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe orbital mission is simple. The scanner appears to operate in low orbit (not biome specific) and provides 120 science but takes an extreme amount of power (about 6000em) and 5 minutes to transmit. The life support recycling turns on by default and reduces the life support being used at the cost of additional energy to run it. Unfortunately at this point I think that power is my limiting factor and not life support consumables. With a one kerbal crew and the smaller lander can I think I could fly to Minmus and back without even needing the recycler, but I would need about 4 times the battery capacity of my Mun mission. AlternativelyMinmus could be done with the existing launch system and a lighter one man lander, but the kerbal would die on the return voyage which is not acceptable.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6hEgDG1.png\u0022 alt=\u00226hEgDG1.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Rcrvmqg.png\u0022 alt=\u0022Rcrvmqg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EReentry goes ok. The recycler heats up to over 200 C during the descent but the command module and sensor temperature remain normal behind the heat shield. So I gain 180 science and have information on the mapping scanner and assurance that the recycler can be safely configured with the command pod for reentry.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o3R7wFY.png\u0022 alt=\u0022o3R7wFY.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"geb","CreatedById":5399,"CreatedDateTime":"2014-03-11T16:16:02Z","Content":"\n\u003Cp\u003EDoes the availability of parts in BTSM force you into Apollo-style seperate lander/mothership somehow? This playthrough makes it clear that you are far more restricted in your options than in stock, but I can\u0027t tell how much it is railroading you into specific missions.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-11T17:10:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022geb\u0022 data-cite=\u0022geb\u0022\u003E\u003Cdiv\u003EDoes the availability of parts in BTSM force you into Apollo-style seperate lander/mothership somehow? This playthrough makes it clear that you are far more restricted in your options than in stock, but I can\u0027t tell how much it is railroading you into specific missions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the Apollo style was really the most efficient way I could think of to do that mission and I did notice how the tech tree and new features/restrictions pushed me in that direction. The factors included:\u003C/p\u003E\u003Cp\u003EThe only viable way for one or more kerbals to reach Mun orbit and return was to the use the Apollo style 3-man Mk1-2 Command Pod. This is because of the life support in BTSM. At this point I only had 3 vessels capable of supporting kerbals in a vaccum (I had unlocked tiers 1 through 6, with tier 7 items costing 360 science each). The little Mercury style 1-man Mk1 Command Pod only carries 200 units of life support (food/air/water) and more importantly the rate at which they are consumed limits the pod to about 2 hours of flight time. That\u0027s not even enough to get into proper Mun orbit. It\u0027s also much heavier then stock (2.99t). The second vessel was the Mk2 Lander can. It\u0027s much lighter then in stock (1.24t) but comes with a restriction that it can only be operated by 2 kerbals, 1 is not enough. Life support isn\u0027t much better - it provides enough food and air to those 2 kerbals for 4 hours of operation. That leaves the Mk1-2 Command Pod which can support 3 kerbals for 24 hours - that\u0027s just long enough to go to the Mun and back with some safety.\u003C/p\u003E\u003Cp\u003ENow in theory you could do a direct ascent mission using the Mk1-2. That was the original NASA way of doing the moon mission. However to land on the Mun with that capsule would need more then double the delta-v I had on it (without the assist from the booster it barely has enough delta-v to cover the trip, the booster assist was my safety margin). You see those batteries under the command pod weigh 1.6 tons \u003Cstrong\u003Eeach\u003C/strong\u003E. They are critical to the functioning of the life support system - in fact my current bottleneck for a manned mission to Minmus isn\u0027t life support consumables, it\u0027s the electrical power to operate the machinery. The amount of fuel I\u0027d need (and probably more thrust too!) would drive the lander above 70 tons. While I might try to chip away at that with staging I\u0027m really restricted there due to the tech tree and changes to which parts can be radially mounted and restrictions on fuel flow (there are no fuel lines and you can\u0027t magically transfer fuel). Disregarding the challenge of getting it into orbit I would still need to safely land such a monster on the Mun (and I only have normal sized landing gear).\u003C/p\u003E\u003Cp\u003EThe design of the command module followed a natural pattern of structural integrity. Since very few things can be mounted radially it would need to be one long tube. And to prevent it from breaking I\u0027d want it to be short and as fat (same diameter) as the command pod itself. That meant using the largest batteries (same mass:em ratio as the smaller ones but 1/4 the height for the same energy density) and the Poodle engine. The choice for the Poodle engine was also down to thrust - the CM\u002BLM weighed 38 tons so a little LV909 wouldn\u0027t cut it. It did the math for an LV909 and barely made a dent since so much of the weight was in batteries (so dry mass was high regardless of engine used).\u003C/p\u003E\u003Cp\u003EThe lander design followed both structural integrity and low center of mass to make it easy/safe to land. I could have packed slightly less fuel but that would have meant using the smaller tanks and they would have to be stacked on top of each other (no way at all to feed fuel from radial tanks) which would have doubled the height of the lander and made it a bad shape to try and land.\u003C/p\u003E\u003Cp\u003ECarrying 3 kerbals and sending 2 down while 1 stays up and does orbital work was also natural. I would need 2 kerbals to operate the lander and structurally there wasn\u0027t a good way to attach a probe core to operate the command module. At that point the life support requirements for 1 kerbal for about 2 hours wasn\u0027t that bad compared to the required safety margins.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kAmbqzV.png\u0022 alt=\u0022kAmbqzV.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2014-03-11T22:00:52Z","Content":"\n\u003Cp\u003EWow man. I noticed the link to this thread in your sig today and decided to check it out, and I just finished reading every word of it. Very nice job, and invaluable to me to be able to see the thought process of a player working their way through the tech tree for the first time like this, especially in such detail.\u003C/p\u003E\u003Cp\u003EI\u0027ll try to answer a few of the concerns that have come up during your play through. My apologies for not responding to your lengthy message about them the other day, but I had a lot on my plate at the time:\u003C/p\u003E\u003Cp\u003E-Part models: I don\u0027t disagree with you, however I\u0027m not an artist (more of a designer and programmer). All part models should be considered place-holder, and the batteries in particular that you mentioned I\u0027ll likely be revising the next time I implement an otherwise save-breaking release, as changing models between versions tends to mess up people\u0027s designs. Those were some of the first parts I put into the mod, so I\u0027ve learned a lot about how KSP works internally since then and have a number of additional options at my disposal that I didn\u0027t know about back then (like part-welding to create distinct looking parts out of stock models, which I use on the life support canisters later in the tree).\u003C/p\u003E\u003Cp\u003E-Vessel focus not switching on EVA: That actually seems to be a sporadic bug that I\u0027ve yet to be able to reproduce. If you manage to find a situation where it happens 100% with a certain set of parts or what have you, please let me know, as it will go a long way in helping me correct it. So far, I haven\u0027t even had it happen once in my play, which makes tracking it down exceedingly difficult.\u003C/p\u003E\u003Cp\u003EAs a side observation, the larger fins you unlocked along with the first heat shield would have made the Keel Haul based design you abandoned much more controllable \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyways man, thoroughly enjoying these mission reports. Thanks for taking the time to put them together, and if you don\u0027t mind, I think I might link to these in the OP for BTSM so people can get a better idea of what\u0027s actually involved in play before downloading.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-11T22:14:28Z\u0022 title=\u002203/11/2014 10:14  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 11, 2014\u003C/time\u003E by FlowerChild\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-03-11T23:45:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlowerChild\u0022 data-cite=\u0022FlowerChild\u0022\u003E\u003Cdiv\u003EWow man. I noticed the link to this thread in your sig today and decided to check it out, and I just finished reading every word of it. Very nice job, and invaluable to me to be able to see the thought process of a player working their way through the tech tree for the first time like this, especially in such detail.\u003Cp\u003EI\u0027ll try to answer a few of the concerns that have come up during your play through. My apologies for not responding to your lengthy message about them the other day, but I had a lot on my plate at the time:\u003C/p\u003E\u003Cp\u003E-Part models: I don\u0027t disagree with you, however I\u0027m not an artist (more of a designer and programmer). All part models should be considered place-holder, and the batteries in particular that you mentioned I\u0027ll likely be revising the next time I implement an otherwise save-breaking release, as changing models between versions tends to mess up people\u0027s designs. Those were some of the first parts I put into the mod, so I\u0027ve learned a lot about how KSP works internally since then and have a number of additional options at my disposal that I didn\u0027t know about back then (like part-welding to create distinct looking parts out of stock models, which I use on the life support canisters later in the tree).\u003C/p\u003E\u003Cp\u003E-Vessel focus not switching on EVA: That actually seems to be a sporadic bug that I\u0027ve yet to be able to reproduce. If you manage to find a situation where it happens 100% with a certain set of parts or what have you, please let me know, as it will go a long way in helping me correct it. So far, I haven\u0027t even had it happen once in my play, which makes tracking it down exceedingly difficult.\u003C/p\u003E\u003Cp\u003EAs a side observation, the larger fins you unlocked along with the first heat shield would have made the Keel Haul based design you abandoned much more controllable \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyways man, thoroughly enjoying these mission reports. Thanks for taking the time to put them together, and if you don\u0027t mind, I think I might link to these in the OP for BTSM so people can get a better idea of what\u0027s actually involved in play before downloading.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for the feedback. As you get later in the tech tree the part models aren\u0027t really a problem - the POT-1 batteries become obsolete pretty fast and the POT-2\u0027s are mostly obsolete (I\u0027m not even sure radial xenon tanks are used). The stretched stack xenon tanks for batteries work pretty well (sometimes there is something like z-fighting). I did notice the part-welding used to create the cool mapping scanner, I\u0027m guessing the fuel pump was created in the same way though it\u0027s less obvious to me exactly which parts have been used.\u003C/p\u003E\u003Cp\u003EI did post over in the feedback thread that while I think the weight of batteries is just fine the physical size of the stack batteries can make things a bit ridiculous. A lot of my probes have been using the POT-360 Elite batteries (yes I got the reference) even though they are the wrong radial size just to avoid the towering stacks. I did make a suggestion for fuel cells - they provide an alternative to endlessly scaling up the number of batteries on a ship while at the same time introducing their own limitations. Since they produce power continously at a fixed rate until the reaction mass runs out you can\u0027t use them as a complete substitute. It would have been cool if my Apollo style Mun lander carried a fuel cell in place of those 4 batteries - the lander uses a battery just like Apollo and there are reentry batteries (the 300 in the command pod) too. This would provide an alternative power source early on for extending range, and later when presumably you can get enough solar power to reach other planets fuel cells can still be used for landers to provide a short term, high output power source for transmitting mission results.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XnCYxhA.png\u0022 alt=\u0022XnCYxhA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only places I think I\u0027ve really felt I was in the dark unfairly was with a few of the numbers - it could help if the descriptions for the two suborbital pods make a more direct reference to the altitude they could operate at before kerbals died without warning (it doesn\u0027t need to be a number, the little altitude scale is also color coded and corresponds to where they can reach). I have really enjoyed the way I could pick up hints by reading all the part and tech descriptions (like how I was indirectly warned about how the higher speed from a Mun return might be an issue for the small heat shield). It could also help if the science parts state how many mbits they are up front - finding out the power requirements by trial and error is the one thing that seems a bit silly considering that kerbals built them in the first place and unlike stock some of the instruments consume massive amounts of power.\u003C/p\u003E\u003Cp\u003EAnd feel free to link to this anywhere you want. This is a great mod/conversion and has really extended the game. It will be kind of weird when stock .24 comes out (yes, there will be a virgin playthrough thread from me to cover how contracts and money affect the game) since I\u0027ll be back playing with far fewer restrictions. I assume it will take a while to rebalance BTSM.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2014-03-12T00:03:57Z","Content":"\n\u003Cp\u003EYup, this thread reminded me to that I had intended to get back to your post in the BTSM thread and had not gotten around to it. Will be doing so later today over on that thread to address it on a point by point basis so as not to bring your mission log thread too off topic here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn this one point though since it wasn\u0027t mentioned in your other post:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dave Kerbin\u0022 data-cite=\u0022Dave Kerbin\u0022\u003E\u003Cdiv\u003EAnd feel free to link to this anywhere you want. This is a great mod/conversion and has really extended the game. It will be kind of weird when stock .24 comes out (yes, there will be a virgin playthrough thread from me to cover how contracts and money affect the game) since I\u0027ll be back playing with far fewer restrictions. I assume it will take a while to rebalance BTSM.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI honestly have my doubts that 0.24 will include money. If you read over the recent Squad dev journals as of late, there\u0027s been many a mention of contracts, but none of finances.\u003C/p\u003E\u003Cp\u003EAs a result, my guess is that they\u0027re doing a first pass implementing contracts as one-offs that have no lasting impact on play, and that money will be a part of a later release.\u003C/p\u003E\u003Cp\u003EBut yes, regardless of when it hits, it will likely be a lot of work to rebalance things. Looking forward to it though, as I think it will provide a lot of additional depth.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-12T00:24:00Z\u0022 title=\u002203/12/2014 12:24  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 12, 2014\u003C/time\u003E by FlowerChild\u003C/strong\u003E\n\u003C/span\u003E\n"}]}