{"TopicId":64755,"ForumId":32,"TopicTitle":"After what milestone should you be able to call yourself an expert at this game?","CreatedByName":"mr_yogurt","CreatedById":70148,"CreatedDateTime":"2014-03-03T01:17:52Z","PageNum":7,"Articles":[{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-14T15:49:32Z","Content":"\n\u003Cp\u003E\u003Cem\u003EWhen you realize that you just flew that huge rocket into orbit \u003C/em\u003E\u003Cstrong\u003E\u003Cem\u003Ewithout SAS on\u003C/em\u003E\u003C/strong\u003E\u003Cem\u003E.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOR\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWhen you start to talk about complex docking missions to anyone who will listen.\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2014-04-14T18:19:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EIf you are all really that concerned about being experts, go enroll in a university, get a physics PhD and then you can call yourself an expert. Otherwise don\u0027t waste my time trying to compare e-peens over a video game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs long as you don\u0027t waste my time acting like you\u0027re superior to all these plebeians who \u003Cem\u003Edare\u003C/em\u003E to talk about people\u0027s skill at a game. Discussing Kerbal Space Program? \u003Cem\u003EOn the Kerbal Space Program forum?\u003C/em\u003E OUTRAGEOUS!\u003C/p\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-04-14T19:36:33Z","Content":"\n\u003Cp\u003EI don\u0027t think I will ever consider \u003Cem\u003Emyself\u003C/em\u003E an expert... at \u003Cem\u003Eanything\u003C/em\u003E to be honest! but people do refer to me as a \u0027computer expert\u0027 (I just think I know more than them) and although I think using the Dwarf Fortress ranking I would be fairly high up, the poster has said it\u0027s pretty outdated, so not even going to work out which one I *might* be...\u003C/p\u003E\u003Cp\u003EI think you can \u003Cstrong\u003Ebe called\u003C/strong\u003E an expert at the game when you can introduce a load of new players to the game at a LAN party, challenge them all to see how much science they can gather, and have some of them manage a fair bit in the first few hours (with a bit of gentle instruction as to where they might be going wrong) and then get beaten at your own challenge by someone who has only played the game once!\u003C/p\u003E\u003Cp\u003ETHEN, come onto the forums, and just generally join in with all the chit-chat and whatnot, maybe complete a few challenges (or at least join in with good spirits) and THEN start helping the newer players too, or sharing new advances (all while continuing to play the game on another PC!).\u003C/p\u003E\u003Cp\u003Eall just my opinion, but my Duna encounter is calling to me, so must dash \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-04-14T19:42:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwhip\u0022 data-cite=\u0022Starwhip\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E\u003Cem\u003EWhen you realize that you just flew that huge rocket into orbit \u003C/em\u003E\u003C/strong\u003E\u003Cstrong\u003E\u003Cstrong\u003E\u003Cem\u003Ewithout SAS on\u003C/em\u003E\u003C/strong\u003E\u003C/strong\u003E\u003Cem\u003E.\u003C/em\u003E\u003Cp\u003EOR\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWhen you start to talk about complex docking missions to anyone who will listen.\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhhh I\u0027ve done that before. Not into orbit. To Gilly. It was ********* hard.\u003C/p\u003E\n"},{"CreatedByName":"pauldbk99","CreatedById":102495,"CreatedDateTime":"2014-04-14T20:32:43Z","Content":"\n\u003Cp\u003EQUOTE=Starwhip;1091514]\u003Cem\u003EWhen you realize that you just flew that huge rocket into orbit \u003C/em\u003E\u003Cstrong\u003E\u003Cem\u003Ewithout SAS on\u003C/em\u003E\u003C/strong\u003E\u003Cem\u003E.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOR\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWhen you start to talk about complex docking missions to anyone who will listen.\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-14T20:43:25Z","Content":"\n\u003Cp\u003EPlease express opinions about your own skills here, and avoid expressing opinions about others\u0027 skills.\u003C/p\u003E\n"},{"CreatedByName":"SuperBigD60","CreatedById":76047,"CreatedDateTime":"2014-04-14T22:41:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Expert\u0022 rel=\u0022external nofollow\u0022\u003EWikipedia says:\u003C/a\u003E\u003Cp\u003ENo single achievement or number of hours played makes you an expert. You are an expert when others think you are one. And you still may be an expert only in certain part of the game and there may be people who are more of an expert than you are.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suspect you\u0027ve hit it on the head. \u003C/p\u003E\u003Cp\u003EI don\u0027t think there\u0027s any way to really quantify expertise (ie, I don\u0027t think there\u0027s any one benchmark that qualifies you as an expert).\u003C/p\u003E\u003Cp\u003EThat being said, we do recognize experts when we see them. I think the relationship is more \u0022if you can land on Eve/Tylo, you might be an expert; but if you can\u0027t make orbit you\u0027re definitely not\u0022 sort of thing. Like, we can list criteria that disqualify you from being an expert, or perhaps criteria that all experts will generally possess, but we can\u0027t say \u0022This! This makes you an expert.\u0022\u003C/p\u003E\u003Cp\u003EBasically, I\u0027d say call yourself an expert, show off what you do, and if people call bs, perhaps you\u0027re not an expert. And the converse also applies. \u003C/p\u003E\u003Cp\u003EAs far as whether or not you should think you\u0027re an expert: at some point for me, stuff just clicks and from then on becomes significantly easier than it ever was. I\u0027ve had that click for several aspects of KSP gameplay, and so as far as those aspects go, I\u0027m reasonably safe calling myself an expert. (For instance, although itwas not intended in the mission plan, I had to dock a 115 t mining ship with a station at least 5 times that heavy without rcs. Docking RCS free has been simpler to me ever since.)\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-04-14T23:02:07Z","Content":"\n\u003Cp\u003EYou are an expert Kerbonaut when it is routine to:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEngineer without revert flight\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPilot without quick save\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENavigate without maneuver nodes\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThese three mean you have both the knowledge and confidence of an expert in and out of the VAB/SPH. In my eyes anyway. Long way to go...\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-14T23:07:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EYou are an expert Kerbonaut when it is routine to:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEngineer without revert flight\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPilot without quick save\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENavigate without maneuver nodes\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThese three mean you have both the knowledge and confidence of an expert in and out of the VAB/SPH. In my eyes anyway. Long way to go...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose are more like personality issues than the traits of an expert. In most fields, there are both experts who plan things carefully in advance, and experts who prefer to work by trial and error.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-04-14T23:22:52Z","Content":"\n\u003Cp\u003EI just did a Mun mission completely IVA, that was pretty cool. Landing was a new experience again! (I didn\u0060t realise the \u0060flat\u0060 ground I was headed toward was in fact a 30 degree slope)\u003C/p\u003E\u003Cp\u003EI\u0060d say for piloting, landing IVA is fairly expert. So is landing on Tylo.\u003C/p\u003E\u003Cp\u003EFor engineering, a single launch manned Eve return mission is fairly expert.\u003C/p\u003E\u003Cp\u003EIf you can get out to a stable orbit around a moon of Jool from LKO and use less than 2000Dv that\u0060s pretty expert too.\u003C/p\u003E\u003Cp\u003EIf you can build a SSTO plane than can (eventually) build a space station, that\u0060s also pretty expert.\u003C/p\u003E\u003Cp\u003EI once landed about 500T of space station on Minmus just because. \u003C/p\u003E\u003Cp\u003EThere are players who can do amazing things but if you can have fun doing what you do, that\u0060s the main thing.\u003C/p\u003E\u003Cp\u003EI have the most fun going to Mun and back in an Apollo replica but that\u0060s me.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-04-14T23:39:24Z","Content":"\n\u003Cp\u003EYou aren\u0027t an expert in KSP until you are named Scott Manley, have a huge fan following and have actually sat down and played KSP with peeps from NASA.\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2014-04-15T00:37:21Z","Content":"\n\u003Cp\u003EDocking a large ship to small object spinning uncontrolled while descending into the atmosphere seems pretty harderz. I\u0027ve done spinning and I\u0027ve done in atmosphere, but never at the same time.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2014-04-15T00:49:43Z","Content":"\n\u003Cp\u003EI\u0027d say when you design a complex interplanetary mission featuring all the aspects of the game (and all the mods you have installed) and it goes according to plan on the first try without a single problem.\u003C/p\u003E\n"},{"CreatedByName":"Nothing But Rubus","CreatedById":104254,"CreatedDateTime":"2014-04-15T01:55:46Z","Content":"\n\u003Cp\u003Ei believe that in order to be an \u0022expert\u0022, you need to do a few things:\u003C/p\u003E\u003Cp\u003E1: laugh in the face of tylo\u003C/p\u003E\u003Cp\u003E2: tear eve a new atmosphere\u003C/p\u003E\u003Cp\u003E3: learn the fine points of high yield explosive decoupling \u003C/p\u003E\u003Cp\u003E4: figuring out that you can indeed climb the flag pole\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2014-04-15T02:44:24Z","Content":"\n\u003Cp\u003EThere was someone who made a jool return once\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2014-04-15T09:56:18Z","Content":"\n\u003Cp\u003Ei think you can call yourself an expert after an apollo style duna mission. after that, you know all the techniques you need to know to do everything. launching, docking, interplanetary navigation...\u003C/p\u003E\u003Cp\u003Eeverything else is more or less simply adding more fuel, science or roverwheels \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-15T11:50:27Z","Content":"\n\u003Cp\u003EWhen you were about to post here... and forgot what you were going to say.\u003C/p\u003E\u003Cp\u003EWell, shoot. Maybe it will come back.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-04-15T13:45:29Z","Content":"\n\u003Cp\u003ENot sure: I\u0027ve spent 340ish hours in KSP, and haven\u0027t sent Kerbals beyond Minmus.\u003C/p\u003E\u003Cp\u003EMy friend with 200 hours has successfully returned Kerbals from Dres.\u003C/p\u003E\u003Cp\u003EHours don\u0027t seem to be relevant.\u003C/p\u003E\n"},{"CreatedByName":"Shna_na","CreatedById":14950,"CreatedDateTime":"2014-04-15T15:22:59Z","Content":"\n\u003Cp\u003EI\u0027ve spent probably somewhere in the region of 1500 hours in-game and had it since 0.13-ish, and I\u0027d say that \u0022expert\u0022 isn\u0027t something that can really be defined in such a broad open sandbox game. For some people, landing on Eve, Tylo, and Eeloo in the same mission and returning makes them an expert, but others would say that having a permanent manned ground base and space station at every planet/moon (except Jool) is what makes an expert, no need for a return.\u003C/p\u003E\u003Cp\u003EI, personally, don\u0027t have a definition for \u0022expert\u0022 in KSP. If you can do what you aim to do, you\u0027ve done good. That\u0027s about it, in my book.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-04-15T15:54:16Z","Content":"\n\u003Cp\u003EWhen you start the game, that makes you an expert \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"iBeej","CreatedById":78998,"CreatedDateTime":"2014-04-15T17:49:28Z","Content":"\n\u003Cp\u003EI don\u0027t believe this question can be answered properly, because the moment you do.. karma strikes.\u003C/p\u003E\u003Cp\u003ERemember... \u0022experts\u0022 still explode...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BMBender","CreatedById":92637,"CreatedDateTime":"2014-04-15T18:20:09Z","Content":"\n\u003Cp\u003EI don\u0027t consider myself an expert, merely \u0022comfortable\u0022\u003C/p\u003E\u003Cp\u003EI\u0027d have to say I fall somewhere between rank 2-3. EVE/Tylo multible time, now I just look for \u0022odder\u0022 ways to do em. But I am a VERY inefficient with interplanetary transfers I have a bad habit of thinking any burn longer than 2-3 minutes is too long and I \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EDO NOT\u003C/span\u003Edo rescue missions if they couldn\u0027t be bothered to bring enough gas I can\u0027t be bothered to go get em \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E . These combined = truly massive amounts of both fuel and engines and a whole heap load of burnt fuel and magic CPU smoke.\u003C/p\u003E\n"},{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-04-15T22:39:22Z","Content":"\n\u003Cp\u003EYou can consider yourself an expert when you can provide people with tips, tricks, and ideas that they likely did not know before.\u003C/p\u003E\n"}]}