{"TopicId":64930,"ForumId":16,"TopicTitle":"What is the Best Mothership Orbiting height for an apollo style mission on Mun?","CreatedByName":"DarthRevan","CreatedById":104971,"CreatedDateTime":"2014-03-05T06:20:32Z","PageNum":1,"Articles":[{"CreatedByName":"DarthRevan","CreatedById":104971,"CreatedDateTime":"2014-03-05T06:20:32Z","Content":"\n\u003Cp\u003EOr is there no best height because too low and the landing craft has to kill a lot of horizontal velocity and too high and the landing craft has to kill to much vertical velocity.\u003C/p\u003E\u003Cp\u003EE: ya i had vertical and horizontal switched\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-06T04:29:25Z\u0022 title=\u002203/06/2014 04:29  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 6, 2014\u003C/time\u003E by DarthRevan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-05T07:10:42Z","Content":"\n\u003Cp\u003EI generally park at about 10km, this is a happy medium because what you don\u0027t use going down can be used coming back up. Also that\u0027s about as low as you can get without smashing into anything. It also takes less dV to get into a lower orbit than it does to get into a higher one.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-03-05T07:14:25Z","Content":"\n\u003Cp\u003EDo you have those backwards? Anyway, the usual takeoff/landing profile for no particular target is to get your periapsis as low as you can afford and brake while maintaining altitude ... or the reverse, get all your horizontal speed ASAP. If you time it well, you can do a direct ascent, if not, you\u0027ll want at least SOME difference in height to set up for a transfer orbit. Don\u0027t forget about time warp too ... it\u0027s a pain if you can\u0027t warp as fast as you want, but 1000x is probably overkill for this.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-03-05T07:42:41Z","Content":"\n\u003Cp\u003EThat\u0027s an interesting question actually. Does the combined velocity (horizontal orbital speed plus whatever vertical speed you would gain from falling straight down from where you are now) increase or decrease as you lower your orbit? The former decreases with height, the latter increases. Both scale with the gravity of the orbited body, but only the former scales with its physical size - and quite substantially so, looking at RSS. This would suggest that the answer in KSP may turn out to be different than IRL, since KSP has much smaller celestials and thus smaller vertical velocities.\u003C/p\u003E\n"},{"CreatedByName":"Greenspan","CreatedById":101644,"CreatedDateTime":"2014-03-05T07:46:47Z","Content":"\n\u003Cp\u003EIt depends on how much Delta-V your lander has. You would want it as high as possible so that your lander can land and return to the same orbit plus a safety margin. \u003C/p\u003E\u003Cp\u003EThe higher your Mun Orbit, the more Delta-V it will take for your lander to get down and back up; however the lower the orbit the more Delta-V will be required for your return craft (i.e. to get out of Mun\u0027s gravity well)\u003C/p\u003E\u003Cp\u003EThe amount of Delta-V going from an X km orbit to landing on Mun surface is identical to launching from Mun surface and going to an X km orbit. Lower orbits require less Delta-V to land from, and reach orbit to.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-05T08:11:18Z","Content":"\n\u003Cp\u003EThat depends on what you consider best. If it is best in the sense of saving fuel, then best parking orbit is a highly elliptical one with periapsis at safe height above terrain (7500 m) and apoapsis almost at the SOI boundary. Of course the lander must have enough dv to be able to land from this orbit and return to it. It\u0027s about 1/2 more than the necessary minimum for landing from and returning to low mun orbit. You get as much as you can from Oberth effect and don\u0027t move unnecessary mass to low orbits.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-03-05T08:12:34Z","Content":"\n\u003Cp\u003EA point to consider: the lower the orbiting ship is, the smaller the window for a rendezvous launch. If you\u0027re not good at rendezvous, or just don\u0027t want to have to rush, put the mothership higher and give yourself more time to maneuver and a more forgiving margin for error.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-05T08:20:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EA point to consider: the lower the orbiting ship is, the smaller the window for a rendezvous launch. If you\u0027re not good at rendezvous, or just don\u0027t want to have to rush, put the mothership higher and give yourself more time to maneuver and a more forgiving margin for error.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat shouldn\u0027t matter because you can circularize the lander above the mothership and wait for it to come around rather than chase it. If you\u0027re not going to launch into an intercept the thing to do is make one circular orbit higher (and thus slower) than the lower (faster) orbit. Then plan your intercept accordingly. If the mothership is that low circularizing the lander at a higher orbit isn\u0027t going to take that much more delta-v than a direct intercept.\u003C/p\u003E\u003Cp\u003EE: Hell, you could also come in at the mothership from above during a launch intercept if it\u0027s in a very low orbit to give yourself more maneuvering room. Which means that any orbit you\u0027re comfortable with is the best orbit for your mothership.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-05T08:32:13Z\u0022 title=\u002203/05/2014 08:32  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 5, 2014\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-03-05T09:34:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EThat\u0027s an interesting question actually. Does the combined velocity (horizontal orbital speed plus whatever vertical speed you would gain from falling straight down from where you are now) increase or decrease as you lower your orbit?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt always decreases if you lower your parking orbit.\u003C/p\u003E\u003Cp\u003EYou can just think about it in reverse. Starting from the surface, does it take more or less delta V to reach a higher orbit?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EThat depends on what you consider best. If it is best in the sense of saving fuel, then best parking orbit is a highly elliptical one with periapsis at safe height above terrain (7500 m) and apoapsis almost at the SOI boundary. Of course the lander must have enough dv to be able to land from this orbit and return to it. It\u0027s about 1/2 more than the necessary minimum for landing from and returning to low mun orbit. You get as much as you can from Oberth effect and don\u0027t move unnecessary mass to low orbits.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was gonna say this wouldn\u0027t work, but then I realized you can just wait until Mun has done half an orbit around Kerbin. It takes less than a day I think.\u003C/p\u003E\n"},{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2014-03-05T10:06:08Z","Content":"\n\u003Cp\u003EI put my mother, father and brother and sisterships usually at 40km above the Mun. That leaves me with 30km below it for a lower orbit if i have to catch up with it. dV doesn\u0027t really matter since thats peanuts anyway at the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Callisto","CreatedById":33404,"CreatedDateTime":"2014-03-05T11:19:09Z","Content":"\n\u003Cp\u003EI did a recent Kerpollo mission to the moon, requiring a rendezvous with the mothership orbiting mun...\u003C/p\u003E\u003Cp\u003EI used sepratrons to get the craft upto a decent height, then used RCS to circularise and rendezvous... actually worked really well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-03-05T12:34:48Z","Content":"\n\u003Cp\u003EAs high as you can, that your lander can safely reach.\u003C/p\u003E\u003Cp\u003EAlmost by definition, your lander is the smaller, lighter of the two vessels.\u003C/p\u003E\u003Cp\u003EYou want to minimize required rocket mass, so you want as much of the delta-v of the mission to be done by the lightest possible component.\u003C/p\u003E\u003Cp\u003EIf you lander is capable enough, the ideal Mun orbit for your mothership is low kerbin orbit.\u003C/p\u003E\u003Cp\u003EFor that matter, if your lander is good enough, the best orbit for your mothership is in feasibility studies, only.\u003C/p\u003E\u003Cp\u003EFor me, a nice compromise is about 1m higher than the highest peaks it will encounter.. But that\u0027s because my landers suck, at least in mass-efficiency. My typical Mun lander is 120tons\u002B\u002B \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-03-05T12:47:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EThat\u0027s an interesting question actually. Does the combined velocity (horizontal orbital speed plus whatever vertical speed you would gain from falling straight down from where you are now) increase or decrease as you lower your orbit? The former decreases with height, the latter increases. Both scale with the gravity of the orbited body, but only the former scales with its physical size - and quite substantially so, looking at RSS. This would suggest that the answer in KSP may turn out to be different than IRL, since KSP has much smaller celestials and thus smaller vertical velocities.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELower orbit will require less delta-v to land from and to ascend to at takeoff. No question or exception to this rule, equally valid in real life and KSP.\u003C/p\u003E\u003Cp\u003EHowever, and especially for a *very* low orbit around an airless body, it does sharply increase the minimum TWR your vessel must possess.\u003C/p\u003E\u003Cp\u003EIn addition, i find it much easier to time a \u0022suicide burn\u0022 descent when coming in near vertical, rather than near horizontal. Heck, i find any form of landing easier if I dont also have to worry about orientation, rate of rotation, skew of thrust as I turn, etc. A dead drop downwards is always easier to execute.\u003C/p\u003E\n"},{"CreatedByName":"DarthRevan","CreatedById":104971,"CreatedDateTime":"2014-03-06T00:27:45Z","Content":"\n\u003Cp\u003EThanks guys for all of your input, from all of this and testing i realized that a low orbit is best because the vertical delta V does not increase by a significant amount while the horizontal delta V does the higher up you need to land from and get back up to.\u003C/p\u003E\n"}]}