{"TopicId":64995,"ForumId":55,"TopicTitle":"Satellites and Probes","CreatedByName":"PhoenixCraftLTD","CreatedById":42778,"CreatedDateTime":"2014-03-05T22:39:20Z","PageNum":1,"Articles":[{"CreatedByName":"PhoenixCraftLTD","CreatedById":42778,"CreatedDateTime":"2014-03-05T22:39:20Z","Content":"\n\u003Cp\u003ERight now in KSP the only way to get serious science is by sending a kerbal to everyplace in the system, with no need for long term missions, like Voyager, Hubble, LandSat, or any long term satellite. \u003C/p\u003E\u003Cp\u003EI would like to see some additions and changes to fix this issue. \u003C/p\u003E\u003Cp\u003EFirst could be the addition of a duration mechanic where the science you get out of a project is equal to the amount of new surface area that a satellite covers. So an experiment similar to Maven will take years to explore all it needs to. \u003C/p\u003E\u003Cp\u003EBut this can work the other way where an mission could require hang time over a subject to get detailed reading on weather or whatever, making a geostationary mandatory. \u003C/p\u003E\u003Cp\u003EAlso why do we lose science from measurement based data? Like when we take the temp of a planet transmission loss dose not adequately explain why we only get \u0026lt;60% of a single time reading? \u003C/p\u003E\u003Cp\u003EI get the goo canisters and the materials bay needing kerbals to process the data, which i think shouldn\u0027t be tests that should be able to run on a probe, but a thermometer gives exact values which just needs to be broadcast. \u003C/p\u003E\u003Cp\u003ESure with the tears of communications equipment should give us better range and data speeds.\u003C/p\u003E\u003Cp\u003EMaybe the further a satellite gets from kerban the longer it takes and more power is expended to broadcast data, until the limits of the spacecraft and or transmitter are met.\u003C/p\u003E\n"},{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2014-03-05T23:13:55Z","Content":"\n\u003Cp\u003Eok, well, 3rd time this has been suggested, all in a short time frame, my response has become a standard :\u003C/p\u003E\u003Cp\u003EI think that contracts will give more purpose to probes because they are very small, lighter and most of all cheaper than a manned mission.\u003C/p\u003E\u003Cp\u003E--------------------------\u003C/p\u003E\u003Cp\u003Ebut seeing the long-term mission part, that\u0027s a bit different.\u003C/p\u003E\u003Cp\u003EI suggest you try scanning in a scansat or kethane mod, you will find that these \u0022long term missions\u0022 end up becoming a very, extremely grindy thing, as the scanners only work when you are focused on them.. \u003C/p\u003E\u003Cp\u003Ebut on the other hand, a low but long term income generation would be key when your budget gets low, and I would like to see that.\u003C/p\u003E\u003Cp\u003E------------------\u003C/p\u003E\u003Cp\u003Elosing measurement science has been suggested in a pretty long thread not too long ago, but from the forum peoples perspective, its meant for balance, so you can\u0027t farm the science they generate and the excuse is that \u0022over periods of time, de-calibration happens and you need to bring the sensor back to check the accuracy change for better knowledge\u0022\u003C/p\u003E\n"}]}