{"TopicId":65084,"ForumId":16,"TopicTitle":"upgrading a vessel in-flight","CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2014-03-07T06:56:17Z","PageNum":1,"Articles":[{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2014-03-07T06:56:17Z","Content":"\n\u003Cp\u003EHeyall,\u003C/p\u003E\u003Cp\u003EI\u0027ve been putting together a rather big mission in career mode where I have an orbiting station at Jool, basically it\u0027s a lab module and a lander to get science off the moons over there. I need to send more fuel over there and I figured it would be cool if I could also upgrade the science bits as new instruments have been unlocked in the tech tree, but how would I go about doing this? In stock, I guess my only option would be to make a structural part with docking ports and the instruments on it, that would go on the lander, but that seems to be a rather \u0027massive\u0027 way to add small parts like the gravimeter. Could I deliver and attach parts like that with KAS mod? Or is there another way of doing it in stock?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-07T20:45:01Z\u0022 title=\u002203/07/2014 08:45  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 7, 2014\u003C/time\u003E by kurja\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-03-07T07:14:17Z","Content":"\n\u003Cp\u003EAFAIK you can only add parts in stock using docking ports. With KAS I know you can attach stuff otherwise in flight, but I\u0027ve not used it so I can\u0027t comment further.\u003C/p\u003E\u003Cp\u003ESo, as I see it, you can either send a dockable science module, as you suggest, or you can send a new lander with the new science parts on it, and relegate the old lander to a spare/emergency vessel.\u003C/p\u003E\u003Cp\u003EPersonally, I\u0027d go with a new lander if you have improved tech, assuming the refuelling ship has the wherewithal to get it there. YMMV, though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-07T07:47:25Z","Content":"\n\u003Cp\u003EYou would need to use the KAS mod, and add a config edit for the part. I don\u0027t know what the config edit would be, but it would allow you to place the part any way you wanted.\u003C/p\u003E\n"},{"CreatedByName":"Poynting","CreatedById":103397,"CreatedDateTime":"2014-03-07T12:14:47Z","Content":"\n\u003Cp\u003EI believe you can easily add the small science experiments to a ship using KAS. Just store them in a container and use a kerbal to transfer them from that on to the ship when you reach the station in Jool orbit. If you just use stock parts you can still make a very light weight science platform using the smallest structural parts to dock to your ship. Have you got the smallest docking adapter on your lander? (I\u0027d probably go for that if you do over a new lander but thats just the way I like to play)\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-03-07T12:54:03Z","Content":"\n\u003Cp\u003EYes, you could do this sort of thing with KAS. It\u0027d have to be a manned flight with a series of containers, each container containing one of the newer science instruments. You\u0027ll also need to have advanced far enough along the tech tree to have access to the containers; they\u0027re with Advanced Construction unless I\u0027m mistaken (definitely in that vicinity; KAS parts are spread out all over the tech tree and I was dismayed to find that the Electromagnet is in fact a Tier \u003Cstrong\u003E8\u003C/strong\u003E part (cost 1000 science)).\u003C/p\u003E\u003Cp\u003EIf your Jool ship doesn\u0027t have a docking port, you can either A) park the parts ship in close rendezvous and work from there, or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E park the parts ship in close rendezvous and send a \u003Cem\u003Edocking port up in a container\u003C/em\u003E (maybe one of the Jrs), then dock and work from there. Find the spot where you want to stick the part, right click on your Kerbal and select...I think it\u0027s \u0022Place\u0022, IIRC; I\u0027ve only used that feature once or twice. The instructions will appear on the screen and it\u0027ll act a lot like the inside of the VAB.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-03-07T13:14:41Z","Content":"\n\u003Cp\u003EI did exactly this in my YouTube Series. I called it a Care Package and while all it did was go from Minmus to Mun (and not all the way to Jool) it saved me a ton of annoyance.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/U6nHqDNLBpg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EI realize the problem at 11:55\u003C/p\u003E\n"},{"CreatedByName":"Jimbimbibble","CreatedById":77859,"CreatedDateTime":"2014-03-07T18:03:09Z","Content":"\n\u003Cp\u003EOne thing you also might consider is using Kethane for your Jool station. You could mine Kethane from Vall or Pol so you don\u0027t need to send a lot of refueling missions. You can probably land and take off an orange tank from Pol using no more than 2 LV-N\u0027s.\u003C/p\u003E\n"},{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2014-03-07T19:31:11Z","Content":"\n\u003Cp\u003EI don\u0027t have the small docking ports or small structural parts yet, I\u0027m about halfway through the science tree in this save and I\u0027m not \u0027playing the game\u0027 to max it out as quickly as possible or anything, just imagining some space exploration missions that I\u0027m playing through in a semi realistic fashion, so sending an upgrade with a resupply ship seems like the logical thing to do (as in, instead of replacing the lander with a new one).\u003C/p\u003E\u003Cp\u003EStation at Jool is already crewed, so if I understand correctly, I just need to put the needed parts on that resupply ship, then the crew can take it off and put it on the lander, or are those container parts necessary..?\u003C/p\u003E\n"},{"CreatedByName":"Overjay","CreatedById":104131,"CreatedDateTime":"2014-03-07T19:53:07Z","Content":"\n\u003Cp\u003EIn my opinion, you have two choices here.\u003C/p\u003E\u003Cp\u003E1. By stock. \u003C/p\u003E\u003Cp\u003EAs I understand, you currently have only usual ClampoTrons, not Jr and not Sr.\u003C/p\u003E\u003Cp\u003EI\u0027d recommend you to send a refueling ship, which has special part on it. That part should consist of at least two Clampo\u0027s, probe core, inline RCS tank and, of cource, some RCS thrusters. And you can attach some science tech over it, obviously.\u003C/p\u003E\u003Cp\u003E When in close proximity to your station, you should detach lander and dock your science module on top of it. \u003C/p\u003E\u003Cp\u003E2. Modded with KAS \u003C/p\u003E\u003Cp\u003EIf I were you, I\u0027d use this method, because it\u0027s simpler and more lightweight. \u003C/p\u003E\u003Cp\u003ETwo ways here. You can attach your desired equipment directly to the hull of the refuelling vessel, and then you\u0027ll detach it manually while EVA. Or you can attach a KAS container to the ship, and put equipment there. \u003C/p\u003E\u003Cp\u003EThe difference only in weight of the KAS contsiner, and how it will affect your deltaV.\u003C/p\u003E\n"},{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2014-03-07T20:33:41Z","Content":"\n\u003Cp\u003EThat pretty much answers my question.\u003C/p\u003E\u003Cp\u003EBut why would I want a probe core and rcs on the \u0022update module\u0022? It would go up with the \u0027service mission\u0027, get docked to the station, I\u0027d just pick it up with the lander and be done with it..? So I\u0027d have sandwiched between two docking ports one whatever structural part/oscar tank/something small and light, with the sciency bits put on the sides, why include anything else..? (Adding unnecessary parts on a lander being generally a bad idea).\u003C/p\u003E\n"},{"CreatedByName":"Vertibirdo","CreatedById":76243,"CreatedDateTime":"2014-03-07T20:43:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kurja\u0022 data-cite=\u0022kurja\u0022\u003E\u003Cdiv\u003EThat pretty much answers my question.\u003Cp\u003EBut why would I want a probe core and rcs on the \u0022update module\u0022? It would go up with the \u0027service mission\u0027, get docked to the station, I\u0027d just pick it up with the lander and be done with it..? So I\u0027d have sandwiched between two docking ports one whatever structural part/oscar tank/something small and light, with the sciency bits put on the sides, why include anything else..? (Adding unnecessary parts on a lander being generally a bad idea).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you use KAS, you can also mod small probe parts to be grabbable and placeable, so you can essentially construct probes in space, using spare parts. (You can in fact make anything grabbable, but that won\u0027t make any sense)\u003C/p\u003E\u003Cp\u003EI have used this technique to assemble rovers and probes for my missions on place, instead of ferrying them around. \u003C/p\u003E\u003Cp\u003EAlso you can use Extraplanetary launchpads, as it allows you to build ships on planets and in orbit.\u003C/p\u003E\n"},{"CreatedByName":"Overjay","CreatedById":104131,"CreatedDateTime":"2014-03-07T21:38:41Z","Content":"\n\u003Cp\u003EWell, you\u0027re right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESometimes I do some over-engineering, to prevent some accidential bad things. It appears to become a habit for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}