{"TopicId":65145,"ForumId":51,"TopicTitle":"Triskelion Station Mk. II","CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-03-08T00:26:13Z","PageNum":3,"Articles":[{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-17T18:37:28Z","Content":"\n\u003Cp\u003EWith my experience testing this lander, I am convinced I need extra fuel. 360 units of liquid fuel is not enough to account for rough terrain landings, adjusting trajectory to meet up with other landed vessels, righting the lander if it falls over, etc. I\u0027ve added 2 45-unit tanks. I don\u0027t think any other testing is necessary. I\u0027m ready to ship the lander to the Triskelion.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-17T18:43:11Z","Content":"\n\u003Cp\u003EI want to see you succeed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-17T19:02:11Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fqUYCNS.jpg\u0022 alt=\u0022fqUYCNS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe lander is docked with the Triskelion. Joining the crew via the lander are Jerwin and Guskin Kerman!\u003C/p\u003E\u003Cp\u003EI have decided that the rovers I plan on adding to the Triskelion\u0027s complement will be unmanned and intended for permanent landing on bodies too difficult for the lander to escape, such as Eve, Duna, and Laythe. They will have attached parachutes, just to show how serious they are about permanent landing. Tylo and Vall remain unviable.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-17T20:40:26Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cGqQlPl.jpg\u0022 alt=\u0022cGqQlPl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne rover module is docked with the Triskelion. With its small size, three drogues and three radial parachutes, there should be no trouble landing on any atmospheric body. Each rover contains the full set of reusable instruments, one antenna, and two unidirectional RCS ports intended for righting itself should it invert itself.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-17T22:43:10Z","Content":"\n\u003Cp\u003ESo I realized that, with objective 6 struck from the mission, I have 12 free radial ports on the Triskelion and no particular ideas for useful modules. I\u0027m open to suggestions. I doubt I\u0027ll need 12 more probes. They can be independent modules like probes or permanent installments like the Xenon module. I will definitely be putting two more Hitchhikers on.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-17T23:14:40Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/I4Wamoo.jpg\u0022 alt=\u0022I4Wamoo.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Triskelion is now fully equipped for its mission. Manning the second lander is Merkin Kerman, the final member of the Triskelion crew. KSP engineers are taking the day off to poll the community for any good ideas for modules to put on the 12 remaining radial ports, and to get themselves to stop accidentally calling him \u0022Kerkin Merman\u0022.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-17T23:27:52Z\u0022 title=\u002204/17/2014 11:27  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 17, 2014\u003C/time\u003E by Saltpeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T01:08:31Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe Mission\u003C/span\u003E\u003C/span\u003E:\u003C/p\u003E\u003Cp\u003EFour brave members of the KSP, Bill, Kelbald, Kirk, and Lobal, have been stranded in space for several years, and have fought hunger, isolation, and depleted oxygen waiting for rescue. The time has come to bring our kerbs home, and in one fell swoop!\u003C/p\u003E\u003Cp\u003E1. Travel to the Mun and recover the Lander test crew.\u003C/p\u003E\u003Cp\u003E2. Travel to the Duna system and retrieve Bill Kerman from Ike.\u003C/p\u003E\u003Cp\u003E3. Drop a rover on the surface of Duna.\u003C/p\u003E\u003Cp\u003E4. Travel to Dres and retrieve Kirk, Kelbald, and Lobal.\u003C/p\u003E\u003Cp\u003E a) Kirk and Kelbald are on the surface.\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Lobal is in a lander with a highly inclined orbit over Dres.\u003C/p\u003E\u003Cp\u003E5. Travel to the Joolian system:\u003C/p\u003E\u003Cp\u003E a) Drop a rover on the surface of Laythe.\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Use probes to collect science from Tylo, Vall, and Jool.\u003C/p\u003E\u003Cp\u003E c) Plant flags on Pol and Bop.\u003C/p\u003E\u003Cp\u003E6. Return to Hexaflexagon Station and bring the stranded kerbs home.\u003C/p\u003E\u003Cp\u003EI made this ship to be able to do a single grand tour of the entire Kerbolar system, but bringing back our stranded kerbs takes priority this time. We\u0027ll have plenty of time for a lengthier, more glorious mission.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-18T03:56:45Z\u0022 title=\u002204/18/2014 03:56  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 18, 2014\u003C/time\u003E by Saltpeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T05:56:45Z","Content":"\n\u003Cp\u003EIn the interest of saving my computer for any more of the rack, I\u0027m starting the mission early and establishing a Munar orbit to begin the mission. It\u0027s moment of truth time!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mq6taQ7.jpg\u0022 alt=\u0022mq6taQ7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith a gentle RCS push, the Triskelion says goodbye to Hexaflexagon Station. It\u0027s time for adventure! Jerwin and Guskin are doing their famous \u0022We\u0027re going to the moon!\u0022 dance in their seats.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T06:00:29Z","Content":"\n\u003Cp\u003EPhoto op! Rarely seen hexaflexaclipse of the sun from the Triskelion.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ardyBUD.png\u0022 alt=\u0022ardyBUD.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T06:17:15Z","Content":"\n\u003Cp\u003EThe Triskelion\u0027s distinctive burning trefoil:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PVzIGAt.png\u0022 alt=\u0022PVzIGAt.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T06:53:34Z","Content":"\n\u003Cp\u003EMission status:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/a8un0Ek.png\u0022 alt=\u0022a8un0Ek.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Triskelion has achieved a reasonable Munar orbit. The question is whether or not to attempt a landing with this orbit to save on fuel, or to circularize at 60km like a proper kerbonaut should. The rovers have large amounts of fuel and only go one way, so they can be dropped from high orbit. Landers are round trip, so I have to make absolutely sure I can get back before I depart.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-18T12:40:32Z","Content":"\n\u003Cp\u003EMy vote is for the landers to make the trip if it\u0027s within their ability. Think how much fuel Triskelion would destroy circularizing, compared to a lander. Not to mention how much fuel it would burn breaking back out of said orbit, too. Worst case - So long as your lander can make it back to any orbit, Trisky can always go get it after that anyway.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T19:37:32Z","Content":"\n\u003Cp\u003EMy thoughts exactly. I will drop off the lander at perimÃƒÂ¼ and go from there. I hope the lander has enough delta-v for this.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T20:27:54Z","Content":"\n\u003Cp\u003EThe lander says goodbye to the Triskelion.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7FynfiZ.png\u0022 alt=\u00227FynfiZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEh, close enough.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CrfxIYR.png\u0022 alt=\u0022CrfxIYR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s important to note that this trip will have to be done twice. There are no robotic modules on the lander and there\u0027s only room for two in the can, so the two-kerb test crew will have to be lifted one at a time.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T20:42:08Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TTmV6eG.png\u0022 alt=\u0022TTmV6eG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDonvin Kerman of the lander test crew was able to get pretty close on EVA fuel considering how far away he was. 1.9km is still a long walk on the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T21:21:25Z","Content":"\n\u003Cp\u003EThings are looking good for Donvin and Merkin! There may even be enough fuel left to make a proper rendezvous. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cYVXvB9.png\u0022 alt=\u0022cYVXvB9.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T21:28:37Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZFfdUjt.png\u0022 alt=\u0022ZFfdUjt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJackpot! Time to bring our boys home.\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T21:38:48Z","Content":"\n\u003Cp\u003EWhat a sight for sore eyes! With 20 units of fuel left, RCS can bring us the rest of the way. Once they\u0027ve docked, Jerwin Kerman will pilot lander #2 and rescue the remaining test pilot.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TkrD9lK.png\u0022 alt=\u0022TkrD9lK.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T22:01:38Z","Content":"\n\u003Cp\u003EA much better landing this time! And with slightly more fuel to spare! Jim Kerman will easily be able to make it to the rescue lander on EVA fuel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FCuFAvU.png\u0022 alt=\u0022FCuFAvU.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T22:45:30Z","Content":"\n\u003Cp\u003EInexplicably, despite a more fuel efficient landing, the lander ran out of fuel trying to meet up with the Triskelion this time. With the last bit of fuel the lander got a kind-of concentric orbit. Some RCS wizardry made the rendezvous possible. Never underestimate the power of RCS.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3OpwhHV.png\u0022 alt=\u00223OpwhHV.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T23:05:10Z","Content":"\n\u003Cp\u003EThe first mission objective is a success! Jim and Jerwin Kerman are safely aboard the Triskelion. It\u0027s time to travel to Duna!\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-18T23:34:25Z","Content":"\n\u003Cp\u003EThe KSP crew is getting a lot of experience with the maneuver tool. Mechjeb hasn\u0027t been used for anything except docking alignment since the Triskelion left Kerbin. In a single maneuver, the Triskelion will transfer to Duna from the Mun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zxBNX6D.png\u0022 alt=\u0022zxBNX6D.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-19T00:04:48Z","Content":"\n\u003Cp\u003EUnfortunately I misjudged the encounter a bit. The orbit burn is going to be very expensive, at 1510 delta-v. HOWEVER, while adjusting the burn to remedy some of that inclination, I got an Ike encounter! This is good, it\u0027ll allow me to pick up Bill Kerman easily enough and allow me to plan for the next phase of the mission in a relatively controlled environment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9eOPnix.png\u0022 alt=\u00229eOPnix.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-19T01:22:30Z","Content":"\n\u003Cp\u003EBang-up job, Jerwin! Reuniting with the Triskelion should be a piece of cake with this amount of fuel remaining. I can get some science in along the way. I\u0027ll correct the Triskelion\u0027s inclination before the rendezvous, so I can tave on fuel for the Dres transfer.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UtKy0Yp.jpg\u0022 alt=\u0022UtKy0Yp.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saltpeter","CreatedById":105201,"CreatedDateTime":"2014-04-19T01:26:32Z","Content":"\n\u003Cp\u003EBill Kerman has been watching the libration of Duna, contemplating his existence, and holding his breath for the past seven and a half years. Somehow he\u0027s figured out how to breathe carbon dioxide and exhale EVA fuel. With a full tank, it\u0027ll be easy for him to reach the lander.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Rbupyjx.png\u0022 alt=\u0022Rbupyjx.png\u0022\u003E\u003C/p\u003E\n"}]}