{"TopicId":65311,"ForumId":16,"TopicTitle":"Planetary transfer windows","CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2014-03-09T19:12:58Z","PageNum":1,"Articles":[{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2014-03-09T19:12:58Z","Content":"\n\u003Cp\u003EHey guys! I just need a little help knowing and understanding transfer windows. I am playing a HEAVILY HEAVILY modded version of KSP and I think I might do a series on my exploration of the galaxy. First off though I want to know when I have a transfer window to another planet. I have no idea, usually to get to another planet I leave Kerbin\u0027s SOI and play with manever nodes forever till I get a catch. \u003C/p\u003E\u003Cp\u003EThank you guys in advance!\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-09T19:24:57Z","Content":"\n\u003Cp\u003EYou want alexmoons transfer window planner (\u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E) it will give you the optimum time you want to burn, as well as departure inclination and angle (in m/s dV)\u003C/p\u003E\u003Cp\u003EAlso, if you have mechjeb you can tell it to transfer to another planet and it will plop down a maneuver node for you. Then you can use Kerbal alarm clock to save said maneuver node so you can do other things while you wait for your window.\u003C/p\u003E\u003Cp\u003ECuriosity dictates, but how many mods are you planning on running? (I\u0027m running close to 90 mods, but without stock parts)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-09T19:29:00Z\u0022 title=\u002203/09/2014 07:29  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 9, 2014\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003Cbr\u003Eadded linky\n\u003C/span\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2014-03-09T19:48:37Z","Content":"\n\u003Cp\u003E35 mods, I do have mechjeb but I\u0027m trying to do as much as I can without it. I use it basically only for rendezvous and docking. \u003C/p\u003E\u003Cp\u003Ethe link though is kinda confusing me, its just telling me amount of deltaV I need to have. I need to know how many days from my current time do I need to burn.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-09T19:53:22Z","Content":"\n\u003Cp\u003EIf you look next to the plot there is all that information in a convenient tabulated form with departure date, arrival date, and lots of other info.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-03-09T20:05:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00227499275\u0022 data-cite=\u00227499275\u0022\u003E\u003Cdiv\u003EFirst off though I want to know when I have a transfer window to another planet. I have no idea, usually to get to another planet I leave Kerbin\u0027s SOI and play with manever nodes forever till I get a catch.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnother good tool is Kerbal Alarm Clock. This uses the same algorithms as Alexmoon\u0027s website so you can set alarms for when windows open. It doesn\u0027t, however, figure the burn for you like the website and/or MJ will do.\u003C/p\u003E\n"}]}