{"TopicId":65367,"ForumId":36,"TopicTitle":"Test of continuing KER developments [0.24.2]","CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-03-10T11:31:34Z","PageNum":8,"Articles":[{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-25T23:06:12Z","Content":"\n\u003Cp\u003EAfter a busy last couple of weeks at work I have finally managed to spend some time working on KER again and I have finally implemented atmospheric thrust correction for Real Fuels. There is an issue with the VES tab showing the uncorrected (vacuum) thrust when you first go to the launch pad but it corrects once you fire the first stage. I\u0027ll fix this if possible but it may require a change in Real Fuels.\u003C/p\u003E\u003Cp\u003EI have updated the zip linked in the first post...\u003C/p\u003E\n"},{"CreatedByName":"ThesaurusRex","CreatedById":8974,"CreatedDateTime":"2014-04-26T06:57:58Z","Content":"\n\u003Cp\u003EDoesn\u0027t show up at all. The parts are there but I don\u0027t get anything else. What do I do?\u003C/p\u003E\u003Cp\u003EUsing the Steam version if that helps any.\u003C/p\u003E\u003Cp\u003E*EDIT* used KSP Mod Admin, fixed the problem. But how do I read the delta-v charts? E.g \u00222,680 / 6,342 m/s\u0022. What do the numbers on either side mean?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-26T08:24:44Z\u0022 title=\u002204/26/2014 08:24  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 26, 2014\u003C/time\u003E by ThesaurusRex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-26T09:16:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThesaurusRex\u0022 data-cite=\u0022ThesaurusRex\u0022\u003E\u003Cdiv\u003EBut how do I read the delta-v charts? E.g \u00222,680 / 6,342 m/s\u0022. What do the numbers on either side mean?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe first number is the deltaV of the stage and the other is the total deltaV of all the stages up to and including this one...\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-26T10:41:12Z","Content":"\n\u003Cp\u003ENathanKell helpfully pointed me in the right direction to fix the Real Fuels correction when you first go to launch. I have updated the zip linked in the first post to include this fix.\u003C/p\u003E\n"},{"CreatedByName":"Zalym","CreatedById":58273,"CreatedDateTime":"2014-04-26T19:35:05Z","Content":"\n\u003Cp\u003EThis fixed it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Thanks a lot for the work you\u0027ve done. \u003C/p\u003E\u003Cp\u003EI couldn\u0027t figure out why KER was freezing up in the VAB and during flight after this last update. I was not looking forward to changing to a different mod for this functionality (that really should be incorporated into the base-game anyway). \u003C/p\u003E\u003Cp\u003EResuming flight operations. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E Thanks again!\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-26T20:35:34Z","Content":"\n\u003Cp\u003ESome feature requests:\u003C/p\u003E\u003Cp\u003EThe ability to define a set of stages or parts as \u0022payload\u0022 for another set of stages or parts.\u003C/p\u003E\u003Cp\u003EThe ability to define a part as a \u0022stager\u0022 (docking ports, for instance).\u003C/p\u003E\u003Cp\u003EThe ability to set the \u0022root part\u0022 for calculations without having to install Select Root or similar.\u003C/p\u003E\u003Cp\u003EThanks for all the hard work you\u0027ve put into this so far.\u003C/p\u003E\n"},{"CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2014-04-26T20:59:21Z","Content":"\n\u003Cp\u003EI just installed it and the new calculations are fantastic! I checked against my own math by hand and it was spot on and much quicker than the old calculations.\u003C/p\u003E\u003Cp\u003EI did get a big with the KER icon in the toolbar flickering whenever the ker info is displayed in the vab. This only happened the first time I loaded up a craft I had been previously working on. Upon reloading the craft, other craft, and going into the SPH I could not reproduce the flickering. \u003C/p\u003E\u003Cp\u003EThank you for such an awesome tool!\u003C/p\u003E\u003Cp\u003ESoup\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-26T21:13:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022How2FoldSoup\u0022 data-cite=\u0022How2FoldSoup\u0022\u003E\u003Cdiv\u003EI did get a big with the KER icon in the toolbar flickering whenever the ker info is displayed in the vab. This only happened the first time I loaded up a craft I had been previously working on. Upon reloading the craft, other craft, and going into the SPH I could not reproduce the flickering. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe flickering appears to depend on the order the game decides to initialise the mods. I have fixed the issue and should be releasing the fix in the next hour or so...\u003C/p\u003E\u003Cp\u003EEdit: Ok, make that 20 minutes. I have just updated the link in the first post with a fix for the flickering toolbar button issue.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-26T21:31:59Z\u0022 title=\u002204/26/2014 09:31  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 26, 2014\u003C/time\u003E by Padishar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheShandyMan","CreatedById":109435,"CreatedDateTime":"2014-04-26T23:03:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ESome feature requests:\u003Cp\u003EThe ability to define a set of stages or parts as \u0022payload\u0022 for another set of stages or parts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E \u002B1 on that; although I usually build my payload first; and then use a subassembly launcher I\u0027ve pre-tested with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/76231-0-23-x-Kerbal-NRAP-adjustable-test-weight-for-rocket-building%21-v1-4-11-04-14\u0022 rel=\u0022external nofollow\u0022\u003ENRAP\u003C/a\u003E. Basically I\u0027ve made a set of lifters; each rated to a certain payload capacity that can lift to at least a 100k orbit.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThe ability to define a part as a \u0022stager\u0022 (docking ports, for instance).\u003Cp\u003EThe ability to set the \u0022root part\u0022 for calculations without having to install Select Root or similar.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThese two I don\u0027t understand but I might want if I did\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThanks for all the hard work you\u0027ve put into this so far.\u003C/div\u003E\u003C/blockquote\u003E Another \u002B1 to that; I\u0027ve been using KER almost since I got KSP; and hate it whenever a game update breaks things and I have to wait for a fix :-D\u003Cp\u003EThe only thing I can think of on a \u0022wish list\u0022 type thing; is in the VAB I would prefer things were more vertical; opposed to horizontal. I tend to build rockets that are typically taller than they are wide; so sometimes KER gets in the way; or I\u0027ll go to click on KER and miss and hit a very finicky symetrical part and never get it back in the right place. I think if things were laid out more how they are in flight it wouldn\u0027t be as bad.\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-04-27T01:32:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheShandyMan\u0022 data-cite=\u0022TheShandyMan\u0022\u003E\u003Cdiv\u003EThe only thing I can think of on a \u0022wish list\u0022 type thing; is in the VAB I would prefer things were more vertical; opposed to horizontal. I tend to build rockets that are typically taller than they are wide; so sometimes KER gets in the way; or I\u0027ll go to click on KER and miss and hit a very finicky symetrical part and never get it back in the right place. I think if things were laid out more how they are in flight it wouldn\u0027t be as bad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m assuming you mean that it would be nice if the KER UI was more vertical in the VAB like it is when actually flying, and I agree. I\u0027d actually really like it if the KER window was more customizable and you could separate the different sections and/or resize it. This would make it seem more like MechJeb, but without the autopilot and I can understand not wanting to appear to be mimicking someone elses work. I stopped using Mechjeb mostly because I DON\u0027T want an autopilot option at all, I just want Delta-V calculations and orbital info on the same screen where I\u0027m flying and staging.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-27T02:13:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThe ability to define a set of stages or parts as \u0022payload\u0022 for another set of stages or parts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt will require someone with much greater knowledge of Unity/KSP modding to implement any kind of advanced UI extension. The best I\u0027ve conceived of so far would need both some advanced UI to define a \u0022mission plan\u0022 and significant changes to the simulation code to run that plan. I think this is considerably beyond the scope of KER but it could be done as a separate mod that uses the KER simulation code.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThe ability to define a part as a \u0022stager\u0022 (docking ports, for instance).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve also thought about how to allow the user some control over the simulated staging, which sounds like it should be considerably easier, but I\u0027ve not managed to work out any way of doing this in a nice way. Perhaps by implementing a dummy decoupler module and patching it into the various parts you want to be able to \u0022stage\u0022. The simulation code would then be able to detect this and treat it as a decoupler despite it not actually being one. Again, I don\u0027t know enough about Unity/KSP modding to say if this is possible or how difficult it would be.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThe ability to set the \u0022root part\u0022 for calculations without having to install Select Root or similar.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can\u0027t use a different root part for the calculations than the vessel actually uses or the calculations will not be accurate. If you mean you want to actually change the root part of the ship then you may as well just use one of the existing mods (assuming they\u0027ve been updated to work with the changes in 0.23.5).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThanks for all the hard work you\u0027ve put into this so far.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re welcome...\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-27T11:50:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Baythan\u0022 data-cite=\u0022Baythan\u0022\u003E\u003Cdiv\u003EI\u0027m assuming you mean that it would be nice if the KER UI was more vertical in the VAB like it is when actually flying, and I agree. I\u0027d actually really like it if the KER window was more customizable and you could separate the different sections and/or resize it. This would make it seem more like MechJeb, but without the autopilot and I can understand not wanting to appear to be mimicking someone elses work. I stopped using Mechjeb mostly because I DON\u0027T want an autopilot option at all, I just want Delta-V calculations and orbital info on the same screen where I\u0027m flying and staging.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, there is (or can be) just too much information to lay out in a narrow vertical arrangement. How would you show the stats of this vessel?\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/PUV5v\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u0022Compact\u0022 button shrinks the window down to just deltaV and TWR columns which makes it considerably smaller (2nd pic). Those are by far the most useful columns though it might be \u0022nice\u0022 if it were a \u0022Custom\u0022 button instead and allowed you to configure which columns are shown like the flight engineer does for the rows. I\u0027m not certain what Cybutek is doing with the UI in v1.0 but I think this should be done in that version rather than this one (if it isn\u0027t already).\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-04-27T13:11:22Z","Content":"\n\u003Cp\u003EI\u0027ve been getting some strange results when using the Procedural fairings interstage decoupler. I\u0027ve checked the results against MecJeb (which doesn\u0027t have the same problem). I\u0027ll write up some proper information and steps to reproduce tonight and post here.\u003C/p\u003E\n"},{"CreatedByName":"TK421d","CreatedById":104476,"CreatedDateTime":"2014-04-27T16:12:50Z","Content":"\n\u003Cp\u003Eive noticed the procedural thing too. i get extra stages and blanked out calcs. but only when i attach the covers.\u003C/p\u003E\u003Cp\u003Ei\u0027ve just been adding counterweights to get my numbers, and switching them out for the covers before launch\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-27T20:55:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Paul Kingtiger\u0022 data-cite=\u0022Paul Kingtiger\u0022\u003E\u003Cdiv\u003EI\u0027ve been getting some strange results when using the Procedural fairings interstage decoupler. I\u0027ve checked the results against MecJeb (which doesn\u0027t have the same problem). I\u0027ll write up some proper information and steps to reproduce tonight and post here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne thing I do notice is that it doesn\u0027t appear to have been updated for 0.23.5 yet. This is probably related to the cause as the way struts work has changed and I had to modify KER to stop struts transferring fuel during the simulation. I suspect this fix has caused the problem (and another issue with nosecones containing fuel) so I will check to see if I can detect struts differently so that certain parts don\u0027t get ignored.\u003C/p\u003E\u003Cp\u003EIt would be a great help if you could post an example craft file (preferably just stock and the mod in question) and a screenshot of the KER window (with show all stages selected if in VAB) and a description of what you think is wrong (if it isn\u0027t really obvious from the screenshot).\u003C/p\u003E\n"},{"CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2014-04-27T21:29:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003EThe flickering appears to depend on the order the game decides to initialise the mods. I have fixed the issue and should be releasing the fix in the next hour or so...\u003Cp\u003EEdit: Ok, make that 20 minutes. I have just updated the link in the first post with a fix for the flickering toolbar button issue.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you! \u003C/p\u003E\u003Cp\u003EAnd thank you for all the time spent on this fantastic mod! Like many others I don\u0027t want to use mechjeb due to the autopilot and I just want information. Plus I like the UI style more than MJ it feels more Kerbal ^^ Keep up the great work and thank you again!\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-27T21:55:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003EYou can\u0027t use a different root part for the calculations than the vessel actually uses or the calculations will not be accurate. If you mean you want to actually change the root part of the ship then you may as well just use one of the existing mods (assuming they\u0027ve been updated to work with the changes in 0.23.5).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe idea behind this is when building, say, an orbital tug I might actually save the tug as a vessel and then bring in a payload as a subassembly, rather than the other way around. That means that the root part will be somewhere in the middle of the craft. IIRC, Engineer doesn\u0027t calculate \u0022up\u0022 the stages, only \u0022down\u0022. I\u0027ll check again but I seem to have run into that once or twice recently.\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-04-28T01:33:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003EIt would be a great help if you could post an example craft file (preferably just stock and the mod in question) and a screenshot of the KER window (with show all stages selected if in VAB) and a description of what you think is wrong (if it isn\u0027t really obvious from the screenshot).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaving sat down and looked at it analytically I think that either the issue has been fixed or I was interpreting the data wrong. I\u0027ve included the screen shots and craft file anyway so it can be double checked, but I think we\u0027re ok.\u003C/p\u003E\u003Cp\u003EThe only other thing that is different is that I normally use KW Rocketry, so I\u0027ll try the same style of craft with that installed, to double check.\u003C/p\u003E\u003Cp\u003EThe craft is a simple Apollo style set-up with a CSM and LM.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://1drv.ms/1lYwCbd\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://1drv.ms/1lYwCbd\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-04-28T04:50:27Z","Content":"\n\u003Cp\u003EI suppose i should have remembered that this thread is about the Delta-V simulation code and NOT about the entire KER mod in general, so my previous post was in the wrong place. Sorry about that.\u003C/p\u003E\u003Cp\u003EPadishar, we really appreciate the work you are putting in make KER work for what we really want, which is that D-V info. Thank you, and great job!\u003C/p\u003E\n"},{"CreatedByName":"Castun","CreatedById":4581,"CreatedDateTime":"2014-04-29T23:50:41Z","Content":"\n\u003Cp\u003ESo are the delta-V calculations unable to take into account a Procedural interstage fairing base in between an engine and tank with crossfeed enabled? I think that\u0027s my problem here, it\u0027s not showing me the correct delta-V. It\u0027s showing my stage 0 delta V which would be for the docked lander. Here are a couple pictures. Apologies, but I\u0027m running forced IVA mode so wasn\u0027t able to get an external view with KER info panel open at same time.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VsOxTG5.jpg\u0022 alt=\u0022VsOxTG5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yHK0w9T.jpg\u0022 alt=\u0022yHK0w9T.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-30T00:25:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Castun\u0022 data-cite=\u0022Castun\u0022\u003E\u003Cdiv\u003ESo are the delta-V calculations unable to take into account a Procedural interstage fairing base in between an engine and tank with crossfeed enabled? I think that\u0027s my problem here, it\u0027s not showing me the correct delta-V. It\u0027s showing my stage 0 delta V which would be for the docked lander. Here are a couple pictures. Apologies, but I\u0027m running forced IVA mode so wasn\u0027t able to get an external view with KER info panel open at same time.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/VsOxTG5.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/VsOxTG5.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/yHK0w9T.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/yHK0w9T.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think this is a problem with the fairing as such. The problem is more that KER simulates the normal staging process and also doesn\u0027t currently take into account which engines are active at the start. The staging of your vessel is really messed up. Stage 3 appears to be activating an engine but decoupling it at the same time so that stage has 0 dV. Stage 2 is just a decoupler so there are still no active engines and hence no dV. The same is true for stage 1 just having a chute, no active engines and no dV. Stage 0 does activate an engine and I assume the decoupler that is also fired doesn\u0027t detach it from the craft so it does calculate the dV.\u003C/p\u003E\u003Cp\u003ETo get a sensible readout from KER as it currently works, you will need to modify the staging so that it makes logical sense but it will still not be able to correctly simulate a stage that splits the vessel into two, still working, vessels (or rather, it won\u0027t be able to simulate both of the resulting vessels).\u003C/p\u003E\n"},{"CreatedByName":"Castun","CreatedById":4581,"CreatedDateTime":"2014-04-30T15:58:53Z","Content":"\n\u003Cp\u003EThanks to your advice, I fixed the problem, but...\u003C/p\u003E\u003Cp\u003EThe decoupler shown in the current stage is the floating node belonging to that interstage fairing adapter. When I decouple the node, since the adapter is still attached to the craft, the decouple staging icon isn\u0027t deleted like it would be for a normal decoupler. It gets left in the same stage as the currently active engine which confuses KER. I moved it back out and it fixed the calculation. It just means anytime you have a staging setup like this you have to take care to move that icon back out of the current stage afterwards.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-30T16:10:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Castun\u0022 data-cite=\u0022Castun\u0022\u003E\u003Cdiv\u003EThanks to your advice, I fixed the problem, but...\u003Cp\u003EThe decoupler shown in the current stage is the floating node belonging to that interstage fairing adapter. When I decouple the node, since the adapter is still attached to the craft, the decouple staging icon isn\u0027t deleted like it would be for a normal decoupler. It gets left in the same stage as the currently active engine which confuses KER. I moved it back out and it fixed the calculation. It just means anytime you have a staging setup like this you have to take care to move that icon back out of the current stage afterwards.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think this should be fixed by a change I did yesterday evening that makes it ignore decouplers that have already been fired. I have made quite a few other tweaks and fixes but didn\u0027t get around to updating the DLL zip in the first post. I will try to update the zip later this evening but if you are desperate you should be able to download the two updated DLLs from the github repository. Make sure you are looking at the simulate branch, navigate into Output\\Engineer and download the Engineer.dll and EngineerToolbar.dll.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-30T17:48:34Z","Content":"\n\u003Cp\u003ESorry if this has been mentioned before but I think the DV calculation should update based on active engines only.\u003C/p\u003E\u003Cp\u003EOther than that I\u0027m not having any issues.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-30T18:09:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003ESorry if this has been mentioned before but I think the DV calculation should update based on active engines only.\u003Cp\u003EOther than that I\u0027m not having any issues.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the report. For the active engine thing, please see \u003Ca href=\u0022https://github.com/Gerry1135/Engineer/issues/10\u0022 rel=\u0022external nofollow\u0022\u003Eissue #10 on github\u003C/a\u003E.\u003C/p\u003E\n"}]}