{"TopicId":65388,"ForumId":44,"TopicTitle":"What gets more FPS, VGA or HDMI","CreatedByName":"Dr.Goodbytes","CreatedById":64993,"CreatedDateTime":"2014-03-10T19:53:20Z","PageNum":1,"Articles":[{"CreatedByName":"Dr.Goodbytes","CreatedById":64993,"CreatedDateTime":"2014-03-10T19:53:20Z","Content":"\n\u003Cp\u003EI was wondering wondering if I could get a few more FPS if I switched from using HDMI to VGA to hook up my monitor. I know that the picture will no be a good compared to HDMI but I\u0027m not really concerned with picture quality as I am with FPS at the moment.\u003C/p\u003E\u003Cp\u003ECurrently I get about 15-20 FPS at launch with a ~200 part rocket, so any improvement would be helpful.\u003C/p\u003E\u003Cp\u003EMy current specs are:\u003C/p\u003E\u003Cp\u003EWindows 7 64bit\u003C/p\u003E\u003Cp\u003EAMD Athlon II X3 450 3.2 GHz\u003C/p\u003E\u003Cp\u003E8.00 GB Dual-Channel DDR2 RAM\u003C/p\u003E\u003Cp\u003ENVIDIA GeForce GT 610\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-03-10T20:04:22Z","Content":"\n\u003Cp\u003EIt\u0027s more about CPU power than Graphics with KSP. I don\u0027t think you\u0027ll notice any difference between the two connections.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-03-10T20:17:15Z","Content":"\n\u003Cp\u003EThe connection to the monitor won\u0027t have any effect at all, it\u0027s the actual graphics output that determines the fps. You need to change the game\u0027s settings or upgrade your computer in order to make any difference.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-03-10T20:24:48Z","Content":"\n\u003Cp\u003Eif you have to choose between vga and hdmi, choose hdmi. there are stand alone transceiver chips that handle this interface on your graphics card without bothering the actual gpu. to do vga the same data that would go to the hdmi tranciever would go to a 3 channel dac (vga is analog). either way, no performance is lost. but the capabilities of the hdmi interface far exceed the vga interface.\u003C/p\u003E\n"},{"CreatedByName":"Dr.Goodbytes","CreatedById":64993,"CreatedDateTime":"2014-03-10T21:37:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Airbornem4\u0022 data-cite=\u0022Airbornem4\u0022\u003E\u003Cdiv\u003EIt\u0027s more about CPU power than Graphics with KSP. I don\u0027t think you\u0027ll notice any difference between the two connections.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECurrently, my bottleneck is with the graphics. The GPU load during launch stays at 99% but the CPU usage stays around 20% and peaks at 25% during staging \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThe connection to the monitor won\u0027t have any effect at all, it\u0027s the actual graphics output that determines the fps. You need to change the game\u0027s settings or upgrade your computer in order to make any difference.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell the graphics are set as low as possible, and my Proposed 2014 Gaming budget will only cover the cost of a VGA cable it it will help.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Ebut the capabilities of the hdmi interface far exceed the vga interface.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust out of curiosity, what are the benefits?\u003C/p\u003E\n"},{"CreatedByName":"Z-Man","CreatedById":96549,"CreatedDateTime":"2014-03-11T08:27:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dr.Goodbytes\u0022 data-cite=\u0022Dr.Goodbytes\u0022\u003E\u003Cdiv\u003EJust out of curiosity, what are the benefits? (of HDMI over VGA)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs you already know, image clarity. Also, less signal processing. Unless you have a CRT monitor, with VGA, the signal has to be converted from digital to analog and back by the monitor, and because the VGA signal does not clearly indicate where pixels begin and end, the monitor has to sync to the pixel clock. It\u0027s possible that this adds another frame or two to latency (what you usually call input lag).\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2014-03-11T08:45:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dr.Goodbytes\u0022 data-cite=\u0022Dr.Goodbytes\u0022\u003E\u003Cdiv\u003ECurrently, my bottleneck is with the graphics. The GPU load during launch stays at 99% but the CPU usage stays around 20% and peaks at 25% during staging \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E20% total or 20% of a single core?\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-03-11T09:59:27Z","Content":"\n\u003Cp\u003EWith a Gerforce GT 610, that\u0027s hardly surprising. That is not so much a graphics card as it is a crude device barely capable of showing you MS Word without dropping frames at FullHD resolution. An Intel HD4000 processor graphics from 1.5 years ago outperforms it easily. Cards like these are aimed at office workers who need more than the one display connector usually offered by low-spec mainboards, not at gamers. Unfortunately that doesn\u0027t keep OEMs from trying to sell them to people in so-called \u0022gamer PCs\u0022 anyway...\u003C/p\u003E\u003Cp\u003EI\u0027m impressed it actually manages 15-20 FPS, to be honest \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou can multiply your graphics power by several times with just a small investment. A Geforce GT 640 for example is three times as fast, a Radeon 7750 four times, a GTX 650 close to five times. All of them run without needing dedicated power connectors (which your PC might not have) and should be available for two-digit sums of money (in US or European currencies at least).\u003C/p\u003E\u003Cp\u003E@ J.Random: I\u0027m fairly sure that\u0027s total CPU load, with one core under load from KSP and the other two idling/supporting.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-11T10:02:51Z\u0022 title=\u002203/11/2014 10:02  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 11, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-03-11T11:41:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dr.Goodbytes\u0022 data-cite=\u0022Dr.Goodbytes\u0022\u003E\u003Cdiv\u003EJust out of curiosity, what are the benefits?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei want to say that hdmi lets you use larger resolutions, and higher scan rates. but i do remember some old crt displace doing 1600x1200 @ 120hz (granted this was on a graphics workstation). but consider that most displays now are lcd, which are pure digital technology. it doesnt make much sense to go through a dac just to go through an adc at the other end when you can just use the high speed digital goodness that is hdmi.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-11T11:45:35Z\u0022 title=\u002203/11/2014 11:45  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 11, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-11T11:57:24Z","Content":"\n\u003Cp\u003EVGA connectors support resolutions up to 2048x1536@85Hz. HDMI 1.2 (the most common implementation) maxes out at 1920x1200@60Hz, but keeping the signal all digital results in a \u0022cleaner\u0022 display.\u003C/p\u003E\u003Cp\u003EShouldn\u0027t have any effect on frame rates, that\u0027s based on your CPU and GPU. I\u0027m sorry to say that both your CPU and GPU are marginal for playing KSP, you should turn the graphics settings as low as possible and keep your part count reasonable for best performance.\u003C/p\u003E\n"}]}