{"TopicId":65418,"ForumId":39,"TopicTitle":"The Arrtee Mission in PlanetFactory","CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2014-03-11T03:00:30Z","PageNum":1,"Articles":[{"CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2014-03-11T03:00:30Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EArrtee Exploration Vehicle\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJebediah\u0027s log, day 1, 22:00\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe Arrtee Exploration Vehicle got into orbit around Kerbin today. In a few hours, we will be starting the transfer burn, saying goodbye to our home and our friends and family, possibly forever. The only things we will have are ourselves and our ship.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E-----------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJebediah\u0027s log, day 2, 3:00\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWe just completed our transfer burn. Good-bye Kerbin.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E-----------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003E200 Days Later......\u003C/p\u003E\u003Cp\u003EMission Control: \u003Cem\u003EAll systems nominal. You are go for course correction.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Woohoo! Rocket fire again!\u003C/p\u003E\u003Cp\u003EBill: Shhh! Do you want MC to hear off-topic chatter?\u003C/p\u003E\u003Cp\u003EJeb: That\u0027s off topic chatter too-\u003C/p\u003E\u003Cp\u003EMission Control: \u003Cem\u003EJeb, this is an emergency! MJ 2.0.9 has failed to respond to our order for course correction. Can you do it manually?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Sure thing!\u003C/p\u003E\u003Cp\u003E------------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJebediah\u0027s log, day 203, 23:24\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#A9A9A9;\u0022\u003E\u003Cem\u003EWe just did a course correction on our way to Arrtee. Wow, the ink in this pen is starting to run dry......\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E------------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003EMission Control: \u003Cem\u003EJeb, if you want, we can send out a refueler with fresh ink if you want.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: So you saw my note? Nah, I won\u0027t be using this pen for any longer anyways. You need your boosters saved for kerbals in seats.\u003C/p\u003E\u003Cp\u003E57 Days Later.......\u003C/p\u003E\u003Cp\u003E----------------------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBill\u0027s log, day 260\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWe got into orbit around Arrtee today! In a few days, Jeb will be descending to this colorful planet.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E----------------------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003EJeb: Ok, I\u0027m going to practice the docking maneuvers in the lander, ok?\u003C/p\u003E\u003Cp\u003EBill: Ok......\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb gets into the lander and undocks, only to find something horrible.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: Bill?\u003C/p\u003E\u003Cp\u003EBill: Yes?\u003C/p\u003E\u003Cp\u003EJeb: I\u0027m reading the cabin pressure gauge, and it says 1% normal. That\u0027s also all of the oxygen on this thing. Also, since this is practice, I didn\u0027t bring my helmet over. And I forgot to put the RCS thrusters in this thing\u0027s design......\u003C/p\u003E\u003Cp\u003EBill: Looks like you\u0027re either going to have to ram into the ship with the thrusters or we can re-dock with you.\u003C/p\u003E\u003Cp\u003EJeb: There\u0027s just one problem with that...\u003C/p\u003E\u003Cp\u003EBill: What?\u003C/p\u003E\u003Cp\u003EJeb: I didn\u0027t include any RCS systems in either of these things.\u003C/p\u003E\u003Cp\u003EBill: Ok, I guess you\u0027re going to have to land and see if you can find any oxygen down there.\u003C/p\u003E\u003Cp\u003EJeb: Ok.......\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E2 Hours Later.....\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: And I\u0027ve run out of fuel on the way down. I\u0027m at .01% oxygen. I guess this is the end.......\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EJeb crashed into the surface as his oxygen ran out. His capsule survived, and he used the shovel that extended out of the capsule to get his last breath.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBill: Since we don\u0027t have enough fuel to get home thanks to Jeb, we\u0027re here foreve- I FORGOT THAT THE AUTOPILOT WAS A SEPERATE SHIP!\u003C/p\u003E\u003Cp\u003EMJ 2.0.9: And I\u0027m going to eject and crash into your oxygen supply, effectively destroying it. Prepare to die.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMJ 2.0.9 had a HAL moment. He destroyed the oxygen supply, so Bill had no choice but to go into cryosleep.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E125 Years Later...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E---------------------------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EKrath\u0027s log, day 266\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWe have found an ancient capsule with a cryosleep chamber in orbit around this world. Proceeding to dock.......\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E------------------------------------------------------------------------------------------------------------------------------------\u003C/p\u003E\u003Cp\u003EKaetho: This looks like the ancient Arrtee Exploration Vehicle that the Kunited States sent out over a century ago!\u003C/p\u003E\u003Cp\u003EThere might be someone onboard!\u003C/p\u003E\u003Cp\u003EKrath: And that\u0027s why we\u0027re docking.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThey docked. The following story explains the encounter.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EThe Encounter\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EKaetho: Ok, I\u0027m about to open the ancient ship\u0027s hatch.\u003C/p\u003E\u003Cp\u003E*hatch doesn\u0027t open*\u003C/p\u003E\u003Cp\u003EKaetho: I forgot that 125 years ago, they used Clamp-O-Tron docking ports. We can make it work.\u003C/p\u003E\u003Cp\u003E*hatch blows off, hitting Krath in the face*\u003C/p\u003E\u003Cp\u003EKrath: Ow, that hurt!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EKaetho goes into the ancient ship, and...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EKaetho: They have a KerPlayStation 702 in here with an ancient copy of Kresident Evil 4. And-\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EKaetho sees Bill in cryosleep\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EKaetho: Krath, there\u0027s someone alive in here!\u003C/p\u003E\u003Cp\u003EBill: Alive in-? Jeb-?\u003C/p\u003E\u003Cp\u003EKaetho: Calm down. I\u0027m Kaetho Kerman of the Secret States of Vulgaria. What\u0027s your name?\u003C/p\u003E\u003Cp\u003EBill: Bill Kerman of the Kunited States of Kermerica, a territory of the Northern Allied Territories.\u003C/p\u003E\u003Cp\u003EKaetho: Well, the Secret States are the KSA after WWK happened.\u003C/p\u003E\u003Cp\u003EBill: WWK?\u003C/p\u003E\u003Cp\u003EKaetho: The KSA was a territory of the Northern Allied Territories, a vital ally to the Elysian Empire in defeating the Styx Corporation. \u003C/p\u003E\u003Cp\u003EBill: You mean the NAT interfered with the war?\u003C/p\u003E\u003Cp\u003EKaetho: No more time for questions. We have to get you home. What happened to you, anyways?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E227 Days Later\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBill: Kerbin! I never thought I would see it again!\u003C/p\u003E\u003Cp\u003EKaetho and Krath: It\u0027s called Kearth as of 3 years ago. It\u0027s basically a Super-Eve with the toxic gas put into the atmosphere by Kaperture Laboratories, and the 3,000 meteor impacts that increased its mass to 5 times what it used to be.\u003C/p\u003E\u003Cp\u003EBill: I guess I\u0027ll be put in a museum or something. If Jeb were here, he would be, too.\u003C/p\u003E\u003Cp\u003EKaetho: Oh, we picked up Jeb and read his log. It hinted at your existence. When we found him during our EVA time, we revived him!\u003C/p\u003E\u003Cp\u003EJeb: Hello! Ready to be home?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003ETHE END.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-03-11T11:22:29Z","Content":"\n\u003Cp\u003EFix the K-Syndrome and gratuitous pop culture references please. Also, how the hell did Krath revive a kerbal who had been\u003C/p\u003E\u003Cp\u003Emushed and decompressed?\u003C/p\u003E\n"},{"CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2014-03-11T14:13:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Poryy\u0022 data-cite=\u0022Poryy\u0022\u003E\u003Cdiv\u003EFix the K-Syndrome and gratuitous pop culture references please. Also, how the hell did Krath revive a kerbal who had been\u003Cp\u003Emushed and decompressed?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUm, Jeb was revived with 25th century science! Also, the references were to make the story.... less boring IMO. I\u0027m not sure what you mean by K-Syndrome.\u003C/p\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-03-12T21:54:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sun\u0022 data-cite=\u0022Sun\u0022\u003E\u003Cdiv\u003EUm, Jeb was revived with 25th century science! Also, the references were to make the story.... less boring IMO. I\u0027m not sure what you mean by K-Syndrome.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEVERY WORD starts with K.\u003C/p\u003E\u003Cp\u003EKearth, Kresident Evil, KerPlayStation..\u003C/p\u003E\n"},{"CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2014-03-13T00:15:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Poryy\u0022 data-cite=\u0022Poryy\u0022\u003E\u003Cdiv\u003EEVERY WORD starts with K.\u003Cp\u003EKearth, Kresident Evil, KerPlayStation..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh. It really puts in the kerbal theme IMO.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-13T00:38:15Z","Content":"\n\u003Cp\u003EThe K-Syndrome used to be cool, and then it got cheesy, overused, and now its frankly just...infuriating for some, just annoying to others...\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-03-13T08:00:59Z","Content":"\n\u003Cp\u003EI thought the K-syndrome was the Kessler syndrome, but now I see what you mean (ceverything cstarting cwith ca c\u0027k\u0027)\u003C/p\u003E\n"}]}