{"TopicId":65445,"ForumId":16,"TopicTitle":"About landing on Eve","CreatedByName":"PepeZacik","CreatedById":92619,"CreatedDateTime":"2014-03-11T14:08:28Z","PageNum":1,"Articles":[{"CreatedByName":"PepeZacik","CreatedById":92619,"CreatedDateTime":"2014-03-11T14:08:28Z","Content":"\n\u003Cp\u003EHey ,i\u0027ve already landed on lot of celestial bodies but i want to ask some questions about landing on Eve ,like how much delta-v do i need in my lander, what parachutes to use , if it is better if i land higher above the sea level ,what engines to use and more..\u003C/p\u003E\u003Cp\u003EThanks for every suggestion \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-11T14:22:15Z\u0022 title=\u002203/11/2014 02:22  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 11, 2014\u003C/time\u003E by PepeZacik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-11T14:11:22Z","Content":"\n\u003Cp\u003ESo, you want to land on Eve? Best advice I can give: Send a probe. Like seriously. If you want to get back you are talking at least 7km/s dV and that\u0027s from the top of the highest mountain. If you want to take off from sea level we\u0027re talking somewhere on the order of 12-15km/s dV. Eves gravity is 1.8x that of Kerbin, once you go down it is very hard to get back up.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/0EkFdyqMojg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-11T14:26:51Z","Content":"\n\u003Cp\u003ELanding on Eve is easy, just bring a bunch of chutes and let the soupy atmosphere do the work. Getting back up is very, very challenging, though. Which are you planning?\u003C/p\u003E\n"},{"CreatedByName":"PepeZacik","CreatedById":92619,"CreatedDateTime":"2014-03-11T14:39:00Z","Content":"\n\u003Cp\u003EYep, i already built a manned lander with 9km/s dV, but i can\u0027t get it to ground.It has asparagus staging with 6 aerospikes and one LVT45 rocket in the middle.The main part of lander has Apollo style staging.Whole lander with full fuel tanks have about 2.2 T/W ratio.Also it uses 6 big blue parachutes.\u003C/p\u003E\u003Cp\u003EI just waste too much of fuel on descent, or my parachutes break whole ship, or i land in a water,...\u003C/p\u003E\u003Cp\u003EWhen i launched this lander from Kerbin i got to Jool orbit(for fun)..\u003C/p\u003E\u003Cp\u003EWhat am i doing wrong ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-11T14:48:39Z\u0022 title=\u002203/11/2014 02:48  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 11, 2014\u003C/time\u003E by PepeZacik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-03-11T14:53:33Z","Content":"\n\u003Cp\u003EFirst the atmosphere is a thick soup you will get an serious shock then they opens, use braking parachute, perhaps open them higher up or at least open some of them high. You can also use the engines a bit then you get to 500 meter attitude. \u003C/p\u003E\u003Cp\u003EFor accurate landing you has to try a bit around its easier if you start from an pretty high orbit and go faster down, this increases fuel use, add some drop tanks for this and drop them before landing, that fuel can also be used to reduce the parachute shock,\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-11T14:53:45Z","Content":"\n\u003Cp\u003EAdd some drogue chutes which you deploy first, then deploy your main chutes in pairs sequentially. Cuts down on the big jolt from a deploying parachute, which is worse on Eve than on Kerbin. It\u0027s good to have all your landing equipment (parachutes, landing gear) attached in such a way that you can jettison it immediately after takeoff so you don\u0027t waste fuel lugging that dead weight.\u003C/p\u003E\u003Cp\u003E9km/s is marginal for a return mission, you\u0027ll have to launch from somewhere at least 4500m above sea level to make it back up.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-11T14:53:57Z","Content":"\n\u003Cp\u003EYou don\u0027t need to use any fuel on descent.\u003C/p\u003E\u003Cp\u003ETile it with radial decouplers and put chutes and drogues on them. When on land, decouple them off and you\u0027re good.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-03-11T14:58:00Z","Content":"\n\u003Cp\u003EWell. Start by deleting anything you don\u0027t need. Got a lot of batteries? Change them for just enough RTGs to not lose power. Got any solars? Don\u0027t. Also, slap on heaps of parachutes (as in, \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003Eheaps\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E) to do an unpowered landing, RealChute will help. Make sure to put them on decouplers though, so you can get rid of them upon landing. Same goes for legs, slap radial decouplers to them. As for engines, might as well change that LV-T45 for an aerospike (or two if absolutely necessary for TWR and in that case, use the cubic struts). There might be more ways to improve your rocket, but we\u0027ll need screenies.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-11T15:00:17Z\u0022 title=\u002203/11/2014 03:00  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 11, 2014\u003C/time\u003E by KvickFlygarn87\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PepeZacik","CreatedById":92619,"CreatedDateTime":"2014-03-11T14:59:23Z","Content":"\n\u003Cp\u003EI don\u0027t need to return , just get into a stable orbit around Eve.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-03-11T15:09:10Z","Content":"\n\u003Cp\u003EThe advice folks are giving you so far is for getting into stable orbit around Eve from an Eve launch - you need anywhere from\u003Cstrong\u003E 7.5k-15k \u003C/strong\u003Eof delta-V in your Eve booster just to make orbit, depending on where you land and what ascent profile you\u0027re using. The delta-V requirement is why most folks haven\u0027t successfully performed an Eve launch.\u003C/p\u003E\u003Cp\u003EBeen working through this myself now for close to a year; might\u0027ve come up with a solution just this morning, but I\u0027ll need to test it out before I can definitively call success.\u003C/p\u003E\u003Cp\u003EBut yeah, get rid of unnecessary weight - for the ascent, that\u0027s everything that brought you down (chutes and lander legs, and even ladders), and an asparagus booster design is almost a must. I\u0027d definitely send a boilerplate probe first before committing a Kerbal to making the ascent attempt.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-11T15:09:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PepeZacik\u0022 data-cite=\u0022PepeZacik\u0022\u003E\u003Cdiv\u003EI don\u0027t need to return , just get into a stable orbit around Eve.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s what I meant, 9km/s is marginal for achieving orbit. The Wiki has \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Eve#Orbital_statistics\u0022 rel=\u0022external nofollow\u0022\u003Ea nice chart\u003C/a\u003E of dV requirements when launching from different altitudes.\u003C/p\u003E\n"}]}