{"TopicId":65870,"ForumId":55,"TopicTitle":"Two small part fixes","CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2014-03-15T14:12:37Z","PageNum":1,"Articles":[{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2014-03-15T14:12:37Z","Content":"\n\u003Cp\u003EThis may have been suggested before, but I couldn\u0027t find it anywhere, so... *fingers crossed* that it warrants a new thread \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/d/de/NCS_Adapter_Transparent.png\u0022 alt=\u0022NCS_Adapter_Transparent.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe NCS adapter. While it does have low drag, this part is heavy compared to other spaceplane-oriented stuff. Besides aesthetic reasons, there isn\u0027t really any advantage to using it instead of a hodgepodge of actually useful stuff. But the model clearly has air inlets on its sides and two smaller ones on top. Perhaps it could provide a (small) amount of IntakeAir, optimised for higher velocities? Not nearly as much as a ram intake, of course, the amount of 1 radial would suffice that the player doesn\u0027t get effectively punished for using it.\u003C/p\u003E\u003Cp\u003ESecondly, it would be great if the Oscar-B tanks could be radially attached! As they are mostly used in smaller craft, there usually isn\u0027t much room for additional parts that allow hack methods of doing so. And from a realism standpoint, there doesn\u0027t really seem to be anything preventing radial attachment any more than with the FL-T100 tank.\u003C/p\u003E\n"},{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2014-03-15T14:25:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ravenchant\u0022 data-cite=\u0022Ravenchant\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E-snip-\u003C/p\u003E\u003Cp\u003ESecondly, it would be great if the Oscar-B tanks could be radially attached!\u003C/p\u003E\u003Cp\u003E-snip- \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t forget xenon tanks ! or batteries or hitchhikers or or or.......,\u003C/p\u003E\u003Cp\u003EIt really is annoying playing with the tiny struts isn\u0027t it...\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-15T15:10:07Z","Content":"\n\u003Cp\u003EIf you use Editor Extensions there\u0027s a toggle to allow radial attachment of parts that normally don\u0027t allow it.\u003C/p\u003E\n"}]}