{"TopicId":65887,"ForumId":16,"TopicTitle":"What is the proper way to use solid boosters?","CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-03-15T18:00:30Z","PageNum":1,"Articles":[{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-03-15T18:00:30Z","Content":"\n\u003Cp\u003EI never use them: you cant turn them off and you can\u0027t refuel them. I also don\u0027t see any reason to use them on a lifter stage over asparagus staged orange tanks \u002B mainsail. Cant really think of any reason to use them any where instead of standard rockets.\u003C/p\u003E\u003Cp\u003Eam I missing something here?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-15T21:17:24Z\u0022 title=\u002203/15/2014 09:17  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 15, 2014\u003C/time\u003E by Parallax\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xoknight","CreatedById":80283,"CreatedDateTime":"2014-03-15T18:02:03Z","Content":"\n\u003Cp\u003EThey are good in low altitude \u0022boost\u0022 stage. They pretty much give you a push into space.\u003C/p\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-03-15T18:03:08Z","Content":"\n\u003Cp\u003EI almost never use them. There is of course the crowd of \u0022moar boosters\u0022 (not trying to criticize), but if you\u0027re going to add boosters liquid is the way to go. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-03-15T19:07:06Z","Content":"\n\u003Cp\u003EI like them but they would be a lot more useful if they had longer burn times.\u003C/p\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-03-15T19:20:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EI like them but they would be a lot more useful if they had longer burn times.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESegmented boosters would be really nice, too. But, I\u0027m sure it\u0027s been suggested many a times before.\u003C/p\u003E\u003Cp\u003EWith them we could do 4 segment boosters like the Space Shuttle, or try advancing the technology and make 5 segment boosters, like on the SLS. I guess a feature could be made to limit the amount of segments used in career and higher nodes in the tree will allow more segments to be stacked. Just something I thought aboout now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-03-15T19:34:38Z","Content":"\n\u003Cp\u003EI used a SRB for my Real Solar System Ares I-X knock off I made. The whole first stage is a long SRB from Stretchy tanks mod. Burns for 150seconds.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/LTgGS\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-16T00:22:50Z\u0022 title=\u002203/16/2014 12:22  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 16, 2014\u003C/time\u003E by Hodo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2014-03-15T20:29:53Z","Content":"\n\u003Cp\u003EThey\u0027re simple and they have a good TWR, so they provide an easy kick for launching.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-03-15T20:56:42Z","Content":"\n\u003Cp\u003EExplosive decoupling.\u003C/p\u003E\u003Cp\u003EBesides that, they\u0027re reasonably competitive with non-asparagused liquid boosters. The lower empty mass partly makes up for the lower Isp. Both solid boosters give higher thrust than any 1.25m liquid engine, making them effective first stages on smaller rockets - just stick a decoupler and a booster below each main engine for some easy extra dV.\u003C/p\u003E\u003Cp\u003EThey\u0027re also one part doing what would otherwise need several, which may be a consideration for large rockets.\u003C/p\u003E\u003Cp\u003EReally, asparagusing beats just about anything else, since we have simple-to-use massless fuel lines. But if you\u0027re opting not to use it, then solid boosters can be useful.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-03-15T20:59:37Z","Content":"\n\u003Cp\u003EBest use of a SRB: providing that first 120m/s kick while launching, when your liquid rockets are still struggling against their own mass and you take too long to speed up.\u003C/p\u003E\u003Cp\u003ESRB has a *very* favourable thrust per part count, and quite good TWR compared to any liquid fuel boosters with big tanks.\u003C/p\u003E\u003Cp\u003ETune your fuel rockets to keep you at terminal velocity, and use SRB to kick you to that speed as quickly as possible. Saves quite a lot of delta-v that you would have been wasting puttering around at 50m/s the first minute.\u003C/p\u003E\u003Cp\u003EJust dont try to go far, the ISP of SRBs is.... pathetic. About as bad as RCS, really.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-03-15T21:21:06Z","Content":"\n\u003Cp\u003ESRBs used in this early Career ship gave the boost needed for Jeb to orbit Mum and return.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zUCLXGU.jpg\u0022 alt=\u0022zUCLXGU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cfd0Euk.jpg\u0022 alt=\u0022cfd0Euk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RSGJGh3.jpg\u0022 alt=\u0022RSGJGh3.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-03-15T21:45:46Z","Content":"\n\u003Cp\u003E1: They are useful sometimes when your launch stage has just barely enough delta V, and you just want to throw on something quick and easy.\u003C/p\u003E\u003Cp\u003E2: Your rocket is 50% more awesomer with SRBs.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-15T22:25:58Z","Content":"\n\u003Cp\u003EThe only SRB I ever use is the Sepatron, to kick expended stages away. Any other use is better served with liquid fueled rockets.\u003C/p\u003E\u003Cp\u003EThat may change when economics come into play if SRBs are cheap.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2014-03-15T22:52:00Z","Content":"\n\u003Cp\u003EI use SRBs to help big craft off the pad; they let me use more fuel-efficient but lower-thrust engines for the first 5km or so until they\u0027ve burnt off enough fuel \u0026amp; oxidiser. They\u0027re much simpler to implement and debug than a full asparagus arrangement, and the biggest constraint on SRBs (no throttling) was mitigated when Tweekable thrust limiters were implemented.\u003C/p\u003E\u003Cp\u003EYou don\u0027t \u003Cem\u003Ehave\u003C/em\u003E to use \u0027em, but they\u0027re far from useless.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-03-15T23:10:43Z","Content":"\n\u003Cp\u003EMy Hercules lift vehicle (70 ton payload to 100km orbit) uses 40 Solid boosters as the first stage. I use them just to lift off the pad and get up out of the thicker part of the atmosphere. It feels like i\u0027m wasting less fuel that way. they are meant to be expendable anyways so i don\u0027t feel bad. except when i forget to start my turn early and they bomb KSC.... ha ha ha whoops.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-03-16T00:06:43Z","Content":"\n\u003Cp\u003EMaking popcore - Stayputnik or okto cores have a lower heat-tolerance than any other part. One of those on an SRB explodes at ~6km. Pointless, but fun.\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-03-16T00:13:03Z","Content":"\n\u003Cp\u003EOk just for fun i played with some numbers and flew some test flights....\u003C/p\u003E\u003Cp\u003EUsing the BACC srb as the starting point.... \u003C/p\u003E\u003Cp\u003EIt has a mass of 7.875t and thrust rating of 315. 850 units of fuel. (not using the isp because i don\u0027t understand it completely) i calculate a burn time of 45.7s\u003C/p\u003E\u003Cp\u003ETo get a comparable burn time with the mainsail you would need 2243 units of fuel (i\u0027m only using liquid for calculations... just assume oxidizer is included \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E With 12 FL-T400 and 2 FL-T100 i can have 2250 units of fuel and calculated burn time of 45.8s\u003C/p\u003E\u003Cp\u003Emass.....34.125t\u003C/p\u003E\u003Cp\u003EOn to the launch test. (going straight up. gimbals locked. full throttle)\u003C/p\u003E\u003Cp\u003EFirst the SRB.. after adding a reaction wheel and probe core final launch mass 8.22t. after launch the srb burned for 48s final AP of 63km. Thrust to mass of 38.3\u003C/p\u003E\u003Cp\u003EMainsail... launch mass of 34.47t. burned for 50s. final AP of 253km. Thrust to mass of 43.5\u003C/p\u003E\u003Cp\u003EI would say smaller rockets are better off using SRB to launch with no? Larger lifting rockets could absorb the weight needed to fuel a mainsail....\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-03-16T01:40:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cerberus738\u0022 data-cite=\u0022Cerberus738\u0022\u003E\u003Cdiv\u003EOk just for fun i played with some numbers and flew some test flights....\u003Cp\u003EUsing the BACC srb as the starting point.... \u003C/p\u003E\u003Cp\u003EIt has a mass of 7.875t and thrust rating of 315. 850 units of fuel. (not using the isp because i don\u0027t understand it completely) i calculate a burn time of 45.7s\u003C/p\u003E\u003Cp\u003ETo get a comparable burn time with the mainsail you would need 2243 units of fuel (i\u0027m only using liquid for calculations... just assume oxidizer is included \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E With 12 FL-T400 and 2 FL-T100 i can have 2250 units of fuel and calculated burn time of 45.8s\u003C/p\u003E\u003Cp\u003Emass.....34.125t\u003C/p\u003E\u003Cp\u003EOn to the launch test. (going straight up. gimbals locked. full throttle)\u003C/p\u003E\u003Cp\u003EFirst the SRB.. after adding a reaction wheel and probe core final launch mass 8.22t. after launch the srb burned for 48s final AP of 63km. Thrust to mass of 38.3\u003C/p\u003E\u003Cp\u003EMainsail... launch mass of 34.47t. burned for 50s. final AP of 253km. Thrust to mass of 43.5\u003C/p\u003E\u003Cp\u003EI would say smaller rockets are better off using SRB to launch with no? Larger lifting rockets could absorb the weight needed to fuel a mainsail....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just checked what you said with a minimal payload. MJ shows the liquid setup has about 775 m/s dV extra, but like you said, weighs nearly 26 tons more.\u003C/p\u003E\u003Cp\u003EIf you measure the equivalent weight in SRBs (34t), you end up with slightly more than 4 SRBs. the dV is pretty close to the liquid setup but still lags slightly in the TWR department. Using current in game prices, a bundle of 4 SRBs is less than half the price of the liquid setup.\u003C/p\u003E\u003Cp\u003ESo I suppose the utility of either depends on what you need/want.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-03-16T01:50:29Z","Content":"\n\u003Cp\u003EIf you do not like asparagus staging for lack of realism, boosters are the way to go. I imagine that money will also give them an advantage, as they are cheap. The lack of throttle is a non-issue, as the first stage should never be throttled on a even slightly proper rocket.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-03-16T02:09:09Z","Content":"\n\u003Cp\u003EThe hint is in the name. They\u0027re boosters. They boost. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E The faster you get off of the ground, the less dV you lose fighting atmosphere and gravity. But it can be difficult to get a vessel moving from a standing start up to an efficient ascent speed, so, you give it a boost, a quick shove to help get the ascent started. Boosters are a cheap way to give your ship that initial shove. And they will become more useful when economics are added to the game.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-03-16T02:16:44Z","Content":"\n\u003Cp\u003EAs has been touched on, SRBs are supplemental to the main engine(s). They can also be used in conjunction with liquid boosters.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-03-16T03:35:12Z","Content":"\n\u003Cp\u003EWhen you have a rocket that feels nice but can\u0027t get its job done, adding a few solid boosters is a quick and easy way to get some more thrust and delta-v. If you like designing launcher stages, there are almost always better alternatives to solid fuel boosters. On the other hand, if you prefer to concentrate on the mission stage, boosters increase your ability to reuse the launcher stages you have already built.\u003C/p\u003E\u003Cp\u003EThe last time I played career mode, I used rockets like this to go to Mun and Minmus:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/primitive_rocket.jpg\u0022 alt=\u0022primitive_rocket.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat triple stack of FL-T800s and LV-T45s is a good and solid workhorse in early career mode, but it\u0027s a bit underpowered for the payloads required to land on Mun.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-03-16T05:17:15Z","Content":"\n\u003Cp\u003EDon\u0027t forget that your TWR typically increases after launch. If you have a wonderful rocket that just cuts it a little too close in the TWR department, you can get the thing flying with boosters.\u003C/p\u003E\u003Cp\u003EThere is a reason real world spacecraft use them as first stage too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceK531","CreatedById":62535,"CreatedDateTime":"2014-03-16T06:10:29Z","Content":"\n\u003Cp\u003EWhen money becomes a thing, asparagus is going to be seen as the false prophet, and boosters are going to be seen as the road to the future, considering that you only have 1 part for a booster, versus the 40 or so parts that go into asparagusing, a fourth of which are the motors themselves which are a bit spendy iirc.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-03-16T06:32:38Z","Content":"\n\u003Cp\u003EAlmost if not ALL my ships have SRBs on them. Easy to use cheap to boot. Easy dv imho. Sometimes they are the inly way for my stuff to even have a chance at orbit lol\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-03-16T08:01:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceK531\u0022 data-cite=\u0022SpaceK531\u0022\u003E\u003Cdiv\u003EWhen money becomes a thing, asparagus is going to be seen as the false prophet, and boosters are going to be seen as the road to the future, considering that you only have 1 part for a booster, versus the 40 or so parts that go into asparagusing, a fourth of which are the motors themselves which are a bit spendy iirc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA bit grapes and melons, asparagus is 3-7 mainsails, 3 skippers is the smallest I use in one launch before I get mainsails. \u003C/p\u003E\u003Cp\u003EIt also uses 4 solids, SRB can not replace 2.5 m parts but I agree that 1.25 in asparagus is uneconomic\u003C/p\u003E\n"}]}