{"TopicId":65942,"ForumId":55,"TopicTitle":"It\u0026#039;s time to come clean, and tell the truth about KSP.","CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-16T03:07:10Z","PageNum":3,"Articles":[{"CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-16T23:42:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EI ask you to stop talking for the devlopers, saying that it can\u0027t satisfy their ultimate aims and desires is begging the question of what they really are. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou may certainly ask... \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHow general do you want to get? It is still the same situation of: to get part x do action y. You are still directing the player no matter how you describe it. I\u0027m not saying it\u0027s a bad idea it could work awesome add a tutorial, but it would be too structured for the normal career mode. That\u0027s why the points system works in this manner, it allows to player to play how they want, go where they want, do what they want. Yes the tech tree is. . well.... carp. But it and the point based system are mutually exclusive. So could you please elaborate on the specifics of your system.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnswer: As general as is needed to strike a balance between guidance, and rails. Something between the unlimited freedom of a sandbox, and the artificial limitations of exposing goo to space. Gaming elements take balancing.\u003C/p\u003E\u003Cp\u003EAnd for the 12thteenth time... it\u0027s \u0022to get part x, do actions a,c, d, g,h, or k\u0022, or more recently just buy it with cash.\u003C/p\u003E\u003Cp\u003EHow many ways do you want? \u003C/p\u003E\u003Cp\u003EIf you want everything just for getting up in the morning, then how does that resemble a career? Wouldn\u0027t you be describing a sandbox?\u003C/p\u003E\u003Cp\u003EIf you want everything at once, then I suggest that is what the sandbox is for.\u003C/p\u003E\u003Cp\u003EWith regards to the progress bar and warping... it\u0027s an interesting conflict... but personally, I\u0027d ignore warping. Research would be on the player\u0027s clock.\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-16T23:52:24Z\u0022 title=\u002203/16/2014 11:52  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 16, 2014\u003C/time\u003E by Ryder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-17T00:12:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ryder\u0022 data-cite=\u0022Ryder\u0022\u003E\u003Cdiv\u003EWith regards to the progress bar and warping... it\u0027s an interesting conflict... but personally, I\u0027d ignore warping. Research would be on the player\u0027s clock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo I basically leave KSP running while I\u0027m at work in order to finish research? Way to make the game unplayable for the \u0022wife and kids\u0022 crowd, that sounds terrible.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-03-17T00:18:52Z","Content":"\n\u003Cp\u003EIt would be nice IMO to see specific divisions of scientific advance be based on specific areas of research/action. For example, if you want to research more and better plane parts... well, get in the rickety biplane and do some barrel rolls, you big wimp. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-03-17T00:21:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ryder\u0022 data-cite=\u0022Ryder\u0022\u003E\u003Cdiv\u003E\u0022reasoning\u0022 is probably too kind a word... it\u0027s more like rationalizing any form of opposition handily available.\u003Cp\u003EWhat is the corollary to this that some must subscribe to, I wonder? \u0022We should all hold off saying anything until KSP 1.0 is out... because you never know, they might radically change everything at the last possible moment and address all concerns then.\u0022 \u003C/p\u003E\u003Cp\u003E???\u003C/p\u003E\u003Cp\u003EProject management isn\u0027t for some people, I guess.\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you consider KSP to be a car under construction. And career mode or science to be a part of the car. What people are saying is that the part (career mode or science) is still being put into the car or still being made. And we should wait until it is done being put into the car before saying we should take it out of the car (I know you mean improve/change).\u003C/p\u003E\u003Cp\u003EI did edit my post to say this but I will say it again: You said there would be multiple instances that would unlock the same parts, doesn\u0027t change a thing. The concept is still the same and that\u0027s people are apposed to.\u003C/p\u003E\u003Cp\u003ERyder, it\u0027s the concept of doing x action to unlock y part. Not how many actions there are. That people are apposed to.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou may certainly ask...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes this mean you don\u0027t know what Squads desires are as you claimed? \u003C/p\u003E\u003Cp\u003EPlease provide specifics as to your plan including examples, saying a balance would need to be made is not an answer. Say you were at a peace conference and were asked how to stop these two countries waring with each other and you say an agreement would need to be made.\u003C/p\u003E\u003Cp\u003EIt\u0027s a given, not an answer. \u003C/p\u003E\u003Cp\u003EAs a side note I\u0027m sorry if my manner sounds hostile that is not my intent.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EIt would be nice IMO to see specific divisions of scientific advance be based on specific areas of research/action. For example, if you want to research more and better plane parts... well, get in the rickety biplane and do some barrel rolls, you big wimp. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat sounds like an awesome challenge, notes taken.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T05:20:16Z\u0022 title=\u002203/17/2014 05:20  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-17T00:34:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ESo I basically leave KSP running while I\u0027m at work in order to finish research? Way to make the game unplayable for the \u0022wife and kids\u0022 crowd, that sounds terrible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you want to. Otherwise... and it\u0027s just a crazy idea... there is this thing called \u0022pause\u0022...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EIt would be nice IMO to see specific divisions of scientific advance be based on specific areas of research/action. For example, if you want to research more and better plane parts... well, get in the rickety biplane and do some barrel rolls, you big wimp. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly... on an aviation tree, you might find things like \u0022Inverted flight\u0022 (fly inverted for awhile...). \u0022Safe landing on a runway.\u0022\u003C/p\u003E\u003Cp\u003EYou\u0027re totally getting it.\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T05:20:41Z\u0022 title=\u002203/17/2014 05:20  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-17T00:42:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ryder\u0022 data-cite=\u0022Ryder\u0022\u003E\u003Cdiv\u003EIf you want to. Otherwise... and it\u0027s just a crazy idea... there is this thing called \u0022pause\u0022...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would I pause the game? The point is that people with limited play time can\u0027t sit there and (or play while they) watch a progress bar. It\u0027s a bad idea to tie something to real time played if the player has no control over it.\u003C/p\u003E\n"},{"CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-17T00:49:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EIf you consider KSP to be a car under construction... \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI consider KSP to be a project that is being managed... nuff said. You do know what a thread is... and it\u0027s purpose... yes?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou said there would be multiple instances that would unlock the same parts, doesn\u0027t change a thing. The concept is still the same and that\u0027s people are apposed to.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhhh... no. It\u0027s not. You\u0027re not getting it.\u003C/p\u003E\u003Cp\u003EAnd if people are opposed to doing things to get things, then they must hate how it is now. As it is, LITERALLY, you MUST do W, X, and Y to get Z, ****plus**** everything in the tree elements before it. My suggestion has ways around that... so you\u0027re really arguing against yourself I think. My proposal is... just do any element that delivers the part you want, and with a little research, it\u0027s yours. And if you really want it, and don\u0027t want to use any of the options... just buy it.\u003C/p\u003E\u003Cp\u003EAt this point, I\u0027m unclear what your issue is... Not enough rails... or too much? Help me out here.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDoes this mean you don\u0027t know what Squads desires are as you claimed? \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI told you how I think it likely came about, and I told you where I believe it will lead. Some people call it a prediction. If you have a problem with that, take it to the complaints dept.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EPlease provide specifics as to your plan including examples, saying a balance would need to be made is not an answer. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot interested in that now. Just laying out a concept. The specifics would be creative (and balance tested) decisions within that framework. Jump into the details all you want... I don\u0027t own the idea.\u003C/p\u003E\u003Cp\u003EBut I know the concept allows for infinite restriction, and infinite freedom, therefore, the balance is inclusive of this, and therefore it can be found. A little thing I call reason. The current system *won\u0027t even show you* what you can get... and you certainly can\u0027t skip ahead through skill or taking a chance. You\u0027re trapped. Maybe you like having to navigate a tree step by step. If so, then you can still do that here.\u003C/p\u003E\u003Cp\u003EAnswer the question for yourself...\u003C/p\u003E\u003Cp\u003EDo YOU want only one way to get something? If so, say so. We can do that here.\u003C/p\u003E\u003Cp\u003EDo you want to have anything whenever you want? If so, say so. We can do that too. (and is really the sandbox)\u003C/p\u003E\u003Cp\u003EDo you want something in between (oh no... here comes that scary word..) That\u0027s called \u0022balance\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs a side note I\u0027m sorry if my manner sounds hostile that is not my intent.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhatever. doesn\u0027t bother me.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EWhy would I pause the game? The point is that people with limited play time can\u0027t sit there and (or play while they) watch a progress bar. It\u0027s a bad idea to tie something to real time played if the player has no control over it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh I see... well, then those same people must hate pointless grinding. Which is what we have. (and you\u0027ll note.. a lot of people don\u0027t like it..)\u003C/p\u003E\u003Cp\u003EI\u0027m in that exact group you mention... and is one of the reasons I hate the way it is now... the endless, pointless grinding... I don\u0027t have time for that.\u003C/p\u003E\u003Cp\u003EAnd no, you don\u0027t watch the progress bar. It\u0027s griding on its own, while you play. If you want to check it, you can. If you want to manage it, you can. And since you can adjust it yourself, with the click of a mouse... to unlock the story/things *you* want first... \u003C/p\u003E\u003Cp\u003EAlso, you have no basis to complain about the \u0022time\u0022 this supposedly all takes, because, as you know, time ranges from infinitely short, to infinitely long.\u003C/p\u003E\u003Cp\u003ESince you don\u0027t know what time scales we are talking about... you\u0027re just making up an objection.\u003C/p\u003E\u003Cp\u003ESince it can literally be set *anywhere*, the amount of time needed, just perfect for you, is possible, ranging from \u0022right now\u0022, to \u0022wait forever\u0022.\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T05:21:08Z\u0022 title=\u002203/17/2014 05:21  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-17T00:54:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ryder\u0022 data-cite=\u0022Ryder\u0022\u003E\u003Cdiv\u003EOh I see... well, then those same people must hate pointless grinding. Which is what we have.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice dodge, can you give me a good reason why real time played is somehow a decent metric to base my third career save on?\u003C/p\u003E\u003Cp\u003EAlso, I don\u0027t see it as pointless grinding, or really even that grindy to begin with; it\u0027s a pretty good system for a sandbox game and will tie in nicely with the other currencies when they arrive.\u003C/p\u003E\n"},{"CreatedByName":"Arran","CreatedById":64656,"CreatedDateTime":"2014-03-17T01:03:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ryder\u0022 data-cite=\u0022Ryder\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWith regards to the progress bar and warping... it\u0027s an interesting conflict... but personally, I\u0027d ignore warping. Research would be on the player\u0027s clock.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo in a way you are suggesting research in a kind of EvE Online way, that the more you progress into it, the longer it takes to complete it, in real time..\u003C/p\u003E\u003Cp\u003ESorry, but no way people are gonna wait lets say 4 to 5 hours on their own time before something is finished, EvE Online can get away with it, since it fits the whole game setting, but implementing this into KSP, even though with very reduces waiting times, i think is eventually an really bad idear. at least worser as the point system we have now.\u003C/p\u003E\u003Cp\u003EI do admit the instant unlocking of parts in the tree is a bit off, and a waiting time before your scientists are ready, seems logical, but keep that at least tied to the ingame time and thus also to timewarping. So that i order new research, that its completed after XX number of days, and can speed it up by timewarping.\u003C/p\u003E\u003Cp\u003EThen i have a prototype (one single item) that needs to be tested, and then taken into production and funded.\u003C/p\u003E\u003Cp\u003EAnd here comes a bit how i think the carreer will look when completed, from what i remember for interviews of Harvester (correct me if i\u0027m wrong) Once the item is in ProtoType state, you can get a contract to test this item out, on succesfull completion of this test, you get credits, what you then can use to buy new researched parts to use.\u003C/p\u003E\u003Cp\u003EThen you have contracts that you have to complete with you fully production rocket/plane giving again credits to spend on even more parts, and hiring scientists/engineers/kerbalauts.\u003C/p\u003E\u003Cp\u003EHow i unlock new research, it by science points, or by you\u0027re means doing predefined actions, boils to me down in the end to the same thing, and wont change much in the end when all parts of carreer mode are completed.\u003C/p\u003E\u003Cp\u003EAnd TBH i still fail to see how you\u0027r \u003Cstrong\u003EDo This\u003C/strong\u003E, to \u003Cstrong\u003EGet That\u003C/strong\u003E is so much different as a point system.\u003C/p\u003E\u003Cp\u003EIt still \u0022forces\u0022 me into doing things like its now as well the case, i still am limited to the techtree, and with its current state, the whole carreer is well.. true.. boring and easy.. But when i think of it as a whole like SQUAD mentioned how they would approach it (what can be subject of change in this stage of development) i dont think it will stay boring and easy.\u003C/p\u003E\u003Cp\u003EIn short, i\u0027m saying, you can suggest ofc you vision, but the likelyhood that things will change the way YOU want it, is very slim, allmost can say, it wont ever never happen (again we said the same of MP, look what happend, still MP isnt implemented yet, thus alot easier to adopt, nothing is lost, only gained) since the system is allready in the game, and scrapping it for a simulair system with just a other means of getting invisible points, and with it own flaws, i doubt it they will scrap the current system.\u003C/p\u003E\u003Cp\u003EHence people say, if you dislike the current system so much, but you like youre freedom, go play sandbox, at least then you cannot get frustrated by a system, you clearly hate. And if you want to prove yourself right i would suggest make it into a Mod, since your idear has merit, and would be even fun to try out, still only way is by Modding it in.\u003C/p\u003E\u003Cp\u003EThinking that the devs will adopt it.. well it can happen, but winning a million in a lottery also can happen, but the change that it will happen to you... well thats neglectable.\u003C/p\u003E\u003Cp\u003EIf you ever push you\u0027r idear out as a mod, i an eager to try it..\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-03-17T01:33:21Z","Content":"\n\u003Cp\u003EScience needs to be more user focused, in place of a click-read system I would introduce mini game type system, imagine reading a spectrograph, or a more interesting version of a seismograph.\u003C/p\u003E\n"},{"CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-17T01:40:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arran\u0022 data-cite=\u0022Arran\u0022\u003E\u003Cdiv\u003ESo in a way you are suggesting research in a kind of EvE Online way, that the more you progress into it, the longer it takes to complete it, in real time..\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo... that\u0027s how it is now... and I\u0027m against that. Seriously.... tell me, how long do you think it takes to get all of the final squares in the existing tree? Compare that to the beginning of the tree.\u003C/p\u003E\u003Cp\u003EThe \u0022directing research\u0022 idea is merely a mechanism that some people wanted... to be able to direct research. It can be there, or not. I\u0027m not attached to it, but it might be nice to let advanced players push in the direction they want to go, and have things evolve faster.\u003C/p\u003E\u003Cp\u003EIn my approach, the more you progress, the more you progress. You can progress fast... do 40 things on the trees in a single mission... then you\u0027re a rock star... and all that is behind you. If you are skilled I expect one could go blazingly fast. That is where difficulty level comes in. If you get less $$$ for things that pay, then you\u0027re going to be challenged to economize on hardware, and sometimes \u0022take the long road\u0022 to \u0022win\u0022 at the game. Easy setting? Plenty of cash to build what you want... and be wasteful about it. New players will go through hardware like it\u0027s going out of style. They\u0027ll need more pay, and start with more cash, (for example)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arran\u0022 data-cite=\u0022Arran\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESorry, but no way people are gonna wait lets say 4 to 5 hours on their own time...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t recall saying it should take hours. If hours is too long... and instant is too short, what time do you suggest? That is part of the art of play testing and balance. Any time is possible with what I am suggesting.\u003C/p\u003E\u003Cp\u003EMy gut feel might be that five items being unlocked, all left at normal development rates, might take 15 minutes... otherwise turning off 4 and just researching one would happen in 3 minutes.\u003C/p\u003E\u003Cp\u003EI\u0027m not saying there is no art to game design. There is.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arran\u0022 data-cite=\u0022Arran\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u0022In short, i\u0027m saying, you can suggest ofc you vision, but the likelyhood that things will change the way YOU want it, is very slim...\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cem\u003E\u0022Never tell me the odds.... \u0022 \u003C/em\u003E H. Solo\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T01:53:38Z\u0022 title=\u002203/17/2014 01:53  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Ryder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-03-17T01:53:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ESo I basically leave KSP running while I\u0027m at work in order to finish research? Way to make the game unplayable for the \u0022wife and kids\u0022 crowd, that sounds terrible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI cannot help but feel that you are trying your best to find objections, while not really trying to understand the benefits of the proposed system. You have called things terrible on multiple occasions now, but I have yet to see a real argument.\u003C/p\u003E\u003Cp\u003EThis way we will never have a constructive dialog, which is a sure-fire way of ending up with a system few people like.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAlso, I don\u0027t see it as pointless grinding, or really even that grindy to begin with; it\u0027s a pretty good system for a sandbox game and will tie in nicely with the other currencies when they arrive.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile it is clear that this is your personal opinion, it lacks argumentation - not to mention that it ignores the worries of many. The grindy nature of the current system has been often discussed and even mentioned by Squad as something that should be mitigated. Feeling a certain way about the current or proposed system is certainly welcomed, but it would be preferred to take things further than just those feelings.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T03:23:09Z\u0022 title=\u002203/17/2014 03:23  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceK531","CreatedById":62535,"CreatedDateTime":"2014-03-17T03:16:38Z","Content":"\n\u003Cp\u003EAs a relatively inexperienced player in all things not-blowing-up-things, I found the current career mode a rather good challenge and I have not had to grind very much at all. I like it primarily because it forces me to think in different ways than sandbox mode; in order to get more parts I have to experience different environs both on Kerbin and in the kerbin system. For example: So far I have done a few sub-orbital hops to different biomes on Kerbin, made bigger landers and experimented with VTOL systems early in the tech tree, and sent two missions to the mun, one as a fly-by and the other as a lander picking up some major science points, progressing me about 1/3rd of the way through the tree. It may be trivial to say, \u0022oh that\u0027s grinding and grinding is terrible,\u0022 when a. grinding is not outright terrible, and b. it really embodies what I have read of your idea: progressive discoveries that unlock new parts. Each one of those sub-orbital hops was done with larger craft, extending range and gathering more science points. Also, it\u0027s kinda fun to try and work with the part restrictions of the current system early in the tree; attempt to leave kerbin\u0027s SOI with only 4 or so branches unlocked is difficult and invigorating when you manage to do it.\u003C/p\u003E\u003Cp\u003ESo, I think the current career system is fine as it is.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-17T03:28:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI cannot help but feel that you are trying your best to find objections, while not really trying to understand the benefits of the proposed system. You have called things terrible on multiple occasions now, but I have yet to see a real argument.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t like \u0022waiting\u0022 mechanics, it\u0027s as simple as that. If it\u0027s too short it becomes trivial and I wonder why someone bothered to program it. If it\u0027s too long I wonder why I even bother playing the game. I fear there will never be a balance struck that will satisfy everyone when it comes to those sorts of mechanics and thus I feel KSP should avoid them because we already wait too much in this game as it is.\u003C/p\u003E\u003Cp\u003EOP doesn\u0027t seem attached to it, so I\u0027ll drop it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EWhile it is clear that this is your personal opinion, it lacks argumentation - not to mention that it ignores the worries of many. The grindy nature of the current system has been often discussed and even mentioned by Squad as something that should be mitigated. Feeling a certain way about the current or proposed system is certainly welcomed, but it would be preferred if it was taking further than just those feelings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately I don\u0027t see a clear benefit of the OP\u0027s proposal over our current currency system. While his system may reduce grind somewhat it provides no challenge whatsoever and also introduces waiting; at least in the current one I have to keep stretching further while at the same time getting immediate results. OP\u0027s system is a \u0022push button, receive bacon\u0022 system for veteran players, thankfully he\u0027s not attached to research time or it would be a \u0022push button, leave the game on for two days (or whatever), receive bacon\u0022 system.\u003C/p\u003E\u003Cp\u003ESecondly, being able to exchange science for money or reputation, and vice-versa, is something I\u0027m really looking forward to. It provides more choice when going about the career. You can do missions and skip the science, buying it as needed, or you can do science to buy your rockets and gear, or you can do both and blaze through the tech tree by converting for science. The fact is that we\u0027re missing pieces of career mode and until they\u0027re in, it\u0027s hard to judge it. I get that OP wants to steer the game but I don\u0027t like his direction; I actually like the current system and the tidbits of the future I\u0027ve gained from SQUAD and trust their vision (especially after they canned that resource system proposal) since they seem to be cleaving true to the sandbox style of play.\u003C/p\u003E\n"},{"CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-17T03:50:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceK531\u0022 data-cite=\u0022SpaceK531\u0022\u003E\u003Cdiv\u003EAs a relatively inexperienced player in all things not-blowing-up-things, I found the current career mode a rather good challenge and I have not had to grind very much at all. I like it primarily because it forces me to think in different ways than sandbox mode; in order to get more parts I have to experience different environs both on Kerbin and in the kerbin system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is of course exactly what my proposal does... although without overwhelming force.\u003C/p\u003E\u003Cp\u003EAlso, my system *by its very nature* guides you in thinking and concepts... the existing system does not. \u003C/p\u003E\u003Cp\u003EIf there is an achievement that mentions SOI... you are now introduced to sphere of influence. If it mentions escape velocity... geosynchronous orbits, etc. etc. etc. etc. etc... potentially endless introductions to as many concepts... you might not ever even CONCEIVE of of a geosynchronous orbit... unless you see it on the tree.\u003C/p\u003E\u003Cp\u003EMy tree does that.\u003C/p\u003E\u003Cp\u003ESquad\u0027s tree does not.\u003C/p\u003E\u003Cp\u003EMy tree inspires.\u003C/p\u003E\u003Cp\u003ESquad\u0027s tree denies parts unless you grind.\u003C/p\u003E\u003Cp\u003EThe benefits are pretty plain.\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-03-17T03:53:50Z","Content":"\n\u003Cp\u003E*double-checks to make sure this isn\u0027t \u0022Yahoo comments\u0022 under a political article* hmm... surprisingly, it\u0027s not.\u003C/p\u003E\n"},{"CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-17T03:55:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EYou can do missions and skip the science, buying it as needed, or you can do science to buy your rockets and gear, or you can do both and blaze through the tech tree .\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy tree concept already has that.\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boomerdog2000\u0022 data-cite=\u0022boomerdog2000\u0022\u003E\u003Cdiv\u003EPersonally I like the tech-tree. It challenges older players to do more with less, and introduces parts to new players slow enough to ward off confusion. Once we get contracts where the game begins asking us to do more with less, while keeping it on budget I think it will come together even more.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s all in my tree concept.\u003C/p\u003E\u003Cp\u003EThe only reason they are having to add contracts is because their tree left a huge hole in the kinds of activities that need doing.\u003C/p\u003E\u003Cp\u003EI think that they realized that \u0022expose goo\u0022 and \u0022take a sample\u0022 and \u0022transmit data\u0022, over and over and over and over and over and over and over and over again... was not really rich enough... they realized that a richer experience, that includes doing realistic activities, was absolutely necessary.\u003C/p\u003E\u003Cp\u003EMy tree doesn\u0027t leave that hole.\u003C/p\u003E\u003Cp\u003ESquad and I see it the same overall way, really... I\u0027m just more concise about it. I do it in one place... they split it in two.\u003C/p\u003E\u003Cp\u003EThe mechanism (and needs) are simple.\u003C/p\u003E\u003Cp\u003EMeter out parts, guide development, provide interesting activities.\u003C/p\u003E\u003Cp\u003ETech tree \u002B Contracts does that.\u003C/p\u003E\u003Cp\u003ERyder-Tree does that.\u003C/p\u003E\u003Cp\u003ERyder-Tree likely has greater latitude... for example, you could earn an achievement if you ever go half the speed of light, say... Squad might find that harder... I\u0027m having a hard time picturing a \u0022contract\u0022 to go half the speed of light. But anything is possible.\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T05:21:43Z\u0022 title=\u002203/17/2014 05:21  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OTehNoes","CreatedById":76153,"CreatedDateTime":"2014-03-17T04:32:11Z","Content":"\n\u003Cp\u003EI quite like the career mode actually. I used to play exclusively sandbox, but I fancied something different, more of a challenge.\u003C/p\u003E\u003Cp\u003ESure you could argue that the current science system does involve some grinding, but it\u0027s only grinding if you make it grinding. Say I need 500 science points to get that oh so lovely \u0027part x\u0027 that I\u0027ve been hankering for. Sure I could be upset about having to find that one biome/science equipment combination that I haven\u0027t tried yet. \u003C/p\u003E\u003Cp\u003EOR I could try challenging myself to try a return journey for once, or try a different design of rocket to collect my data. Maybe try making a roving science vehicle that can collect and analyse data, for a second craft to come and collect.\u003C/p\u003E\u003Cp\u003EAnd if you don\u0027t want to do this? Use sandbox! I don\u0027t think there\u0027s anything wrong with the current tech tree, other than maybe it could do with giving us more science equipment earlier on so we can get through it a little bit faster. That or give us MORE science collecting equipment, I just like seeing what the readouts have to say!\u003C/p\u003E\u003Cp\u003EThat said, I think it would be nice if they added in the informational readouts on sandbox mode too, just with 0 scientific value, rather than just \u0022you feel it would be more helpful if the R\u0026amp;D building was open\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-17T04:42:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OTehNoes\u0022 data-cite=\u0022OTehNoes\u0022\u003E\u003Cdiv\u003EI quite like the career mode actually. I used to play exclusively sandbox, but I fancied something different, more of a challenge.\u003Cp\u003ESure you could argue that the current science system does involve some grinding, but it\u0027s only grinding if you make it grinding. Say I need 500 science points to get that oh so lovely \u0027part x\u0027 that I\u0027ve been hankering for. Sure I could be upset about having to find that one biome/science equipment combination that I haven\u0027t tried yet. \u003C/p\u003E\u003Cp\u003EOR I could try challenging myself to try a return journey for once, or try a different design of rocket to collect my data. Maybe try making a roving science vehicle that can collect and analyse data, for a second craft to come and collect.\u003C/p\u003E\u003Cp\u003EAnd if you don\u0027t want to do this? Use sandbox! I don\u0027t think there\u0027s anything wrong with the current tech tree, other than maybe it could do with giving us more science equipment earlier on so we can get through it a little bit faster. That or give us MORE science collecting equipment, I just like seeing what the readouts have to say!\u003C/p\u003E\u003Cp\u003EThat said, I think it would be nice if they added in the informational readouts on sandbox mode too, just with 0 scientific value, rather than just \u0022you feel it would be more helpful if the R\u0026amp;D building was open\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight...\u003C/p\u003E\u003Cp\u003EBut all you did was advocate the kinds of things you would do to get the same part with Ryder-Tree. But instead of chasing science points by learning how to manipulate the science points system (an area of study in and of itself) you would simply DO the science (or the engineering achievement, or navigational feat, or the scenario)... and get there... \u003C/p\u003E\u003Cp\u003EYou can\u0027t do the same things over and over to earn science points currently, so that automatically limits you to fewer and fewer options as you advance, so in that sense, your\u0027re still getting urged into doing things... with options, same as Ryder-Tree. (although I also advocate for simply purchasing research... so you can use an economic model instead of a science one if desired)\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T04:45:15Z\u0022 title=\u002203/17/2014 04:45  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Ryder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-03-17T04:44:22Z","Content":"\n\u003Cp\u003EAs this is the n-th time the same arguments and non-arguments have been brought up, I guess that concludes this discussion for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2014-03-17T05:19:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI don\u0027t like \u0022waiting\u0022 mechanics, it\u0027s as simple as that. If it\u0027s too short it becomes trivial and I wonder why someone bothered to program it. If it\u0027s too long I wonder why I even bother playing the game. I fear there will never be a balance struck that will satisfy everyone when it comes to those sorts of mechanics and thus I feel KSP should avoid them because we already wait too much in this game as it is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETLDR: Near Immediate Gratification, or nothing!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESecondly, being able to exchange science for money or reputation, and vice-versa, is something I\u0027m really looking forward to. It provides more choice when going about the career. You can do missions and skip the science, buying it as needed, or you can do science to buy your rockets and gear, or you can do both and blaze through the tech tree by converting for science. The fact is that we\u0027re missing pieces of career mode and until they\u0027re in, it\u0027s hard to judge it. I get that OP wants to steer the game but I don\u0027t like his direction; I actually like the current system and the tidbits of the future I\u0027ve gained from SQUAD and trust their vision (especially after they canned that resource system proposal) since they seem to be cleaving true to the sandbox style of play.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETLDR: I like Tech Trees that I can abuse with little to no effort.\u003C/p\u003E\u003Cp\u003EYou\u0027ve mentioned having your first flight to Eeloo several times; so that generally says exactly how you plan to play the game. Wiki-Open, Exploration Shut. The whole point here is that science should \u0022Progress;\u0022 but it isn\u0027t as if you couldn\u0027t figure out how to abuse the system and get end-tier benefits anyways. \u003C/p\u003E\u003Cp\u003EIn short, Ryder is ROLEPLAYING while you\u0027re \u0022Roll Playing,\u0022 trying to find the optimum way of getting what you want out of the system. \u0022Waiting Mechanics\u0022 when you can timewarp aren\u0027t bad (I know what he said, I\u0027m changing it to be practical)... and it ENCOURAGES you to do other things while \u0022Waiting\u0022... Go setup a GPS system, take a tour of the planet via plane. Demanding everything be done \u0022now now now\u0022 is what ruins the game, slowly enjoying it makes it live on.\u003C/p\u003E\u003Cp\u003E*Just Because*\u003C/p\u003E\u003Cp\u003EA practical way of doing a rescue mission:\u003C/p\u003E\u003Cp\u003Eif VESSEL(OnLadder).launchTime \u0026gt; VESSEL(KerbalEVA).launchTime \u002B \u00221 day\u0022, isRescueMission\u003C/p\u003E\u003Cp\u003EKerbalEVA inherits the launchTime from the original vessel, all splits off the original vessel have the same \u0022launchTime\u0022. Yes, you can just \u0022pick the kerbal up after 1 day\u0022 with a different vessel, but the point is to simulate... not to prevent abuse of system.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T05:41:32Z\u0022 title=\u002203/17/2014 05:41  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Fel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ryder","CreatedById":40949,"CreatedDateTime":"2014-03-17T05:24:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EAs this is the n-th time the same arguments and non-arguments have been brought up, I guess that concludes this discussion for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, that\u0027s a bit of a shame... because I think that, especially for those that seem to get what I\u0027m advancing, it would be even more instructive/helpful if you see potential shortcomings (the warping was a good one), or areas that could be exploited better.\u003C/p\u003E\u003Cp\u003EAnd also, for anyone... if anyone knows of a mod that is somewhat like I am proposing, I\u0027d love to know about it and try it.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ER\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T05:34:23Z\u0022 title=\u002203/17/2014 05:34  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Ryder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-03-17T05:25:26Z","Content":"\n\u003Cp\u003ETwo things, guys. You can edit a post to add another thought rather than just posting multiple times in a row. Also, please back off of the insulting tone you are taking toward each other.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-17T05:35:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fel\u0022 data-cite=\u0022Fel\u0022\u003E\u003Cdiv\u003EDemanding everything be done \u0022now now now\u0022 is what ruins the game, slowly enjoying it makes it live on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I agree with Ryder on one thing at least: people don\u0027t read posts, they just make **** up. Like Camacha I\u0027m going to bow out.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-03-17T06:15:08Z","Content":"\n\u003Cp\u003EThe biggest problem I have with yours, Ryder, is that you\u0027re tying parts to acheivements, as far as I can tell. If I want part X, I HAVE to go to Duna. Am I reading it right?\u003C/p\u003E\n"}]}