{"TopicId":66245,"ForumId":16,"TopicTitle":"Change the directory for saved games?","CreatedByName":"bo_knows","CreatedById":94455,"CreatedDateTime":"2014-03-19T17:56:52Z","PageNum":1,"Articles":[{"CreatedByName":"bo_knows","CreatedById":94455,"CreatedDateTime":"2014-03-19T17:56:52Z","Content":"\n\u003Cp\u003EI run KSP from Steam. I have 2 PC\u0027s in my home, both of which have the ability to run KSP. Ideally, I\u0027d like to be able to play a saved game no matter which PC I\u0027m on, without having to manually transfer the files every time. I see 2 possible solutions:\u003C/p\u003E\u003Cp\u003E1) Store the entire KSP installation on a network drive that both PC\u0027s can access\u003C/p\u003E\u003Cp\u003E2) Have KSP separately installed on each PC, but have each of them point to the same \u0022Saved Games\u0022 folder on a network drive.\u003C/p\u003E\u003Cp\u003EObviously #1 would run pretty slow. Is #2 possible? Is there a workaround to possibly automatically mirror the files in the saved directory?\u003C/p\u003E\u003Cp\u003EThanks for any thoughts.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-03-19T18:25:15Z","Content":"\n\u003Cp\u003EIMHO your best bet would be to use a file synchronization tool to automatically keep the saves copied between the two PCs. You\u0027ll need one that can sync any folder, which does count out a fair few of the cloud storage providers.\u003C/p\u003E\n"},{"CreatedByName":"lockpicker","CreatedById":74102,"CreatedDateTime":"2014-03-19T18:29:04Z","Content":"\n\u003Cp\u003EI don\u0027t think #2 is possible in the current ksp build, maybe some third party automatic synchronization programs, like goodsync, but I have never used any of them. .. I think #1 is the only way to go..\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-19T18:30:22Z\u0022 title=\u002203/19/2014 06:30  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 19, 2014\u003C/time\u003E by lockpicker\u003C/strong\u003E\n\u003Cbr\u003EGot ninja\u0026#039;d\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-19T19:16:13Z","Content":"\n\u003Cp\u003EAnother option is to install KSP in a DropBox account, and have the Dropbox client on both PCs. Dropbox gives 2GB for free which should be enough for a KSP install, and it will automatically synchronize and cache all the stored files on the local hard drive. This, like option 1, has the advantage of synchronizing your mods as well.\u003C/p\u003E\u003Cp\u003EWhatever solution you use, be careful not two run two instances of the game simultaneously.\u003C/p\u003E\u003Cp\u003E#2 is possible using symbolic links rather than a different savegame folder.\u003C/p\u003E\n"},{"CreatedByName":"bo_knows","CreatedById":94455,"CreatedDateTime":"2014-03-19T19:42:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lockpicker\u0022 data-cite=\u0022lockpicker\u0022\u003E\u003Cdiv\u003EI don\u0027t think #2 is possible in the current ksp build, maybe some third party automatic synchronization programs, like goodsync, but I have never used any of them. .. I think #1 is the only way to go..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t ever used Dropbox, but I assume that having Dropbox in the system tray on both PCs would be able to sync 2 folders. I\u0027ll report back once I try it out.\u003C/p\u003E\n"},{"CreatedByName":"Friedrich Nietzsche","CreatedById":106208,"CreatedDateTime":"2014-03-19T20:19:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bo_knows\u0022 data-cite=\u0022bo_knows\u0022\u003E\u003Cdiv\u003EI run KSP from Steam. I have 2 PC\u0027s in my home, both of which have the ability to run KSP. Ideally, I\u0027d like to be able to play a saved game no matter which PC I\u0027m on, without having to manually transfer the files every time. I see 2 possible solutions:\u003Cp\u003E1) Store the entire KSP installation on a network drive that both PC\u0027s can access\u003C/p\u003E\u003Cp\u003E2) Have KSP separately installed on each PC, but have each of them point to the same \u0022Saved Games\u0022 folder on a network drive.\u003C/p\u003E\u003Cp\u003EObviously #1 would run pretty slow. Is #2 possible? Is there a workaround to possibly automatically mirror the files in the saved directory?\u003C/p\u003E\u003Cp\u003EThanks for any thoughts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could use symlinks.\u003C/p\u003E\u003Cp\u003EPlace a folder with the savegames on your network drive/Google Drive folder/Dropbox folder and name it somthing like \u0022KSP saves\u0022.\u003C/p\u003E\u003Cp\u003ECopy your savegames from the ksp game directory to this folder and delete the saves folder in the game\u0027s directory.\u003C/p\u003E\u003Cp\u003ENow open an command prompt with administrator privileges and type:\u003C/p\u003E\u003Cp\u003Emklink \u0022C:\\path\\to\\kerbal\\space\\program\\saves\u0022 \u0022C:\\place\\where\\you\\plan\\to\\store\\the\\saves\\KSP saves\u0022\u003C/p\u003E\u003Cp\u003EThe first path leads to ksp game directory and must end with \u0022saves\u0022, since the game expects to find a so named folder. The second path leads to the folder you created before. So in my case the proper command would be:\u003C/p\u003E\u003Cp\u003Emklink \u0022C:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program\\saves\u0022 \u0022C:\\Users\\FriedrichNietzsche\\Google Drive\\KSP saves\u0022\u003C/p\u003E\u003Cp\u003EIf you use the same procedure on all your machines you can use perfectly synced savegames. But you have to give your computer time to upload them before you switch it off. The game can\u0027t tell symlinks and folders/files apart, there is no difference for the game. \u003C/p\u003E\u003Cp\u003EIf you want to revert everything, just delete the saves-shortcut in the ksp game folder and create a saves folder, where you copy back your savegames.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-19T23:27:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bo_knows\u0022 data-cite=\u0022bo_knows\u0022\u003E\u003Cdiv\u003EI haven\u0027t ever used Dropbox, but I assume that having Dropbox in the system tray on both PCs would be able to sync 2 folders. I\u0027ll report back once I try it out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s what it\u0027s meant for. Dropbox creates a folder on your hard drive that has all your dropbox content in it. Installing it on another PC creates another folder with exactly the same contents, that is synced whenever possible. Offline usage works fine as the files are stored locally too, but you need to have a network connection for syncing. I believe that local network syncing is supported as well, though I haven\u0027t used it.\u003C/p\u003E\u003Cp\u003ESimplest solution, I think, would be to put your whole install in your dropbox. That way your saves, screenshots and mod installations stay synced among all the PCs.\u003C/p\u003E\u003Cp\u003EAs an aside, it\u0027s totally a first world problem to have too many PCs that can play KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jackson Mackenzie","CreatedById":77204,"CreatedDateTime":"2015-01-26T23:12:51Z","Content":"\n\u003Cp\u003ESorry for the necro; question was answered above, just didn\u0027t understand the terminology.\u003C/p\u003E\u003Cp\u003EFor anyone who has a similar problem to the OP (or me), a symlink is a directory pointer.\u003C/p\u003E\u003Cp\u003EI will now slam my head repeatedly into my desk.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-26T23:14:42Z\u0022 title=\u002201/26/2015 11:14  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 26, 2015\u003C/time\u003E by Jackson Mackenzie\u003C/strong\u003E\n\u003Cbr\u003ETerminology screwup, question was already answered!\n\u003C/span\u003E\n"}]}