{"TopicId":66303,"ForumId":32,"TopicTitle":"What is your \u0026#039;Specialty\u0026#039; in KSP?","CreatedByName":"roblamb98","CreatedById":75487,"CreatedDateTime":"2014-03-20T09:55:02Z","PageNum":8,"Articles":[{"CreatedByName":"Alymon","CreatedById":106720,"CreatedDateTime":"2014-03-26T18:39:08Z","Content":"\n\u003Cp\u003EMy specialty is definitely flying by the seat of my pants, and by that I mean I like to just throw stuff together with a general idea in mind and hope it works out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt rarely does.\u003C/p\u003E\n"},{"CreatedByName":"nadreck","CreatedById":89087,"CreatedDateTime":"2014-03-26T19:36:55Z","Content":"\n\u003Cp\u003EWhat I am good at:\u003C/p\u003E\u003Cp\u003Edesigning easy to land low CG landers for airless bodies\u003C/p\u003E\u003Cp\u003Emission planning to get there and back on the fuel available (put it this way I often am down to RCS on the return, but still make it)\u003C/p\u003E\u003Cp\u003Elogistics for multiple biome science missions (my unpatented science module that consists of an RCS tank, a materials bay, two goo containers and 4 each of the smaller sensors, oh and of course one parachute and 2 docking ports - I send them to the Mun and Minmus - they get picked up from the automated transfer vehicle by a low CG lander in a polar orbit which also refuels from the transfer vehicle and deposits previously \u0027exposed\u0027 module - go down to the surface to a different biome - rinse and repeat)\u003C/p\u003E\u003Cp\u003EOh and nukes, I love nukes! deep space tanker/supply ships with the best mass ratio\u0027s using a single or pair of nukes, supporting the nuke powered lander for the easy moons and the other specialized landers for the two \u0022hard\u0022 moons Laythe and Tylo\u003C/p\u003E\u003Cp\u003EOh, and I think I am getting tolerably good at both rendezvous (both orbital and surface) and docking. The surface rendezvous skill comes from the frequent need to rescue Kerbals from the surface of Mun or Minmus.\u003C/p\u003E\u003Cp\u003ENot good at but trying hard:\u003C/p\u003E\u003Cp\u003EWingless airbreathing SSTO\u0027s (ok mixed mode engine now)\u003C/p\u003E\u003Cp\u003EI have yet to land and return a Kerbal from Eve, but am working on it in 0.23 - might make it here - if not I restart my space race (career mode trying to optimize in elapsed Kerbin time) in 0.23.5\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-03-26T20:33:58Z","Content":"\n\u003Cp\u003ESpending hours in the VAB trying to find a way to get enough dV and making calculations to see if my rockets can get to their destination.\u003C/p\u003E\n"},{"CreatedByName":"GDJ","CreatedById":58462,"CreatedDateTime":"2014-03-29T14:35:02Z","Content":"\n\u003Cp\u003EI seem to gravitate to Aircraft. I do have a space station in orbit (fairly large one, with 10 kerbalnauts on board) and I plan to use it as a assembly dock for a large spacecraft, but I always seem to throw something together with wings and a pair of jet engines and push the envelope of speed and manoeuvrability.\u003C/p\u003E\u003Cp\u003EThere is something fun about doing a radial G-turn then pitching up with 5 G\u0027s and pulling up a scant 10 metres from the ground! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sophistry","CreatedById":106653,"CreatedDateTime":"2014-03-29T21:46:15Z","Content":"\n\u003Cp\u003EI suppose my speciality is standardising my operations, and being OCD about naming missions, and even more OCD about naming my craft according a theme.\u003C/p\u003E\u003Cp\u003EMy first two missions to any planet (Named Pioneer-(number)A and -(number)B ) involve carrying 1) A Mosquito-Series probe and a Demeter orbital fuel silo/module, then 2) A Bumblebee-Series probe and a Daedalus research outpost.\u003C/p\u003E\u003Cp\u003EAll my probes are named after various types of insects, for instance Bumblebee is my returnable-probe class, with variants depending on where it\u0027s going. My space stations are named from Greek mythology, my IP tug is named the \u0022Kurtman\u0022 because I shamelessly stole the basic premise after watching one of kurtjmac\u0027s videos.\u003C/p\u003E\n"},{"CreatedByName":"TimMartland","CreatedById":68334,"CreatedDateTime":"2014-03-29T22:01:46Z","Content":"\n\u003Cp\u003EI like probes. \u003C/p\u003E\u003Cp\u003EI have many probes.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMany \u003C/strong\u003Eprobes.\u003C/p\u003E\u003Cp\u003EI have probably about 10 Kerbin satellites, 4-5 unmanned Mun landers (and 2 rovers), 2 unmanned Minmus landers and many interplanetary missions.\u003C/p\u003E\u003Cp\u003EWeirdly, my Kerbals never venture very far out. I have 2-3 space stations in LKO (A small ISS style, an unmanned emergency fuel unit which has saved me many, many times and a mostly abandoned Skylab which I never had the heart to deorbit and is used as a space garden shed) where they visit a lot to science, but apart from that all that I did was 3 Mun landing missions, a Minmus orbiter and a 3 day trip into interplanetary space before hastily returning.\u003C/p\u003E\u003Cp\u003ESophistry, I obsess over organisation too. I have a naming and filing system for my rockets to make sure they are neat, standardised and categorised by their ability, launch stage and payload respectively. All my orbits have to be as close as possible to the target orbit, and can never be below it (As close as 99,798m is to 100,000 it just isn\u0027t as neat as 100,049)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-29T22:04:51Z\u0022 title=\u002203/29/2014 10:04  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 29, 2014\u003C/time\u003E by TimMartland\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rainbow-Dashie","CreatedById":76160,"CreatedDateTime":"2014-03-29T22:13:13Z","Content":"\n\u003Cp\u003EI guess my specialty would be in the realm of Rovers, however my vehicles are more like APC\u0027s or troop transports \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Carry lots of Kerbals, and withstand an entire rocket crashing into it in a failed landing attempt...\u003C/p\u003E\u003Cp\u003EI usually fail in landings with them... so they usually have to survive being dropped from Hundreds of meters above the surface of a planet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E so far only one vehicles has survived every mission... the K.U.V (Kerbal Utility vehicle) carrys 4 kerbals, still operational when dropped 300m above the surface of the Mun (you just don\u0027t have any lights)\u003C/p\u003E\n"},{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2014-03-29T22:20:00Z","Content":"\n\u003Cp\u003EI have a knack of packing just the right amount of fuel. I don\u0027t use KER (although I probably should) and just guess how much fuel I would need for the mission, and more often than not it turns out to be \u003Cstrong\u003E\u003Cem\u003Ejust\u003C/em\u003E\u003C/strong\u003E right.\u003C/p\u003E\n"},{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2014-03-29T22:46:39Z","Content":"\n\u003Cp\u003ELazyness. Pure, lazyness.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2014-03-29T23:04:58Z","Content":"\n\u003Cp\u003ENot sure if I responded in this thread yet. Can only internet while office, so not lots time for checking. So I answer again.\u003C/p\u003E\u003Cp\u003EMy specialty? Sublime detonations.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/xKgSl\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWith the occasional inexplicable and unexpected successful flight.\u003C/p\u003E\n"},{"CreatedByName":"Son of Hicks","CreatedById":69841,"CreatedDateTime":"2014-03-29T23:40:13Z","Content":"\n\u003Cp\u003EI can lift anything to LKO. You know those multiple hundred ton space stations that people build in orbit? I send them up in one piece and send it up in one boost. If you need something boosted, PM me and we\u0027ll work something out.\u003C/p\u003E\u003Cp\u003EI\u0027m also a master at docking. I try not to use RCS anymore and just flip around burn the main rocket motor.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-03-30T00:07:04Z","Content":"\n\u003Cp\u003EFirst try everything, when not in career.\u003C/p\u003E\u003Cp\u003EExcept HUGE rockets.\u003C/p\u003E\u003Cp\u003EWhen in career, stranding EVERYBODY. EVEN THE RESCUE TEAM.\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2014-03-30T01:26:30Z","Content":"\n\u003Cp\u003EMine would definitely have to be building/flying planes/SSTOs!\u003C/p\u003E\n"},{"CreatedByName":"Antikris","CreatedById":80556,"CreatedDateTime":"2014-03-30T10:18:57Z","Content":"\n\u003Cp\u003ETiny rovers is my thing lately. In general, I love making minimalistic, realistic-looking stuff. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t037oIm.png\u0022 alt=\u0022t037oIm.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheGeoninja","CreatedById":92271,"CreatedDateTime":"2014-03-30T11:16:45Z","Content":"\n\u003Cp\u003EMine is obviously one way missions I have yet to rescue my Duna manned mission in a bizarre orbit when it was trying to get back to its transfer stage. Really messed that one up.\u003C/p\u003E\n"},{"CreatedByName":"Geredis","CreatedById":31070,"CreatedDateTime":"2014-03-30T14:51:37Z","Content":"\n\u003Cp\u003EI think I must admit that my specialty isn\u0027t all that exciting.\u003C/p\u003E\u003Cp\u003EI think I\u0027d have to put down \u0022Blowing things up on the launch pad because of incompetent engineering.\u0022\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-03-30T15:31:21Z","Content":"\n\u003Cp\u003ELaunching 100-200 ton cargoes on my Goliagus lifter.\u003C/p\u003E\u003Cp\u003EBuilding aircraft with the flying properties of a brick\u003C/p\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2014-03-30T15:53:10Z","Content":"\n\u003Cp\u003EStock Mun missions...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img15/6223/p3ug.jpg\u0022 alt=\u0022p3ug.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.us/a/img138/8995/5ohc.jpg\u0022 alt=\u00225ohc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/28073-New-Rebuild!-Apollo-Replica-Munbug-XI-Saturn-V-CSM-Lander-Buggy-and-A-L-S-E-P\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/28073-New-Rebuild!-Apollo-Replica-Munbug-XI-Saturn-V-CSM-Lander-Buggy-and-A-L-S-E-P\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-30T15:57:25Z\u0022 title=\u002203/30/2014 03:57  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 30, 2014\u003C/time\u003E by Mulbin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MinerEdgar","CreatedById":21247,"CreatedDateTime":"2014-03-30T17:51:54Z","Content":"\n\u003Cp\u003ELanding planes despite horrible Lag.\u003C/p\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-03-30T18:21:09Z","Content":"\n\u003Cp\u003ELaunching giant pyramids to another planets with 36 stages rockets.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=UUmSjVOr-969-hi9XooH87yQ\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"royying","CreatedById":20591,"CreatedDateTime":"2014-03-30T19:48:20Z","Content":"\n\u003Cp\u003EUse shuttle plane as much as possible\u003C/p\u003E\u003Cp\u003Elike the mission go to atmosphere existed bodys and low gravity bodys\u003C/p\u003E\n"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2014-03-30T20:47:15Z","Content":"\n\u003Cp\u003EPlacing orange monsters in LKO with nowhere to go.\u003C/p\u003E\n"},{"CreatedByName":"Koolkei","CreatedById":74454,"CreatedDateTime":"2014-04-01T14:41:54Z","Content":"\n\u003Cp\u003Erovers...... it\u0027s my specialty, not that im good at it\u003C/p\u003E\n"},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2014-04-01T14:43:54Z","Content":"\n\u003Cp\u003EStrangely high dV ships that look pretty small.\u003C/p\u003E\n"},{"CreatedByName":"going-to-the-MOON","CreatedById":105034,"CreatedDateTime":"2014-04-01T14:46:49Z","Content":"\n\u003Cp\u003EBuilding and sending probes that get to places very easily...\u003C/p\u003E\n"}]}