{"TopicId":66479,"ForumId":50,"TopicTitle":"Docking: From Navball to First Station, and Beyond","CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-22T16:13:48Z","PageNum":1,"Articles":[{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-22T16:13:48Z","Content":"\n\u003Cp\u003EDocking is a key component in station building, orbital construction, ship refueling, and many other activities in Kerbal Space Program. This multi-part guide will explain the basics of docking in a very simple manner. Although there are many other tutorials, I find they ask things of new users that they might not understand. We will start with the most essential component: the Navball.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EPDF DOWNLOAD:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EHere\u0027s a \u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://www.dropbox.com/sh/p80hxwazpmome2y/AAACDNZppwSmLLLLuN-pjf2Ya?dl=0\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003Elink\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003E to the tutorial in PDF format. Still a work in progress itself, the tutorial will soon include the Asteroid Redirect Mission!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #1: Learning the Navball:\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThis incredibly useful little instrument, located on the center of the bottom of your screen, gives you nearly all of the information you need to know about nearly everything you could ever do in KSP. G-force of ship, throttle setting, speed in orbit, compared to a target or surface, Delta-V needed for any maneuver, time until said maneuver, time to complete and direction to face for the maneuver, direction of ship compared to planet, prograde and retrograde, toward and away from target. Basically, everything you ever need to know about docking is right there, in the little 1\u0022 by 1\u0022 display.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/33tsbpi.jpg\u0022 alt=\u002233tsbpi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is a display of all the symbols on the navball as they are seen in game. What follows is a key to these symbols.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/5f0v1w.jpg\u0022 alt=\u00225f0v1w.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe level indicator displays the orientation of your ship. The \u0022front\u0022 of it is represented by the dot in the middle of the symbol, and either of the two \u0022sticks\u0022 to the sides display your port and starboard sides, not particularly useful for a rocket, but vital for a spaceplane. The next symbol, prograde, shows you the direction you are going. If you need to accelerate, say, to take off from the Mun, that is what you want the level indicator to face. The retrograde symbol is the opposite, it shows you the direction you are \u003Cem\u003Enot\u003C/em\u003E going. If you want to land or de-orbit, that is the symbol to face, and you will slow down. The maneuver symbol, if you have created a maneuver node, shows you where to point to complete the maneuver. The \u0022target prograde\u0022 node shows you where to point to go toward whatever your target is. and the \u0022target retrograde\u0022 is away from your target.\u003C/p\u003E\u003Cp\u003EThe part of the display labeled \u00221\u0022 is your current selection of speed. In \u0022Orbit\u0022 mode, it shows you how fast you are actually going in relation to absolute zero. In \u0022Surface\u0022 mode, it shows you how fast you are going in relation to your current body of influence, a planet, usually. And \u0022Target\u0022 mode is in relation to your current target. Notice when you switch between these settings the prograde and retrograde nodes move.\u003C/p\u003E\u003Cp\u003E\u00222\u0022 shows your current speed in relation to your selection. It is in meters per second.\u003C/p\u003E\u003Cp\u003E\u00223\u0022 and \u00224\u0022 are the toggles for RCS and SAS controls. RCS stands for \u0022Reaction Control System\u0022, turned on with \u0022R\u0022 , is a system of thrusters to orient yourself in orbit or to give little thrusts in a designated direction. Note that docking in nearly impossible without this, and you need to build your ship with RCS thrusters and fuel for them to work. SAS is for \u0022Stability Augmentation System\u0022, and helps to keep your rocket pointed in the right direction. As of 0.23, it is included on all capsules. When engaged with \u0022T\u0022, it does everything in its power to keep the ship oriented in the same direction.\u003C/p\u003E\u003Cp\u003E\u00225\u0022 is the throttle setting. Each of the larger lines indicates a third of the full thrust.\u003C/p\u003E\u003Cp\u003E\u00226\u0022 is the G-Force indicator. It is best, when getting to orbit, to keep this in the green zone, and the top of the green zone is even better. If it is too high, throttle down, if it is too low, throttle up.\u003C/p\u003E\u003Cp\u003E\u00227\u0022 is the Maneuver Delta-V indicator. It shows you how much Delta-V is needed to do a maneuver, and how much of it is completed by the yellow arc.\u003C/p\u003E\u003Cp\u003E\u00228\u0022 is more Delta-V stuff. It tells you how much time is approximated for the burn of a maneuver, and how long until the maneuver. A good rule of thumb is to start burning when the time until the maneuver is half that of the maneuver burn itself.\u003C/p\u003E\u003Cp\u003E\u00229\u0022 is the main display of the navball. More on that below.\u003C/p\u003E\u003Cp\u003E\u002210\u0022 is your heading. You do not ever need to pay attention to that for any purpose, really.\u003C/p\u003E\u003Cp\u003EFinally, \u002211\u0022 is the minimize button. If you can\u0027t find the navball, there is a small arrow near the spot where it should be. Click it and the display will reappear.\u003C/p\u003E\u003Cp\u003ENow that you know the basics, I will show you how to orient your ship with the navball.\u003C/p\u003E\u003Cp\u003EIf you hold the \u0022A\u0022 key, the navball will turn to the right. An easier way to think of it is that the level indicator goes to the left, same as the \u0022A\u0022 key is the leftmost key on the controls. The \u0022D\u0022 key causes the level indicator to travel right. However, the \u0022W\u0022 and \u0022S\u0022 keys are reversed. Think of \u0022W\u0022 as \u0022Push nose \u003Cem\u003Edown\u003C/em\u003E, and \u0022S\u0022 as \u0022Pull nose up\u0022. So, the level indicator sinks when the \u0022W\u0022 key is pressed, and rises when \u0022D\u0022 is pressed. Practice in orbit for a few minutes until you get the hang of these. There are also the \u0022Q\u0022 and \u0022E\u0022 controls. \u0022Q\u0022 rotates the level indicator counterclockwise, and \u0022E\u0022 clockwise.\u003C/p\u003E\u003Cp\u003E---------------------------------------------------\u003C/p\u003E\u003Cp\u003ETutorials in this series:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ELearning the Navball\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBasic Rendezvous\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EDocking\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBuilding Lifters\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EFirst Module\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERCS Tugs - Function and Design\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EFinishing\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E Spirion Station Mark II\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EIn Progress:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESLS Introduction\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EBasic Theory of Asteroid Rendezvous\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EThe \u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAsteroid Redirect Mission\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EDesign of the K.S.S. \u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENew Horizons\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAsteroid Rendezvous\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERedirection\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-05T14:03:48Z\u0022 title=\u002209/05/2014 02:03  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 5, 2014\u003C/time\u003E by Starwhip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-22T18:17:33Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #2: Basic Rendezvous\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ERendezvous, although it may seem impossible, is not really all that hard. It is the meeting of two ships in orbit, at a distance close enough to dock, generally 0 Kilometers to around 8 Kilometers. Although docking is possible at distances of around 25 Kilometers, it is a waste of fuel to dock this way. Getting this close to another body in space is difficult or impossible to do by eye, and you need to know how to use Maneuver Nodes.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EManeuver Nodes:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/dce98h.jpg\u0022 alt=\u0022dce98h.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese are essentially planners for burns you want to do in the future. You can click and drag the little symbols to use them. The \u0022prograde\u0022 and \u0022retrograde\u0022 symbols (note that they are the same as on the Navball) are used to indicate a prograde or retrograde burn. The \u0022normal\u0022 and \u0022antinormal\u0022 ones are used to indicate a north or south burn. And finally, the \u0022radial in\u0022 and \u0022radial out\u0022 are used to \u0022shift\u0022 your orbit to one side or the other. So, launch a ship into orbit. Click anywhere along your orbit. Choose \u0022Add Maneuver Node\u0022. One will pop up at the spot you clicked. Play around with the different choices until you understand the basics of how they work.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERendezvous:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EStep 1: Build a ship capable of making it to Low Kerbin orbit. This is from 70,000 Km to around 200,000 Km. The ship needs RCS thrusters, as well. Make sure you put the thrusters on the COM (Center of Mass) of the bit which is going to be docking. In the VAB there are three little buttons. The one that looks like a weight toggles the center of mass display. Place the RCS thrusters on the same level as this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/2aguss8.jpg\u0022 alt=\u00222aguss8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECenter of Mass in the editor.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/o9mgc5.png\u0022 alt=\u0022o9mgc5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is my Crew Transfer Vehicle. It is probably capable of a Munshot, but it will do for docking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/2uyjgau.png\u0022 alt=\u00222uyjgau.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd this is the station I am going to dock to. Note that you could just launch an identical transfer vehicle and dock to that.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/28cq25u.png\u0022 alt=\u002228cq25u.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the orbit of the station. It is in LKO at around 136 Kilometers, an easy orbit to achieve.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESetting up Launch:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDon\u0027t just go ahead and launch the second your ship loads. You need to check some things first. Set your target ship to whatever thing in orbit you want.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/2qwzaip.png\u0022 alt=\u00222qwzaip.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETime warp (not too fast!) until you have an arrangement depicted in the image below.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/2youc9f.png\u0022 alt=\u00222youc9f.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELaunch your ship.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/nzozh5.png\u0022 alt=\u0022nzozh5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPitch over at 9,000 meters to 45 degrees East, or the \u002290-degree\u0022 mark on the Navball.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/izqmu0.png\u0022 alt=\u0022izqmu0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EContinue going up. Wait until your apoapsis is nearing the orbit of your target. Then, pitch over all the way to 0 degrees, the line between the blue and brown sections of the Navball, but make sure you are still on the line from 0-90 degrees! Otherwise, you will go too far north or south. Once your apoapsis reaches the orbit of the target vessel, hit \u0022X\u0022 to cut your engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/2zghkz4.png\u0022 alt=\u00222zghkz4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/314ebfo.png\u0022 alt=\u0022314ebfo.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/14ohlf.png\u0022 alt=\u002214ohlf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EManeuver Time!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOnce you have the correct suborbital arc as depicted above, mouse over your apoapsis. Right-click and create a Maneuver Node there.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/x2485d.png\u0022 alt=\u0022x2485d.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen, pull on the \u0022prograde\u0022 setting until your orbit matches the ship\u0027s orbit. Continue to pull the different settings to minimize the distance between the two craft as shown by the Intercept markers (the orange and purple triangles).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/jzcf1x.png\u0022 alt=\u0022jzcf1x.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETurn your ship so that the Level Indicator matches the Maneuver Node Marker on the Navball. Wait until the Time Until Node is half the time of the Time Required for Burn and begin your burn. As you near the end of the burn (the last 10 m/s or so,) throttle down and just caress the ship into exactly the orbit you want by chasing the blue node around until the Delta-V indicator reads around .1 to .3. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/2nimurm.png\u0022 alt=\u00222nimurm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/28lqphf.png\u0022 alt=\u002228lqphf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/d3b6.png\u0022 alt=\u0022d3b6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDelete the node by clicking on it, then right-clicking once the editor pops up and clicking on the red \u0022X\u0022. Check your intercept. If it is within a few Km, you\u0027re good to go! But, if it\u0027s significantly larger than the maneuver was set to be, turn on your RCS and fiddle with it (The IKJLHN keys are for RCS. Mainly, use H and N to thrust forwards and backwards.)\u003C/p\u003E\u003Cp\u003ENow you have set up the rendezvous! Congratulations!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-23T20:06:27Z\u0022 title=\u002203/23/2014 08:06  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 23, 2014\u003C/time\u003E by Starwhip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-22T20:10:29Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #3: Docking\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESo, you\u0027ve finally managed to set up a rendezvous between two ships. You\u0027re halfway there! Just a little longer until the ships are stuck together by the magical magnetic forces of docking.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECorrecting your Orbit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/1jlx6g.png\u0022 alt=\u00221jlx6g.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETime warp until the intercept is in 45 seconds. Rotate to face retrograde, and burn until the display reads \u00220 m/s\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/2lu53lg.png\u0022 alt=\u00222lu53lg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/dc4iep.png\u0022 alt=\u0022dc4iep.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/14ig9ra.png\u0022 alt=\u002214ig9ra.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe Approach\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/mbs9oy.png\u0022 alt=\u0022mbs9oy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/264q5b5.png\u0022 alt=\u0022264q5b5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/2zf5u6s.png\u0022 alt=\u00222zf5u6s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/106gc4j.png\u0022 alt=\u0022106gc4j.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/2qmn49x.png\u0022 alt=\u00222qmn49x.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThankfully, the orbit came into the view of the sun \u003Cem\u003Ejust\u003C/em\u003E as I was completing the final burn. Docking in the dark is a pain...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe Docking\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/el5e7o.png\u0022 alt=\u0022el5e7o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/2vwh5ic.png\u0022 alt=\u00222vwh5ic.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/20j4ihl.png\u0022 alt=\u002220j4ihl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you come in, orient your ship so that it matches the orientation of the docking port. This doesn\u0027t mean face the docking port, it means literally aligning the ship in 3 dimensions in the same way as the docking port. There is no real way to learn this, it just takes some fiddling. Screw around with the RCS rotation controls (WASD) to orient.\u003C/p\u003E\u003Cp\u003EIf you are coming in sideways, use the IJKL keys to thrust laterally. This is where having your thrusters on your Center of Mass is vital, because you can thrust sideways without rotating.\u003C/p\u003E\u003Cp\u003EUse H and N to thrust forward (Toward the nose of the craft) and backward (toward the engine) respectively.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/2wq73tf.png\u0022 alt=\u00222wq73tf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce you are about this close, make sure you are properly aligned with the docking port, and slow to about 0.3 m/s.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/2qd62iv.png\u0022 alt=\u00222qd62iv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlmost there! Slow to 0.1 m/s, the standard docking speed. The magnetic forces should soon kick in, hit \u0022T\u0022 to disable your SAS. Aaaaaaaand....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/righ8x.png\u0022 alt=\u0022righ8x.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBOOM! (Hopefully not literally! That would be very unfortunate! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E) Docking Complete!\u003C/p\u003E\u003Cp\u003EIf I should continue on with the tutorials for station building, let me know! But even so, I hope these tutorials cleared up some of the troubles of learning to dock effectively and quickly. Good luck out there!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-23T20:05:09Z\u0022 title=\u002203/23/2014 08:05  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 23, 2014\u003C/time\u003E by Starwhip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-22T20:14:11Z","Content":"\n\u003Cp\u003EVery Nice and Very well written. I like it. It\u0027s also good that you provide lots of pics to demonstrate the process.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-23T15:17:29Z","Content":"\n\u003Cp\u003EWell, I\u0027m ready to do the station-building tutorials, if anyone is interested. I\u0027ll give a step-by-step guide on how to build \u003Cem\u003ESpirion Station Mark II\u003C/em\u003E (The station in the tutorial!). Please respond if anyone wants that series.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-03-23T17:15:08Z","Content":"\n\u003Cp\u003EFeel free to continue. There\u0027s no such thing as \u0022too much useful information\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-23T17:36:30Z","Content":"\n\u003Cp\u003EOkey-dokey then.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EIN PROGRESS:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #4: Building Lifters\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #5: First Module\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #6: RCS Tugs - Function and Design\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #7: Finishing \u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESpirion Station Mark II\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-23T19:25:59Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #4: Building Lifters\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ELifters are rockets that can launch payloads into orbit. I enjoy making them plausible at least, nice and aerodynamic at best. This tutorial will cover the 2 launchers I created to launch all of the parts that created \u003Cem\u003ESpirion Station II.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBasic Theory of Lifters\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELifters should usually carry between 5 and 18 tons to orbit. They are created from the top down in the VAB so that they may be made into subassemblies for easy rocket creation. And they should be relatively easy to fly and have a low-ish part count.\u003C/p\u003E\u003Cp\u003EHowever, some of the parts of this station are more than 18 tons, at around 25 tons. So, a new type of lifter, a \u003Cem\u003Eheavy lifter\u003C/em\u003E, is needed.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHeavy Lifters\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHeavy lifters can lift 36 tons or more. I tested the \u003Cem\u003EKitan VII\u003C/em\u003E Launcher, the heavy lifter included in this tutorial, with 1 Rockomax Jumbo-64, which weighs 36 tons. It made orbit with fuel to spare.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial 4-1: Creating the Kitan I Launcher\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe \u003Cem\u003EKitan I\u003C/em\u003E was the workhorse of the station, lifting the majority of the parts. Although the 2 fuel depot parts (located on the inner arms of the solar arrays) were lifted by the \u003Cem\u003EKitan VII\u003C/em\u003E, the rest were all less than 18 tons.\u003C/p\u003E\u003Cp\u003EStep 1:\u003C/p\u003E\u003Cp\u003EAdd a Rockomax Brand Decoupler in the VAB.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/3164v20.png\u0022 alt=\u00223164v20.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 2:\u003C/p\u003E\u003Cp\u003EIn this order, add these parts:\u003C/p\u003E\u003Cp\u003E1x RC-L01 Remote Guidance Unit\u003C/p\u003E\u003Cp\u003E1x FL-R1 RCS Fuel Tank\u003C/p\u003E\u003Cp\u003E1x Rockomax X200-16 Fuel Tank\u003C/p\u003E\u003Cp\u003E1x Rockomax \u0022Poodle\u0022 Liquid Fuel Engine\u003C/p\u003E\u003Cp\u003E4x RV-105 RCS Thruster Block (Level with the CoM)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/28sbjip.png\u0022 alt=\u002228sbjip.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 3:\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Decoupler\u003C/p\u003E\u003Cp\u003E2x Rockomax Jumbo-64 Fuel Tank\u003C/p\u003E\u003Cp\u003E1x Rockomax \u0022Mainsail\u0022 Fuel Tank\u003C/p\u003E\u003Cp\u003E4x Standard Canard (Bottom edge of canard level with bottom of fuel tank.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/2wp6t06.png\u0022 alt=\u00222wp6t06.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 4:\u003C/p\u003E\u003Cp\u003E2x Hydraulic Detachment Manifold\u003C/p\u003E\u003Cp\u003E2x Rockomax Jumbo-64 Fuel Tank\u003C/p\u003E\u003Cp\u003EStep 5: (Going up from top of radial fuel tank)\u003C/p\u003E\u003Cp\u003E2x Rockomax X200-32 Fuel Tank\u003C/p\u003E\u003Cp\u003E2x Protective Rocket Nose Mk7\u003C/p\u003E\u003Cp\u003EStep 6: (Going down)\u003C/p\u003E\u003Cp\u003E2x Rockomax \u0022Mainsail\u0022 Liquid Fuel Engine\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/2wnuzh3.png\u0022 alt=\u00222wnuzh3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 7:\u003C/p\u003E\u003Cp\u003E4x EAS-4 Strut Connector (Zoom in and rotate to go \u003Cem\u003Einside\u003C/em\u003E the fuel tanks for easy inline strutting) on the X200-32 and the bottom of the Jumbo-64.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/16leik7.png\u0022 alt=\u002216leik7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 8:\u003C/p\u003E\u003Cp\u003E8x Sepatron 1 (Put 2 on each of the X200-32\u0027s and 2 on each of the Jumbo-64\u0027s)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/345fn6q.png\u0022 alt=\u0022345fn6q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 9:\u003C/p\u003E\u003Cp\u003E2x Sepatron 1 (On the top of the center Jumbo-64)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/25qfarm.png\u0022 alt=\u002225qfarm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 10:\u003C/p\u003E\u003Cp\u003E4x TT18-A Launch Stability Enhancer\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/2yl8ned.png\u0022 alt=\u00222yl8ned.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow, it\u0027s time to fix the staging. If you run your mouse along the staging column on the right-hand side of the screen, different parts become highlighted. Stage the rocket as so:\u003C/p\u003E\u003Cp\u003EStage 0: Top decoupler.\u003C/p\u003E\u003Cp\u003EStage 1: \u0022Poodle\u0022 engine\u003C/p\u003E\u003Cp\u003EStage 3: Decoupler under \u0022Poodle\u0022 engine and the 2 Sepatrons under that decoupler\u003C/p\u003E\u003Cp\u003EStage 4: Hydraulic Detachment Manifolds and the 8 Sepatrons attached to the two side boosters\u003C/p\u003E\u003Cp\u003EStage 5: Launch Stability Enhancers\u003C/p\u003E\u003Cp\u003EStage 6: \u0022Mainsail\u0022 engines\u003C/p\u003E\u003Cp\u003ENow scroll up to the top. Open the \u0022subassemblies\u0022 tab. Click and drag the entire rocket (by clicking on the top decoupler or SHIFT-clicking anywhere on the rocket) into the \u0022Subassembly Drop Zone\u0022. Name it something, and hit \u0022Save\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/otglyr.png\u0022 alt=\u0022otglyr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial 4-2: Creating the Kitan VII Heavy Lifter\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EStep 1:\u003C/p\u003E\u003Cp\u003EAgain, start with a Rockomax Brand Decoupler.\u003C/p\u003E\u003Cp\u003EStep 2:\u003C/p\u003E\u003Cp\u003E1x RC-L01 Remote Guidance Unit\u003C/p\u003E\u003Cp\u003E1x Rockomax X200-32 Fuel Tank\u003C/p\u003E\u003Cp\u003E1x Rockomax \u0022Skipper\u0022 Liquid Fuel Engine\u003C/p\u003E\u003Cp\u003E4x Stratus-V Cylindrified Monopropellant Tank (Near the top of the X200-32)\u003C/p\u003E\u003Cp\u003E4x RV-105 RCS Thruster Block (Once again, on the CoM)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/2vwtp9g.png\u0022 alt=\u00222vwtp9g.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 3:\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Decoupler\u003C/p\u003E\u003Cp\u003E2x Rockomax Jumbo-64 Fuel Tank (Stacked going down from the decoupler)\u003C/p\u003E\u003Cp\u003EStep 4:\u003C/p\u003E\u003Cp\u003E6x Rockomax Jumbo-64 Fuel Tank (Attached radially to the topmost Jumbo-64)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/2uf7goh.png\u0022 alt=\u00222uf7goh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E6x Rockomax Jumbo-64 Fuel Tank (Stacked on the bottom of the 6 radial Jumbo-64\u0027s)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/25sofm9.png\u0022 alt=\u002225sofm9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 5:\u003C/p\u003E\u003Cp\u003E6x Protective Rocket Nose Mk7 (Top of the radial stacks)\u003C/p\u003E\u003Cp\u003E7x Rockomax \u0022Mainsail\u0022 Liquid Fuel Engine (One in the middle of the stack and 6 on the outer ones.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/33cxj4m.png\u0022 alt=\u002233cxj4m.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 6:\u003C/p\u003E\u003Cp\u003E18x EAS-4 Strut Connector (6 connecting the topmost fuel tanks to each other, and 12 connecting the bottommost ones to the central one, 2 per column/stack)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/t5oq5h.png\u0022 alt=\u0022t5oq5h.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 7:\u003C/p\u003E\u003Cp\u003E12x Standard Canard\u003C/p\u003E\u003Cp\u003E12x TT18-A Launch Stability Enhancer\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/1huq94.png\u0022 alt=\u00221huq94.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStep 8:\u003C/p\u003E\u003Cp\u003E6x Sepatron I (Facing up, remember that!)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/5af8nm.png\u0022 alt=\u00225af8nm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStaging as follows:\u003C/p\u003E\u003Cp\u003EStage 0: Top decoupler\u003C/p\u003E\u003Cp\u003EStage 1: \u0022Skipper\u0022 engine\u003C/p\u003E\u003Cp\u003EStage 2: Decoupler under said engine and the 6 Sepatron I\u0027s\u003C/p\u003E\u003Cp\u003EStage 3: The 12 Launch Stability Enhancers\u003C/p\u003E\u003Cp\u003EStage 4: The 7 \u0022Mainsails\u0022\u003C/p\u003E\u003Cp\u003EOnce again, drag the whole thing into the \u0022Subassambly Drop Zone\u0022 and call it something. (Different from the previous one!)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-23T19:58:09Z\u0022 title=\u002203/23/2014 07:58  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 23, 2014\u003C/time\u003E by Starwhip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pethock","CreatedById":106559,"CreatedDateTime":"2014-03-23T19:52:14Z","Content":"\n\u003Cp\u003EJust completed the docking parts you have up so far and successfully made my first connection!! Excellent tutorial and easy to follow (especially with the pictures)!\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-23T20:01:44Z","Content":"\n\u003Cp\u003EThanks! I hoped it would help some people. With some practice it becomes nearly automatic. I had some trouble remembering to hit \u0027f1\u0027 for screenshots because I was practically in autopilot. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGoing to be a little bit of a pain to do that station again, but I\u0027ll pull through.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-23T22:37:13Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #5: First Module\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOkay, so, this is the first module of the \u003Cem\u003ESpirion Station Mark II\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/4v5tec.png\u0022 alt=\u00224v5tec.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDirections for build: (From top down)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Shielded Docking Port\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter\u003C/p\u003E\u003Cp\u003E1x FL-R1 RCS Fuel Tank\u003C/p\u003E\u003Cp\u003E4x Gigantor XL Solar Array (Vertical, attached to the center of the RCS tank)\u003C/p\u003E\u003Cp\u003E1x Mobile Processing Lab MPL-LG-2 (FOR SCIENCE!)\u003C/p\u003E\u003Cp\u003E1x Hitchhiker Storage Container\u003C/p\u003E\u003Cp\u003E4x Z-400 Rechargeable Battery (Bottom of Hitchhiker container)\u003C/p\u003E\u003Cp\u003E1x Communotron 88-88 (Bottom of Hitchhiker container)\u003C/p\u003E\u003Cp\u003E1x RC-L01 Remote Guidance Unit\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port\u003C/p\u003E\u003Cp\u003ENow, go to the Subassemblies tab. Click on the \u003Cem\u003EKitan I\u003C/em\u003E or whatever you named it, and attach it to the bottom of the module. Name the entire thing, \u0022Spirion Station II-I\u0022, corresponding to Module I.\u003C/p\u003E\u003Cp\u003EDON\u0027T FORGET TO SAVE!\u003C/p\u003E\u003Cp\u003ENow, I assume you know how to launch something. Go ahead and stick the thing in an orbit of approximately 140 Km (140,000 meters). Make it as circular as possible. Transfer whatever RCS is in the stage with the engine to the tank on the module by ALT-Right clicking on both fuel tanks and selecting \u0022In\u0022 on the module\u0027s fuel tank. Decouple the module and deorbit the extra stage (the one with the engine on it.)\u003C/p\u003E\u003Cp\u003EPresto, your first module is now in orbit!\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-23T23:02:49Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #6: RCS Tugs - Function and Design\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/nzgflt.png\u0022 alt=\u0022nzgflt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERCS tugs are essentially the replacements for robotic arms on stations to move modules around. I had never incorporated one before, but \u003Cem\u003Emy Kod\u003C/em\u003E they are really great to have around. I didn\u0027t install one myself until later in the process, but now would be a great time to do so in the tutorial.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBasic Function\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELet\u0027s say you accidentally put that fuel tank on backwards, or some part is rotated awkwardly. (BOTH happened to me when I was building the darn thing). RCS tugs let you reposition a piece in orbit with minimal effort. They can move pieces much heavier than themselves because they are equipped with many RCS thrusters and reaction wheels, enabling them to keep themselves straight whilst thrusting laterally and carrying a load.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDesign\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe \u003Cem\u003ESpirion\u003C/em\u003E\u0027s RCS tug has a Senior port and a normal (1.25 meter) one, connected by an adapter. It comes equipped with 2 large ASAS modules for torque, and 4 RCS thruster blocks, combined with 8 of the lateral thrusters. It can easily move modules around for reconfiguration or docking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/5pj7fo.png\u0022 alt=\u00225pj7fo.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the tug in the VAB. It consists of these parts.\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Docking Port\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter 02\u003C/p\u003E\u003Cp\u003E1x FL-R1 RCS Fuel Tank\u003C/p\u003E\u003Cp\u003E4x PB-NUK Radioisotope Thermoelectric Generator (Rotate them with the WASD keys to fit them as shown)\u003C/p\u003E\u003Cp\u003E1x Advanced SAS Module, Large\u003C/p\u003E\u003Cp\u003E1x RC-L01 Remote Guidance Unit\u003C/p\u003E\u003Cp\u003E4x RV-105 RCS Thruster Block\u003C/p\u003E\u003Cp\u003E1x FL-R1 RCS Fuel Tank\u003C/p\u003E\u003Cp\u003E4x PB-NUK Radioisotope Thermoelectric Generator\u003C/p\u003E\u003Cp\u003E1x Advanced SAS Module, Large\u003C/p\u003E\u003Cp\u003E8x Place-Anywhere 7 Linear RCS Port (Center of the two SAS modules)\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port\u003C/p\u003E\u003Cp\u003EStick another \u003Cem\u003EKitan I\u003C/em\u003E lifter on it. Rendezvous with the station. However, you do not need to dock yet. Decouple the tug. Right-click on the Senior docking port on the tug, and select \u0022Control from Here\u0022. Now, dock with the station using the tug\u0027s RCS. Deorbit the leftover stage.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-23T23:36:08Z","Content":"\n\u003Cp\u003ELOL, for the next tutorial I had to literally disassemble my station. I decided to reverse-engineer it rather than build it because it\u0027s easier. And faster.\u003C/p\u003E\u003Cp\u003EThere is something rather disconcerting about solar panels spinning away into space. Kudos goes to that RCS tug. Disassembled the whole thing in around 10 mins.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-03-23T23:51:02Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #7: Finishing\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E Spirion Station Mark II\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe moment(s) you\u0027ve all been waiting for! This last (Maybe the last one. Unless people ask for more) tutorial will give you the building instructions for the final modules. Hope you\u0027ve learned quite a bit about station building by the end of this!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECustom Hub\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOk, as you may have noticed, there is a large central \u0022hub\u0022 of Senior-sized ports in the middle of the station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/2mhfsli.png\u0022 alt=\u00222mhfsli.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E1x Protective Rocket Nose Mk7\u003C/p\u003E\u003Cp\u003E4x Sepatron I\u003C/p\u003E\u003Cp\u003E1x Sepatron I (directly above one of the other Sepatrons)\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port (The docking side faces the bottom of the nose cone)\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter\u003C/p\u003E\u003Cp\u003E1x Rockomax HubMax Multi-Port Connector\u003C/p\u003E\u003Cp\u003E4x Rockomax Brand Adapter\u003C/p\u003E\u003Cp\u003E4x Clamp-O-Tron Sr. Docking Port\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port\u003C/p\u003E\u003Cp\u003E16x EAS-4 Strut Connector (look at the pic for reference)\u003C/p\u003E\u003Cp\u003ENow, go into the Action Group editor. To to Custom01, and click on the topmost docking port. Select \u0022Decouple Node\u0022. Then, select the four Sepatrons, and set them to \u0022Activate Engine\u0022. Do the same for the other Sepatron.\u003C/p\u003E\u003Cp\u003EStick a \u003Cem\u003EKitan I\u003C/em\u003E on it. Once you are at about 60,000 meters, hit the \u00221\u0022 key to eject the nose cone. \u003C/p\u003E\u003Cp\u003ERendezvous with the station and decouple the payload. Dock with the payload with the RCS tug, and connect it to the station.\u003C/p\u003E\u003Cp\u003EDeorbit the leftover stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i61.tinypic.com/kbvq55.png\u0022 alt=\u0022kbvq55.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStation so far. Please disregard the thingy docked up top, I forgot to disconnect it when I was screenshotting.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFuel Depot Section 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis is the X200-32 you see on either of the solar array arms.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/10pwu40.png\u0022 alt=\u002210pwu40.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E1x Protective Rocket Nose Mk7\u003C/p\u003E\u003Cp\u003E4x Sepatron I\u003C/p\u003E\u003Cp\u003E1x Sepatron I (Directly above one of the other ones.)\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port (Facing the nose cone)\u003C/p\u003E\u003Cp\u003E1x Rockomax X200-32 Fuel Tank\u003C/p\u003E\u003Cp\u003E1x Advanced SAS Module, Large\u003C/p\u003E\u003Cp\u003E4x RV-105 RCS Thruster Block (Near the bottom of the fuel tank. See above pic)\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port (Facing down)\u003C/p\u003E\u003Cp\u003EDo the same thing with the nose cone as the one above. (Action Group editor.)\u003C/p\u003E\u003Cp\u003EAgain, around 60,000 meters hit \u00221\u0022 to eject the nosecone.\u003C/p\u003E\u003Cp\u003ERendezvous and decouple. Dock the tug and stick the module on the hub, on one of the lateral ports. (See image below)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i57.tinypic.com/2rz8h2r.png\u0022 alt=\u00222rz8h2r.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESolar Array\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/157ogw1.png\u0022 alt=\u0022157ogw1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EConsists of:\u003C/p\u003E\u003Cp\u003E1x Protective Rocket Nose Mk7\u003C/p\u003E\u003Cp\u003E4x Sepatron I\u003C/p\u003E\u003Cp\u003E1x Sepatron I\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter\u003C/p\u003E\u003Cp\u003E1x Modular Girder Adapter\u003C/p\u003E\u003Cp\u003E1x Modular Girder Segment XL\u003C/p\u003E\u003Cp\u003E1x Modular Girder Adapter\u003C/p\u003E\u003Cp\u003E4x Z-400 Rechargeable Battery\u003C/p\u003E\u003Cp\u003E2x Clamp-O-Tron Jr. Docking Port\u003C/p\u003E\u003Cp\u003E4x Gigantor XL Solar Array\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter\u003C/p\u003E\u003Cp\u003E2x EAS-4 Strut Connector\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port\u003C/p\u003E\u003Cp\u003ELauncher: \u003Cem\u003EKitan I\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESame setup with the Action Groups as before. You may find it easier to set up a separate Group for the solar panels, like Custom02: Extend Panels\u003C/p\u003E\u003Cp\u003ESame as before: Rendezvous, decouple, grab, place, deorbit.\u003C/p\u003E\u003Cp\u003EExtend the panels.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/2nk04qw.png\u0022 alt=\u00222nk04qw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPut another fuel tank and solar array like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i62.tinypic.com/2mmfnuf.png\u0022 alt=\u00222mmfnuf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESpaceplane/Crew vessel Docking Port Adapter\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/16jr9md.png\u0022 alt=\u002216jr9md.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Shielded Docking Port\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter\u003C/p\u003E\u003Cp\u003E4x Illuminator Mk2\u003C/p\u003E\u003Cp\u003E1x Mk2 Lander-can\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter 02\u003C/p\u003E\u003Cp\u003E1x Modular Girder Segment\u003C/p\u003E\u003Cp\u003E4x SP-L 1x6 Photovoltaic Panels\u003C/p\u003E\u003Cp\u003E1x Rockomax Brand Adapter 02\u003C/p\u003E\u003Cp\u003E1x Clamp-O-Tron Sr. Docking Port\u003C/p\u003E\u003Cp\u003ELauncher: \u003Cem\u003EKitan I\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ERendezvous, decouple. This time, you will have to open the docking port BEFORE YOU DECOUPLE if the piece is not manned. Otherwise, you just complicate the process. Dock with the small end of the RCS tug to the standard docking port, and connect the module like so:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/105czls.png\u0022 alt=\u0022105czls.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd there you have it!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ESpirion Station Mark II\u003C/em\u003E is complete!\u003C/p\u003E\u003Cp\u003EHope you liked this series of tutorials. Let me know if I need to clarify any parts of it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-24T00:34:18Z\u0022 title=\u002203/24/2014 12:34  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 24, 2014\u003C/time\u003E by Starwhip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-03-24T19:35:12Z","Content":"\n\u003Cp\u003EVery clear guide. Well done!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-04-02T17:04:23Z","Content":"\n\u003Cp\u003EHi Starwhip, great tutorial!\u003C/p\u003E\u003Cp\u003EI\u0027ve stickied this so it can help players reach the asteroids, if you can add a part specifically for that it\u0027d be fantastic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-02T17:17:15Z","Content":"\n\u003Cp\u003EAhh what? ARM is out?! Gaaahhh!\u003C/p\u003E\u003Cp\u003EIt\u0027s going to take a while for me to even \u003Cem\u003Eget\u003C/em\u003E that update. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut when I do I will most definitely make a tutorial for asteroid redirect.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-02T18:06:50Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EIn Progress:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #8: SLS Introduction\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #9: Basic Theory of Asteroid Rendezvous\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #10: The \u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAsteroid Redirect Mission\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #11: Design of the K.S.S. \u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ENew Horizons\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #12: Asteroid Rendezvous\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #13: Redirection\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-04-03T22:54:15Z","Content":"\n\u003Cp\u003EI\u0027m enjoying your tutorials and your sample craft. I especially like the RCS tug, I plan to use this design for my next station. I\u0027ve also made a smaller version of it using the 1.25m parts, with a standard port on one end and a Jr. on the other. Much handier than previous tug designs I\u0027d used.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-07T13:22:45Z","Content":"\n\u003Cp\u003ESo, I got ARM the other day. Need to experiment a little bit. But I am already working on the next tutorials, so stay tuned!\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-04-08T21:10:50Z","Content":"\n\u003Cp\u003EVery nice starwhip. Good to see someone \u003Cem\u003Ewriting\u003C/em\u003E a lengthy tutorial instead of videoing all the time.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-04-09T01:22:17Z","Content":"\n\u003Cp\u003EGreat tutorial. I made my tug with snr docking ports on either end and two standard and two jnr on cardinal points in the middle. Enough RCS ports and torque and it doesn\u0060t care which way it is pointing, it will just grab anything and move it where you want it with no compatibility issues. Some of them have a small fuel tank and some radial liquid engines. Gives about 300 Dv with a medium sized station part. You can deorbit things with those ones...\u003C/p\u003E\n"},{"CreatedByName":"Bananamoose","CreatedById":108579,"CreatedDateTime":"2014-04-14T03:26:55Z","Content":"\n\u003Cp\u003ELurked around the forums for a long time, but made an account to post here.....just wanted to say that its an awesome thing you are doing for new folks here Starwhip. People that take time out of their day to write up a fantastic tutorial like this deserve a pat on the back! Keep them coming!\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-14T11:23:55Z","Content":"\n\u003Cp\u003EPlease excuse my lack of pictures so far. I\u0027ll add them in later. (When I have them; my saves are in another computer!)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESECTION II:\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/2n99qfq.png\u0022 alt=\u00222n99qfq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETutorial #2-1: SLS Introduction\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ELet me come out by saying that these new parts are \u003Cem\u003Einsane.\u003C/em\u003E With over twice the thrust of a Mainsail, that new quad engine unit is great for all heavy lifting needs. Which you are going to have a lot of, if you plan to divert E-Class asteroids...\u003C/p\u003E\u003Cp\u003EThe new size-3 parts let you launch all those massive creations into orbit with less parts and more stability. Rockomax-size payloads are now commonplace in my instance of Kerbin\u0027s SOI, bringing NERVA\u0027s and \u0022Klaws\u0022 to the asteroids like never before. Over the next few tutorials, I will guide you in your quest to save (or even destroy!) Kerbin with your will. Stay tuned!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-15T12:24:55Z\u0022 title=\u002204/15/2014 12:24  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 15, 2014\u003C/time\u003E by Starwhip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-14T11:25:12Z","Content":"\n\u003Cp\u003EAack, double post... I\u0027ll use this one for the next tutorial.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-14T11:30:31Z\u0022 title=\u002204/14/2014 11:30  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 14, 2014\u003C/time\u003E by Starwhip\u003C/strong\u003E\n\u003C/span\u003E\n"}]}