{"TopicId":66511,"ForumId":36,"TopicTitle":"Walking, Flying, Custom Replica T-Rex Mech[.23.5]","CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-03-22T21:45:30Z","PageNum":5,"Articles":[{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-21T02:44:04Z","Content":"\n\u003Cp\u003ESo it\u0027s hard to tell whats happening here. But by moving the parts around in unity I have been able to get the IR plugin to move my parts. The COM of the part is still in the middle, but they rotate correctly. Good news for walking. Obviously the robotics still need to be tweaked\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-22T22:09:00Z\u0022 title=\u002204/22/2014 10:09  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 22, 2014\u003C/time\u003E by clown_baby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-04-21T12:39:36Z","Content":"\n\u003Cp\u003EThat is awesome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E:D:D:D\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-21T17:17:36Z","Content":"\n\u003Cp\u003ESo the legs are done. I need to finish the custom hip, then the the body itself is pretty much done. The tail needs to sway back and forth and the elbows animated, but I\u0027m going back to the scythe engines because I want to see this thing fly.\u003C/p\u003E\u003Cp\u003EI\u0027ve also been loading torque wheels into everything. The body, tail, and upper leg all have torque wheels now. I also need to make the toes claws bigger.\u003C/p\u003E\u003Cp\u003EHere the hip joint is stock so it isn\u0027t very strong, hence the extra movement. Also I sped the robotics up to get a couple walk cycles into the gif. Here only the hip and foot are moving, but the knee and lower knee can also rotate.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://giant.gfycat.com/AdeptUncommonAtlanticblackgoby.gif\u0022 alt=\u0022AdeptUncommonAtlanticblackgoby.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe foot stabilizers also lower now. I hope you guys dig it all so far.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://fat.gfycat.com/MealyDisastrousAzurevasesponge.gif\u0022 alt=\u0022MealyDisastrousAzurevasesponge.gif\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-21T17:22:09Z\u0022 title=\u002204/21/2014 05:22  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 21, 2014\u003C/time\u003E by clown_baby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-22T19:03:40Z","Content":"\n\u003Cp\u003EWell I finished the body yesterday. It\u0027s sent off to a couple guys who are gonna try and make it walk so hopefully we\u0027ll see some progress there. I thought it would by flying now but it turns out all the mechanics in the arms have to be ir, I can\u0027t just animate them in blender. But I\u0027m off to work and I\u0027ll probably jam it out there.\u003C/p\u003E\u003Cp\u003EI\u0027ve started messing with the particle emitter and now I\u0027m confident the cannon will shoot some kind of laser beam. It may even be able to emit a force field like the one in the cartoon if you ever saw that. I just need to figure out how to call the animation, as right now its constantly running.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tM3m52x.png\u0022 alt=\u0022tM3m52x.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-22T20:31:08Z\u0022 title=\u002204/22/2014 08:31  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 22, 2014\u003C/time\u003E by clown_baby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-04-23T00:35:32Z","Content":"\n\u003Cp\u003Eclown dude, I downloaded the files you linked, and im a little lost as to where to put them.... I stuck both folders in my gamedata folder and moved the craft file to the ships folder, and ksp wouldn\u0027t launch at all. I deleted the macosx folder, and I was able to load ksp successfully. also when I opened your craft file, it loaded properly but my game started lagging hardcore as well. I tried loading it with .23.5 and I get the same result, hardcore lag both in the vab and on the runway (.23.5 is super smooth for me). a low res pack would be nice. \u003C/p\u003E\u003Cp\u003Eotherwise, it looks like I have enough to work with to make this thing walk, once we get this lagging issue sorted out.\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-23T00:43:35Z","Content":"\n\u003Cp\u003EI doubt it is about the texture though.\u003C/p\u003E\n"},{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-04-23T00:50:14Z","Content":"\n\u003Cp\u003Eor too many polygons or something... I tried putting it together piece by piece from scratch, and it gets noticeably more laggy every time I add another piece\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-23T00:56:38Z","Content":"\n\u003Cp\u003EYep, polys.\u003C/p\u003E\n"},{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-04-23T00:59:30Z","Content":"\n\u003Cp\u003Ewhats weird is that after I had the thing sitting on the runway for a bit, the performance went up to normal, but no such luck in the vab, even with settings turned way down.\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-23T01:45:17Z","Content":"\n\u003Cp\u003EOh maybe not. While lagging, check the debug, it might be piling up with stacks\u003C/p\u003E\n"},{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-04-23T01:54:28Z","Content":"\n\u003Cp\u003Ehow do I do that, and how do I fix it?\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-23T02:04:57Z","Content":"\n\u003Cp\u003Ewhoah. sorry I missed all this. First, there was only one folder in the .zip called berserk fury. that should have gone in your game data folder, and the .craft where ever you want.\u003C/p\u003E\u003Cp\u003EI know its not buttery smooth, but for me on my ****ty macbook its playable. It isn\u0027t any worse than when I build a large ship. My gundam lagged way more. I have the graphics all the way up and its ok, but at 50% its just fine. I know it can be de-detailed but that\u0027ll be last if necessary. You can see in the running gif I made it moves pretty good in those 11 seconds. That video isn\u0027t sped up.\u003C/p\u003E\u003Cp\u003EAnd blackheart is right, it throws a bunch of errors when debugged but it still loads fine for me. The errors just say it can\u0027t calculate drag from some meshes. Which I assume are like the teeth and what not.\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-23T02:04:59Z","Content":"\n\u003Cp\u003ECheck it first, alt\u002Bf12 and see debug\u003C/p\u003E\u003Cp\u003EEdit: oh, there you go, it does. lol\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-23T16:34:16Z","Content":"\n\u003Cp\u003EHah, yeah, it flies.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wybiPmW.png\u0022 alt=\u0022wybiPmW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut not well. Couple things I could use some advice on. First and foremost, IR joints. I thought breaking force and torque being cranked up would do the trick, but it didn\u0027t. I\u0027m pretty sure this is a well known problem, but I really need them strenghtened. Does anyone know what \u0022joint damping\u0022 does?\u003C/p\u003E\u003Cp\u003EI have made the arm and engine mass low so they work alright when extending, but as soon as the engines turn on they turn into noodles. As I type this I just realized it might just have to come down to quantum struts.\u003C/p\u003E\u003Cp\u003EAnd I need the engine to rotate. I\u0027m trying to add the engine module to an IR configuration, but nothing yet. Anyone know anything about combining two .cfgs into one essentially?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Digh31D.png\u0022 alt=\u0022Digh31D.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-23T16:37:33Z\u0022 title=\u002204/23/2014 04:37  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 23, 2014\u003C/time\u003E by clown_baby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-23T16:36:14Z","Content":"\n\u003Cp\u003EIf you mean wobble, the nodes are what determines how strong their connections are methinks, try making it 3 instead of 1.\u003C/p\u003E\n"},{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-04-23T20:24:14Z","Content":"\n\u003Cp\u003EI\u0027m gonna try it rightnow, I\u0027ll post what I got\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-23T21:07:51Z","Content":"\n\u003Cp\u003EBlackheart that seems to have worked. You have any idea why it might move around on the runway? I thought it was parts colliding, but I\u0027ve put allow collisions for all parts. I might go back and remove the mesh collider for all overlapping parts in unity. \u003C/p\u003E\u003Cp\u003EAnyway, check this out, the arms have to be tweaked to find the COM before it will fly however. Hopefully gifs later\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jPIYGkk.png\u0022 alt=\u0022jPIYGkk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe scythes have to be made symmetrical.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kUPG2yL.png\u0022 alt=\u0022kUPG2yL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IM5B4WU.png\u0022 alt=\u0022IM5B4WU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe blades have to be attached via nodes, not surface attach so they don\u0027t leave the engine. That will be interesting. Break time now though\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-23T23:06:00Z","Content":"\n\u003Cp\u003ECombo of IR and my animations. This is full graphics, it\u0027s smoother in game. Recording kills my fps. I\u0027m done for the day amigos. Flying tomorrow\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://giant.gfycat.com/HonestThirdDinosaur.gif\u0022 alt=\u0022HonestThirdDinosaur.gif\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-23T23:08:13Z\u0022 title=\u002204/23/2014 11:08  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 23, 2014\u003C/time\u003E by clown_baby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-24T02:43:37Z","Content":"\n\u003Cp\u003EWhat do you mean moving around?\u003C/p\u003E\n"},{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-04-24T06:55:48Z","Content":"\n\u003Cp\u003Eit will slide when you\u0027re standing on the runway, like it was standing in ice!\u003C/p\u003E\u003Cp\u003EIt happens after you move a little, not just after you launch\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-24T07:48:33Z","Content":"\n\u003Cp\u003ETha\u0027s odd. Is there a module for landing legs? try adding that lol\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-24T12:49:44Z","Content":"\n\u003Cp\u003EThat\u0027s correct. Rillz said it was like his was on a turntable. Mine doesn\u0027t do it anymore but apparently its still happening. The feet are mumechservos so they can move, so I have to figure out how to combine the landing gear module.\u003C/p\u003E\u003Cp\u003EOn the flying front, I flew it up to the helipad last night\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-24T20:29:35Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JIkPa1m.png\u0022 alt=\u0022JIkPa1m.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA realistic amount of fuel just gets it up there from the rocket platform. There might be a version with like a nuclear reactor or something that allows it to go further. The blades aren\u0027t on the engines because I\u0027m reworking them to avoid contact with the ground\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-24T20:38:13Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Q0dalid.png\u0022 alt=\u0022Q0dalid.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHigh altitude test is 1200m\u003C/p\u003E\u003Cp\u003EEdit: I\u0027m also thinking about how to design winglets to pop out of the last tail section. If anyone feels like helping me out in blender it would be much appreciated. I know how to tweak things that are already built, I\u0027m not necessarily creative enough to design something like that\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T21:18:15Z\u0022 title=\u002204/24/2014 09:18  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by clown_baby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-04-24T22:34:04Z","Content":"\n\u003Cp\u003EWorking with this massive lag in the VAB, and having to wait a half a minute to start moving after launch is tedious, and making everything harder!\u003C/p\u003E\u003Cp\u003EAnyway, in order to walk it needs 2 things: GRIP in the legs, and a lot more TORQUE near the COM!\u003C/p\u003E\u003Cp\u003EThe grip might be hard..., atm I\u0027m trying my best adding wheels to the legs, but more SAS would be very welcome =)\u003C/p\u003E\u003Cp\u003EI guess it\u0027s just changing a number in the CFG, but I\u0027ve never did it myself..., anyway, I\u0027ll try to do it tomorrow!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XfMNWpB.jpg\u0022 alt=\u0022XfMNWpB.jpg\u0022\u003E\u003C/p\u003E\n"}]}