{"TopicId":66740,"ForumId":34,"TopicTitle":"B9 5.0 pre-release (with download)","CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-03-25T18:59:05Z","PageNum":13,"Articles":[{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-07-27T20:24:55Z","Content":"\n\u003Cp\u003EIs there any way I could help you all with releasing B9? It\u0027s been way too long since it was updated, and it\u0027s my favorite spaceplane mod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I can test both on 64bit and 32bit (Win8 and Win7, respectively).\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-07-30T14:23:03Z","Content":"\n\u003Cp\u003EGoing over the older B9 IVAs and slotting in my new props\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/86LVU\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThe action group buttons on the right I\u0027m not 100% sure about the arrangement off, but sadly 10 doesn\u0027t split into 3/4 even groups, just 2, 2x5 doesn\u0027t fit without adjusting the IVA\u0027s model, oh and those action group buttons are from ASET, I\u0027ll make my own version that looks a bit more B9.\u003C/p\u003E\u003Cp\u003EAlso going to replace one of those side brake buttons with an abort button.\u003C/p\u003E\n"},{"CreatedByName":"TronX33","CreatedById":109784,"CreatedDateTime":"2014-07-30T16:52:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003EGoing over the older B9 IVAs and slotting in my new props\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes this mean you are going to add an IVA for the Big cockpit that\u0027s designed for use with the HL fuselage section? Because right now it uses the big gray useless can IVS from the stock MK3 cockpit\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-07-30T16:55:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Engineer\u0022 data-cite=\u0022The Engineer\u0022\u003E\u003Cdiv\u003EDoes this mean you are going to add an IVA for the Big cockpit that\u0027s designed for use with the HL fuselage section? Because right now it uses the big gray useless can IVS from the stock MK3 cockpit\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Mk5? yeah I have plans for it, though not very soon, S3 is higher priority, especially with the HL sized cockpit coming along.\u003C/p\u003E\u003Cp\u003EProblem with the mk5 is that it needs quite a lot of tweaking to work well, if left alone those tiny windows have near no visibility.\u003C/p\u003E\n"},{"CreatedByName":"falken","CreatedById":17316,"CreatedDateTime":"2014-07-30T17:15:22Z","Content":"\n\u003Cp\u003EGood to see the progress!\u003C/p\u003E\u003Cp\u003EIs there any plans for there to be a B9 capsule? Just curious.\u003C/p\u003E\n"},{"CreatedByName":"JorusAton","CreatedById":111385,"CreatedDateTime":"2014-07-30T18:34:32Z","Content":"\n\u003Cp\u003EWill you be texturing all the parts that are missing textures? Many have just solid black for the heat shields, etc. I\u0027ve always hoped someone would pretty those up :-)\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2014-07-30T19:08:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003EThe Mk5? yeah I have plans for it, though not very soon, S3 is higher priority, especially with the HL sized cockpit coming along.\u003Cp\u003EProblem with the mk5 is that it needs quite a lot of tweaking to work well, if left alone those tiny windows have near no visibility.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Euhm also there still is TouhouTorpedos Mk3 IVA which works well with the stock Mk3 and also the B9 Mk5. \u003C/p\u003E\u003Cp\u003Ei\u0027m not sure if TT is still doing his mods or if he\u0027s still doing the \u0022no curseforge\u0022 thing.\u003C/p\u003E\u003Cp\u003EEDIT: nevermind. TT still doesn\u0027t want to release his mods because of squads decision on deleting spaceport. sorry\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-07-30T20:10:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022falken\u0022 data-cite=\u0022falken\u0022\u003E\u003Cdiv\u003EGood to see the progress!\u003Cp\u003EIs there any plans for there to be a B9 capsule? Just curious.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m always making progress, fast or slow, but I\u0027ve been focusing on learning how to make my own props and similar small detail/backend stuff for a while now, that when assembled looks nice, but during is kinda impossible to showcase. We might made a pod especially with the HX series parts being focused on rockets/stations/station sized rockets\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JorusAton\u0022 data-cite=\u0022JorusAton\u0022\u003E\u003Cdiv\u003EWill you be texturing all the parts that are missing textures? Many have just solid black for the heat shields, etc. I\u0027ve always hoped someone would pretty those up :-)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBac9 drew the heat tiles on the other parts \u003Cstrong\u003Eby hand\u003C/strong\u003E and it took him ages to do, I could copy-paste tiles between parts but the problem is the edges, and non square geometry etc, I can put heat-tiles on a cylinder or rectangle, but when we get to complex geometry it gets tricky, time consuming an well, hard. It\u0027s like bricks, can\u0027t just draw a line straight through the tiles when you get to an angle, you need special pieces and oblique angles etc:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://communicatescience.com/zoonomian/wp-content/uploads/2013/01/IMG_0668_2.jpg\u0022 alt=\u0022IMG_0668_2.jpg\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AntiMatter001\u0022 data-cite=\u0022AntiMatter001\u0022\u003E\u003Cdiv\u003Euhm also there still is TouhouTorpedos Mk3 IVA which works well with the stock Mk3 and also the B9 Mk5. \u003Cp\u003Ei\u0027m not sure if TT is still doing his mods or if he\u0027s still doing the \u0022no curseforge\u0022 thing.\u003C/p\u003E\u003Cp\u003EEDIT: nevermind. TT still doesn\u0027t want to release his mods because of squads decision on deleting spaceport. sorry\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah I know it works technically speaking, but the IVA doesn\u0027t line up with the external model, you can see the clipping geometry and all, same result as the stock Mk1 cockpit IVA on the S3 cockpit, you can apply any IVA to any part with kerbals, doesn\u0027t mean it fits.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-30T20:13:01Z\u0022 title=\u002207/30/2014 08:13  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 30, 2014\u003C/time\u003E by K3|Chris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2014-07-31T11:25:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003E...oh and those action group buttons are from ASET, I\u0027ll make my own version that looks a bit more B9...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d say they actually mesh pretty well, thanks to the blue accents within the existing IVA.\u003C/p\u003E\n"},{"CreatedByName":"Joshwoo70","CreatedById":111345,"CreatedDateTime":"2014-07-31T11:48:21Z","Content":"\n\u003Cp\u003EWhy are we not getting a B9 release yet? *looks at watch*\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-07-31T12:10:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SufficientAnonymity\u0022 data-cite=\u0022SufficientAnonymity\u0022\u003E\u003Cdiv\u003EI\u0027d say they actually mesh pretty well, thanks to the blue accents within the existing IVA.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah but ASET is a absolutely massive props pack with props I mostly don\u0027t like the look off, or rather I like the look but it mostly doesn\u0027t mesh well with B9, B9 is gray and orange/blue and has scraped corners and baked normals and similar texture wizardry like baked ambient occlusion to make it feel like beaten up fairly realistic metal, ASET is whites and flat shiny surfaces with no ambient occlusion or grime/scratches at all making it feel pretty plastic and clean, I don\u0027t mind that look but it doesn\u0027t mesh with B9, I originally wanted to use a lot of ASET props but when I got those into the B9 IVAs next to stock props (black, clean shiny analog stuff) b9\u0027s \u0022fake\u0022 props (gray, blue, orange, diagonal silkscreens semi-grime metallic) it was such a visual mess, look at the earlier pictures in the thread, so I decided to turn b9\u0027s \u0022fake\u0022 props into real props and remove the stock and ASET props.\u003C/p\u003E\u003Cp\u003EI\u0027m using JSI aka RPM to make my props and using the ASET ones as reference for the \u0022programming\u0022 part\u003C/p\u003E\u003Cp\u003EQuick overview of my M27 changes, I finally figured out how to manipulate the original meshes of the existing B9 IVAs, (without murdering the normals and without re-building all the unity assemblies etc) my aim is to clean them up a bit, replace \u0022fake\u0022 props with working props, slot in MFDs in ways that makes a bit more sense than the old setup, Mihara author of RPM slotted in MFDs around the B9 geometry basically because he could edit the props but not the models, giving him some hard restrictions, I can edit the models and props.\u003C/p\u003E\u003Cp\u003EI\u0027ve made some of my own props, but I\u0027m going to make more, main ones are digital fuel gauges like ASET ones but more \u0022B9\u0022 looking and I want horizontal ones as well as vertical. I need to make an abort button preferably with a cover similar to the ASET one as well. And as said action group buttons. I\u0027m going to need some light buttons as well, adding toggle-able light levels to all the b9 IVAs.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/bkdow\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst and foremost I\u0027ve moved the front seat, it\u0027s a bit hard to explain in words so picture time:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lwNeaAN.png\u0022 alt=\u0022lwNeaAN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOrange is old head/vision cone, blue is new, reason for moving the seat is that the M27\u0027s main feature is it\u0027s visibility, the old seat position rendered the side windows pretty oblique up to the side, you can\u0027t see sideways and you can\u0027t see down through them, I replaced the 4 tiny MFDs in front of you with 2 larger ones and 2 small ones on the \u0022corners\u0022 of the cage around you, missing some backing pieces for the buttons etc. Pedals and joystick added (might make an alternate joystick design that\u0027s less \u0022airplane\u0022 and more \u0022spaceship\u0022).\u003C/p\u003E\u003Cp\u003EWhat do you think about the 5 \u0022main function\u0022 buttons between the MFDs?\u003C/p\u003E\u003Cp\u003EWhat do you think about the 5x2 action group buttons? Vs \u00223x3\u002B1\u0022 on the rear seat? (Missing backing plate obviously).\u003C/p\u003E\u003Cp\u003EWhat do you think about the MFDs in the corners? I put em there because you might want more than 2, but you can\u0027t really fit more than 2 in front of you without obscuring vision badly, though I\u0027m considering putting 2 to the left and right of you, like it\u0027s done in elite kinda.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/zhMiL\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ERear seat has 3 big MFDs instead of 4 small, at least one brake button to the side will be replaced by an abort button still where it was before. You can see the door handles on the doors that when double clicked makes you EVA (might make my own B9 looking version of those). Adding EVA ladders and doors to those doors on the external model as well, though sadly KSP sends you out the first door when you EVA, can\u0027t tell which of multiple doors to pick based on any criteria (as far as I can tell) but you can at least enter the pod through the side doors.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/qr3wR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ESome pictures of the double click window angles, there are 3, forward, 45 degrees down, 90 degrees up. Basically you kerbal is mashing his face against the glass.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joshwoo69\u0022 data-cite=\u0022Joshwoo69\u0022\u003E\u003Cdiv\u003EWhy are we not getting a B9 release yet? *looks at watch*\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027re working on it, but IRL ruined our \u0022day after .24\u0022 release plans, all 3 of us got pretty major IRL:ism for a while, and lets face it, we\u0027re doing this on our free time, B9 is complex enough to make retooling it and updating it and making new content for it pretty time consuming, it\u0027s deceptively time consuming to make content like this, especially IVAs because it\u0027s not just modeling something, you need to make it work in an ergonomic sense, you have to be able to see and use it, the location of the kerbals inside the pod has to work on several levels etc.\u003C/p\u003E\u003Cp\u003EAnd the excel spreadsheet Tav has of the costs and their needed adjustments... man I don\u0027t envy him.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-31T12:15:54Z\u0022 title=\u002207/31/2014 12:15  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 31, 2014\u003C/time\u003E by K3|Chris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2014-07-31T12:30:45Z","Content":"\n\u003Cp\u003E@K3|Chris\u003C/p\u003E\u003Cp\u003EThat\u0027s very nice; it looks like it should be pretty easy to fly that IVA-only. My one criticism is that we\u0027ve lost the central monitor in the front seat (dead centre always seemed like the logical place to put a PFD). Any chance of a HUD? Dodgy mockup included below:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/keVeYFH.jpg\u0022 alt=\u0022keVeYFH.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-07-31T12:36:21Z","Content":"\n\u003Cp\u003EYeah I\u0027m adding toggle-able huds to all the IVAs, I just need to re-tool the HUD, I\u0027m not a fan of the \u0022stock\u0022 RPM one, it\u0027s overly busy with most of the information not labeled etc. I might start off by including the stock RPM HUD \u0022UI\u0022 on my own props that slide/flipup/ flipdown/turn on/off etc. Then when done swamp in my own HUD \u0022UI\u0022 on the same prop.\u003C/p\u003E\u003Cp\u003EOne center MFD is nicer in some ways but it means you either have to have 1, or 3, 3 doesn\u0027t really fit without making them smaller, also not sure about the angle, if you look down to frame the MFDs in the center of your vision they\u0027re straight-on, but as you can see if you zoom out and keep your vision straight forwards they look a bit angled (it\u0027s a fish-eye effect I\u0027m not a fan off).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-31T13:38:00Z\u0022 title=\u002207/31/2014 01:38  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 31, 2014\u003C/time\u003E by K3|Chris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2014-07-31T12:51:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003EYeah I\u0027m adding toggle-able huds to all the IVAs, I just need to re-tool the HUD, I\u0027m not a fan of the \u0022stock\u0022 RPM one, it\u0027s overly busy with most of the information not labeled etc. I might start off by including the stock RPM HUD \u0022UI\u0022 on my own props that slide/flipup/ flipdown/turn on/off etc. \u003Cp\u003EOne center MFD is nicer in some ways but it means you either have to have 1, or 3, 3 doesn\u0027t really fit without making them smaller, also not sure about the angle, if you look down to frame the MFDs in the center of your vision they\u0027re straight-on, but as you can see if you zoom out and keep your vision straight forwards they look a bit angled (it\u0027s a fish-eye effect I\u0027m not a fan off).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA more user-friendly HUD would be very welcome - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57603?p=1315958\u0026amp;viewfull=1#post1315958\u0022 rel=\u0022external nofollow\u0022\u003EVexcom\u003C/a\u003E has made some modifications that might be worth looking at if you\u0027re looking for inspiration - it\u0027s still pretty busy but the information seems better labelled than stock (at least, it does to me).\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-07-31T13:32:59Z","Content":"\n\u003Cp\u003EOh and to outline my upcoming plans:\u003C/p\u003E\u003Cp\u003EHL EVA \u002B IVA: external needs some refinements, IVA as well, some other tidying up work needed\u003C/p\u003E\u003Cp\u003ES3 EVA \u002B IVA: it\u0027s a pretty big job, might miss 5.0\u003C/p\u003E\u003Cp\u003EMk5: I need to re-start my work on the modified EVA and added IVA for it, not happy with how far it drifted from the original look, I need to keep the balance closer to the current look, I basically converted it to a generic plane cockpit, not happy with it. (Defiantly missing 5.0).\u003C/p\u003E\u003Cp\u003ES2\u002BMk2 Crew tanks: small polish pass needed\u003C/p\u003E\u003Cp\u003EM27 Cockpit: some additional props/prop placement, small tweaks\u003C/p\u003E\u003Cp\u003EMk2 Cockpit: short term: prop tweaks, long term:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xg67rDA.png\u0022 alt=\u0022xg67rDA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECrude overdraw, blue = windows, purple = potentially removed pillars/window frames.\u003C/p\u003E\u003Cp\u003Emake front visibility better by raising the front seat a bit, adjust the window by add an additional piece of glass front center instead of the current metal behind the hud, make the HUD toggle-able, the goal is to be able to see at least the end of the runway when horizontal at the start of it, needs tweak of the external model to accommodate that additional piece of glass. Props will be moved up/rotated up to make them more visible.\u003C/p\u003E\u003Cp\u003ES2 Cockpit: similar to the Mk2, hopefully I don\u0027t need to modify it too much but forwards visibility is an issue, some of that can be solved by moving the kerbals up a bit but their huge heads with their vision halfway along their head makes kerbals basically fit in IVAs like a human being with a pope-hat. Or a human with their eyes on their chest.\u003C/p\u003E\u003Cp\u003EThis area: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xILL7gF.png\u0022 alt=\u0022xILL7gF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIs a problem, extending the windows down there would be pretty ugly on the outside though.\u003C/p\u003E\u003Cp\u003EIs a bit of an issue, but extending the windows forwards on the external model would be pretty bad for the look, at times I wish you could \u0022cheat\u0022 and disconnect the external model and internal IVA a bit, if you make a kerbal\u0027s head just clear the ceiling of something proportioned like a real plane their center of vision is about in-line with the center of the dashboard, there are only 2 solutions really, make their heads (and internal ceiling) actually protrude outside the external model, you can\u0027t tell from the IVA that\u0027s the case and it doesn\u0027t look weird because we expect them to have human proportions, but it\u0027s strictly speaking cheating, second solution is extend the windows downwards until the kerbals have proper vision, but then you basically have windows going from the top to the center on a 2m sized cockpit, neither solution is perfect, one makes the IVA extend outside the EVA and the other makes the EVA less nice looking.\u003C/p\u003E\u003Cp\u003ESquad are big believers in the first solution btw, most of the stock IVAs can\u0027t fit inside the external models at all, and that mod Mk2 IVA basically puts the kerbal\u0027s head halfway through the canopy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-31T14:07:47Z\u0022 title=\u002207/31/2014 02:07  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 31, 2014\u003C/time\u003E by K3|Chris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-08-01T09:28:50Z","Content":"\n\u003Cp\u003EHeya Chris, I know it might be a bit far too early to ask, but would the new B9 version have compatibility with FAR?\u003C/p\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2014-08-01T09:50:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alewx\u0022 data-cite=\u0022Alewx\u0022\u003E\u003Cdiv\u003EHeya Chris, I know it might be a bit far too early to ask, but would the new B9 version have compatibility with FAR?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPrevious versions have, and I\u0027m pretty sure I recall Bac9 saying that the new structural parts fly like bricks with FAR, so that sounds about right xD\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-08-01T10:25:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SufficientAnonymity\u0022 data-cite=\u0022SufficientAnonymity\u0022\u003E\u003Cdiv\u003EPrevious versions have, and I\u0027m pretty sure I recall Bac9 saying that the new structural parts fly like bricks with FAR, so that sounds about right xD\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is cool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m really excited about that.\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-08-02T17:12:52Z","Content":"\n\u003Cp\u003EYeah old current and future versions of B9 are tested against FAR (which should make it work in NEAR as well as far as I understand it) pretty sure all 3 of us use it, we test against stock as well obviously to ensure it works as well as it can.\u003C/p\u003E\u003Cp\u003ETook a brave pill today and spent 3h~ turning this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hXHspsy.png\u0022 alt=\u0022hXHspsy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(External shell only, no internal geometry)\u003C/p\u003E\u003Cp\u003EInto this:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/3bL30\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EInternal geometry for the IVA, internal geometry inside the visor.\u003C/p\u003E\u003Cp\u003EThe subsonic windows (front windows usually behind the visor) don\u0027t have heat tiles around them because the visor deflects the heat during supersonic flight and re-entry, just don\u0027t lower the visor during re-entry, ok?\u003C/p\u003E\u003Cp\u003EStill WIP obviously, needs a fair bit of finessing, later UV mapping and texturing, but that\u0027s the easy part. External texture is just a re-map of the current S3\u0027s texture, will make my own more detailed version, external windows will be opaque from the outside obviously, just made em transparent in modo to show the interior from the outside.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-02T17:16:54Z\u0022 title=\u002208/02/2014 05:16  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 2, 2014\u003C/time\u003E by K3|Chris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Eskandare","CreatedById":62742,"CreatedDateTime":"2014-08-02T23:20:22Z","Content":"\n\u003Cp\u003ELooking great, Chris. I look forward to its release.\u003C/p\u003E\n"},{"CreatedByName":"ZewelVonLelek","CreatedById":113624,"CreatedDateTime":"2014-08-03T21:14:01Z","Content":"\n\u003Cp\u003Enice cockpit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-08-04T03:28:14Z","Content":"\n\u003Cp\u003Eoww man how much longer? your killing me with all this awesomeness!\u003C/p\u003E\n"},{"CreatedByName":"Contagano","CreatedById":111364,"CreatedDateTime":"2014-08-05T15:09:00Z","Content":"\n\u003Cp\u003ELooking awesome, cant wait for release! Keep up the good work guys!\u003C/p\u003E\n"},{"CreatedByName":"dreadicon","CreatedById":117295,"CreatedDateTime":"2014-08-05T22:58:57Z","Content":"\n\u003Cp\u003EI am still hoping for a B9 update... It\u0027s gotten to the point where I cant live with or without it... :S I run 30\u002B mods, which run quickly and flawlessly together, just a couple quick tweaks is all they need. But add B9 in and suddenly I spend 10\u002B hours before I get it all running (period), and still run into broken parts, random occasional crashes, and numerous issues all over. Yet, without B9, the game just isnt complete. Spaceplanes practically just dont exist without it once you\u0027ve experienced b9.... Please, I\u0027m not asking for new features; I just want b9 updated for engines, fuselage, and cargo bays... (not that I dont love new features....) It\u0027s been so long, and it\u0027s finally just in need of a complete overhaul. I\u0027d be willing to help overhaul configs and parts if time is tight... been doing it myself for quite some time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-08-05T23:01:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003EYeah old current and future versions of B9 are tested against FAR (which should make it work in NEAR as well as far as I understand it) pretty sure all 3 of us use it, we test against stock as well obviously to ensure it works as well as it can.\u003Cp\u003ETook a brave pill today and spent 3h~ turning this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/hXHspsy.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/hXHspsy.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(External shell only, no internal geometry)\u003C/p\u003E\u003Cp\u003EInto this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/3bL30\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/3bL30\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EInternal geometry for the IVA, internal geometry inside the visor.\u003C/p\u003E\u003Cp\u003EThe subsonic windows (front windows usually behind the visor) don\u0027t have heat tiles around them because the visor deflects the heat during supersonic flight and re-entry, just don\u0027t lower the visor during re-entry, ok?\u003C/p\u003E\u003Cp\u003EStill WIP obviously, needs a fair bit of finessing, later UV mapping and texturing, but that\u0027s the easy part. External texture is just a re-map of the current S3\u0027s texture, will make my own more detailed version, external windows will be opaque from the outside obviously, just made em transparent in modo to show the interior from the outside.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWay too cool!\u003C/p\u003E\u003Cp\u003EJust so you know, you can use \u003Ca href=\u0022https://github.com/Mihara/RasterPropMonitor/wiki/Part-modules#jsitransparentpod\u0022 rel=\u0022external nofollow\u0022\u003EJSITransparentPod PartModule\u003C/a\u003E from the RPM plugin to make internals viewable from outside through windows.\u003C/p\u003E\n"}]}