{"TopicId":67025,"ForumId":39,"TopicTitle":"Channel Art Design Contest! Free Copy of KSP To 1st Place! (Not Assoc With SQUAD)","CreatedByName":"MotoRider42HC","CreatedById":67995,"CreatedDateTime":"2014-03-28T06:44:19Z","PageNum":1,"Articles":[{"CreatedByName":"MotoRider42HC","CreatedById":67995,"CreatedDateTime":"2014-03-28T06:44:19Z","Content":"\n\u003Cp\u003E\nHave a friend who needs copy of KSP but can\u0027t afford it? Maybe you are tired of playing the demo? Enter my contest and see if you can win one!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/rqQLO5kT4C0?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nDuring the last week or so, I have been tirelessly working to separate the video games section of my channel, from the sponsored dirt bikes \u0026amp; automotives sections. I have finished three new title animations, and have created a new ending animation. However, the new channel art that I slapped together is crap, and I really need some professional help on getting it done. Therefore, I am offering a free copy of Kerbal Space Program -or- Space Engineers, gifted through Steam, to the person that creates the most awesome channel art \u0026amp; icon that clearly displays what my channel is all about.\n\u003C/p\u003E\n\u003Cp\u003E\nGuidelines, Templates, Old Channel Art, Etc...\n\u003C/p\u003E\n\u003Cp\u003E\n\\/ \\/ \\/ \\/ \\/\n\u003C/p\u003E\n\u003Cp\u003E\nThe deadline is 10:00pm CST on Sunday, April 13th, 2014\n\u003C/p\u003E\n\u003Cp\u003E\n/\\ /\\ /\\ /\\ /\\\n\u003C/p\u003E\n\u003Cp\u003E\nRules:\n\u003C/p\u003E\n\u003Cp\u003E\n- You must be a subscriber to my youtube channel\n\u003C/p\u003E\n\u003Cp\u003E\n- All the artwork used must be license-free or 100% original\n\u003C/p\u003E\n\u003Cp\u003E\n- The final submission files must be in .xcf (GIMP) format\n\u003C/p\u003E\n\u003Cp\u003E\n- The final submission must also be two .png files that are each under 2Mb for direct upload to youtube\n\u003C/p\u003E\n\u003Cp\u003E\n- Multiple submissions will be rejected, unless you are specifically submitting an update, and say so in the subject line and description\n\u003C/p\u003E\n\u003Cp\u003E\n- The final submission must meet YouTube\u0027s guidelines for minimum safe viewing area, while still giving extra \u0022eye-candy\u0022 for larger screens (this template is included in the download file)\n\u003C/p\u003E\n\u003Cp\u003E\n- Upon transfer of the chosen video game via a Steam gift, the winning artwork(s) will become my sole property and may only be used/reproduced with permission (just to be safe since my channel is monetized)\n\u003C/p\u003E\n\u003Cp\u003E\n- All submissions will be shown on a video (maybe), and therefore must be submitted with the understanding that they will be publicly displayed (with credit given to the author\u0027s steam name)\n\u003C/p\u003E\n\u003Cp\u003E\nSuggestions:\n\u003C/p\u003E\n\u003Cp\u003E\n- as you can tell, I prefer red \u0026amp; black\n\u003C/p\u003E\n\u003Cp\u003E\n- I also prefer the \u002228 Days Later\u0022 font from dafont.com\n\u003C/p\u003E\n\u003Cp\u003E\n- horsepower, speed, adrenaline, aggression\n\u003C/p\u003E\n\u003Cp\u003E\n- dirt bikes \u0026amp; automotives depicted as \u0022opposite\u0022 from video games\n\u003C/p\u003E\n\u003Cp\u003E\n- pay close attention to my three new title animations\n\u003C/p\u003E\n\u003Cp\u003E\n- etc etc etc\n\u003C/p\u003E\n\u003Cp\u003E\nBE CREATIVE AND GOOD LUCK!!!\n\u003C/p\u003E\n\u003Cp\u003E\nCheaters will be disqualified.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-29T05:08:11Z\u0022 title=\u002212/29/2017 05:08  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 29, 2017\u003C/time\u003E by MotoRider42HC\u003C/strong\u003E\n\u003C/span\u003E\n"}]}