{"TopicId":67117,"ForumId":36,"TopicTitle":"[WIP] Kip Engineering: Now updating - Universal Docking Ports","CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-03-29T09:01:06Z","PageNum":1,"Articles":[{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-03-29T09:01:06Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EThis is the thread for all my small projects\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E\u003Cstrong\u003ENow updating:\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EUniversal Docking ports.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF8C00;\u0022\u003E\u003Cstrong\u003ETo-do list:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOptional dorsal, ventral, port and starboard RCS thrusters (maybe)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xX2NmUk.png\u0022 alt=\u0022xX2NmUk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#A52A2A;\u0022\u003E\u003Cstrong\u003EOther projects\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EScience-Bus-a; A Hayabusa-inspired capsule for Kerbin LKO re-entry\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe purpose of this mod will be to carry two science containers from LKO to Kerbin surface. The mod when used will be made up of three parts to decrease physics interactions.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF8C00;\u0022\u003E\u003Cstrong\u003ETo-do list:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProbe part will contain\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EProbe core \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReaction wheels \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESAS \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERCS \u002B Monoproellant \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBattery \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EParachute \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EJr-size Docking port \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAntenna \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOptional DRE config \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EScience container will include\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EScience storage \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe storage part will be attached to the main core in pairs.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EStation hubs.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF8C00;\u0022\u003E\u003Cstrong\u003ETo-do list:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EMinor texture work \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdd Tweakscale functionality (possibly) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERemove :FINAL from Life support MM patch. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-11T05:33:40Z\u0022 title=\u002211/11/2015 05:33  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 11, 2015\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dave7","CreatedById":70552,"CreatedDateTime":"2014-03-29T14:34:21Z","Content":"\n\u003Cp\u003EDoes your small port dock with the other multiports? Just a guess but it sounds like the multiple docking modules are fighting against each other. You may be able to set the acquireForce and acquireTorque config settings to help with that.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-03-29T15:10:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EThe parts dock fine with stock docking ports, but when trying to dock one multiple port to another multiple port the ships just dance around, but never actually dock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E101010101010\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-03-29T17:17:11Z","Content":"\n\u003Cp\u003EI \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/73005\u0022 rel=\u0022external nofollow\u0022\u003Ereleased the parts\u003C/a\u003E anyway. These two problems kind of go hand in hand. It doesn\u0027t make sense to fix one without also fixing the other one. If anyone thinks of something let me know. In the meantime go build some space tugs.\u003C/p\u003E\n"},{"CreatedByName":"PringleMan","CreatedById":1396,"CreatedDateTime":"2014-03-29T21:51:19Z","Content":"\n\u003Cp\u003EI don\u0027t think that the problem will be solved without making a plugin and coding your own transforms for the docking motion in. Which is unfortunate. I still really like them though!\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-03-30T08:12:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PringleMan\u0022 data-cite=\u0022PringleMan\u0022\u003E\u003Cdiv\u003E...coding your own transforms for the docking motion...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027s this?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-30T11:29:23Z\u0022 title=\u002203/30/2014 11:29  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 30, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-03-30T11:29:15Z","Content":"\n\u003Cp\u003ETesting has left me with even more questions than answers.\u003C/p\u003E\u003Cp\u003EI\u0027ve found that multi-node ports can indeed dock and undock. After several seconds of wiggling the ship around the docks finally connected. It looks as if all the nodes that have an equivalent node on the target universal port actually connect. It still takes way too much effort to make it work though. After I docked when I right click it gave me multiple \u0022Undock\u0022 buttons. All of them have to be clicked and then the docks separate.\u003C/p\u003E\u003Cp\u003EI think the only way you wouldn\u0027t be able to undock multi-node docking ports is if they start docked in the VAB or SPH.\u003C/p\u003E\n"},{"CreatedByName":"landeTLS","CreatedById":97925,"CreatedDateTime":"2014-03-30T11:37:46Z","Content":"\n\u003Cp\u003EYour project Looks interesting. Id suggest looking at the kw 3.75m docking port model as it docks both to itself and to 2.5m stock docking ports. I have a quite different dockingport design in the modelling/rigging stage that is going to be adjustable to different sizes(via animations or use of the infernal Robotics plugin). Im kindof worried about how to make that thing work ingame:P\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-03-30T11:45:47Z","Content":"\n\u003Cp\u003EThat KW docking port has only one ModuleDockingNode. It\u0027s nodeType is size2 meaning that, as you said, it\u0027ll dock to itself without hassle and to other 2.5 meter ports. It will not dock to a nodeType size3 docking port.\u003C/p\u003E\u003Cp\u003EBasically it just looks big, but technically it\u0027s a 2.5m part.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-30T11:48:58Z\u0022 title=\u002203/30/2014 11:48  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 30, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"landeTLS","CreatedById":97925,"CreatedDateTime":"2014-03-30T12:53:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EThat KW docking port has only one ModuleDockingNode. It\u0027s nodeType is size2 meaning that, as you said, it\u0027ll dock to itself without hassle and to other 2.5 meter ports. It will not dock to a nodeType size3 docking port.\u003Cp\u003EBasically it just looks big, but technically it\u0027s a 2.5m part.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EO i didnt know that. From the design of the model it looks like it was invisioned to be a double transform docking port but i guess they couldnt figure out how to solve the problem youre facing\u003C/p\u003E\n"},{"CreatedByName":"PringleMan","CreatedById":1396,"CreatedDateTime":"2014-03-30T13:34:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EWhat\u0027s this?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you know how in unity when you are adding the transforms to the model in order to achieve certain behaviors? Like for example the direction of motion that the docking magnetism is supposed to follow. Or with engines, the direction of thrust and particles.\u003C/p\u003E\u003Cp\u003EThe problem is that KSP only has one type of dock, with three different \u0022sizes\u0022 to help the parts distinguish each other. For your universal ports, you would have to write a plugin that either A) Recodes how docking ports work (ouch) or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Write a plugin that allows the part to undock ALL modules docked with it. If the game is not crashing when you have them docked together I don\u0027t think it is really complaining that one part has multiple dock nodes on it, it just is unsure how to control it. I mean the plugin could be as simple as a script to feed the undock command to all three sizes of docking node when you hit the undock button in the UI. Then, until you can get the UI duplication issue sorted out, have the button labeled as \u0022Undock this one\u0022 or something.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-03-30T14:40:41Z","Content":"\n\u003Cp\u003EOption B on it\u0027s own doesn\u0027t fix the problems with docking in the first place, which is the bigger problem.\u003C/p\u003E\u003Cp\u003ESomeone would have to write the plugin for me. One thing that could maybe work is checking the nodeType of the target docking port as soon as magnetism kicks in, and then disable all modules that do not have the same nodeType. I don\u0027t know if that\u0027s possible. I CAN code but i can\u0027t be bothered without official API documentation. It\u0027s too much work having to figure things out for yourself.\u003C/p\u003E\n"},{"CreatedByName":"Matzilla","CreatedById":106111,"CreatedDateTime":"2014-04-02T03:06:29Z","Content":"\n\u003Cp\u003ENot much of a programmer here, but wouldn\u0027t it be fairly simple to have these parts have a single docking node and there own class (ex: 4) so that they could dock with each other universally. They wouldn\u0027t dock with the stock parts but they look so cool I know that I won\u0027t bother using the stock ports if these can freely dock/undock with each other universally. \u003C/p\u003E\u003Cp\u003EJust a thought.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-02T03:45:21Z","Content":"\n\u003Cp\u003EI was aware of this, but I wanted these to be compatible with the stock ones.\u003C/p\u003E\u003Cp\u003EIt\u0027s a good thought; I think I might just include optional cfgs for people who want to play without stock ports.\u003C/p\u003E\u003Cp\u003EYeah. I\u0027ll do that.\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-04-12T10:38:14Z","Content":"\n\u003Cp\u003EFrom the changelog for the structural parts: \u0022- Moved T hub center of mass to be more realistic\u0022\u003C/p\u003E\u003Cp\u003EThis would imply that some mass has been removed from the part of it where the 4th connection would otherwise have been. Now unless that mass was added back in elsewhere in the structure, that implies that removing a connecting surface reduces the mass of the part. So, even if the small 6-way node is the same mass as the stock node (which I think is heavier than it has any right to be, comparing it to other structural components), I\u0027d suggest giving the 4-way, 3-way, and 2-way parts progressively reduced mass.\u003C/p\u003E\u003Cp\u003EIf the 6-way node is 1.5 tons, the 4-way could be 1.25, the T 1.125, and the L and I nodes, 1 ton. Personally I would use no more than 1 ton for the small 6-way node, and the others could be .75, .625, and .5 respectively. I mean, really, how thick does the paneling on top of the internal structural supports have to be? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor the 2.5m and 3.75m versions, I\u0027d stick with simply multiplying the mass by 2 and 3. Someone might make an argument about mass being related to volume which is the cube of the part diameter/length, and that\u0027s true for solids. But if these parts are traversable by kerbals, they are by definition hollow, meaning it\u0027s at most the square of the size (surface area). Further, the main structural strength isn\u0027t going to come from the outside paneling but instead, the beams of metal (or whatever material their internal frame is built from), the mass of which would scale linearly with part size. So the truth would be somewhere between linear and square, probably closer to linear (maybe size ^ 1.25). But most importantly, playability: 9 tons (3 squared) for a 3.75m part that does absolutely nothing other than serve to connect other large parts together would simply not be very usable. That\u0027s something you can technically do with a .125 ton girder segment and a couple of struts, after all.\u003C/p\u003E\u003Cp\u003ESo I\u0027d suggest a simple linear scaling of the masses, for example:\u003C/p\u003E\u003Cp\u003E1.5, 1.25, 1.125, 1.0\u003C/p\u003E\u003Cp\u003E3.0, 2.5, 2.25, 2.0\u003C/p\u003E\u003Cp\u003E4.5, 3.75, 3.375, 3.0\u003C/p\u003E\u003Cp\u003Eor\u003C/p\u003E\u003Cp\u003E1.0, .75, .625, .5\u003C/p\u003E\u003Cp\u003E2.0, 1.5, 1.25, 1.0\u003C/p\u003E\u003Cp\u003E3.0, 2.25, 1.875, 1.5\u003C/p\u003E\u003Cp\u003Efor the small, medium, and large 6, 4, 3, and 2-way parts respectively. Factoring in an exponent of 1.25, 2.0 and 3.0 become approximately 2.5 and 4.0, so for slightly greater realism the last two lines could instead be:\u003C/p\u003E\u003Cp\u003E2.5, 1.875, 1.5625, 1.25\u003C/p\u003E\u003Cp\u003E4.0, 3.0, 2.5, 2.0\u003C/p\u003E\u003Cp\u003EI hope this is at least food for thought, if not helpful or useful. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-12T13:37:59Z","Content":"\n\u003Cp\u003EGreat analysis, thank you. I\u0027ll implement this in the next update. I\u0027m just not sure about the I-Hubs and T-Hubs being lighter than the 6-Hubs of a smaller diameter. Why did you do it like that?\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-04-12T22:43:34Z","Content":"\n\u003Cp\u003EHmm, if you mean the 3.75m I and L parts (the final 2.0 in my last post), I hadn\u0027t really thought about the fact that it made them lighter than the 2.5m 6-way part. Still, I don\u0027t think there\u0027s anything necessarily wrong with that. It could probably be explained by a couple things: the fact that 3.75m parts are only 50% larger than 2.5m parts, and the last post\u0027s reasoning regarding the internal structural members being the majority of the part mass. The internal crew tunnels don\u0027t need to get any wider either, so that\u0027s yet another factor that would scale linearly.\u003C/p\u003E\u003Cp\u003EStill, if the given mass reductions for the less-than-6-way parts seem too great, those amounts *were* pretty much off the top of my head. I was looking for relatively easy numbers that made at least *some* sense. The results of that ended up implying that 3/4 of the part mass was in the internal and external structures of the connection faces, which may be a bit on the high side. But 50 / 6 doesn\u0027t result in easy to work with numbers. Maybe 60% would be more reasonable. That would give the following masses:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EConnections:  6w     X     T      I \u0026amp; L\u003Cbr\u003E(1.25m)       1.0    0.8   0.7    0.6\u003Cbr\u003E(2.5m)        2.5    2.0   1.75   1.5\u003Cbr\u003E(3.75m)       4.0    3.2   2.8    2.4\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThat would result in a much less noticeable difference between the 3.75m I \u0026amp; L parts and the 2.5m 6-way part. Now that I\u0027ve put some thought into that, I think I prefer this set of numbers.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-14T04:29:16Z","Content":"\n\u003Cp\u003EThose look good to me. I\u0027ll use them. Thanks for helping.\u003C/p\u003E\n"},{"CreatedByName":"stoland","CreatedById":104281,"CreatedDateTime":"2014-04-14T06:07:41Z","Content":"\n\u003Cp\u003ELooking good.\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2014-04-14T06:54:25Z","Content":"\n\u003Cp\u003EPossible bug, needs confirmation...\u003C/p\u003E\u003Cp\u003ERealChute does not play nice with the provided plugin, causing the parachute to deploy upon liftoff. Rather frustrating, but not game breaking.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-14T08:26:05Z","Content":"\n\u003Cp\u003ECan you replicate with a clean install with only those two mods?\u003C/p\u003E\u003Cp\u003EI\u0027m not getting this at all.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-14T08:56:28Z\u0022 title=\u002204/14/2014 08:56  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 14, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2014-04-14T17:04:05Z","Content":"\n\u003Cp\u003ENo, it occurred after removing the plugin. False alarm.\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2014-04-15T17:11:23Z","Content":"\n\u003Cp\u003E\u0022We\u0027re giving all that she\u0027s got Captain!\u0022\u003C/p\u003E\u003Cp\u003Ei finally got it working... but it has two of everything in the VAB menu? WTF i\u0027m an idiot for not getting this to work properly!\u003C/p\u003E\n"},{"CreatedByName":"Mokmo","CreatedById":62363,"CreatedDateTime":"2014-04-16T19:22:20Z","Content":"\n\u003Cp\u003EI have the latest version with Toadicus\u0027 plugin.\u003C/p\u003E\u003Cp\u003ESo far all my attempts into docking the 2.5m with the 1.25 stock ports have not worked. No magnets just bouncing off.\u003C/p\u003E\u003Cp\u003EThen i hit escape to write this paragraph, and the magnets kick in... derp. I\u0027ll try to reproduce for ya.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-16T20:31:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AntiMatter001\u0022 data-cite=\u0022AntiMatter001\u0022\u003E\u003Cdiv\u003E\u0022We\u0027re giving all that she\u0027s got Captain!\u0022\u003Cp\u003Ei finally got it working... but it has two of everything in the VAB menu? WTF i\u0027m an idiot for not getting this to work properly!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only way there would be duplicates is if you have more than one part definition. So you must have an old cfg somewhere. The new update has done away with optional configs so if you delete everything in the UnivDockPorts folder and do a fresh install then everything should be fine.\u003C/p\u003E\n"}]}