{"TopicId":67235,"ForumId":34,"TopicTitle":"[1.2.2](Dec10/16) Action Groups Extended: 250 Action Groups, in-flight editing. Now kOS/RemoteTech","CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2014-03-30T15:52:01Z","PageNum":32,"Articles":[{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-23T00:12:26Z","Content":"\n\u003Cp\u003EIt\u0027s currently in the queue.\u003C/p\u003E\u003Cp\u003EI\u0027m working on the next version which will include the momentary action groups at the moment. I currently have my head buried in some remotetech compatibility stuff, but it is coming.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"somewhatcasual","CreatedById":102043,"CreatedDateTime":"2015-02-23T16:05:37Z","Content":"\n\u003Cp\u003EI am having an issue where my action groups are replicating at some point, either after saving or launching and reverting to SPH. I am having to re-do my actions quite frequently during build and test phase of my ship design. Is this a know bug or mod conflict? I\u0027m running mostly USI , and KSPI extended for parts, and the vast majority of the other mods are ones that affect gameplay mechanics, such as your mods or tacls as examples. Any help is greatly appreciated. Thanks\u003C/p\u003E\n"},{"CreatedByName":"novahike999","CreatedById":13803,"CreatedDateTime":"2015-02-23T16:37:52Z","Content":"\n\u003Cp\u003ECould you post some screenies? I think you may be getting confused with some of the features like I did. Although it could be a problem similar to a one that I had if you\u0027re loading up vehicles that had action groups assigned before you installed the mod.\u003C/p\u003E\n"},{"CreatedByName":"somewhatcasual","CreatedById":102043,"CreatedDateTime":"2015-02-23T18:37:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022novahike999\u0022 data-cite=\u0022novahike999\u0022\u003E\u003Cdiv\u003ECould you post some screenies? I think you may be getting confused with some of the features like I did. Although it could be a problem similar to a one that I had if you\u0027re loading up vehicles that had action groups assigned before you installed the mod.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI always clear out the parts when assigning a new action group, so it\u0027s not like I\u0027m leaving parachutes in my assignment when working with thrusters. A clearer example would be that I have 8 Attila thrusters from kspi assigned To toggle on/off. I notice after launching that not all of them are toggling. Revert to sph and check the ag and see that instead of 8 toggles there are 29 Attila thrusters( only 8 Attila parts are on the craft) set to toggle, so some are toggling multiple times and as a result, just not working after launch.\u003C/p\u003E\u003Cp\u003EI can try for a screen shot later after I get home from work. Given the issue, I am not sure it will be too helpful.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/gzk1xox84hcbzp6/Screenshot%202015-02-23%2020.26.06.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/gzk1xox84hcbzp6/Screenshot%202015-02-23%2020.26.06.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, from the parts list I selected the ATTILA, which I only have 8 attached to my craft, and yet the actiongroup has populated itself with 30 of the them, and this completely screwed up my flight, hence my finding it. Weird!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-24T01:31:09Z\u0022 title=\u002202/24/2015 01:31  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 24, 2015\u003C/time\u003E by somewhatcasual\u003C/strong\u003E\n\u003Cbr\u003ELink\n\u003C/span\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-24T03:38:31Z","Content":"\n\u003Cp\u003EThat sounds like the action in question is odd in some way and AGX is having problems handling it.\u003C/p\u003E\u003Cp\u003ENotably \u0022I notice after launching that not all of them are toggling.\u0022 is a red flag there is an error somewhere.\u003C/p\u003E\u003Cp\u003ECan you replicate and get me a copy of your output_log.txt please? AGX should be logging the errors in there.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"somewhatcasual","CreatedById":102043,"CreatedDateTime":"2015-02-24T15:14:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003EThat sounds like the action in question is odd in some way and AGX is having problems handling it.\u003Cp\u003ENotably \u0022I notice after launching that not all of them are toggling.\u0022 is a red flag there is an error somewhere.\u003C/p\u003E\u003Cp\u003ECan you replicate and get me a copy of your output_log.txt please? AGX should be logging the errors in there.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will post a dropbox link as soon as I reproduce it. I actually re-installed everything fresh after the latest KSPI extended update, so hopefully you don\u0027t hear back from me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-02-24T18:35:53Z","Content":"\n\u003Cp\u003EDiazo I noticed a stutter in my framerate every other second or so and opened up the log to find I have a lot of exceptions for you to look at. \u003Ca href=\u0022http://www.blade-edge.com/misc/output_log_AGEx.zip\u0022 rel=\u0022external nofollow\u0022\u003ELog\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ELet me know if you need any contextual info.\u003C/p\u003E\u003Cp\u003ELatest version installed\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-24T21:56:24Z","Content":"\n\u003Cp\u003E@Gaiiden: I see the error you are talking about and I\u0027m not sure what to make of it.\u003C/p\u003E\u003Cp\u003EIn the output log you have attached, I see you visited 3 flight scenes. That is you switched from the track station to flight mode (to ComSat Mun II), then to a vessel far enough away it was outside physics range (ComSat Mun III), then to a 3rd vessel again outside physics range (ComSat Mun I). I can\u0027t tell if you switched between nearby vessels within the same scene. \u003C/p\u003E\u003Cp\u003ECan you remember which of those scenes the stuttering was in? AGX was only throwing errors in the third scene (on ComSat Mun I), if it was during the first scene that was actually VOID throwing the errors (on ComSat Mun II). \u003C/p\u003E\u003Cp\u003EIf it was in the second scene (ComSat Mun III), I\u0027m not sure what to say as there are only a few errors in the log for that scene as compared to the 1st or 3rd scene where the log is being spammed with errors.\u003C/p\u003E\u003Cp\u003ELooking at the error, can I ask you to open your most recent AGExt#####.cfg file and check that all the PART nodes on the ComSat Mun I vessel and make sure the \u0022flightID\u0022 field has a number string in it? You can search the file for the name \u0022ComSat Mun I\u0022 to easily find the correct vessel.\u003C/p\u003E\u003Cp\u003EMy first guess is that it looks like that flightID field is invalid somehow, either it has non-numeric characters in it, or it is blank (or missing).\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-24T22:09:30Z\u0022 title=\u002202/24/2015 10:09  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 24, 2015\u003C/time\u003E by Diazo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-02-25T00:50:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003ELooking at the error, can I ask you to open your most recent AGExt#####.cfg file and check that all the PART nodes on the ComSat Mun I vessel and make sure the \u0022flightID\u0022 field has a number string in it? You can search the file for the name \u0022ComSat Mun I\u0022 to easily find the correct vessel.\u003Cp\u003EMy first guess is that it looks like that flightID field is invalid somehow, either it has non-numeric characters in it, or it is blank (or missing).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s missing. Completely. I get no hits when I search for it. I see II and III, but nothing for I\u003C/p\u003E\n"},{"CreatedByName":"somewhatcasual","CreatedById":102043,"CreatedDateTime":"2015-02-25T02:05:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022somewhatcasual\u0022 data-cite=\u0022somewhatcasual\u0022\u003E\u003Cdiv\u003EI will post a dropbox link as soon as I reproduce it. I actually re-installed everything fresh after the latest KSPI extended update, so hopefully you don\u0027t hear back from me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/knqc2ooxmbialrn/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/knqc2ooxmbialrn/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eok it happened again. Doubling of AG\u0027s and AG\u0027s that are getting mix and matched on their own to other assigned AG\u0027s. I\u0027ve been saving and testing and reverting ad nauseum. I hope this is helpful!\u003C/p\u003E\u003Cp\u003EThanks for looking\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-25T02:35:31Z","Content":"\n\u003Cp\u003E@Gaiiden: That is odd. Are you saying that the vessel itself is missing completely, or that the vessel is there, there are just no PART nodes?\u003C/p\u003E\u003Cp\u003E@Ssomewhatcasual: That you for that, taking a look now.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-02-25T04:46:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003E@Gaiiden: That is odd. Are you saying that the vessel itself is missing completely, or that the vessel is there, there are just no PART nodes?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are no results for \u0022ComSat Mun I\u0022 (\u003Ca href=\u0022http://www.blade-edge.com/misc/AGExt02136.txt\u0022 rel=\u0022external nofollow\u0022\u003Etxt file\u003C/a\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-25T05:18:48Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EVersion 1.30i test release\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0B6-5UOjSWq7bSk9LeDFiVE85dmc/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003E1.30i download\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003ERemotetech users:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1) Download RT 1.6.3 from the official thread.\u003C/p\u003E\u003Cp\u003E2) Install \u003Ca href=\u0022https://drive.google.com/file/d/0B6-5UOjSWq7bV3JuNEZXcVZYNXc/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003ERT development version 1.7.0 .dll here.\u003C/a\u003E I am working with the RT guys and this is the official in-progress version of RT. I have permission to release this so AGX works with RT until the official 1.7.0 release comes in a bit. Note that as this is the in development version please make sure you indicate that if you talk to the RT guys yourself while using this .dll file.\u003C/p\u003E\u003Cp\u003ETo be clear, AGX 1.30h and earlier work with RT 1.6.3 as downloaded. Only AGX 1.30i and newer required the linked .dll file. With AGX 1.30i and the in development 1.7.0 RemoteTech, you can now queue commands to the flight computer.\u003C/p\u003E\u003Cp\u003E-Fix Karbonite/Regolith actions probably not saving correctly for most people\u003C/p\u003E\u003Cp\u003E-Flight ID workaround.\u003C/p\u003E\u003Cp\u003E@somewhatcasual: I was not able to replicate the Attila engine error, but in your log your Karbonite actions were not saving correctly and this release fixes that. One oddity I noticed was you were hitting the cooldown queue quite often. Can you open your log and confirm that those messages are actually printing when you try and activate the action group please? And are you activating the group with your keyboard or the mouse? \u0022AGX Action not activated, that group still in cooldown\u0022 is the exact message that will appear in the log when you hit the cooldown queue.\u003C/p\u003E\u003Cp\u003E@Gaiiden: That is odd. My next suspicion is that the \u0022unique\u0022 identifier has been re-used so that AGX is trying to load the actions from an old vessel that no longer exists. Version 1.30i has a work around, if it hits that error again rather then crashing out like it has, it will discard that action and move on to the next one. You will still lose that action, but everything else, including other actions in AGX, should work normally. To confirm this, I would need the .sfs file that goes with the AGExt#####.cfg file you linked me above.\u003C/p\u003E\u003Cp\u003ED\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-25T05:27:54Z\u0022 title=\u002202/25/2015 05:27  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 25, 2015\u003C/time\u003E by Diazo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-02-25T14:17:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003E@Gaiiden: That is odd. My next suspicion is that the \u0022unique\u0022 identifier has been re-used so that AGX is trying to load the actions from an old vessel that no longer exists. Version 1.30i has a work around, if it hits that error again rather then crashing out like it has, it will discard that action and move on to the next one. You will still lose that action, but everything else, including other actions in AGX, should work normally. To confirm this, I would need the .sfs file that goes with the AGExt#####.cfg file you linked me above.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve got enough potential issues with my install (you\u0027ve seen all the exceptions \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) to not want to bother with a dev version of a mod so I\u0027ll wait for 7.0 release to try out your workaround but \u003Ca href=\u0022http://www.blade-edge.com/misc/persistent.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehere is the persistence file\u003C/a\u003E for you to look at. You may be able to help me with a possibly related issue - I have no idea how the UID for one of my flags got set to all zeroes (AFAIK that was its initial value). The game hasn\u0027t seemed to make any big deal about it but that could be something to send things sideways\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-25T15:06:41Z","Content":"\n\u003Cp\u003E@Gaiiden: Thank you for the persistence file. I can confirm it is in fact an issue where the \u0022unique id\u0022 is not unique. I use the \u0022flightID\u0022 value of the root part of a ship to identify it, looking at your persistent.sfs file, both Comsat Mun I and Comsat Mun II have the same FlightID on their root part so AGX thinks they are the same vessel. \u003C/p\u003E\u003Cp\u003EAs they are not the same vessel, this causes problems.\u003C/p\u003E\u003Cp\u003EThe best workaround I can offer if you want to stay on AGX ver. 1.30h is to go into the latest AGExt#####.cfg file and delete the \u00222827088109\u0022 node. That means all actions on both ComSat Mun I and ComSat Mun II will be lost, but at least the vessels will load okay. Then use action groups 1 to 10 only for those two vessels, those groups will still work as AGX will use the base 10 groups in KSP itself for them.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-02-25T16:14:22Z","Content":"\n\u003Cp\u003Eyea that\u0027s a fine fix. I generally don\u0027t even need action groups for these two vessels anyhow. Thanks\u003C/p\u003E\n"},{"CreatedByName":"novahike999","CreatedById":13803,"CreatedDateTime":"2015-02-25T17:05:14Z","Content":"\n\u003Cp\u003EIs there any point in downloading this new version if I don\u0027t use remote tech?\u003C/p\u003E\n"},{"CreatedByName":"somewhatcasual","CreatedById":102043,"CreatedDateTime":"2015-02-25T19:29:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EVersion 1.30i test release\u003C/strong\u003E\u003Cp\u003E@somewhatcasual: I was not able to replicate the Attila engine error, but in your log your Karbonite actions were not saving correctly and this release fixes that. One oddity I noticed was you were hitting the cooldown queue quite often. Can you open your log and confirm that those messages are actually printing when you try and activate the action group please? And are you activating the group with your keyboard or the mouse? \u0022AGX Action not activated, that group still in cooldown\u0022 is the exact message that will appear in the log when you hit the cooldown queue.\u003C/p\u003E\u003Cp\u003ED\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t receive messages on the screen in game, aside from no target on occasion. I had no idea things were going into cooldown. I use my keyboard the majority of the time. I\u0027ll try the updated .dll, and see what shakes loose.\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-25T20:47:04Z","Content":"\n\u003Cp\u003E@novahike999: If you do not use remotetech and you are not experiencing any issues, you don\u0027t need to worry about updating. I increment the number (and update other hosts such as CKAN) when I add new features. Version with the letters on the end are bug-fix releases where I\u0027m fixing problems. Normally the Remotetech change in version 1.30i would have been enough for its own version number, but I technically released Remotetech functionality with version 1.30 so it does not in this case.\u003C/p\u003E\u003Cp\u003E@somewhatcasual: The message about the queue would not be on-screen, but in the output log that can be enabled via Alt-F2. It has the same contents of the output_log.txt file, just it shows it in-game in real time. The fact that you use the keyboard means that the cooldown queue being hit is probably working as intended. KSP has an annoying bug where for a single press of a keyboard key in real life, it will pass that key press multiple times to AGX, so I have to have a cooldown that an action group can not activate more then once in a given time period. (It\u0027s about 1/10th of a second by default.)\u003C/p\u003E\u003Cp\u003ENotably, the queue is per action group, not per action, so only some actions in an action group activating would not be explained by hitting this queue at the wrong time. This means I\u0027ll have to run some more tests tonight to see if I can figure out why the Attila engines are not behaving for you.\u003C/p\u003E\u003Cp\u003EI ran out of time last night to do any extensive testing as I was fixing the errors with Karbonite that were also in your output_log, but I\u0027ll look at the Attila\u0027s first thing tonight.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"somewhatcasual","CreatedById":102043,"CreatedDateTime":"2015-02-25T20:53:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003E@novahike999: If you do not use remotetech and you are not experiencing any issues, you don\u0027t need to worry about updating. I increment the number (and update other hosts such as CKAN) when I add new features. Version with the letters on the end are bug-fix releases where I\u0027m fixing problems. Normally the Remotetech change in version 1.30i would have been enough for its own version number, but I technically released Remotetech functionality with version 1.30 so it does not in this case.\u003Cp\u003E@somewhatcasual: The message about the queue would not be on-screen, but in the output log that can be enabled via Alt-F2. It has the same contents of the output_log.txt file, just it shows it in-game in real time. The fact that you use the keyboard means that the cooldown queue being hit is probably working as intended. KSP has an annoying bug where for a single press of a keyboard key in real life, it will pass that key press multiple times to AGX, so I have to have a cooldown that an action group can not activate more then once in a given time period. (It\u0027s about 1/10th of a second by default.)\u003C/p\u003E\u003Cp\u003ENotably, the queue is per action group, not per action, so only some actions in an action group activating would not be explained by hitting this queue at the wrong time. This means I\u0027ll have to run some more tests tonight to see if I can figure out why the Attila engines are not behaving for you.\u003C/p\u003E\u003Cp\u003EI ran out of time last night to do any extensive testing as I was fixing the errors with Karbonite that were also in your output_log, but I\u0027ll look at the Attila\u0027s first thing tonight.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh. yea I really have to try to spam it for the message to appear in the log. I have the part.sethighlight exception message spamming on repeat otherwise\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-26T02:49:28Z","Content":"\n\u003Cp\u003E@somewhatcasual: Okay, I just tried to replicate the error with the attila engines and was unable to. If the issue happens again on version 1.30i, can you post your output_log.txt as well as your persistent.sfs, AGExtEditor.cfg and AGExt######.cfg files please? (Those last 3 files will be in KSP_Install\\saves\\GameName\\persistent.sfs directory.) I only need the AGExt#####.cfg file with the highest number.\u003C/p\u003E\u003Cp\u003EHopefully that will give me enough to go on to figure out what is happening.\u003C/p\u003E\u003Cp\u003ENote that there is a chance that fixing the Karbonite errors I did in 1.30i may also fix the errors with the attila\u0027s. It\u0027s only a 50/50 chance it did, but if you can\u0027t replicate the error that would be the reason.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-02-26T15:27:52Z","Content":"\n\u003Cp\u003EThat is a really great mod!\u003C/p\u003E\u003Cp\u003EOne small request: Could you put your settings in the AGExt.cfg within a top node?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EAGExtSettings\u003Cbr\u003E{\u003Cbr\u003Ename = AGExtSettings\u003Cbr\u003E\u003Cbr\u003E[...]\u003Cbr\u003E\u003Cbr\u003EOverrideCareer = 0\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt would allow the easy creation of a modulemanger config to change them.\u003C/p\u003E\u003Cp\u003EThat way, players could keep their private settings without file handling/resetting in case of an update.\u003C/p\u003E\u003Cp\u003EIt would also allow other mods (like my SETI-BalanceMod, link in signature), to set OverrideCareer = 1 per MM statement.\u003C/p\u003E\u003Cp\u003EThank you very much!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-26T16:39:43Z\u0022 title=\u002202/26/2015 04:39  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 26, 2015\u003C/time\u003E by Yemo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-27T05:10:51Z","Content":"\n\u003Cp\u003EThat is an interesting thought, but I don\u0027t think it would work.\u003C/p\u003E\u003Cp\u003EThe AGExt.cfg file is loaded directly by AGX when AGX loads, so at the start of the flight and editor scenes.\u003C/p\u003E\u003Cp\u003EModuleManager runs while KSP is loading and then terminates when KSP reachs the main menu.\u003C/p\u003E\u003Cp\u003EAs AGX does not use KSP\u0027s built in loader, I don\u0027t think MM can affect the config file this way.\u003C/p\u003E\u003Cp\u003EI\u0027d be up for doing this if it does work, but at the moment I don\u0027t see how it can.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-02-27T14:38:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003EThat is an interesting thought, but I don\u0027t think it would work.\u003Cp\u003EThe AGExt.cfg file is loaded directly by AGX when AGX loads, so at the start of the flight and editor scenes.\u003C/p\u003E\u003Cp\u003EModuleManager runs while KSP is loading and then terminates when KSP reachs the main menu.\u003C/p\u003E\u003Cp\u003EAs AGX does not use KSP\u0027s built in loader, I don\u0027t think MM can affect the config file this way.\u003C/p\u003E\u003Cp\u003EI\u0027d be up for doing this if it does work, but at the moment I don\u0027t see how it can.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for the consideration, then it is the same problem as with KerbalMass.\u003C/p\u003E\u003Cp\u003ECan you somehow delay the AGX loading until after the mm patches?\u003C/p\u003E\u003Cp\u003EAs far as I can see, time of loading should not affect AGX functionality, as long as it is before loading a savegame/starting a game.\u003C/p\u003E\u003Cp\u003EThere are quite some configs accumulating,\u003C/p\u003E\u003Cp\u003Efrom AGX to KerbalMass, RemoteTech, TAC life support, and so on.\u003C/p\u003E\u003Cp\u003EIt would be great if those could be controlled by MM, making the update process much easier and allowing the distribution of micro mm patches.\u003C/p\u003E\u003Cp\u003EEg an mm file that sets AGX to non-career, RemoteTech to no-time-delay, KerbalMass to something that floats with Better Buoyancy and so on.\u003C/p\u003E\n"},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-02-27T20:07:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003EThe AGExt.cfg file is loaded directly by AGX when AGX loads, so at the start of the flight and editor scenes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yemo\u0022 data-cite=\u0022Yemo\u0022\u003E\u003Cdiv\u003ECan you somehow delay the AGX loading until after the mm patches?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is not when he loads it, but how he loads it. Module Manager applies patches to ConfigNodes in GameDatabase. Anything that loads through GameDatabase is almost guaranteed to be ModuleManager compatible. Diazo is not using GameDatabase to load his settings, he\u0027s reading the file from the hard drive when he needs it. This is why MM can have no effect on his settings file.\u003C/p\u003E\u003Cp\u003E@Diazo\u003C/p\u003E\u003Cp\u003EThe best way I found to do this is to load the settings file into an object the first time you enter the main menu that persists while the game is running. Thus it is affected by MM \u003Cstrong\u003Eand\u003C/strong\u003E persistent between flights and saves. Any changes made you write to that object and to hard drive (or rather, update the object and then save it).\u003C/p\u003E\u003Cp\u003EYou can see this approach \u003Ca href=\u0022https://github.com/Crzyrndm/Pilot-Assistant/blob/master/PilotAssistant/PresetManager.cs\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E where I have a class handling all my presets for Pilot Assistant.\u003C/p\u003E\u003Cp\u003EGameDatabase.Instance.GetConfigNode(string url) would be the load function needed for AGX I believe\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-27T23:39:36Z\u0022 title=\u002202/27/2015 11:39  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 27, 2015\u003C/time\u003E by Crzyrndm\u003C/strong\u003E\n\u003C/span\u003E\n"}]}