{"TopicId":67279,"ForumId":25,"TopicTitle":"Duna One: Simulate the Mars One mission through KSP","CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-03-31T01:32:24Z","PageNum":1,"Articles":[{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-03-31T01:32:24Z","Content":"\n\u003Cp\u003EThis challenge contains of multiple missions to Duna, simulating the Mars One mission.\u003C/p\u003E\u003Cp\u003EFirst, Send an unmanned craft down to Duna with supply such as a science tools, etc. (\u002B3 points)\u003C/p\u003E\u003Cp\u003ENext, send a rover look for the best location of the settlement.(\u002B7 points)\u003C/p\u003E\u003Cp\u003EAfter that, send these following crafts in one or more missions: Another unmanned supply craft (\u002B4 points), another rover (\u002B9 points), and 2 manned mk 1-2 capsules (\u002B12 points).\u003C/p\u003E\u003Cp\u003Emk1-2 capsules must each have solar panels of any type (\u002B2 points).\u003C/p\u003E\u003Cp\u003EAll of the above is worth 20 bonus points if you complete it all\u003C/p\u003E\u003Cp\u003EAfter you do the above, earn more points by:\u003C/p\u003E\u003Cp\u003ESending unmanned supply craft: 2 points\u003C/p\u003E\u003Cp\u003ESending a rover: 5 points\u003C/p\u003E\u003Cp\u003ELanding Manned supply mk1-2 capsules: 6 points per capsule\u003C/p\u003E\u003Cp\u003ELanding Hitchhiker container: 8 points per container\u003C/p\u003E\u003Cp\u003EPost your scores from the challenge here.\u003C/p\u003E\u003Cp\u003EGood luck! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL CHALLENGES (optional):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDo all of this in one of your career saves (\u002B25 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDo this in a new career save. (\u002B30 point and \u002B1 additional point for every experiment you complete at Duna)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EComplete the initial challenge in one flight (\u002B35 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDon\u0027t kill a single kerbal in the initial challenge (\u002B10 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EComplete the initial challenge without any failures (\u002B50 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELand 2 working escape pods (\u002B15 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELand an asteroid at your base (\u002B90 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGet an asteroid in an under 100 km orbit around Duna and make a base on it (\u002B150 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMake a Duna space station (\u002B20 points and \u002B10 points per additional module)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESend Jebediah on all of the launches of the initial mission, launching him back every time for the next one, and get him home alive. (\u002B30 points for challenge, \u002B10 points for not dying once)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHARDCORE CHALLENGES\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EGive Duna a ring of asteroids. the ring must contain atleast 5 asteroid with the same height of periapsis and apoapsis, and must be above 100 km but under 200 km. (\u002B300 points, \u002B60 points for every additional asteroid)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESet 4 different bases: 1 in each pole, and 2 on the equator (\u002B60 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESet up an asteroid on a collision course with one of your Duna bases, and send up a seperate craft for stopping it. (-40 points for failing, \u002B75 points for succeeding)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESuround your base with class E landed asteroids (\u002B250 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EComplete every other hardcore challenge on the list (\u002B500 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EComplete every normal challenge on the list (\u002B400 points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EComplete every challenge given (\u002B1000 points)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-05T03:54:42Z\u0022 title=\u002204/05/2014 03:54  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 5, 2014\u003C/time\u003E by Clockwork13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-03-31T02:37:54Z","Content":"\n\u003Cp\u003EDoesn\u0027t seem like a good challenge. It seems more about how many launches your willing to do\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-03-31T02:44:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022robopilot99\u0022 data-cite=\u0022robopilot99\u0022\u003E\u003Cdiv\u003EDoesn\u0027t seem like a good challenge. It seems more about how many launches your willing to do\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe amount of launches you do doesn\u0027t matter. In fact, you could finish the initial challenge in one launch if you were willing to.\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2014-03-31T04:39:48Z","Content":"\n\u003Cp\u003EWow, I was just getting ready to do this my self for kicks. All components are already tested and in orbit waiting for the right Duna phase angle. I tried to do everything as close as possible to the concept images from \u003Ca href=\u0022http://www.mars-one.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.mars-one.com/\u003C/a\u003E although I wasn\u0027t going to wait a year between every launch as their mission plan calls for. I even assembled the Transit Vehicle in orbit from 4 modules. I had planned on making this challenge eventually but I\u0027m pretty slow so it is no surprise you beat me to it. I first started this project like 2 months ago. Currently my Transit vehicle is on a test drive around the moon. This is my first post, btw, after lurking for some time now.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/SeKuw\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003Emod edit: you can\u0027t use html on the forums, replaced it with a bbcode \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-04-03T03:41:24Z","Content":"\n\u003Cp\u003EYou get bonus points for doing this from scratch in a brand new career mode save. Every science point you earn from doing research ON DUNA is worth 1 point each. Decimals don\u0027t count.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-04-05T03:14:27Z","Content":"\n\u003Cp\u003EThis isn\u0027t exactly what one would call the most successful Duna landing, but hey, atleast my ship came down in one piece. \u003Csub\u003E\u003Cspan style=\u0022color:#D3D3D3;\u0022\u003Eexcept for the solar panels...\u003C/span\u003E\u003C/sub\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1afSDiS.png\u0022 alt=\u00221afSDiS.png\u0022\u003E\u003C/p\u003E\n"}]}