{"TopicId":67412,"ForumId":44,"TopicTitle":"Limits of Bending Space?","CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-04-01T09:52:52Z","PageNum":1,"Articles":[{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-04-01T09:52:52Z","Content":"\n\u003Cp\u003EThis might seem like a vague question, so i expect some vague answers. Regardless post what you think, im only a bored college student that got to thinking after watching TV.\u003C/p\u003E\u003Cp\u003EI was watching The Cosmos: a SpaceTime Odyssey (love that show!) and Neil(the host) was talking about how its possible inside a black holes immense gravity there could be a whole universe. \u003C/p\u003E\u003Cp\u003EBecause of the Black holes intense gravity it, could be possible that the start of a black hole simulates another big bang, but INSIDE the black hole. Effectively making another \u0022universe\u0022 within the black hole! \u003C/p\u003E\u003Cp\u003ENow beyond all the hearsay of what the hell actually goes on in the black hole (doubt anyone will go in and come back to tell us ;P) it struck me that inside a black hole there could be a whole universe that is relatively huge, but it only is in a \u0022small\u0022 place in our universe.\u003C/p\u003E\u003Cp\u003ESo does this mean the space within a black hole, is the same space as ours, just in a different scale?\u003C/p\u003E\u003Cp\u003EMore generally, does space have limits before it \u0022breaks\u0022 in relation to how space is always expanding. Is it possible for the actual fabric of Space to \u0022snap\u0022 in any way? Are their any limits to how much space can actually handle the forces of the universe? Things such as wormholes and black holes seem to change space beyond what i would define as the norm.\u003C/p\u003E\u003Cp\u003EMost of what im asking is theories, so i don\u0027t expect any direct answers lol.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-04-01T10:03:25Z","Content":"\n\u003Cp\u003EI think, he might have been referring to the interior region of the Kerr metric, which behaves as if it opens up into another universe. The problem is that Kerr solution is known to be unstable in the interior, so this is probably just a mathematical curiosity.\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2014-04-01T13:40:46Z","Content":"\n\u003Cp\u003EBest I know from discussions on Alcubierre Warp Drives and Big Bang related information, there isn\u0027t really any theorized limits on how much stretching/stress SpaceTime can take. When the Big Bang happened, space was stretching at a \u0027speed\u0027 of around 10,000 times the speed of light, thus those gravity waves that everybody is making a big deal about.\u003C/p\u003E\n"}]}