{"TopicId":67450,"ForumId":16,"TopicTitle":"Can\u0026#039;t get this to work","CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2014-04-01T18:48:17Z","PageNum":1,"Articles":[{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2014-04-01T18:48:17Z","Content":"\n\u003Cp\u003EI use a lot of struts so rather than going back and picking up another strut everytime I need one I thought I\u0027d use alt \u002B left click, but nothing happens.\u003C/p\u003E\u003Cp\u003EHere\u0027s what I\u0027m doing precisely. I pick up a strut. I put it on a rocket and then I put the other end on another engine. At that point I hold down left click while holding alt and I expect another strut to appear but nothing happens. \u003C/p\u003E\u003Cp\u003EDoes anyone know precisely what I\u0027m doing wrong and how to do it right?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-04-01T18:51:02Z","Content":"\n\u003Cp\u003EThat duplicates parts sure, but it\u0027s tricky with struts, you need to click the first node quite accurately to get it or you just copy the part underneath \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, you just get a new strut that\u0027s ready to place, you don\u0027t copy the whole of an existing strut.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-01T18:55:27Z","Content":"\n\u003Cp\u003EYou can\u0027t click on the second node of struts and fuel lines, you have to click on the initial point.\u003C/p\u003E\u003Cp\u003EI keep the structural tab open and select from there when strutting, it\u0027s too easy to miss the strut and remove an assembly that took a long time to build.\u003C/p\u003E\u003Cp\u003EEdit: Ninja-like mods!\u003C/p\u003E\n"},{"CreatedByName":"Dust","CreatedById":96482,"CreatedDateTime":"2014-04-01T19:12:30Z","Content":"\n\u003Cp\u003EThe actual strut part is just the first node that you placed. The bar and 2nd node are just visual effects. You need to go back to the first end to grab it, and even then it can be small and difficult to grab. Half the time I just keep grabbing another new one.\u003C/p\u003E\n"},{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2014-04-01T19:47:25Z","Content":"\n\u003Cp\u003EI put about 150 struts on this contraption. Its really tedious to keep going back to that structural tab. They should have just left it in your hand to repeat as often as you wanted. If you wanted to use some other part you could click on that. That\u0027s a lot of unnecessary mousing around. Also, building frames with many the same parts, they again should have just left it in your hand so you could put together big assemblies quickly. Or click and drag.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-01T20:05:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chik Sneadlov\u0022 data-cite=\u0022Chik Sneadlov\u0022\u003E\u003Cdiv\u003EI put about 150 struts on this contraption.........\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd now you can probably delete 90% of them, thanks to the new joints in the ARM pack \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}