{"TopicId":67621,"ForumId":32,"TopicTitle":"ARM engines.","CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-02T10:44:39Z","PageNum":1,"Articles":[{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-02T10:44:39Z","Content":"\n\u003Cp\u003EARM is nice and all, great new features.\u003C/p\u003E\u003Cp\u003EWhat do people think of the engines versus 0.23.5 version?\u003C/p\u003E\u003Cp\u003EI note they are scaled more powerful than 0.23\u003C/p\u003E\u003Cp\u003EEdited for less bias.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-02T12:11:51Z\u0022 title=\u002204/02/2014 12:11  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 2, 2014\u003C/time\u003E by SSSPutnik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-02T11:04:19Z","Content":"\n\u003Cp\u003EBiased polls are not good polls. If you want to run a poll you should design it with no prejudice.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-02T11:19:12Z","Content":"\n\u003Cp\u003EThe actual questions aren\u0027t too biased? How would you word to improve it, open to suggestions.\u003C/p\u003E\n"},{"CreatedByName":"Benjpalmer","CreatedById":94802,"CreatedDateTime":"2014-04-02T11:24:32Z","Content":"\n\u003Cp\u003EYou\u0027ve essentially worded them to support your point.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-02T11:26:13Z","Content":"\n\u003Cp\u003EWell.. What\u0027s written is fact.. Let me edit a bit.\u003C/p\u003E\n"},{"CreatedByName":"Taleric","CreatedById":92762,"CreatedDateTime":"2014-04-02T11:26:41Z","Content":"\n\u003Cp\u003EThe problem lies in the lack of risk/reward career.\u003C/p\u003E\u003Cp\u003ESandbox wise it was just a natural move after better structural integrity. Same belle ache could be made at advent of mainsail.\u003C/p\u003E\u003Cp\u003EIf you factor in the cost and risk of loss in a career, even once unlocked it would be a precious launch vehicle.\u003C/p\u003E\n"},{"CreatedByName":"Daid","CreatedById":32171,"CreatedDateTime":"2014-04-02T11:26:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EThe actual questions aren\u0027t too biased? How would you word to improve it, open to suggestions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour poll puts the idea that the new parts are not properly scaled with the rest of the game as fact instead of an idea.\u003C/p\u003E\u003Cp\u003EWhich is the first question, are they really over-powered? Which I would not know yet, haven\u0027t played enough with it. And I had enough problems with the power of the mainsail ripping my ships apart, but maybe the new joints will help here. So even more powerful engines then those might be powerful, but can also fail in most spectacular ways.\u003C/p\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2014-04-02T11:28:17Z","Content":"\n\u003Cp\u003EYour poll implies that the parts \u003Cem\u003Edont\u003C/em\u003E scale, regardless of which option we pick. What if someone thinks they are balanced, and scale fine? That said, I uh, tend to agree with you on the scaling part- they do seem just better. Id like to see some ISP nerfs, and maybe some weight reductions on the old parts. Ideally, each part should remain relevant.\u003C/p\u003E\u003Cp\u003EEdit: Gha, ninja\u0027d\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-02T11:31:48Z","Content":"\n\u003Cp\u003EThe ions are 4x more powerful, 0.24 ions did have a place for satellites etc.\u003C/p\u003E\u003Cp\u003EThe new few tanks actually have a poorer wet/dry ratio at first glance.\u003C/p\u003E\u003Cp\u003EOn IRC we teased out the new engines and they definitely seem scaled higher than 0.24\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-02T11:35:09Z\u0022 title=\u002204/02/2014 11:35  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 2, 2014\u003C/time\u003E by SSSPutnik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-04-02T11:32:14Z","Content":"\n\u003Cp\u003EThere is no option to say \u0022I disagree, they are scaled and fit in well\u0022.\u003C/p\u003E\u003Cp\u003EOption 1. only says \u0022I dont care/It is good that they are overpowered\u0022, 2. says \u0022I agree with you, Squad has to make changes\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EThe ions are 4x more powerful, 0.24 ions did have a place for satellites etc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs stated by Squad this was a gameplay decision.\u003C/p\u003E\u003Cp\u003EAlthough I can agree they could have added a more powerful larger ion engine and left the small one as a satellite thruster.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-02T11:34:43Z\u0022 title=\u002204/02/2014 11:34  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 2, 2014\u003C/time\u003E by KerbMav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-04-02T11:35:33Z","Content":"\n\u003Cp\u003EI like the new engines just like they are. A good and needed addition to the existing parts. In general i like the new 3.75 m parts a lot. Too bad, they just kicked out KW Rocketry... I liked that mod a lot, but i like it even more to play stock...\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-04-02T11:37:15Z","Content":"\n\u003Cp\u003ECompared with the orion mod (nuclear bomb engine) they are ridiculous underpowered.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-04-02T11:41:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frank_G\u0022 data-cite=\u0022Frank_G\u0022\u003E\u003Cdiv\u003EToo bad, they just kicked out KW Rocketry... I liked that mod a lot, but i like it even more to play stock...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey did not, not really - if you still like the KW design you can still use them or edit them yourself to be the same.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2014-04-02T11:48:38Z","Content":"\n\u003Cp\u003EI think that it won\u0027t matter much as stock parts aren\u0027t really balanced for now - in real life rocket engines are a very lightweight compared to it\u0027s trust and rest of the rocket ,but changing engines is only a part of the solution as it\u0027s very important to balance dry weight of fuel tanks and density (and bi-propellant mixture proportions) of fuel itself as they are largest fraction of the rocket mass... \u003C/p\u003E\u003Cp\u003EOther important thing would be changing fuel tank capacity units into liters or square meters (as well as displaying mass of the propellant inside as volume is good for defining fuel tanks capacity but mass of propellant in tank matter more during mission), so tank size can be calculated properly and give good point of reference for modding.\u003C/p\u003E\u003Cp\u003EAlso important for engines balancing is that it\u0027s thrust is changing with air pressure (atmospheric curve in KSP) but for now thrust is constant and fuel consumption is changing with specific impulse (and it should be opposite).\u003C/p\u003E\u003Cp\u003EThis causing vacuum upper stage engines with low sea level ISP to consume much more fuel instead having significantly reduced trust caused by nozzle underexpansion and first stage engines thrust won\u0027t decrease from exhaust over-expanding in upper atmosphere.\u003C/p\u003E\u003Cp\u003EBetter modeling of engine and nozzle mechanics (nozzle expansion and thrust changing with ambient pressure) would made more realistic (upper stage engines don\u0027t work well in low atmosphere and vice versa) engines and made nozzle extensions and plug nozzles (AKA areospike) useful and working as intended.\u003C/p\u003E\u003Cp\u003EEDIT_1: I would say that new engines ISP are bit too generous when compared to older stock parts.\u003C/p\u003E\u003Cp\u003EEDIT_2: \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EThe Mainsail is basically useless now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI could disagree, Mainsails in quad configuration are creating real monster, nearly twice more powerful than stock SLS cluster part. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh3.googleusercontent.com/-6kLq_34eZlQ/UzwH6cL5fAI/AAAAAAAADh0/UV7BxzoIMx4/w800-h533-no/Quadsail.png\u0022 alt=\u0022Quadsail.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFrom other hand mainsails are much heavier... mass of old engines is too big and TWR too small :/.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-02T12:59:36Z\u0022 title=\u002204/02/2014 12:59  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 2, 2014\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-02T11:50:37Z","Content":"\n\u003Cp\u003EI didn\u0027t add an option for \u0022I think they are scaled well\u0022 because if you look at the maths, they aren\u0027t.\u003C/p\u003E\u003Cp\u003EThe Mainsail is basically useless now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-02T11:56:01Z\u0022 title=\u002204/02/2014 11:56  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 2, 2014\u003C/time\u003E by SSSPutnik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"VirtualCLD","CreatedById":81542,"CreatedDateTime":"2014-04-02T11:55:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EThe ions are 4x more powerful, 0.24 ions did have a place for satellites etc.\u003Cp\u003EThe new few tanks actually have a poorer wet/dry ratio at first glance.\u003C/p\u003E\u003Cp\u003EOn IRC we teased out the new engines and they definitely seem scaled higher than 0.24\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAm I missing something? When did 0.24 get released? I thought we were on 0.23.5 with the ARM update.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-02T12:12:15Z","Content":"\n\u003Cp\u003ESorry my bad.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-04-02T12:59:13Z","Content":"\n\u003Cp\u003EIf you don\u0027t like the engines, then don\u0027t use them. \u003C/p\u003E\u003Cp\u003ENo need to spoil it for others.\u003C/p\u003E\n"},{"CreatedByName":"spikeyhat09","CreatedById":39217,"CreatedDateTime":"2014-04-02T13:19:39Z","Content":"\n\u003Cp\u003Ei would definitely agree that some of them are overpowered. one of them is better than or equal to the mainsail in literally every way (much higher thrust, much higher isp, only 0.5 tons heavier). however, it is in early access. its going to have bugs and/or balance issues. instead of criticizing the new parts, we should be providing feedback on how we would balance them\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-04-02T13:34:26Z","Content":"\n\u003Cp\u003EI think they are monstrously overpowered, especially the KR-2L.\u003C/p\u003E\u003Cp\u003ESeriously, you thought the 909 was made useless after the introduction of the 48-7s? Besides asthmatics there is no reason to ever use the mainsail anymore.\u003C/p\u003E\u003Cp\u003EAnyway I think the new engines should be re-balanced in a way that maintains the lifting capacity, but keeps them in balance with other engines. This could be done by increasing the thrust, but increasing the mass more so that the TWR is lowered a bit.\u003C/p\u003E\n"},{"CreatedByName":"Daid","CreatedById":32171,"CreatedDateTime":"2014-04-02T13:58:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EI didn\u0027t add an option for \u0022I think they are scaled well\u0022 because if you look at the maths, they aren\u0027t.\u003Cp\u003EThe Mainsail is basically useless now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EShow us the math. That would help in your argument. Until then, my math says they scale great:\u003C/p\u003E\u003Cp\u003E[stronger engines] \u002B [bigger engines] = [Moar power] = [Top of the Awesome scale]\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-04-02T14:07:37Z","Content":"\n\u003Cp\u003EPersonally I don\u0027t think everything in the game needs to be balanced to match each other in terms of performance.\u003C/p\u003E\u003Cp\u003EI think a lot of players were already struggling to build heavy lifters or giant rockets, so adding these parts will help a lot of people get more out of their game. I don\u0027t really think the mainsail and skipper are going to use useless now. Once career mode is padded out they can be balanced with their cost, and the fact the mainsails will come before the new engines in the tech tree. Even when everything is unlocked, they\u0027re still going to have their uses as boosters or second stages.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-02T14:17:39Z","Content":"\n\u003Cp\u003EI might show the math tomorrow but its bedtime. On the prior page there is a good post on the mainsail.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-04-02T14:22:02Z","Content":"\n\u003Cp\u003ETWR on the new engines is pretty ridiculus compared to existing ones\u003C/p\u003E\n"},{"CreatedByName":"Yarrula","CreatedById":99782,"CreatedDateTime":"2014-04-02T14:23:06Z","Content":"\n\u003Cp\u003EI have no problems with the new parts and engines. I think they\u0027re great. There is always room for more choice, especially in Sandbox. In Career, having access to progressively better engines is also a good idea. It gives me a sense of progress to know that I now have superior technology compared to when I started. I can still use my old designs, that functioned perfectly, or I can spend the time to redesign with superior parts. More choices, more fun for me.\u003C/p\u003E\u003Cp\u003EWhen budgets are implemented, I think it will be easy to balance things based on cost. Then I\u0027ll have interesting choices to make on choosing between fuel efficiency or credit efficiency.\u003C/p\u003E\n"}]}