{"TopicId":67878,"ForumId":16,"TopicTitle":"Multiple planet flybys","CreatedByName":"Twreed87","CreatedById":50017,"CreatedDateTime":"2014-04-03T17:56:05Z","PageNum":1,"Articles":[{"CreatedByName":"Twreed87","CreatedById":50017,"CreatedDateTime":"2014-04-03T17:56:05Z","Content":"\n\u003Cp\u003EI didn\u0027t see a topic on this yet, apologies if I missed it. I was wondering if anyone had managed to pull off flybys of multiple bodies, using gravity assists to reach each next one. They happen in real life all the time, surely people do them in KSP. I know they require really rare launch windows, I was wondering if anyone had worked them out.\u003C/p\u003E\u003Cp\u003EI\u0027m thinking something like, launch from Kerbin, descend down to Eve, boost up to Jool to get a flyby past Eeloo and out of the system. Even using the Oberth effect would be fine, along with some course corrections, but doing it without stopping within the sphere of influence of any body is the key. What\u0027s the craziest anyone\u0027s done?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-03T18:08:50Z","Content":"\n\u003Cp\u003EMoved to gameplay questions.\u003C/p\u003E\n"},{"CreatedByName":"Starstrider42","CreatedById":104043,"CreatedDateTime":"2014-04-03T18:15:16Z","Content":"\n\u003Cp\u003EI\u0027ve heard that some people have been able to chain gravity assists by doing carefully timed maneuvers at each flyby. Personally, I\u0027ve never been able to pull it off.\u003C/p\u003E\u003Cp\u003EThere is a standalone tool that lets you predict gravity assist windows (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36476-WIN-KSP-Trajectory-Optimization-Tool-v0-11-2-Mission-Architect-Pre-release-1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/36476-WIN-KSP-Trajectory-Optimization-Tool-v0-11-2-Mission-Architect-Pre-release-1\u003C/a\u003E!), but it only works for a two-planet trajectory (three if you count Kerbin).\u003C/p\u003E\n"}]}