{"TopicId":68006,"ForumId":55,"TopicTitle":"the ion engine is way too OP","CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2014-04-04T07:18:19Z","PageNum":6,"Articles":[{"CreatedByName":"Oksbad","CreatedById":79888,"CreatedDateTime":"2014-04-07T02:49:15Z","Content":"\n\u003Cp\u003EA possible solution to the long burn times of ion drives would be to enable some form of time warp when using low thrust methods such as ion drives. Effectively giving them the same thrust as small chemical rockets completely kills the point of an ion drive. They\u0027re \u003Cem\u003Esupposed\u003C/em\u003E to have very low thrust.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-04-07T02:57:21Z","Content":"\n\u003Cp\u003EI don\u0027t understand how people say Ion engines are overpowered. \u003C/p\u003E\u003Cp\u003E1) The Delta V for the old and new versions are EXACTLY the same. It doesn\u0027t make you travel further than it already does. You take a 1 hour burn to get to Jool for the old one, and you take a 15 minute burn in the new one. In the end of that burn both will still have the same amount of Xenon fuel left in their tanks when they both reach Jool (because the newer version has a higher fuel consumption rate). Having a higher thrust doesn\u0027t make you travel further than you already could in the previous versions.\u003C/p\u003E\u003Cp\u003E2) You can put the ion engines into gliders, BUT:\u003C/p\u003E\u003Cp\u003E A: Ion powered gliders take forever to get anywhere in atmosphere (which means you are essentially playing the same boring routine of long ass burns).\u003C/p\u003E\u003Cp\u003E B: It\u0027s still better off using jet engines or rockets to get to your destination in atmospheric gliders.\u003C/p\u003E\u003Cp\u003E C: There aren\u0027t that many places to visit on a glider, and the places that you do want to visit, can be landed directly on from orbit anyway.\u003C/p\u003E\u003Cp\u003E3) The only difference in the ion engines are on burn times. Since the dV is the same, and you don\u0027t travel further than where you can already go in previous versions, the only \u0027overpowered\u0027 aspect is the wait time. If these people think waiting times are a form of challenge, they need a swift knock to the head. \u003C/p\u003E\u003Cp\u003EKerbin is scaled down to a tenth of the Earth\u0027s size to cut down on the time it takes to get to orbit. The Kerbol system is scaled down to facilitate interplanetary travel. Time warp is implemented to cut down on time to travel to the Mun or interplanetary travel. The whole game is designed to shave off those useless time spent staring at the screen doing nothing.\u003C/p\u003E\u003Cp\u003EIf you can build it and if it has the dV, the game will let you go there. KSP is only concerned about seeing you get to your destination to explore, it is not a game about waiting around twiddling your fingers during a 2 hour burn.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T03:01:22Z\u0022 title=\u002204/07/2014 03:01  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by Levelord\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-07T03:34:56Z","Content":"\n\u003Cp\u003EThe increased thrust means you can now use them to land on more bodies than you could before...\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-04-07T03:41:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EThe increased thrust means you can now use them to land on more bodies than you could before...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn what bodies? Gilly? Minmus? \u003C/p\u003E\u003Cp\u003EAll the super low gravity bodies that you can already land on (and take off) using the ant engine (or even RCS) which is faster responding than the ion engine and uses less power and weighs less?\u003C/p\u003E\n"},{"CreatedByName":"Tangle","CreatedById":66808,"CreatedDateTime":"2014-04-07T03:46:56Z","Content":"\n\u003Cp\u003EIf the Ion engine was exactly as it is IRL... well, let me just say good luck on that seventeen-day burn.\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2014-04-07T03:52:13Z","Content":"\n\u003Cp\u003EWhile it does reduce realism... KSP was never meant to be a perfect reality, unless Squad\u0027s target platform was university Supercomputers.\u003C/p\u003E\u003Cp\u003EOne Jool-bound ion craft I made while back had a burn time of \u003Cem\u003E over 3 days\u003C/em\u003E. It did, also, have only 3 ion engines and a dV of over 8,000 m/s.\u003C/p\u003E\u003Cp\u003EThe increase in thrust would make me much more comfortable doing a legitimate mission and not just going straight to the fast and easy Mainsail Interplanetary Stage.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-04-07T04:14:04Z","Content":"\n\u003Cp\u003EHas anyone managed to reach Kerbin orbit on Ion power alone?\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-07T04:14:19Z","Content":"\n\u003Cp\u003EThe increased thrust does result in more \u0022effective\u0022 delta-V. Firstly because if you have the same number of ion engines your burn will be shorter, and the shorter the burn is the more efficient it is. Secondly, if we assume you have a maximum burn length tolerance, you can now meet that with fewer ion engines and thus less dry mass; the reduced electricity requirement lowers the needed dry mass even further.\u003C/p\u003E\u003Cp\u003EThat said, the effects are likely to be minor.\u003C/p\u003E\u003Cp\u003EEDIT: @zarakon: Not that I know of. Even after the buff you still can\u0027t do it by a vertical launch, you\u0027d have to use an aircraft. But I don\u0027t know if you could get enough speed up to reach orbit, given you\u0027ve so little force to overcome drag with.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-04-07T04:41:08Z","Content":"\n\u003Cp\u003EYou can have the same amount of dV by doing several orbits and doing short burns at the periapsis by taking advantage of the Oberth effect for the old engines. \u003C/p\u003E\u003Cp\u003EEven so... The new ion engines are not buffed to the point where you can do a single interplanetary burn, so you are still going to have to do Hohmann burns several orbits anyway, just less orbits this time. So the technique is still preserved, but the time wasted doing it repeatedly is reduced. I burn for Jool after 7-8 Hohmann burns, you do it in only 4-5, and we still end up with the same fuel and dV when we break Kerbin SOI.\u003C/p\u003E\u003Cp\u003EYour second point applies to any craft that is designed to be smaller with a lighter engine, like the ant or 48-7S engines. It\u0027s not a unique feature of the ion engine.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T04:43:23Z\u0022 title=\u002204/07/2014 04:43  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by Levelord\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-04-07T06:22:38Z","Content":"\n\u003Cp\u003EThe point is that you shouldn\u0027t be doing hohman burns at all with ion engines.\u003C/p\u003E\u003Cp\u003EWhat we need is an engine that works during time warp/affects \u0022on rails\u0022 calculations.\u003C/p\u003E\u003Cp\u003EAs it is now, the ion engine acts like a perfectly efficient ion thruster in the 40 MEGAwatt power range, (or more realistically, an ion thruster at 50% efficiency, with a power consumption of 80 megawatts).\u003C/p\u003E\u003Cp\u003EGood luck getting 10\u0027s of megawatts of power output from solar alone...\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-04-07T07:52:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EThe point is that you shouldn\u0027t be doing hohman burns at all with ion engines.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are supposed to be doing Hohmann burns with any engine/craft if you want maximum dV and efficiency, and it becomes more important the slower the engine is (eg. Nuclear and ion engines).\u003C/p\u003E\u003Cp\u003EIf you don\u0027t do a Hohmann burn, you\u0027re wasting dV even on the buffed ion engines and would be lucky enough to even break Kerbin SOI.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-04-07T13:17:23Z","Content":"\n\u003Cp\u003ENope.... hohmann burns aren\u0027t possible with real ion engines at the given power levels*, so instead they do brachistochrone trajectories.\u003C/p\u003E\u003Cp\u003EYou shouldn\u0027t be trying to do something that isn\u0027t possible.\u003C/p\u003E\u003Cp\u003EBecause of the way ion engines work in KSP, we\u0027re always doing hohmanns, and never doing brachistichrones... its a shame.\u003C/p\u003E\u003Cp\u003E*sure, in theory you could perapsiss kick for your outbound, but that would take far too long, and you wouldn\u0027t be able to do a burn for capture at the destination... you\u0027d go whizzing by, and fail your hohman transfer.\u003C/p\u003E\u003Cp\u003EWith the OP\u0027d \u0022ion\u0022 engines in KSP, yea, you should do Hohmann\u0027s to maximize efficiency.\u003C/p\u003E\u003Cp\u003EBut the point is that a real simulation of flight with an ion engine would have you doing a brachistichrone trajectory, not a hohmann transfer.\u003C/p\u003E\n"},{"CreatedByName":"The Error","CreatedById":58941,"CreatedDateTime":"2014-04-07T13:36:19Z","Content":"\n\u003Cp\u003EI\u0027m sorry, but-\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou shouldn\u0027t be trying to do something that isn\u0027t possible\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E- why shouldn\u0027t I? This is K.S.P., not Orbiter. If I want to try and break physics, I will.\u003C/p\u003E\u003Cp\u003EThis discussion seems to be degrading into \u0022You\u0027re having fun/using ions the wrong way!\u0022, and frankly, that seems entirely pointless.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-04-07T14:51:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003ENope.... hohmann burns aren\u0027t possible with real ion engines at the given power levels*, so instead they do brachistochrone trajectories.\u003Cp\u003EYou shouldn\u0027t be trying to do something that isn\u0027t possible.\u003C/p\u003E\u003Cp\u003EBecause of the way ion engines work in KSP, we\u0027re always doing hohmanns, and never doing brachistichrones... its a shame.\u003C/p\u003E\u003Cp\u003E*sure, in theory you could perapsiss kick for your outbound, but that would take far too long, and you wouldn\u0027t be able to do a burn for capture at the destination... you\u0027d go whizzing by, and fail your hohman transfer.\u003C/p\u003E\u003Cp\u003EWith the OP\u0027d \u0022ion\u0022 engines in KSP, yea, you should do Hohmann\u0027s to maximize efficiency.\u003C/p\u003E\u003Cp\u003EBut the point is that a real simulation of flight with an ion engine would have you doing a brachistichrone trajectory, not a hohmann transfer.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBrachistichrone trajectories are done on real life ion engines to \u003Cstrong\u003Esave time\u003C/strong\u003E in real life, but doing repeated Hohmann burns is perfectly feasible, but takes repeated orbits and takes a longer time. \u003C/p\u003E\u003Cp\u003EDoing brachistichrone trajectories in KSP ironically takes longer because you are limited to a 4x physical time warp while you manually control where the craft should be going (as opposed to 100x or 1000x on rails time warp to complete orbits for repeated short Hohmann burns). So the thrust was boosted to \u003Cstrong\u003Esave time in KSP\u003C/strong\u003E. If you feel you are talented enough to eyeball a brachistichrone trajectory, you are free to do so, but it\u0027s likely that it\u0027s better handled with an autopilot like MechJeb.\u003C/p\u003E\u003Cp\u003EEither way, this has nothing to do with the changes to the ion engine\u0027s stat buff, because it doesn\u0027t change where you could and could not go from previous versions. The dV is still the same for both. \u003C/p\u003E\u003Cp\u003EYour argument for realism would require you to sit in front of your PC watching your ion craft do a brachistichrone trajectory for 45 minutes to an hour, because you have to be constantly readjusting the heading of the circular arc and can\u0027t activate an on rails timewarp. The ion engine\u0027s updated thrust doesn\u0027t change anything except for a bit of time spent staring at your screen doing it. So you are absolutely free to spend your incredible amount of free time doing the maneuver for yourself for the sake of \u0027realism\u0027. I just don\u0027t see how an ion engine buff stops you from doing it if you wanted to.\u003C/p\u003E\u003Cp\u003EThe final point is that a few orbits for Hohmann burns is not going to desync you from your destination and most of the time you are going to have to do interplanetary correction burns along the way anyway like any other conventional craft. I\u0027d argue that brachistichrone trajectories are harder to do because KSP\u0027s maneuver nodes doesn\u0027t support it and setting up multiple burns is inaccurate; because of how the game gets less accurate predicting flight paths (conic patch) and the human error of trying to manually adjust the craft to face the changing maneuver nodes.\u003C/p\u003E\n"},{"CreatedByName":"Iron4venger","CreatedById":89812,"CreatedDateTime":"2014-04-07T14:57:55Z","Content":"\n\u003Cp\u003EI\u0027m probably the guy with most experience in ions in the entire forums. I\u0027ve created countless probes 100% ions, (even planes) and this is my list:\u003C/p\u003E\u003Cp\u003EThe increased x4 thrust is good. I\u0027VE DONE a 24 hour long burn with ions in .22. And after that, I used Hyperedit to skip the burn and place the probe were I wanted it to be every single time. So if burns now takes minutes instead of days is a good thing. Sad to lose that long burns that makes nodes irrelevant because you gonna to burn during hours and hours well in advance and before the node point, but if nodes are irrelevant and theres simply no other way to navigate thru space, then, wtf ions man? \u003Cspan style=\u0022color:#00FF00;\u0022\u003E\u003Cstrong\u003EGOOD\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI find the electrical consumption a little bit too low, but I need to test more to be sure about this.\u003C/p\u003E\u003Cp\u003Epd. My solar glider had 100m roof before, now it reachs 10km easy and I\u0027m quite sure it\u0027s orbit capable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T15:28:24Z\u0022 title=\u002204/07/2014 03:28  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by Iron4venger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2014-04-07T15:15:24Z","Content":"\n\u003Cp\u003EIon drive to powerful?\u003C/p\u003E\u003Cp\u003E name = ModuleEngines\u003C/p\u003E\u003Cp\u003E thrustVectorTransformName = thrustTransform\u003C/p\u003E\u003Cp\u003E exhaustDamage = False\u003C/p\u003E\u003Cp\u003E ignitionThreshold = 0.1\u003C/p\u003E\u003Cp\u003E minThrust = 0\u003C/p\u003E\u003Cp\u003E maxThrust = .01\u003C/p\u003E\u003Cp\u003E heatProduction = 0\u003C/p\u003E\u003Cp\u003E PROPELLANT\u003C/p\u003E\u003Cp\u003EDone!\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-07T15:21:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveofDefeat\u0022 data-cite=\u0022DaveofDefeat\u0022\u003E\u003Cdiv\u003EIon drive to powerful?\u003Cp\u003E name = ModuleEngines\u003C/p\u003E\u003Cp\u003E thrustVectorTransformName = thrustTransform\u003C/p\u003E\u003Cp\u003E exhaustDamage = False\u003C/p\u003E\u003Cp\u003E ignitionThreshold = 0.1\u003C/p\u003E\u003Cp\u003E minThrust = 0\u003C/p\u003E\u003Cp\u003E maxThrust = .01\u003C/p\u003E\u003Cp\u003E heatProduction = 0\u003C/p\u003E\u003Cp\u003E PROPELLANT\u003C/p\u003E\u003Cp\u003EDone!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re right, it serves no purpose to talk about game balance issues, or offer any feedback to Squad. Thanks for pointing that out.\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2014-04-07T15:23:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EYou\u0027re right, it serves no purpose to talk about game balance issues, or offer any feedback to Squad. Thanks for pointing that out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour welcome!\u003C/p\u003E\n"},{"CreatedByName":"Iron4venger","CreatedById":89812,"CreatedDateTime":"2014-04-07T15:29:54Z","Content":"\n\u003Cp\u003EIn fact, and for reality reasons, exahustDamage should be \u003Cem\u003ETrue\u003C/em\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-04-07T15:48:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Iron4venger\u0022 data-cite=\u0022Iron4venger\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Epd. My solar glider had 100m roof before, now it reachs 10km easy and I\u0027m quite sure it\u0027s orbit capable.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d like to know if you really are able to get it to orbit\u003C/p\u003E\u003Cp\u003EI think I\u0027ve gotten mine to 20km and maybe 500 m/s\u003C/p\u003E\u003Cp\u003EIt takes a very long time to get there. DynamicWarp required! I always run into one of two problems though:\u003C/p\u003E\u003Cp\u003E- Run out of xenon\u003C/p\u003E\u003Cp\u003E- Run out of daylight\u003C/p\u003E\u003Cp\u003ELoading up on more xenon makes the ascent take much longer, which means I run out of light sooner. I haven\u0027t tried using drop-tanks or flying west though.\u003C/p\u003E\u003Cp\u003E(of course abusing infiniglide would make it possible, but I\u0027m trying to avoid that)\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-07T18:45:08Z","Content":"\n\u003Cp\u003EThe ion engine is now a good choice for Mun landings, even with the relatively inefficient 2-kerbal lander can. I\u0027m still not sure what to think of them, but at least the update changed the nature of the engine significantly.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-04-07T19:01:50Z","Content":"\n\u003Cp\u003ELast time I tried to make an ion sun-diver, along the lines of the \u0022This is KSP 3\u0022 sun-diver, the burn time was something like 18 and a half hours, and that\u0027s not including circularizing the orbit afterwards.\u003C/p\u003E\u003Cp\u003ELife is too short. I never did get that sun diver down there. Maybe now, I might do.\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-04-07T20:53:50Z","Content":"\n\u003Cp\u003EIf you wanted to be realistic, then it would also use less power I believe.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-04-08T01:50:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003ELast time I tried to make an ion sun-diver, along the lines of the \u0022This is KSP 3\u0022 sun-diver, the burn time was something like 18 and a half hours, and that\u0027s not including circularizing the orbit afterwards.\u003Cp\u003ELife is too short. I never did get that sun diver down there. Maybe now, I might do.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat was the mass of it, and what kind of orbit did it start from? I sun-dived a probe from a Kerbin type solar orbit in way less time than that... didn\u0027t keep track, but I don\u0027t think it was more than an hour (at x4), maybe more like 30 min?\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-04-08T01:55:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EBrachistichrone trajectories are done on real life ion engines to \u003Cstrong\u003Esave time\u003C/strong\u003E in real life, but doing repeated Hohmann burns is perfectly feasible, but takes repeated orbits and takes a longer time. \u003Cp\u003EDoing brachistichrone trajectories in KSP ironically takes longer because you are limited to a 4x physical time warp while you manually control where the craft should be going (as opposed to 100x or 1000x on rails time warp to complete orbits for repeated short Hohmann burns).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, the way it SHOULD work is allowing ion engines to work in on-rails time warp.\u003C/p\u003E\u003Cp\u003EThere\u0027s a mod for that (Orbit Manipulator Series), and I think KSP Interstellar has solar sails that work in on-rails time warp too.\u003C/p\u003E\u003Cp\u003EThen drop the thrust to like .01, and then you can use it at 100x time warp and the burn takes 80% of the (real, player\u0027s) time it would with a 0.23.5 2kN max-4x-warp ion engine. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEither way, this has nothing to do with the changes to the ion engine\u0027s stat buff, because it doesn\u0027t change where you could and could not go from previous versions. The dV is still the same for both. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn terms of dV alone, no, but it DOES change where you can go in terms of being able to land with ions on more bodies.\u003C/p\u003E\n"}]}