{"TopicId":68010,"ForumId":55,"TopicTitle":"Would you like reducing the thrust of the new engines?","CreatedByName":"manuelasa1999","CreatedById":10304,"CreatedDateTime":"2014-04-04T08:10:56Z","PageNum":6,"Articles":[{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-21T01:50:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EThe new parts made this possible.\u003Cp\u003E\u003Ca href=\u0022http://www.cs.helsinki.fi/u/jltsiren/ksp/eve_ship_7.jpeg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.cs.helsinki.fi/u/jltsiren/ksp/eve_ship_7.jpeg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m not complaining.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EClearly, this is cheating. And you should feel bad for using such OP engines to cheat with. Or something.\u003C/p\u003E\u003Cp\u003EPerfectly reasoned argument is perfectly reasoned!\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2014-05-21T09:45:19Z","Content":"\n\u003Cp\u003EI would like to present this SSTO for your consideration\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ToMa1Bs.png\u0022 alt=\u0022ToMa1Bs.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-21T10:02:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EThe new parts made this possible.\u003Cp\u003E\u003Ca href=\u0022http://www.cs.helsinki.fi/u/jltsiren/ksp/eve_ship_7.jpeg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.cs.helsinki.fi/u/jltsiren/ksp/eve_ship_7.jpeg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m not complaining.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is impressively massive. How much does it weigh? Have you got a mission report thread going?\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-05-21T11:04:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThat is impressively massive. How much does it weigh? Have you got a mission report thread going?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELanding mass was almost 1600 tonnes, while takeoff weight was something like 1570 tonnes. The mission took something like three weeks of real time to finish, and the report is spread over the \u0022What did you do in KSP today?\u0022 thread:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29533-What-did-you-do-in-KSP-today?p=1127865\u0026amp;viewfull=1#post1127865\u0022 rel=\u0022external nofollow\u0022\u003EConcept\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78662-Is-Asparagus-obsolete-with-SLS?p=1134583\u0026amp;viewfull=1#post1134583\u0022 rel=\u0022external nofollow\u0022\u003EAfter launch\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29533-What-did-you-do-in-KSP-today?p=1137174\u0026amp;viewfull=1#post1137174\u0022 rel=\u0022external nofollow\u0022\u003EDeorbiting test\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29533-What-did-you-do-in-KSP-today?p=1142229\u0026amp;viewfull=1#post1142229\u0022 rel=\u0022external nofollow\u0022\u003ERefueling\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29533-What-did-you-do-in-KSP-today?p=1159890\u0026amp;viewfull=1#post1159890\u0022 rel=\u0022external nofollow\u0022\u003ECrew transfer\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29533-What-did-you-do-in-KSP-today?p=1164028\u0026amp;viewfull=1#post1164028\u0022 rel=\u0022external nofollow\u0022\u003ELanding tests\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29533-What-did-you-do-in-KSP-today?p=1166097\u0026amp;viewfull=1#post1166097\u0022 rel=\u0022external nofollow\u0022\u003ELanding\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29533-What-did-you-do-in-KSP-today?p=1167760\u0026amp;viewfull=1#post1167760\u0022 rel=\u0022external nofollow\u0022\u003ETakeoff\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Muzza","CreatedById":66388,"CreatedDateTime":"2014-05-21T13:42:32Z","Content":"\n\u003Cp\u003EYes, the thrust value is realistic. But all the planets and the Sun are not, so it is unbalanced.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-05-21T13:46:41Z","Content":"\n\u003Cp\u003EWell, I only really came into KSP *after* the introduction of these engines, and in my eyes, the Skipper \u0026amp; Mainsail are the outliers. I avoid them like the plague.\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2014-05-21T13:59:17Z","Content":"\n\u003Cp\u003EFunny ... I can still find good use for the Mansail and Skipper. I don\u0027t care how the balance of the parts is right now or will be, if it fits my need, I\u0027ll use them.\u003C/p\u003E\n"},{"CreatedByName":"Hary R","CreatedById":111339,"CreatedDateTime":"2014-05-21T14:07:14Z","Content":"\n\u003Cp\u003EI personally don\u0027t think the OPness of the new engine come from the thrust, but the ISP. The LFB from ARM have 360s in space for 2000 kn of thrust. The skipper which is supposed to be used as a space stage have only 350s for 600 thrust.\u003C/p\u003E\u003Cp\u003EI don\u0027t mind their power, they are supposed to lift very heavy payload but being more efficient than the \u0022original\u0022 heavy engine... that\u0027s a no...\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2014-05-21T14:18:18Z","Content":"\n\u003Cp\u003EYeah agreed. If you look at real world examples ... 265 - 310 vac would be better.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-05-22T00:45:22Z","Content":"\n\u003Cp\u003EThe fact that new engines are overpowered is mathematically certain, and for good reasons:\u003C/p\u003E\u003Cp\u003E1)First of all, have you ever seen a big class E asteroid?\u003C/p\u003E\u003Cp\u003E2)They\u0027re designed to feet the career gameplay, where the act of unlocking new parts must worth the effort in money and science points, in a future career KSP also new and better version of the same part could be put in the tech tree (like an lv-t30 mk2 for example). It\u0027s a matter of career gameplay, not thought for sandbox.\u003C/p\u003E\u003Cp\u003E3)For a KSP expert the are no limit of weight to put into orbit in a single launch, it\u0027s only a matter of asparagus, orange tanks, mainsail and how many part can your CPU load before crash, the only limit it\u0027s our self-imposed rules (in my actual sandbox i\u0027m building a space station, i\u0027ve reached 80 tons of station in 10 launches even though I could do it in one launch only with new parts or with asparagus and old ones).\u003C/p\u003E\u003Cp\u003EPS Sorry for my bad english, but it\u0027s not my language.\u003C/p\u003E\n"},{"CreatedByName":"RedPine","CreatedById":95532,"CreatedDateTime":"2014-05-24T07:55:33Z","Content":"\n\u003Cp\u003ERelax, guys, .24 will balance things out.... with part costs! If inherently better engines are proportionally more expensive... then they will only be used for missions that actually require them, such as moving class E asteroids.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-05-24T09:02:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EWell, I only really came into KSP *after* the introduction of these engines, and in my eyes, the Skipper \u0026amp; Mainsail are the outliers. I avoid them like the plague.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s pretty accurate. Just because the Poodle, Skipper and Mainsail line are older doesn\u0027t inherently mean they are the better balance point.\u003C/p\u003E\u003Cp\u003ECompared to the 1.25m engines ... the Mainsail at least has good TWR, but the Skipper has slightly worse TWR than the LV-T30 and 20 sec less ISP both atmospheric and vacuum.... yeah, it has thrust vectoring, but that doens\u0027t mean much as command pod torque means you don\u0027t really need thrust vectoring on smaller rockets, so its lack on the LV-T30 doesn\u0027t hurt that much for many applications (I find myself hardly ever using LV-T45s). And the Poodle is just plain worse than a group of LV-909s.\u003C/p\u003E\u003Cp\u003EI think it could help to increase the mass of the Advanced Engine and 4xKS-25 cluster (I think that\u0027d be better than reducing the thrust) but the Skipper/Mainsail Isps should go up ... I\u0027d suggest 320/370 (like the LV-T30/T45) or 280/380 (like the Advanced Engine) for the Skipper, and 300/350 (current Skipper) or 320/360 (4xKS-25) for the Mainsail.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-05-24T09:36:22Z","Content":"\n\u003Cp\u003EIf so many people prefer the thrust / ISP / weight ratios of the new engines, then the older engines should be brought in line with this. I\u0027d prefer it to be the other way around personally though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-05-24T10:24:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EIf so many people prefer the thrust / ISP / weight ratios of the new engines, then the older engines should be brought in line with this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis sounds like a worse idea than nerfing the new engines to be inline with the old ones. They are meant to be outliers. The devs stated that they are meant to be an award for reaching the end of the tech tree (which they are badly placed for, but easily fixed). They would also make an excellent \u0022money sink\u0022 at end game by being very efficient performance wise, but less efficient budget wise. Sure, players could still be frugal with mainsail asparagus lifters, but those SLS engines would always be there, taunting the player to splurge money on them.\u003C/p\u003E\u003Cp\u003ETo draw an analogy to another open ended game: Simcity (2k, 3k, and 4). Coal power is reliable and cheap, but you\u0027re always looking at fancy power plants like fusion or a microwave receiver. They\u0027re costlier, and often produce less MWh per dollar than coal, but they take up less space and look very shiny in a city. Which is the correct choice?\u003C/p\u003E\u003Cp\u003EGetting even more speculative:\u003C/p\u003E\u003Cp\u003EI predict that breaking free of the narrow \u0022balanced\u0022 performance range for current engines and allowing for economic balancing would be a good thing for mods. Currently, making a mod that has better performance than stock parts can get disparaged as \u0022being cheaty\u0022, and one with worse performance falls into \u0022why bother?\u0022 By allowing for a greater range of performance capabilities while allowing for economic incentives/barriers to using certain parts will increase variety greatly. One mod could make bargain parts with terrible part performance and it could still find a place alongside a futuristic part pack that has great part performance.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-05-24T12:23:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ECoal power is reliable and cheap, but you\u0027re always looking at fancy power plants like fusion or a microwave receiver.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would a small engine have to be \u0027low tech\u0027 and a large engine have to be \u0027high tech\u0027?\u003C/p\u003E\u003Cp\u003EThings high in the tech tree should be things such as Ion and Nuclear. The 3.75m engines and 1.25m engines are all chemical so one shouldn\u0027t be magically better than the other. I just don\u0027t get this logic of if its bigger it has to be better?\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-24T12:55:42Z","Content":"\n\u003Cp\u003EI don\u0027t mind \u0027em.\u003C/p\u003E\u003Cp\u003EThey\u0027re a long way up the tree, so in career mode it means you have to have already \u0022proven yourself\u0022. They\u0027re convenience rockets that are your reward for making it all the way to the end.\u003C/p\u003E\u003Cp\u003EIn sandbox, there\u0027s something to be said for wanting to \u0022balance\u0022 the various rockets so that all parts have some use, since they\u0027re all available all the time... otherwise why bother having more than a couple of traditional rocket engines?\u003C/p\u003E\u003Cp\u003EBut when you think this argument through, it turns out that balancing all the rockets doesn\u0027t actually achieve this: If all of traditional the rocket engines effectively work out to be the same and it doesn\u0027t matter which one you use since you can just add more of one to be equivalent to another, then why bother having more than a couple of traditional rocket engines?\u003C/p\u003E\u003Cp\u003EBalancing the parts is best served by some other mechanism. Like maybe some parts need *specific* science. For example, no LVN\u0027s until you get to minmus and discover some new compound (via surface sample) that opens the door to this tech. Or maybe some parts are in limited supply and can only be built if you have enough of some-material-that-can\u0027t-be-produced-on-kerbin-but-is-plentiful-on-the-mun. Etc\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-05-24T21:42:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EWhy would a small engine have to be \u0027low tech\u0027 and a large engine have to be \u0027high tech\u0027?\u003Cp\u003EThings high in the tech tree should be things such as Ion and Nuclear. The 3.75m engines and 1.25m engines are all chemical so one shouldn\u0027t be magically better than the other. I just don\u0027t get this logic of if its bigger it has to be better?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe engines that represent newer technology should be better, two of them just happen to be bigger. I don\u0027t get how you thought I was making a \u0022bigger is inherently better\u0022 argument. \u003C/p\u003E\u003Cp\u003EAs for for all chemical engines being equal: not all chemical engines are created equal. Besides, LFO in KSP seems to be an abstraction for various fuel mixtures. Surely, the mainsail, LV-909, and LV-N aren\u0027t all using the same fuel type? They have wildly different performance capabilities. Yes I know the LV-N is not a \u0022chemical engine\u0022, but the propellant you run through it has a huge impact on its ISP. Its performance is closer to pure LH than LH/LOX, so maybe the LFO being run through it is abstracted and doesn\u0027t really have oxidizer at all?\u003C/p\u003E\n"},{"CreatedByName":"Evenger14","CreatedById":47013,"CreatedDateTime":"2014-05-25T04:53:20Z","Content":"\n\u003Cp\u003EI have to say no to the decreasing of thrust. As far as sandbox mode goes, if you want to skip to superheavy lifters then go ahead, but for me in career mode the ability to unlock larger and more capable parts is great and adds realism. It only makes sense that on a world where aerospace is funded at 100%, that they make great strides in rocket tech. I only wish we did the same IRL. 175 ton lifters would open the solar system to us so much more..\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-05-25T16:22:10Z","Content":"\n\u003Cp\u003EI hope you\u0027re kidding. Engines are already underpowered.\u003C/p\u003E\u003Cp\u003EGive us stronger engines, we know how to use thrust limiter.\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2014-05-25T16:46:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tortoise\u0022 data-cite=\u0022Tortoise\u0022\u003E\u003Cdiv\u003EI hope you\u0027re kidding. Engines are already underpowered.\u003Cp\u003EGive us stronger engines, we know how to use thrust limiter.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree. They\u0027d only be underpowered if the Kerbal universe wasn\u0027t scaled (1/10th scale I think) compared to our universe. The scaling means that you have significantly lower delta-v requirements to do stuff, like getting into orbit for example, and necessitates the engines in the game being nerfed compared to real-world engines, simply to preserve gameplay challenge. \u003C/p\u003E\u003Cp\u003EAlso, that right there is a clear-cut case of an Oberoni fallacy (\u003Ca href=\u0022http://1d4chan.org/wiki/Oberoni_Fallacy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://1d4chan.org/wiki/Oberoni_Fallacy\u003C/a\u003E). It is never the responsibility of the player to compensate for shoddy work on the part of the game designer.\u003C/p\u003E\u003Cp\u003ETo me it is more about gameplay balance, with the new engines being significantly better in terms of TWR and ISP compared to the older engines. It reflects bad design when an engine has absolutely no advantages over any other engine or when a single engine is better than any other engines for a given purpose. The LFB KR-1x2 is the clearest example of this, the Mainsail is basically only better in the event that you want to either mount something below or put less than a Jumbo above it, both of which are extremely rare cases.\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-05-25T17:06:04Z","Content":"\n\u003Cp\u003EI don\u0027t think thrust should be lowered, but I do think that weight should be increased and Isp should be lowered. Players would still be able to put large things into orbit easier than before ARM, but the old engines would actually regain their usefulness this way.\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2014-05-25T17:21:01Z","Content":"\n\u003Cp\u003EI think that the engines may seem out of plane now, but in future updates it will fall into place. For example, when contracts come out, a company might want you to place a large payload to orbit that would be impractical to do with a smaller launcher. and reducing part counts is always good!\u003C/p\u003E\n"}]}