{"TopicId":68010,"ForumId":55,"TopicTitle":"Would you like reducing the thrust of the new engines?","CreatedByName":"manuelasa1999","CreatedById":10304,"CreatedDateTime":"2014-04-04T08:10:56Z","PageNum":4,"Articles":[{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-04-05T18:26:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vesparco\u0022 data-cite=\u0022Vesparco\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E- They are overpowered in comparison to other engines yes, but the models are meant to reflect future NASA engine development, which of course should have higher performance than other real engines from the American and Russian space programs from the 60s (which are the ones that are reflecting current KSP stock and mod development). We are speaking of top tier technology and should behave as such (and that depends on which level of the tech tree you get them, which I don\u0027t know btw).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. Engine performance for RP1lox and hydrolox has already peaked. It did so 40 years ago and it isn\u0027t going to get significantly better.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-04-05T18:38:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maccollo\u0022 data-cite=\u0022maccollo\u0022\u003E\u003Cdiv\u003ENo. Engine performance for RP1lox and hydrolox has already peaked. It did so 40 years ago and it isn\u0027t going to get significantly better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you saying that NASA\u0027s upcoming hardware ISN\u0027T capable of carrying heavier payloads?\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-04-05T19:00:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EAre you saying that NASA\u0027s upcoming hardware ISN\u0027T capable of carrying heavier payloads?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe SLS will be able to launch a lot of stuff to orbit by virtue of being ****ing enourmus, not because we\u0027ve had some kind of technological breakthrough in engine performance.\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-04-05T19:05:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maccollo\u0022 data-cite=\u0022maccollo\u0022\u003E\u003Cdiv\u003ENo. Engine performance for RP1lox and hydrolox has already peaked. It did so 40 years ago and it isn\u0027t going to get significantly better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWrong. Check out the Merlin and F-1B engines that are going to used for next gen launchers. Engines get better with tech, that is the real world. Applicability to KSP is still up in the air though.\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-04-05T21:56:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceGremlin\u0022 data-cite=\u0022SpaceGremlin\u0022\u003E\u003Cdiv\u003EWrong. Check out the Merlin and F-1B engines that are going to used for next gen launchers. Engines get better with tech, that is the real world. Applicability to KSP is still up in the air though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll I could find out about the F1-B it\u0027s supposed to have similar performance as the F-1A, which was designed in the late 60s, and while the TWR of the Merlin D is impressive, it\u0027s TWR is 15%, not 2.5 times, greater than the NK33 which was also made in the late 1960s, and the Nk-33 has 20s higher ISP.\u003C/p\u003E\u003Cp\u003ESo no, not \u0022significantly\u0022 better in the sense that space X can\u0027t use the MerlinD to single stage 3% to LEO, like the new engines can single stage over 12% to low kerbin orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-05T21:59:15Z\u0022 title=\u002204/05/2014 09:59  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 5, 2014\u003C/time\u003E by maccollo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-04-05T22:17:24Z","Content":"\n\u003Cp\u003EI said applicability is still up in the air, because even if you go for the \u0022realistic\u0022 route of getting better engines with tech, the degree to which you would is going to be highly gamified. KSP rides a strange line between simulator and game.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Speed","CreatedById":72133,"CreatedDateTime":"2014-04-05T22:40:29Z","Content":"\n\u003Cp\u003Ethere is nothing wrong with the thrust, just the ISP and weight are not really in line with the other parts.\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-04-05T22:40:55Z","Content":"\n\u003Cp\u003EI think that the new engines are overpowered and should have an Isp reduction. The most overpowered new part is the LRB, it\u0027s unlocked along with the Mainsail and outperforms it in both TWR and Isp.\u003C/p\u003E\u003Cp\u003EThe reason I think the new engines (please note that I have nothing against the new tanks - they\u0027re great for reducing part count, too) are OP, though, is that there is a too big gap between the old parts and the ARM parts.\u003C/p\u003E\u003Cp\u003EI think the proper course of action would be to reduce the Isp of the new engines - especially the vacuum Isp. Many of the parts could also use a mass increase.\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-04-05T23:18:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceGremlin\u0022 data-cite=\u0022SpaceGremlin\u0022\u003E\u003Cdiv\u003EI said applicability is still up in the air, because even if you go for the \u0022realistic\u0022 route of getting better engines with tech, the degree to which you would is going to be highly gamified. KSP rides a strange line between simulator and game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, there I agree. I was countering the argument that these new engines are so much better (better, not more powerful) because it represents some technological leap.\u003C/p\u003E\u003Cp\u003EAnyway, since my opinion about this is scattered in about 5 different topics I should I\u0027ll summerise them into 3 points. Well 3... Make that 4.\u003C/p\u003E\u003Cp\u003EBigger more powerful engines allowing people, especially those with less powerful PCs, to launch big paylaods, is a good thing. Making a good rocket should be about designing smart, not endlessly attempting to make a huge 50 engine rocket not fall apart on the launch pad.\u003C/p\u003E\u003Cp\u003EI think KSP should at it\u0027s core be an analog to real space flight, and a liquid fuel that can derp a descent payload fraction to orbit in a single stage is not analogous to any real life engine.\u003C/p\u003E\u003Cp\u003EI don\u0027t think I\u0027m a \u0022KSP god\u0022, but I want to feel clever when I design rockets, by making the most optimal rocket according to some figure of merit, typically launch mass. Since the mainsail is like 99% always a detriment to the rocket performance when you could attach the much more efficient and more powerful KR-2L, well then I don\u0027t feel very clever and the designing experience is less rewarding. The same goes for the 48-7S btw.\u003C/p\u003E\u003Cp\u003EThis is why I\u0027d be in favour of boosting the thrust of the new engines, while nerfing their TWR and/or ISP. This would:\u003C/p\u003E\u003Cp\u003E -Remove the niche overlap between the 2.5 meter engines and the ARM engines\u003C/p\u003E\u003Cp\u003E -Still allow players to launch a lot of total mass with less parts (preferably the same total mass)\u003C/p\u003E\u003Cp\u003E -Be a better analogy to real life engines in the context of the game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-05T23:21:42Z\u0022 title=\u002204/05/2014 11:21  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 5, 2014\u003C/time\u003E by maccollo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-04-05T23:53:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESince the mainsail is like 99% always a detriment to the rocket performance when you could attach the much more efficient and more powerful KR-2L, well then I don\u0027t feel very clever and the designing experience is less rewarding. The same goes for the 48-7S btw.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is true right now, yes, but this is why I can\u0027t wait for extra balancing points (namely economic balance). With the right price to performance ratio, everything can still have a place in the inventory without adhering to the old sandbox balance. If a bundle of mainsails is dirt cheap enough, they will always be viable. Heck, make the SLS parts cost money \u003Cem\u003Eand\u003C/em\u003E reputation (such as calling in favors from Kerbodyne to get the parts) to prevent them from being the go-to 100% of the time.\u003C/p\u003E\u003Cp\u003EAgain, I expect them to be stat-tweaked (maybe a little, maybe a lot). I\u0027m just trying to raise counterpoints against the immediate reactionary response of bringing them in line with existing parts. The SLS parts are out of place right now, but not unintentionally. I feel like Squad is going somewhere with this, and I want to see it.\u003C/p\u003E\n"},{"CreatedByName":"Vesparco","CreatedById":35107,"CreatedDateTime":"2014-04-06T13:04:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maccollo\u0022 data-cite=\u0022maccollo\u0022\u003E\u003Cdiv\u003ENo. Engine performance for RP1lox and hydrolox has already peaked. It did so 40 years ago and it isn\u0027t going to get significantly better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe you speak from the chemical point of view (in which you are of course right), but still there are a lot of improvements to make: Injector geometries (Apollo program was base empirical design), thrust chamber designs (for higher temperatures), more powerfull turbopump systems,etc. This kind of improvements are far from being groundbreaking but can explain the little gap between ones and the others.\u003C/p\u003E\u003Cp\u003ESaid this, I agree that needs a little balance in order to not ditch other lower performing elements.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-04-06T13:08:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceGremlin\u0022 data-cite=\u0022SpaceGremlin\u0022\u003E\u003Cdiv\u003EThis is true right now, yes, but this is why I can\u0027t wait for extra balancing points (namely economic balance). With the right price to performance ratio, everything can still have a place in the inventory without adhering to the old sandbox balance. If a bundle of mainsails is dirt cheap enough, they will always be viable. Heck, make the SLS parts cost money \u003Cem\u003Eand\u003C/em\u003E reputation (such as calling in favors from Kerbodyne to get the parts) to prevent them from being the go-to 100% of the time.\u003Cp\u003EAgain, I expect them to be stat-tweaked (maybe a little, maybe a lot). I\u0027m just trying to raise counterpoints against the immediate reactionary response of bringing them in line with existing parts. The SLS parts are out of place right now, but not unintentionally. I feel like Squad is going somewhere with this, and I want to see it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo would you object to balancing the engines to eachother now (satisifying sandbox) and when the other mechanics come in, economics for example, use those mechanics to balance the engines for career mode, both sides are happy.\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2014-04-06T14:17:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003ESo would you object to balancing the engines to eachother now (satisifying sandbox) and when the other mechanics come in, economics for example, use those mechanics to balance the engines for career mode, both sides are happy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t played with the engines enough to know if their stats are unbalanced but that sounds like a good solution to me. A lot of people keep missing the idea that when economics are put in these things are most likely going to be the most expensive part we have ever seen.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-04-06T14:47:44Z","Content":"\n\u003Cp\u003EI am simply amazed by the amount of crying over the new engines. I have yet to use the new engines or really any of the new parts because they aren\u0027t that great when mated with the Realism Overhaul running real Earth solar system. It doesn\u0027t matter if I am launching a satellite into orbit from Kennedy Space Center in Florida or launching from the Russian Space Center in southern Russia. Getting a rocket into orbit around Earth at a LEO, still takes over 9400m/s d/V, it still takes a fine balance of TWR to make sure you dont over accelerate and destroy the probe or kill the crew during the launch. Sure the new engine seems powerful but when you have the option of a 10000kn thrust engine that can inhale more fuel than you can dream of in a launch, and find out that it was ACTUALLY MADE, you find that your perspective changes a bit on balance. \u003C/p\u003E\u003Cp\u003ESo TL;DR\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStop crying about balance, it is only BETA .235!!!!!!!!!!\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-04-06T23:07:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hodo\u0022 data-cite=\u0022Hodo\u0022\u003E\u003Cdiv\u003E -snip-\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStop crying about balance, it is only BETA .235!!!!!!!!!!\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy does that matter what version it is? At what point during development are we then able to complain about balance? Just because it is version 0.23.5 doesn\u0027t mean that there is 0.76.5 more versions to go, it doesn\u0027t work like that.\u003C/p\u003E\u003Cp\u003EAlso real life has no bearing on the game, I don\u0027t hear you complaining about how overpowered the ion engine is compared to real life, if real life is your argument then you are using special pleading. It\u0027s ok, theses engines are fine, they are realistic, oh don\u0027t worry about the ion engine, realism doesn\u0027t apply to it. Gameplay is all that matters. My perspective doesn\u0027t change one bit by leaning that a comparable rocket exists, and neither should yours.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boomerdog200\u0022 data-cite=\u0022boomerdog200\u0022\u003E\u003Cdiv\u003E I haven\u0027t played with the engines enough to know if their stats are unbalanced but that sounds like a good solution to me. A lot of people keep missing the idea that when economics are put in these things are most likely going to be the most expensive part we have ever seen.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry just to clarify, I do know the people want to use the economics to balance the engines, however most of the time I see people saying, \u0022Stop complaining that the engines are overpowered, they will be balanced by the economics\u0022. Do you agree with me that the engines could/should be balanced in sandbox first and career second because it has more variables to use use for balancing?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T23:16:52Z\u0022 title=\u002204/06/2014 11:16  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by Dodgey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scoundrel","CreatedById":15369,"CreatedDateTime":"2014-04-07T00:48:23Z","Content":"\n\u003Cp\u003EIn my humble opinion, I think the amount of peak thrust is okay for the new 3m engines, but the light mass of the big engines surprises me for their size. I personally would like to see them heavier (they should mass around 13 tons or so rather than the half ton more than a mainsail) so there\u0027s some sort of consistency with the other engines in terms of mass and scale. Unfortunately, without a dev to weight in and share some insight into their decisions (or a streamer to ask them how they came up with the stats they did, and the rationale behind it, and if they intend to go through the parts later on and fix the inconsistencies *hint hint*) we can only speculate as to their thought process and rationales. Of course engines aren\u0027t the only things that are inconsistent: one only has to look at the nose cones, adapters and parachutes to see that the numbers appear to have been picked out of thin air... but that\u0027s a topic for another thread.\u003C/p\u003E\u003Cp\u003EI also think that fixing ISP so it doesn\u0027t work like a weird form of SFC (that\u0027s specific fuel consumption for those that don\u0027t know) would attenuate most of the issues people have with the various engines. It would make it a little tougher to get into orbit, but the more I dwell on the subject, the more I am convinced that physics offers the solution, even if a lot of players would be squidgey at the idea of an engine\u0027s peak thrust being dependent on atmospheric pressure (ie: altitude).\u003C/p\u003E\u003Cp\u003EAs for rationalizations about what the tech tree is and isn\u0027t, if I may be permitted to quote HarvesteR from \u003Ca href=\u0022http://bestofama.com/amas/1qjoe2\u0022 rel=\u0022external nofollow\u0022\u003Ethis interview\u003C/a\u003E:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003ENovember 13, 2013 12:16:04 PM MST\u003C/em\u003E\u003C/span\u003E\u003Cp\u003EThe tech tree was always meant to work as an introduction tool to KSP. A more \u0027conventional\u0027 tutorial would have probably worked too, but it would be exceedingly long and pretty boring. Plus, I think a game should always give players means to discover it by simply playing, and this is what we set out to do with R\u0026amp;D.\u003C/p\u003E\u003Cp\u003EI don\u0027t think any player, veteran or first-timer, would enjoy sitting through an overly long \u0027lesson\u0027 on what each part does. And more importantly, they wouldn\u0027t get to experience first hand the problems that some parts exist to solve. If you\u0027ve never experienced the problem of tall ships falling over on the pad, then you won\u0027t fully appreciate the fact that launch clamps exist.\u003C/p\u003E\u003Cp\u003EIn the end, the R\u0026amp;D system works to let everyone experience the process of gradually developing your space program, learning as you go how to overcome the problems you encounter. For new players, this allows them to get into the game without having to sit through an introduction, and for veterans, the restrictions are also a good thing, as they set them (or rather \u0027us\u0027) up with new challenges that require us to come up with new ways to tackle old problems. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHopefully that should resolve any circular arguments about what it is and isn\u0027t, and what Squad\u0027s position on the topic is, so we can avoid the vitriol that seems to bleed from such points of contention. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn summary, it is my humble opinion that making the engines heavier and implementing proper ISP would appear to be the best solution.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-07T02:29:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EWhy does that matter what version it is? At what point during development are we then able to complain about balance? \u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EIt matters because the game is not yet scope complete. \u003C/p\u003E\u003Cp\u003EIt would be appropriate to complain about balance when all the game\u0027s mechanics to balance the game (like currency \u0026amp; budgets) are in place \u003Cem\u003Eand\u003C/em\u003E the engines remain unbalanced.\u003C/p\u003E\u003Cp\u003EIf they balanced these parts now, they would have to completely re-balance it in 0.24, and any work they did for 0.23.5 would be completely wasted. And even in 0.24, it may not be fully balanced because, again, all the parts may not be there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T02:32:00Z\u0022 title=\u002204/07/2014 02:32  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-04-07T02:50:07Z","Content":"\n\u003Cp\u003ESo why would they have to re-balance the engines in 0.24? Assuming that economics are added in that update wouldn\u0027t it make sense to balance the economics to the engines? Which means that the engines are balanced in both sandbox and career mode. Also seeing as the game is not yet scope complete are you of the opinion that the balancing of the Ion engine in 0.23.5 and the aerospike in previous updates was a waste of time?\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2014-04-07T04:29:10Z","Content":"\n\u003Cp\u003EI\u0027m not sure why you would even complain about non-perfect balance in sandbox. There is literally no limitation or even guideline on building rockets, everything come from your own motivation and the aims you want to achieve. Seriously, the limits of a CPU is one of the biggest balancing instruments right now. Therefore every performance-improvement and is potentially op!\u003C/p\u003E\u003Cp\u003EYou cant completely balance sandbox mode, its just for fun. Or do you use asparagus staging for every single rocket? That would be the logical conclusion when trying to build the most efficient vehicle.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-04-07T06:03:15Z","Content":"\n\u003Cp\u003EAnybody who thinks these parts are overpowered must first:\u003C/p\u003E\u003Cp\u003ETrack a class E asteroid.\u003C/p\u003E\u003Cp\u003ECapture it.\u003C/p\u003E\u003Cp\u003EDrag it into low Kerbin orbit.\u003C/p\u003E\u003Cp\u003EDo it all with Jumbo 64s, Mainsails and Skippers.\u003C/p\u003E\u003Cp\u003EOh, and do it on an old AMD X4 640 CPU.\u003C/p\u003E\u003Cp\u003EAlso, get off my gameplay. I\u0027m loving it.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-04-07T06:19:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temeter\u0022 data-cite=\u0022Temeter\u0022\u003E\u003Cdiv\u003EI\u0027m not sure why you would even complain about non-perfect balance in sandbox. There is literally no limitation or even guideline on building rockets, everything come from your own motivation and the aims you want to achieve. Seriously, the limits of a CPU is one of the biggest balancing instruments right now. Therefore every performance-improvement and is potentially op!\u003Cp\u003EYou cant completely balance sandbox mode, its just for fun. Or do you use asparagus staging for every single rocket? That would be the logical conclusion when trying to build the most efficient vehicle.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am still limited by the laws of the game and the physics of the game when I play sandbox, ths includes the parameters of the parts that I use. Your argument about the limits on building limits have no merit as we don\u0027t yet know how economics will be implemented into the game, so we don\u0027t know how any of those limitations would apply to career mode, effectively removing the destinction between career and sandbox in that aspect. I ask you what is so bad about balencing sandbox mode, if career mode can be balanced also using different means?\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-07T06:22:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EAnybody who thinks these parts are overpowered must first:\u003Cp\u003ETrack a class E asteroid.\u003C/p\u003E\u003Cp\u003ECapture it.\u003C/p\u003E\u003Cp\u003EDrag it into low Kerbin orbit.\u003C/p\u003E\u003Cp\u003EDo it all with Jumbo 64s, Mainsails and Skippers.\u003C/p\u003E\u003Cp\u003EOh, and do it on an old AMD X4 640 CPU.\u003C/p\u003E\u003Cp\u003EAlso, get off my gameplay. I\u0027m loving it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow about I do it with the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75272-0-23-x-Stock-Rebalance-Project-v1-1-6-04-14\u0022 rel=\u0022external nofollow\u0022\u003EFixed version of the big engines?\u003C/a\u003E And enjoy a useful RM 55 while I\u0027m at it?\u003C/p\u003E\n"},{"CreatedByName":"xrayfishx","CreatedById":76147,"CreatedDateTime":"2014-04-07T07:30:05Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Bv7bPjl.jpg\u0022 alt=\u0022Bv7bPjl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe new engines are just as powerful, in terms of thrust, as they should be. In fact, I think we could even use a more powerful engine. The ISP and TWR are messed up. In the beginning of the thread people said that those who use KW and Nova don\u0027t consider them OP. I use both and I call BS. I don\u0027t use the new engines because they are so much better that there is absolutely NO challenge in doing anything with them. \u003C/p\u003E\u003Cp\u003EHere are some common pro-current stats arguments:\u003C/p\u003E\u003Cp\u003E\u0022Try capturing an E-class with less powerful parts!\u0022\u003C/p\u003E\u003Cp\u003EE-class is the biggest class there is. It makes sense for capturing that to be a challenge even for someone who has put 2000h into KSP.\u003C/p\u003E\u003Cp\u003E\u0022SQUAD wants us to focus on what to do in orbit rather than getting there!\u0022\u003C/p\u003E\u003Cp\u003EStill, I shouldn\u0027t be able to create a single-stage-to-Tylo-landing (possibly even Moho) craft that doesn\u0027t even have to be refueled. It should still be a challenge to get past LKO or at least Kerbin\u0027s SOI.\u003C/p\u003E\u003Cp\u003E\u0022The tech tree balances it!\u0022\u003C/p\u003E\u003Cp\u003EI don\u0027t even understand where SQUAD wants to take the tech progression. In my opinion it should be either \u003C/p\u003E\u003Cp\u003Ea) I can create huge rockets pretty much from the beginning, but it becomes progressively easier so that once I got the grip on getting to orbit, it quickly becomes trivial and focuses me on doing things in orbit... or\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E I can only create small rockets and then progressively create bigger ones as I advance. Getting to orbit will remain somewhat of a challenge and a part of the mission, but the mission can be bigger.\u003C/p\u003E\u003Cp\u003EThese are SQUAD\u0027s options for a tech tree that introduces me to the game, like a tutorial (which is what they stated they want it to be). So far they have been going with B, but that would mean parts that are balanced more like KW/Nova.\u003C/p\u003E\u003Cp\u003EIf they went with A, they would have to create both efficient and inefficient engines of all sizes and introduce them from least efficient to most efficient, not by size and then those engines would make sense, if they had inefficient counterparts.\u003C/p\u003E\u003Cp\u003E\u0022Money will balance it!\u0022\u003C/p\u003E\u003Cp\u003EAs it is, I can pretty much make up with fuel costs.\u003C/p\u003E\u003Cp\u003E[edit]\u003C/p\u003E\u003Cp\u003E\u0022You could edit the parts if you don\u0027t like them!\u0022\u003C/p\u003E\u003Cp\u003EI could eat a bowl of alphabet soup and poop a better argument than this. \u003C/p\u003E\u003Cp\u003EWhy have balanced parts that you can edit to be OP if you can have OP parts that you can edit to be balanced? Makes sense, doesn\u0027t it?\u003C/p\u003E\u003Cp\u003EI will eventually take that time and edit them. Also I will edit ion engines to have a thrust of 0.1kN and better ISP. The difference between the two is that the ion engine\u0027s thrust was something that made most people never use it, therefore this being OP is justified, while there is no excuse for OP lifter parts.\u003C/p\u003E\u003Cp\u003E[/edit]\u003C/p\u003E\u003Cp\u003EAfter they introduce money (probably in 0.24), they should make an update solely focused on balancing everything. The longer they wait with that, the more difficult it will become, until they decide to do it only enough that it\u0027s kinda ok and leave it at that, simply because they don\u0027t want it to take endless amounts of time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T08:05:41Z\u0022 title=\u002204/07/2014 08:05  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by xrayfishx\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NWM","CreatedById":67386,"CreatedDateTime":"2014-04-07T07:55:28Z","Content":"\n\u003Cp\u003EMen! Is it fun tu take 25% of the starting fuel to LKO with a reusable single stage rocket?\u003C/p\u003E\u003Cp\u003EAnd the trust is the smallest problem.\u003C/p\u003E\u003Cp\u003E2500kN - ok double size of the mainsail, but \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E6,5\u003C/strong\u003E\u003C/span\u003Etons?\u003C/p\u003E\u003Cp\u003EAnd this is the most acceptable...\u003C/p\u003E\u003Cp\u003Ethe rest: \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E20\u003C/strong\u003E\u003C/span\u003E durability? And the attachment mesh? If ti would be a mod on Spaceport, it were classified: \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Epiece of garbage\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2014-04-07T15:43:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EI am still limited by the laws of the game and the physics of the game when I play sandbox, ths includes the parameters of the parts that I use. Your argument about the limits on building limits have no merit as we don\u0027t yet know how economics will be implemented into the game, so we don\u0027t know how any of those limitations would apply to career mode, effectively removing the destinction between career and sandbox in that aspect. I ask you what is so bad about balencing sandbox mode, if career mode can be balanced also using different means?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you cant argue with things we dont have exact information on and therefore have to orient all discussion on a secondary, just-for-fun sandbox mode without inherent balancing mechanisms at all while ignoring the meat of the game? That almost looks like a logical fallacy. Its impossible to discuss something when ignoring the most important elements. You have to make assumptions about SQUADs reasoning and plans behind this, otherwise there is no merit at all in pure complaining. Of course we have very little info on what these parts are supposed to represent. Its just obvious they are more effective by purpose.\u003C/p\u003E\u003Cp\u003EAlso, there is another thing about pure sandbox balancing. The actuall limit is defined by the most complex rocket you can effectively build, ARM pushes that barrier just a bit up. And not even that far, because the thrust is very low for 3.5m-parts. Even the 2.5m-parts should allow you to build everything your pc can handle.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T15:46:49Z\u0022 title=\u002204/07/2014 03:46  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by Temeter\u003C/strong\u003E\n\u003C/span\u003E\n"}]}