{"TopicId":68298,"ForumId":32,"TopicTitle":"How Many Of You Used Your Roid As An Aero-Brake Shield?","CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2014-04-05T22:40:35Z","PageNum":1,"Articles":[{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2014-04-05T22:40:35Z","Content":"\n\u003Cp\u003EI found it easy to use MJ\u0027s aero braking predictor... but was it cheating heh.\u003C/p\u003E\u003Cp\u003EThere was one bit where I REALLY panicked because I had run out of RCS fuel to turn the ship and my electric charge was running down due to not enough batteries (I really planned it badly) and everyone knows that leaving solar panels out during aero-braking is a REALLY stupid idea. The power ran out JUST as my ship and roid were exiting the atmo (I loved that MJ now has a countdown timer to atmo exit - when did that get added).\u003C/p\u003E\u003Cp\u003EWas almost an Armageddon moment.\u003C/p\u003E\u003Cp\u003EKnowing what I did wrong on that mission, it\u0027s a wonder that nothing fouled up... I never even used a reload... Still, that\u0027s what makes KSP so much fun... pushing though the problems and solving them, Apollo 13 style.\u003C/p\u003E\u003Cp\u003EI had to admit I was worried about the ARM pack as I had tried to do it with those modded asteroids and failed dismally. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIt\u0027s the tracking that helps a lot. But can we push out the tracking fog-of-war zone with satellites? \u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-04-05T23:03:24Z","Content":"\n\u003Cp\u003ENah, I see aerobraking an asteroid as cheating. While we can assume that Kerbal crafts are heat resistant, asteroids would probably get damaged. So I\u0027d rather not abuse the fact that the atmosphere is KSP has no re-entry heat and fly a huge rock through it.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MrCoolx10","CreatedById":81755,"CreatedDateTime":"2014-04-05T23:04:18Z","Content":"\n\u003Cp\u003EUse them as lithobraking shields. It\u0027s crazy how effective they are.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2014-04-05T23:18:35Z","Content":"\n\u003Cp\u003ELOL... you know Danny is going to do that in many wonderful ways...\u003C/p\u003E\n"}]}