{"TopicId":68301,"ForumId":16,"TopicTitle":"Duna - what is the optimal parachute deployment altitude?","CreatedByName":"kerbonaut101","CreatedById":65083,"CreatedDateTime":"2014-04-05T23:00:22Z","PageNum":1,"Articles":[{"CreatedByName":"kerbonaut101","CreatedById":65083,"CreatedDateTime":"2014-04-05T23:00:22Z","Content":"\n\u003Cp\u003EI got a manned heavy lander to Duna, then it crashed during a powered descent... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E So i decided that it would be safer to use parachutes. As Duna\u0027s atmosphere is thinner than Kerbin\u0027s what do you think is the best altitude to deploy parachutes at (I only just realised there was a slider to chage that)?\u003C/p\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2014-04-05T23:35:48Z","Content":"\n\u003Cp\u003ESemi-deploy them as fast as possible. Typically this would mean 8 km or thereabouts; as for full deployment altitude (which is what the slider affects), it\u0027s a tradeoff, I guess. If you come in on a shallow angle and reduce your speed early on, you can probably get away with early deployment.\u003C/p\u003E\n"},{"CreatedByName":"Jimbimbibble","CreatedById":77859,"CreatedDateTime":"2014-04-06T05:35:59Z","Content":"\n\u003Cp\u003EI would come in as shallow as you can, semi-deploy ASAP and full deploy at 2km. You can also stagger your chutes if you\u0027re concerned about breaking things on deployment.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-06T06:02:00Z","Content":"\n\u003Cp\u003EIf you\u0027re concerned about things breaking up, use some drogues. They will pre-decelerate your ship before main chutes open.\u003C/p\u003E\u003Cp\u003ETo determine number of chutes, use \u003Ca href=\u0022http://ksp.freeiz.com/\u0022 rel=\u0022external nofollow\u0022\u003Eparachute calculator\u003C/a\u003E. It does not calculate drogues but use them anyway.\u003C/p\u003E\u003Cp\u003EAnd preferably land somewhere low.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-04-06T09:26:29Z","Content":"\n\u003Cp\u003EDROGUES, and open them as soon as freaking possible. The rest should be tweaked to open a little higher. However, with 100% untweaked drogues and large blue chutes, I\u0027ve gotten a 15-ton lander to the ground at about 20 m/s, requiring only a short burst of thrust for last-minute braking.\u003C/p\u003E\n"},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2014-04-06T09:47:18Z","Content":"\n\u003Cp\u003Eif you get your spaceship ripped apart by the fully deploying chutes, try to deploy just one to full. maybe it gets ripped away, maybe not. but it will slow you down. heavier ships can be landed safely by having a cascade of parachutes opening at different heights.\u003C/p\u003E\u003Cp\u003Eespecially spaceships that have a weak part (dockingports for example) in the middle are vulnerable of getting ripped apart. one solution that works for me: parachutes on both parts, fully opening simultanously.\u003C/p\u003E\u003Cp\u003Eoh, and try to get your trajectory at the most shallow angle possible.\u003C/p\u003E\n"},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2014-04-06T11:13:49Z","Content":"\n\u003Cp\u003EOpen chutes before you hit the ground (duh) \u003C/p\u003E\u003Cp\u003E\u0026gt; come at Duna at a shallow angle, use a drogue chute amd some retro burn near surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/f4DdNxQ.png\u0022 alt=\u0022f4DdNxQ.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T11:16:40Z\u0022 title=\u002204/06/2014 11:16  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by Lohan2008\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-04-06T11:59:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ravenchant\u0022 data-cite=\u0022Ravenchant\u0022\u003E\u003Cdiv\u003ESemi-deploy them as fast as possible. Typically this would mean 8 km or thereabouts; as for full deployment altitude (which is what the slider affects), it\u0027s a tradeoff, I guess. If you come in on a shallow angle and reduce your speed early on, you can probably get away with early deployment.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStandard parachutes semi-deploy at almost exactly 9km on Duna.\u003C/p\u003E\u003Cp\u003EDrogues semi-deploy at almost exactly 10km on Duna.\u003C/p\u003E\u003Cp\u003EOf course you want them semi deployed ASAP to slow you down more before full deployment - drogues again help a bit here because their semi-deploy drag is 4x higher than the other chutes.\u003C/p\u003E\u003Cp\u003EThe first chutes that open should be on the heaviest parts of your craft - ie if you have a full fuel tank, you should have some chuts on it, not on a part that is attached to it (as this will likely rip that part off your fuel tank). Even drogue opening can be a shock if you come in fast and deploy at 5km.\u003C/p\u003E\u003Cp\u003EI\u0027d say full deploy on the drogues at 2.5 km, full deploy on the rest can come at pretty much any point after your drogue(s) open(s).\u003C/p\u003E\u003Cp\u003EIf not using drogues, then stagger the openings, again starting with the chutes attached to the most massive parts first.\u003C/p\u003E\u003Cp\u003EThis game really needs the radial drogue chutes to be stock parts....\u003C/p\u003E\n"},{"CreatedByName":"Smorfty","CreatedById":59234,"CreatedDateTime":"2014-04-06T12:06:40Z","Content":"\n\u003Cp\u003EWhat kind of question is that?\u003C/p\u003E\u003Cp\u003EDeploy them as early as possible of course. Use both drogues and normal ones.\u003C/p\u003E\u003Cp\u003EDon\u0027t depend on them to give you a soft landing though.\u003C/p\u003E\u003Cp\u003EEven in the deepest valley of Duna with 20\u002B parachutes, you\u0027ll \u0022land\u0022 at 10\u002B m/s.\u003C/p\u003E\u003Cp\u003EYou always have to use your engines at least a little bit.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-04-06T21:35:51Z","Content":"\n\u003Cp\u003EUmm, no....\u003C/p\u003E\u003Cp\u003E\u0022Deploy them as early as possible of course.\u0022\u003C/p\u003E\u003Cp\u003EThis can cause problems if you are still significantly faster than terminal velocity - like rip your ship apart problems.\u003C/p\u003E\u003Cp\u003EDoing a full deplot of main chutes at 2500 vs 500 meters won\u0027t change your touchdown speed. I can\u0027t think of a scenario where 500m is not enough time for your main chutes to decelerate your ship, where an earlier opening would have helped rather than ripped the craft apart.\u003C/p\u003E\u003Cp\u003EFull deploy your drogues if your G meter reads less than 1 G while you are within 5km of the surface\u003C/p\u003E\u003Cp\u003EFull deploy your mains when your meter drops below 1 G again following the drogue deployment.\u003C/p\u003E\u003Cp\u003E\u0022Even in the deepest valley of Duna with 20\u002B parachutes, you\u0027ll \u0022land\u0022 at 10\u002B m/s.\u003C/p\u003E\u003Cp\u003EYou always have to use your engines at least a little bit.\u0022\u003C/p\u003E\u003Cp\u003ENot true, I\u0027ve done many completely unpowered descents. In some cases everything was fine, in other cases, my kerbals had to repair the landing legs.\u003C/p\u003E\u003Cp\u003EI\u0027ve also dropped lightweight 1 way probes with no engines at all.\u003C/p\u003E\u003Cp\u003EHowever... if your craft does have engines, it may actually be better to use them, than to add more chuts and landing struts - its often better to spend 5-10 m/s of lander dV on touchdown, than to haul the extra mass of the chutes and struts to Duna.\u003C/p\u003E\u003Cp\u003EI never really considered using wings on Duna, as you can\u0027t use air breathing engines... but recently I was making an Eve mission, where I was going to deliver the ascent vehicle, and a science rover separately - and I figured... I should add wings to the science rover to make landing near the ascent vehicle easier.\u003C/p\u003E\u003Cp\u003EAnd... the wings would jsut get in the way when roving around, so I added decouplers, and attached the wings to those.\u003C/p\u003E\u003Cp\u003ENow it occurs to me, that using wings on Duna could remove the need for drogue chutes.\u003C/p\u003E\u003Cp\u003ELacking the ability to use jets, any ascent would be a vertical climb and gravity turn as if there were no wings, so I don\u0027t think I\u0027d bother with making a spaceplane design (not to mention a horizontal landing would require very careful landing site selection).\u003C/p\u003E\u003Cp\u003ESo next I\u0027m going to try out using wings on decouplers... as I figure it:\u003C/p\u003E\u003Cp\u003EMy lander will be coming in pointing retrograde, with the landing chutes at the top, so I design my wings to be aerodynamically stable with the lander flying \u0022backward\u0022 (I\u0027ll use and inverted small probe core, so I can click \u0022control from here\u0022, and fly it without the reversed controls)\u003C/p\u003E\u003Cp\u003E- I should be able to pitch up and slow it down/flare, then pop the chutes and then quickly decouple the wings.\u003C/p\u003E\u003Cp\u003EIt should be even easier than my Eve rover, as I was trying to land that thing still facing horizontal, and my parachtues weren\u0027t at the retrograde end.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-prn2/t31.0-8/p600x600/1669970_10102576772983113_4780869638512329231_o.jpg\u0022 alt=\u00221669970_10102576772983113_4780869638512329231_o.jpg\u0022\u003E\u003C/p\u003E\n"}]}