{"TopicId":68465,"ForumId":55,"TopicTitle":"Air brakes?","CreatedByName":"XyllyX","CreatedById":105335,"CreatedDateTime":"2014-04-06T23:23:26Z","PageNum":1,"Articles":[{"CreatedByName":"XyllyX","CreatedById":105335,"CreatedDateTime":"2014-04-06T23:23:26Z","Content":"\n\u003Cp\u003EI\u0027m just wondering, I know B9 has some, but if you\u0027re going to put planes in your game, can we have air brakes please? \u003C/p\u003E\u003Cp\u003EMaybe some people will complain they\u0027re OP, but of course air brakes are a very real construct and if you follow real-life examples, you can\u0027t really go wrong in having them.\u003C/p\u003E\u003Cp\u003EI think even the NASA shuttle has an air brake, plus it would make lateral landings a lot less frustrating, especially since some of the textures make it hard to see how close to the ground you are, even with lights on.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-07T00:00:28Z","Content":"\n\u003Cp\u003EThis suggestion moved to the suggestions sub-forum.\u003C/p\u003E\n"},{"CreatedByName":"Anthlon","CreatedById":58074,"CreatedDateTime":"2014-04-07T15:34:12Z","Content":"\n\u003Cp\u003EI have same feeling for long time now, i would like to have anything to adjust(increase/switch) drag during flight, it does not need to be necesary same like B9 aero breaks, or duck nose like shuttle, but some extends would be nice. Maybe some limitations for that, i know that the some breaks from mods could slow realy low for example from freefall, so some efectivity until lower speed and than no efectivity, that would be nice to include\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-04-07T18:32:38Z","Content":"\n\u003Cp\u003EMaybe flaps which increase lift as well as drag, for landings and takeoffs?\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-04-07T19:21:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Anthlon\u0022 data-cite=\u0022Anthlon\u0022\u003E\u003Cdiv\u003EI have same feeling for long time now, I would like to have anything to adjust(increase/switch) drag during flight, it does not need to be neceSsary same like B9 AIRbrakes, or duck nose like shuttle, but some extends would be nice. Maybe some limitations for that, i know that the some breaks from mods could slow realLy low for example from freefall, so some efFectivity until lower speed and thEn no efFectivity, that would be nice to include\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as I know, you can use intakes and parachutes for drag changes. Maybe change an intake to have lots of drag, and toggle it using action groups.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-07T20:08:48Z","Content":"\n\u003Cp\u003EWhy would air brakes be considered OP? Honest question.\u003C/p\u003E\n"},{"CreatedByName":"Raven.","CreatedById":99340,"CreatedDateTime":"2014-04-07T20:14:47Z","Content":"\n\u003Cp\u003EWell, there\u0027s a couple things to take into consideration here. In the stock game, air brakes are needed to any fixed wing craft that is re-entering the atmosphere in order to help control air speed. We need these because there are a couple of other things that we do not have in the stock game: drag chutes and flaps. Another thing is that my experience has been that air brakes have a tendency to create too much drag too quickly. But of course I\u0027m use to those in the B9 and Firespitter packs. They will need to be toned down considerably if they are to be made stock.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-04-07T22:25:55Z","Content":"\n\u003Cp\u003Emaybe Flaps could act as flaps (increase lift \u0026amp; drag) when attached to the underside of a wing, but when they are attached above they could just increase drag. maybe. i would like to have them however they are implemented.\u003C/p\u003E\n"}]}