{"TopicId":68580,"ForumId":36,"TopicTitle":"The SOS Sink-O-Tron","CreatedByName":"soldieroffilth","CreatedById":88590,"CreatedDateTime":"2014-04-07T22:19:29Z","PageNum":1,"Articles":[{"CreatedByName":"soldieroffilth","CreatedById":88590,"CreatedDateTime":"2014-04-07T22:19:29Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://s902.photobucket.com/user/Jovian_Dior_T/media/SeaFloorprobe_zps044c5b74.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i902.photobucket.com/albums/ac221/Jovian_Dior_T/SeaFloorprobe_zps044c5b74.png\u0022 alt=\u0022SeaFloorprobe_zps044c5b74.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOriginally designed as a command capsule to take a Kerbin to the ocean floor, it was deemed a failure as there was no way to return the entire module to the surface. Looking for a redesign of the system after having dumbed an obscene amount of funds into the project, kerbal engineers decided they could theoretically cut a portion of the probe off and fit it with a hard drive and a large battery that could carry data to the surface via a built in air pocket, and once at the surface transmit the data on the hard drive using any of the three antennas already in existence, if attached.\u003C/p\u003E\u003Cp\u003EPART A: designed to deliver the probe and subsequent science equipment to the bottom of a body of water. Ensure you have parachutes attached.\u003C/p\u003E\u003Cp\u003EPART B: contains a 40 mits sized hard drive and power enough to transmit up to 40 mits of data. detaches from the main body and floats to the surface where it can transmit its data.\u003C/p\u003E\u003Cp\u003EThis is as far as I can take this project, I leave it available for anyone who wants to take it from here. All I ask is that you give credit for the model. PM for the model, it comes as two OBJ files.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-07T22:33:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022soldieroffilth\u0022 data-cite=\u0022soldieroffilth\u0022\u003E\u003Cdiv\u003EThis is as far as I can take this project\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy? You should keep working on it. It\u0027s an interesting idea, but that\u0027s all it is right now.\u003C/p\u003E\n"},{"CreatedByName":"soldieroffilth","CreatedById":88590,"CreatedDateTime":"2014-04-07T22:48:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EWhy? You should keep working on it. It\u0027s an interesting idea, but that\u0027s all it is right now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dont know the first thing about coding for KSP, about as much as I know in any programming language at this point is cout \u0026gt;\u0026gt; \u0022Hello world!\u0022;\u003C/p\u003E\u003Cp\u003EAlso I just started back with classes and wont have the time to work on this, these ideas always seem to come to me at the most inopportune of times.\u003C/p\u003E\n"},{"CreatedByName":"schoff123","CreatedById":71389,"CreatedDateTime":"2014-04-07T23:54:08Z","Content":"\n\u003Cp\u003Enot to sound snooty, but it should be cout\u0026lt;\u0026lt; not cout\u0026gt;\u0026gt; \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Alskari","CreatedById":57638,"CreatedDateTime":"2014-04-08T01:38:58Z","Content":"\n\u003Cp\u003EHooligan Labs used to have a subsea mod. I suggest checking that out.\u003C/p\u003E\n"}]}