{"TopicId":68644,"ForumId":16,"TopicTitle":"Refueling vs docking an entire tank","CreatedByName":"Flight","CreatedById":99865,"CreatedDateTime":"2014-04-08T13:37:08Z","PageNum":1,"Articles":[{"CreatedByName":"Flight","CreatedById":99865,"CreatedDateTime":"2014-04-08T13:37:08Z","Content":"\n\u003Cp\u003EI\u0027ve seen a lot of people talking about refueling stations, and the idea I get from that is launching a big \u0022fuel holder\u0022 to be on a permanent orbit. Then you have to launch and dock lots of tanks to transfer fuel to the station, then discard the transporter tanks as debris, and finally launch and dock a final ship that will be refueled at the station and go for a mission.\u003C/p\u003E\u003Cp\u003EIt seems like a lot of work, and the only reusable part is the initial station launch. Isn\u0027t a lot easier to put your ship in orbit, without big tanks, and then launch and dock the tanks themselves to it? It saves you the launch and maintenance of a station, generates less debris, and if each tank has a docking port on both sides, you can dock as many tanks as you want, and then discard them as they empty during your mission.\u003C/p\u003E\u003Cp\u003ESo, is there a real need for fuel stations that I am missing?\u003C/p\u003E\n"},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2014-04-08T13:47:33Z","Content":"\n\u003Cp\u003EI think you have quite missed the way these stations are usually built.\u003C/p\u003E\u003Cp\u003EI, for example, first launch the core and then dock oranges to it, full of fuel by the time i dock them. As i refuel other craft, the fuel levels (who knew!) go lower. And here comes the need of refuelling. You launch another orange, dock it w/ station, and when the fuel transfer is done you dump it (or you dump the old orange, whatever seems better to you). Either way, you still need to dump a tank.\u003C/p\u003E\u003Cp\u003EThe need for fuel station is good because it\u0027s reusable.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIsn\u0027t a lot easier to put your ship in orbit, without big tanks, and then launch and dock the tanks themselves to it? It saves you the launch and maintenance of a station, generates less debris, and if each tank has a docking port on both sides, you can dock as many tanks as you want, and then discard them as they empty during your mission.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a good solution, although not as good as the station. Actually, for bigger eve rockets, you generate far more debris and space junk than the station. Also, you can dump the tanks from a station (assuming you are dumping the station-refuel rocket) in a far more eco-friendly way by deorbiting them and crashing them into surface. Make sure there aren\u0027t any kerbals onboard, and if there are any, make sure you\u0027ve took care of their return (or bought them a decent funeral \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E ).\u003C/p\u003E\u003Cp\u003EHope i explained that enough.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-08T13:52:41Z","Content":"\n\u003Cp\u003EI\u0027ve been thinking of an amazing design for a refuel station.\u003C/p\u003E\u003Cp\u003EI\u0027ll call it \u003Cem\u003Ecartridge refueling.\u003C/em\u003E You make a \u0022cartridge\u0022 out of 2 Rockomax X200-32\u0027s, a RGU, and a little tiny bit of RCS. Then, you design a \u0022holder\u0022 that fits the cartridge precisely. Put the holder on your station. Dock the cartridge inside. You can then transfer from the cartridge to your ship. When the cartridge is out, simply undock and put in a new one, deorbiting the old.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EThis is not just sticking a fuel tank to your station. The thing the cartridge goes into is 3-dimensional, shaped kinda like a cylinder.\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2014-04-08T13:58:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flight\u0022 data-cite=\u0022Flight\u0022\u003E\u003Cdiv\u003ESo, is there a real need for fuel stations that I am missing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo there is not.\u003C/p\u003E\u003Cp\u003EThis is a sandbox game, where everyone has his own goals and for each goal there are multiple ways to achieve it. I think it is an acomplishment to have such a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/22251?p=1069566\u0026amp;viewfull=1#post1069566\u0022 rel=\u0022external nofollow\u0022\u003Estation\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAnd about the debris: one of my goals is to keep the orbit clean of it, so I design my rockets and refueling-ships accordingly.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-08T13:59:22Z","Content":"\n\u003Cp\u003EI don\u0027t bother with refueling stations. If something needs to be fueled in orbit, I just launch, dock and recover tankers until it is full.\u003C/p\u003E\u003Cp\u003EI prefer not to dock tanks to spacecraft for transit as they\u0027re not strutted properly to the rest of the ship and don\u0027t have fuel lines; maybe the stronger joints in 23.5 make it a better proposition.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-08T14:06:50Z","Content":"\n\u003Cp\u003ESome people have ships that don\u0027t have detachable fuel tanks and to reuse them, they need to dock to something and refuel.\u003C/p\u003E\u003Cp\u003EMy own space program used detachable tanks and yet sometimes I returned with one half empty and it was more comfortable to dock to a station and refill it instead of dropping it to atmosphere and running a new mission to deliver new full tank in orbit. \u003C/p\u003E\u003Cp\u003EThe point is, play it whatever way suits you. If you don\u0027t need refueling station, nobody makes you build one.\u003C/p\u003E\n"},{"CreatedByName":"daniu","CreatedById":74039,"CreatedDateTime":"2014-04-08T14:10:59Z","Content":"\n\u003Cp\u003EI wouldn\u0027t say there\u0027s a real \u0022need\u0022, but I do like my station setup with a lab and a fuel tank connected to it in Mun orbit. \u003C/p\u003E\u003Cp\u003EI can send a lander there and reuse it about four times until the station runs out, so I replace the tank part.\u003C/p\u003E\u003Cp\u003EGathered science I send home with miniature probes for retrieval, about .5 mass each I think.\u003C/p\u003E\u003Cp\u003EIt cuts down on the total amount of launches which I grew weary of, and in turn on the total fuel I need (although I haven\u0027t done the math on that tbh, so it might just feel better this way \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E).\u003C/p\u003E\n"},{"CreatedByName":"Flight","CreatedById":99865,"CreatedDateTime":"2014-04-08T14:17:51Z","Content":"\n\u003Cp\u003EIf you\u0027re sandboxing it\u0027s all fine, I have a space station with 8 Kerbals there, producing nothing, but I like the role-playing aspect. I just wanted to know if I was missing a real need in terms of efficiency.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2014-04-08T14:31:55Z","Content":"\n\u003Cp\u003EI use 3 refueling stations so far (150km above Kerbin to service LKOs \u0026amp; SSTOs, 300km above Kerbin to service cis-Munar missions and reusable interplanetary transfer stages, and 100km above the Mun for Search \u0026amp; Rescue) mainly because they are easily locatable and serve as good repositories for \u0022left over\u0022 fuel from other missions. These days I need few dedicated supply missions to them, mostly to replenish jet fuel in my LKO station but even that\u0027s getting rarer. (Also, they provide a place for me to park the Big 3 Kerbonauts so they stop hogging all the missions.)\u003C/p\u003E\u003Cp\u003EIt\u0027s not \u0022the\u0022 answer for every program, but it works for me.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"TheD007","CreatedById":108023,"CreatedDateTime":"2014-04-08T16:35:42Z","Content":"\n\u003Cp\u003Eone problem with having drop tanks is placement. you have to design the ship for them from the start so that they can be symmetrically placed and have balanced fuel draw. one question is how do you drop a tank in a burn, every time i have tried to drop a tank in a burn i have ether hit it and broke something important off my ship or it just stayed in place in front of my ship.\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2014-04-08T16:41:17Z","Content":"\n\u003Cp\u003EFuel stations are good because with the new parts you can throw up 500, 1000, 2000t or more and use it for a long time.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-04-08T16:46:37Z","Content":"\n\u003Cp\u003EYou idea is very practical, but I\u0027ll stick with a station. A station has other uses too, like crew exchange, the science module to reset your experiments, multiple docking ports for docking ships, and it\u0027s convenient to have all that infrastructure in one location.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-08T16:47:05Z","Content":"\n\u003Cp\u003EI\u0027ve experienced the opposite: I no longer have to launch big things empty anymore. But if you like refueling stations, the new parts certainly make them easier.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-04-08T17:43:08Z","Content":"\n\u003Cp\u003EThe main reason I use stations is to provide a single focus for all the launches, fuel tanks, in-bound/out-bound flights, etc. Rather than cluttering-up orbit around each body everything is in one place and \u0027only\u0027 the station needs re-supply so I don\u0027t have to worry about many different, smaller tanks and accoutrements. My \u0027programme structure\u0027 also entails crew-shuttle space-plane \u0026amp; refuelling launch from Kerbin, dedicated transfer tractors that never re-enter and dedicated landers for other bodies. Stations are the nexus for launch-transfer-lander rendezvous, crew go back down to Kerbin in the shuttle, residual fuel is collected and re-allocated at the stations and empty tanks are de-orbited and parachute-landed. Ideally this would cover the entire system with only 4 or 5 standard designs (launch vehicle/plane, station, tractor, (same station, different place,) lander) but my landers, particularly, tend to be more specialised and varied.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-08T18:02:46Z","Content":"\n\u003Cp\u003EFuelling stations pro: The larger capacity means you can refuel multiple missions from it, whereas a tanker might not be enough by itself to refuel a large ship. \u003C/p\u003E\u003Cp\u003EFuelling stations con: You have to refuel the station itself, so you\u0027re flying tankers there anyway. A station has more parts than a tanker, and when added to the part count of the ship, can cause nasty lag during docking operations. It\u0027s easier to dock a smallish tanker to a big ship than to dock a big ship to a big station. \u003C/p\u003E\u003Cp\u003EIn short, I only ever build stations for looks, as their utility is virtually nil.\u003C/p\u003E\n"},{"CreatedByName":"RexKramer","CreatedById":76862,"CreatedDateTime":"2014-04-08T19:23:46Z","Content":"\n\u003Cp\u003EI personally like using detachable tanks. Here is one useful function of having drop tanks:\u003C/p\u003E\u003Cp\u003EIf I get a ship or probe to say Duna or Jool, there is often excess fuel. I find it useful to park the tank(s) in an orbit, for future refueling needs.\u003C/p\u003E\u003Cp\u003EIt adds a little weight, but I usually outfit my tanks to be functional on their own, to some extent. I normally add a small probe core, and RCS capacity (thrusters and a little propellant). Sometimes even some engines, both to help maneuver into position, and also to deorbit when I\u0027m finished using them.\u003C/p\u003E\u003Cp\u003EI also currently equip most of my tanks with large docking ports on BOTH ends. That way it\u0027s easy to dock a tank to the back, either for extra capacity or just to top off the main tanks. Makes for a modular ship. The same ship I use to go to Duna also makes Jool by simply adding an extra orange to the back. I lose some efficiency doing it this way, but seems to make gameplay go faster.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-04-08T20:18:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheD007\u0022 data-cite=\u0022TheD007\u0022\u003E\u003Cdiv\u003Eone problem with having drop tanks is placement. you have to design the ship for them from the start so that they can be symmetrically placed and have balanced fuel draw. one question is how do you drop a tank in a burn, every time i have tried to drop a tank in a burn i have ether hit it and broke something important off my ship or it just stayed in place in front of my ship.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDecouplers and maybe sepratrons as well. Throw them out to the side.\u003C/p\u003E\u003Cp\u003EOr, alternatively, put the engines at the front of the ship and drop tanks off the back.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-08T23:14:04Z","Content":"\n\u003Cp\u003EIn my experience, fuel stations are good for small ships, as you can refuel multiple ships with a single launch. For bigger ships, its better to use tankers directly.\u003C/p\u003E\u003Cp\u003ESpace stations are also good for storing small ships and kerbals for later use. It can save a lot of time compared to launching new stuff from Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-04-08T23:27:10Z","Content":"\n\u003Cp\u003EI always seem to have spare fuel in my launch stages; so I\u0027ve got into the habit of always launching my rockets so that the spent stages end up near my LKO refuelling station; then just simply pull them over with a KAS tug, filter the fuel into the station with fuel pipes, then de-orbit it. Other than the fuel I sent it up there with, I\u0027ve never had to refuel it with tankers! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Aedile","CreatedById":104353,"CreatedDateTime":"2014-04-09T14:05:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Random Tank\u0022 data-cite=\u0022Random Tank\u0022\u003E\u003Cdiv\u003EI always seem to have spare fuel in my launch stages; so I\u0027ve got into the habit of always launching my rockets so that the spent stages end up near my LKO refuelling station; then just simply pull them over with a KAS tug, filter the fuel into the station with fuel pipes, then de-orbit it. Other than the fuel I sent it up there with, I\u0027ve never had to refuel it with tankers! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly that. I usually have few small mobile tanks, which go to pick any excess fuel from big middle stages. When used in a small ship, this can end up as quite some deltaV.\u003C/p\u003E\u003Cp\u003EFuel station around moons are very useful of course (especially with a lab), but you can fuel directly at tanker. \u003C/p\u003E\u003Cp\u003EIf your ship is big, such as interplanetary ships, it\u0027s easier to fuel it with tanker. \u003C/p\u003E\u003Cp\u003EYou can also send tankers to other planets of course, so you don\u0027t necessarily need crazy big, FPS killing behemoth. (Easier to control as well, so you can save on RCS and reaction wheels).\u003C/p\u003E\n"},{"CreatedByName":"Remkeau","CreatedById":106783,"CreatedDateTime":"2014-04-09T14:30:27Z","Content":"\n\u003Cp\u003EWhat about a combination: a large fuel depot with smaller Jumbo tank-RCS tugs connected. This was you can home in on the station to 100 meters or so, and then use the orbital tanker for the actual refueling. After this the tug docks with the station again. Saves the finicky docking of a heavy ship to a massive station.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-04-09T14:37:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Remkeau\u0022 data-cite=\u0022Remkeau\u0022\u003E\u003Cdiv\u003EWhat about a combination: a large fuel depot with smaller Jumbo tank-RCS tugs connected. This was you can home in on the station to 100 meters or so, and then use the orbital tanker for the actual refueling. Saves the finicky docking of a heavy ship to a massive station.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s my setup, only I use the grey x32 tanks rather than the orange tanks. Much easier to maneuver, and capable of pushing themselves around fairly well on a few little engines.\u003C/p\u003E\u003Cp\u003EMy standard lifter designs leave orange tanks in LKO currently, so I\u0027ve been developing fuel station cores out of that. If I stick the central engine on with docking ports, I can put the central stack of an empty orange tank plus payload into orbit. Since the maxiumum payload is a full x32 tank with a few tons of additions, simply using a mostly-empty orange tank as payload means a large fuel station.\u003C/p\u003E\u003Cp\u003EThen, of course, I tank it up with tankers. Either shot up from kerbin, or I use spare interplanetary tugs to tank it up from the kethane refinery around the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2014-04-09T14:46:06Z","Content":"\n\u003Cp\u003EI just built a new station. I went slightly overboard with the amount of fuel. I used 8 of the new largest fuel tanks.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-09T15:27:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flight\u0022 data-cite=\u0022Flight\u0022\u003E\u003Cdiv\u003EIt seems like a lot of work, and the only reusable part is the initial station launch. Isn\u0027t a lot easier to put your ship in orbit, without big tanks, and then launch and dock the tanks themselves to it? It saves you the launch and maintenance of a station, generates less debris, and if each tank has a docking port on both sides, you can dock as many tanks as you want, and then discard them as they empty during your mission.\u003C/div\u003E\u003C/blockquote\u003EThis approach is perfectly viable but it has its drawbacks. It involves more hardware, more docking manouevres, and may make the ship less stable since it\u0027s now held together by docking ports not by solid connections and struts. (Though I believe KAS or Quantum Struts can fix the last issue).\u003Cp\u003EOf course in the real world there\u0027s been debate over whether it\u0027ll be cheaper to have orbital fuel depots or just use heavy-lift launchers.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwhip\u0022 data-cite=\u0022Starwhip\u0022\u003E\u003Cdiv\u003EI\u0027ve been thinking of an amazing design for a refuel station.\u003Cp\u003EI\u0027ll call it \u003Cem\u003Ecartridge refueling.\u003C/em\u003E You make a \u0022cartridge\u0022 out of 2 Rockomax X200-32\u0027s, a RGU, and a little tiny bit of RCS. Then, you design a \u0022holder\u0022 that fits the cartridge precisely. Put the holder on your station. Dock the cartridge inside. You can then transfer from the cartridge to your ship. When the cartridge is out, simply undock and put in a new one, deorbiting the old.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EThis is not just sticking a fuel tank to your station. The thing the cartridge goes into is 3-dimensional, shaped kinda like a cylinder.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EIf you have a docking port at each end, I\u0027ve a feeling that gets a bit tricky to dock and undock. If you have just one docking port, you don\u0027t really need the \u0022holder\u0022 for anything other than looks.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Remkeau\u0022 data-cite=\u0022Remkeau\u0022\u003E\u003Cdiv\u003EWhat about a combination: a large fuel depot with smaller Jumbo tank-RCS tugs connected. This was you can home in on the station to 100 meters or so, and then use the orbital tanker for the actual refueling. After this the tug docks with the station again. Saves the finicky docking of a heavy ship to a massive station.\u003C/div\u003E\u003C/blockquote\u003EIf you do this, you can instead park the ship a few km from the station, out of physics range, to reduce lag.\n"},{"CreatedByName":"Zourin","CreatedById":80107,"CreatedDateTime":"2014-04-09T17:12:16Z","Content":"\n\u003Cp\u003EInitially, keeping one or more \u0027tankers\u0027 in orbit with an AI core is enough for most orbital refuelling needs, and makes it more likely that you\u0027ll be able to quickly rendezvous with it, as opposed to guesstimating one-shot intercepts with a single station or waiting weeks for asynchronous orbits to line up.\u003C/p\u003E\u003Cp\u003EThese can then be de-orbited easily when (nearly) empty in whatever way floats your boat.\u003C/p\u003E\u003Cp\u003EThere\u0027s really no point to a single LKO station for purposes of refuelling, but in the same way as having multiple tankers, having multiple fuel stations in orbit wind up being much more useful. They only need to store enough fuel to handle the needs of a few missions, and should be serviced/serviceable by a single tanker so you\u0027re not running more fuel missions than science missions.\u003C/p\u003E\n"}]}