{"TopicId":68654,"ForumId":15,"TopicTitle":"Only a fraction of my custom part loads into KSP","CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-08T14:23:07Z","PageNum":1,"Articles":[{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-08T14:23:07Z","Content":"\n\u003Cp\u003ESolved, don\u0027t let your meshes have more than one material assigned to them\u003C/p\u003E\u003Cp\u003Etl;dr - the second last picture is my part, the last picture is what it looks like loaded into Kerbal\u003C/p\u003E\u003Cp\u003ESo I\u0027ve tried as hard as I can at doing this before writing this asking for help. I have used all the stickied posts on the forum, t\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/EFWF6Qv9Dhk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E, and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/25040-Unity-to-KSP-A-Detailed-Tutorial\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ethis thread\u003C/span\u003E\u003C/a\u003E. Now everything except the video is using the old part tools, not the .23 one so maybe I set that up wrong, but I don\u0027t think so, I get it to load into the gameobject just fine. But I\u0027ll cover that in more detail later. \u003Cp\u003EIn this post I will cover in detail every step from blender to ksp. You have to understand that I have never used blender or unity before, and I\u0027m trying to learn this all from scratch. There might be some basic things I\u0027m missing, but based on the directions I have been following I believe it\u0027s all done correctly. I\u0027m pretty proud I\u0027ve made it this far.\u003C/p\u003E\u003Cp\u003EJust for some background. My plan is to release fully functional Zoid mechs created by artists on DeviantArt. People have created these things already for the sake of art, and I want to put them in the game and have me and a couple other users make them walk/fly/blow **** up. The one I am working on here was created by DeviantArt user DGMM. He has a bunch of these and if I get this one to work I believe I could convince him to send me his others. His gallery is \u003Ca href=\u0022http://dgmm.deviantart.com/gallery/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ehere\u003C/span\u003E\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThis is the forum post for my project. There\u0027s more pictures \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/73364-Walking-Flying-Custom-Replica-Mech-Mod\u0022 rel=\u0022external nofollow\u0022\u003Ethere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EHere you can see I\u0027ve loaded the thing into the game as a whole as a proof of concept. Later you will see that my part isn\u0027t loading completely. It\u0027s reasonable to believe the part is too detailed for the game, but then why does it load as a whole?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZcmGuaG.png\u0022 alt=\u0022ZcmGuaG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy plan is to eventually animate these parts so that they move by themselves, but animation is probably gonna take me a while to learn. So my first plan is to attach the parts using existing Infernal Robotics parts. For both plans I need to break the whole model up into parts. I\u0027m thinking head, neck, body, tail, legs and arms(which will also have to be broken up at the joints).\u003C/p\u003E\u003Cp\u003ESo as you can see here, in blender I isolated the part that I wanted, grouped all the parts together, moved the origin to the COM, and centered the whole thing. I also deleted a lot of the cosmetic, super detailed parts. Then I saved it as a .blend file\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YWV9os2.png\u0022 alt=\u0022YWV9os2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I set up unity just as the instructions in the video said. I created a new project and put my .blend file and part tools folder into assets.(Maybe PartTools isn\u0027t supposed to go in Assets? Thats the only place I get them to load into unity though) I created an empty gameobject, set all the positions to 0, and added \u0022part tools\u0022 via the \u0022add component\u0022. \u003C/p\u003E\u003Cp\u003EThen before dragging the body file over to gameobject, I set all the materials to KSP/Emissive/Diffuse, turned off all the animation settings for the part, and toggled \u0022Generate Colliders\u0022 and \u0022Generate lightmap\u0022. I toggled those two after one of the forum posts I found told me to, but I also tried writing the part without those toggled. I also tried writing the part without any of the animations turned off.\u003C/p\u003E\u003Cp\u003EThen I dragged the part into game object and added a \u0022Mesh Collider\u0022 to the body part. In the mesh collider i toggled Convex as well. In this example I\u0027m not adding textures yet, but I have tried writing the part with them.\u003C/p\u003E\u003Cp\u003EThen in the part tools component I changed the Model name to \u0022model\u0022 and the texture format to \u0022TGA Uncompressed\u0022 as thats what the gentleman in the video used. I have however, tried every format now, to the same result.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0Ds7ezm.png\u0022 alt=\u00220Ds7ezm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pGrr5bU.png\u0022 alt=\u0022pGrr5bU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I click the write button and my .mu shows up in the gamedata folder I created in my Unity project folder. I dragged that into my folder for the part in KSP and wrote a .cfg. I just copied a fuel tanks .cfg and changed the name. That\u0027s why the attachment points aren\u0027t correct in the picture. I haven\u0027t figured those out yet, but I\u0027ll cross that bridge when I get there.\u003C/p\u003E\u003Cp\u003ENow I load up the game and every single time, no matter how many different settings I try, this is how it looks.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bnV2rcy.png\u0022 alt=\u0022bnV2rcy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELike I said, it might be because the part is too detailed, but then why did it load into the game as a whole? Also, and I can\u0027t find any other example of this on the internet. \u003Cstrong\u003EWhen I write my model in my finder it is classified as a \u0022Document\u0022 where as every other stock mu in KSP is classified as an \u0022Unix Executable File\u0022\u003C/strong\u003E. Maybe thats something.\u003C/p\u003E\u003Cp\u003EI\u0027m really just stuck and I would greatly appreciate any suggestions you might have, as I really want to accomplish this. Any suggestions at all, I\u0027d be happy to credit you when I release the thing. And even better, if you\u0027d like to be part of the project I\u0027d be happy to have you, especially for the textures and animations.\u003C/p\u003E\u003Cp\u003EPlease feel free to ask any questions as well. There might have been some things I missed in this description, but I have tried every combination of things I can think off, always to the same result.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-25T02:57:29Z\u0022 title=\u002207/25/2014 02:57  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 25, 2014\u003C/time\u003E by clown_baby\u003C/strong\u003E\n\u003Cbr\u003ESOLVED\n\u003C/span\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-08T14:55:48Z","Content":"\n\u003Cp\u003EYep, didn\u0027t read, just looked at the pics. Ever tried using the \u0022texture\u0022 instead of \u0022solid\u0022 on blender? Right beside Edit/Object mode. I would guess you have flipped faces on those, the mesh is right there but the render is inverted. You\u0027ll see it as transparent on texture render.\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-08T15:06:19Z","Content":"\n\u003Cp\u003EThanks for the idea, but \u0022texture\u0022 gives me the same result\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-08T15:08:15Z","Content":"\n\u003Cp\u003EHmmm, I\u0027m not really that good at modelling, I just started out recently, but maybe I could help if you don\u0027t mind sending the model to me? (sorry if I can\u0027t, we\u0027ll see)\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-04-08T15:33:00Z","Content":"\n\u003Cp\u003EDid you try recalculating normals in blender? Ctrl\u002BN?\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-08T15:36:46Z","Content":"\n\u003Cp\u003EI thought that was the problem too. I don\u0027t think that is the problem because it isn\u0027t transparent in terms of texture. (Flipped normals are transparent)\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-08T19:42:29Z","Content":"\n\u003Cp\u003Ethanks to blackheart I loaded the parts into sketchup and exploded them. now I\u0027m getting closer.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mbpMFj1.png\u0022 alt=\u0022mbpMFj1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever now my mesh collider only applied to one aspect of the part. not the whole thing. Any ideas?\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-04-08T21:53:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022clown_baby\u0022 data-cite=\u0022clown_baby\u0022\u003E\u003Cdiv\u003EHowever now my mesh collider only applied to one aspect of the part. not the whole thing. Any ideas?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf they\u0027re separate meshes in your 3d modelling program, you\u0027ll need to add the physics collider to each mesh individually\u003C/p\u003E\u003Cp\u003E-or-\u003C/p\u003E\u003Cp\u003Ecreate a simple collider mesh which covers the whole assembly, then in Unity delete the colliders mesh renderer component and add the physics component to only the collider mesh\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-08T22:47:15Z","Content":"\n\u003Cp\u003EAdding the collider individually worked great, thank you so much NoMrBond. I\u0027ll post a pic of it fully assembled soon\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-04-09T05:37:57Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OJjiX7H.png\u0022 alt=\u0022OJjiX7H.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s what i got. Updates will continue here\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/73364-Walking-Flying-Custom-Replica-Mech-Mod\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/73364-Walking-Flying-Custom-Replica-Mech-Mod\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"avghunter","CreatedById":84614,"CreatedDateTime":"2014-07-25T01:27:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022clown_baby\u0022 data-cite=\u0022clown_baby\u0022\u003E\u003Cdiv\u003E...snip...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo from what i see is that the main head part is to thin. you have to extrude it so it has thickness. Also check to see if the normals are facing the right direction. By default they should. I work in maya and had the same problem. So That was my solution. I just had to ensure that the parts were not thin like creating a plane for example.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-25T02:29:51Z\u0022 title=\u002207/25/2014 02:29  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 25, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003Cbr\u003Esnipped massive quote\n\u003C/span\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-07-25T02:54:55Z","Content":"\n\u003Cp\u003Ehey thanks a lot for the input dude but I solved this a while ago. It was because meshes had more than one material assigned to to them. \u003C/p\u003E\u003Cp\u003EI\u0027ve gotten pretty good at it since then.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/6CB8WRI.png\u0022 alt=\u00226CB8WRI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80808-Fully-Functional-Customizable-Zoids\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Ethread\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"avghunter","CreatedById":84614,"CreatedDateTime":"2014-07-29T23:24:24Z","Content":"\n\u003Cp\u003ENo worries mate, hey you got some crazy looking creations there, awesome. I need some help here now lol. I cant seem to get the animation working. In unity the animation plays, but i think i am writing the cfg file wrong. here\u0060s what I got for my fleet carrier.\u003C/p\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003Ename = ModuleAnimateGeneric \u003C/p\u003E\u003Cp\u003EanimationName = Hanger bay \u003C/p\u003E\u003Cp\u003EstartEventGUIName = Open Bay\u003C/p\u003E\u003Cp\u003EendEventGUIName = Close Bay\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003Ename = ModuleAnimateGeneric \u003C/p\u003E\u003Cp\u003EanimationName = Close bay\u003C/p\u003E\u003Cp\u003EstartEventGUIName = Close Bay\u003C/p\u003E\u003Cp\u003EendEventGUIName = Open Bay \u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-07-29T23:38:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022avghunter\u0022 data-cite=\u0022avghunter\u0022\u003E\u003Cdiv\u003ENo worries mate, hey you got some crazy looking creations there, awesome. I need some help here now lol. I cant seem to get the animation working. In unity the animation plays, but i think i am writing the cfg file wrong. here\u0060s what I got for my fleet carrier.\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003Ename = ModuleAnimateGeneric \u003C/p\u003E\u003Cp\u003EanimationName = Hanger bay \u003C/p\u003E\u003Cp\u003EstartEventGUIName = Open Bay\u003C/p\u003E\u003Cp\u003EendEventGUIName = Close Bay\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003Ename = ModuleAnimateGeneric \u003C/p\u003E\u003Cp\u003EanimationName = Close bay\u003C/p\u003E\u003Cp\u003EstartEventGUIName = Close Bay\u003C/p\u003E\u003Cp\u003EendEventGUIName = Open Bay \u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn unity, make sure the animation for part is set to legacy, not generic. Let me know if this helps or if you don\u0027t know what I mean\u003C/p\u003E\n"}]}