{"TopicId":6876,"ForumId":21,"TopicTitle":"This Way Up [stock]","CreatedByName":"corinoco","CreatedById":13156,"CreatedDateTime":"2012-02-21T02:38:49Z","PageNum":1,"Articles":[{"CreatedByName":"corinoco","CreatedById":13156,"CreatedDateTime":"2012-02-21T02:38:49Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027arial black\u0027;\u0022\u003E\u003Cspan\u003ENow includes .craft file at no extra cost!\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E \u003Cspan style=\u0022font-size:48px;\u0022\u003E(doh!)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ETo explain the design, you\\\u0027ll have to read these post-mission comments from Jeb:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cbr\u003E[li]\u003Cstrong\u003EToo quiet in capsule\u003C/strong\u003E - hard to tell when engines are on. Put engines closer so audible checks can be made - much quicker than reading these silly dial things.[/li]\u003Cbr\u003E[li]\u003Cstrong\u003ECapsule too far off ground\u003C/strong\u003E - could be major trip hazard when entering capsule. Also Bill is afraid of lifts.[/li]\u003Cbr\u003E[li]\u003Cstrong\u003EUnable to visually check if engine is running.\u003C/strong\u003E Sometimes I listen to my K-Pod during launch as the screaming from Bill, Bob \u0026amp; mission control distracts me. Would be handy if I could look out window and check if engine is working. Also Bob has never seen a rocket launch as he has always been in the capsule. He would be much happier if he could get to see a rocket launch from up close; he may even open his eyes.[/li]\u003Cbr\u003E[li]\u003Cstrong\u003ELaunch is very stressful\u003C/strong\u003E - it would help to have an in-capsule supply of whisky \u0026amp; cigarettes. Can we also have some meat-paste-in-a-tube? I think it\\\u0027s yummy![/li]\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETo address these severe failings the Kerbol Space Program work experience student drew up with the following design:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/96seE.png\u0022 alt=\u002296seE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe \u003Cstrong\u003E\u003Cspan\u003EThis Way Up\u003C/span\u003E\u003C/strong\u003E - named thus as the student wanted to really emphasize which way up the rocket should be placed on the pad.\u003C/p\u003E\u003Cp\u003EDesign features include:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cbr\u003E[li]\u003Cstrong\u003EMain engines in clear view above capsule.\u003C/strong\u003E \u003Cem\u003ERight above you\u003C/em\u003E. Right \u003Cem\u003Eabove\u003C/em\u003E. There, just outside that cheap window.[/li]\u003Cbr\u003E[li]\u003Cstrong\u003EBooster engines in clear view above and beside capsule.\u003C/strong\u003E Easy to hear when they are working! Easy to hear when they separate![/li]\u003Cbr\u003E[li]\u003Cstrong\u003ELarge whisky \u0026amp; cigarette storage pod.\u003C/strong\u003E Conveniently located at the main airlock. \u003Cspan style=\u0022font-size:48px;\u0022\u003EWe had to make the parachute smaller to fit the meat paste, though....\u003C/span\u003E [/li]\u003Cbr\u003E[li]\u003Cstrong\u003EConvenient ground level access.\u003C/strong\u003E Rocket control function \u0026amp; stability were compromised, also staging is pretty dangerous with the \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ewreckage\u003C/span\u003E spent stages tumbling directly into your flightpath. Nothing that the...[/li]\u003Cbr\u003E[li]\u003Cstrong\u003EExtra powerful RCS thrusters\u003C/strong\u003E can\\\u0027t get you out of the way of. Assuming you turned them on. [/li]\u003Cbr\u003E[li]\u003Cstrong\u003EExtra safe landings!\u003C/strong\u003E (Provided you remember to save some RCS fuel - remember we made the parachute smaller?) Remember to turn the RCS thrusters on, too[/li]\u003Cbr\u003E[li]\u003Cstrong\u003EMassive post-landing cross-range capability!\u003C/strong\u003E At about 2m/s top speed, this will save you about 150m worth of trudging (drunk, smelling of cigarettes and meat-paste) back to base.[/li]\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDespite the revolutionary design, the rocket is fairly simple to fly.\u003C/p\u003E\u003Cp\u003EFor those who wish to be like Jeb and just fly by the seat of your (admittedly brown) pants, the flight manual is classified.\u003C/p\u003E\u003Cp\u003EEveryone else, de-classify the flight manual by clicking the Spoiler below.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003ESteps to obtain some sort of orbit are:\u003C/p\u003E\u003Cp\u003E[list type=decimal]\u003C/p\u003E\u003Cp\u003E[li]Place rocket on pad. \u003Cstrong\u003ECheck it is the right way up.\u003C/strong\u003E[/li]\u003C/p\u003E\u003Cp\u003E[li]Let Jeb into capsule[/li]\u003C/p\u003E\u003Cp\u003E[li]Coax Bill \u0026amp; Bob into capsule by laying a trail of space-cookies; quickly shut and bolt hatch once they are inside.[/li]\u003C/p\u003E\u003Cp\u003E[li]Switch on SAS, arm RCS and set throttles to full \u003Cem\u003Ebefore launch.\u003C/em\u003E[/li]\u003C/p\u003E\u003Cp\u003E[li]Ignition! Be ready to steer rocket, as it tends to \\\u0027wander\\\u0027 much like Jeb\\\u0027s concentration.[/li]\u003C/p\u003E\u003Cp\u003E[li]Slowly pitch to heading 90 - the attached pictures show the rate. Jettison SRBs when they burn out.[/li]\u003C/p\u003E\u003Cp\u003E[li]Pitch to level by about 35,000m - accelerate to 2,400m/s[/li]\u003C/p\u003E\u003Cp\u003E[li]MECO once apoapsis is above about 80,000m[/li]\u003C/p\u003E\u003Cp\u003E[li]Circularize (or ovalize?) orbit at apoapsis[/li]\u003C/p\u003E\u003Cp\u003E[li]Seperate booster stage. Be sure to have RCS armed and blip retrothrust right away to avoid colliding with \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ewreckage\u003C/span\u003E seperated stages[/li]\u003C/p\u003E\u003Cp\u003E[li]Break out the tubes of meat paste, open the whisky and light a cigarette - \u003Cem\u003Eyou\\\u0027re in orbit!\u003C/em\u003E[/li]\u003C/p\u003E\u003Cp\u003E[li]When the meat paste, whisky \u0026amp; cigarettes run out, point the capsule in your favourite direction and retro-thrust with the appropriate RCS quad.\u003Cem\u003E Leave a little RCS d/v for landing.\u003C/em\u003E[/li]\u003C/p\u003E\u003Cp\u003E[li]Atmospheric entry is mostly automatic, but try to remember to activate the chute before 1,000m[/li]\u003C/p\u003E\u003Cp\u003E[li]At about 100m activate the RCS retros - \u003Cstrong\u003Eyou will need these to slow down\u003C/strong\u003E, as the meat paste, whisky \u0026amp; cigarette storage containers are quite heavy and slightly overload the parachute.[/li]\u003C/p\u003E\u003Cp\u003E[li]Any remaining RCS fuel may be vented in amusing ways, or be used to propel the capsule if at sea.[/li]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EImages of the successful first flight (well, ok, the first \u003Cem\u003Esuccessful\u003C/em\u003E flight) can be seen here: \u003Ca href=\u0022http://imgur.com/a/0bmDy#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/0bmDy#0\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"corinoco","CreatedById":13156,"CreatedDateTime":"2012-02-21T03:28:24Z","Content":"\n\u003Cp\u003E*sigh* Now that Jeb has experienced the luxury of meat-paste, whisky \u0026amp; cigarettes in orbit, he wants to be the first Kerbal to get drunk while eating meat-paste and smoking .... \u003Cstrong\u003E\u003Cem\u003EON THE MUN.\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"michealv","CreatedById":16271,"CreatedDateTime":"2012-03-05T06:54:13Z","Content":"\n\u003Cp\u003Elol love the little story that goes with it, well done man\u003C/p\u003E\n"}]}