{"TopicId":68834,"ForumId":55,"TopicTitle":"How will budgets work?","CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-09T23:12:33Z","PageNum":1,"Articles":[{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-09T23:12:33Z","Content":"\n\u003Cp\u003EParts have had prices in the VAB since forever, though some of them make little sence. (why use an Orange tank when you can use two oilcans for much cheaper?) People are talking about using cost to balance otherwise OP parts, when we still dont know how money will work. This topic is to speculate how the budget system will work, and how it SHOULD work, for a fun game that followers the hints left to us by the developers.\u003C/p\u003E\u003Cp\u003EOne of the few things we know about budgets is that it will be something that can be traded for Science, or traded for Reputation, which will be used to qualify for missions used to earn more budget and reputation.\u003C/p\u003E\u003Cp\u003EWe also know how science works- you get a limited amount of science from doing things, and you spend it (permanantly) to unlock new parts (permanantly), presumably to go out and get more science (and budget and reputation)\u003C/p\u003E\u003Cp\u003EReading between the lines, Reputation seems to be intended to be a similar resource. You spend (stake?) reputatation on Missions, so you can go and earn more Reputation (and possibly budget). However, the missions are procedural (\u0022Test Part X in Biome Y\u0022 was the example) making it an unlimited source. (science may be EFFECTIVELY unlimited with all the Mun and Minmus biomes, but there is an upper limit)\u003C/p\u003E\u003Cp\u003EAnother thing to keep in mind is that when career launched, one of the developers was quoted as saying it was a form of tuturial- it was less about realism, then about a guided exploration of KSP, to soften the learning wall for new players. (hence rockets being before jets and rovers)\u003C/p\u003E\u003Cp\u003EAs such, the combination of Science, Budgets, and Reputation should be something new players can grasp, and carear should be something they cannot easilly lose while still learning the game.\u003C/p\u003E\u003Cp\u003EIf we assume Budget works on the same pattern as Science (and presumably reputation), would you prefer fixed budget-cap per launch or a running total that is added to each mission? If the second, how should it be set up to prevent newbies from being unable to play if they crash the first 10 rockets they launch, while preventing \u0022spawn capsule, recover, pocket rest of budget\u0022 abuse? If you think budgets should use a different system, how do you think it should work? And how do you think \u0022trading\u0022 money, reputation and science will work?\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-04-10T00:02:28Z","Content":"\n\u003Cp\u003EI feel early amounts of all resources will be very forgiving. Thus allowing the learning curve to a certain degree. The resource system will probably get exponentially more impactful later.\u003C/p\u003E\u003Cp\u003EAll of this is a lot of speculation. The few things we do know do not help with figuring out other things we know less about. For instance there will be a game over screen that works with reputations. Harv said you will only be allowed to kill so many kerbals heroes before you lose. So there is that hardline against newer players.\u003C/p\u003E\u003Cp\u003EYou are also forgetting the addition of contracts that are also coming with reputations. I assume these two will work alone with career for some time until more additions are made, so these must be taken into account to.\u003C/p\u003E\u003Cp\u003EThe tech tree is probably the most important factor in helping players learn the game. Things such as contracts, and reputations (the next in line to be implemented) seem like they would work against newer players. I doubt these would impact the game in its early state, and the impacts would be well deserved. Actions such as killing off masses of kerbals for the hell of it shouldn\u0027t be allowed, thats something for sandbox not career. \u003C/p\u003E\u003Cp\u003EI foresee contracts and reputations taking hold in the middle, to later portions of the career mode. Where more of the tech is unlocked, a player has figured out how to mess around in space and build a functioning space craft and getting their kerbals home.\u003C/p\u003E\u003Cp\u003ESomething as simple as commuting to a contract to land a Kerbal on the moon and getting reputation for it in a set amount of time seems interesting and fun. It would also allow newer plays as much time as they want to start their first actual big mission.\u003C/p\u003E\u003Cp\u003EContracts should become something of a guideline in career mode. An optional/ semi-optional setting that is in career mode. I personally do not know much about reputation, especially early in development. It could possibly range from a direct currency, like not enough means less parts or something. Or just a visual stat that doesn\u0027t affect gameplay, such as kerbal stats.\u003C/p\u003E\u003Cp\u003EI think contracts and reputations are more important to brainstorm on than currency\u0027s. As they will come at different times and have to work with the game on their own, before more things arrive.\u003C/p\u003E\n"},{"CreatedByName":"Rowsdower","CreatedById":91811,"CreatedDateTime":"2014-04-10T05:34:31Z","Content":"\n\u003Cp\u003EBuzzkilling disclaimer: Other than comments that have been public by SQUAD devs and other members of the KSP team, be aware that the talk contained within is speculation. Blah blah blah, shut up Rowsdower. Ok, have fun.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-11T11:25:12Z","Content":"\n\u003Cp\u003EInteresting idea for a thread, even if we really don\u0027t know enough to do more than speculate.\u003C/p\u003E\u003Cp\u003EAs I understand it, here\u0027s what we know:\u003C/p\u003E\u003Cp\u003EThere will be three currencies: Science, Money, and Reputation.\u003C/p\u003E\u003Cp\u003EThere will be some mechanism to exchange at least some currencies for others.\u003C/p\u003E\u003Cp\u003EHere\u0027s my take on what we may see:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EScience\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIncreased by: Completing experiments in different biomes\u003C/p\u003E\u003Cp\u003EDecreased by: Unlocking new parts\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMoney\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIncreased by: Accepting contracts\u003C/p\u003E\u003Cp\u003EDecreased by: Buying parts/fuel\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EReputation\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIncreased by: Completing contracts/missions\u003C/p\u003E\u003Cp\u003EDecreased by: Failing contracts/missions\u003C/p\u003E\u003Cp\u003EI expect science to work basically the same as it does now, with perhaps new nodes as new parts are added and maybe a rework of where things fall on the tree. It will continue to serve as a way of not overwhelming beginners with too many parts. Science has seen a significant change in 23.5, in that there is now no upper limit on how much science can be collected because asteroids are constantly spawning and each contains unique science.\u003C/p\u003E\u003Cp\u003EMoney I think will be granted by contracts, e.g. \u0022Here\u0027s $50,000 to plant a flag on the Mun within 10 days.\u0022 Bigger contracts will have more difficult goals and grant more money. This will be another mechanism to gradually challenge newer players with increasingly difficult goals. Money will be used to build rockets and refuel reusable craft. Leftover money from contracts will accumulate.\u003C/p\u003E\u003Cp\u003EReputation is the big question mark. I think it will work as a difficulty modifier, in that the more reputation a player has, the more difficult/potentially rewarding the contracts will become. If you quickly complete the early, easy contracts in single attempts your reputation will quickly rise and you\u0027ll be offered more difficult missions. If you struggle on the early missions, your reputation will grow slowly or not at all, so the missions will stay at about the same difficulty until you start succeeding. This would work to keep the missions reasonably well matched to the player\u0027s skill level.\u003C/p\u003E\u003Cp\u003EExchanging one currency for another is something else to think about. There are six different possibilities, not all of which will necessarily be implemented:\u003C/p\u003E\u003Cp\u003EMoney -\u0026gt; Reputation\u003C/p\u003E\u003Cp\u003EScience -\u0026gt; Reputation\u003C/p\u003E\u003Cp\u003EMoney -\u0026gt; Science\u003C/p\u003E\u003Cp\u003EReputation -\u0026gt; Science\u003C/p\u003E\u003Cp\u003EScience -\u0026gt; Money\u003C/p\u003E\u003Cp\u003EReputation -\u0026gt; Money\u003C/p\u003E\u003Cp\u003ESpending money or science for reputation will be useful for experienced players starting new careers. They can use their skill at efficient shipbuilding and science gathering to increase their reputation and more quickly get to contracts appropriate for their skill level, making the early game feel less \u0022grindy\u0022.\u003C/p\u003E\u003Cp\u003EThe reverse is true for spending reputation on money or science. If a player is starting to find the contracts too difficult, they can trade away their reputation to increase their money or science balances. This would result in less challenging missions and a bigger budget/more parts available, decreasing the difficulty.\u003C/p\u003E\u003Cp\u003ETrading money for science and vice versa I see as useful for getting through times when you need just a little of one or the other. Need just a couple more science points to unlock LV-Ns? Buy them. Can\u0027t quite afford the ship you designed for a mission? Sell a few of your excess science points.\u003C/p\u003E\u003Cp\u003EThe exchange rates among currencies should be lossy; e.g. if you trade money for science and then back again, you should have less money than when you started. This will prevent players from finding the easiest currency to earn and spamming it to gain the others.\u003C/p\u003E\u003Cp\u003EFinally, reusability should figure into the economy somehow as well. There should be some economic incentive to recover and reuse spent stages, and a reason to design reusable spacecraft. I would prefer that this mechanism be built into the VAB/SPH; otherwise players will find workarounds using ground-based tankers and payload installation. While that is interesting, I don\u0027t think most players want to mess around with ground crews, that\u0027s something that\u0027s best abstracted away.\u003C/p\u003E\u003Cp\u003EPersonally, I think that any recovered craft or stage should become available in the VAB/SPH, where the craft can be modified for reuse or individual parts can be removed and put back into inventory for use in other craft. Fuel costs would be accounted separately from spacecraft parts. While this is not the most realistic system, it is simple, encourages reusability, and adheres to the modular, lego-like flavor of KSP construction.\u003C/p\u003E\n"}]}