{"TopicId":69053,"ForumId":55,"TopicTitle":"Joystick Sensitivity Curves","CreatedByName":"viperfan7","CreatedById":740,"CreatedDateTime":"2014-04-12T00:11:01Z","PageNum":1,"Articles":[{"CreatedByName":"viperfan7","CreatedById":740,"CreatedDateTime":"2014-04-12T00:11:01Z","Content":"\n\u003Cp\u003EI think that we should be able to adjust the output curves of joystick inputs, if at all possible\u003C/p\u003E\u003Cp\u003Esomething like where the area just around neutral is fairly insensitive, to allow for much more controlled movements, while near the edges its much more sensitive, for quicker movements\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2014-04-12T00:22:27Z","Content":"\n\u003Cp\u003EGood idea, in my experience joysticks can vary a lot.\u003C/p\u003E\n"},{"CreatedByName":"viperfan7","CreatedById":740,"CreatedDateTime":"2014-04-13T09:18:24Z","Content":"\n\u003Cp\u003EAlso, a good example of this is in world of warplanes.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-04-13T10:08:03Z","Content":"\n\u003Cp\u003Edifferent joysticks have different response curves, some are adjustable, others are not. frankly i like linear response curves (saitek is notorious for funky non flat response curves, fortunately im a ch user). then again in space joystick usage is completely different from in the atmosphere. in the atmosphere i want zero deadzone and a flat curve. but in space i like a little bit of a deadzone so that thrusters remain off with the stick at about 5% of its range, ramping into a linear curve within another 20% (essentially a j-curve). then again i want my gimbals and reaction wheels to be linear with no deadzone, but my thrusters to do a j-curve with a deadzone.\u003C/p\u003E\u003Cp\u003Ewith the throttle i want it flat but with a safe zone at the lower 5% (not the middle, idk why ksp puts the deadzone in the middle of the throttle, that doesn\u0027t make any sense) so that i dont waste fuel. for some reason my throttle doesnt go all the way to zero and it sometimes wastes fuel because of this. i actually have a throttle safing script in my ch profile to avoid accidental firing.\u003C/p\u003E\u003Cp\u003Eneedless to say i like to have different joystick parameters for different flight modes, different control methods (thrusters, reaction wheels, control surfaces, gimbals), and possibly even for different craft. some craft maneuver more aggressively than others, so no one set of settings fits everything. so some kind of input scaling options would be a good idea, possibly exposed through tweakables.\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2014-04-13T10:58:52Z","Content":"\n\u003Cp\u003EI think we need better Joystick support in general, really. Unfortunately I think a lot of the problems they have are due to Unity\u0027s limitations, not KSP\u0027s. (I had a hell of a time getting mine to work properly, I was getting weird input lag all the time, I\u0027m having to use third-party drivers and software to get mine fully functional \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-04-13T11:44:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Ewith the throttle i want it flat but with a safe zone at the lower 5% (not the middle, idk why ksp puts the deadzone in the middle of the throttle, that doesn\u0027t make any sense) so that i dont waste fuel. for some reason my throttle doesnt go all the way to zero and it sometimes wastes fuel because of this. i actually have a throttle safing script in my ch profile to avoid accidental firing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould you post the throttle-safing script? I could use it, it\u0027d be a much better solution than trying to \u0022calibrate out\u0022 this last 5%.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-04-13T20:33:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003ECould you post the throttle-safing script? I could use it, it\u0027d be a much better solution than trying to \u0022calibrate out\u0022 this last 5%.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EA1 = JS2.A3;\u003Cbr\u003EA1 = A1*116;\u003Cbr\u003EA1 = A1/100;\u003Cbr\u003Eif ([A1 \u0026gt; 255]) then\u003Cbr\u003E  A1 = 255;\u003Cbr\u003Eendif\u003Cbr\u003ECMS.A1 = A1;\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethe first line copies the throttle axis to a variable, if your throttle axis is somewhere other than js2.a3, change this, the format is js(stick number).a(axisnumber).\u003C/p\u003E\u003Cp\u003Ethe 116 in the second line is your scale factor. i want to map the output into the range 0-255. but my throttle only seems to have a range of 0-224. i want the threashold to be around 220, so there is a small deadzone at the base of the throttle. 255/220 = 1.1591. but since you are using int math this number doesnt make sense, so multiply it by 100 and round to the nearest integer, in my case 116. thats also what the A1/100 in the following is for, its essentially decimal fixed point math.\u003C/p\u003E\u003Cp\u003Ethe last line saves the variable to one of the cms axes. remember to leave the physical throttle axis unmapped and map the cms axis in its place. i also have the revers flag ticked in my cms control, that is probibly important.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-13T21:44:31Z\u0022 title=\u002204/13/2014 09:44  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 13, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003Cbr\u003Erewrote script because better\n\u003C/span\u003E\n"}]}