{"TopicId":69174,"ForumId":16,"TopicTitle":"Navball Wobble","CreatedByName":"Ryds","CreatedById":108453,"CreatedDateTime":"2014-04-12T22:56:54Z","PageNum":1,"Articles":[{"CreatedByName":"Ryds","CreatedById":108453,"CreatedDateTime":"2014-04-12T22:56:54Z","Content":"\n\u003Cp\u003EHi there,\u003C/p\u003E\u003Cp\u003EI\u0027ve not had this issue before but it\u0027s killing me at the moment. My ships, of all different sizes and parts, seem to wobble in orbit. It\u0027s not very visible when viewing the ship directly however once a node is placed, when using mechjeb or manually, the markers can deviate 180 degrees in a second - making it impossible to line up.\u003C/p\u003E\u003Cp\u003EI first noticed it out near Dres and had to spend 5 hours trying to manually dock a ship. I got it in the end but man it\u0027s doing my head in!\u003C/p\u003E\u003Cp\u003EI\u0027ve it with RCS off, SAS off (both in crew modules and SAS rings) and combinations of them both on/off but no effect.\u003C/p\u003E\u003Cp\u003EMy wobbling ships at the minute are:\u003C/p\u003E\u003Cp\u003EA large tanker (5 orange fueltank) in orbit around Kerbin with a large SAS ring and mechjeb\u003C/p\u003E\u003Cp\u003EA tiny one man lander craft, about 20 tons, with 1 man module, mechjeb and a small SAS ring.\u003C/p\u003E\u003Cp\u003EI just can\u0027t get these to dock in within a decent (less tan an hour) amount of time due to the inaccurate position reports on the navball. \u003C/p\u003E\u003Cp\u003EI have no other mods, just the latest MJ and 023.5, any ideas at all what is causing the wobble?\u003C/p\u003E\u003Cp\u003E.9\u003C/p\u003E\u003Cp\u003EThanks!!\u003C/p\u003E\n"},{"CreatedByName":"Hans Dorn","CreatedById":105419,"CreatedDateTime":"2014-04-12T23:16:21Z","Content":"\n\u003Cp\u003EHad the same problem with various ships. Some strategically placed struts resolved the issue.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-12T23:22:16Z","Content":"\n\u003Cp\u003EAre you choosing \u0022control from here\u0022 on suitable parts? For main engine burns it helps to have a probe core near the engines. For docking, you want to control from the docking port in question. This is especially, but not only, an issue for multi-part ships with sections docked together.\u003C/p\u003E\u003Cp\u003EAre you going \u003Cem\u003Ereally\u003C/em\u003E slowly? That\u0027ll make the navbal more susceptible to jitter.\u003C/p\u003E\u003Cp\u003EAnd, of course, have you tried closing and reopening the game? There are some other bugs that\u0027s been known to fix.\u003C/p\u003E\n"},{"CreatedByName":"mattheos","CreatedById":107241,"CreatedDateTime":"2014-04-12T23:39:23Z","Content":"\n\u003Cp\u003EDoes it happen with your much smaller ships?\u003C/p\u003E\u003Cp\u003EIts probably just your ship flopping around. Especially, with ships that big. The whole thing will flop around and that in turn, will make the markers on the navball jump around, and make orbit lines and maneuver nodes move all over the place. Sometimes quite a bit. \u003C/p\u003E\u003Cp\u003E23.5 helped a ton with wobble and floppy issues, but struts might help. Struts, struts, struts. There are several old posts about where to put them and why.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-04-13T00:00:18Z","Content":"\n\u003Cp\u003ESeveral people have reported - and I have seen - many ships develop a \u0027wobble\u0027 in 0.23.5, where they just oscillate all the time; means the navball doesn\u0027t know which way you\u0027re pointing. For me a few times I just haven\u0027t been able to determine whether I even have an intercept at all because the orbit bounces around so much. A short touch of warp sometimes stops the wobble but not always, depends on the ship.\u003C/p\u003E\n"},{"CreatedByName":"Hans Dorn","CreatedById":105419,"CreatedDateTime":"2014-04-13T00:21:00Z","Content":"\n\u003Cp\u003EThe SAS rings got wobbly with 0.23.5, especially the large one. If they\u0027re not firmly attached to the controllig pod and the heavy part of the ship, SAS does a bad job at damping oscillations.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-13T00:23:09Z\u0022 title=\u002204/13/2014 12:23  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 13, 2014\u003C/time\u003E by Hans Dorn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-13T00:24:06Z","Content":"\n\u003Cp\u003ECould we see a picture of your ship? That often helps diagnose problems. (Also, moved to gameplay questions.)\u003C/p\u003E\n"},{"CreatedByName":"Ryds","CreatedById":108453,"CreatedDateTime":"2014-04-13T11:03:17Z","Content":"\n\u003Cp\u003EHi All,\u003C/p\u003E\u003Cp\u003EThanks a lot for your replies and for moving this to the correct forum, sorry about that.\u003C/p\u003E\u003Cp\u003EI\u0027ve didn\u0027t see the posts about struts, is the rule of thumb just to place struts everywhere you can or are there key areas to look at. Perhaps you could have look at my ship and give me some advice.\u003C/p\u003E\u003Cp\u003EYep, they are two big ships, but if you look at the picture of the lander, that is actually quite a small one-man job and it was using the same one unattached when out by Dres that I noticed the problem. Now, I would say that the issue is obviously with the design of that ship in particular, but the tanker is also doing it as well and that\u0027s a pretty basic, if large, design. \u003C/p\u003E\u003Cp\u003EHere\u0027s the pics: \u003Ca href=\u0022http://imgur.com/a/x3ZJb\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/x3ZJb\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks a lot!\u003C/p\u003E\n"}]}