{"TopicId":69404,"ForumId":24,"TopicTitle":"Trouble matching orbits","CreatedByName":"bflave13","CreatedById":108653,"CreatedDateTime":"2014-04-15T02:33:08Z","PageNum":1,"Articles":[{"CreatedByName":"bflave13","CreatedById":108653,"CreatedDateTime":"2014-04-15T02:33:08Z","Content":"\n\u003Cp\u003EHi everyone, I\u0027m new with KSP. Im trying to get started by building a fueling station in Earth orbit but I have such a hard time getting their orbits to match up so I can add on. Any advice?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-15T03:48:18Z","Content":"\n\u003Cp\u003EHow are you missing? \u003C/p\u003E\u003Cp\u003EIf you\u0027re arriving too soon or too late, save the game, launch to the target\u0027s orbital height and note the time that takes, then load your save and launch when the target is that far east of KSC. \u003C/p\u003E\u003Cp\u003EIf you\u0027re missing north/south, is the target on an equatorial orbit? \u003C/p\u003E\u003Cp\u003EIt very much depends on what the specific situation is. Can you give us more information?\u003C/p\u003E\n"},{"CreatedByName":"plausse","CreatedById":64331,"CreatedDateTime":"2014-04-15T11:21:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bflave13\u0022 data-cite=\u0022bflave13\u0022\u003E\u003Cdiv\u003EHi everyone, I\u0027m new with KSP. Im trying to get started by building a fueling station in Earth orbit but I have such a hard time getting their orbits to match up so I can add on. Any advice?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAssuming station is in prograde equatorial orbit:\u003C/p\u003E\u003Cp\u003EOne way of doing it would be to launch \u0022ahead\u0022 of your target.\u003C/p\u003E\u003Cp\u003E1) launch 1/6 orbit or so \u003Cem\u003Ebefore\u003C/em\u003E the target passes overhead KSP (the closer to the target, the less d/v you need.. but no biggie)\u003C/p\u003E\u003Cp\u003E2)Raise your apoapsis to that of the target orbit\u003C/p\u003E\u003Cp\u003E3)Coast to apoapsis\u003C/p\u003E\u003Cp\u003E4)Burn at apoapsis until your closest encounter is as good as it will get (if inclination is matched it will be \u0026lt;1km). This will give you an elliptical orbit with an apoapsis \u003Cem\u003Ehigher\u003C/em\u003E than that of your target.\u003C/p\u003E\u003Cp\u003E5)Match inclination by burning in normal/antinormal direction at the first ascending/descending node\u003C/p\u003E\u003Cp\u003E6)Coast to Apoapsis. Here you can use RCS to do any fine adjusting either prograde or retrograde. It will take slightly more d/v, but you have more control. Any close encounter \u0026lt;5km can easily turn into rendezvous, but elegance demands \u0026lt;200m.\u003C/p\u003E\u003Cp\u003E7)Coast to closest encounter. Change velocity view from \u0022orbit\u0022 to \u0022target\u0022. Burn at retrograde marker until 0. Then point at target, burn again until relative velocity is 10m/s or so. Then coast until new closest encounter, point retrograde and burn till relative velocity is 0. Rinse and repeat.\u003C/p\u003E\u003Cp\u003E\u0026lt;EDIT\u0026gt;\u003C/p\u003E\u003Cp\u003Ethe benefit of said method over a direct rendezvous in the first orbit is the much lower need for accuracy. for a direct approach you need to launch at a fixed time, and use a fixed ascent profile. You can somewhat modify the launch window depending on the ascent profile.. But if your struggling you will more likely than not miss. That gives you a scenario where you will take several orbits anyway.. And likely use more d/v as well. The two orbit method not the most elegant.. but it is probably the most idiot proof.\u003C/p\u003E\u003Cp\u003EHope that at all made sense/was a tiny bit helpful.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-15T11:26:29Z\u0022 title=\u002204/15/2014 11:26  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 15, 2014\u003C/time\u003E by plausse\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-04-15T11:23:01Z","Content":"\n\u003Cp\u003EIs this an illegal station IRL? You \u003Cem\u003Edid\u003C/em\u003E say \u0022In Earth Orbit\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBesides that, I have a tutorial on everything you need, there\u0027s a link in my signature. Check it out.\u003C/p\u003E\n"},{"CreatedByName":"StainX","CreatedById":57820,"CreatedDateTime":"2014-04-15T12:51:11Z","Content":"\n\u003Cp\u003EWow a fueling Station around Earth? Didn\u0027t heard anything bout your station on the news! Naaaaawww just kidding \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo first: Welcome aboard, Kerbonaut!\u003C/p\u003E\u003Cp\u003EYou should check out some Youtube Vids to get a good sense about orbital mechanics and docking, also you may try the ingame tutorials, helped me a lot.\u003C/p\u003E\u003Cp\u003ENow go an conquer the solar system for whole kerbalkind! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-04-15T12:58:29Z","Content":"\n\u003Cp\u003EEarth? whats an Earth?\u003C/p\u003E\n"},{"CreatedByName":"Jack Redmen","CreatedById":107613,"CreatedDateTime":"2014-04-15T13:31:24Z","Content":"\n\u003Cp\u003EI usually don\u0027t do a direct rendezvous, I just wait to launch until the target is right over head or just a little before. It usually takes about 3-4 orbits to rendezvous. I use a similar method as \u003Cem\u003E\u003Cstrong\u003Eplausse\u003C/strong\u003E\u003C/em\u003E described above. \u003C/p\u003E\u003Cp\u003E-First set \u003Cspan style=\u0022color:#333333;\u0022\u003Eapoapsis to match your target\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E-Then coast to the apoapsis and set your periapsis accordingly (make sure you have actually targeted your target first so you see intersections and inclination)\u003C/p\u003E\u003Cp\u003E * If you are behind your target set periapsis slightly lower than target\u003C/p\u003E\u003Cp\u003E * If you are ahead of target set periapsis a little above your target\u0027s\u003C/p\u003E\u003Cp\u003E-Then correct your inclination at the next inclination node (it helps to use a maneuver node here so you know which way to burn)\u003C/p\u003E\u003Cp\u003E-Warp time and orbit while monitoring your separation at each intersect (Seperation should be decreasing)\u003C/p\u003E\u003Cp\u003E-When you see your positions flip flop burn either prograde or retrograde (depending on if your periapsis is higher or lower than targets) until your intersect closes to less than 1 km\u003C/p\u003E\u003Cp\u003E-Approximatley 1/4 orbit before your intersect switch your navball over to target mode and burn towards your target until prograde indicator is inside your target indicator (you actually burn off to one side of the target node to do this)\u003C/p\u003E\u003Cp\u003E-Flip retrograde and burn to reduce your speed in relation to your target.\u003C/p\u003E\u003Cp\u003E-Repeat last two steps until prograde indicator is inside target indicator \u003Cem\u003Eand \u003C/em\u003Eyou have an intersect of 0.0 km.\u003C/p\u003E\u003Cp\u003E-Inside of 1 km from target switch to RCS and begin thrusting retrograde to bring your speed down. By the time I\u0027m 100 meters or so out I like to be under 5 m/s. Keep the prograde and target indicators lined up.\u003C/p\u003E\u003Cp\u003EThat\u0027s about it. Then you just have to dock\u003C/p\u003E\n"},{"CreatedByName":"Runboy","CreatedById":62496,"CreatedDateTime":"2014-04-15T13:56:55Z","Content":"\n\u003Cp\u003EHere are 2 separate tutorials for learning how to dock,they are by the same person (Scott Manley).You can go to his channel for more KSP tutorials,I find them very educational.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/AHkY3FusJIQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/srsiLZLPiv0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Xaelath","CreatedById":106084,"CreatedDateTime":"2014-04-15T15:11:32Z","Content":"\n\u003Cp\u003EHi and welcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}