{"TopicId":69407,"ForumId":32,"TopicTitle":"This - right here - is why I will play this game, and read the forum, until I die","CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-04-15T02:55:02Z","PageNum":1,"Articles":[{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-04-15T02:55:02Z","Content":"\n\u003Cp\u003EI have just spent the last 2 hours waiting for my ship to explode.\u003C/p\u003E\u003Cp\u003EFrankly I had just about had it with KSP for a bit. I was out of ideas and the asteroid thing seemed amusing but from a short-term perspective only. I had it in my head that once I finished the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57197-The-ultimate-Jool-5-challenge-land-Kerbals-on-all-moons-and-return-in-one-big-misson\u0022 rel=\u0022external nofollow\u0022\u003EJool 5 chellange\u003C/a\u003E I was going to take a break. Been playing about a year, but far more dedicated since about November 2013, which frankly puts this into the top echelon of computer-based things I have gotten hooked on.\u003C/p\u003E\u003Cp\u003EI then spent the next approx 15 days (most of my free time sadly - luckily I have no yard work to do yet what with the snow and ice still melting and such) trying this over and over. I had more vessels spontaneously dis-assemble than I would like to count. Didn\u0027t matter whether I used MJ, didn\u0027t use it, tried many different drive designs, some good, some stupid. Somewhere around 35-40Gm my ship would always blow itself apart. Usually because a lander tank would spontaneously detach from its decoupler, leaving me completely unable to complete the mission. I actually posted to this effect, claiming that crossing the orbit of Dres somehow wrecked your ship.\u003C/p\u003E\u003Cp\u003EThen somebody necro\u0027d the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/31955-If-my-ASAS-could-talk\u0022 rel=\u0022external nofollow\u0022\u003Ethread\u003C/a\u003E about your discussion with ASAS and I started to realize that maybe the flaw was at least partly my fault. (Oh and also I still can\u0027t stop laughing, it\u0027s hard to drive a spaceship with the giggles.) I had too much ASAS on the ship associated with all of the landers and such. I turned off a bunch of them. And: LOOK! I think I have this bad boy nailed!!!!! I have gotten past all of the previous failure points and am now computing my Jool-Laythe encounter. I managed to get through dropping 6/10 of the big orange tanks without once having a lander tank just fall off.\u003C/p\u003E\u003Cp\u003ESadly I failed at the research aspect (not the Science aspect - I play in Sandbox - but the \u0022don\u0027t-change-more-variables-in-an-experiment-than-you-can-account-for-or-keep-track-of \u0022 aspect got lost during a fit of rage) - I changed many many variables at once. Added struts, removed ASAS here and there, added mass to the bottom of the vessel, upgraded to 23.5... But yay!!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3cNCU1V.jpg\u0022 alt=\u00223cNCU1V.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-15T03:52:17Z","Content":"\n\u003Cp\u003ENice work! I\u0027m no great shakes at huge monsters like that.\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2014-04-15T04:29:19Z","Content":"\n\u003Cp\u003E23.5 increased joint stability, so that might have been the variable that had the greatest effect on keeping your ship together.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-04-15T05:31:31Z","Content":"\n\u003Cp\u003EThe landers come apart because each SAS module acts on it\u0027s own center of mass and not the center of mass of the ship. So having several SAS modules spaced so far apart would cause the ship to rip itself apart from the torque as the SAS tries to move from different angles.\u003C/p\u003E\n"},{"CreatedByName":"HamHead","CreatedById":108213,"CreatedDateTime":"2014-04-15T07:43:41Z","Content":"\n\u003Cp\u003ETC, I\u0027ve had the same problem with missing fuel. Apperantly I right clicked on a fuel tank in VAB and didn\u0027t realize I had taken fuel out via click and drag. Now, before launches, I manually go through each fuel tank (takes a while) to confirm all fuel is accounted for. \u003C/p\u003E\u003Cp\u003EAnd congrats on the Eve landing. I\u0027m sort of afraid to put any kerbals on Eve.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-04-15T07:48:16Z","Content":"\n\u003Cp\u003EI have a very small tug, just docking ports at both ends sandwiching MonoProp tank, probe core, battery and SAS module - whenever I activate SAS it starts to shake heavily.\u003C/p\u003E\u003Cp\u003ESo, yes, SAS is not always our friend.\u003C/p\u003E\n"},{"CreatedByName":"John Crichton","CreatedById":102565,"CreatedDateTime":"2014-04-15T08:20:09Z","Content":"\n\u003Cp\u003EOne of the few games where stuff not working out is actually enjoyable.\u003C/p\u003E\n"}]}