{"TopicId":69411,"ForumId":16,"TopicTitle":"Seperating RCS from rotation and SAS","CreatedByName":"Mlah","CreatedById":64670,"CreatedDateTime":"2014-04-15T03:56:34Z","PageNum":1,"Articles":[{"CreatedByName":"Mlah","CreatedById":64670,"CreatedDateTime":"2014-04-15T03:56:34Z","Content":"\n\u003Cp\u003EI was messing around when I noticed the tritium RCS thrusters where ridiculously over powered to the point where I could use them in place of engine and only need a single fuel tank that could give me tens of thousands of dv. So I have been having fun building probes and landers using nothing but RCS but the problem I am running into is I will have massive banks of RCS thrusters and if I want to tilt the ship a little while I am doing a burn instead of just using the reaction wheels it will try to use every thruster to turn causing the ship to spin violently. Its even worse with SAS enabled as it creates a tremor that just builds ups as it tries to correct itself, each time overshooting more, ending with the whole ship shaking back and forth. I need RCS for my forward thrust so I am wondering if there is some way either through the stock game or a mod that will make it so that when I rotate it only uses the reaction wheels installed on my craft.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-04-15T05:15:52Z","Content":"\n\u003Cp\u003Eif you hit \u0027R\u0027 it will turn off your RCS.\u003C/p\u003E\n"},{"CreatedByName":"Mlah","CreatedById":64670,"CreatedDateTime":"2014-04-15T05:58:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003Eif you hit \u0027R\u0027 it will turn off your RCS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI realize this but I am not trying to turn RCS off. Like I said I RCS is what is providing my forward thrust so I need them running as I make my maneuver. What I want is to be able to keep my RCS thruster that are pointing down running and then be able to pitch to the side using the reaction wheels without half of my RCS thrusters turning off and flinging me into a wild spin.\u003C/p\u003E\n"},{"CreatedByName":"psyper","CreatedById":90641,"CreatedDateTime":"2014-04-15T06:30:51Z","Content":"\n\u003Cp\u003EI think what Taki117 is trying to say is that while thrusting and you need to adjust your course you may need to turn off rcs, maneuver, turn rcs back on and then keep thrusting. I don\u0027t think there is a way to disable individual rcs jets on an rcs part otherwise you could turn off the lateral rcs jets and just leave the ones you\u0027re using as rockets.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-04-15T06:30:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mlah\u0022 data-cite=\u0022Mlah\u0022\u003E\u003Cdiv\u003EI realize this but I am not trying to turn RCS off. Like I said I RCS is what is providing my forward thrust so I need them running as I make my maneuver. What I want is to be able to keep my RCS thruster that are pointing down running and then be able to pitch to the side using the reaction wheels without half of my RCS thrusters turning off and flinging me into a wild spin.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, ok. No way I know of doing this. You might try using Docking mode, but beyond that I don\u0027t think it\u0027s possible.\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-04-15T08:20:45Z","Content":"\n\u003Cp\u003ECan we see a pic of your ship? Sounds interesting. I think you can toggle RCS ports with action groups if that will help. Also if that doesn\u0027t work maybe hitting capslock for fine control will ease the problem.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-15T08:26:11Z\u0022 title=\u002204/15/2014 08:26  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 15, 2014\u003C/time\u003E by Redshift OTF\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-04-15T09:45:33Z","Content":"\n\u003Cp\u003Eare there not single-output RCS ports? I know I\u0027ve seen some in videos. Maybe mod parts. I dunno never had to use them and I\u0027m in career so if they\u0027re there I haven\u0027t unlocked them yet\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-15T10:01:28Z","Content":"\n\u003Cp\u003EMechJeb recently had the addition to \u0027Use SAS for rotation\u0027 and also \u0027Use RCS for thrust when fuel runs out\u0027 or something, so the RCS acts like your engines (can even have half throttle etc). Sounds exactly like the thing you\u0027re asking for.\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-04-15T10:19:08Z","Content":"\n\u003Cp\u003EStock? no. You would need to write a new module for those RCS with that feature.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-15T10:31:54Z","Content":"\n\u003Cp\u003EI started a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/72631-Minor-adjustment-to-RCS-toggling\u0022 rel=\u0022external nofollow\u0022\u003Ethread in the Suggestions subforum\u003C/a\u003E about exactly this issue. Seems like posters supported it, whether the devs implement it who could say?\u003C/p\u003E\u003Cp\u003EI didn\u0027t realize MechJeb had implemented something similar, I should poke around in the windows to try it.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-15T10:33:33Z","Content":"\n\u003Cp\u003ECan\u0027t remember the RCS for thrust option location, but use SAS for rotation is in the RCS Balancer window I think.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-15T11:15:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003ECan\u0027t remember the RCS for thrust option location, but use SAS for rotation is in the RCS Balancer window I think.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, I\u0027m more interested in that option than RCS for thrust.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-04-15T16:11:03Z","Content":"\n\u003Cp\u003EThe \u0027place anywhere\u0027 ones are single-output.\u003C/p\u003E\u003Cp\u003EYou can right-click and toggle any thruster on/off - affects them using symmetry AFAIK so you\u0027ll have to place them individually if that\u0027s how you want to control them.\u003C/p\u003E\u003Cp\u003ESame thing can be done with action groups. Using the excellent Action Groups Extended mod they are individually controllable, regardless of symmetry.\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-04-15T20:06:20Z","Content":"\n\u003Cp\u003EI\u0027ve been using the use RCS for thrust option in MechJeb and it is very useful. It also has the option of turning off RCS for turning so you can keep SAS for just turning and RCS just for thrust. I think I can finally get my Eve plane working at last.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-15T20:25:40Z","Content":"\n\u003Cp\u003ESingle output or not, they\u0027ll still fire if they\u0027re even slightly off center from your COM and you turn.\u003C/p\u003E\u003Cp\u003EI\u0027d love to be able to set their control kind of like flaps. Instead of pitch and yaw all we\u0027d need, probably, is \u0022rotate\u0022 and \u0022translate\u0022 buttons.\u003C/p\u003E\n"},{"CreatedByName":"Mlah","CreatedById":64670,"CreatedDateTime":"2014-04-15T20:50:31Z","Content":"\n\u003Cp\u003EI can\u0027t seem to find the RCS for thrust option although mechjeb seems to automatically do so and is much better at keeping the rocket stable. I did find the \u0022use RCS for rotation\u0022 and tried unchecking it but that required turning on smart translation first which prevented my thrusters from actually generating enough thrust to lift the vessel \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Also just messing with the option clicking \u0022use RCS for rotation\u0022 would cause all the top facing thruster to emit a massive thrust plume much longer then normal that looked like a massive fireball which was awesome.\u003C/p\u003E\u003Cp\u003EOther things I have tried is messing with placement and type. For example my original designs which I am going to put below used the 4 way thrusters so I tried using just the single directional ones. I think that made it a little better but they still get used for rotation causing the same problems.\u003C/p\u003E\u003Cp\u003ELast but not least here are some picture of what these craft look like so you can see how I am using these.\u003C/p\u003E\u003Cp\u003EHere is one of my first tests, this guy actually worked pretty well and I was able to get him into orbit which is where he currently resides mapping kerbin\u0027s kethane deposits. Hes a little low on thrust though.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/3299193636586697739/D9CAFF3869A10BDB7BAF3BC355C0C7466C4FC9EA/\u0022 alt=\u0022D9CAFF3869A10BDB7BAF3BC355C0C7466C4FC9EA\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is my current design that I am having the most problems with. I wanted to build him with a lot of thrust so he could push asteroids around. I don\u0027t have a screen shot of it but I attempted switching to mono directional thrusters and placing them underneath the pillars but it didn\u0027t halep much.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/3299193636586705057/02D00B27C93AC93B8EA41283254C90AE98AD4470/\u0022 alt=\u002202D00B27C93AC93B8EA41283254C90AE98AD4470\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-04-15T22:27:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003Eare there not single-output RCS ports? I know I\u0027ve seen some in videos. Maybe mod parts. I dunno never had to use them and I\u0027m in career so if they\u0027re there I haven\u0027t unlocked them yet\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, there are. The Linear RCS Port can be placed anywhere, and only produces thrust in a single direction. However, unless the only RCS ports on the ship are used for thrust, it probably won\u0027t fully solve the OP\u0027s issue.\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-04-16T07:15:02Z","Content":"\n\u003Cp\u003EThanks for the pics. Although I don\u0027t think you can solve the problem I think you can mostly mitigate it enough to still use RCS thrusters for thrust. I use the octagonal struts and attatch multiple single direction RCS thrusters to those and stack them together to make a thrust tail. If most of the ports are in line with the centre of mass then the turning effect will be minimal. On landers the tail could sit at the top of the craft. Not ideal or pretty but it could work.\u003C/p\u003E\n"},{"CreatedByName":"Mlah","CreatedById":64670,"CreatedDateTime":"2014-04-16T08:34:32Z","Content":"\n\u003Cp\u003EI think that\u0027s what I am going to end up doing. I wanted to avoid a tower just because I like the way my spider probes look but an inverted hammer could be fun.\u003C/p\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-04-16T09:57:17Z","Content":"\n\u003Cp\u003Erls stockalike has true monopropellant engines which may be more what you are looking for.\u003C/p\u003E\u003Cp\u003EPersonally, I\u0027d like to see those tiny low thrust engines converted to monopropellant engines, since they aren\u0027t really that useful. It would be simple enough to do with an MM config if you don\u0027t want to use rla.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-16T10:00:11Z\u0022 title=\u002204/16/2014 10:00  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 16, 2014\u003C/time\u003E by WaveFunctionP\u003C/strong\u003E\n\u003C/span\u003E\n"}]}