{"TopicId":6949,"ForumId":36,"TopicTitle":"[Future versions][Module modding] Creating advanced multi-purpose part modules","CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2012-02-23T09:18:24Z","PageNum":1,"Articles":[{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2012-02-23T09:18:24Z","Content":"\n\u003Cp\u003EAs we know, in 0.14 there will be possible to create new part modules. :w00t:\u003C/p\u003E\u003Cp\u003EHowever if every modder makes his own module for every part, that would be a complete mess. \u003C/p\u003E\u003Cp\u003ESo, I propose to discuss specifications of new part modules that would cover practically every need for this type of part - so that every (sane) option for this part will be available through part.cfg for mod creators.\u003C/p\u003E\u003Cp\u003ELet\\\u0027s make specifications and then (when we get necessary API) code these modules and make them available for everyone who needs these options for their parts.\u003C/p\u003E\u003Cp\u003EI already have some suggestions about engines (how to implement almost every feature that can be found in rocket engines), I\\\u0027ll post them a bit later.\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2012-02-23T13:04:54Z","Content":"\n\u003Cp\u003ESo, the engines:\u003C/p\u003E\u003Cp\u003EThis structure can be split into 3 logical layers\u003C/p\u003E\u003Cp\u003E1) The top layer (\u0027cluster\u0027) - this layer is responsible for physics. So it should include the basic part parameters. It will also get thrust center, thrust vector and torque (from roll control nozzles) values from the lower levels and transform them into these values, that are passed to physics.\u003C/p\u003E\u003Cp\u003E2) \u0027Groups\u0027 (can include several engines/nozzles) - the most interesting layer, that needs to be defined in .cfg. Each group should contain its own parameters like fuel consumption (and even fuel types, including internal reserves if needed), thrust vectoring types (one of the most complex parts of this), throttle and ignition/cutoff profile (there can be some interesting features) and other effects (including atmospheric pressure effects). Processes thrust values from the lowest level and passes them to top level.\u003C/p\u003E\u003Cp\u003E3) \u0027Nozzle\u0027 separate engines/nozzles or small groups of them. Several \u0027nozzles\u0027 in one \u0027group\u0027 have the same parameters, but different positions, therefore react differently to control imputs. (if the \u0027group\u0027 has no thrust vectoring it can be always described as 1 \u0027nozzle\u0027 object. Exhaust effects and nozzle deflections described in this level.\u003C/p\u003E\u003Cp\u003ESo, examples of such engine structures:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ER-7 (Soyuz)\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E1st stage (booster): main engine described as a \u0027group\u0027 with 1 \u0027nozzle\u0027 (but there are 4 exhaust effects); steering engine described as a group of 1 \u0027nozzle\u0027 with deflection in 1 plane (there are 2 nozzle objects and 2 exhaust effects linked to it), that responds to pitch/yaw/roll control.\u003C/p\u003E\u003Cp\u003E2nd stage (central block): main engine described as a \u0027group\u0027 with 1 \u0027nozzle\u0027 (but there are 4 exhaust effects); steering engine described as a group of 4 nozzles with deflection in 1 plane, that respond to pitch/yaw/roll control. Same with stage 3.\u003C/p\u003E\u003Cp\u003EFor all these stages throttle profile should be such that if the stage is set to very low throttle, central engine is cut off, but the steering engine is still active at low thrust. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESaturn V\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1st stage: central engine is a separate \u0027group\u0027 with throttle profile that performs CECO when decreasing throttle to 80% (others engines work at full thrust in this range). Other engines are a group of 4 nozzles with gimbals and pitch/yaw/roll control.\u003C/p\u003E\u003Cp\u003E2nd stage: the same, but the peripheral engines with tangential (1 plane) deflection.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProton\u003C/strong\u003E 1st stage: 1 group of 6 \u0027nozzles\u0027 - tangential deflection, pitch/yaw/roll control.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EN1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1st stage: 6 central engines described as 1 group with 1 logical \u0027nozzle\u0027 and CECO profile; 24 peripheral engines are a group with throttling (thrust center shifting) pitch/yaw control (they can be split into 8 logical nozzles); 6 roll nozzles can be described as 1 logical nozzle (with synchronous animation of the 6 nozzles tangential deflection and effect directly converted into torque)\u003C/p\u003E\u003Cp\u003E2nd and 3rd stages: group of 8 (stage 2) or 4 (stage 3) engines (\u0027nozzles\u0027) with pitch/yaw control by throttling \u002B 4 roll nozzles described as 1 logical nozzle.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E7K-OK Soyuz spacecraft\u003C/strong\u003E orbital engine (???): 1 group of single main nozzle \u002B a group of fixed attitude control nozzles with different orientations.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBlock D stage\u003C/strong\u003E (N1, Proton, Zenit): main engine with gimbal pitch/yaw control \u002B ignition support system (???) with several (numbers are different in different modifications) nozzles used for engine ignition (acceleration by prograde translation, all modifications), roll control during engine firing and attitude control before ignition (except N1-L3 where this was done by LOK RCS), that use internal fuel reserves. This thing could be simulated with several \u0027groups\u0027\u003C/p\u003E\u003Cp\u003ESome groups can have specific ignition parameters, like minimal G-force and minimal throttle. Or even if some other group is or is not active. Or it can have limited number of ignitions.\u003C/p\u003E\n"},{"CreatedByName":"Nomad","CreatedById":4989,"CreatedDateTime":"2012-02-25T03:52:41Z","Content":"\n\u003Cp\u003EChances are, Harv or somebody else will make a Module Megathread that contains every custom module made. This way we don\\\u0027t have people reinventing the wheel.\u003C/p\u003E\n"}]}