{"TopicId":69587,"ForumId":32,"TopicTitle":"Pet peeves","CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-04-17T00:56:27Z","PageNum":4,"Articles":[{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-21T22:11:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Franklin\u0022 data-cite=\u0022Franklin\u0022\u003E\u003Cdiv\u003EI can\u0027t see my stages on the orbital map screen. It seems like the easiest update to show the stages on that screen, I don\u0027t know why there hasn\u0027t been an update or at very least a mod that makes this possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60227-\u0022 rel=\u0022external nofollow\u0022\u003EAlternate Resource Panel\u003C/a\u003E doesn\u0027t do what you asked for, but it sidesteps around it very nicely and I prefer it to seeing the stages. It also enables the ability to stage while in map view.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-04-21T22:34:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EIn this vein: No estimation of dV (in any view). Should be in the VAB and when making a maneuver node, at the very least.\u003Cp\u003EYes I know both of these are available in Kerbal Engineer (and other mods). I personally consider KER to be \u0022stock\u0022 and won\u0027t play without it. But it would still be nice for it to actually be stock.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEither a dV estimate, or at least a good display of duration of fuel available to each engine. This needs to take into account how many engines share a fuel tank, etc, which is currently misleading in the fuel bar-graphs.\u003C/p\u003E\n"},{"CreatedByName":"MeticulousMitch","CreatedById":34869,"CreatedDateTime":"2014-04-22T00:52:30Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ERover wheels\u003C/strong\u003E, definitely. They don\u0027t have proper physics in the way that everything else in the game does, and they are essentially on rails - turning hard enough will flip any rover, no matter how low to the ground it is.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EInfiniglide\u003C/strong\u003E is another major one. Crashing your plane and seeing wings and control surfaces just floating slowly through the air.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELanding gear\u003C/strong\u003E that can\u0027t support the weight of your heavy lander.\u003C/p\u003E\n"},{"CreatedByName":"stasisfield","CreatedById":99259,"CreatedDateTime":"2014-04-22T06:05:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022helaeon\u0022 data-cite=\u0022helaeon\u0022\u003E\u003Cdiv\u003EFree camera not really being free (it bumps up against something like it ran out of gimbal) and Kerbals on EVA not always facing the direction the camera does, like they are obeying some kind of orientation plane.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/368\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bugs.kerbalspaceprogram.com/issues/368\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis bug is the single reason I haven\u0027t played this game in months. It\u0027s incredibly frustrating to have to struggle with invisible camera boundaries. Just as bad is that the bug priority is Very Low, so I\u0027m not confident it will be fixed any time soon.\u003C/p\u003E\n"},{"CreatedByName":"Daffs","CreatedById":109699,"CreatedDateTime":"2014-05-09T20:29:02Z","Content":"\n\u003Cp\u003ENo, in game real world clock. (I play full screen)\u003C/p\u003E\u003Cp\u003E\u0022I\u0027m just going to play for 1 hour and do this one mission\u0022....*BOOM* ok so let me tweak that....*BOOM*....ok nearly there....*Crash lands*....ok redesign the landing legs.......*Lands*...Ladders, I always forget ladders...*15 minutes of jumping*....It\u0027s three am! and I\u0027ve got work in the morning!\u003C/p\u003E\u003Cp\u003EThis game has me hooked! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jas1126","CreatedById":99760,"CreatedDateTime":"2014-05-09T21:54:01Z","Content":"\n\u003Cp\u003EI was driving this (see pic below) with 8k Kethane and the front tire popped. As soon as that happened the rest of the wheels simply fell off. Tires are highly unreliable no matter the scenario. I\u0027m guessing in this case the weight and the very slight turn (less than 15 degrees at a low speed) didn\u0027t help.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1081.photobucket.com/user/jas1126/media/FuelRover_zps3d84c24e.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1081.photobucket.com/albums/j350/jas1126/FuelRover_zps3d84c24e.png\u0022 alt=\u0022FuelRover_zps3d84c24e.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-05-10T02:48:01Z","Content":"\n\u003Cp\u003ENot having a key to set time to 1x.\u003C/p\u003E\n"},{"CreatedByName":"Mipe","CreatedById":109421,"CreatedDateTime":"2014-05-10T11:51:10Z","Content":"\n\u003Cp\u003EMy pet peeves are typos like \u0022pet peaves\u0022. Off to do stuff to voodoo doll resembling the OP.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-10T13:58:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003ENot having a key to set time to 1x.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow is this not a thing yet? Have you suggested it?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-05-10T15:16:01Z","Content":"\n\u003Cp\u003Emisspelled thread titles.\u003C/p\u003E\n"},{"CreatedByName":"Terry.c.hickman","CreatedById":107651,"CreatedDateTime":"2014-05-10T16:41:59Z","Content":"\n\u003Cp\u003ECircling your orbit in prep to dock... And realizing your not circling your orbit because your maneuver node has switched from \u0022orbit\u0022 to \u0022target\u0022 automatically without paying attention till your orbit is way out of wack\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-05-10T17:34:06Z","Content":"\n\u003Cp\u003Epeeepole hoo complane a bhout someall shpelling butt dhont kontribuoot cents able eyedeeahhhs\u003C/p\u003E\u003Cp\u003Esorry - please ignore that. old man curmudgeon syndrome cropping up again...\u003C/p\u003E\u003Cp\u003Eon topic now...\u003C/p\u003E\u003Cp\u003EWhy can\u0027t I transmit changes I make (ok, corrections!) to my staging sequence back to the boys at KSP and have that saved to my current vessel design?\u003C/p\u003E\u003Cp\u003EThat would be nice.\u003C/p\u003E\n"},{"CreatedByName":"Space_Meerkat","CreatedById":102953,"CreatedDateTime":"2014-05-10T17:47:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EI can\u0027t stand how stock wheels behave like their suspension is made from Slinky springs at the worst possible moments. It makes rovers pretty untenable, and I\u0027m hoping it gets fixed at some point. Other than that, the only thing that really bugs me are mods that have way too much on-screen real estate. All of those information panels are very distracting. Any screenshot with a ton of MechJeb windows open just makes me cringe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe I heard somewhere, Squad are planning to do a major improvement to the wheels \u0022soon\u0022. \u0022soon\u0022 could be a century or a second. deal with it.\u003C/p\u003E\u003Cp\u003EWhen I want to know if I\u0027m landing on land or the sea when coming back to Kerbin, I always come back when its Night time. so I can\u0027t see.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-05-10T17:51:44Z","Content":"\n\u003Cp\u003ECrew not staying persistant if you leave the crew tab to fix something, then launch. Don\u0027t know how many times I\u0027ve had to return to spaceplane hangar, empty the other two seats of the cockpit, then send up the plane to get the two guys off of the mun. Or return to VAB because the two Hitchhiker Cans have spawned empty on a station crew transfer. Or the fact that I\u0027ve had more mission restarts in Career mode than I care to account for because the Science Lab likes to spawn empty, I get halfway to orbit, and I realize I can\u0027t reset my experiments because the lab is empty, despite filling it earlier, then realizing I was missing a strut.\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-05-10T20:12:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wallygator\u0022 data-cite=\u0022Wallygator\u0022\u003E\u003Cdiv\u003Epeeepole hoo complane a bhout someall shpelling butt dhont kontribuoot cents able eyedeeahhhs \u003Cp\u003Esorry - please ignore that. old man curmudgeon syndrome cropping up again...\u003C/p\u003E\u003Cp\u003Eon topic now...\u003C/p\u003E\u003Cp\u003EWhy can\u0027t I transmit changes I make (ok, corrections!) to my staging sequence back to the boys at KSP and have that saved to my current vessel design?\u003C/p\u003E\u003Cp\u003EThat would be nice.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell said! Yes, I\u0027ve been corrected, pointed out to and attacked for my spelling error, even after posting an apology. Oh\u0027 well. I do like your idea for being able to save staging changes on the fly, but since this thread isn\u0027t in the \u0022Suggestions\u0022 category, I\u0027ll try and stick to the topic and list one more pet PEEVE (Did I get it right?).,.,., Making one spelling mistake and getting raked over the coals for it!\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-05-10T21:32:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpacedCowboy\u0022 data-cite=\u0022SpacedCowboy\u0022\u003E\u003Cdiv\u003EWell said! Yes, I\u0027ve been corrected, pointed out to and attacked for my spelling error, even after posting an apology. Oh\u0027 well. I do like your idea for being able to save staging changes on the fly, but since this thread isn\u0027t in the \u0022Suggestions\u0022 category, I\u0027ll try and stick to the topic and list one more pet PEEVE (Did I get it right?).,.,., Making one spelling mistake and getting raked over the coals for it!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess there is a fine line between \u0022polite suggestion\u0022 and \u0022pet peeve\u0022 (notice the quotes so I can sneak past the speeeeelllllling police) so I take your point. Well done sir! Respect to you.\u003C/p\u003E\u003Cp\u003Eanother \u0022peeve\u0022... transferring kerbals between docked vessels. Sorry, but this is basic. It is a real PITA during flight. Just my opinion. So many other cool things to draw my attention during a mission... getting a crew member into the proper command space should not be such a labour. I\u0027m also keenly aware this has probably been raised too many times before so thanks for listening... and feel free to ignore my comment if it strikes a nerve.\u003C/p\u003E\u003Cp\u003EThat said, I LOVE this game. I gratefully accept all the issues that come with a pre-release and am happy to find work-arounds, alternative play strategies, and various methods of extensions to my patience... KSP is the finest game concept and delivery that I have seen in decades. Nuf said. (oops... forgot the \u0022\u0022 around nuf)\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-05-10T23:58:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpacedCowboy\u0022 data-cite=\u0022SpacedCowboy\u0022\u003E\u003Cdiv\u003EWell said! Yes, I\u0027ve been corrected, pointed out to and attacked for my spelling error, even after posting an apology. Oh\u0027 well. I do like your idea for being able to save staging changes on the fly, but since this thread isn\u0027t in the \u0022Suggestions\u0022 category, I\u0027ll try and stick to the topic and list one more pet PEEVE (Did I get it right?).,.,., Making one spelling mistake and getting raked over the coals for it!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could always fix it. Just a thought \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you don\u0027t know, you can edit your first post, go into \u0022advanced\u0022 mode, and edit the title there.\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-05-11T02:36:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EYou could always fix it. Just a thought \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EIf you don\u0027t know, you can edit your first post, go into \u0022advanced\u0022 mode, and edit the title there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I know, by the time I realized that I felt it was too late, but now I know better. BTW I\u0027ve watched some of your vids and I\u0027m inspired, educated and impressed! Keep up the good work.\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-05-11T03:30:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wallygator\u0022 data-cite=\u0022Wallygator\u0022\u003E\u003Cdiv\u003EI guess there is a fine line between \u0022polite suggestion\u0022 and \u0022pet peeve\u0022 (notice the quotes so I can sneak past the speeeeelllllling police) so I take your point. Well done sir! Respect to you.\u003Cp\u003Eanother \u0022peeve\u0022... transferring kerbals between docked vessels. Sorry, but this is basic. It is a real PITA during flight. Just my opinion. So many other cool things to draw my attention during a mission... getting a crew member into the proper command space should not be such a labour. I\u0027m also keenly aware this has probably been raised too many times before so thanks for listening... and feel free to ignore my comment if it strikes a nerve.\u003C/p\u003E\u003Cp\u003EThat said, I LOVE this game. I gratefully accept all the issues that come with a pre-release and am happy to find work-arounds, alternative play strategies, and various methods of extensions to my patience... KSP is the finest game concept and delivery that I have seen in decades. Nuf said. (oops... forgot the \u0022\u0022 around nuf)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs in the words of John Lennon, \u0022Control yourself, You\u0027ll spurt!\u0022 Just kiddin\u0027, you are so right in your understanding of this game! BTW, no nerve struck! I only wish more players in this community had your attitude.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-05-11T05:07:47Z","Content":"\n\u003Cp\u003E1. SubAssemblies. Nothing is more frustrating than making a sub-assembly for use later, only to discover that the sub has only *one* attachment point - inevitably in a useless place. This is because the sim seems to allocate only one attachment point for a sub, and this is always the last point in the direction of the initial build item (a pod). The fix for this is to make sub-assemblies with robotic units, and during the build move the rest of the assembly around and attach it to the robotic core item, and then save each sub-assembly based on it\u0027s specific attachment point. This all seems a bit too much work just to have a sub-assembly that can be attached as though it were a collection of parts put together normally. Ideally it should be possible for most spacecraft to be put together entirely from interchangeable sub-assemblies. The interface doesn\u0027t make this particularly easy. \u003C/p\u003E\u003Cp\u003E2. Lack of information regarding the prograde or retrograde orbit angle, and ejection angle, which makes interplanetary ejection burns more of a guess than they should be. We realize that Squad leaves this info out deliberately, but a bit more information maybe as part of an information display toggle (some players use it, some won\u0027t, or perhaps making such info available as a tech tree progression).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-11T05:10:17Z\u0022 title=\u002205/11/2014 05:10  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 11, 2014\u003C/time\u003E by LTrotsky\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kruleworld","CreatedById":69697,"CreatedDateTime":"2014-05-12T00:13:05Z","Content":"\n\u003Cp\u003EMy pet peeve with current KSP is the wobbly trajectory paths.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/c-CwgWX2PCA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-05-12T05:19:11Z","Content":"\n\u003Cp\u003ETransferring fuel. One (click-ALT-click) Tank (click-ALT-click) At (click-ALT-click) A (click-ALT-click) Time (click-ALT-click) For (click-ALT-click) Every (click-ALT-click) Tank (click-ALT-click).\u003C/p\u003E\u003Cp\u003EI know there are mods for this... but cmon! Stock already!\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-05-12T18:12:51Z","Content":"\n\u003Cp\u003EWhen a kerbal is bugging.\u003C/p\u003E\u003Cp\u003EWhat happen is that the said verbal just fall on the ground and stay motionless(like if no one controlled it), he doesn\u0027t have any expression and his body doesn\u0027t move(even if he\u0027s hit by a rocket).\u003C/p\u003E\u003Cp\u003EWhen it happen, I usually kill him(by using hyperdit) and edit the persistence file to bring him back to life.\u003C/p\u003E\u003Cp\u003EAlso, when the game tell you \u0022after leaving the SOI of this moon/planet you\u0027ll have a periapsis of [insert periapsis altitude here]\u0022 and the periapsis widely when I leave the SOI.\u003C/p\u003E\u003Cp\u003EIt happen a lot to me when I return from the mÃƒÂ¼n in a direct return trajectory:the game say I\u0027ll have a periapsis of 20km but it\u0027s actually 8km(or anything else) once I leave the SOI of the man.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-05-12T18:57:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EHow is this not a thing yet? Have you suggested it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tried to but I was madly mashing buttons to get out of time warp and missed the transfer window.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-05-12T20:45:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022goldenpeach\u0022 data-cite=\u0022goldenpeach\u0022\u003E\u003Cdiv\u003EWhen a kerbal is bugging.\u003Cp\u003EWhat happen is that the said verbal just fall on the ground and stay motionless(like if no one controlled it), he doesn\u0027t have any expression and his body doesn\u0027t move(even if he\u0027s hit by a rocket).\u003C/p\u003E\u003Cp\u003EWhen it happen, I usually kill him(by using hyperdit) and edit the persistence file to bring him back to life.\u003C/p\u003E\u003Cp\u003EAlso, when the game tell you \u0022after leaving the SOI of this moon/planet you\u0027ll have a periapsis of [insert periapsis altitude here]\u0022 and the periapsis widely when I leave the SOI.\u003C/p\u003E\u003Cp\u003EIt happen a lot to me when I return from the mÃƒÂ¼n in a direct return trajectory:the game say I\u0027ll have a periapsis of 20km but it\u0027s actually 8km(or anything else) once I leave the SOI of the man.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat EVA bug is fixed in the latest version of the game, consider updating.\u003C/p\u003E\n"}]}