{"TopicId":69688,"ForumId":55,"TopicTitle":"VAB Improvements","CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2014-04-17T22:04:35Z","PageNum":1,"Articles":[{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2014-04-17T22:04:35Z","Content":"\n\u003Cp\u003ESub-assemblies only seem to have a single designated attachment node. It would be useful to either be able to have more than one attaching node, or be able to designate the specific one you want when dropping in in the sub-assembly menu.\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-04-17T23:25:35Z","Content":"\n\u003Cp\u003EThe first part or the \u0022parent\u0022 part is the part all other parts are attached to. This has been recommended before and i doubt this could be done easily. \u003C/p\u003E\u003Cp\u003ETo fix this would take a lot of work with the foundation on how the game handles ships. Along with adding some sort of function to change the part without breaking the ship. \u003C/p\u003E\u003Cp\u003EYou can easily get around this by thinking ahead with your designs. It would make more sense if there were a warning if all attachment nodes were covered in your sub-assembly when you drop it in. This would be easier to check and easier to implement than a full fledged parent part changer.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-04-17T23:58:57Z","Content":"\n\u003Cp\u003EWell, speaking purely theoretically, this should be possible, since the game \u003Cem\u003Edoes\u003C/em\u003E this (I think?) in some manner already. See, you could change everything completely, or write a bit of code that would allow you pick which node you want to use (or just have all of them available), then re-map the connections on the subassembly from there, effectively changing the root node. Theoretically you could even make it surface attach. The game already kind of does this for docking -- pretty much every single instance of docking combines the crafts \u003Cem\u003Efrom\u003C/em\u003E\u003Cem\u003E the docking port nodes\u003C/em\u003E, which are almost never the actual root nodes of the crafts. One craft keeps the root node, the other seems to re-do all its nodes so that it doesn\u0027t have a root node -- the closest it has to a root node at that point seems to be the docking port itself. When it undocks, the game seems to remember which part was the original root node of the craft, and seems to remap the connections based on that.\u003C/p\u003E\u003Cp\u003EThis \u003Cem\u003Ecould\u003C/em\u003E be possible, depending on how the coding is done, but will almost certainly require some additional coding to get working in the constructions scenes... Still. A useful feature, nonetheless, and (at least from what I can see) it seems to be possible.\u003C/p\u003E\n"}]}