{"TopicId":69798,"ForumId":32,"TopicTitle":"Why I play Kebal Space Program.","CreatedByName":"WhackyTech","CreatedById":107566,"CreatedDateTime":"2014-04-19T00:51:21Z","PageNum":1,"Articles":[{"CreatedByName":"WhackyTech","CreatedById":107566,"CreatedDateTime":"2014-04-19T00:51:21Z","Content":"\n\u003Cp\u003EI think for me, the main reason I play this game is because it teaches you that failure can be a good thing. In other words, we don\u0027t really fail. It\u0027s learning from our mistakes that make us better. \u003C/p\u003E\u003Cp\u003EI tried to land on the Mun today, and didn\u0027t realize how weak the gravity was. I ended up on a hill and I wouldn\u0027t stop sliding. I know now I need a flat landing spot and a wider base.\u003C/p\u003E\n"},{"CreatedByName":"Jas1126","CreatedById":99760,"CreatedDateTime":"2014-04-19T01:12:31Z","Content":"\n\u003Cp\u003EI started playing Kerbal Space Program simply because I can land on planets. Ever since I started playing games that dealt with space (since the early 90\u0027s) I\u0027ve always looked at the planets and wished that I could land on them. I\u0027ve crashed (or attempted to) into every planet that a space game would put in front of me. Just to see if I could interact with it in some way. My favorite was when I phased right through Earth in X:3 Albion Prelude. Turns out Earth is hollow; who knew!? This game finally answered my decades long wish.\u003C/p\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2014-04-19T01:17:54Z","Content":"\n\u003Cp\u003EPersonally I play because it\u0027s the first Space Sim that I stumbled across that allows me to do it all. I can build what I want and mess around on the planet, head into space, land on other planets and build on them. If there was anything that allowed us to do all of this before in one game, I never found it.\u003C/p\u003E\n"},{"CreatedByName":"AustralianFries","CreatedById":57660,"CreatedDateTime":"2014-04-19T04:25:11Z","Content":"\n\u003Cp\u003EWhy do I play Kerbal Space Program? Three words:\u003C/p\u003E\u003Cp\u003EIt\u0027s freakin\u0027 awesome.\u003C/p\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2014-04-19T04:34:12Z","Content":"\n\u003Cp\u003EI started to play this wonderful game after watching some of its posibilities making me want to try some of them, i was bored from my old life style that used to be from playing FPS all the day. This game has changed my way to see things, and it teached me more than what i could expect. i wish i never forget this game because im used to forget things often.\u003C/p\u003E\u003Cp\u003ENow i would like to see a man from my generation on the moon before i die.\u003C/p\u003E\n"},{"CreatedByName":"pslytely psycho","CreatedById":62775,"CreatedDateTime":"2014-04-19T07:31:42Z","Content":"\n\u003Cp\u003E\u0026lt;iframe class=\u0022imgur-album\u0022 width=\u0022100%\u0022 height=\u0022550\u0022 frameborder=\u00220\u0022 src=\u0022http://imgur.com/a/39exA/embed\u0022\u0026gt;\u0026lt;/iframe\u0026gt;\u003C/p\u003E\u003Cp\u003EFirst test of my Extreme Heavy Lift System and prototype Deep Explorer (sans satellite and lander bays) for my Joolian System Grand tour.....\u003C/p\u003E\u003Cp\u003E\u0027Splosions are the sprinkles on your ice cream sundae.....Jeb \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2014-04-19T19:12:32Z","Content":"\n\u003Cp\u003EWhen you discover how many rockets the USAF and then NASA went through before they felt ready to send up primates, then this definitely becomes apparent. Apollo 13 alone taught us how to fit a square peg in a round hole.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-04-19T19:21:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jas1126\u0022 data-cite=\u0022Jas1126\u0022\u003E\u003Cdiv\u003EI started playing Kerbal Space Program simply because I can land on planets. Ever since I started playing games that dealt with space (since the early 90\u0027s) I\u0027ve always looked at the planets and wished that I could land on them. I\u0027ve crashed (or attempted to) into every planet that a space game would put in front of me. Just to see if I could interact with it in some way. My favorite was when I phased right through Earth in X:3 Albion Prelude. Turns out Earth is hollow; who knew!? This game finally answered my decades long wish.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait, you actually flew to a planet in that game?\u003C/p\u003E\u003Cp\u003EThat takes forever, when I tried once I just figured it was a skybox, after I didn\u0027t get any closer and gave up\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2014-04-19T19:30:07Z","Content":"\n\u003Cp\u003EWhy I play Kerbal Space Program:\u003C/p\u003E\u003Cp\u003E[1812overture]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/xKgSl\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[/1812overture]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-19T19:32:40Z\u0022 title=\u002204/19/2014 07:32  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 19, 2014\u003C/time\u003E by Whackjob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-04-19T19:39:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AustralianFries\u0022 data-cite=\u0022AustralianFries\u0022\u003E\u003Cdiv\u003EWhy do I play Kerbal Space Program? Three words:\u003Cp\u003EIt\u0027s freakin\u0027 awesome.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. Someone make this their siggy!\u003C/p\u003E\n"},{"CreatedByName":"Vohjiin","CreatedById":71047,"CreatedDateTime":"2014-04-19T20:08:02Z","Content":"\n\u003Cp\u003EI play Kerbal Space Program for the main reason it\u0027s the only Space Sim game like it. I have played many games that attempt a space simulation, everything from Orbiter to more SciFi stuff but nothing had what I wanted. Nothing had the ability to really let me build a rocket, launch it and land on more then just the moon. There was a few games that allowed you to do this but they either were focused on the landing part or building the rocket part, you skipped entire sections/features of the game to where they was fun but not what I was hoping for. I even went so far myself to write an entire Game Design document for this idea alone, a game where you picked parts put them together to build your rocket, your pobes, everything. All it did was sit there and gather more idea\u0027s as at the time I hadn\u0027t the capability to bring it to life.\u003C/p\u003E\u003Cp\u003EThen I find Kerbal Space Program.... that not only gave me everything I would have wanted... and honestly this is why KSP is so popular it appeals to all area\u0027s of Space travel and provides game play for that. Most importantly it presented it all in this wonderful and humorous universe that has its brilliant serious side but enough fun and laughter to make it all just feel so good to play.\u003C/p\u003E\u003Cp\u003EI play KSP because it lets me do the things I just can not IRL, it lets me make my own missions, my own stories. Lets me play as a Space program manager, a builder, an explorer of other worlds. It honestly gives me a sense of wonder and excitement when I can get my weird contraptions to land on other worlds and doesn\u0027t slap my wrists for the obvious denial of gravity and physical laws. Though I\u0027m sure the amount of times I have face palmed over my mistakes more then made up for it.\u003C/p\u003E\u003Cp\u003EI play KSP..because it\u0027s KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"pauix","CreatedById":11977,"CreatedDateTime":"2014-04-19T20:16:58Z","Content":"\n\u003Cp\u003EThe best part of the game is that it does not punish you for not doing things \u003Cem\u003Ethe right way\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Jas1126","CreatedById":99760,"CreatedDateTime":"2014-04-19T20:31:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EWait, you actually flew to a planet in that game?\u003Cp\u003EThat takes forever, when I tried once I just figured it was a skybox, after I didn\u0027t get any closer and gave up\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt wasn\u0027t exactly difficult when I can just run the game in the background with time warp enabled and the fastest ship in the game. XD Actually, the hardest part was just getting to Sol. The pirates are relentless.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-19T21:24:41Z","Content":"\n\u003Cp\u003EI play KSP because if we don\u0027t sacrifice enough Kerbals to the Kraken, the Kraken will have to cross over into our universe to fill its belly. There is thus nothing more important in life, no higher calling, than playing KSP. The future itself is literally at stake.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-04-19T23:54:09Z","Content":"\n\u003Cp\u003EI heard about KSP from NerdCubed\u0027s video on it. I didn\u0027t think KSP was all that interesting, and I thought that it was just another \u0022build your own rocket and fly it\u0022 game. But then I discovered HOCgaming from his \u0022Artificial Gravity\u0022 series and, upon finding out about orbital construction and docking, I instantly fell madly in love with KSP, and only a few days later did I buy it.\u003C/p\u003E\u003Cp\u003EBuy \u003Cem\u003Ewhy\u003C/em\u003E I play KSP is a whole different story. First of all, the physics in this game are utterly incredible. It is awesome to learn about real-world physics and then be able to apply that knowledge inside the game. Also, who doesn\u0027t love this community and especially the developers? Seriously, the entire KSP community isn\u0027t here because \u0022we all play the same game,\u0022 it\u0027s about our hardcore love for physics, rockets and explosions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-19T23:57:23Z\u0022 title=\u002204/19/2014 11:57  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 19, 2014\u003C/time\u003E by Thomas988\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-20T00:25:46Z","Content":"\n\u003Cp\u003EBecause it teaches me stuff I never thought I\u0027d be able to learn, because it\u0027s fun, amusing at times, frustrating at others, but overcoming those obstacles gives such a huge feeling of satisfaction.\u003C/p\u003E\u003Cp\u003EAlso, it can be damned pretty...\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/OQbo7\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EGranted, most of what makes it pretty is mods, but without the game, there wouldn\u0027t be any mods, so.. you know \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-20T00:28:43Z\u0022 title=\u002204/20/2014 12:28  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 20, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"}]}