{"TopicId":69894,"ForumId":44,"TopicTitle":"Next Russian manned craft","CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-04-19T22:22:21Z","PageNum":1,"Articles":[{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-04-19T22:22:21Z","Content":"\n\u003Cp\u003EOk so I thought we should discuss the next russian manned spacecraft (if there is going to be one). When will it appear, what will it be, will it replace the good soyuz?\u003C/p\u003E\u003Cp\u003ECurrently they are working on the PPTS (terrible name, I am disappointed Russia), personally I do not think it will succeed, possible flight but die out like the other craft that have been worked on before (Kliper, csts, tks, zarya).\u003C/p\u003E\u003Cp\u003EThey also have interest in reviving maks, they also seem very serious from a document I have read, however it\u0027s unlikely to go anywhere.\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2014-04-19T22:45:36Z","Content":"\n\u003Cp\u003EI\u0027m hoping they do something with the PPTS. Soyuz is incredible, but it\u0027s aging.\u003C/p\u003E\u003Cp\u003EAlso, wow, that\u0027s a lot of run-on sentences.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-04-19T22:49:38Z","Content":"\n\u003Cp\u003EIt\u0027s entirely possible they will keep both, soyuz for leo and ppts for moon, mars and a apollo-soyuz esqe test program with an orion-ppts.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-04-19T23:01:28Z","Content":"\n\u003Cp\u003EIf they have any hopes of a moon landing in the near future, they should get working on that new PPTS. Soyuz doesn\u0027t really work for anything else than LEO, and taking wings further than that isn\u0027t that useful. I think they should do something like NASA\u0027s \u003Ca href=\u0022https://en.wikipedia.org/wiki/Commercial_Orbital_Transportation_Services\u0022 rel=\u0022external nofollow\u0022\u003ECOTS\u003C/a\u003E and focus on \u0022deep\u0022 space exploration.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-04-19T23:49:17Z","Content":"\n\u003Cp\u003EThey could always return the LOK spacecraft.\u003C/p\u003E\n"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2014-04-20T13:25:29Z","Content":"\n\u003Cp\u003EI\u0027d like to see them stop their bickers and jointly develop one with *all* space faring nations.... why not combine the best of both Russia and Nasa, and have technical help and components supplied by China, India and Japan.\u003C/p\u003E\u003Cp\u003EI\u0027d also like the Russians to go ahead with their idea of a reusable space ship, which would never land on Earth but be restocked and refuelled while in Earth orbit, to visit other planets and moons... such an idea is highly overdue.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-04-20T13:55:31Z","Content":"\n\u003Cp\u003Ewhy not? Because space programs are by their very nature political. And there\u0027s no way the Russians are going to let any degenerated country like the US join their space program, not when they\u0027re on a collision course towards an armed confrontation.\u003C/p\u003E\u003Cp\u003EToday Ukraine, tomorrow Latvia, next week Alaska!\u003C/p\u003E\u003Cp\u003EPutin\u0027s on a roll, why stop when you\u0027re ahead? And why cooperate with the US when the US don\u0027t even have a space program worth mentioning? A few companies shooting up communications satellites and garbage cans for the ISS, things the Russians can do very well without the Americans.\u003C/p\u003E\u003Cp\u003EAnd the Chinese are the same. \u003C/p\u003E\u003Cp\u003EMaybe SpaceX or Lockheed Martin can set up a joint venture with them, but not the US government.\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-04-20T15:46:54Z","Content":"\n\u003Cp\u003EActually russia and china are very open to cooperation, it\u0027s the US who have to much pride to work with others.\u003C/p\u003E\u003Cp\u003EAlso they tried to cooperate on a ship, the CSTS, it turned out a mess.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-04-20T17:51:23Z","Content":"\n\u003Cp\u003EMaybe, but Russia is too busy trying to spark world war 3, so...\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2014-04-20T18:30:57Z","Content":"\n\u003Cp\u003ENot really, if the entire cold war didnt start ww3 then annexing a state won\u0027t cause it.\u003C/p\u003E\n"},{"CreatedByName":"comicbstudeo","CreatedById":29256,"CreatedDateTime":"2014-04-21T08:35:09Z","Content":"\n\u003Cp\u003Ewell the ISS went well and that was joint (hence the name)\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-04-21T09:10:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003EAnd why cooperate with the US when the US don\u0027t even have a space program worth mentioning? A few companies shooting up communications satellites and garbage cans for the ISS, things the Russians can do very well without the Americans.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERoscomos\u0027 only capability, which NASA doesn\u0027t have, is that they can send people into LEO. So they have a dependable manned spacecraft and rocket, in few years SpaceX will have a more capable spacecraft(and it only took them less than 15 years).\u003C/p\u003E\u003Cp\u003ERoscosmos is very lacking in space science, their last successful missions was more than 25 years ago. The next mission is Exo Mars together with ESA, but I hope that works out better than their last Phobos Mission attempt.\u003C/p\u003E\u003Cp\u003EIt didn\u0027t even leave Earth orbit because of last minute problems and hasty fixes when they actually should have scrubbed.\u003C/p\u003E\n"},{"CreatedByName":"@:-)","CreatedById":109211,"CreatedDateTime":"2014-04-21T10:53:17Z","Content":"\n\u003Cp\u003EPTK-NP is not the name of the ship, the way the good news about Angara gone unnoticed.\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-04-21T19:01:11Z","Content":"\n\u003Cp\u003ERussia also tried to collaborate with the EU, and the EU cancelled it.\u003C/p\u003E\n"},{"CreatedByName":"TheExplosionist","CreatedById":90525,"CreatedDateTime":"2014-04-21T19:11:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003ERussia also tried to collaborate with the EU, and the EU cancelled it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe EU has to tow the yank line.\u003C/p\u003E\u003Cp\u003EI continue to find it highly amusing the yanks have no manned space craft of their own since the space shuttle retired.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-04-22T01:02:30Z","Content":"\n\u003Cp\u003EHey guys, let\u0027s keep this argument from devolving into an ethno-centric political squabble, in the best interest of the forums.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-04-22T06:33:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheExplosionist\u0022 data-cite=\u0022TheExplosionist\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI continue to find it highly amusing the yanks have no manned space craft of their own since the space shuttle retired.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI fail to see what\u0027s amusing about it.\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2014-04-22T19:00:36Z","Content":"\n\u003Cp\u003EReally one of the bigger barriers to NASA cooperation with someone like Russia or China is the fact that a huge amount of space technologies are export controlled. NASA is watched a bit more closely than the days of the Russian Buran program, when the Russians literally asked NASA for design documents, and NASA (in the interest of getting more people into space) gave them just about everything they could. This wouldn\u0027t have necessarily been a problem, except that a lot of the technologies were certainly dual use. The ceramic tiles for instance were used on the Buran, but also to protect the hull of the Ekranoplane (not sure on spelling there) from the exhaust of launching its supersonic anti-carrier missiles.\u003C/p\u003E\n"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2014-04-26T11:23:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Ewhy not? Because space programs are by their very nature political. And there\u0027s no way the Russians are going to let any degenerated country like the US join their space program, not when they\u0027re on a collision course towards an armed confrontation.\u003Cp\u003EToday Ukraine, tomorrow Latvia, next week Alaska!\u003C/p\u003E\u003Cp\u003EPutin\u0027s on a roll, why stop when you\u0027re ahead? And why cooperate with the US when the US don\u0027t even have a space program worth mentioning? A few companies shooting up communications satellites and garbage cans for the ISS, things the Russians can do very well without the Americans.\u003C/p\u003E\u003Cp\u003EAnd the Chinese are the same. \u003C/p\u003E\u003Cp\u003EMaybe SpaceX or Lockheed Martin can set up a joint venture with them, but not the US government.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot so, at the height of the cold war, Both the US and Soviet space programs actually worked together and cooperated. Take Venus for example, Russia consulted with Nasa so the Russian probe could be landed in a location both agencies wanted explored... the only sour note was the joint US - Soviet link up in space, neither side wanted to scrap their docking port for the others because it would be seen as a sign of weakness... somehow, I think THAT aspect by decided py politicians, in the end, Nasa sent up an adapter so both sides could keep their docking ports...\u003C/p\u003E\u003Cp\u003EAnd today... even with the crisis in the Ukraine, Russia is still keeping the I.S.S. supplied and providing a taxi service for American astronauts... I\u0027m betting that if the USA still had the Shuttle... they would tell the Russians where to go...\u003C/p\u003E\u003Cp\u003EBut... no shuttle, the US *needs* Russia so while they work out sanctions... the taxi service is one thing they cannot stop...\u003C/p\u003E\u003Cp\u003EOh, and NASA and the Soviets... ALWAYS... shared their data with each other.\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2014-04-26T11:51:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xenomorph555\u0022 data-cite=\u0022xenomorph555\u0022\u003E\u003Cdiv\u003EPPTS (terrible name, I am disappointed Russia)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s our long tradition to give names only when the craft is ready for mass production. Same with tanks or jets. They\u0027re often called \u0022object\u0022, \u0022product\u0022 or \u0022prospective something-something system/complex\u0022 while in design phase. PAK FA, for example, is also T-50, or \u0022product 701\u0022 and in production it will probably be Su-with-index-number \u0022Not Necessarily Scary/Badass Name\u0022. Same with PPTS - giving a name before it\u0027s finished is considered as kind of a bad omen, I guess.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003ERoscosmos is very lacking in space science, their last successful missions was more than 25 years ago.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGoogle Radioastron, for example. What Roscosmos is lacking in is PR, not science.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-26T11:55:51Z\u0022 title=\u002204/26/2014 11:55  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 26, 2014\u003C/time\u003E by J.Random\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-04-26T15:51:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022J.Random\u0022 data-cite=\u0022J.Random\u0022\u003E\u003Cdiv\u003EThat\u0027s our long tradition to give names only when the craft is ready for mass production. Same with tanks or jets. They\u0027re often called \u0022object\u0022, \u0022product\u0022 or \u0022prospective something-something system/complex\u0022 while in design phase. PAK FA, for example, is also T-50, or \u0022product 701\u0022 and in production it will probably be Su-with-index-number \u0022Not Necessarily Scary/Badass Name\u0022. Same with PPTS - giving a name before it\u0027s finished is considered as kind of a bad omen, I guess.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGiven the number of projects that are cancelled or shelved, it is a good idea to keep the good names for stuff that actually happens.\u003C/p\u003E\n"}]}