{"TopicId":69924,"ForumId":51,"TopicTitle":"Operation Reisen - An epic interplanetary quest","CreatedByName":"PatchouliKnowledge","CreatedById":98421,"CreatedDateTime":"2014-04-20T05:57:42Z","PageNum":1,"Articles":[{"CreatedByName":"PatchouliKnowledge","CreatedById":98421,"CreatedDateTime":"2014-04-20T05:57:42Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EDescription:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAfter having made considerable technological progress while exploring the cosmic skies (all stock nodes), the KSC started to search for new, epic ideas using the new-found capabilities of their technology. Months of pondering led the KSC staff to consider a high-cost, high-risk, long-term but high science yield interplanetary mission.\u003C/p\u003E\u003Cp\u003EIndeed, they thought building an interplanetary cruiser in orbit was such a grand idea that it would overlook all the problems of Kerbal engineering solutions. Furthermore, the KSC\u0027s budget and manpower was close to unlimited...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EGoals:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EVisit every planet (and maybe satellites, if I have the patience to do so) of the Kerbol system with a three-part, docked-in-orbit, monstruous spaceship\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMake use of in-situ ressource mining (using the Kethane mod)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EExplore bodies using landers docked on the main spaceship\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESCIENCE!\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EMods used:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EParts mods:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EKW Rocketry\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EProcedural fairings\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EB9 Aerospace\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInterstellar mod (to some extent)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHabitat pack (for the centrifugiums, mostly)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReal Chutes\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMisc. mods:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EFerram Aerospace Research\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMechJeb (to help me at times)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERasterProp monitor\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKerbal Attachment System\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EChapter 1: Budding starts\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/l0Ffutv.png\u0022 alt=\u0022l0Ffutv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter making yet another suppository joke, KSC\u0027s star pilot, Jebediah Kerman, praised the design of the new 3.5m launching system, who has been rumored to be engineered in collaboration with an alien space agency. Who would have guessed?\u003C/p\u003E\u003Cp\u003EThis yet-unnamed behemoth carried 20t of engineering glory into Low Kerbin Orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5E7Lpsj.png\u0022 alt=\u00225E7Lpsj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis was the core module of the spaceship, mostly comprising living and operational quarters. Although the center of the module was nothing exceptional, the sophistication of this craft was yet unmatched by anything ever made by kerbalkind.\u003C/p\u003E\u003Cp\u003EThese inflatable and rotating centrifugiums, which generate nearly 9.8 m/sÃ‚Â² of centripetal force, are the pinnacle in countering deleterious effects of extended periods of zero-g space travel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fgRn3EM.png\u0022 alt=\u0022fgRn3EM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBob deemed the quarters spacious and extremely comfortable. Notably, the large amount of storage for snacks and board games earned Bob\u0027s endorsement. One centrifugium can comfortably house 4 kerbals.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/diYjhDu.png\u0022 alt=\u0022diYjhDu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EShortly after the core module started orbiting, was launched a RCS tug, to facilitate the soon-to-come docking operations.\u003C/p\u003E\u003Cp\u003ESpeaking of which...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qdDvjkG.png\u0022 alt=\u0022qdDvjkG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe science module has rendez-vous\u0027d ! This slightly less impressive section has plenty of Mystery Goo Canisters, Science Jr. Bays, and generally scientific instruments, as well as a mobile laboratory. It also features a large array of solar panels, retractable radiators, a set of Kethane-related tools, namely a sensor, a tank and a converter...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2IyMmHc.png\u0022 alt=\u00222IyMmHc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E... as well as a small but often overcrowded observation cuppola for taking beautiful pictures to frame and hang in the KSC\u0027s recruitment club.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IL8Frwf.png\u0022 alt=\u0022IL8Frwf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter docking, the vessel was stress-tested with overdriving the reaction wheels. It still didn\u0027t show any significant flex. KSC engineers can be proud.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8fNFOLb.png\u0022 alt=\u00228fNFOLb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe third and last module... Engines, tanks, and \u0027maybe too much\u0027 RCS and reaction wheels. The WW2 (or Buddhist) inspired tank disposition was positively received by the KSC, as more is always better.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3es1rRX.png\u0022 alt=\u00223es1rRX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe spaceship has been completed. A quick consensus decided the ship would be named \u0022KSS Interplanetary Vanguard\u0022. However, engineers have detected a dangerous flex near the docking ports between the engine and core module. Additional EVA strutting will be necessary.\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-20T06:01:15Z\u0022 title=\u002204/20/2014 06:01  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 20, 2014\u003C/time\u003E by PatchouliKnowledge\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PatchouliKnowledge","CreatedById":98421,"CreatedDateTime":"2014-04-25T04:03:38Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EChapter 2: When everything fails... \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cG6mk9j.png\u0022 alt=\u0022cG6mk9j.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA SSTO, carrying a few KAS tools on board, such as EVA struts, was sent to deal with the wobbliness. After a bit of orbital maneuvering...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zF64xXW.png\u0022 alt=\u0022zF64xXW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AOrLOKH.png\u0022 alt=\u0022AOrLOKH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDonbree Kerman is finally in action, strutting the vessel the best he could!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/g2ThYce.png\u0022 alt=\u0022g2ThYce.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut sometimes even the best consolidation is not enough. Mission control requests to evacuate and recover the spaceship for further investigation and retrofitting.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NcWz56L.png\u0022 alt=\u0022NcWz56L.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe infamous Kerbal Aerospace Discorde was sent to rescue the crew. Let\u0027s see how it performs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tmWWNiH.png\u0022 alt=\u0022tmWWNiH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe aircraft has major stability problems. The fact that one of the atmospheric turbojets blew up while exiting the atmosphere did not help in reassuring the crew in the decommissioned spaceship. Mission control recommends everyone to \u0022Keep calm and carry on\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jzZKraV.png\u0022 alt=\u0022jzZKraV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWelcome on board.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/V01cy0l.png\u0022 alt=\u0022V01cy0l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter spinning uncontrollably in the upper atmosphere of Kerbin, the Discorde\u0027s pilot, Seanski Kerman, manages to roughly point the supersonic aircraft in the direction of the airflow. Despite being hazardous, mission control deemed the reentry \u0022Adequately meaningful\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/svgygZO.png\u0022 alt=\u0022svgygZO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WLbxqtP.png\u0022 alt=\u0022WLbxqtP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe dysfunctional gears forced Seanski to try and perform a sea landing, ripping most of the engines and part of the wings. But the crew is \u003Cstrong\u003Esafe and secure.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4J7UdUu.png\u0022 alt=\u00224J7UdUu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OZaupoc.png\u0022 alt=\u0022OZaupoc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEngineers at KSC had a much saner design for the next version of the spaceship and decided to ditch the engine module altogether.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lVgsZ18.png\u0022 alt=\u0022lVgsZ18.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo recover the other modules, a large probe fitted with parachutes and RCS was sent to dock with them.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mrypBU5.png\u0022 alt=\u0022mrypBU5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uqX6wUJ.png\u0022 alt=\u0022uqX6wUJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERecovery of the core module was, indeed, successful. Some parts detached while falling slowly in the water, but the module is mostly intact.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D6fadZl.png\u0022 alt=\u0022D6fadZl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThose struts are formidable landing legs.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-25T15:10:34Z","Content":"\n\u003Cp\u003EThose are some incredibly monstrous ships. Quite impressive even if they didn\u0027t quite work.\u003C/p\u003E\u003Cp\u003EOn the wobble issue, did you try locking the gimbals on the engines? Gimballing engines are almost guaranteed to cause upstream docking ports to wobble, and the further out to the side away from the centerline the engine is, the more wobble its gimbal produces.\u003C/p\u003E\n"},{"CreatedByName":"PatchouliKnowledge","CreatedById":98421,"CreatedDateTime":"2014-05-30T11:59:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EOn the wobble issue, did you try locking the gimbals on the engines?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it wasn\u0027t enough though. The 0.23.5 update changed joint behavior radically, KJR had been nerfed, thus I had to innovate. I built starshaped structures of cubic octogonal struts on each main module, with preplaced KAS struts, and then link all those. It doesn\u0027t wobble an inch, though it is rather slow to rotate. I will post the pics and the story this weekend hopefully. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}