{"TopicId":69932,"ForumId":16,"TopicTitle":"Calculating most efficient ascent profile by hand.","CreatedByName":"OxalysResourceConsortium","CreatedById":106988,"CreatedDateTime":"2014-04-20T06:54:04Z","PageNum":1,"Articles":[{"CreatedByName":"OxalysResourceConsortium","CreatedById":106988,"CreatedDateTime":"2014-04-20T06:54:04Z","Content":"\n\u003Cp\u003EDisclaimer: I apologize if I posted this in the wrong section mods, if you could, please move it to the correct one.\u003C/p\u003E\u003Cp\u003EI\u0027m looking to use kOS to write scripts to automate my craft. I\u0027m an engineer not a pilot Jim!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E I love designing rockets and whatnot but hate actually piloting them, and feel like using MechJeb is kinda boring, especially given that this could be a chance for me to learn useful skills to help me further my education while having fun doing it. \u003C/p\u003E\u003Cp\u003EI flunked out of Calculus III so I\u0027ll need to brush up on my maths but I feel like if there is anything I need to learn maths-wise I can just watch KhanAcademy videos or something similar and teach myself. I still have some old Calculus textbooks with practice problems I can work with. \u003C/p\u003E\u003Cp\u003EWhat I want to learn to do first is how to calculate the ideal ascent profile by hand. I\u0027m sort of debating with myself whether I should install F.A.R. or not but I\u0027m thinking not as it would just eat up more of my RAM than I\u0027m comfortable with. Right now I\u0027m not going for a 100% realistic career. Once I feel more comfortable that I know what I\u0027m doing and that I\u0027m up to the challenge I might go for the realism overhaul, but not yet. \u003C/p\u003E\u003Cp\u003EI know that using kOS I can probably guesstimate the best ascent profile by trying out different ascent profiles for every new rocket design, but I just don\u0027t have that kind of time. Plus, I figure I probably have the smarts to learn the physics and math needed. This is probably a good way to motivate myself to finish the education I initially completely wasted being a lazy college student so any help would be appreciated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-20T06:58:54Z","Content":"\n\u003Cp\u003EI don\u0027t imagine FAR uses much memory at all. It\u0027s not like it adds a ton of models and textures like some other mods.\u003C/p\u003E\n"},{"CreatedByName":"OxalysResourceConsortium","CreatedById":106988,"CreatedDateTime":"2014-04-20T07:03:52Z","Content":"\n\u003Cp\u003EThing is with stock aerodynamics there all sorts of neat tools and charts and guides and delta-V maps available for my disposal. Given the challenge I\u0027m setting myself up for I have enough to deal with as it is without adding in more workload, though I may change my mind later on if I feel that I\u0027m not being challenged enough.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2014-04-20T07:07:40Z","Content":"\n\u003Cp\u003EI think you absolutely should install FAR! It makes KSP a lot more realistic, and tends to make ascent paths simpler. In addition, it has a lot of awesome readouts that you will probably find useful.\u003C/p\u003E\u003Cp\u003EThe optimal ascent is the one which reaches the target orbit with the least propellant, so another big factor in what your answer comes to is whether or not you install a mod that fixes KSP\u0027s totally unrealistic fuel flow rate based on ISP. in a real rocket, I believe, fuel flow rate is constant but thrust changes. The reason anything is changing at all is that the air pressure is dropping and so the rocket is getting more efficient as it goes up. I don\u0027t know what the current mod for that is though.\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2014-04-20T07:10:55Z","Content":"\n\u003Cp\u003EWell, the thing is that, quite honestly, there isn\u0027t necessarily a single correct answer here. As far as I can tell it all depends on things like the changing TWR and staging and things like that.\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2014-04-20T07:12:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nhnifong\u0022 data-cite=\u0022nhnifong\u0022\u003E\u003Cdiv\u003EI think you absolutely should install FAR! It makes KSP a lot more realistic, and tends to make ascent paths simpler. In addition, it has a lot of awesome readouts that you will probably find useful.\u003Cp\u003EThe optimal ascent is the one which reaches the target orbit with the least propellant, so another big factor in what your answer comes to is whether or not you install a mod that fixes KSP\u0027s totally unrealistic fuel flow rate based on ISP. in a real rocket, I believe, fuel flow rate is constant but thrust changes. The reason anything is changing at all is that the air pressure is dropping and so the rocket is getting more efficient as it goes up. I don\u0027t know what the current mod for that is though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUse ferrams ISP difficulty scaler mod it allows you to choose either stock or ferram based ISPs and a number of other things.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-20T07:14:34Z\u0022 title=\u002204/20/2014 07:14  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 20, 2014\u003C/time\u003E by Rokker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jimbimbibble","CreatedById":77859,"CreatedDateTime":"2014-04-20T07:13:45Z","Content":"\n\u003Cp\u003EThe trouble is that there are just too many variables to get an explicit solution. However, if you make a few assumptions, you might be able to do the calculation. You can assume that the throttle stays at 100% and that you fly a perfect gravity turn (research gravity turns). You would also have to make some assumptions about the aerodynamics (many more assumptions with FAR.) Then, you would varry the initial angle that you launch at and iterate until you find the best one. You will probably need to know about differential equations to write this program. Good luck.\u003C/p\u003E\n"},{"CreatedByName":"Rokker","CreatedById":15359,"CreatedDateTime":"2014-04-20T07:17:20Z","Content":"\n\u003Cp\u003EWell with FAR, you can get a decent number of rockets that follow a relatively efficient path by themselves with SAS off due to the angle between the blah and the somethingorother vectors, cant quite remember at the moment.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-20T07:21:14Z\u0022 title=\u002204/20/2014 07:21  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 20, 2014\u003C/time\u003E by Rokker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-20T07:22:30Z","Content":"\n\u003Cp\u003EEither way, the decision to use FAR or not merely changes the problem domain for the question you\u0027re asking. There exists an optimal launch profile for a given rocket in stock, and the same rocket would have a different one in FAR\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2014-04-20T11:10:14Z","Content":"\n\u003Cp\u003ECalculating it by hand is not easy.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t use FAR, then you can find good information in these threads:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/46194\u0022 rel=\u0022external nofollow\u0022\u003EI need someone help me do some math for launch optimization\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58531\u0022 rel=\u0022external nofollow\u0022\u003EFinding the best ascent path for rockets\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/39196\u0022 rel=\u0022external nofollow\u0022\u003ELaunch Efficiency Exercise\u003C/a\u003E V0.21.1\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAscent Komputron (Standalone Software, not open-source, did not try it myself)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-20T18:12:19Z\u0022 title=\u002204/20/2014 06:12  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 20, 2014\u003C/time\u003E by mhoram\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-04-20T11:33:40Z","Content":"\n\u003Cp\u003EYou want to formulate a general procedure, for manually calculating optimal ascent profile for a generic spacecraft?\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EWot, are you tasked with inventing a new Labour for Hercules?\u003C/p\u003E\u003Cp\u003EThere are SO many factors, not least of which sillyness such as \u003C/p\u003E\u003Cp\u003E\u0022this rocket design *must* fly vertically until stage 1 drops, else the dropped stages will contact and RUD my ship\u0022\u003C/p\u003E\u003Cp\u003EActually, about 7/8 of my designs that mass over 2000 tons fall under this rule..\u003C/p\u003E\n"},{"CreatedByName":"Cakeofruit","CreatedById":73238,"CreatedDateTime":"2014-04-26T07:28:38Z","Content":"\n\u003Cp\u003Ei just started to us kos too and the idea i got to get the best ascent is a kos script that make a log file to every launch to track data ! \u003C/p\u003E\u003Cp\u003EWith those data it will change some correction values and see if the ascent is better. \u003C/p\u003E\u003Cp\u003EI want to write a launch program to LKO for a shuttle under ferram to get my playload without any intervention just plug the altitude.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-04-26T12:31:29Z","Content":"\n\u003Cp\u003ECalculating an efficient ascent profile by hand is apparently extremely complex:\u003C/p\u003E\u003Cp\u003EI need someone help me do some math for launch optimization \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/46194-I-need-someone-help-me-do-some-math-for-launch-optimization?highlight=ascent\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/46194-I-need-someone-help-me-do-some-math-for-launch-optimization?highlight=ascent\u003C/a\u003E\u003C/p\u003E\n"}]}