{"TopicId":70022,"ForumId":51,"TopicTitle":"Real Challenge - Off-world operations in real solar system","CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-04-21T13:29:20Z","PageNum":1,"Articles":[{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-04-21T13:29:20Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EOops - Off-world operations\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis confidence-inspiring name belongs to a brand new branch of our space agency. Our mission is to explore the solar system and establish Oops as an operational unit that can be trusted with some actual missions in the future. \u003C/p\u003E\u003Cp\u003EWhile waiting for contracts to be implemented, I\u0027m exploring the career mode with the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59207\u0022 rel=\u0022external nofollow\u0022\u003ERealism Overhaul\u003C/a\u003E mod collection. I\u0027m using all of the listed required mods plus Medieval Nerd\u0027s Realistic Tech Progression Lite tech tree, procedural fairings, ECLSS life support mod and the amazing KW rocketry which I just love. For the engine pack I chose NathanKell\u0027s Reaching for the stars-pack. Also I\u0027m using the Environmental Visual Enhancements by rbray89.\u003C/p\u003E\u003Cp\u003EI\u0027m by far not a great player so feel free to laugh at any silly mistakes I might do \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EOnwards!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWe need to start from somewhere of course.\u003C/p\u003E\u003Cp\u003EBill was kind enough to order us a Space-goer Starter Kit with some basic parts to get our program started. Our first big goal is obviously to get some kind of a rocket-like thingy into a stable orbit. First step on that road is to get some kind of thingy to lift off the ground and go in the general direction of space. There\u0027s not much choice in probe cores, so we\u0027ll just start with this thing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vgUykso.png\u0022 alt=\u0022vgUykso.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt has integrated experiments in it, obviously the science folks want to gather some air and do some reading while in the upper atmosphere. Easy-peasy. I can gather air and read while lounging around in a hammock, how hard can it be when we have an entire rocket dedicated just for that?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OL1ZndW.png\u0022 alt=\u0022OL1ZndW.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QdtHQfu.png\u0022 alt=\u0022QdtHQfu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUh-oh. OK well. We have a rocket here, but all these options are a bit too baffling. I just pick kerosene, because it sounds manly and rocket~y. You can\u0027t go wrong with kerosene. Lots and lots of kerosene. We need to go high so the biggest and strongest engine is obviously selected. Let\u0027s add some more kerosene on it, just to be sure. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/JkNtWI3.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/JkNtWI3l.png\u0022 alt=\u0022JkNtWI3l.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis beauty is called \u0022Honeybee I\u0022 and it will go high and fast, I\u0027m sure of it. They say that according to the laws of physics bees aren\u0027t supposed to be able to fly, but still they do, so the name is appropriate. \u003C/p\u003E\u003Cp\u003ELiftoff! It\u0027s a great day for Oops.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KxZy04q.png\u0022 alt=\u0022KxZy04q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMission completed, I\u0027d say! We\u0027re now flying high and doing some sweet science.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ELctBAU.png\u0022 alt=\u0022ELctBAU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUmm... was it supposed to go this high?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LYBW8sZ.png\u0022 alt=\u0022LYBW8sZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOK this can\u0027t right. Mission control? Bob? Were we supposed to land this thing somehow? Yeah of course! I have the parachutes right here, I\u0027m not stupid! What? Oh...\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rcddiZC.png\u0022 alt=\u0022rcddiZC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAhem, we had a bit too much kerosene it seems, so we\u0027ll need to change the rocket size a bit. And \u0022adjust the placement of parachutes.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-04-22T04:21:05Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EFaster, higher\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EHoneybee II\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ENext attempt to reach the upper atmosphere and come back. Honeybee II is smaller as I\u0027m aiming for 100 km apoapsis, not 1000 km as happened with first rocket. This makes it faster and it has a silly TWR, but we\u0027ll just throttle down a bit. Jebediah was snickering at this idea, I have no idea why. This time we\u0027re also using parachutes to help with the landing.\u003C/p\u003E\u003Cp\u003EAirborne!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YUr1xLp.png\u0022 alt=\u0022YUr1xLp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWe\u0027re going fast, throttle down guys.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/e8LM0ob.png\u0022 alt=\u0022e8LM0ob.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EErm, guys... Throttle? Any day now if you will.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y6OowUD.png\u0022 alt=\u0022y6OowUD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOK so while we\u0027re coasting to apoapsis and redoing our previous science experiments, it dawned on me that there\u0027s really no way to throttle down these engines. There\u0027s only on/off switch even with liquid boosters. Also, you get only one ignition so essentially liquid engines are much like solids, except they can be turned off at will. There\u0027s a part with extra ignitors though, I\u0027ll have to study how it works at some point.\u003C/p\u003E\u003Cp\u003EMiraculously Honeybee II survived the ascent, but falling back down presented another problem.\u003C/p\u003E\u003Cp\u003EThose parachutes. They burned off on re-entry. Yeah.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8fhUgUU.png\u0022 alt=\u00228fhUgUU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAgain, a fine landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HuEsCCH.png\u0022 alt=\u0022HuEsCCH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EHoneybee III\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYou know what\u0027s amazing about the Stayputnik probe core? It seems very durable. I\u0027m pretty sure it\u0027s just a metal ball that goes beep. So we\u0027re making Honeybee III even smaller and faster and I\u0027m counting on the core to survive it. There would be smaller engines available, sure, but I don\u0027t really see downscaling as a proactive, problem solving approach you know. If life hands you big boosters, make fast rockets. \u003C/p\u003E\u003Cp\u003EThe core seems to be doing just fine.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/T3Kpemj.png\u0022 alt=\u0022T3Kpemj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll fuel is used up before heat gets too intense for our little \u0027putnik and we get a nice apoapsis.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LHpmyPy.png\u0022 alt=\u0022LHpmyPy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EScience! Again! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GBEcCeY.png\u0022 alt=\u0022GBEcCeY.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EParachutes didn\u0027t even burn off. We\u0027re coasting peacefully among the clouds.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kHbH4hm.png\u0022 alt=\u0022kHbH4hm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo a pretty landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jJeO5qT.png\u0022 alt=\u0022jJeO5qT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EScience is finally collected. Yay!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xHpubzW.png\u0022 alt=\u0022xHpubzW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m faced with hard decisions. This is what the tech tree looks like now. I\u0027m picking the early staging node first because it\u0027s cheap and I need staging if I\u0027m gonna go anywhere.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8kVD9b2.png\u0022 alt=\u00228kVD9b2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso you gotta have engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9BOXgPH.png\u0022 alt=\u00229BOXgPH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m also picking early probes at this point. The description says there\u0027s two versions of stayputnik, but those were already on the first node and these cores are the QBE ones. I\u0027m picking the node mostly for the battery so I can transmit stuff.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lTDHcXH.png\u0022 alt=\u0022lTDHcXH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext goal will be to actually get a real orbit. Having staging should help with this and maybe the rockets will start to look like rockets soon.\u003C/p\u003E\n"},{"CreatedByName":"NobodyIP","CreatedById":98774,"CreatedDateTime":"2014-04-22T08:52:10Z","Content":"\n\u003Cp\u003EI\u0027m enjoying this so far. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-04-22T19:02:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NobodyIP\u0022 data-cite=\u0022NobodyIP\u0022\u003E\u003Cdiv\u003EI\u0027m enjoying this so far. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m glad you like it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve made some progress, but it takes surprisingly long to sort out all the screenshots.\u003C/p\u003E\n"},{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-04-22T19:39:34Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ECutting the rocket into pieces\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EHoneybee IV\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESo maybe it\u0027s time to use some scientification in designing the next rocket. By that I mean adding explosive charges all over the thing and blow up any parts we\u0027re not using anymore. Hmm, well the engineers made it sound a bit more convincing.\u003C/p\u003E\u003Cp\u003EFor the upper stage, I\u0027m actually thinking about the engine choise this time. WAC Corporal Sustainer sounds very convincing and organized so I\u0027ll pick that one. Also I\u0027m swapping the kerosene for some Amines / Nitric Acid -combo for the engine. I\u0027m still trying to figure out what\u0027s the difference between all the fuels, apart from ISP and thrust of course. The tank is a stretchy tank, although there\u0027s some confusion with the tech tree entries saying stretchable tank but the parts are called conic tanks. They work fine nevertheless, so I\u0027ll see how it goes. There\u0027s many variations of the tanks, like balloon tanks and some kind of cryogenic tank which I\u0027m guessing could be used to store ice cream or other similar snacks.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/87oQWRi.png\u0022 alt=\u002287oQWRi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe lower stage is made of \u0022cylindical service module\u0022 which is another variation of the strecthy tank. UDMH/Acid combo is the way to go for many reasons I\u0027m sure are there. I most definitely didn\u0027t just pick it at random.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dlJauKg.png\u0022 alt=\u0022dlJauKg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOur engineers insisted that we need more boosters, so I\u0027m adding more boosters, this time SRBs. It now has quite a lot of dV, but to be honest I have no idea how much I need to reach orbit. I know orbital speed is around 7~ish km/s so I probably don\u0027t have enough just yet. Also I have no idea what SLT means next to the TWR. Sea Level Thrust?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ctpuwS5.png\u0022 alt=\u0022ctpuwS5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEnough with the numbers, let\u0027s launch! \u003C/p\u003E\u003Cp\u003EBob was charged with taking a photograph of lift-off, but we later found him eating some mint ice cream our scientists had stuffed inside one of the cryogenic tanks so we missed the launch itself. But here\u0027s a pretty picture a few moments after liftoff!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/B9dcuAc.png\u0022 alt=\u0022B9dcuAc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESeparation of SRBs went perfectly!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qSHKaBk.png\u0022 alt=\u0022qSHKaBk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUpper stage separation proceeding as planned, things are looking good!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PBuu0KK.png\u0022 alt=\u0022PBuu0KK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWe should be almost in orbit, right guys? Let\u0027s see that flight dat-\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nDE1vLM.png\u0022 alt=\u0022nDE1vLM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOK that was a massive disappointment. Turns out the rocket had way too little thrust and spent most of it\u0027s time just waddling upwards in a slow manner. Luckily we can add more boosters for the next rocket!\u003C/p\u003E\n"},{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-04-23T04:30:01Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EHoneybee V\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWe had a little discussion about our previous failure and came to a very solid conclusion. What I need is more power and more explosives. And kerosene. A few words about this new design. First off, the first stage runs on kerosene, because I could get the most thrust from it and it seemed pretty much superior in every way. I\u0027m also pretty sure that the SLT means TWR on sea level. I tried to find some documentation but either there wasn\u0027t any or I just couldn\u0027t find it.\u003C/p\u003E\u003Cp\u003ESomething I forgot to mention on Honeybee IV was the poor maneuverability after the winglets had separated. The corporal sustainer engine doesn\u0027t have any gimballing and the probe core has very very low torque on it\u0027s reaction wheels so essentially the stage is uncontrollable. The small orange radials have gimbals so using those will help with steering. We had a morning meeting about this today and decided that steering is something we should have.\u003C/p\u003E\u003Cp\u003EOn that note, the upper stage is split into two and the probe itself is given a new engine. This one is actually throttleable and restartable! It\u0027s using hypergolic fuels which allow this so I\u0027m expecting great things from the aptly named LR11R engine. \u003C/p\u003E\u003Cp\u003EThe probe core itself has two blocks of explosives, one to separate the re-entry phase that has a heat shield and second one to drop the heat shield off. This one we don\u0027t really need, but it\u0027s integrated into the shield.\u003C/p\u003E\u003Cp\u003EThrust is still a bit low and I know this won\u0027t make orbit just yet but I\u0027m more interested in seeing how the engines perform.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gq33XSf.png\u0022 alt=\u0022gq33XSf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the rocket after SRB separation. Something I have no idea about as well is when to start gravity turn. Normally with FAR I just start it right away after clearing the tower, but now I decided to wait all the way until about 20 km to even begin. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DscRVF4.png\u0022 alt=\u0022DscRVF4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOverall the launch went really well. The orange engines gimbal like crazy though, SAS went absolutely nuts if you tried to turn with anything but a quick, gentle tap on the controls. After the probe had spent all it\u0027s fuel I managed to get a good apoapsis at 251 km, which is a bit above the atmosphere. I\u0027m not entirely sure where the limit is, but it\u0027s somewhere between 150 and 200 km I think. The tiny torque on the core is barely enough to turn it, but to do this properly SAS needs to be off.\u003C/p\u003E\u003Cp\u003EAt the end of the day I\u0027m calling this our first entirely successful suborbital flight! \u003C/p\u003E\u003Cp\u003ENow onwards to tease out that periapsis!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t7fnoXr.png\u0022 alt=\u0022t7fnoXr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m liking the mod collection a lot so far, but I do have one gripe with it. The documentation is a bit off or misleading. For example the Stayputnik Mk 2 says it has experiments for suborbital flights. I was able to use the data recorder to gather the data, which acts as a resource that\u0027s needed to run the experiment. It worked nicely once my situation was low in space but the experiment itself couldn\u0027t be done. The experiment says KE/LEO in it, so I\u0027m assuming you need a stable orbit for it. There\u0027s also no way to tell in VAB what the experiments are, so you need to first launch the probe before you can even see them. Not a big issue, but it is a bit confusing. There\u0027s also a technical issue where adding parts with symmetry messes up the fuel settings. Sometimes one or all of the tanks lose their ability to contain fuel at all and the only way to fix it so far has been to repeatedly just redo the parts. This can be very frustrating at times, but I don\u0027t know if my install is botched or if this happens to others as well. However with mods some technical issues are to be expected so as long as I can get it to work after a while, it\u0027s just an inconvenience.\u003C/p\u003E\n"},{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-04-23T18:23:58Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EHoneybee VI\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s it! We\u0027re making everything bigger this time and packing more kerosene, aka kerbal juice, than ever before! \u003C/p\u003E\u003Cp\u003EThe rocket starts to look a bit thin and tall, I honestly don\u0027t think it\u0027s possible to stretch it any more. The four liquid boosters weren\u0027t strong enough to get it off the ground, so we added some SRBs. But it was just too silly to have only one small SRB on each liquid booster so we added three. These would get it neatly off the ground and accelerate to a good pace fast (also yay for thrust limiter on SRBs!) and with stretchy tanks it was easy to adjust the liquid booster size so that once they run out of fuel, the core still has enough TWR to keep going. I\u0027m not mathy enough to know if it would\u0027ve been smarter to have more than 1.0 TWR after separation but I figured that once going at decent speed, it doesn\u0027t matter so much if there\u0027s some blind spots in acceleration. The whole thing weighs 31.7 tons, taking a payload of 200 kilograms hopefully to orbit. OK so the payload fraction is less than one percent but let\u0027s not worry about that before orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yQV6kd2.png\u0022 alt=\u0022yQV6kd2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESpirits are high on KSC as Honeybee VI is prepped for launch. Roar of engines fills the air as the rocket lifts off and shiny, twirling chocolate bar wrappers fill the air as one of the SRBs coughs them up on the unsuspecting crowd, then falling silent and dark. \u003C/p\u003E\u003Cp\u003EWait, what? \u003C/p\u003E\u003Cp\u003ESo that\u0027s where Bill had stashed his snacks. As it turns out, one of the SRBs didn\u0027t have any fuel in it, I have no idea why as they should be symmetrical. It doesn\u0027t matter though, we still have enough thrust to get going and the gimballing keeps the rocket steady. Also from the photo you can\u0027t even see the mistake so all is well as we feast on the ad hoc chocolate fondue which doesn\u0027t taste too much like kerosene.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LPn3RiJ.png\u0022 alt=\u0022LPn3RiJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe SRB triplets are dropped off. I was afraid they wouldn\u0027t separate neatly or would overheat, but all in all they behaved nicely.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1dNSznt.png\u0022 alt=\u00221dNSznt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI did similar gravity turn as before, starting around 20 km and I was already going pretty horizontally when the liquid boosters were separated.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4VdQmjJ.png\u0022 alt=\u00224VdQmjJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rocket is well above atmosphere when the upper stage is ignited. Now is time to gather some speed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WNRL4X9.png\u0022 alt=\u0022WNRL4X9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EInsertion stage separates. It has low TWR but we\u0027re already in a good position so it doesn\u0027t matter.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rud4vnV.png\u0022 alt=\u0022rud4vnV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd we have a periapsis! Honeybee VI is officially on a stable orbit! Time to celebrate and bully Bill into sharing his second snackstash!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uED3r1e.png\u0022 alt=\u0022uED3r1e.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s plenty of dV left, so this might in theory even get to a high orbit, but we\u0027re sticking to mission plan. The show isn\u0027t over yet, this thing needs to come back alive.\u003C/p\u003E\u003Cp\u003EBut there\u0027s always time for a little pose, so strut those antennas and show us some elegance!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LYe1Z8l.png\u0022 alt=\u0022LYe1Z8l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETime to get serious and do some science. As I suspected, the experiments work as intended now that the probe is in stable orbit. It exposes the mysterious sample to a vacuum to see if it survives the harsh conditions and does some reading. It\u0027s all very sciency. I transmit back what I can in case the probe doesn\u0027t survive re-entry.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CpHzKqs.png\u0022 alt=\u0022CpHzKqs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETime to head back. I lower the periapsis to 20 km and hope that the heatshield can take the deceleration. When hitting the atmosphere, the clouds get bugged somehow. I think they\u0027re clipping with the planet\u0027s surface because they get a bit better after I raise their height to 10 km from the mod\u0027s GUI. However when approaching the atmosphere they look pretty ugly and pixelated, I don\u0027t know what\u0027s happening or if they\u0027re supposed to look like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/00H8SS3.png\u0022 alt=\u002200H8SS3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBecause after the re-entry (heat shield withstood it fine!) I\u0027m sailing through them and they\u0027re absolutely gorgeus. The picture doesn\u0027t even do them justice, the mists look very good, the only bad side is that I think I have a very short draw distance or something, because some parts of the cloud keep appearing and disappearing randomly. When I have more patience, I might try to play around with the settings more.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/k9OWEeM.png\u0022 alt=\u0022k9OWEeM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter hitting water and surviving the known water-bouncing-bug I finally gather the spoils! A smashing success!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eyMGJr0.png\u0022 alt=\u0022eyMGJr0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI decide to go for lots of cheap nodes. The next tier in rocketry costs 500 science and right now I have no idea how to get those kinds of numbers, but maybe I\u0027ll get bigger amounts when making manned flights or going to the moon. We\u0027ll see about that then. I\u0027m going to take the thermometer and gravioli detector out for a spin next and see what their science output is like. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HLbYGwJ.png\u0022 alt=\u0022HLbYGwJ.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/55AVjq7.png\u0022 alt=\u002255AVjq7.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2DcwdaS.png\u0022 alt=\u00222DcwdaS.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/E7wUj8s.png\u0022 alt=\u0022E7wUj8s.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/cwDAhDF.png\u0022 alt=\u0022cwDAhDF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EP.S. Sorry for the badly clipped tech tree pictures.\u003C/p\u003E\n"},{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-04-23T18:38:34Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EHoneybee VII\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe purpose of this mission was simply to gather all data I could with the newly unlocked thermometer and gravioli detector. I was otherwise similar to the famous Honeybee VI but some fairings and nosecones were added. The rocket looks cooler, but the mission was actually quite boring. I had an extra objective though. Since I didn\u0027t need to land it (everything was transmittable), I was thinking of leaving it on orbit as a planning device, to see some dV requirements for maneuvers and such. \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe launch was smoother than before, this time all the SRBs were filled with rocket fuel instead of chocolate.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hd8bgQO.png\u0022 alt=\u0022hd8bgQO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EI managed to gather most of the biomes. With RSS they are all over the place since it uses Kerbins biome map so I got highlands, grasslands and such while flying over the ocean. I know there\u0027s some maps with custom biomes mod to fix this, but honestly I\u0027ll be doing so little science on Earth \u003C/span\u003E\u003C/span\u003Ethat I probably won\u0027t bother at this point.\u003C/p\u003E\u003Cp\u003EThe mission was only a partial success though. I had only 2 solar panels on it, but it turns out that they\u0027re massively weaker than in stock and couldn\u0027t keep the probe running. I tested this on the ground and I\u0027d need at least 0.70 exposure to get enough juice, but of course I didn\u0027t orient the probe properly so it\u0027s floating dead in space now. Luckily I was able to transmit pretty much all of the data back home (which was worth some science, but I obviously need to advance in the program if I want to get to the more expensive nodes). With this, we decided to declare the Honeybee line of rockets officially a successful series of missions, but as such they can carry too small payloads so the next step will be designing a new lifter that could potentially get a kerbal on the orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ap4fOzM.png\u0022 alt=\u0022ap4fOzM.png\u0022\u003E\u003C/p\u003E\n"}]}