{"TopicId":70112,"ForumId":16,"TopicTitle":"Spaceplane aesthetical question","CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2014-04-22T05:17:27Z","PageNum":1,"Articles":[{"CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2014-04-22T05:17:27Z","Content":"\n\u003Cp\u003EFor starters I have to say that I rather enjoy making spaceplanes and that it\u0027s my favorite part of KSP..\u003C/p\u003E\u003Cp\u003ERight now I\u0027m attempting to create a dropship/shuttle craft sort of ssto and I have a few prototypes but none that I\u0027m real happy with or fly nicely. My question is to you spaceplane design experts how to play wings to make your crafts look so sleek and smooth while still maintaining function. I am using b9 and pWings and would prefer those modded craft for examples but anything can help my inspiration. I\u0027m not sure if this is the right forum either but oh well.\u003C/p\u003E\u003Cp\u003ESoup\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-04-22T05:31:04Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/e7q87\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/blockquote\u003E\u003Cblockquote\u003E Is capapable of carrying smallish payloads to orbit. One option though is to clip the wings through the body of the plane (By placing them on one side and then rotating them 180 degrees) Note my SSTO uses the Space Shuttle Engine Mod. (In addition to others that can be removed without penalty if you want the craft)\u003C/blockquote\u003E\n"},{"CreatedByName":"SpenSpaceCorp","CreatedById":98977,"CreatedDateTime":"2014-04-22T05:53:04Z","Content":"\n\u003Cp\u003EGenerally, I tend to:\u003C/p\u003E\u003Cp\u003E-Make sure wings go (from front - back) short to wide, rounding inwards instead of outwards.\u003C/p\u003E\u003Cp\u003E-Angle wings either up or down, depending if they are located on top/below the craft (for example, dropships tend to look good with wings on top, angled downwards, and shuttles with bottom wings flat/angled slightly up)\u003C/p\u003E\u003Cp\u003E-(Maybe) Add canards in the front or elevators in the back\u003C/p\u003E\u003Cp\u003E-Shape the rear of the wings so that (for example) they slant outwards slightly, instead of remaining 90 degrees to the body.\u003C/p\u003E\u003Cp\u003E-For larger craft, use multiple wings to make a larger or sleeker tail fin/rudder, or use multiple tail fins.\u003C/p\u003E\u003Cp\u003E-And as a general rule, (especially with stock), don\u0027t be afraid to clip wings (whether you use part clipping or not, it can still be done for looks and functionality)\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-22T09:22:31Z","Content":"\n\u003Cp\u003EMost important thing is that (at least in stock aerodynamics) passive wings generate lift only in one direction. It is irrelevant whether the wing is going through air \u0022forwards\u0022 or \u0022backwards\u0022, you get lift both ways. But you get no lift if it goes \u0022sideways\u0022.\u003C/p\u003E\u003Cp\u003EFor instance the Wing Connector part:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/thumb/d/dc/Wing_connector.png/49px-Wing_connector.png\u0022 alt=\u002249px-Wing_connector.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E...only generates lift if air passes it along its long edge, not in perpendicular direction even though common sense says that should generate lift too.\u003C/p\u003E\u003Cp\u003EActive control surfaces are even more finicky - you need to always mount them the right way. A backwards mounted active control surface, even if uncontrolled, generates lift in completely different direction than where you would expect it to go.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-04-22T15:48:35Z","Content":"\n\u003Cp\u003EFor me it depends on the design I am going for. If it is a cargo hauler I generally design the wings bigger than needed for the craft empty, that way it still generates more than enough lift for when it is hauling its cargo. But for my crew shuttles and science craft, they can very from the interesting to the boring. \u003C/p\u003E\u003Cp\u003EHere are a few of my favorite designs.\u003C/p\u003E\u003Cp\u003ESVO-22 Thrush\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/peGBO\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ESP-406 with its 108 ton cargo hauling capacity.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/cQGmt\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ESVO-21 my commsat launcher.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/vd6aC\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ETo my first SSTO for the Real Solar System scaled Kerbin, in other words it is the same scale as Earth. \u003C/p\u003E\u003Cp\u003EThe X-4.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/5AwCA\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd the last working SSTO for the RSS sized Kerbin before I went full Realism Overhaul.\u003C/p\u003E\u003Cp\u003EX-6\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/lYwdz\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EEven my old work horse, which was my first working SSTO, that I just kept improving, SVO-25/SP-301.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1fsk4NB.jpg\u0022 alt=\u00221fsk4NB.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cziken20","CreatedById":95907,"CreatedDateTime":"2014-04-22T16:20:30Z","Content":"\n\u003Cp\u003EWhat i do i noticed i don\u0027t put engines on back and instead put on wing connector. Then i add rudder and elevators on the end of it. I often also do a biplane simply putting two wings one up and one down and on the ends i put small wings angled down or up to connect the two wings in a =\u0026gt; pattern. then i put fuel tanks betwenn them and put engines on fuel tanks and air intakes. But bigger planes... hmmmm... i always put wings on bottom and hide part of them under tha plane body and angle ends up.\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2014-04-22T21:19:45Z","Content":"\n\u003Cp\u003EThere\u0027s one tip I could give you about connecting wing parts:\u003C/p\u003E\u003Cp\u003ETo connect wing parts properly, the part you\u0027re connecting to must be STRAIGHT. It must not be in any sort of diagonal/sloped position, otherwise the wing will be in a weird angle or in the air. \u003Cstrong\u003E1st\u003C/strong\u003E connect all the wings you need, then change angles to whatever you like.\u003C/p\u003E\u003Cp\u003EHope this helps a bit :^]\u003C/p\u003E\n"},{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-04-23T00:32:05Z","Content":"\n\u003Cp\u003EInspiration (image spam) incoming! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1301.livefilestore.com/y2pk_DcGHXnFASw3WQKy5ISpEPUW2N_wPTlfazusvjtHIwUhevaEiOxv5YywGorKzu5NAsDq-5F-ec-S2lCl9RUS1eijYTUUT73m5QWY42diB8/screenshot851.png?psid=1\u0022 alt=\u0022screenshot851.png?psid=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1301.livefilestore.com/y2p3szCGSl-z8nmufpvVnYRo7QYYpH1O3PhUdjN8koQfFuedFWJSo48l_eHP39jpyX8LW2eIA6joLQKQFko3uPCcpBrmj49B9GVrqsgjcdYD9s/screenshot852.png?psid=1\u0022 alt=\u0022screenshot852.png?psid=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1304.livefilestore.com/y2pfuzkq4LO3_9HWEmPsyVXqXXrJjs6rX6T85Hr5abhu4VCKq1TcR8EraCCRRbbZOz-xoNXUFE0U9ObWFyVg9gKoEdxF0PWyZIwqLf7uQF-cuE/screenshot807.png?psid=1\u0022 alt=\u0022screenshot807.png?psid=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1303.livefilestore.com/y2pADqMrfd5ogOJ28KR_TXeQTOIY705leTR8sfmyAFucdE683DZUKdCLcLJwv2CgEdFdSHF4qaoL4t8PlGhV0okvmScsempVuQqs9W-QhTJ1eU/screenshot793.png?psid=1\u0022 alt=\u0022screenshot793.png?psid=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1303.livefilestore.com/y2p6SY63TtcrYjPPbAjDFiWlwgy31NxBnoU7GSxWQZ4oNOQPEd-c9hlZVp9BUOoZSfM1SwIR6H8plwTapg4fL4OmFzDCyAv4g9YuT_KLNn4PuQ/screenshot794.png?psid=1\u0022 alt=\u0022screenshot794.png?psid=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1301.livefilestore.com/y2pWPWykg8pdtAOUfVSBQAo7knwsI5f8NaMWwBlqqZfbBZ7-90MBRu5GjXabev3ChJOsiIRgAakFiBvDdXltKuHyjsHYa2hhf9GPlx_vQJb0NI/screenshot707.png?psid=1\u0022 alt=\u0022screenshot707.png?psid=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1301.livefilestore.com/y2pY3prTuacfkfLAdXdNVyrcPtHKCGi5852emd50GDY_LJ5T1WT9jw8eiNuucbuY5mLh9JYssBj3AzaEOSKW_aGCfq6j21UsDtCiYxS6IMybNE/screenshot653.png?psid=1\u0022 alt=\u0022screenshot653.png?psid=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1.livefilestore.com/y2p5wQc-8lxg2Pe9cQUokNaf-pnOmr2DkAteMzAqj_V7ne5AoX81GaQ1odOcU57kzKxYdWB_A2ZUB6HXkQCTVyXTGY9ziyshGc5ZN4Nhd180qs/screenshot539.png?psid=1\u0022 alt=\u0022screenshot539.png?psid=1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://ymqskw.bn1301.livefilestore.com/y2pnTlEzzlbSxO62mHqIOjXLSXb2_GKhPlKMGSK8rJHX3qTBblXVXyCafq0UW8gfTELCbOfKY7mlY25B9eLJvdIw2AitQmangj6oLBAqbh57Yo/screenshot502.png?psid=1\u0022 alt=\u0022screenshot502.png?psid=1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2014-04-23T02:06:54Z","Content":"\n\u003Cp\u003EThanks for all the replies guys! I love everyone\u0027s craft!\u003C/p\u003E\u003Cp\u003EI guess what I was really after was inspiration on more than anything. I should have also probably mentioned that I use FAR as well so real aerodynamics are a thing. \u003C/p\u003E\u003Cp\u003EI just have a hard time putting pWings together to make something I\u0027m happy with. \u003C/p\u003E\u003Cp\u003EHere\u0027s what I have currently that I\u0027m having a few problems with. First off, the b9 airnozzles aren\u0027t refilling with air and I don\u0027t know what to do about that. Secondly, whenever I try to yaw it goes almost the opposite direction so I have 0 yaw control even though I have rudders.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/swUUT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-04-23T03:13:47Z","Content":"\n\u003Cp\u003EIs it possible that FAR is in conflict with the B9 air nozzles? I have no idea, since I\u0027ve never used FAR before. Maybe a reinstall of B9 would help. By the way, Infernal Robotics has been updated for 0.23.5!\u003C/p\u003E\n"},{"CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2014-04-23T04:02:52Z","Content":"\n\u003Cp\u003EI don\u0027t think so, one of my other craft(The arrow) has b9 air nozzles which work just fine. They will not, however, work with this one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I can\u0027t figure out why. I\u0027ve solved the yawing problem and the only thing left to do for this craft is fix the air nozzles. \u003C/p\u003E\u003Cp\u003EI saw that! That and the fact that I have some free time today is why I\u0027m building...this is actually another foldy wing craft. I seem to be obsessed with them lately but oh well. Here\u0027s a short album showing foldyness.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/aiHAw\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EEdit: I just realized this post was my 100th post and that your last response Voculus was your 100th post...\u003C/p\u003E\n"},{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-04-23T05:48:18Z","Content":"\n\u003Cp\u003EDo you have hinges and Q Struts tucked away inside the fuselage? I love the idea of having a small ship berthed in a large ship, but haven\u0027t figured out the wing voodoo you seem to have mastered.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2014-04-24T04:57:11Z","Content":"\n\u003Cp\u003EYes the hinges are inside the fuselage. The main wings are actually on a hinge that\u0027s on top of a cubic strut which is attached to one of the wingsections that cover the bottom of the engineblock. I have Qstruts on the outside of the plane just inside the covered wing section to block them from view. I tried running Q struts inside the ship onto the hinges themselves but I ran into a really funny bug. Whenever the Qstruts were on, the ship would just stop where it was. I could be flying and then activate them and I would suddenly stop and float there. Thrust, torque, rcs nothing mattered it was really funny.\u003C/p\u003E\n"}]}