{"TopicId":70330,"ForumId":55,"TopicTitle":"Should KSP have a Delta-V readout?","CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2014-04-24T10:50:12Z","PageNum":10,"Articles":[{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-04-27T00:15:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI very quickly came to the conclusion that it wasn\u0027t practical (read fun) to design a rocket for a purpose without, at least, readouts of TWR and deltaV. It just involved too much trial and error and restarting your missions several times because you haven\u0027t added enough fuel to get home gets discouraging very quickly\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd this is exactly why I finally decided to install KER, so that I could be sure my Eve and Tylo landers could make orbit again without doing multiple missions just to test. Having Eve landers break on the way down was enough hassle.\u003C/p\u003E\u003Cp\u003EThanks Padishar!\u003C/p\u003E\n"},{"CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2014-04-27T00:47:25Z","Content":"\n\u003Cp\u003EI\u0027m going to say yes... but... it needs to be earned. Probably through the tech tree, or some other science or tests involving the parts you have unlocked.\u003C/p\u003E\u003Cp\u003EOne of the big accomplishments early in the game is getting into orbit for the first time, before you know anything about delta v or how much of it you need, etc.\u003C/p\u003E\u003Cp\u003EBy the time you go to Duna you know what all of those things are and the trial and error that\u0027s involved if you don\u0027t want to calculate it manually or have a complicated staging setup going is tedious... so by that point you should have a Kerbal Engineer or MechJeb type readout available to you, or you\u0027ve ran the missions necessary to know the capabilities of your engines, tanks, etc to have the delta-v data unlocked for them.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-27T01:16:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022helaeon\u0022 data-cite=\u0022helaeon\u0022\u003E\u003Cdiv\u003EOne of the big accomplishments early in the game is getting into orbit for the first time, before you know anything about delta v or how much of it you need, etc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf a player knows nothing about delta-V or how much is required to make orbit, a readout of delta V is not going to reduce that sense of accomplishment. A new player is going to mess around with a few configurations and hit the launch bar, and odds are not good that they\u0027ll make orbit. Then they\u0027ll mess around with building a little more carefully, and maybe they notice that the readout changes. So they discover there is some quantity that it is measuring, maybe guess that a higher number is better. They still need to figure out how much is needed, how to build a spacecraft with enough, and how to fly it into orbit. A delta-V readout only helps a little bit with the first two, and the third is not diminished by it at all.\u003C/p\u003E\u003Cp\u003EI\u0027m more concerned by the scenario in which a new player can\u0027t figure out how to build a ship that can get to orbit, and even though their piloting is improving there is no chance that the craft can do it. A dV readout could nudge them in the right design direction before they give up in frustration.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-27T03:38:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sanoj688\u0022 data-cite=\u0022sanoj688\u0022\u003E\u003Cdiv\u003EWe would be doing the developers and everyone else a favor if we would make an inventory of all the strange cases that would cause problems with a delta-v system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe cases where automatic delta-v calculations break are not so strange at all.\u003C/p\u003E\u003Cp\u003EConsider the simple case with a reusable mothership and a reusable lander. Your total delta-v varies, depending on how much of the total fuel is consumed by the mothership and how much by the lander. The timing of the landings is also important: the sooner you do them, the more delta-v the mothership is going to get from its share of the fuel.\u003C/p\u003E\u003Cp\u003ECases like this are one of the reasons we need mission planning software in addition to simple delta-v calculations.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-04-27T05:53:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmappedout\u0022 data-cite=\u0022allmappedout\u0022\u003E\u003Cdiv\u003EI find that the game doesn\u0027t quite provide enough for interplanetary stuff yet though (there\u0027s no real way to work out your ejection angle or phase angle, except, again, by eyeballing it), and at those distances it\u0027s very difficult to work out what to adjust. I think some improvement on that data (and maybe a tutorial on how to use it) would help a lot of people break out of Kerbin\u0027s SOI for the first (and hopefully not last!) time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. Exactly.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-04-27T05:54:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EThe cases where automatic delta-v calculations break are not so strange at all.\u003Cp\u003EConsider the simple case with a reusable mothership and a reusable lander. Your total delta-v varies, depending on how much of the total fuel is consumed by the mothership and how much by the lander. The timing of the landings is also important: the sooner you do them, the more delta-v the mothership is going to get from its share of the fuel.\u003C/p\u003E\u003Cp\u003ECases like this are one of the reasons we need mission planning software in addition to simple delta-v calculations.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStill, KER type delta-v and TWR calculations would be much better than nothing.\u003C/p\u003E\u003Cp\u003EIn fact, I doubt I\u0027d actually end up bothering with anything more complex if there was an option to see the KER type numbers.\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2014-04-27T09:24:42Z","Content":"\n\u003Cp\u003EYes, yes it should.\u003C/p\u003E\u003Cp\u003EMJ\u003C/p\u003E\n"},{"CreatedByName":"Brischkopp","CreatedById":101864,"CreatedDateTime":"2014-04-27T09:35:19Z","Content":"\n\u003Cp\u003EThey should add a weight readout, because that\u0027s the most boring part of calculating the Delta-V by yourself.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork_werewolf","CreatedById":90749,"CreatedDateTime":"2014-04-27T10:21:01Z","Content":"\n\u003Cp\u003EOK here is a question, why do people desire a feature already available in mods when they could be asking for the Devs to make planets customizable.\u003C/p\u003E\u003Cp\u003EAt present the only way to add planets is to illegally decomplite the game. I know that the hard coding of the planets may help with game speed but I expect many people (not all though) have the spare computing power to have customizable planets.\u003C/p\u003E\u003Cp\u003ECustomizable planets would let mods add that second gas giant lots of people want. It would let people make mercury oceaned hot planets. They could make gas planets with a tiny core. They could make an accurate human solar system. They could make closest approximations of exo planets found by Kepler. They could make rock planets with 10 moons. They could make Endor.\u003C/p\u003E\u003Cp\u003EThis is a feature we can NOT have in any way, where as delta-V is a feature you can have at any time. \u003C/p\u003E\u003Cp\u003EReal question: Time is limited, what makes already existing mod features more important for the Devs to work on?\u003C/p\u003E\n"},{"CreatedByName":"sanoj688","CreatedById":83090,"CreatedDateTime":"2014-04-27T10:35:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Clockwork_werewolf\u0022 data-cite=\u0022Clockwork_werewolf\u0022\u003E\u003Cdiv\u003EOK here is a question, why do people desire a feature already available in mods when they could be asking for the Devs to make planets customizable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIsn\u0027t there already a mod with custom planets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E? But I sort of agree that it\u0027s not necessary at the moment because mods do a (for the time being) perfectly fine job.\u003C/p\u003E\u003Cp\u003EBut.. imo it needs to be stock when the game is finished (whenever that may be)\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-04-27T10:37:07Z","Content":"\n\u003Cp\u003Eif its a matter of priority i would rank it like so\u003C/p\u003E\u003Cp\u003E-career\u003C/p\u003E\u003Cp\u003E-finish biomes\u003C/p\u003E\u003Cp\u003E-fix stock aerodynamics\u003C/p\u003E\u003Cp\u003E-polish the game up(your dv counter thingy, iva for all cockpits, BUG CRUSHING)\u003C/p\u003E\u003Cp\u003E-multiplayer support\u003C/p\u003E\u003Cp\u003Eand assorted parts throughout. then v1.0\u003C/p\u003E\u003Cp\u003Ebut im sure that isnt how others see it. kmp isnt for me so i could do without but hey\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-04-27T12:13:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI applaud how you apologized while dropping yet another insult. Well done!\u003Cp\u003EYeah, no. As one of those who voted no, and is against this idea for several reasons already stated, I reject your statement that I want to keep this game only for the obsessive, or that I hate new players. Please refrain from further insults and blanket insinuations.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWasn\u0060t talking about you. You have jumped into a response to a response to clockwork werewolf who was suggesting that 85% of people be put out to comfort 15% of people.\u003C/p\u003E\u003Cp\u003EI\u0060ll state it plainly, Regex does NOT want to keep this game only for the obsessive, or hate new players. \u003C/p\u003E\u003Cp\u003EThere are elements in the forum though who DO want to keep the game for the obsessive, restrict information to that which is calculated external to the game from basic principles, and maintain superiority over newer players (not hate, desire to maintain superiority over)\u003C/p\u003E\u003Cp\u003EMost players do not do this. This a vocal minority.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EYou know they type, and they are vocal.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, them. Not you. You do not for example state that the entire of society should re-educate itself as to the standard units it is familiar with instead of changing the units displayed in KSP and badger a thread until they stop disagreeing with them. I have seen that. You do not bombard mod devs until they cannot continue with development of their mod with constant questions barely connected with the mod in an attempt to shape the mod to your personal vision. I have also seen that. This is the type of actions from the vocal minority on the forum I refer to that is trying to ride roughshod over the wishes of the majority to the detriment of the game IMHO.\u003C/p\u003E\u003Cp\u003EYou are actually quite reasonable on the forum in spite of your \u0060not very diplomatic\u0060 tagline.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EHave you ever built an Apollo-style craft or anything else highly modular? Certain combinations of parts can trip it up and certain staging configurations can do the same. There needs to be a simple way to handle that sort of thing through the GUI. Unfortunately that adds a lot of complications to use.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERegularly. It\u0060s almost all I do in KSP. I am very familiar with the issues you describe. If I could define groups or subassemblies (as we currently do), like descent, ascent then group groups for example \u0060descent\u002Bascent=lander\u0060 then each group can have the configuration defined for Dv like \u0060config 5=CM\u002Blander, engines used - CM\u0060\u003C/p\u003E\u003Cp\u003EThe final grouping would be the entire craft.\u003C/p\u003E\u003Cp\u003EThen KSP has all the information it needs to cope with fringe cases as the user has explicitly defined them.\u003C/p\u003E\u003Cp\u003Eso the Dv for config 5 is easy whereas now it is almost impossible (being a config after a docking and staging). You just need a little explicit defining by the user.\u003C/p\u003E\u003Cp\u003EFor apollo you would define the ascent lander stage then define the descent then define the lander as descent\u002Bascent (using descent engines) and so forth\u003C/p\u003E\u003Cp\u003Econfig 1 - standard (stage 1)\u003C/p\u003E\u003Cp\u003Econfig 2 - standard (stage 2)\u003C/p\u003E\u003Cp\u003Econfig 3 - standard (stage S-IVB)\u003C/p\u003E\u003Cp\u003Econfig 3 - CM\u002Blander\u003C/p\u003E\u003Cp\u003Econfig 4 - CM\u002BS-IVB\u003C/p\u003E\u003Cp\u003Econfig 5 - lander\u003C/p\u003E\u003Cp\u003Econfig 6 - CM\u003C/p\u003E\u003Cp\u003Eand so forth.\u003C/p\u003E\u003Cp\u003EThen the missions profile could go\u003C/p\u003E\u003Cp\u003Econfig 1, config 2, config 4, config 3\u003C/p\u003E\u003Cp\u003EA nice benefit from doing this would be the correct naming of parts as they detach from the craft and the correct renaming of the craft as parts detach. Your lander would be called \u0060lander\u0060 or \u0060eagle\u0060 and the craft would rename to \u0060stage 2\u0060 or S-IVB\u0060, whatever you named it. No more \u0060probe lander probe\u0060 parts...\u003C/p\u003E\u003Cp\u003EI see it as part of a larger mission control/mission planning system which would benefit the game greatly. Lets face it, once you are making complex craft like this you have reached a certain skill level and could cope with a little defining. If you don\u0060t want the Dv readout then just don\u0060t bother doing that. No input from the user leaves you in the current situation.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EFear of criticism cannot be the deciding factor here as they\u0027re going to be criticized one way or the other.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. By the vocal minority. You know the type. I\u0060m trying to suggest that simply because some people are very vocal over a subject and feel strongly about it that this should not be seen that most people think that way.\u003C/p\u003E\u003Cp\u003EI especially feel that the game should not be put into a state that only interests a minority and excludes the interests of the majority. That is just bad business sense. The game should have features for all players.\u003C/p\u003E\u003Cp\u003EThe mods we have now provide the function which is needed but that is exactly the point. It is needed and so should be stock. Like docking or subassemblies. There was a need, a mod was made because of that need, the mod became part of stock and so received tech support from the devs (this is why stock is important, you get support for that feature as opposed to mods)\u003C/p\u003E\u003Cp\u003EThe extension of the logic where \u0060less readouts increase discovery enjoyment\u0060 eventually leads to \u0060the most fun game possible is with no readouts\u0060 and the simple fact that the majority of people do not prefer this or any step toward this and they prefer all the readouts.\u003C/p\u003E\u003Cp\u003ESome plainly *do* prefer less readouts and there is nothing wrong with that. We should all play the game the way we want to as individuals and not interfere with others playing how they want.\u003C/p\u003E\u003Cp\u003EHow about integrating toolbar into stock and then we can just choose the custom readouts we want as individuals?\u003C/p\u003E\u003Cp\u003Ewin-win?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-27T12:40:01Z\u0022 title=\u002204/27/2014 12:40  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 27, 2014\u003C/time\u003E by John FX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-04-27T13:23:52Z","Content":"\n\u003Cp\u003ELast thing I\u0027m gonna say on this thread, as I feel I\u0027ve had my fair say already; even using MechJeb for DV readouts, I still fail and end up with not quite enough to get back to Kerbin \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E so as someone else said, just having the readout doesn\u0027t necessarily make the game any easier, and as someone else pointed out, they are not quite 100% accurate; complex LV\u0027s still have me reaching for the calculator so I can add up what I\u0027ve managed to separate into different stages... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 alt=\u0022:sealed:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-27T14:28:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022helaeon\u0022 data-cite=\u0022helaeon\u0022\u003E\u003Cdiv\u003EI\u0027m going to say yes... but... it needs to be earned.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d be happy with that. When you\u0027re at the early game stage of \u0022throw a pod at the sky until it sticks\u0022 then you can have fun without reams of data and minmaxing. But once you\u0027re far enough down the tech tree to be doing complex interplanetary missions it makes sense (and IMO increases the fun) to have some relevant planning tools available.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-04-27T17:41:43Z","Content":"\n\u003Cp\u003EIf we are going to add a Dv meter, then why not go a step further and add a complete, automated system which tells you exactly how much Dv you need and will do all of the burns and everything for you, all you do is hit \u0022launch\u0022 then once in orbit, hit \u0022Land.\u0022\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-04-27T18:00:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EIf we are going to add a Dv meter, then why not go a step further and add a complete, automated system which tells you exactly how much Dv you need and will do all of the burns and everything for you, all you do is hit \u0022launch\u0022 then once in orbit, hit \u0022Land.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProbably for the same reason that people use KER instead of mechjeb.\u003C/p\u003E\u003Cp\u003EOr something.\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-04-27T18:04:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TMS\u0022 data-cite=\u0022TMS\u0022\u003E\u003Cdiv\u003EProbably for the same reason that people use KER instead of mechjeb.\u003Cp\u003EOr something.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuite. Good response to a slippery slope logical fallacy.\u003C/p\u003E\u003Cp\u003EMost people use such tools to automate manoeuvres they\u0027ve mastered already. I\u0027m a fan of earning such advanced guidance tools.\u003C/p\u003E\n"},{"CreatedByName":"Uncle Mort","CreatedById":57933,"CreatedDateTime":"2014-04-27T18:09:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EIf we are going to add a Dv meter, then why not go a step further and add a complete, automated system which tells you exactly how much Dv you need and will do all of the burns and everything for you, all you do is hit \u0022launch\u0022 then once in orbit, hit \u0022Land.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAssuming this is a serious point and not a bit of misdirected sarcasm I say that the difference between providing delta-v data and a full automation is more than a \u0022step further\u0022\u003C/p\u003E\n"},{"CreatedByName":"JayCheetah","CreatedById":81229,"CreatedDateTime":"2014-04-27T22:59:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003Ei dont think so. my most exciting missions are watching the fuel tick down as i burn towards home. will i make it? is my kerbal doomed to drift through space forever?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust because you like to experience the game your way, doesn\u0027t mean it should not be optional for others.\u003C/p\u003E\u003Cp\u003ESquad is so keen on having KSP as an educational tool, but the game lacks tools to truly understand on whats going on.\u003C/p\u003E\u003Cp\u003EIf it wasn\u0027t clear already, I say Yes!\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-04-28T01:04:26Z","Content":"\n\u003Cp\u003EHaving a Delta-V meter serves little purpose if there is nothing to compare it to, such as how much is needed to achieve a certain orbit or transfer.Hence, if they add a Dv meter, then they should also add a system which allows you to select a target and it would give you the required Dv based on your current orbit, plus where to burn to actually make use of that Dv, otherwise a person would easily burn it away without knowing the sweet spot to burn most efficiently. With both of those in play, it is a small step to an \u0022autopilot\u0022 function. Then we are at MechJeb.\u003C/p\u003E\u003Cp\u003EThe other option to make the data useful, would be a map overlay which would show how much Dv would be required, similar to this chart \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/25360-Delta-V-map\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/25360-Delta-V-map\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAgain though, it is a small step to having a full-blown autopilot. \u003C/p\u003E\u003Cp\u003EWith all of that said, I do think the idea of being able to research a tree branch which unlocks computer systems and autopilot functions would be a reasonable compromise. I\u0027m not against a Dv dispay, I am just pointing out that it really isn\u0027t something a casual gamer really needs to know or care about, as they won\u0027t have the required knowledge to make use of it. It would be just a \u0022I have this much fuel left\u0022 placeholder.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-04-28T01:12:17Z","Content":"\n\u003Cp\u003EIt should because it\u0027s a vital thing, and no, it doesn\u0027t allow perfect flight. Many factors decide on that, not just delta-v capability.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-28T01:21:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003E\u0026lt;snip\u0026gt;\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESlippery Slope argument. Why have this game at all if the user is given what you propose? Build stuff, \u0022launch\u0022, \u0022land\u0022.. Being given the information to be able to perform orbital manoeuvres is \u003Cstrong\u003Enot \u003C/strong\u003Ethe same as the game performing those orbital manoeuvres for you. You still need to know that to reach orbit, you need 4.4 km/s dV, to get to the Mun you need about 800 m/s and to Minmus about 950. As you said, that means nothing to a new player/someone that doesn\u0027t yet understand orbital mechanics. Even if you had MJ installed, showing dV is meaningless if you don\u0027t know what to make of the information. So what\u0027s the harm in having it? How will it negatively impact your gameplay if a dV display was optional and/or unlockable? That way, people who don\u0027t want it can hide it and people who do want it can have it. \u003C/p\u003E\u003Cp\u003EAlso, there\u0027s no reason Squad \u0022should\u0022 add things to the game at all - if you have a dV readout, it should be up to you to find out what you can do with how much dV you\u0027re given. There\u0027s no clause stipulating that \u0022if Squad gives a dV readout, they must also include xyz\u0022.. the readout isn\u0027t telling you \u0022you can land and return from Duna with this\u0022, it\u0027s literally telling you \u0022you can change your velocity by this much\u0022. I don\u0027t see how that\u0027s in any way coming close to having an autopilot.\u003C/p\u003E\u003Cp\u003EAnd please don\u0027t bash MJ - it has many useful functions beyond the autopilot feature, including information readouts that A, any space program would have anyway and B, KER is missing.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-04-28T01:24:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EIt should because it\u0027s a vital thing, and no, it doesn\u0027t allow perfect flight. Many factors decide on that, not just delta-v capability.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree that there are indeed many factors, which is why a Dv meter by itself serves no real purpose, because on it\u0027s own, it tells you nothing without some frame of reference to know how much you need. As far as \u0022vital\u0022, far from it. Many players have managed to navigate the Kerbal universe without ever needing any Dv information.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-04-28T01:32:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003ESlippery Slope argument. Why have this game at all if the user is given what you propose? Build stuff, \u0022launch\u0022, \u0022land\u0022.. Being given the information to be able to perform orbital manoeuvres is \u003Cstrong\u003Enot \u003C/strong\u003Ethe same as the game performing those orbital manoeuvres for you. You still need to know that to reach orbit, you need 4.4 km/s dV, to get to the Mun you need about 800 m/s and to Minmus about 950. As you said, that means nothing to a new player/someone that doesn\u0027t yet understand orbital mechanics. Even if you had MJ installed, showing dV is meaningless if you don\u0027t know what to make of the information. So what\u0027s the harm in having it? How will it negatively impact your gameplay if a dV display was optional and/or unlockable? That way, people who don\u0027t want it can hide it and people who do want it can have it. \u003Cp\u003EAlso, there\u0027s no reason Squad \u0022should\u0022 add things to the game at all - if you have a dV readout, it should be up to you to find out what you can do with how much dV you\u0027re given. There\u0027s no clause stipulating that \u0022if Squad gives a dV readout, they must also include xyz\u0022.. the readout isn\u0027t telling you \u0022you can land and return from Duna with this\u0022, it\u0027s literally telling you \u0022you can change your velocity by this much\u0022. I don\u0027t see how that\u0027s in any way coming close to having an autopilot.\u003C/p\u003E\u003Cp\u003EAnd please don\u0027t bash MJ - it has many useful functions beyond the autopilot feature, including information readouts that A, any space program would have anyway and B, KER is missing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not bashing MJ at all. It is a wonderful piece of programming. Everyone here is saying the devs \u0022should\u0022 include something (Dv readout) so I was simply adding to that \u0022should\u0022 request. Why is it okay for you to say that this is information that ANY space program should already have (implying that KSP should have it) yet I cannot use that same argument stating that if they include a Dv radout, that they should include something to reference it to? Do you really have nothing better to support your argument other than that?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-28T01:32:28Z","Content":"\n\u003Cp\u003EI\u0027m guessing fairly confidently that no one has returned to orbit from Eve\u0027s sea level without doing a delta-V calculation. It is impossibly difficult to just overbuild or trial and error your way to that.\u003C/p\u003E\u003Cp\u003EAs for a dV meter being close to autopilot, I guess you should follow that slope the other way. Get rid of the altimeter, velocity readout, maneuver nodes and navball, because they\u0027re figuring out how to play the game for you, too.\u003C/p\u003E\n"}]}