{"TopicId":70350,"ForumId":25,"TopicTitle":"Stock SSTO reusable ship from eve","CreatedByName":"guitargun","CreatedById":66881,"CreatedDateTime":"2014-04-24T14:21:39Z","PageNum":1,"Articles":[{"CreatedByName":"guitargun","CreatedById":66881,"CreatedDateTime":"2014-04-24T14:21:39Z","Content":"\n\u003Cp\u003Eoke. I am doing carreer and I am planning to do a large mission to eve. my setup is a small core space craft that has 4 docking ports. but I need landers that can land on eve collect science and return to orbit, store the science and repeat. you only have to think about lifting up from eve, by this I mean that you ssto starts from the surface of eve and then needs to orbit or suborbit around eve. \u003C/p\u003E\u003Cp\u003EI am asking you to make a ship for this mission.\u003C/p\u003E\u003Cp\u003Ethe rules\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EIt has to be stock\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eit has to be reusable so a ssto is necessary\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1 kerbal space and can fly without a kerbal on board\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eenough space for at least the goo and minilab. the other instruments can but not necessary\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ea docking port on the front of the vehicle if possible. (normal docking port). if not remember to dock with the core space station it has a tight docking place\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethe docking place:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i58.tinypic.com/2d6w6k2.png\u0022 alt=\u00222d6w6k2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Egood luck\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T14:15:01Z\u0022 title=\u002204/25/2014 02:15  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by guitargun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-04-24T18:30:25Z","Content":"\n\u003Cp\u003EStock SSTO , EVE, manned lander?\u003C/p\u003E\u003Cp\u003ESure, no problem. I will have to start with ctrl-f12, gravity hack, though.\u003C/p\u003E\u003Cp\u003EI tell you what.\u003C/p\u003E\u003Cp\u003EYou show me your suckcessfool design, and i guarantee I can make it better. How about that?\u003C/p\u003E\n"},{"CreatedByName":"Bearsh","CreatedById":107549,"CreatedDateTime":"2014-04-24T18:35:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EStock SSTO , EVE, manned lander?\u003Cp\u003ESure, no problem. I will have to start with ctrl-f12, gravity hack, though.\u003C/p\u003E\u003Cp\u003EI tell you what.\u003C/p\u003E\u003Cp\u003EYou show me your suckcessfool design, and i guarantee I can make it better. How about that?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, this is going on my comment of the year award.\u003C/p\u003E\n"},{"CreatedByName":"iDan122","CreatedById":24439,"CreatedDateTime":"2014-04-24T19:27:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022guitargun\u0022 data-cite=\u0022guitargun\u0022\u003E\u003Cdiv\u003Eoke. I am doing carreer and I am planning to do a large mission to eve. my setup is a small core space craft that has 4 docking ports. but I need landers that can land on eve collect science and return to orbit, store the science and repeat. \u003Cp\u003EI am asking you to make a ship for this mission.\u003C/p\u003E\u003Cp\u003Ethe rules\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EIt has to be stock\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eit has to be reusable so a ssto is necessary\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1 kerbal space and can fly without a kerbal on board\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eenough space for at least the goo and minilab. the other instruments can but not necessary\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ea docking port on the front of the vehicle if possible. (normal docking port). if not remember to dock with the core space station it has a tight docking place\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethe docking place:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i58.tinypic.com/2d6w6k2.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i58.tinypic.com/2d6w6k2.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Egood luck\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay guys I\u0027l translate this into n00b for ya:\u003C/p\u003E\u003Cp\u003E\u0027You already know I just joined KSP. I am so badass I can go to Eve before being able to land on the Mun.\u003C/p\u003E\u003Cp\u003EBut I don\u0027t have time to build a frikin EVE SSTO so I\u0027ll make you guys make the impossible happen.\u0027\u003C/p\u003E\u003Cp\u003EP.S. No pun intended. This is more of a request, not a challenge.\u003C/p\u003E\n"},{"CreatedByName":"736","CreatedById":79609,"CreatedDateTime":"2014-04-24T22:39:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iDan122\u0022 data-cite=\u0022iDan122\u0022\u003E\u003Cdiv\u003EOkay guys I\u0027l translate this into n00b for ya:\u003Cp\u003E\u0027You already know I just joined KSP. I am so badass I can go to Eve before being able to land on the Mun.\u003C/p\u003E\u003Cp\u003EBut I don\u0027t have time to build a frikin EVE SSTO so I\u0027ll make you guys make the impossible happen.\u0027\u003C/p\u003E\u003Cp\u003EP.S. No pun intended. This is more of a request, not a challenge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehe is requesting, but he did not say anything about not getting to the mun\u003C/p\u003E\n"},{"CreatedByName":"guitargun","CreatedById":66881,"CreatedDateTime":"2014-04-24T23:43:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iDan122\u0022 data-cite=\u0022iDan122\u0022\u003E\u003Cdiv\u003EOkay guys I\u0027l translate this into n00b for ya:\u003Cp\u003E\u0027You already know I just joined KSP. I am so badass I can go to Eve before being able to land on the Mun.\u003C/p\u003E\u003Cp\u003EBut I don\u0027t have time to build a frikin EVE SSTO so I\u0027ll make you guys make the impossible happen.\u0027\u003C/p\u003E\u003Cp\u003EP.S. No pun intended. This is more of a request, not a challenge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you want to know. The mun, minus and kerning don\u0027t have science anymore for me. Is stripped al the science. The next thing if go to duna or eve and continue\u003C/p\u003E\n"},{"CreatedByName":"SpenSpaceCorp","CreatedById":98977,"CreatedDateTime":"2014-04-24T23:59:22Z","Content":"\n\u003Cp\u003EEve is \u0022the boss\u0022 of KSP and a landing and return from EVE is one of (if not THE) most challenging tasks one can undertake in the entirety of the game, let alone building an SSTO! landing on and returning from EVE with an SSTO seems to be near impossible, or just too difficult. The challenge has to be doable, and generally the OP should at least make an attempt when posting a challenge.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-25T00:14:46Z","Content":"\n\u003Cp\u003EAgreed, you should give some thought as to whether your challenge - or for that matter request, in which case there\u0027s another forum for that - is possible.\u003C/p\u003E\u003Cp\u003EAn EVE SSTO is impossible with any chemical rocket, unless you take off from the very highest ground, because the delta-V of a single stage is limited by the full mass:dry mass ratio of the tanks. It\u0027s impossible with a jet, because Eve\u0027s atmosphere doesn\u0027t have oxygen.\u003C/p\u003E\u003Cp\u003EThat leaves the options as:\u003C/p\u003E\u003Cp\u003EIon glider. Might work, but getting one off \u003Cem\u003EKerbin\u003C/em\u003E is hard enough, never mind Eve.\u003C/p\u003E\u003Cp\u003EGlitch-powered craft. Infiniglider, kraken drive, kerbal on a ladder, that kind of stuff. Probably will work, but not generally regarded as \u0022legit.\u0022\u003C/p\u003E\u003Cp\u003EChemical/nuclear rocket hybrid. I very much doubt this will work: carrying the extra engines, especially the nukes, will drop the mass ratio severely.\u003C/p\u003E\u003Cp\u003EOh, and Eve doesn\u0027t have biomes. There\u0027s just the land and the seas. Making a reusable lander less necessary.\u003C/p\u003E\n"},{"CreatedByName":"guitargun","CreatedById":66881,"CreatedDateTime":"2014-04-25T11:10:28Z","Content":"\n\u003Cp\u003ESorry if I confused you with things but the only fuel that will be used is from landing (can glide ofc) and take off to low orbit or suborbital flight that is long enough for a refuel ship to dock and continue the flight\u003C/p\u003E\n"},{"CreatedByName":"Pyranz","CreatedById":109052,"CreatedDateTime":"2014-04-25T12:51:52Z","Content":"\n\u003Cp\u003EI assume that by this you mean ssto from Eve\u0027s surface? It sounds very hard but I wouldn\u0027t write it off immediately... You\u0027d certainly have to do some clever ion plane - nerva combo, but maybe... Getting high lift is quite easy on Eve, and the setback of carrying a rocket engine would be offset by the fact that you have a rocket engine (hopefully).\u003C/p\u003E\n"},{"CreatedByName":"NichG","CreatedById":106921,"CreatedDateTime":"2014-04-25T13:05:30Z","Content":"\n\u003Cp\u003EMy tests with ion gliders suggest you might be able to get them up to 20km or so before they can\u0027t climb further, but it\u0027d be painfully slow (and the fact you can\u0027t drop the empty xenon containers would really hurt your rocket performace). Also, you\u0027re going at something like 70m/s at best at 20km, so you\u0027re going to need a rocket with Eve TWR significantly greater than 1 to actually get into orbit (air resistance there means you won\u0027t get significant vertical assistance from horizontal speed).\u003C/p\u003E\u003Cp\u003EWhat I mean by painfully slow is, it took about 2 in-game hours to get to 5km altitude.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-04-25T13:17:27Z","Content":"\n\u003Cp\u003EEVE SSTO is just impossible with stock parts. Our smart math community guys here already calculated and proofed that. Also there are plenty people out there that tried already and proofed that also impossible.\u003C/p\u003E\u003Cp\u003EAnyone saying it is possible please go on and build such a craft, we are very anxious to see your working results. lol\u003C/p\u003E\u003Cp\u003EThis thread should be closed.\u003C/p\u003E\n"},{"CreatedByName":"Pyranz","CreatedById":109052,"CreatedDateTime":"2014-04-25T13:58:12Z","Content":"\n\u003Cp\u003EThe \u0022smart math guys\u0022 can only work out the dv of something they already know the figures of. The most common way to get off eve is with aerospikes, because of their atmospheric efficiency. Nerva engines tend to get written off because of the low ttw and isp asl. If you use a lightweight engine to get your initial speed up, use ions to sustain a gliding climb, and then nervas when you can\u0027t go higher, meaning you\u0027ll be largely out of the atmosphere and they\u0027ll have most of their max efficiency, and hopefully then continue to orbit.\u003C/p\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2014-04-25T14:56:00Z","Content":"\n\u003Cp\u003EThe \u0022smart math guys\u0022 probably would have thought of that possibility and calculated that off as well. Almost all Eve landers are too small for Nervas to be the best engine after they have dropped so many stages and gotten to the altitude where Nervas are efficient. Though I haven\u0027t seen anyone do the calculations with the new ions. I\u0027m going to guess it\u0027s still impossible. If you look at pretty much any low-mass Eve lander it\u0027s just an asparagus pancake of 48-7s.\u003C/p\u003E\u003Cp\u003EAre you above using infiniglide? Even though .23 made it less effective, it would still be possible to make one that can get high and fast enough for rockets to circularize an orbit.\u003C/p\u003E\u003Cp\u003EEdit: or Kraken drive?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T15:32:26Z\u0022 title=\u002204/25/2014 03:32  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by sdj64\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-04-25T15:30:29Z","Content":"\n\u003Cp\u003EAnother Eve SSTO thread? As others have said, it\u0027s not possible with the stock game, without altering the planet\u0027s conditions, or altering the parts.\u003C/p\u003E\u003Cp\u003EUnless...\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/91IJd\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThough I didn\u0027t reuse it, with care I should be able to land again. No docking port though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-26T03:18:01Z\u0022 title=\u002204/26/2014 03:18  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 26, 2014\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NichG","CreatedById":106921,"CreatedDateTime":"2014-04-25T15:31:37Z","Content":"\n\u003Cp\u003ESo messing around with Hyperedit, I\u0027ve confirmed that the following at least is theoretically possible - an \u0027atmosphere dipper\u0027 that drops down to 30km and ~1km/sec, and then makes it back to a sub-orbital flight that leaves the atmosphere for about 4 minutes.\u003C/p\u003E\u003Cp\u003EThe NERVAs aren\u0027t actually great for this because you still need a good TWR in order to actually make it up from the layers where atmospheric drag is killing your velocity. I was only able to recover to about 50km altitude with the NERVAs, but with the 48-7S engines I was about to get an apoapsis of about 140km. The design I ended up with was two FL-T800 tanks, six of the 48-7S engines in a VTOL configuration, and eight of the swept wings inclined at a 45 degree angle from prograde. The gimmick is that you can point prograde and thrust vertically, but still get significant lift from the wings due to your 1km/sec residual speed.\u003C/p\u003E\u003Cp\u003ESo in principle, if you could ion-glide up to 30km, and if during the ion glider phase you could attain a horizontal speed of around 1km/sec, and if on top of that you had another craft intercept on a sub-orbital flight to capture the ship as it left the atmosphere, then you could actually make this work. The big problem is getting the ion glider phase to give you a 1km/sec horizontal speed in that part of the atmosphere - I can\u0027t see any way to pull that off. There might be a more efficient engine combo, or maybe you can get away with using more wings or something, but its looking somewhat unlikely that this will be possible even with an ion glider.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-04-25T15:38:44Z","Content":"\n\u003Cp\u003EObviously, hacks, cracks, cheats, debug menu, kraken and infiniglide can make a try at this.\u003C/p\u003E\u003Cp\u003EHeck, even fotoshop would do, in a pinch.\u003C/p\u003E\u003Cp\u003EBut the original poster\u0027s use of the limitation \u0022It has to be stock\u0022 also implies no cheats or reality-bending bug exploitation..\u003C/p\u003E\u003Cp\u003EWe have already, mathematically, proven that a pure reaction rocket with ISP 800 or less cannot orbit from sealevel EVE in a single stage, even with infinite mass. The mass fraction of fuel tanks is just too low.\u003C/p\u003E\u003Cp\u003EIon *does* give enough ISP, but rather ridiculous TWR.\u003C/p\u003E\u003Cp\u003EI think that even with the best ion-glider/rocket combo, we end up almost a factor 10 short of either delta-v or TWR.\u003C/p\u003E\u003Cp\u003EWhat\u0027s the possibility for a fuelless aerodynamic lifter, up to fringes of atmosphere? Something like reaction-wheel powered helicopter?\u003C/p\u003E\u003Cp\u003EMy own experiments in this line have been.... ghastly unstabile.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-04-25T15:43:21Z","Content":"\n\u003Cp\u003EGo on and build that craft if u think u can do it, rofl.\u003C/p\u003E\u003Cp\u003EInfiniglide, krakendrive, bugusing and so on are considered cheating. Every idiot can bring an SSTO for every planet into orbit while cheating, why are u even bringing up that?\u003C/p\u003E\u003Cp\u003EI think by now it is fact that an SSTO from Eve is not possible and i say again the ones who do not think so please make one and try out before making useless posts somewhere.\u003C/p\u003E\u003Cp\u003EAnd for the new ions, they are still not producing enough thrust to be of any use when chewing through the thick atmosphere on unmoded Eve also btw what makes you think that you can lift a nerva engine with ions from the surface of Eve??? All this posts are just so lol, people writing nonsense without ever trying it.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-04-25T16:19:20Z","Content":"\n\u003Cp\u003EThey once said landing on the moon was impossible. Nothing is impossible in KSP--you just need the right amount of Delta-V. I bet the SLS parts could do it, if you could find a way to use spaceplane parts with them.\u003C/p\u003E\u003Cp\u003E*walks off*\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2014-04-25T16:46:01Z","Content":"\n\u003Cp\u003EThe day that man said moon landings were impossible was in the early 20th century and before.\u003C/p\u003E\u003Cp\u003EThey didn\u0027t have liquid rockets back then.\u003C/p\u003E\u003Cp\u003EThe Stock parts of KSP doesn\u0027t have warp drives or naquadah sublight engines. So the comparison is rather invalid to me.\u003C/p\u003E\u003Cp\u003EWhen we get any of those engines in stock KSP perhaps then we can say \u0022but a long long time ago we thought we could never land on eve\u0027\u003C/p\u003E\u003Cp\u003EBtw, Ion engines are already an exploit from a realistic point of view.\u003C/p\u003E\u003Cp\u003EReal world Ion engines do nothing more then to add small course corrections to small space probes or orbiting sattelites) over the course of years. The fact that it has enough TWR to lift anything from the ground means that KSP ion engines are either 30.000 AD ion engines. Or not really ion engines.\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2014-04-25T18:25:51Z","Content":"\n\u003Cp\u003EI believe the requirement of Delta-V for an Eve departure is... 8000 km/s from the highest altitude point (7 km alt.), and it increases by a scary function for every additional meter below it.\u003C/p\u003E\u003Cp\u003EWith generous rounding, that\u0027s double the Delta-V of an SSTO from Kerbin, not even mentioning the higher gravity.\u003C/p\u003E\u003Cp\u003EI\u0027ve been around for a few years, and last I heard, it\u0027s physically impossible within the part constraints of the game.\u003C/p\u003E\n"},{"CreatedByName":"guitargun","CreatedById":66881,"CreatedDateTime":"2014-04-25T18:40:03Z","Content":"\n\u003Cp\u003EOK. I made a few designs with both the ion and aerospike and without. But the latest heavy rockets not. With the design I made I came around the 12000 before I ran out of fuel. I haven\u0027t tested te ion engines that much, still working out the electric charge and xeon tank with that. Also the amount of engines I need. If you use mechjeb and attach the ion engines alone do they need that indicator above 1?\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-04-25T19:31:33Z","Content":"\n\u003Cp\u003EAs I said, the SLS parts are so flipping huge and (some would say) OP that they can probably do it. Someone has got to try it. I don\u0027t even care if it\u0027s a spaceplane, I just know that it can be done.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-04-25T21:38:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EAs I said, the SLS parts are so flipping huge and (some would say) OP that they can probably do it. Someone has got to try it. I don\u0027t even care if it\u0027s a spaceplane, I just know that it can be done.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf u know it can be done why should then someone else try? Try it by yourself, troll.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-04-25T21:43:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EIf u know it can be done why should then someone else try? Try it by yourself, troll.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProblem: You have to get it there first. I do not have hyeredit.\u003C/p\u003E\n"}]}