{"TopicId":70423,"ForumId":32,"TopicTitle":"Confess your KSP sins","CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-25T00:30:38Z","PageNum":11,"Articles":[{"CreatedByName":"Victus","CreatedById":104706,"CreatedDateTime":"2014-05-01T21:52:37Z","Content":"\n\u003Cp\u003EI used infinite fuel to finish my Ike mission, my fuel station took me three days and barely worked \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"User Unrelated","CreatedById":74021,"CreatedDateTime":"2014-05-01T21:56:09Z","Content":"\n\u003Cp\u003Ei killed Jeb on my first lunch... quite often.\u003C/p\u003E\u003Cp\u003EGetting a high apoapsis on tech-tier 0 with FAR makes it pretty difficult to NOT kill kerbonaughts.\u003C/p\u003E\u003Cp\u003Ei could probably revamp my design and flight path to enter at a shallower angle, but I am always too lazy.\u003C/p\u003E\u003Cp\u003Epod. solid booster. parachute.\u003C/p\u003E\u003Cp\u003EGO.\u003C/p\u003E\u003Cp\u003EI just need the science to unlock the first tier...\u003C/p\u003E\u003Cp\u003EJeb\u0027ll be back, he always comes back.\u003C/p\u003E\n"},{"CreatedByName":"Bigun","CreatedById":27438,"CreatedDateTime":"2014-05-02T18:08:42Z","Content":"\n\u003Cp\u003EIs using the space center to delete debris a sin?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-02T18:18:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bigun\u0022 data-cite=\u0022Bigun\u0022\u003E\u003Cdiv\u003EIs using the space center to delete debris a sin?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly sinful because it wastes time. If you\u0027re going to do that, you might as well go into settings and move the debris slider to zero, the game will automatically delete it for you.\u003C/p\u003E\n"},{"CreatedByName":"Noname117","CreatedById":53624,"CreatedDateTime":"2014-05-02T18:42:13Z","Content":"\n\u003Cp\u003EI never finish any projects\u003C/p\u003E\u003Cp\u003EAnd have unintentionally slowed down in-game time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fingal","CreatedById":109326,"CreatedDateTime":"2014-05-04T00:45:30Z","Content":"\n\u003Cp\u003EI\u0027ve left Donmon Kerman on the surface of Eve for over 200 days. And when I say he\u0027s on the surface I mean he\u0027s on the surface. I forgot to put a ladder on his lander and his jetpack isn\u0027t powerful enough to lift him up to the hatch.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2014-05-04T00:52:25Z","Content":"\n\u003Cp\u003EI kill Kerbals whose names suck, once I accidentally launched a rocket straight into Minimus, with Kerbals on it.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2014-05-04T02:17:39Z","Content":"\n\u003Cp\u003EWhile\u0027s figuring out why my encounter nodes were not acting the way I planned (on the way to Duna) I decided to just wait until SoI change to figure it out. I had never been to Duna yet...\u003C/p\u003E\u003Cp\u003EWell, Ike and I got to know each other... carnally.\u003C/p\u003E\u003Cp\u003EI\u0027ve not been back since! (been to occupied setting up a local RT network)\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-05-04T13:53:09Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EI am far too afraid to send any manned missions out of Kerbin\u0027s SoI.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELast time I did an interplanetary burn was for a rover mission to Duna. Crashed due to underestimated fuel requirements.\u003C/p\u003E\n"},{"CreatedByName":"0Kev","CreatedById":69511,"CreatedDateTime":"2014-05-04T15:22:44Z","Content":"\n\u003Cp\u003E\u0022I know I put solar panels and more RCS tanks on this thing before launch!\u0022 (alt-F12)\u003C/p\u003E\u003Cp\u003ESometimes I justify \u0022saving time\u0022 with alt-F12 and/or hyperedit, rather than reverting or re-doing the mission because of:\u003C/p\u003E\u003Cp\u003EPreviously lost progress due to crashes or bugs.\u003C/p\u003E\u003Cp\u003E\u0022A real space ship would never have been built and launched without RCS tanks (or whichever part).\u0022\u003C/p\u003E\u003Cp\u003E\u0022The only reason this didn\u0027t work is the limitations of the in-game tools.\u0022\u003C/p\u003E\u003Cp\u003EYesterday I built a science truck (omniwheels) for getting around to some local science experiments on Kerbin. For each time it blew up ( \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E ), I would hyperedit the next one back to that spot and continue. Who woulda thought a large truck might have trouble surviving at 80 m/s while off-roading.\u003C/p\u003E\u003Cp\u003EI have never (yet) legitimately flew a ship to: Eelo, Jool, Moho, Eve, Dres; nor any moons aside from Kerbin\u0027s.\u003C/p\u003E\u003Cp\u003EI cannot build decent ships without a Kerbal Engineering chip. I either have way too much or way too little Delta-V.\u003C/p\u003E\u003Cp\u003EWithout Scott Manley videos, I might never have achieved orbit.\u003C/p\u003E\u003Cp\u003EAlso, I may sometimes edit parts if they are not strong enough for my \u003Cspan style=\u0022font-size:8px;\u0022\u003E(ab)\u003C/span\u003Euse.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-04T16:49:06Z\u0022 title=\u002205/04/2014 04:49  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 4, 2014\u003C/time\u003E by 0Kev\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2014-05-30T22:39:58Z","Content":"\n\u003Cp\u003EReally? How can you have too much Delta-V? Seriously, though, you can never have too much. You\u0027ll always underestimate your requirements.\u003C/p\u003E\u003Cp\u003EOkay, now me.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI\u0027ve never successfully landed on any planet other than Kerbin. \u003C/strong\u003Eand even if I could, \u003Cstrong\u003EI can\u0027t fly without using MechJeb autopilot. \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI\u0027ve never built a space-capable spaceplane. \u003C/strong\u003EI\u0027m certain I might have but could never get it to orbit, but I\u0027ve never even flown a stock plane to orbit.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2014-05-30T22:50:22Z","Content":"\n\u003Cp\u003EI can spend hours, days, even weeks and months in case of my Eve lander on designing ships until they meet all my personal criteria and I will rigorously field test them using hyperedit until I am absolutely certain the craft is up to its task.\u003C/p\u003E\u003Cp\u003EAnd then I won\u0027t actually fly the mission.\u003C/p\u003E\u003Cp\u003EThe reasoning being: \u0022I know it works and my tech tree is maxed out. There\u0027s no point wasting time going there\u0022.\u003C/p\u003E\u003Cp\u003EMy mind works in weird ways.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-30T23:19:45Z","Content":"\n\u003Cp\u003EWhen building launchers I typically target 4750 m/s delta-V with the intended payload. If I\u0027ve got a low launch TWR, I prefer 5000. This compensates for my naff flying.\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2014-05-30T23:25:37Z","Content":"\n\u003Cp\u003EI limit my TWR to 1.2 down because it looks cool.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-30T23:33:40Z","Content":"\n\u003Cp\u003EForgive me Jeb, it\u0027s been a month since my last confession.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI\u0027m bad at EVA.\u003C/strong\u003E EVA activities involving jet packs inevitably result in me cursing the hapless kerbal and raising inflammatory questions about his parentage. I cover my ships in ladders so my kerbals can hang on like scared kids at the pool.\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-05-30T23:40:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EI\u0027m bad at EVA.\u003C/strong\u003E EVA activities involving jet packs inevitably result in me cursing the hapless kerbal and raising inflammatory questions about his parentage. I cover my ships in ladders so my kerbals can hang on like scared kids at the pool.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo usually I am fine with EVA controls. As long as my victim is pointing on screen with head up, feet down, tummy towards target, I can pilot him through a dime-sized hole. But sometimes, and I don\u0027t quite understand why, I wind up with him pointing headfirst at the target. Then I have to a) totally revise which keys I am using to control the poor slob, and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E typically slam him head-first into the target at a non-negligible velocity. What is the word for that? \u0022Shipobrake?\u0022\u003C/p\u003E\u003Cp\u003E(edit: Heh, \u0022Shipobrake\u0022. I might make that my new user name.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-30T23:43:47Z\u0022 title=\u002205/30/2014 11:43  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 30, 2014\u003C/time\u003E by James_Eh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DoToH","CreatedById":68428,"CreatedDateTime":"2014-05-31T00:02:35Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E I\u0027ve only built ONE functional plane.\u003C/strong\u003E I have downloaded FAR, but never installed it. FAR scares me.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E I used LV-N\u0027s only twice.\u003C/strong\u003E Last time was my Moho mission. Wasted more than 2000 m/s of dV in correction burns because of the 15 minute transfer burn was done in one go. Rescue mission was a massive 5x KR2-L 1200 ton ship. I will never use LV-N\u0027s again. High TWR is close friend to MOAR BOOSTERS law.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E I use time warp to stop rotation.\u003C/strong\u003E Very common sin...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E I don\u0027t use asparagus.\u003C/strong\u003E I prefer to add some tanks, boosters and stages rather than fuel lines. The only one complaining is my processor due to part count rising. \u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E I don\u0027t like Mechjeb and never tell people not to use it!!!.\u003C/strong\u003E Yes, I know. I\u0027m insane.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E I hacked gravity once\u003C/strong\u003E and forgot to switch gravity back when I got to LKO. My next launch (to MÃƒÂ¼n) reached Kerbin escape velocity at about 10.000 m. over launchpad. Switched to map view to begin my gravity turn and ..... WTF!!!\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E I installed KAS to attach forgotten RCS boosters and RCS tanks to my first Moho lander while in LKO. Too lazy to rebuild and refuel the interplanetary ship.\u003C/strong\u003E It never got to Moho anyway, but RCS helped to dock with the rescue mission ship after I ran out of fuel mid-transfer.\u003C/p\u003E\n"},{"CreatedByName":"Shna_na","CreatedById":14950,"CreatedDateTime":"2014-05-31T01:03:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022James_Eh\u0022 data-cite=\u0022James_Eh\u0022\u003E\u003Cdiv\u003E-snip-\u003Cp\u003Eslam him head-first into the target at a non-negligible velocity. What is the word for that? \u0022Shipobrake?\u0022\u003C/p\u003E\u003Cp\u003E-snip-\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe term is lithobraking: using the lithosphere of a body in order to slow your velocity. As part of my confession, I\u0027d like to state that I lithobrake more than I should, landing at ~7m/s. I know, the poor kerbals cri evrytim.\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-05-31T02:11:46Z","Content":"\n\u003Cp\u003EIn my current save, I put Jeb Bill and Bob in a hitchhiker container that I later made into a crappy fueling station and left them there. Why? To avoid the whole \u0022omg Jeb is so awesome\u0022 thing from my last save. I don\u0027t know, it just started to rub me weird. It also makes the game more interesting knowing that if my \u0022best pilot\u0022 gets killed he won\u0027t immediately respawn for the next mission.\u003C/p\u003E\u003Cp\u003EI have killed multiple Kerbals with the \u0022quickloading causes them to violently fly off of ladders and break parachutes\u0022 bug. \u003C/p\u003E\u003Cp\u003EI leave tons of debris in stable orbit of Kerbin. Usually empty orange tanks. \u003C/p\u003E\u003Cp\u003EIn my last save I purposely stranded a Kerbal on Duna and Eve. A rescue mission was sent for the one on Duna... 3 Kerbin years later. \u003C/p\u003E\u003Cp\u003EI use Mechjeb on a lot of my ships, not because I can\u0027t fly, but because I get frustrated with turning large ships and doing long (over 2.5ish minute) burns. Mostly I just use smart a.s.s. and the execute next maneuver button. \u003C/p\u003E\u003Cp\u003EI don\u0027t use \u0022true asparagus\u0022 because on larger applications I always screw it up. Instead I use something similar that usually involves dropping concentric circles or x-patterns of center feeding tanks.\u003C/p\u003E\n"},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2014-05-31T02:34:00Z","Content":"\n\u003Cp\u003EI admit to using Jebediah\u0027s head for lithobreaking a glider. I justify my actions by referring to the successful landing of said craft.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-31T03:26:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duke23\u0022 data-cite=\u0022Duke23\u0022\u003E\u003Cdiv\u003EI don\u0027t use \u0022true asparagus\u0022 because on larger applications I always screw it up. Instead I use something similar that usually involves dropping concentric circles or x-patterns of center feeding tanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnion staging, I believe that\u0027s called.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-05-31T04:38:30Z","Content":"\n\u003Cp\u003EI\u0027ve never returned anything from Eve\u0027s surface.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThough I\u0027m hoping to change that soon...\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-05-31T04:42:25Z","Content":"\n\u003Cp\u003EI have never purposefully killed any kerbals.\u003C/p\u003E\n"},{"CreatedByName":"Harry Mckay","CreatedById":111970,"CreatedDateTime":"2014-05-31T04:56:45Z","Content":"\n\u003Cp\u003EI\u0027ve never learned to use maneuver nodes. I do everything by hand/eyeball. Horribly inefficient, I know.\u003C/p\u003E\u003Cp\u003EI\u0027ve designed ships/stations with docking ports, but have never actually attempted a docking maneuver.\u003C/p\u003E\u003Cp\u003EIn order to bump up the IQ average in my Kerbanaut list, I built a Kotany Kay (I swear I\u0027m not a Trekkie!) and exiled the 4 dumbest to a never-ending orbit around Kerbol.\u003C/p\u003E\u003Cp\u003EI\u0027ve landed many, many missions on the Mun, but only 2 on Minmus, and nothing on any other celestial body.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2014-05-31T05:58:48Z","Content":"\n\u003Cp\u003EWhile I\u0027m a good spaceship designer, planner, and navigator, my actual piloting skills leave something to be desired.\u003C/p\u003E\u003Cp\u003EI can\u0027t remember the last time anyone but Jeb got off the ground in any of my career saves. I run a one-astronaut space program, it seems. Which isn\u0027t to say that I\u0027ve never killed Jeb. That\u0027s what F9 is for. It does, however, mean that I\u0027ve never stranded him (except by crashing, which also gets an F9).\u003C/p\u003E\u003Cp\u003EI can build spaceplanes that can reach orbit and return, some have even done flybys of the Mun, but not one has ever successfully taken cargo to LKO. Oh, I airhog a bit too, but not to extremes. I can get there without it, it just doesn\u0027t feel as fun.\u003C/p\u003E\u003Cp\u003EMy first trip to Eeloo, back in 0.18.2, less than a month after I started playing, took something over 60 years AFTER I reached the right orbital height because I botched my transfer, and while I was able to find an intercept, it was several very long orbits later. Only my OCD managed to keep me going through 6 hours of max timewarp looking for a potential encounter.\u003C/p\u003E\u003Cp\u003EI started playing KSP just about when maneuver nodes were added, so I have no excuse, I can\u0027t claim to have been doing it the way I already knew how, but I still didn\u0027t use them for the first two or three months I played. Oh, that Eeloo mission would have gone so much smoother if I had taken the time to figure out maneuver nodes.\u003C/p\u003E\u003Cp\u003EOnce while working on a more efficient method to rendezvous than the \u0022kill relative velocity/thrust towards target/repeat until there\u0022 method, I managed to slam into the craft I was trying to dock with at somewhere over 100 m/s because I was paying more attention to my target-relative prograde vector than my distance to the target. \u003C/p\u003E\u003Cp\u003EA few of the other confessions here sound very familiar as well. Asparagus staging (at least I\u0027ve stopped doing the two, three, and even sometimes four layer deep monstrosities), forgetting solar panels, etc. :-)\u003C/p\u003E\n"}]}