{"TopicId":70423,"ForumId":32,"TopicTitle":"Confess your KSP sins","CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-25T00:30:38Z","PageNum":24,"Articles":[{"CreatedByName":"RikSolo","CreatedById":126400,"CreatedDateTime":"2014-10-29T01:47:35Z","Content":"\n\u003Cp\u003Ei cant build spaceplanes, i cant fly them either.\u003C/p\u003E\u003Cp\u003Ei dont ever name anything or plant flags anywhere.\u003C/p\u003E\u003Cp\u003Ei always seem t figure out the most inefficient way to do things.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-10-29T17:57:21Z","Content":"\n\u003Cp\u003EWhen the 0.25 came out, I downloaded the bomb mod that appear in \u0022modding monday\u0022.\u003C/p\u003E\u003Cp\u003EI was making plane with HEAVY load with, and because it was new to me(the part about having a small but heavy plane) there was a lot of crashes.\u003C/p\u003E\u003Cp\u003EAnd in \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Emost\u003C/span\u003E nearly every crashes, the pilots were dying.\u003C/p\u003E\u003Cp\u003EMy sin: not using the new probe core for the test\u003C/p\u003E\u003Cp\u003Eanother one: I wasn\u0027t bothered by the dead kerbal.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2014-10-29T18:00:07Z","Content":"\n\u003Cp\u003EI once made a bomber plane which used the bomb as a major structural element. Upon dropping it, it spiralled out of control.\u003C/p\u003E\u003Cp\u003EI can\u0027t land on the runway.\u003C/p\u003E\u003Cp\u003EI\u0027ve never returned a Kerbal from somewhere outside the Kerbin system.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-10-29T18:07:01Z","Content":"\n\u003Cp\u003EI once send a kerbal to Duna in the smallest command pod.\u003C/p\u003E\u003Cp\u003EHe spent a LOT of time in that small pod(just make a mission to Duna and you will see);even worse, since the beginning of the mission I perfectly knew he would have no chances of coming back:the \u0022lander\u0022 just consisting of the pod and a chute...\u003C/p\u003E\u003Cp\u003EHe still in that pod(simply because new updates came out and I didn\u0027t bothered playing \u0022old\u0022 version for saving the kerbal(plus, my landings on Duna aren\u0027t precise enough for a rescue).\u003C/p\u003E\n"},{"CreatedByName":"daskraut","CreatedById":127661,"CreatedDateTime":"2014-10-29T20:57:07Z","Content":"\n\u003Cp\u003Ei confess... yes, i once used mechjeb.\u003C/p\u003E\u003Cp\u003Eand i confess... yes, i once used gravity hack.\u003C/p\u003E\u003Cp\u003Emea culpa, mea maxima culpa!\u003C/p\u003E\n"},{"CreatedByName":"PCGeek","CreatedById":73051,"CreatedDateTime":"2014-10-29T22:05:02Z","Content":"\n\u003Cp\u003EI have a laptop that I have to use for school. Nothing amazing but it has 0.18 still on it (before i got this pc!). I would play KSP at the back of the languages class (what else am I meant to have done?) and always used mechjeb because I can\u0027t be asked to pilot by hand. With the later versions, using it on rather awful hardware.\u003C/p\u003E\u003Cp\u003EOh, I lost\\killed\\intentionally murdered Jeb in all my saves.\u003C/p\u003E\n"},{"CreatedByName":"PCGeek","CreatedById":73051,"CreatedDateTime":"2014-10-29T22:14:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MoeslyArmlis\u0022 data-cite=\u0022MoeslyArmlis\u0022\u003E\u003Cdiv\u003EAfter more than a week and all buildings are still intact. Some reason I feel that I did something wrong.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell they lasted... You still can build the building destroyer... I guess...\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2014-10-30T01:48:11Z","Content":"\n\u003Cp\u003EI finally have nothing to confess, now that I play hard mode and only use reputation -\u0026gt; science and reputation -\u0026gt; funds.\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-10-30T03:31:58Z","Content":"\n\u003Cp\u003EBless me Father, for I have sinned,I have put Jeb in the ground on numerous occasions! Penance?\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2014-10-30T15:58:08Z","Content":"\n\u003Cp\u003EI edit my save games a lot.\u003C/p\u003E\u003Cp\u003EI Edit it when TAC lifesupport decides that I have run out of a resource when I know full well that the recyclers are generating more than the kerbals are using.Recently I have just started setting the available space for oxygen and water to be really large and just periodically using hyperedit to fill them up fully.\u003C/p\u003E\u003Cp\u003EMost recently I edited a ship to change where its antenna was pointing when I found that Kerbin at opposition was a couple of % to far away from my probe for me to execute a maneouvre. I repointed the antenna at a cratf that luckily had 2 high power antennae and was half way between.\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2014-10-30T17:54:56Z","Content":"\n\u003Cp\u003EI always try to acheive as many contracts as is humanly possible in a single flight.\u003C/p\u003E\n"},{"CreatedByName":"toddd240","CreatedById":127589,"CreatedDateTime":"2014-10-30T20:46:28Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EOn my first Mun landing I promised myself I would accept whatever happen.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAbout 12 Save/Loads later I finally landed on a 25 degree incline and I nearly cried....It was a happy moment but I felt dirty about it later.\u003C/p\u003E\u003Cp\u003EThe screen shot I got from it was spectacular though.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2014-10-30T20:52:40Z","Content":"\n\u003Cp\u003EI launch a different flight for every single \u0022science from space around kerbin\u0022 contract.\u003C/p\u003E\u003Cp\u003EMy subassemblies folder is empty.\u003C/p\u003E\n"},{"CreatedByName":"scotty93","CreatedById":34102,"CreatedDateTime":"2014-10-30T23:56:25Z","Content":"\n\u003Cp\u003EI can\u0027t build launch vehicles very well, I usually have to refuel once I\u0027m in orbit.\u003C/p\u003E\u003Cp\u003EI exclusively use part clipping in the editors. I don\u0027t edit without it.\u003C/p\u003E\u003Cp\u003EI\u0027m 9 parts plane engineer and 1 part astronaut, I probably won\u0027t go to space today.\u003C/p\u003E\u003Cp\u003EI rarely use solid rocket boosters.\u003C/p\u003E\u003Cp\u003EI have only ever made a single one way probe trip to Duna without refueling. I forgot to add a parachute. I have never traveled to any other planet without cheats.\u003C/p\u003E\u003Cp\u003EI don\u0027t quick save.\u003C/p\u003E\u003Cp\u003EI like making military things in KSP.\u003C/p\u003E\u003Cp\u003EI landed on the Mun in my first try, but the engine fell off (this was before we had lander legs) and Jeb remains there to this day.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-31T00:04:50Z\u0022 title=\u002210/31/2014 12:04  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 31, 2014\u003C/time\u003E by scotty93\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-10-31T10:20:46Z","Content":"\n\u003Cp\u003Ei was already pretty good at space flight before ksp thanks to orbiter. ksp just made it more fun.\u003C/p\u003E\n"},{"CreatedByName":"Umakhi","CreatedById":128045,"CreatedDateTime":"2014-11-02T16:13:04Z","Content":"\n\u003Cp\u003EForgetting to quicksave IS an issue. Hyperedit helps me alot, tough i make everything to work without it.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-11-03T20:19:17Z","Content":"\n\u003Cp\u003EMost of my highly unstable test aircraft that probably are impossible to land within the length of the runway are flown manned with no escape system.\u003C/p\u003E\u003Cp\u003EI tested a 660-Kerbal spaceplane loaded completely full. When it exploded over the ocean, I clicked space center.\u003C/p\u003E\u003Cp\u003EI build SSTOs that I know have not the slightest possibility of landing safely, and have only a fractional chance of getting the whole thing to orbit.\u003C/p\u003E\u003Cp\u003EI occasionally exploit challenges with glitch craft unless the rules state otherwise.\u003C/p\u003E\u003Cp\u003EI have never successfully returned a Kerbal from the Joolian system, despite having made dozens of craft capable of such a feet.\u003C/p\u003E\u003Cp\u003EI intentionally leave large amounts of debris in orbit as \u0022target practice.\u0022 I even once tried to make a Kessler bomb, a satellite that explodes into 511 pieces of debris in a retrograde orbit.\u003C/p\u003E\u003Cp\u003EI\u0027ve abused time warp by switching to other objects to allow SSTOs above 23 km to reach apoapsis.\u003C/p\u003E\u003Cp\u003EI\u0027ve flown a plane with 3790 Kerbals onboard. It didn\u0027t fly very long. Nonetheless, it killed well over 90% of the passengers, causing more death than any aircraft incident in IRL history.\u003C/p\u003E\u003Cp\u003EI\u0027ve spent an inordinate amount of time trying to crash a manned supersonic jet into a manned low-altitude space station.\u003C/p\u003E\n"},{"CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2014-11-03T20:39:56Z","Content":"\n\u003Cp\u003ECan I have that 3790 passenger plane?\u003C/p\u003E\n"},{"CreatedByName":"Mister Kerman","CreatedById":166398,"CreatedDateTime":"2014-11-04T05:05:25Z","Content":"\n\u003Cp\u003EI haven\u0027t played KSP except to show it to someone since before the latest update and forgot all the controls!!\u003C/p\u003E\n"},{"CreatedByName":"temporalExile","CreatedById":127675,"CreatedDateTime":"2014-11-04T16:24:14Z","Content":"\n\u003Cp\u003EI have never docked two spacecraft together, and I always keep part clipping on (Everything must be beautiful!)\u003C/p\u003E\n"},{"CreatedByName":"DanLarn","CreatedById":124467,"CreatedDateTime":"2014-11-05T02:25:12Z","Content":"\n\u003Cp\u003EMy sins (thus far) are:\u003C/p\u003E\u003Cp\u003E1) I don\u0027t often use Kerbals, most of my missions are unmanned and designed for SCIENCE! I have started mapping Kerbin, Mun and Minmus with Satellites and I have got a little way into creating an effective Kerbin GPS network (a few rover missions are in preliminary phases of testing).\u003C/p\u003E\u003Cp\u003E2) I use MechJeb for everything (except landings) and I justify it to myself thusly: this is how it is done by less successful agencies like NASA!\u003C/p\u003E\u003Cp\u003E3) Up until my current save, I have never returned to a previous one.\u003C/p\u003E\n"},{"CreatedByName":"KevinW42","CreatedById":66949,"CreatedDateTime":"2014-11-05T04:21:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Ei was already pretty good at space flight before ksp thanks to orbiter. ksp just made it more fun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn that vein, I\u0027ll confess one of my Orbiter sins. I always did interplanetary transfers by escaping Earth, going into a circular solar orbit, and \u003Cem\u003Ethen\u003C/em\u003E initiating the Hohmann transfer.\u003C/p\u003E\n"},{"CreatedByName":"Monkthespy","CreatedById":7644,"CreatedDateTime":"2014-11-05T06:22:09Z","Content":"\n\u003Cp\u003EI have FAR installed. For some inexplicable reason, I take one of my maneuverable designs (usually an F/A-18 inspired design), empty most of its fuel, turn infinite fuel on, and then put the liquid fuel RCS thrusters. It becomes super maneuverable, and its hilarious fun to do aerobatics in it. I can make it even better by putting engines that put the TWR above one, so I can do VTOL. I find this cheating so I consider it a sin. Sometimes, I put a bunch of thrusters underneath the aircraft, and use the k key to lift it off the ground like a VTOL.\u003C/p\u003E\u003Cp\u003EI use infinite fuel to test VTOLs.\u003C/p\u003E\u003Cp\u003EI often get so lazy I don\u0027t install mods I should really have when I start a new install. \u003C/p\u003E\u003Cp\u003EAlso, like many other people, I keep part clipping on.\u003C/p\u003E\u003Cp\u003EEDIT: I don\u0027t mean FAR is a sin btw, I meant that as \u0022Why do I do this hilariously maneuverable aircraft in FAR, when stock can actually do this?\u0022\u003C/p\u003E\n"},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2014-11-05T06:42:43Z","Content":"\n\u003Cp\u003EI\u0027ve deorbited a space station on top of the R\u0026amp;D. Intentionally and with mechjeb set to 150m/s touchdown speed. Just to see the fireworks.\u003C/p\u003E\n"},{"CreatedByName":"heng","CreatedById":126869,"CreatedDateTime":"2014-11-05T15:57:35Z","Content":"\n\u003Cp\u003ELaunched three Kerbals on a daring tour to Jool. They had plenty of legroom in the hitchhiker storage, four lander modules, several small disposable science probes... and just about enough fuel to either return home or visit one moon. Which of course i only noticed after arrival... That was in 0.24. I since played 0.25 for some weeks - leaving the ship in orbit around Jool. Recently finally decided to visit at least one of the moons, since this would be the last mission in this savegame anyway - loaded, and somehow every single flight in progress was deleted... missing part or something. I think it was the upgrade of Kerbal Engineer Redux from beta to 1.0 that sealed their fate...\u003C/p\u003E\u003Cp\u003EStill sad about it. So much preparation and the long trip out... and they didn\u0027t even set foot on one of the moons :-( Mission Commander Obmore Kerman, you will be missed!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-05T15:59:03Z\u0022 title=\u002211/05/2014 03:59  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 5, 2014\u003C/time\u003E by heng\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"}]}