{"TopicId":70494,"ForumId":44,"TopicTitle":"Plasma weapon behaviour","CreatedByName":"MC.STEEL","CreatedById":89456,"CreatedDateTime":"2014-04-25T18:47:45Z","PageNum":1,"Articles":[{"CreatedByName":"MC.STEEL","CreatedById":89456,"CreatedDateTime":"2014-04-25T18:47:45Z","Content":"\n\u003Cp\u003ESo i was thinking about plasma weapons and i scraped up a couple of notes:\u003C/p\u003E\u003Cp\u003EYou will need a ludicrously large power supply for it to even generate sizable amounts.\u003C/p\u003E\u003Cp\u003EOverheating will be a very annoying issue,and no one likes to handle a malting plasma caster.\u003C/p\u003E\u003Cp\u003EI have absolutely no idea how do you make it into neat little globs like you see in Sci-Fi,I heard some talk about the plasma being held under its own magnetic field but i am too factually illiterate to know if thats true.What we can however is bypass this problem and make a rad flamethrower esque weapon that shoots a nasty storm in its general downrange direction,however the plasma will need to be at a very high temperature so it can travel the distance.\u003C/p\u003E\u003Cp\u003EA welding mask will be necessary just as protective goggles are needed for high intensity lasers.\u003C/p\u003E\n"},{"CreatedByName":"Sillychris","CreatedById":103939,"CreatedDateTime":"2014-04-25T19:35:39Z","Content":"\n\u003Cp\u003EContainment and dispersal are indeed big problems for directed plasma, so why not try a diffferent approach? I expect plasma grenades will exist in the near future.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2014-04-25T19:41:30Z","Content":"\n\u003Cp\u003E\u0022Caution. Point away from face.\u0022\u003C/p\u003E\u003Cp\u003EYeah, the self contained magnetic field always sounded a bit too handwavy to me, can\u0027t say for sure, of course.\u003C/p\u003E\u003Cp\u003EI mean, even if you could create a clever arrangement that lets the plasma glob contain itself, it seems to me that the magnetic field would need to be very powerful, and it would probably drain away most of the energy in the plasma very quickly. And then you are left with a very inefficient mass driver-type weapon...\u003C/p\u003E\u003Cp\u003EThen again, if you accelerate the glob to a great velocity, a split second of containment might be enough.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T19:58:13Z\u0022 title=\u002204/25/2014 07:58  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by Awaras\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-04-25T20:05:57Z","Content":"\n\u003Cp\u003Ethere was project marauder back in the early 90s which had pretty good success, enough that it was classified. it would be interesting to know what became of that. according to a weak wikipedia article, with no sources, no pictures and not a lot of text, it was able to produce lightning balls and plasma rings, essentially, a real world ppc. awesome stuff.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-04-25T20:06:46Z","Content":"\n\u003Cp\u003EWell, we know that a self contained sphere of plasma is possible: \u003Ca href=\u0022https://www.researchgate.net/publication/3947265_Ball_lightning_explained_as_a_stable_plasma_toroid\u0022 rel=\u0022external nofollow\u0022\u003EIt\u0027s been done\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThe question is why you would want to use a plasma weapon in the first place. The eventual goal of any weapon is to pump energy from A to B until B stops working. Using a kinetic projectile is just so much better at energy transfer. The only reason you\u0027d want to use anything else is because it moves faster and thus has an easier firing solution. So your choices are either:\u003C/p\u003E\u003Cp\u003ELasers: extremely fast and accurate, but low energy transfer.\u003C/p\u003E\u003Cp\u003EProjectiles: Not very fast so you end up missing a lot. But if it hits you have a near guaranteed kill.\u003C/p\u003E\u003Cp\u003EA plasma weapon is like the worst of both worlds. It moves slower than light and it transfers less energy than a bullet. I guess you could use it to shock someone, thus having some use as nonlethal antipersonnel weapon. But I don\u0027t see that much use for them otherwise.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-04-25T20:12:29Z","Content":"\n\u003Cp\u003Esupposedly it has a strong localized emp effect, useful if you are fighting a high tech adversary. if you hit a tank or a ship with it, you are going to throw off all their fire control systems and leave them momentarily vulnerable while they switch to manual. if the terrorists had one it would definitely screw with america\u0027s war machine. then again in the time it takes to make them momentarily vulnerable, you could have just destroyed them. it might also come in handy when you need to neutralize a threat, but are not authorized to destroy it.\u003C/p\u003E\n"},{"CreatedByName":"MC.STEEL","CreatedById":89456,"CreatedDateTime":"2014-04-25T21:03:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Esupposedly it has a strong localized emp effect, useful if you are fighting a high tech adversary. if you hit a tank or a ship with it, you are going to throw off all their fire control systems and leave them momentarily vulnerable while they switch to manual. if the terrorists had one it would definitely screw with america\u0027s war machine. then again in the time it takes to make them momentarily vulnerable, you could have just destroyed them. it might also come in handy when you need to neutralize a threat, but are not authorized to destroy it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd lets not forget the psychological factor.How would you feel if your enemy looks like an alien invasion. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-04-25T21:51:53Z","Content":"\n\u003Cp\u003EWhat would the effect on a target be? What energy levels would be required to have a similar effect to a bullet.\u003C/p\u003E\u003Cp\u003EI\u0027m sure that it can be done but several large breakthroughs would be need before anything could be made practical for the battlefield.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2014-04-25T21:55:48Z","Content":"\n\u003Cp\u003EWouldn\u0027t it act like a gas? It would just shoot upwards towards lower pressure and rapidly expand?\u003C/p\u003E\u003Cp\u003ESort of like breaking a steam pipe. Steam would shoot out and kill anyone in the direction of travel of the hot steam, but its range would be negligible at best.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-04-25T23:23:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WestAir\u0022 data-cite=\u0022WestAir\u0022\u003E\u003Cdiv\u003EWouldn\u0027t it act like a gas? It would just shoot upwards towards lower pressure and rapidly expand?\u003Cp\u003ESort of like breaking a steam pipe. Steam would shoot out and kill anyone in the direction of travel of the hot steam, but its range would be negligible at best.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell yea, that\u0027s one way it can behave. But plasma is extremely conductive which gives it all sorts of interesting tricks.\u003C/p\u003E\u003Cp\u003EFor example, if you run a current through a wire this generates a magnetic field. So the electrons within the wire are moving through a magnetic field, and as anyone will tell you charged particles in a magnetic field bend their paths. In this case it is towards the center of the current. Normally the current is trapped within a solid, so this does very little (crushes pipes in lightning rods etc). But in a plasma there\u0027s nothing holding the charges in place so you can pinch it into a narrow high density line.\u003C/p\u003E\u003Cp\u003EIf you make that line a loop and you drive extremely high currents through it you can use this to make a high density, high energy torus of plasma. The high density counteracts the atmospheric bouyancy and the current prevents the gas from dissipating. If you give it a bit of a twist you can probably even make it self propelling like a smoke ring. One of those plasma donuts could be used at considerable range.\u003C/p\u003E\u003Cp\u003EIf you\u0027re in a vacuum its even easier, you can use the pinching effect to speed up the plasma to relativistic velocities and just spray your enemies with a particle accelerator.\u003C/p\u003E\u003Cp\u003EThe problem lies in the amount of energy these tricks cost and the relatively little damage they\u0027ll actually cause. A bullet is much simpler and works much better.\u003C/p\u003E\n"}]}