{"TopicId":70729,"ForumId":16,"TopicTitle":"Ejection angle","CreatedByName":"GoatRider","CreatedById":103681,"CreatedDateTime":"2014-04-27T14:14:18Z","PageNum":1,"Articles":[{"CreatedByName":"GoatRider","CreatedById":103681,"CreatedDateTime":"2014-04-27T14:14:18Z","Content":"\n\u003Cp\u003EIn tools like \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E, it shows an \u0022ejection angle\u0022 of for example 107Ã‚Âº to Retrograde. How would one go about measuring that? Is that the angle I start my departure burn from LKO, or the angle I should be heading after I\u0027m done burning?\u003C/p\u003E\u003Cp\u003EI\u0027ve been using MechJeb for this, but it\u0027s been doing a very bad job of getting me to Moho with something under a million dV for the capture burn.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-27T16:29:40Z\u0022 title=\u002204/27/2014 04:29  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 27, 2014\u003C/time\u003E by GoatRider\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-27T14:45:15Z","Content":"\n\u003Cp\u003EEnter the map view and move the camera so it\u0027s looking at the system from above.\u003C/p\u003E\u003Cp\u003EZoom out to see Sun and move it to comfortable position - I usually move it to the left, horizontally from my position:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OlYjZEx.png\u0022 alt=\u0022OlYjZEx.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWithout moving the camera, zoom in the map view (\u0022\u002B\u0022 key on numpad or mouse wheel; I don\u0027t have anything in orbit at the moment, sorry)\u003C/p\u003E\u003Cp\u003EYou get 0Ã‚Â° prograde straight up, 90Ã‚Â° prograde straight to the right, 0Ã‚Â° retrograde straight down, and 90Ã‚Â° retrograde straight to the left. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/e4YOqxK.png\u0022 alt=\u0022e4YOqxK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith that, it is possible to guess the angle and place the maneuver quite well. I don\u0027t usually need to put it exactly to the right position as the necessary tuning to get the intercept is rarely more than a few m/s.\u003C/p\u003E\u003Cp\u003ENext thing I usually do is I read and set the normal value of the maneuver (opens if you click on the \u0022i\u0022 button next to dv value) using the normal/antinormal icon, and then I top it up to full dv using prograde maneuver icon. Last but not least, I fix the maneuver so it shows me actual intercept by experimenting with all maneuver icons.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-27T14:50:44Z\u0022 title=\u002204/27/2014 02:50  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 27, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mipe","CreatedById":109421,"CreatedDateTime":"2014-04-27T15:37:59Z","Content":"\n\u003Cp\u003EWhat about this part of the question that I also am interested in:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIs that the angle I start my departure burn from LKO, or the angle I should be heading after I\u0027m done burning?\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"GoatRider","CreatedById":103681,"CreatedDateTime":"2014-04-27T15:50:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mipe\u0022 data-cite=\u0022Mipe\u0022\u003E\u003Cdiv\u003EWhat about this part of the question that I also am interested in:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure it\u0027s the angle you start your departure burn, but I\u0027d like confirmation of that.\u003C/p\u003E\n"},{"CreatedByName":"GoatRider","CreatedById":103681,"CreatedDateTime":"2014-04-27T16:27:40Z","Content":"\n\u003Cp\u003EI just compared these numbers with what MechJeb is using. It came out with numbers pretty much the same as the \u0022Mid point correction\u0022 method from the alexmoon site. And the ejection node was a bit to the right of the line between Kerbin and the Sun. alexmoon said that angle should be 107Ã‚Âº from Retrograde, so I was thinking of it wrong. I was thinking of the tangent that was headed that way, so I was 90Ã‚Âº off. That\u0027s what was confusing me.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-27T18:32:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mipe\u0022 data-cite=\u0022Mipe\u0022\u003E\u003Cdiv\u003EWhat about this part of the question that I also am interested in:\u003Cp\u003E\u003Cem\u003EIs that the angle I start my departure burn from LKO, or the angle I should be heading after I\u0027m done burning?\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoth.\u003C/p\u003E\u003Cp\u003EThe system assumes you\u0027re doing the burn instantly, i.e. you point your ship in the requested direction, and apply the impulse within one frame. If you don\u0027t and your burn is particularly long, you need to apply corrections for inaccuracies caused by long burn. Unfortunately the maneuver indicator on navball is extremely unhelpful in that because if you follow it, you\u0027ll end up ejecting in a very different direction than where you want to go. So if you don\u0027t have enough experience in making these corrections (and don\u0027t want to spend a long time learning them), it\u0027s recommended to pack sufficient thrust to execute the burn in under one minute. Even in that case, you should just point your ship in the requested direction and apply all the thrust in that direction.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-27T18:34:48Z\u0022 title=\u002204/27/2014 06:34  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 27, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-04-28T09:00:03Z","Content":"\n\u003Cp\u003EI tend to add the burn first then change the position, so you create the maneuver, set the DV to the required amount, then move the maneuver node around the planet until you will be travelling parallel with kerbins vector on kerbin SOI departure, assuming you have this all correct then as soon as you leave SOI the kerbol periapsis (or apoapsis depending on which planet you\u0027re shooting for) should be located on the place you performed the burn also while you\u0027ve just finished the burn, the orbit around kerbol should be visible as a huge great yellow line passing through the kerbin SOI (but not showing an encounter) in the rare event of a \u0022perfect\u0022 maneuver this line should pass right through kerbin. This would mean your departure from LKO is EXACTLY on the kerbol periapsis or apoapsis (depending on direction of travel) although even with a perfect departure, you might still need to tweak your orbit since the timing could be up to about 17 minutes out depending on the departure window.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-28T11:55:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FREEFALL1984\u0022 data-cite=\u0022FREEFALL1984\u0022\u003E\u003Cdiv\u003Ethen move the maneuver node around the planet until you will be travelling parallel with kerbins vector on kerbin SOI departure\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I started to use the calculator, I spent some very frustrating moments trying to get the encounter this way. Then I realized the calculator sometimes sends you deliberately in a different direction because the optimum trajectory has some radial component.\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-04-28T12:18:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EWhen I started to use the calculator, I spent some very frustrating moments trying to get the encounter this way. Then I realized the calculator sometimes sends you deliberately in a different direction because the optimum trajectory has some radial component.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI cant understand why there would be an additional radial component, surely in the event of a standard hohmann transfer the target body is always encountered at the opposite side of the orbit from the initial burn, why would this change for an interplanetary transfer?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-28T12:47:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FREEFALL1984\u0022 data-cite=\u0022FREEFALL1984\u0022\u003E\u003Cdiv\u003EI cant understand why there would be an additional radial component, surely in the event of a standard hohmann transfer the target body is always encountered at the opposite side of the orbit from the initial burn, why would this change for an interplanetary transfer?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t comment on why exactly the calculator does that, the matter is it does. It happened to me the first time with Eeloo and I can remember quite well that the trajectory had periapsis below Kerbin orbit and apoapsis way behind Eeloo orbit but if I tried to change it to Hohmann transfer I couldn\u0027t get an intercept no matter what I tried. My guess is it\u0027s just how the math works out if your target has some significant inclination and/or eccentricity.\u003C/p\u003E\u003Cp\u003ESo my experience is that the most reliable approach is to eyeball the angle in map view and then, if needed, move the trajectory by adding some radial component rather than trying to move the maneuver. Pretty often I manage to set up the intercept a few m/s below what the calculator is telling me I\u0027ll spend.\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-04-28T13:26:12Z","Content":"\n\u003Cp\u003EPerhaps its due to the discrepancy caused by the variable travel time from LKO to the edge of SOI, since kerbin would be moving around its orbit the actual kerbin escape vector is thrown off with different escape speeds the angle would vary.... or, something.\u003C/p\u003E\n"}]}