{"TopicId":70889,"ForumId":16,"TopicTitle":"Orbeth effect: how much does it matter?","CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-04-29T00:25:37Z","PageNum":1,"Articles":[{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-04-29T00:25:37Z","Content":"\n\u003Cp\u003EI know the orbeth effect can save you tons of delta-v but how much and at different orbits?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-29T00:46:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022robopilot99\u0022 data-cite=\u0022robopilot99\u0022\u003E\u003Cdiv\u003EI know the orbeth effect can save you tons of delta-v but how much and at different orbits?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour question is \u003Cem\u003Ereally\u003C/em\u003E broad. In my experience, the Oberth effect is \u003Cem\u003Emost\u003C/em\u003E useful when you\u0027re going from a satellite into interplanetary space by way of the satellite\u0027s primary (e.g. Minmus to interplanetary space by LKO or Tylo to interplanetary space by way of low Jool orbit).\u003C/p\u003E\u003Cp\u003EI find that leaving Kerbin from Minmus can save ~ 400-700 m/s. But it\u0027s \u0022saved\u0022 because I refueled at Minmus, I still had to spend dV to \u003Cem\u003Eget\u003C/em\u003E to Minmus in the first place.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T07:16:22Z\u0022 title=\u002204/29/2014 07:16  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003Cbr\u003EScrewed up your/you\u0026#039;re... I hate that.\n\u003C/span\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-29T01:39:05Z","Content":"\n\u003Cp\u003EIt depends on how far you\u0027re travelling. Oberthing can do wonders to your Delta-V budget when, say, travelling to Eeloo. However, you shouldn\u0027t worry about it too much for missions that stay in the Kerbin system, because then the effects aren\u0027t significant enough to affect anything. Maybe into the tens of units for Delta-V, but that\u0027s hardly anything you can\u0027t work around.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-29T05:59:27Z","Content":"\n\u003Cp\u003EOberth effect?\u003C/p\u003E\u003Cp\u003EStarting at LKO (70x70 km)\u003C/p\u003E\u003Cp\u003E- Hohmann transfer from LKO to just behind the SOI boundary: 930 m/s\u003C/p\u003E\u003Cp\u003E- Hohmann transfer from Kerbin orbit to Jool orbit: 2700 m/s\u003C/p\u003E\u003Cp\u003E- Direct transfer from LKO to Jool orbit: 1950 m/s\u003C/p\u003E\u003Cp\u003EYou cannot change anything on the 930 m/s you need to eject from LKO to interplanetary space, but for the rest of the transfer, you spend 1020 m/s if you do it at LKO, and 2700 m/s if you don\u0027t. So there.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-29T06:15:19Z","Content":"\n\u003Cp\u003EWith regard to some removed posts, either comment on the subject of the thread or skip to the next one. There\u0027s no point in being unpleasant to each other.\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2014-04-29T06:19:22Z","Content":"\n\u003Cp\u003EI think about Oberth effect in the way - if you want to lower your orbit burn at apoapsis, if you want to put it higher burn at periapsis.\u003C/p\u003E\u003Cp\u003ETransfers to other planets it\u0027s a bit too much math for a Kerbal. It\u0027s enough that I wait for a transfer window. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-04-29T17:23:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EI find that leaving Kerbin from Minmus can save ~ 400-700 m/s. But it\u0027s \u0022saved\u0022 because I refueled at Minmus, I still had to spend dV to \u003Cem\u003Eget\u003C/em\u003E to Minmus in the first place.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou \u0027save\u0027 fuel not because of the Oberth effect but because Minmus is near the border of Kerbin SIO, far away from Kerbin\u0027s gravity so that you need only a little delta-v to reach Kerbin escape velocity.\u003C/p\u003E\u003Cp\u003EThe Oberth effect is stronger the faster you go, which is generally in low orbit. If you want to go from Kerbin\u0027s surface to planetary transfer it\u0027s best to first establish low Kebin orbit.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-29T20:19:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003EYou \u0027save\u0027 fuel not because of the Oberth effect but because Minmus is near the border of Kerbin SIO, far away from Kerbin\u0027s gravity so that you need only a little delta-v to reach Kerbin escape velocity.\u003Cp\u003EThe Oberth effect is stronger the faster you go, which is generally in low orbit. If you want to go from Kerbin\u0027s surface to planetary transfer it\u0027s best to first establish low Kebin orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, it\u0027s both, it\u0027 really is the Oberth effect \u003Cem\u003Eis\u003C/em\u003E more than anything else because instead of burning at Minmus\u0027 orbit (47 Mm above Kerbin\u0027s surface), you drop down to LKO (100 km or 0.1 Mm above Kerbin\u0027s surface) and burn there, where your orbital velocity is much higher. This is actually more efficient than exiting Kerbin\u0027s SoI from Minmus directly. \u003C/p\u003E\u003Cp\u003ESorry that detail wasn\u0027t in my first response to the OP.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t believe me, then maybe you\u0027d believe Scott Manley. This exact procedure and it\u0027s efficiency are documented in his video here (links aren\u0027t working for me today:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gEra14FVD4o?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E) and are described in terms of the Oberth Effect.\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-04-29T22:28:58Z","Content":"\n\u003Cp\u003EIndeed it was not clear you first drop to Kerbin, but i\u0027ll admit i would not have guessed the Oberth effect would be that strong. To bad it is not the more efficient way if the starting point is Kerbin\u0027s surface. But probably good reason to establish a Kethane base on Minmus. \u003C/p\u003E\u003Cp\u003EShould it not be possible to gain even more by also using Kerbin for gravity assist, by departing from Minmus when it is at the leading side of Kerbin, with periapsis behind Kerbin?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-30T00:12:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003EIndeed it was not clear you first drop to Kerbin, but i\u0027ll admit i would not have guessed the Oberth effect would be that strong. To bad it is not the more efficient way if the starting point is Kerbin\u0027s surface. But probably good reason to establish a Kethane base on Minmus. \u003Cp\u003EShould it not be possible to gain even more by also using Kerbin for gravity assist, by departing from Minmus when it is at the leading side of Kerbin, with periapsis behind Kerbin?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, first off, if you\u0027re burning, don\u0027t call it a gravity assist, because some ppl will get cranky. See \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78254-Calculating-launch-windows-for-transfers-to-other-planets-from-Mun-or-Minmus\u0022 rel=\u0022external nofollow\u0022\u003Ethis \u003C/a\u003Ethread.\u003C/p\u003E\u003Cp\u003EAnd yes, timing your escape from Minmus to coincide with the appropriate ejection angle from Kerbin is important. However I usually escape going outward into interplanetary space when Minmus is between the sun and Kerbin, and escape going inward when Minmus is furtherst from the sun. After some though, this timing may not be ideal, but it works very well in my hands. There\u0027s also the timing with your launch window to consider. \u003C/p\u003E\u003Cp\u003EIf you\u0027re interested in reading the conversation that\u0027s currently going on about using Minmus to escape Kerbin, I\u0027d again refer you to that thread I linked above, instead of repeating the points here.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T00:18:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003EShould it not be possible to gain even more by also using Kerbin for gravity assist, by departing from Minmus when it is at the leading side of Kerbin, with periapsis behind Kerbin?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat you want is for the the rocket to spend as much time falling inwards towards Kerbin (gaining speed, which will be useful for the Oberth effect) and as little time being slowed down by Kerbin\u0027s gravity on the way out as possible. It really doesn\u0027t matter the relative positioning of Minmus- only the final trajectory of the rocket as it exits Kerbin\u0027s SOI after Kerbin\u0027s gravity is done curving its path...\u003C/p\u003E\u003Cp\u003EFor best results, eject from a low Minmus orbit (Minmus\u0027 gravity is so weak the benefits from the Oberth effect on ejection will greatly outweigh the increased time its gravity slows you down during ejection) with a burn at a periapsis that will have the final trajectory when leaving Minmus\u0027 SOI pointed precisely retrograde from the direction of Minmus orbit around Kerbin. If you get it just right, you sohuld leave Minmus\u0027 SOI with enough velocity that you have almost no velocity relative to Kerbin upon SOI-transfer, and will consequentially fall almost straight in towards Kerbin.\u003C/p\u003E\u003Cp\u003EYou want your periapsis relative to Kerbin as low as possible without entering the atmosphere to achieve maximum benefit from the Oberth effect- though you also have to take into account the fuel cost of the burn near Minmus vs. the fuel savings at the burn near Kerbin...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-30T02:44:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003ESo, first off, if you\u0027re burning, don\u0027t call it a gravity assist, because some ppl will get cranky. See \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78254-Calculating-launch-windows-for-transfers-to-other-planets-from-Mun-or-Minmus\u0022 rel=\u0022external nofollow\u0022\u003Ethis \u003C/a\u003Ethread.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas that really necessary? I let it go after you posted, please do me the same courtesy.\u003C/p\u003E\u003Cp\u003ETo the OP, the further away from your orbit the destination orbit is, the more dV you will save by harnessing Oberth. If leaving from Kerbin, you can ignore the Oberth effect for transfers to Duna and Eve with only small efficiency penalties, but a transfer to Eeloo or Moho makes chasing Oberth much more beneficial.\u003C/p\u003E\u003Cp\u003EWas there a specific case you were interested in, so we can give more concrete answers?\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-06T04:33:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EWas that really necessary? I let it go after you posted, please do me the same courtesy.\u003Cp\u003ETo the OP, the further away from your orbit the destination orbit is, the more dV you will save by harnessing Oberth. If leaving from Kerbin, you can ignore the Oberth effect for transfers to Duna and Eve with only small efficiency penalties, but a transfer to Eeloo or Moho makes chasing Oberth much more beneficial.\u003C/p\u003E\u003Cp\u003EWas there a specific case you were interested in, so we can give more concrete answers?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s about the Delta-V of the transfer, not the distance to the destination, that determines the usefulness of the Oberth Effect.\u003C/p\u003E\u003Cp\u003EI feel the need to point out this distinction because, again, you don\u0027t *have to* use the lowest-energy transfer possible to get to Eve or Duna.\u003C/p\u003E\u003Cp\u003EIf you\u0027re running a manned mission with a life-support mod, or playing for realism, it\u0027s very likely you\u0027d want to eject with excess speed to get to your destination faster.\u003C/p\u003E\u003Cp\u003EIn that case, a fast transfer to Eve or Duna can require just as much Delta-V (and benefit just as much from the Oberth Effect) as a slow transfer to Jool or Moho...\u003C/p\u003E\u003Cp\u003EIn real life, NASA wants to wait on a Mars mission until it can develop propulsive systems that can get a manned mission to Mars in much less time than current chemical rockets allow. It\u0027s not desirable to make a minimum-energy transfer, and have a crew stuck in interstellar space (with the heavy radiation exposure that entails) for months at a time. That\u0027s a big part of why they\u0027re eying the VASIMR propulsive system so eagerly... (it could allow much faster transfers, thanks to its higher ISP, when scaled up to a multi-megawatt scale with sufficiently advanced nuclear reactors)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-06T04:36:04Z\u0022 title=\u002205/06/2014 04:36  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 6, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-06T10:41:33Z","Content":"\n\u003Cp\u003EThat\u0027s a clearer way to think of it, thanks. I was assuming minimum energy transfers, but your wording is more general. The greater the magnitude of the energy change desired, the more benefit Oberth provides.\u003C/p\u003E\n"}]}