{"TopicId":70893,"ForumId":16,"TopicTitle":"Shaky navballs!","CreatedByName":"demian_travis","CreatedById":90563,"CreatedDateTime":"2014-04-29T01:29:27Z","PageNum":1,"Articles":[{"CreatedByName":"demian_travis","CreatedById":90563,"CreatedDateTime":"2014-04-29T01:29:27Z","Content":"\n\u003Cp\u003EI am trying to dock in a station on the mÃƒÂ¼n. The orbit is not perfectly circular... and the navball goes EVERYWHERE. It is impossible - AT ALL - to have 0 m/s of speed between the targets. It is annoyingly bad! when I time warp the nav ball stops and acts like it should, but I am starting to punch my monitor in frustration....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T06:16:22Z\u0022 title=\u002204/29/2014 06:16  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003Cbr\u003EWatch the language, please.\n\u003C/span\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-29T01:37:02Z","Content":"\n\u003Cp\u003EIs the craft flipping or shaking at all? If not, you could always eyeball it, using the target you\u0027re trying to dock to as a reference.\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-29T01:38:24Z","Content":"\n\u003Cp\u003EI\u0027m afraid I don\u0027t understand the issue. The shape of the target orbit doesn\u0027t matter except to the extent that you match shapes with it.\u003C/p\u003E\u003Cp\u003EAre your ships shaking and/or wobbly? Do you have the other ship targeted and is the Navball actually in Target mode instead of Orbit or Surface? Are you attempting to cancel your relative velocity with the pink marker instead of the yellow one like you should be?\u003C/p\u003E\u003Cp\u003EEDIT: Oooh, another biggie: Are you selecting Control From Here on the port you\u0027re planning on docking with the other ship?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T01:46:05Z\u0022 title=\u002204/29/2014 01:46  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by FenrirWolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"demian_travis","CreatedById":90563,"CreatedDateTime":"2014-04-29T01:54:52Z","Content":"\n\u003Cp\u003EThe ships are really sturdy and simetrical. I used the exact same ships on an orbit around Minnimus with no trouble at all - managed to send my lander up and down a few times. I am selecting the control from here. I am trying to cancel the velocity with the yellow marker, but... it goes everywhere. In fact, when I managed to make the docking ports \u0022kiss\u0022 my lander was flinged into oblivion, smashing a few solar panels from the station. If you guys want I can try to record this issue... But I need a screen recorder for a mac.\u003C/p\u003E\u003Cp\u003EHere is a picture of the station (with docked lander), happily orbiting Minnimus:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/91qUIAU.jpg\u0022 alt=\u002291qUIAU.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-29T02:00:34Z","Content":"\n\u003Cp\u003EOK, so you get the flinging of the navball when controlling the station or the lander? One possibility is that you might be dealing with phantom forces brought on by part clipping or something else wonky about the design.\u003C/p\u003E\n"},{"CreatedByName":"kenbobo","CreatedById":70629,"CreatedDateTime":"2014-04-29T02:01:34Z","Content":"\n\u003Cp\u003Evideo- get bandicam and e-mail/PM me at \u003Ca href=\u0022/cdn-cgi/l/email-protection#d6f3e194b9a6a2bfb9b8f3e192\u0022\u003E\u003Cspan class=\u0022__cf_email__\u0022 data-cfemail=\u00221f747a717b7e73737c6a7d7a7b5f78727e7673317c7072\u0022\u003E[email\u0026#160;protected]\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"demian_travis","CreatedById":90563,"CreatedDateTime":"2014-04-29T02:03:37Z","Content":"\n\u003Cp\u003EFenrirWolf - Both. I switch between ships and all of a sudden I get 1.6 m/s speed variations. \u003C/p\u003E\u003Cp\u003EKenbob5588 - Will download it and record what is happening. Give me a few minutes :3\u003C/p\u003E\n"},{"CreatedByName":"robogungt8","CreatedById":81071,"CreatedDateTime":"2014-04-29T02:05:03Z","Content":"\n\u003Cp\u003EI too have this issue sometimes. For me though, it mostly happens when my orbits are very near circular (\u0026lt;100m difference between Ap and Pe). Also happens when I\u0027m making very minute changes in a circular orbit. I think it\u0027s the physics engine getting confused calculating direction vectors with very similar number, although I can only speculate. The was I see it, it means the thing have virtually no relative velocity (0.1m/s). I wouldn\u0027t worry about it if possible.\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-29T02:08:13Z","Content":"\n\u003Cp\u003EAlso, you\u0027re not referring to the way the prograde marker jumps around when close to zero relative velocity, right? If so, then you really ought to be more specific than saying the \u0022Navball\u0022 is jumping around, because that can be taken many ways.\u003C/p\u003E\u003Cp\u003EThe relative prograde marker losing precision at low speeds is just a consequence of trying to derive information about your heading when you don\u0027t really have one anymore. The best way to work around that issue is to not concern yourself with stopping all relative motion. Once you\u0027re in the general neighborhood of your target, a little drifting doesn\u0027t matter. Not to mention the goal is to drift into your target anyway, and the marker performs its job quite fine when you\u0027re going at the 0.3-1.0m/s speeds expected from a docking maneuver.\u003C/p\u003E\u003Cp\u003EEither way I\u0027ll have a peek at the video once it\u0027s up to have a better idea of what\u0027s going on.\u003C/p\u003E\n"},{"CreatedByName":"demian_travis","CreatedById":90563,"CreatedDateTime":"2014-04-29T02:39:24Z","Content":"\n\u003Cp\u003EFenrir, Sorry. Is the prograde marker that jumps all around. Robogungt8, Yes, I also have this issue when I have really circular orbits. \u003C/p\u003E\u003Cp\u003EUploaded the video: \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/mScPbC9C48w?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E Still processing, will be ready on a few minutes!\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-29T02:54:56Z","Content":"\n\u003Cp\u003EThe reasons for the prograde marker going wonky plus the Ap/Pe markers acting up in circular orbits are pretty similar.\u003C/p\u003E\u003Cp\u003EThink of it this way: how is prograde defined? It\u0027s the direction you\u0027re moving, right? So what does prograde mean when you are \u003Cem\u003Enot\u003C/em\u003E moving? That\u0027s where the navball indicator starts having trouble. You see, when you are at rest or nearly so, \u003Cem\u003Eevery direction\u003C/em\u003E is prograde.\u003C/p\u003E\u003Cp\u003ESame goes for circular orbits. When every point is the same distance from the planet, every point in the orbit becomes the periapsis and apoapsis at the same time.\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-29T03:06:34Z","Content":"\n\u003Cp\u003EAs for how to dock when dealing with the finicky cursor? You need to change up your methods. Once your ship has a clear line of site to the target docking port, line yourself up to the purple marker such that you are facing the target.\u003C/p\u003E\u003Cp\u003ENow, RCS forward a bit. The prograde marker will get a bit more towards the center of the screen, but chances are it will still be slightly off. Don\u0027t move your ship away from the purple marker, instead use RCS translation to shift the the yellow prograde marker to overlap the purple marker, all while keeping your vessel pointed right at them too.\u003C/p\u003E\u003Cp\u003EMeanwhile, pay attention to the actual vessel view too. You might be coming in at an angle relative to the port, and it might be necessary to make a few corrections to line up for a successful connection.\u003C/p\u003E\u003Cp\u003EEither way, the thing to remember is that on a docking approach, you don\u0027t steer your ship to the prograde marker. Instead you steer the prograde marker to your ship.\u003C/p\u003E\u003Cp\u003EEDIT: That\u0027s the best precision you can get with the default navball markers. If you don\u0027t mind a lightweight mod, this one adds a 3rd alignment marker to the navball that makes the process even more straightforward. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54303-0-23-5-Navball-docking-alignment-indicator-v2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/54303-0-23-5-Navball-docking-alignment-indicator-v2\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T04:11:15Z\u0022 title=\u002204/29/2014 04:11  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by FenrirWolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sophistry","CreatedById":106653,"CreatedDateTime":"2014-04-29T03:20:02Z","Content":"\n\u003Cp\u003EFrom watching the video I think your issues are the slow speed you\u0027re going at combined with the fact you\u0027re using RCS to turn.\u003C/p\u003E\u003Cp\u003EIn similar situations I turn RCS off when I rotate my ship, because it can build a slight velocity; the multiple vectors that all the slight RCS spurts create is what is making the prograde indicator go ballistic. My suspicion is reinforced by the RCS set up on the station: that lifter rocket still attached doesn\u0027t have RCS thrusters by the looks of it. Without equal placement of RCS on each side of the centre of mass, all your RCS use will change your vector slightly.\u003C/p\u003E\u003Cp\u003ETry using RCS only for translation, on the lander, and stick to using reaction wheels on the station until you stage off that large fuel tank: try it and see, at the very least to rule it out \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T03:23:04Z\u0022 title=\u002204/29/2014 03:23  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Sophistry\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"demian_travis","CreatedById":90563,"CreatedDateTime":"2014-04-29T03:43:25Z","Content":"\n\u003Cp\u003EThank you, guys!! I will try those methods... tomorrow. I am too pissed to play this again.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-29T03:49:04Z","Content":"\n\u003Cp\u003EThat video looks like most dockings I\u0027ve ever done. 0.1m/s is not all that fast, so just pretend it\u0027s 0. If you\u0027re moving almost 0, the direction you\u0027re moving isn\u0027t that important.\u003C/p\u003E\u003Cp\u003EAnd back away a bit. Get about 20 or so meters away before you rotate your station to the ship, and then come in about a meter per second or so. The shakiness is all due to the fact that you\u0027re going slow, and minor oscillations in your craft are enough to confuse the markers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T05:29:09Z\u0022 title=\u002204/29/2014 05:29  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2014-04-29T05:07:06Z","Content":"\n\u003Cp\u003EI think your problem might be between the chair and the keyboard. You thrust forwards before you\u0027re properly aligned and inevitably bounce off and go spinning away into space. Be a little more patient when you\u0027re lining everything up.\u003C/p\u003E\n"},{"CreatedByName":"Heagar","CreatedById":67859,"CreatedDateTime":"2014-04-29T05:41:50Z","Content":"\n\u003Cp\u003EWhat i had to notice in your video was that you have the mod for dock align in the upper right corner of the screen after selecting your docking port. And this device was stable in it\u0027s behavior. Use this as refrence rather than the navball!\u003C/p\u003E\u003Cp\u003EI don\u0027t use this mod, but are playing \u0022Orbiter\u0022 as well, where a docking instrument is the only reference you can trust in. Even on the dark side of an stellar object! But this device is diffent and seems to be an modified ILS approach instrument (ILS=Instument Landing System). In case there is no documentation for this device:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe orange dart on top is for rotation.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe green lines are indicators for your attitude relative to the selected dockingport (your flightpath to the middle of the docking port if centered).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe orange double-circle is your alignment with the selected docking port. If it is centered, you are pointing in the same direction as the docking port. In case you can\u0027t see it, there is a orange dart from the center of the crosshairs to it\u0027s position.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe yellow marker is for your closing speed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDigital readings:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eupper right corner seems to be your rotation relative to normal position in degrees.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ebottom left corner is your distance (DST) in meters.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ebottom right corner is your closing speed (CVEL) in m/s. A positive reading means you are closing in, a negative you are moving away.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhile closing in\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EBegin with the rotation. Center the orange dart.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECenter the orange double-circle with pitch and yaw.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThen begin to translate up/down and left/right with RCS until the green lines are centered.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EControl all readings, especially if you are shortly about to dock. It may be, that the indicators are in logarithmic scale. In that case they would behave more sensitiv to minor corrections at an closer range.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T06:27:48Z\u0022 title=\u002204/29/2014 06:27  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Heagar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2014-04-29T06:20:13Z","Content":"\n\u003Cp\u003ELooks like everything is behaving normally and correctly. Your relative velocity really is changing that much.\u003C/p\u003E\u003Cp\u003EIf you turn off SAS the prograde marker should stop jumping around, but that doesn\u0027t solve your problem.\u003C/p\u003E\u003Cp\u003EThe practical way to solve this problem is:\u003C/p\u003E\u003Cp\u003E1) let the two ships drift much further apart along the docking port axes (20-50 meters),\u003C/p\u003E\u003Cp\u003E2) line up and approach at a reasonable speed (for example, with 1 to 2 seconds worth of RCS puff).\u003C/p\u003E\u003Cp\u003EHaving a small but non-zero relative velocity will make the prograde marker stay steady.\u003C/p\u003E\u003Cp\u003E3) continue to adjust your relative velocity so that it stays pointed at the target\u003C/p\u003E\u003Cp\u003E4) kill most of your relative velocity when you get close (a few meters).\u003C/p\u003E\u003Cp\u003EEdit: Oops. I missed an entire page of responses to your video before posting this. Now it\u0027s quite redundant.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T06:22:19Z\u0022 title=\u002204/29/2014 06:22  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Yasmy\u003C/strong\u003E\n\u003Cbr\u003EDidn\u0026#039;t see the 2nd page of replies...\n\u003C/span\u003E\n"}]}