{"TopicId":70890,"ForumId":16,"TopicTitle":"Calculating launch windows for transfers to other planets from Mun or Minmus","CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2014-04-29T00:57:27Z","PageNum":1,"Articles":[{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2014-04-29T00:57:27Z","Content":"\n\u003Cp\u003EHi, has anyone made a tool or mod that helps calculate optimal launch windows for using Mun or Minmus as a departure point and Kerbin as a gravity assist? Because of the long orbital periods of Mun and Minmus, it can interfere with planning a launch if you\u0027re in the wrong point of its orbit during the ideal window. \u003C/p\u003E\u003Cp\u003EIn addition to the above, I\u0027d like to know whether Mun or Minmus would be more optimal for a staging area for interplanetary flight, and whether there are cases where a direct ejection instead of slingshot may be almost as efficient.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-29T01:41:03Z","Content":"\n\u003Cp\u003EI don\u0027t think you can use Kerbin to gravity assist out of Kerbin\u0027s SOI, though you get more benefit from the Oberth effect if you drop to LKO on your way out system.\u003C/p\u003E\u003Cp\u003EA better profile would be to start from LKO and use the Mun for a slingshot. Though the Mun\u0027s gravity is low enough that it\u0027s hardly worthwhile, I just do the transfer burn from LKO.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2014-04-29T03:53:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI don\u0027t think you can use Kerbin to gravity assist out of Kerbin\u0027s SOI, though you get more benefit from the Oberth effect if you drop to LKO on your way out system.\u003Cp\u003EA better profile would be to start from LKO and use the Mun for a slingshot. Though the Mun\u0027s gravity is low enough that it\u0027s hardly worthwhile, I just do the transfer burn from LKO.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe gravity assist isn\u0027t the right term. The thing is that launching from Kerbin takes a lot of fuel, as does burning to Kerbin escape. So the idea is to circumvent both of those by establishing a colony on either Minmus or Mun (using Kethane etc), with re-usable landers and a fuel depot as a staging point for interplanetary travel. Escape from Minmus (and to a lesser extent, Mun) is virtually free due to low gravity, no atmosphere, and extremely low orbits, and if you escape to retrograde, that puts you on a close pass to Kerbin, where you can do a prograde burn at the periapse which will get you (due to the already elongated orbit), a virtually free kerbin escape as well... from there it\u0027s just a matter of burning your ejection to intercept. This saves (in the example of Minmus) up to 5100 delta v over a launch from Kerbin from liftoff to escape. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SY44bQg.jpg\u0022 alt=\u0022SY44bQg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the problem though. The direction you eject from Kerbin depends almost entirely on the position of minmus when you make your retroburn. If Minmus is in the wrong position in its orbit, you could lose several months waiting for it to orbit around to the right position to put your ejection on the right path, but by then you may miss the transfer window to your destination planet.\u003C/p\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2014-04-29T06:39:48Z","Content":"\n\u003Cp\u003EI haven\u0027t made a tool or mod, but I did do the dV calculations from every moon to every other planet. I posted the results for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/70268-Best-altitude-for-a-Minmus-Refueling-station?p=981073\u0026amp;viewfull=1#post981073\u0022 rel=\u0022external nofollow\u0022\u003EMinmus and the Mun\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThe interesting thing to note is that from the Mun (ignoring plane change maneuvers), it is cheaper to go directly to Eve or Duna than to swing around Kerbin. For other destinations from the Mun, and for all destinations from Minmus, you save dV by swinging by Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-04-29T07:57:37Z","Content":"\n\u003Cp\u003EThe best bet is to have a refueling tug depart from minmus, and enter an LKO then dock with your interplanetary vessel, then you can burn right on the transfer window. \u003C/p\u003E\u003Cp\u003EAlternatively just depart from the mun or minmus for all transfers, then you take up the relative velocity of the orbiting body, although you\u0027ll only be able to launch when the mun or minmus is traveling more or less prograde or retrograde.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-29T11:37:26Z","Content":"\n\u003Cp\u003ETo calculate optimal launch windows, use any calculator and enter Kerbin as your starting point. It will tell you when is the optimum time to launch from LKO and what is the ejection angle.\u003C/p\u003E\u003Cp\u003EWith some reserve before the launch window let your station travel to the point exactly opposite to where you need to eject. Then launch from the base and lower your Kerbin periapsis to LKO height. Then add your ejection burn at appropriate place - it should be reasonably close to periapsis of your orbit.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-29T11:52:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Colonel_Panic\u0022 data-cite=\u0022Colonel_Panic\u0022\u003E\u003Cdiv\u003EMaybe gravity assist isn\u0027t the right term. The thing is that launching from Kerbin takes a lot of fuel, as does burning to Kerbin escape. So the idea is to circumvent both of those by establishing a colony on either Minmus or Mun (using Kethane etc), with re-usable landers and a fuel depot as a staging point for interplanetary travel. Escape from Minmus (and to a lesser extent, Mun) is virtually free due to low gravity, no atmosphere, and extremely low orbits, and if you escape to retrograde, that puts you on a close pass to Kerbin, where you can do a prograde burn at the periapse which will get you (due to the already elongated orbit), a virtually free kerbin escape as well... from there it\u0027s just a matter of burning your ejection to intercept. This saves (in the example of Minmus) up to 5100 delta v over a launch from Kerbin from liftoff to escape. \u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/SY44bQg.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/SY44bQg.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the problem though. The direction you eject from Kerbin depends almost entirely on the position of minmus when you make your retroburn. If Minmus is in the wrong position in its orbit, you could lose several months waiting for it to orbit around to the right position to put your ejection on the right path, but by then you may miss the transfer window to your destination planet.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, I didn\u0027t realize you were refueling at your staging point, that does change things a bit. In that case, Kasuha\u0027s method mentioned above is best though if you use Minmus you may miss your transfer window by a few days waiting for it to align; the Mun is better in this regard as its orbital period is much shorter.\u003C/p\u003E\u003Cp\u003EFREEFALL1984\u0027s method means you don\u0027t have to wait as long for things to align, but if you\u0027re refueling in LKO it\u0027s simpler to just launch a tanker from KSC. Though if Kethane mining is fun for you, by all means have at it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-29T17:06:24Z","Content":"\n\u003Cp\u003EAs Yamsy pointed out above, Minmus is the better choice because Minmus saves you fuel. Also, I think calling it a \u0022gravity assist\u0022 is totally fine, because, even though you\u0027re burning at periapsis. You\u0027re using gravity to maximize your velocity relative to Kerbin (burning at periapsis around Kerbin). After watching this video (Sorry, can\u0027t insert link. address is here:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gEra14FVD4o?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E) by Scott Manley, I started launching my interplanetary (IP) missions from Minmus, and never looked back.\u003Cp\u003EAnyway, If you want to use Minmus as a staging area for IP travel, then you have to let go of \u0022optimal\u0022 windows, because they ain\u0027t gonna happen. THis is because to Minmus is really \u003Cem\u003Enever\u003C/em\u003E going to be in the perfect location when the launch window is at it\u0027s peak.\u003C/p\u003E\u003Cp\u003EBut do not lose hope, for all is not lost! Minmus will probably still be in a \u003Cem\u003Ereally good\u003C/em\u003E position at some point during the launch window. Minmus makes a full rotation around Kerbin once about every 300 hours (rounded, for quick dirty math). This means that it\u0027s never more than 150 hrs away from the perfect position. This leads to a choice. YOu can either:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EWait until Minmus is in the right position to start your escape burn, understanding you might be departing for your window early or late.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOR Start your ejection burn from Minmus when the window is optimal, understand that your ejection angle may not be ideal\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI personally prefer the first option, understanding I\u0027ll be a little early or late to the window, because overall, I\u0027m doing this to save fuel and I think that saves the most fuel. Its been my experience (really, with Duna and Eve, but I can\u0027t imagine its very different for other bodies) that the windows are actually pretty wide, and very, very small (and therefore \u003Cem\u003Echeap\u003C/em\u003E) midcourse corrections can get you where you\u0027re going.\u003C/p\u003E\u003Cp\u003EJust my two cents. Hope it helped.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-29T17:19:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EAlso, I think calling it a \u0022gravity assist\u0022 is totally fine, because, even though you\u0027re burning at periapsis. You\u0027re using gravity to maximize your velocity relative to Kerbin (burning at periapsis around Kerbin). \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA gravity assist is entering and exiting a body\u0027s SOI to use its gravity to change your velocity in a desirable direction, no burn is required. What is being described here is taking advantage of the Oberth effect, which is a very different thing. Though the two are often combined.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-29T18:23:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EWait until Minmus is in the right position to start your escape burn, understanding you might be departing for your window early or late.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOR Start your ejection burn from Minmus when the window is optimal, understand that your ejection angle may not be ideal\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThird option is to lower your periapsis when Minmus is in ideal position and spend the wait in this elliptical orbit which is about 100 hours long rather than 300. And you can perform some orbital period tuning at periapsis for almost no dv.\u003C/p\u003E\u003Cp\u003EThe only catch is that you need to match right ejection angle - since a lot of time may pass between your ejection from Minmus and your ejection from Kerbin SOI, what\u0027s 100 degrees to prograde at the time of Kerbin ejection is not 100 degrees prograde at the time when you leave Minmus. The angle changes by approximately 1 degree every 7 hours. It\u0027s not important if you just travel to periapsis but if you intend to spend several orbits in the waiting zone, you have to account for that.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-29T20:31:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EA gravity assist is entering and exiting a body\u0027s SOI to use its gravity to change your velocity in a desirable direction, no burn is required. What is being described here is taking advantage of the Oberth effect, which is a very different thing. Though the two are often combined.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFine, in a very narrow interpretation of \u0022Gravity assist\u0022, it\u0027s wrong. It\u0027s also not the point of the discussion, so I\u0027m not going to be involved in hijacking an otherwise legitimate thread engage in an argument about semantics. Whatever you call it, it works.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EThird option is to lower your periapsis when Minmus is in ideal position and spend the wait in this elliptical orbit which is about 100 hours long rather than 300. And you can perform some orbital period tuning at periapsis for almost no dv.\u003Cp\u003EThe only catch is that you need to match right ejection angle - since a lot of time may pass between your ejection from Minmus and your ejection from Kerbin SOI, what\u0027s 100 degrees to prograde at the time of Kerbin ejection is not 100 degrees prograde at the time when you leave Minmus. The angle changes by approximately 1 degree every 7 hours. It\u0027s not important if you just travel to periapsis but if you intend to spend several orbits in the waiting zone, you have to account for that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a good point I hadn\u0027t considered. It\u0027s more complex, but moves you closer to the \u0022optimum\u0022 solution. You\u0027re also more more likely to have a Mun encounter during these orbits simply because there are more orbits. And if you have an Mun encounter during your wait, you\u0027re gonna have a bad time.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-29T21:17:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EThis is a good point I hadn\u0027t considered. It\u0027s more complex, but moves you closer to the \u0022optimum\u0022 solution. You\u0027re also more more likely to have a Mun encounter during these orbits simply because there are more orbits. And if you have an Mun encounter during your wait, you\u0027re gonna have a bad time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou got a lot of degrees of freedom to avoid such things, but it may be also a good argument to put the station near Mun.\u003C/p\u003E\u003Cp\u003ETransfer from Minmus LO to 70 km Kerbin periapsis: 160 m/s (227 without Minmus Oberth effect)\u003C/p\u003E\u003Cp\u003ETransfer from Mun LO to 70 km Kerbin periapsis: 265 m/s (375 without Mun Oberth effect)\u003C/p\u003E\u003Cp\u003EDifference between apoapsis at Mun level and Minmus level from 70 km periapsis: 66 m/s\u003C/p\u003E\u003Cp\u003ESo you spend 265 - 160 \u002B 66 = 171 m/s more if you make your station near Mun.\u003C/p\u003E\u003Cp\u003EI would almost say it\u0027s worth the added comfort.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T21:21:01Z\u0022 title=\u002204/29/2014 09:21  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-30T00:25:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yasmy\u0022 data-cite=\u0022Yasmy\u0022\u003E\u003Cdiv\u003EI haven\u0027t made a tool or mod, but I did do the dV calculations from every moon to every other planet. I posted the results for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/70268-Best-altitude-for-a-Minmus-Refueling-station?p=981073\u0026amp;viewfull=1#post981073\u0022 rel=\u0022external nofollow\u0022\u003EMinmus and the Mun\u003C/a\u003E.\u003Cp\u003EThe interesting thing to note is that from the Mun (ignoring plane change maneuvers), it is cheaper to go directly to Eve or Duna than to swing around Kerbin. For other destinations from the Mun, and for all destinations from Minmus, you save dV by swinging by Kerbin.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EYou got a lot of degrees of freedom to avoid such things, but it may be also a good argument to put the station near Mun.\u003Cp\u003ETransfer from Minmus LO to 70 km Kerbin periapsis: 160 m/s (227 without Minmus Oberth effect)\u003C/p\u003E\u003Cp\u003ETransfer from Mun LO to 70 km Kerbin periapsis: 265 m/s (375 without Mun Oberth effect)\u003C/p\u003E\u003Cp\u003EDifference between apoapsis at Mun level and Minmus level from 70 km periapsis: 66 m/s\u003C/p\u003E\u003Cp\u003ESo you spend 265 - 160 \u002B 66 = 171 m/s more if you make your station near Mun.\u003C/p\u003E\u003Cp\u003EI would almost say it\u0027s worth the added comfort.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could, but I\u0027ve included Yamsy\u0027s quote from earlier in this thread because he pointed out that there\u0027s some conditionality to where you\u0027re going. Not sure that I really understand \u003Cem\u003Ethat\u003C/em\u003E but he\u0027s done the math and I haven\u0027t, so I\u0027m no position to argue the issue.\u003C/p\u003E\u003Cp\u003EReally, I think it comes down to what you\u0027re most comfortable with and what works best in your hands. There\u0027s a \u003Cem\u003Elot\u003C/em\u003E of different ways perform these maneuvers that work very well. I think there\u0027s way too much effort and bickering in these forums about what\u0027s \u0022optimal\u0022 instead of discussing what works how it can be improved. Basically, since everyone flies differently, everyone is going to have different preferences.\u003C/p\u003E\u003Cp\u003EIn \u003Cem\u003Emy hands\u003C/em\u003E I can make the Minmus refueling/escape station work \u003Cem\u003Ereally\u003C/em\u003E well. It took me a while to really understand it (the Scott Manley Oberth effect video \u003Cem\u003Ereally\u003C/em\u003E helped crystallize my thoughts on it), but after I had it figured out, yeah, I think it\u0027s cool and effective. I like it\u0027s advantages (Good savings on dV) and it\u0027s disadvantages (having to \u0022fudge\u0022 windows, Mun encounters on trip down, midcourse corrections) just don\u0027t bug me that much.\u003C/p\u003E\u003Cp\u003EOther people are going to prefer other systems (Mun stations, Kethane, Direct launches) and that\u0027s cool. I just have a problem when state that X way is wrong based on inaccurate or exaggerated facts.\u003C/p\u003E\u003Cp\u003E\u0026lt;/soapbox\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T00:33:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EYou got a lot of degrees of freedom to avoid such things, but it may be also a good argument to put the station near Mun.\u003Cp\u003ETransfer from Minmus LO to 70 km Kerbin periapsis: 160 m/s (227 without Minmus Oberth effect)\u003C/p\u003E\u003Cp\u003ETransfer from Mun LO to 70 km Kerbin periapsis: 265 m/s (375 without Mun Oberth effect)\u003C/p\u003E\u003Cp\u003EDifference between apoapsis at Mun level and Minmus level from 70 km periapsis: 66 m/s\u003C/p\u003E\u003Cp\u003ESo you spend 265 - 160 \u002B 66 = 171 m/s more if you make your station near Mun.\u003C/p\u003E\u003Cp\u003EI would almost say it\u0027s worth the added comfort.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point- but your ejection burns around Minmus are shorter than your ejections burns around the Mun- and thus more precise, further saving fuel and adding to comfort...\u003C/p\u003E\u003Cp\u003EAn added benefit from a Minmus station is that it gives you the back-up option of making a direct transfer from Minmus to your intended destination if you can\u0027t get away with the method of dropping your periapsis and waiting. Since Minmus\u0027 orbital velocity around Kerbin is so low, it can *almost* be ignored with some of the more distant transfers (or if, like me, you spend extra Delta-V on Duna transfers so your poor Kerbals don\u0027t have to wait in space as long... Good for roleplaying. Also good if you\u0027re running a life-support mod, as it reduces the total mass in provisions you need to pack...) It\u0027s also sometimes possible to make most of the burn near Minmus, but a small part of it closer to Kerbin (say a bit beyond the Mun\u0027s orbit), which is still better than making the entire burn near Minmus...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2014-04-30T01:05:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E... Since Minmus\u0027 orbital velocity around Kerbin is so low, it can *almost* be ignored with some of the more distant transfers ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou have that backwards. Look at the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/70268-Best-altitude-for-a-Minmus-Refueling-station?p=981073\u0026amp;viewfull=1#post981073\u0022 rel=\u0022external nofollow\u0022\u003Etable\u003C/a\u003E I posted earlier.\u003C/p\u003E\u003Cp\u003EIf you are at Minmus and want to go to distant planets, you can double the cost by going direct. It\u0027s not quite that bad for Eve or Duna.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-30T02:05:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yasmy\u0022 data-cite=\u0022Yasmy\u0022\u003E\u003Cdiv\u003EYou have that backwards. Look at the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/70268-Best-altitude-for-a-Minmus-Refueling-station?p=981073\u0026amp;viewfull=1#post981073\u0022 rel=\u0022external nofollow\u0022\u003Etable\u003C/a\u003E I posted earlier.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you ever post the equation and derivation you used? Some of those numbers look a little... Hinkey.\u003C/p\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2014-04-30T03:27:12Z","Content":"\n\u003Cp\u003EI\u0027ll write up the derivation in a tutorial in a day or two. Like I said in the other post, all you need is the \u003Cem\u003Evis-viva\u003C/em\u003E equation.\u003C/p\u003E\u003Cp\u003EThe numbers should make sense though, if you think about it. At Minmus, you are nearly at Kerbin escape velocity.\u003C/p\u003E\u003Cp\u003EThus you don\u0027t need much of a boost to get to Eve or Duna, compared to the extra dV it takes to get back to low Kerbin periapsis.\u003C/p\u003E\u003Cp\u003EBut here is the clearest example of the Oberth effect I can offer: For an interplanetary transfer from Minmus,\u003C/p\u003E\u003Cp\u003Eyour starting velocity is about 150 m/s, iirc. Direct interplanetary transfers need like 10-20 m/s to escape Kerbin.\u003C/p\u003E\u003Cp\u003EAfter that you are using the escape Kerbin and then burn method, more or less. Much more expensive than direct from Kerbin.\u003C/p\u003E\u003Cp\u003EOn the other hand, it costs about 100 m/s to get back to a 100 km Kerbin periapsis, and when you get there,\u003C/p\u003E\u003Cp\u003Eyou\u0027ll be going, (I don\u0027t remember off-hand) 3 km/s?\u003C/p\u003E\u003Cp\u003ESo compare the Oberth effect at 150 m/s vs 3 km/s. Now these are large maneuvers, so you can\u0027t use the small dV approximation: de = v dV.\u003C/p\u003E\u003Cp\u003E(For a small dV, the change in specific orbital energy is approximately equal to your velocity times the small dV spent: de = 1/2 (v\u002BdV)^2 - 1/2 v^2 ~= v dV.)\u003C/p\u003E\u003Cp\u003EFor a small burn, you get 20 times (3000/150) the specific orbital energy on a slingshot past Kerbin from Minmus that you do from a burn at Minmus.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-30T06:03:46Z\u0022 title=\u002204/30/2014 06:03  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 30, 2014\u003C/time\u003E by Yasmy\u003C/strong\u003E\n\u003Cbr\u003Efixed my stupid units: 3k m/s. really? really?\n\u003C/span\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2014-04-30T03:34:38Z","Content":"\n\u003Cp\u003EGood info in here folks, thanks.\u003C/p\u003E\u003Cp\u003EOne thing I\u0027m not really clear on, is someone mentioned the best time to launch is when the starting body is \u003Cem\u003Eopposite\u003C/em\u003E the desired ejection angle, but shouldn\u0027t it really be somewhere between 70 and 120 degrees from it? Since you want to burn at the periapse... Is there any \u0022rule of thumb\u0022 someone can provide for where you want your moon of choice and kerbin\u0027s prograde/retrograde to be with relationship to each other when using this sort of maneuver? \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EYou got a lot of degrees of freedom to avoid such things, but it may be also a good argument to put the station near Mun.\u003Cp\u003ETransfer from Minmus LO to 70 km Kerbin periapsis: 160 m/s (227 without Minmus Oberth effect)\u003C/p\u003E\u003Cp\u003ETransfer from Mun LO to 70 km Kerbin periapsis: 265 m/s (375 without Mun Oberth effect)\u003C/p\u003E\u003Cp\u003EDifference between apoapsis at Mun level and Minmus level from 70 km periapsis: 66 m/s\u003C/p\u003E\u003Cp\u003ESo you spend 265 - 160 \u002B 66 = 171 m/s more if you make your station near Mun.\u003C/p\u003E\u003Cp\u003EI would almost say it\u0027s worth the added comfort.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is one other thing which makes Minmus easier--getting to the surface of minmus and back is far easier and cheaper than on Mun, so less fuel is wasted in getting to orbit. Even if you\u0027re refueling your vessel in orbit, you still need to bring fuel from wherever you\u0027re mining it to get it to the station to top off your tanks, so if you\u0027re using the moon as a fuel source, minmus is going to be the obvious choice.\u003C/p\u003E\u003Cp\u003EPerhaps it would be wise to have bases on both Mun and Minmus so if one of them isn\u0027t going to be in the right spot during a shorter launch window, we can use the other....\u003C/p\u003E\n"}]}