{"TopicId":71366,"ForumId":21,"TopicTitle":"A mostly successful attempt at an SSTO","CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-05-04T02:40:50Z","PageNum":1,"Articles":[{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-05-04T02:40:50Z","Content":"\n\u003Cp\u003EMods used:\u003C/p\u003E\u003Cp\u003EB9 Aerospace\u003C/p\u003E\u003Cp\u003EProcedural Wings\u003C/p\u003E\u003Cp\u003EMechJeb\u003C/p\u003E\u003Cp\u003EMechJebAndRemoteTechForAll.cfg\u003C/p\u003E\u003Cp\u003EKW Rocketry (I think, for the detachable tanks)\u003C/p\u003E\u003Cp\u003ENavBallTextureExport\u003C/p\u003E\u003Cp\u003EI saw an image on this forum and liked it so much that I built a rough copy of it. If someone knows who made the original please let me know so I can give him credit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/unknown-owner.jpg\u0022 alt=\u0022unknown-owner.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy version copies the fuselage design\u0027s clever use of the engine mount up front for mounting the intakes. One major bug in my design is that it simply won\u0027t fly unpowered. It flips, flops, waggles and shimmies all over the place and is dang near impossible to control unless the engines are at least at 1/3 to 1/2 throttle. I added chutes for landing. Since taking these screenshots, I have added two reaction wheels, one right behind the cockpit and the other just in front of the tail. I have yet to test it, but perhaps it will increase maneuverability while in orbit. The cockpit\u0027s built in reaction wheel just can\u0027t cut it.\u003C/p\u003E\u003Cp\u003EHere is my version:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/cargo-ssto-stats.jpg\u0022 alt=\u0022cargo-ssto-stats.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/cargo-ssto-under.jpg\u0022 alt=\u0022cargo-ssto-under.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/cargo-ssto-last-of-jets.jpg\u0022 alt=\u0022cargo-ssto-last-of-jets.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/cargo-ssto-rockets.jpg\u0022 alt=\u0022cargo-ssto-rockets.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/cargo-ssto-doors.jpg\u0022 alt=\u0022cargo-ssto-doors.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/cargo-ssto-glamor-shot.jpg\u0022 alt=\u0022cargo-ssto-glamor-shot.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/cargo-ssto-reentry.jpg\u0022 alt=\u0022cargo-ssto-reentry.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.neamerjell.com/projects/ksp/cargo-ssto-chutes.jpg\u0022 alt=\u0022cargo-ssto-chutes.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"snipekill1997","CreatedById":110158,"CreatedDateTime":"2014-05-04T18:49:47Z","Content":"\n\u003Cp\u003EYou do realize that that is not an SSTO if those detach. Also they should be liquid fuel, not oxidizer. Oxidiser is for rockets only, so you want to have it on the main craft and extra liquid fuel pods on the outside.\u003C/p\u003E\n"},{"CreatedByName":"horndgmium","CreatedById":92543,"CreatedDateTime":"2014-05-04T20:16:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022snipekill1997\u0022 data-cite=\u0022snipekill1997\u0022\u003E\u003Cdiv\u003EYou do realize that that is not an SSTO if those detach. Also they should be liquid fuel, not oxidizer. Oxidiser is for rockets only, so you want to have it on the main craft and extra liquid fuel pods on the outside.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou do realize that because they\u0027re detachable doesn\u0027t make them a necessary stage? Giving someone design advice doesn\u0027t require you to be so condescending. Also, he can put the whatever kind of fuel wherever he wants, his design doesn\u0027t require your godly input, Mr. 2nd post on the forum.\u003C/p\u003E\u003Cp\u003EIf you\u0027re going to get on here and criticize for the purpose of criticism then maybe you should just delete your account.\u003C/p\u003E\n"},{"CreatedByName":"qromodynmc","CreatedById":87139,"CreatedDateTime":"2014-05-04T21:28:39Z","Content":"\n\u003Cp\u003EYou guys just started an argument which I was wondering,If a space plane uses droptanks,is it count as ssto? I mean droptanks are used very much in real life by fighter planes,I dont think it would be a big money problem.\u003C/p\u003E\n"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-05-05T02:36:48Z","Content":"\n\u003Cp\u003EActually, my mistake. The detachable tanks are indeed fuel-only tanks. And okay, so its actually a TSTO, if you want to argue semantics. I was hoping for some input on the flippy-floppy, almost uncontrollable unpowered flight. It does not glide at all. In fact, given its way, I think it would land tail first, based on its tendency to flip over at low speeds. \u003C/p\u003E\u003Cp\u003EOne idea I was thinking of was using Infernal Robotics to build F-14 Tomcat style wings that I could reposition when needed. Anybody have a better idea?\u003C/p\u003E\n"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-05-05T02:41:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022horndgmium\u0022 data-cite=\u0022horndgmium\u0022\u003E\u003Cdiv\u003EYou do realize that because they\u0027re detachable doesn\u0027t make them a necessary stage? Giving someone design advice doesn\u0027t require you to be so condescending. Also, he can put the whatever kind of fuel wherever he wants, his design doesn\u0027t require your godly input, Mr. 2nd post on the forum.\u003Cp\u003EIf you\u0027re going to get on here and criticize for the purpose of criticism then maybe you should just delete your account.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are over reacting. He\u0027s totally right. It was my mistake - they are indeed fuel only tanks, and the fact that they are detachable makes my creation a Two Stage To Orbit (TSTO).\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2014-05-05T02:43:50Z","Content":"\n\u003Cp\u003EYou could use action groups for the drop tanks, and combine the stages, thus still being a SSTO.\u003C/p\u003E\n"},{"CreatedByName":"brianorca","CreatedById":109756,"CreatedDateTime":"2014-05-05T02:52:40Z","Content":"\n\u003Cp\u003EShow us a screen shot with the center of gravity and center of lift in the hanger. (Those are the buttons in the lower left.) A good airplane will have the CG forward of the lift center, but not by too much. Getting those backwards could cause the behavior you describe.\u003C/p\u003E\n"},{"CreatedByName":"RSF77","CreatedById":88474,"CreatedDateTime":"2014-05-05T03:51:17Z","Content":"\n\u003Cp\u003EI don\u0027t think drop tanks qualify as a \u0022stage\u0022 in the same sense that it does a rocket launch vehicle, even if they do have intakes. It just so happens that in KSP even some minute things can only (or conveniently) be taken care of in the staging sequence, there are plenty of ways to jettison things without the use of stages if you want to get that nitpicky about it. Plenty of \u0022SSTOs\u0022 in ksp use staging to drop tanks or whatever else, in the real world I don\u0027t think this would really be considered an actual staging event like cutting a rocket in half.\u003C/p\u003E\u003Cp\u003EAdding intakes to drop tanks is actually a good idea within the context of the game I think, maybe not so realistic but I hadn\u0027t thought of it yet. I might have to take the extra step in putting a jet engine on the same drop pod just to convince myself that I\u0027m not cheating.\u003C/p\u003E\u003Cp\u003EAlso to OP, speaking of cheating, I usually spam reaction wheels all over my ssto designs to ensure maneuverability within a certain amount of reason. Aerodynamic flight in ksp seems to still be a WIP so a workaround here and there isn\u0027t against the rules, hell... nothing is... its a sandbox game, do what you want.\u003C/p\u003E\n"},{"CreatedByName":"horndgmium","CreatedById":92543,"CreatedDateTime":"2014-05-05T04:13:56Z","Content":"\n\u003Cp\u003EI think the fact that they\u0027re detachable doesn\u0027t automatically make it not an SSTO -- do you require dropping the tanks to get to a stable orbit? Still an ssto if you deplete the fuel but hold onto the tanks. Also, is it possible to get the ship to orbit without pulling much of the fuel from the drop tanks?\u003C/p\u003E\u003Cp\u003EEdit: plus, the drop tanks don\u0027t have engines do they?\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2014-05-05T05:22:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022neamerjell\u0022 data-cite=\u0022neamerjell\u0022\u003E\u003Cdiv\u003EActually, my mistake. The detachable tanks are indeed fuel-only tanks. And okay, so its actually a TSTO, if you want to argue semantics. I was hoping for some input on the flippy-floppy, almost uncontrollable unpowered flight. It does not glide at all. In fact, given its way, I think it would land tail first, based on its tendency to flip over at low speeds. \u003Cp\u003EOne idea I was thinking of was using Infernal Robotics to build F-14 Tomcat style wings that I could reposition when needed. Anybody have a better idea?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI could be wrong, but I don\u0027t think the stock aerodynamics would take the wing position into account. Besides, those wings move to allow for better maneuverability when slow while also providing less drag when fast, I don\u0027t think that\u0027s a problem you\u0027ll run into on a launch. You might just want to try larger wings for more lift.\u003C/p\u003E\n"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-05-05T13:03:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt. Hunt\u0022 data-cite=\u0022Capt. Hunt\u0022\u003E\u003Cdiv\u003EI could be wrong, but I don\u0027t think the stock aerodynamics would take the wing position into account. Besides, those wings move to allow for better maneuverability when slow while also providing less drag when fast, I don\u0027t think that\u0027s a problem you\u0027ll run into on a launch. You might just want to try larger wings for more lift.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELaunching is no problem, except it takes the entire runway because my rear landing gear are so far back to prevent tail strikes. Landing is dang near impossible. I thought of a swing-wing setup to reposition my center of lift vs my center of mass on the fly.\u003C/p\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2014-05-05T14:39:54Z","Content":"\n\u003Cp\u003EDoing swing wings with infernal is difficult on anything that size due to the fact that the infernal parts can wobble quite a bit unless you put quite a bit of effort in to getting things strutted just right in a way that wont cause the physics to go all explodey on you. I would say the first thing you might want to look at instead would be TAC fuel balancer, if your COM is drifting during flight you can balance out all your fuel and keep it (mostly) constant, as long as you have the same percent of fuel both in front and rear. You can turn \u0022balance all\u0022 on for both liquid and oxy at launch and it will stay on through your whole flight as long as the craft remains focused.\u003C/p\u003E\n"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-05-06T02:02:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KeithStone\u0022 data-cite=\u0022KeithStone\u0022\u003E\u003Cdiv\u003EDoing swing wings with infernal is difficult on anything that size due to the fact that the infernal parts can wobble quite a bit unless you put quite a bit of effort in to getting things strutted just right in a way that wont cause the physics to go all explodey on you. I would say the first thing you might want to look at instead would be TAC fuel balancer, if your COM is drifting during flight you can balance out all your fuel and keep it (mostly) constant, as long as you have the same percent of fuel both in front and rear. You can turn \u0022balance all\u0022 on for both liquid and oxy at launch and it will stay on through your whole flight as long as the craft remains focused.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is exactly what puzzles me; the front engine mount, turned around and used to mount the intakes and cockpit, and the two auxiliary tanks underneath are the only fuel and oxidizer I have - and the two under-slung tanks have fuel lines pumping to the center tank like asparagus staging, so if anything, the weight pretty much stays up front. If you look at the final screenshot, you will see that I still have about half my fuel left at landing, and it still wanted to flip. I\u0027m gonna go into SPH and drain the fuel tanks completely and see where my COM is. I will report my findings soon.\u003C/p\u003E\n"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-05-06T03:43:59Z","Content":"\n\u003Cp\u003ESolved my problem of low speed instability! I drained the fuel down to half and the COM moved WAY behind the COL! I was very surprised. I had to use 10T worth of Lack Luster Labs counter weights on the nose to compensate, and moved my drop tanks to the very rear. \u003C/p\u003E\u003Cp\u003ETo answer horndgmium\u0027s questions: Do I require dropping the tanks to get to orbit? No, but I end up using a third of my rocket fuel to get the last 15km. I usually drop them to shed the extra mass and drag. I totally drain the drop tanks by the time I switch to rockets at about 25-27km, they are for getting me into the upper atmosphere and leaving the main fuel/oxidizer tank for rocket only use. My original intention was to be able to take this thing to Minmus and back, or at least the Mun. And the drop tanks have NO engines, just extra intakes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-06T04:23:17Z\u0022 title=\u002205/06/2014 04:23  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 6, 2014\u003C/time\u003E by neamerjell\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-05-06T09:27:24Z","Content":"\n\u003Cp\u003ETechnically, if you dropped the fuel tanks WHILE in orbit, it would still be a SSTO because single stage to orbit doesn\u0027t have anything to do with staging WHILE in orbit. WHILE is a very nice word.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}