{"TopicId":71474,"ForumId":24,"TopicTitle":"Hello","CreatedByName":"bgrac17","CreatedById":108948,"CreatedDateTime":"2014-05-05T12:13:23Z","PageNum":1,"Articles":[{"CreatedByName":"bgrac17","CreatedById":108948,"CreatedDateTime":"2014-05-05T12:13:23Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EHi\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI am not new to ksp but I still consider my self a rocket science noob. I am new to the forums and i have nearly mastered most things in KSP (docking, SCIENCE!, landing etc) yet there is only one thing that i try time after time and constantly fail... Space planes, i just can\u0027t build Space planes that take off from the runway, so if anyone would be willing to give me tips i would love any advice. specifically the accent path from runway to orbit and TWR of jets and rockets that is required so please help me and thanks in advance.\u003C/p\u003E\u003Cp\u003EAlso Space Shuttle design as in the kind that are launch on the back of a rocket. how do i set the engines so that my entire thing doesn\u0027t spin in orbit due to weird COM? and any launch advice would be appreciated.\u003C/p\u003E\u003Cp\u003EAgain thanks in advance for any advice:D.\u003C/p\u003E\n"},{"CreatedByName":"Horan","CreatedById":104785,"CreatedDateTime":"2014-05-05T13:06:36Z","Content":"\n\u003Cp\u003EI had the same thing, and I just try to make space planes, You need to know some basics \u003C/p\u003E\u003Cp\u003EHere --\u0026gt; \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52080-Basic-Aircraft-Design-Explained-Simply-With-Pictures\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/52080-Basic-Aircraft-Design-Explained-Simply-With-Pictures\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut I found nothing else that really helped my designs, other than trial and error\u003C/p\u003E\n"},{"CreatedByName":"Thomas.B","CreatedById":110329,"CreatedDateTime":"2014-05-05T14:02:52Z","Content":"\n\u003Cp\u003EIm beating myself up cause i cant get some of my mods to work ever since the update. How does one buid a sat without IR or magic smoke ??? LOL very hard and too simple for me\u003C/p\u003E\n"},{"CreatedByName":"Xaelath","CreatedById":106084,"CreatedDateTime":"2014-05-05T14:48:11Z","Content":"\n\u003Cp\u003EHello and welcome to the forums.\u003C/p\u003E\u003Cp\u003EI usually build them from trial and error, and all my spaceplanes have followed a design that they all have lot of wings and control surfaces.\u003C/p\u003E\n"}]}