{"TopicId":71542,"ForumId":29,"TopicTitle":"UrlDir stuff, need help figuring it out.","CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2014-05-06T07:53:05Z","PageNum":1,"Articles":[{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2014-05-06T07:53:05Z","Content":"\n\u003Cp\u003EHey all,\u003C/p\u003E\u003Cp\u003EI would like to know if anyone have any experience using the UrlDir class of KSP?\u003C/p\u003E\u003Cp\u003EI am mainly looking to create/save/load config files from it to avoid having to reload all the database. (since PartLoader functions are privates)\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2014-05-06T08:37:35Z","Content":"\n\u003Cp\u003EWell, they work. I use them in LoD to hide textures from GameDatabase so KSP doesn\u0027t [re]load them and as an way to find files in KSP in general, since those structure exist anyway. But its only an abstraction of the file system and to find configs its probably easier to use GameDatabase.Instance.GetConfigs(\u0022PART\u0022 / \u0022INTERNAL\u0022). To manipulate those abstraction just UrlDir.files / .children, but i wouldn\u0027t expect changes to automatically appear in GameDatabase...\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2014-05-06T10:05:00Z","Content":"\n\u003Cp\u003EThanks Faark (again).\u003C/p\u003E\u003Cp\u003EI can save without problem without them, I would like to reload the config file I save to avoid reloading the all database. and so far I haven\u0027t found a way. Everything I need is in private (for the PartLoader), and I can\u0027t find any other way to add a config file to the database while the game is running.\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2014-05-06T12:48:59Z","Content":"\n\u003Cp\u003EDoesn\u0027t seem possible to me. You might be able to add an AvailablePart you have created (or copied and modified) yourself to PartLoader.Instance.parts, but i don\u0027t even want to know what special cases like reloading the GameDatabase you have to consider...\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2014-05-06T13:13:22Z","Content":"\n\u003Cp\u003EStill my welding tool, reloading the all database to load the config file I have welded bring lot of problem when used with lot of parts mods.\u003C/p\u003E\u003Cp\u003EAlso I am cnsidering linking the weld parts to the save file. and only load the config file I need considering of the saved file played (easier career management).\u003C/p\u003E\u003Cp\u003EI do have a configNode that is clean and already in memory so maybe I can add that one to the PartLoader without reading the config file (for after the completion of the welding). I don\u0027t change any of the Part data anymore.\u003C/p\u003E\u003Cp\u003EEdit: Humm let\u0027s add a question \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat does KSP does to create an available part in the game?\u003C/p\u003E\u003Cp\u003EI can get the config node, maybe I can manually create the part myself.\u003C/p\u003E\u003Cp\u003EI guess it would be quite crazy to think of doing it, considering it could break for every update!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-06T14:03:42Z\u0022 title=\u002205/06/2014 02:03  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 6, 2014\u003C/time\u003E by UbioZur\u003C/strong\u003E\n\u003C/span\u003E\n"}]}