{"TopicId":71541,"ForumId":44,"TopicTitle":"Calculating Day/night Cycles","CreatedByName":"meatballcannon","CreatedById":57514,"CreatedDateTime":"2014-05-06T06:26:27Z","PageNum":1,"Articles":[{"CreatedByName":"meatballcannon","CreatedById":57514,"CreatedDateTime":"2014-05-06T06:26:27Z","Content":"\n\u003Cp\u003ESo I\u0027ve been planning a kethane base on the mun, and I was wondering how much battery power would be required to fill my reserves while my kerbals are on the dark side of the mun.\u003C/p\u003E\u003Cp\u003ERather than fudging it or using a generator, I decided to simply learn how to do the math.\u003C/p\u003E\u003Cp\u003EAs I understood it, \u003Cstrong\u003Eif\u003C/strong\u003E the mun was tidally locked, Then it my base would have a day of 1/2 of a munar orbit. However, since the mun, Kerbin, and Kerbol are all in the same plane, There would be a rather lengthy eclipse every day, right? And to make matters worse, the mun \u003Cstrong\u003Eisn\u0027t\u003C/strong\u003E tidally locked.\u003C/p\u003E\u003Cp\u003ESo as I understand it, the rotation of the mun is its sidereal rotation, and the time for one of these to complete is 1 day, 14 hours, 36 minutes, and 24.4 seconds. Am I doing this right?\u003C/p\u003E\u003Cp\u003EAnyway, this looks like a related rates problem to me, but I don\u0027t know how to set it up, and I\u0027m not sure how to handle the eclipse. Any ideas?\u003C/p\u003E\n"},{"CreatedByName":"TheShadow1138","CreatedById":53694,"CreatedDateTime":"2014-05-06T14:56:11Z","Content":"\n\u003Cp\u003EAccording to the wiki, the MÃƒÂ¼n is indeed tidally locked with Kerbin, and i don\u0027t believe that the eclipse that would take place every MÃƒÂ¼nar day actually affects the solar panels as it would in reality. I believe you should use the Synodic Rotation, which in the case of the MÃƒÂ¼n (someone correct me if I\u0027m wrong here), should be the same as the Synodic Orbital Period since it is tidally locked. So, it\u0027s actually, as far as the game is concerned, a fairly simple problem. You only need to have enough battery power to get you through half of the Synodic Orbital Period, or 19h 35m and 57.7 seconds.\u003C/p\u003E\n"},{"CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-05-06T15:15:01Z","Content":"\n\u003Cp\u003EI\u0027d say don\u0027t worry about the eclipse. The Mun is going fast enough that it\u0027ll be negligible compared to the night. If your base gets through the night, it will certainly survive the eclipse.\u003C/p\u003E\u003Cp\u003EAs said above, the Mun \u003Cstrong\u003Eis\u003C/strong\u003E tidally locked and the Munar night is half the synodic orbital period, which is indeed the number mentioned by the poster above me.\u003C/p\u003E\n"},{"CreatedByName":"meatballcannon","CreatedById":57514,"CreatedDateTime":"2014-05-06T23:58:56Z","Content":"\n\u003Cp\u003EOk. I guess sidereal rotation wasn\u0027t what I needed. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2014-05-08T19:34:07Z","Content":"\n\u003Cp\u003ENo need to get fancy. \u003C/p\u003E\u003Cp\u003EKerbin is 1.2 Mm in diameter and 12 Mm away from the moon.\u003C/p\u003E\u003Cp\u003EThus the angular size of Kerbin from the Munar surface is atan(0.1) ~= 0.1 radians ~= 5.7 degrees.\u003C/p\u003E\u003Cp\u003EIf your solar panels track Kerbol, then you lose 0.1/pi ~= 5.7/180 ~= 3.2% of your Munar daylight to eclipse.\u003C/p\u003E\u003Cp\u003EIf your solar panels do not track Kerbol, then you lose sin(0.1)/2 = 5% of your solar power.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-08T19:50:41Z\u0022 title=\u002205/08/2014 07:50  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 8, 2014\u003C/time\u003E by Yasmy\u003C/strong\u003E\n\u003C/span\u003E\n"}]}