{"TopicId":71555,"ForumId":24,"TopicTitle":"Hello official community","CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-05-06T14:03:05Z","PageNum":1,"Articles":[{"CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-05-06T14:03:05Z","Content":"\n\u003Cp\u003EI would also like to say hello to everyone here.\u003C/p\u003E\u003Cp\u003EI\u0027ve been playing for about 8 to 9 months, have landed nearly everywhere*, have been posting on the Steam forums since about that time, have been reading these forums regularly for a while as well and now found the need to sign up here, to pitch in at the very least occasionally.\u003C/p\u003E\u003Cp\u003E *though not always with a manned return mission, although, if it was manned, I always found a way to get the guys home again.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-06T15:16:16Z\u0022 title=\u002205/06/2014 03:16  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 6, 2014\u003C/time\u003E by RenevB\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"Boosterspice","CreatedById":58629,"CreatedDateTime":"2014-05-06T15:09:50Z","Content":"\n\u003Cp\u003EHeeellloooooo! Congrats on joining the forum \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E There is no harm in participating here, feel free to say what you want (mostly) ^^\u003C/p\u003E\n"},{"CreatedByName":"Xaelath","CreatedById":106084,"CreatedDateTime":"2014-05-06T15:10:53Z","Content":"\n\u003Cp\u003EHi and welcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ERegistering at the forums is always the best choice. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, nice achievements you have there!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-05-07T01:55:24Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Glad to hear that you\u0027ve been enjoying the game. You say you\u0027ve visited almost all of the different bodies in the game; do you have a particular \u0022favorite\u0022 that you like to visit more than any of the others?\u003C/p\u003E\u003Cp\u003EFeel free to contribute where you can!\u003C/p\u003E\n"},{"CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-05-07T10:25:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Glad to hear that you\u0027ve been enjoying the game. You say you\u0027ve visited almost all of the different bodies in the game; do you have a particular \u0022favorite\u0022 that you like to visit more than any of the others?\u003Cp\u003E Feel free to contribute where you can!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan\u0027t say I have a clear favourite. I do have one very clear un-favourite. Moho. I\u0027ve done a couple of flybys, all intentional (except the first... that was planned as an orbit mission), and one manned mission, that safely returned after an Eve gavity assist, since the direct route would have taken too much delta-v. But that was too much frustration and not enough fun.\u003C/p\u003E\u003Cp\u003E(Should I boast? Yeah, why not.) Well, I\u0027ve actually been in the SoI of all bodies, haven\u0027t landed on Tylo or Pol (never even orbited the former) and Pol and Eeloo have only seen probe missions. As has Eve\u0027s surface, and ... well let\u0027s keep it at that, don\u0027t want this post getting too long.\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-05-08T21:38:30Z","Content":"\n\u003Cp\u003EWell, you\u0027ve clearly identified the \u0022Evil 3\u0022 in Eve, Tylo, and Moho. I think it is really fun that each one poses a completely different challenge so that there is no particular \u0022one size fits all\u0022 solution.\u003C/p\u003E\u003Cp\u003EI used to include Laythe in that list, but have since decided that it doesn\u0027t rank with the others, although missing teeny islands by a few km and splashing into the ocean is never a good start to a mission. Welcome aboard!\u003C/p\u003E\n"}]}