{"TopicId":71656,"ForumId":34,"TopicTitle":"DarkMultiPlayer 0.3.8.0 [KSP 1.12.0]","CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-05-07T13:17:56Z","PageNum":47,"Articles":[{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2015-01-16T21:30:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wabbit\u0022 data-cite=\u0022Wabbit\u0022\u003E\u003Cdiv\u003ESo how does time warp work in multiplayer?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour own private time subspace until u synch with others manually.\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-17T01:24:46Z","Content":"\n\u003Cp\u003E@silvanus: While I agree that docking is really important to a multiplayer mod (player-player docking has a certain magic to it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E), it\u0027s not the highest priority issue. For example, this one is a pretty bad problem for DMP: \u003Ca href=\u0022http://imgur.com/kzQgabf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/kzQgabf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E@BenVilhaven: If it\u0027s on the server console, you need to prepend them with /.\u003C/p\u003E\u003Cp\u003EAdmins mean they basically have console access to the server - this should almost always be only the server owner, you don\u0027t get any other special access.\u003C/p\u003E\u003Cp\u003ETo spectate a player, just try to fly the ship they are in. I\u0027ll probably make a spectate button on the status UI one day, but it needs a bit of a rework.\u003C/p\u003E\u003Cp\u003E@DMSP: Hit add server in the main menu - if it didn\u0027t show up then the mod is likely not installed correctly, or you\u0027re trying to use DMP 0.2.0.x with an older version of KSP.\u003C/p\u003E\u003Cp\u003E@Wabbit: You kind of need to understand 2 things to explain time warp, the first is that updates from the past are applied, but updates from the future are held back. So you get this long timeline that plays out as your time passes the time the updates were sent.\u003C/p\u003E\u003Cp\u003EThe next thing is that players can play in different times - KSP\u0027s universe time is locked to the server system clock via something I call a \u0022subspace\u0022, it just marks the time to sync to.\u003C/p\u003E\u003Cp\u003EWhen you warp, you create a new subspace that other players can sync to, syncing just jumps your time to theirs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EThis also can cause paradoxes that are currently unsolved - for example, if a player in the future is sitting on the runway, but you\u0027re 5 minutes in the past, a time before the other player launched, they won\u0027t be there yet. However, on their screen the update has been applied - so they see you moving. You can literally drive through players that are in the future and cause them to explode.\u003C/p\u003E\n"},{"CreatedByName":"BenVilhaven","CreatedById":135630,"CreatedDateTime":"2015-01-17T02:40:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E@BenVilhaven: If it\u0027s on the server console, you need to prepend them with /.\u003C/p\u003E\u003Cp\u003EAdmins mean they basically have console access to the server - this should almost always be only the server owner, you don\u0027t get any other special access.\u003C/p\u003E\u003Cp\u003ETo spectate a player, just try to fly the ship they are in. I\u0027ll probably make a spectate button on the status UI one day, but it needs a bit of a rework.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for that\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-01-17T10:47:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E@DMSP: Hit add server in the main menu - if it didn\u0027t show up then the mod is likely not installed correctly, or you\u0027re trying to use DMP 0.2.0.x with an older version of KSP.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! Also, how do I make my own DMP server? I have a save that people could play on.\u003C/p\u003E\u003Cp\u003EThanks, DMSP\u003C/p\u003E\n"},{"CreatedByName":"aratnamedsammy","CreatedById":126432,"CreatedDateTime":"2015-01-17T15:08:15Z","Content":"\n\u003Cp\u003Eunstable... and not what i expected as a multi-player.. i dont even call it a multi player, its everyone play on same solar system, but cannot do anything toghether, not follow you as passenger.. im very dissapointed\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-01-17T15:21:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022aratnamedsammy\u0022 data-cite=\u0022aratnamedsammy\u0022\u003E\u003Cdiv\u003Eunstable... and not what i expected as a multi-player.. i dont even call it a multi player, its everyone play on same solar system, but cannot do anything toghether, not follow you as passenger.. im very dissapointed\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, this is experimental. It is a great achievement in my perspective.\u003C/p\u003E\n"},{"CreatedByName":"jman508","CreatedById":122550,"CreatedDateTime":"2015-01-17T20:40:57Z","Content":"\n\u003Cp\u003Eyeah how does one make a server.\u003C/p\u003E\u003Cp\u003EPancake Aerospace is looking into making a dmp server and i cant find any youtube tutorials on how to host your own server for others to use.\u003C/p\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2015-01-18T09:01:20Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003Eive no idea what youve played but it wasnt DMP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eyou can spactate other players and take pilote their vessels if they dont.\u003C/p\u003E\u003Cp\u003EYou can interact with other players while youre in the same time (Just click sync).\u003C/p\u003E\u003Cp\u003EAbout setting up a server: Theres a wiki on d-mp.org explaining how to do it. \u003C/p\u003E\u003Cp\u003EBut baisicly you need some sort of computer (one in a datacenter is prefered but home ones work) and in the case of linux / macos the mono runtime.\u003C/p\u003E\u003Cp\u003EJUst dl the server files onto that server. and start it (using the mono runtime \u0022mono your.exe\u0022 on linux/macos) \u003C/p\u003E\u003Cp\u003Eif your behind a firewall or nat dont forget to forward/unblock your server port\u003C/p\u003E\u003Cp\u003Eoptional step: install the reporting plugin (see wiki on d-mp.org for details) to get listed on the server list.\u003C/p\u003E\n"},{"CreatedByName":"Spekular","CreatedById":134752,"CreatedDateTime":"2015-01-18T15:22:14Z","Content":"\n\u003Cp\u003E@VITAS @godarklight I just want to say, sorry for asking for help and then just disappearing. Your posts have been tremendously helpful and I think I know how to fix my issues now (the example about subnets was very useful). I broke my PuTTy connection messing around with changing my Pi\u0027s ip to one that would be part of the same subnet, but I\u0027m pretty sure I know how to fix it. Hopefully. I\u0027ll report back later I guess \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-18T17:19:44Z\u0022 title=\u002201/18/2015 05:19  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 18, 2015\u003C/time\u003E by Spekular\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-18T22:34:10Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://twitter.com/Maxmaps/status/556911976602157057\u0022 rel=\u0022external nofollow\u0022\u003EWell, this is interesting \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XX2a9B8.png\u0022 alt=\u0022XX2a9B8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E@DMSP/jman508: DMPServer is pretty simple, download it, double click DMPServer and you have a stock server config. If you want to start it off with an existing save, open KSP, and in the DMP options menu there will be a \u0022Generate universe\u0022 button. You can then move the Universe folder from KSP to DMPServer.\u003C/p\u003E\u003Cp\u003EIf you\u0027re modded, you\u0027ll also want to generate a DMPModControl.txt and move that to the server too.\u003C/p\u003E\u003Cp\u003E@aratnamedsammy: DMP still has its fair share of krakens, but I haven\u0027t had the guts to call it even beta yet when there are so many problems that are far too easy to run into. For some it works well enough, for others, not so much.\u003C/p\u003E\u003Cp\u003E@Spekular: One day I really need to do an IP tutorial to explain how some of this stuff works, It\u0027s kind of simple once you know how it works, but there\u0027s enough things that are going on all at once that could become confusing.\u003C/p\u003E\n"},{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2015-01-19T20:23:14Z","Content":"\n\u003Cp\u003EEver flew someone else\u0027s vessel on a server and thought how neat it would be to download that craft and use it yourself, only to find that they never shared it in their craft library?\u003C/p\u003E\u003Cp\u003EEver launched that perfect ship, but forgot to save your craft file?\u003C/p\u003E\u003Cp\u003EEver visited an old savegame but lost all your craft files, wishing you could build them again?\u003C/p\u003E\u003Cp\u003EFret no more.\u003C/p\u003E\u003Cp\u003EClaw developed a neat unlisted addin called InflightShipSave:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/ClawKSP/InflightShipSave\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/ClawKSP/InflightShipSave\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESave it to your GameData, then fly your desired ship. Hit F6 to save a rescued copy of your actively piloted vessel as a brand spanking new craft file in your VAB!\u003C/p\u003E\u003Cp\u003EI thought the DMP thread would appreciate mention of this tool. \u003C/p\u003E\u003Cp\u003Edarklight,\u003C/p\u003E\u003Cp\u003EPerhaps DMP could incorporate this code? Perhaps allow admins the option of saving every vessel launched on the server in a Server Craft Library?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-19T20:29:00Z\u0022 title=\u002201/19/2015 08:29  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 19, 2015\u003C/time\u003E by inigma\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-01-19T22:17:35Z","Content":"\n\u003Cp\u003E@inigma: I am not sure if the mod should be integrated on DMP, that could be an easy way to steal other people\u0027s designs, and people don\u0027t always want to share.\u003C/p\u003E\u003Cp\u003ESo, leaving as is, its up to the server to allow or deny it, a possible complex craft sharing system, with paying for designs and everything could be implemented on the future, having such mod integrated would ruin it.\u003C/p\u003E\u003Cp\u003EUnless its toggleable on the server side, ofc.\u003C/p\u003E\n"},{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2015-01-20T00:08:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003E@inigma: I am not sure if the mod should be integrated on DMP, that could be an easy way to steal other people\u0027s designs, and people don\u0027t always want to share.\u003Cp\u003ESo, leaving as is, its up to the server to allow or deny it, a possible complex craft sharing system, with paying for designs and everything could be implemented on the future, having such mod integrated would ruin it.\u003C/p\u003E\u003Cp\u003EUnless its toggleable on the server side, ofc.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a great mod for those who build, and fly, but forgot to save their creations or overwrote their craft with something newer and more broken. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nebfer","CreatedById":3043,"CreatedDateTime":"2015-01-20T03:59:39Z","Content":"\n\u003Cp\u003EHelp getting the mod to work. Me and some friends where trying to get the mod to work, but none of use seems to be able to connect to the server, that we set up. None of us could connect to the host, at best saying it could not connect due it timing out or that the host was not responding in a timely manor.\u003C/p\u003E\u003Cp\u003ENone of us could think of anything being done wrong.\u003C/p\u003E\u003Cp\u003Ehost started up the server, and we trying to join, entered the IP and port, but none could connect.\u003C/p\u003E\n"},{"CreatedByName":"BenVilhaven","CreatedById":135630,"CreatedDateTime":"2015-01-20T08:18:34Z","Content":"\n\u003Cp\u003EIs it possible to log into your user name on a server from more than one place. Obviously it is at different times. I am at my friends place and want to advance my career, but when I try to log in using my login name all I get is an \u0022Invalid Key for User\u0022 response. Ideas? \u003C/p\u003E\u003Cp\u003E@nebfer Need more details to offer advice. Are you all on the same LAN or are you connecting through the web? Could be port forwarding or something like that, easy enough to stuff up.\u003C/p\u003E\n"},{"CreatedByName":"Awesome_Guy","CreatedById":96161,"CreatedDateTime":"2015-01-20T14:36:19Z","Content":"\n\u003Cp\u003EHi, I cant seem to connect to any sever. it keeps timing out\u003C/p\u003E\u003Cp\u003EI\u0027ve tried a few from the sever list and even a local one. It times out either after \u0022handshaking\u0022 or \u0022syncing sever clock\u0022\u003C/p\u003E\u003Cp\u003EIm also not sure im entering the information properly in terms of the port after the address with the colon or instead putting it in the port box.\u003C/p\u003E\u003Cp\u003EThanks in advance\u003C/p\u003E\n"},{"CreatedByName":"nebfer","CreatedById":3043,"CreatedDateTime":"2015-01-21T01:33:21Z","Content":"\n\u003Cp\u003EIt\u0027s web not a LAN\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-21T01:56:38Z","Content":"\n\u003Cp\u003E@nebfer/Awesome_Guy I\u0027ll likely need a log file, I think KSP_folder/KSP.log is fine to use these days. Upload it to a site like \u003Ca href=\u0022www.pastebin.com\u0022 rel=\u0022external nofollow\u0022\u003Ewww.pastebin.com\u003C/a\u003E and paste the link in here (or PM it)\u003C/p\u003E\u003Cp\u003EThe port goes in the seperate port box, just use the hostname/ip for the address box.\u003C/p\u003E\u003Cp\u003E@BenVilhaven: DMP protects player names with a private/public key pair. You need to copy GameData/DarkMultiPlayer/Plugins/Data/[private/public]key.txt to the other computers you wish to use the username from.\u003C/p\u003E\n"},{"CreatedByName":"Awesome_Guy","CreatedById":96161,"CreatedDateTime":"2015-01-21T20:16:39Z","Content":"\n\u003Cp\u003E@godarklight i managed to connect to my local sever but not and external one\u003C/p\u003E\u003Cp\u003Ehere is the log file \u003Ca href=\u0022http://pastebin.com/eRvRxXaE\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/eRvRxXaE\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-23T14:38:30Z","Content":"\n\u003Cp\u003E@Awesome_Guy: \u0022An established connection was aborted by the software in your host machine\u0022 is almost always caused by a firewall :-/\u003C/p\u003E\u003Cp\u003E@(Someone/Everyone): Looks like there\u0027s some issues I have missed with the kerbal experience system that\u0027s causing DMP to refuse to join multiplayer servers, I\u0027ll attack that one tomorrow \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E@Everyone, just so you know I haven\u0027t been completely slacking off, I\u0027ve pretty much finished my (much needed) rework on the warp system. \u0022Kicked for creating subspace\u0022 is gone, and MCW_LOWEST/SUBSPACE_SIMPLE have finally been implemented. Here\u0027s an overview of all the available warp modes: \u003Ca href=\u0022http://imgur.com/a/1hIco\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/1hIco\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECurrently it\u0027s in a custom branch while I poke this with a stick until it\u0027s mostly bug free, but it\u0027s mostly completed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"longbyte1","CreatedById":17521,"CreatedDateTime":"2015-01-23T23:13:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E@Everyone, just so you know I haven\u0027t been completely slacking off, I\u0027ve pretty much finished my (much needed) rework on the warp system. \u0022Kicked for creating subspace\u0022 is gone, and MCW_LOWEST/SUBSPACE_SIMPLE have finally been implemented. Here\u0027s an overview of all the available warp modes: \u003Ca href=\u0022http://imgur.com/a/1hIco\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/1hIco\u003C/a\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice! I imagine that with so many warp settings, there might be a public \u0022mission control\u0022 server in the future where you can competently play a game of Kold War with some 5 other random strangers. Or your friends!\u003C/p\u003E\n"},{"CreatedByName":"Effect","CreatedById":136504,"CreatedDateTime":"2015-01-24T21:30:28Z","Content":"\n\u003Cp\u003EHello \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/95113-godarklight\u0022 rel=\u0022external nofollow\u0022\u003Egodarklight\u003C/a\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003E i have a problem when i am trying to connect to my own serve \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003E. My friend can connect to it but i can\u0027t, it gives me this error: \u003C/span\u003E\u003Ca href=\u0022http://i.imgur.com/5R54zup.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/5R54zup.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe game is port forwarded so its not from hamachi.\u003C/p\u003E\u003Cp\u003EThis is what happens: i enter the game, i select my server it connects, and after that a screen appeares that has the folowing thing:warp x1 on top, the chat on the left, the list of players on and the background is black, i cant see the base and after 1-2 seconds the game crashes and the error apeares in the dmp server cmp.\u003C/p\u003E\u003Cp\u003EAny solutions?\u003C/p\u003E\u003Cp\u003ESorry if this was already posted. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"uxuser","CreatedById":92549,"CreatedDateTime":"2015-01-24T21:44:03Z","Content":"\n\u003Cp\u003EHey, I\u0027ve been having trouble with my DMP,\u003C/p\u003E\u003Cp\u003EEach time I try to join any server, it give me this message: DNS Error. No such host is known.\u003C/p\u003E\u003Cp\u003ECould you please help?\u003C/p\u003E\n"},{"CreatedByName":"longbyte1","CreatedById":17521,"CreatedDateTime":"2015-01-24T22:03:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022uxuser\u0022 data-cite=\u0022uxuser\u0022\u003E\u003Cdiv\u003EHey, I\u0027ve been having trouble with my DMP,\u003Cp\u003EEach time I try to join any server, it give me this message: DNS Error. No such host is known.\u003C/p\u003E\u003Cp\u003ECould you please help?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou seem to be entering the address incorrectly. Make sure that the port is not in the address.\u003C/p\u003E\n"},{"CreatedByName":"uxuser","CreatedById":92549,"CreatedDateTime":"2015-01-24T22:19:44Z","Content":"\n\u003Cp\u003E@longbyte1, Nope the address is being put in correctly. And port is staying the same as always.\u003C/p\u003E\u003Cp\u003EAny other responses? My cousin and I would like to play together.\u003C/p\u003E\u003Cp\u003EEDIT: Fixed, I was putting the port in with the address \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T01:47:32Z\u0022 title=\u002201/25/2015 01:47  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by uxuser\u003C/strong\u003E\n\u003Cbr\u003EEDIT\n\u003C/span\u003E\n"}]}