{"TopicId":71728,"ForumId":25,"TopicTitle":"Pinpoint landing challenge","CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2014-05-08T05:56:41Z","PageNum":1,"Articles":[{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2014-05-08T05:56:41Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003EPinpoint landing challenge\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI had assumed that someone had come up with this challenge in the past but, a quick search found nothing. So...\u003C/p\u003E\u003Cp\u003EIf you\u0027ve tried landing on the VAB and succeeded, this will challenge you further.\u003C/p\u003E\u003Cp\u003EThis challenge sounds very simple but is rather challenging and shouldn\u0027t take too long to complete. \u003Cstrong\u003ELand on the KSC water tower.\u003C/strong\u003E That\u0027s it. What makes it challenging is, whenever you fly over an object your altitude adjusts according to the height of that object. For example, if you fly over a building that has a height of 100m and you\u0027re flying at an altitude of 100m, the instant you go above that building, your altitude raises to 200m. When you fly past it, your altitude drops back to 100m. Because the water tower is such a small, yet elevated target, you first need to position yourself directly above it without moving horizontally in order to stabilize your altitude and then lower your craft on top of it. Easy? Right? (BTW, I was just goofing off with this plane which I made for another challenge when I attempted this and decided it might be a fun challenge.)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERules\u003C/strong\u003E: \u003C/p\u003E\u003Cp\u003E1. No \u0022hack gravity\u0022\u003C/p\u003E\u003Cp\u003E2. No part modification. \u003C/p\u003E\u003Cp\u003E3. No Hyperedit, save file modification, or other things of that sort.\u003C/p\u003E\u003Cp\u003E4. MODS - Use any mod you like, even Jeb. Firespitter will make it a bit easier with it\u0027s hover mode engines.\u003C/p\u003E\u003Cp\u003E5. CATEGORIES - There will be separate categories for Stock, Mods, Jeb.\u003C/p\u003E\u003Cp\u003E6. SCREENSHOTS - 2 required. One showing ship info (map) and one showing the craft sitting on the water tower at 0 speed, 0 thrust. If landing 2 and docking, two screenshots showing the first landed by itself and the second docked on top.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EScoring.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1 point for each ton of craft as shown by an orbital screenshot with the info panel open (fractional points count).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBouses\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u002B5 if you use only EXCLUSIVELY LFO powered engines (Not SABRES or RAPIERS) Your sheer tonnage should make up the bulk of this score if you pack on the LFO.\u003C/p\u003E\u003Cp\u003E\u002B10 if your craft is wider than the water tower.\u003C/p\u003E\u003Cp\u003E\u002B10 if you don\u0027t use any landing gear (the definition of gear should be obvious, any part that\u0027s supposed to be landing gear but I\u0027ll be the final judge as to whether it looks and functions like gear or not.)\u003C/p\u003E\u003Cp\u003E\u002B10 if you do this with a fixed wing (not VTOL aircraft) - You must land horizontally, not vertically.\u003C/p\u003E\u003Cp\u003E\u002B20 if you use only ions.\u003C/p\u003E\u003Cp\u003E\u002B30 if you land one VTOL on the water tower then dock a second one on top of it. (weight of BOTH vehicles counts toward score)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ELEADERBOARD\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EStock:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EMod:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFengist: - 45.9\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EJeb did this:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-08T06:42:58Z\u0022 title=\u002205/08/2014 06:42  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 8, 2014\u003C/time\u003E by Fengist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2014-05-08T06:00:19Z","Content":"\n\u003Cp\u003EMy entry. One thing that allowed me to balance this monster on the water tower is the same laws of physics that tightrope walkers use. My center of gravity was displaced pretty wide rather than focused on one central location. Interesting to know that this actually works in the world of Kerbal physics.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.datainterlock.com/Kerbal/Pinpoint1.png\u0022 alt=\u0022Pinpoint1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.datainterlock.com/Kerbal/Pinpoint2.png\u0022 alt=\u0022Pinpoint2.png\u0022\u003E\u003C/p\u003E\n"}]}