{"TopicId":72179,"ForumId":32,"TopicTitle":"How do you plan your interplanetary transfers?","CreatedByName":"Alephzorg","CreatedById":2383,"CreatedDateTime":"2014-05-12T20:11:07Z","PageNum":1,"Articles":[{"CreatedByName":"Alephzorg","CreatedById":2383,"CreatedDateTime":"2014-05-12T20:11:07Z","Content":"\n\u003Cp\u003EGoing from a planet to the next isn\u0027t always easy. And usually, the first question is \u0022is it the right time to even try to transfer?\u0022.\u003C/p\u003E\u003Cp\u003ESo there are tutorials, plugins, websites and so on to help us.\u003C/p\u003E\u003Cp\u003EBut how do you do it?\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-05-12T20:21:18Z","Content":"\n\u003Cp\u003EMost of the time kerbal alarm clock to get close to the right transfer window. From there I just setup a manuver node with the aproximate dV requirements and tweek the timeing till the intercept is in the right ballpark. Depending on how nasty the inclination change is I may get close and stick a second node at the AN/DN to make sure a viable intercept will work before doing the transfer burn. That second node obviously will need a recalculation once the first burn is done but can give me a good idea of the total dV reqirement to get an intercept and make sure its close to what it should be or if I need to do further refinement on the departure.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-05-12T20:42:09Z","Content":"\n\u003Cp\u003EI have two main methods:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E I use the \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003ELaunch Window Planner\u003C/a\u003E to find the first good enough launch window, and set up a maneuver node for that transfer. With a bit of practice, the numbers can be adjusted for a transfer burn directly from a moon\u0027s SoI (a return from Laythe or Tylo is the most common example).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Sometimes I treat the transfer as a standard orbital rendezvous. The initial escape burn places my apoapsis/periapsis on the target\u0027s orbit, while matching the inclination as well as possible. Then, as I arrive to the point where the orbits touch, I adjust the other apsis so that I\u0027ll have an encounter after one more orbit.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-05-12T21:27:50Z","Content":"\n\u003Cp\u003EWhy is \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ealexmoon\u0027s calculator\u003C/a\u003E missing in the list?\u003C/p\u003E\n"},{"CreatedByName":"rennsport27","CreatedById":108383,"CreatedDateTime":"2014-05-12T21:36:44Z","Content":"\n\u003Cp\u003EI used to use protractor, but as I picked up the pace in career mode, I started using alarm clock so I could hit every interplanetary window. So, that led to me just using alarm clock to figure out the general time and winging the transfer burn from there.\u003C/p\u003E\n"},{"CreatedByName":"SpenSpaceCorp","CreatedById":98977,"CreatedDateTime":"2014-05-12T21:42:45Z","Content":"\n\u003Cp\u003EI look at the\u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E tool and eyeball it and burn with Jeb saying, \u0022Yep, looks \u0027bout right!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Stormweaver","CreatedById":96698,"CreatedDateTime":"2014-05-12T22:07:42Z","Content":"\n\u003Cp\u003EI tend to eyeball the easier ones (eve, duna, sometimes jool) and for others I just have a ship in orbit that I can make a node from, get the transfer in the right place and then just see how far ahead/behind my target it\u0027d be. and warp from there.\u003C/p\u003E\u003Cp\u003ECan \u0027Educated guess\u0027 be a poll option?\u003C/p\u003E\n"},{"CreatedByName":"Chiboko","CreatedById":77125,"CreatedDateTime":"2014-05-12T22:09:34Z","Content":"\n\u003Cp\u003EI use maneuver nodes to work out the right direction then just burn. Duna is on the opposite side of Kerbol? We could wait for a sane alignment but lets just make a bigger rocket.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-05-12T22:11:16Z","Content":"\n\u003Cp\u003EI made my own Excel spreadsheets for Kerbin -\u0026gt; Planet transfers. I think I\u0027m going to collate them all into a database for ease of use and flexibility.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-05-12T22:12:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EWhy is \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ealexmoon\u0027s calculator\u003C/a\u003E missing in the list?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E^ This, so much. One of the best planners out there.\u003C/p\u003E\n"},{"CreatedByName":"Feldynn","CreatedById":64102,"CreatedDateTime":"2014-05-12T22:49:58Z","Content":"\n\u003Cp\u003ESo far I\u0027ve yet to leave Kerbin\u0027s SoI even though I\u0027ve got almost 300 hours in the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, last thing I was doing was gathering science from all over Minmus but it\u0027s been a while since I last properly sent out some missions. I\u0027ve always thought about sending some stuff off to Duna but never seem to get around to it LOL.\u003C/p\u003E\n"},{"CreatedByName":"DoToH","CreatedById":68428,"CreatedDateTime":"2014-05-12T23:07:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EWhy is \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ealexmoon\u0027s calculator\u003C/a\u003E missing in the list?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe OP wants the \u0022other\u0022 option to win ? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2014-05-12T23:16:49Z","Content":"\n\u003Cp\u003EI printed out Lando\u0027s transfer window (spreadsheet?) and stuck it on my wall. Just look up at it and work out when to go.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-12T23:35:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EWhy is \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ealexmoon\u0027s calculator\u003C/a\u003E missing in the list?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would be my pick, too. The most flexible of the web tools for IP transfer.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-13T00:02:59Z","Content":"\n\u003Cp\u003EYet another vote for Alexmoon\u0027s. Along with Precise Node, so I can just copy the numbers across. A few minor tweaks will correct for non-zero inclination of my Kerbin orbit, and help me fine-tune my periapsis at the target (though that\u0027s arguably better done with a mid-course correction).\u003C/p\u003E\u003Cp\u003EHowever, I am somewhat conscious that I don\u0027t know how to work out an interplanetary transfer for myself. It\u0027s one of the few aspects of KSP I can\u0027t do \u0022manually\u0022.\u003C/p\u003E\n"},{"CreatedByName":"DaPatman","CreatedById":105855,"CreatedDateTime":"2014-05-13T00:15:09Z","Content":"\n\u003Cp\u003EI use KAC for the transfer times, and \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E to work out where to put the maneuver node.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-05-13T02:58:32Z","Content":"\n\u003Cp\u003Ei do a burn to escape kerbin SOI, then place a node on my resulting kerbol orbit and play with it/slide it around till i get a good intercept. sometimes it takes a year of timewarp to reach an easy intercept, but no prob for me.\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2014-05-13T03:29:54Z","Content":"\n\u003Cp\u003Eexperience.\u003C/p\u003E\u003Cp\u003EI look at the relative positions and use the maneuver nodes. I don\u0027t use any tools other than what\u0027s in the base game.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-05-13T03:56:40Z","Content":"\n\u003Cp\u003EKerbal Alarm Clock for me, please. As long as I have it installed to keep track of simultaneous missions, it\u0027s handy to use for transfer notifications as well.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-05-13T04:01:48Z","Content":"\n\u003Cp\u003EI\u0027ve just been winging it\u003C/p\u003E\u003Cp\u003EI should probably put a bit more thought into it\u003C/p\u003E\u003Cp\u003EAfter finishing this space station perhaps\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-05-13T04:03:24Z","Content":"\n\u003Cp\u003EI have a piece of paper that has the transfer-angles for Jool, Duna and Eve drawn on it. I hold it up to the screen to find where the planets should be. I make it myself waaaaaay back in .17 by waiting until Kerbin was lined up with the target planet, rising my solar apo to the target planet\u0027s altitude, and then coasting to apo. Then I measured the angle between the ship and the planet to see how far off I was. Works every time.\u003C/p\u003E\u003Cp\u003EFor other planets I use \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E, it has many more features than \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E, such as taking eccentricity and inclination into account.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-05-13T04:09:54Z","Content":"\n\u003Cp\u003EVOID\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Eyea\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-05-13T04:25:54Z","Content":"\n\u003Cp\u003EI used to use Alexmoon\u0027s calculator and loved it. However someone (and I wish I\u0027d noted who) pointed out a very cool way to get spot-on transfers for every simple transfer in-game and I think I\u0027ll be doing that from now on.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOnce you\u0027re in orbit around Kerbin (or whatever planet/moon), set up an eject maneuver node to JUST leave the SOI to Sun\u0027s SOI. Ideally within 1m/s of staying caught. Make it on the correct side (retrograde for going inward toward Sun, prograde for going outward away from Sun).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe resultant Sun orbit will be just ahead or behind Kerbin\u0027s Sun orbit. Place a maneuver node on that projected orbit, and plan your burn to your target planet. Drag the node around and fix prograde/retrograde or whatever until you get an encounter.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDelete the FIRST maneuver node, and the SECOND one will become a timer to about the right time to eject.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFast-forward to that maneuver node, but don\u0027t do it. Just delete it once you reach it.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPlan a new Maneuver node to actually do the transfer, and then do it.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERevel in the fact that you just did an in-game efficient transfer without using an external tool.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2014-05-13T04:41:30Z","Content":"\n\u003Cp\u003EBy the seat of my pants. Punch out of Kerbin\u0027s SOI, then play with maneuver nodes. Typically means I spend months in orbit. Occasionally I feel bad for the kerbals I make live in tiny pods for sometimes years at a time, but... not often.\u003C/p\u003E\n"},{"CreatedByName":"Alephzorg","CreatedById":2383,"CreatedDateTime":"2014-05-13T06:14:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EWhy is \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ealexmoon\u0027s calculator\u003C/a\u003E missing in the list?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just didn\u0027t think of including it because I never used it myself. My bad.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DoToH\u0022 data-cite=\u0022DoToH\u0022\u003E\u003Cdiv\u003EThe OP wants the \u0022other\u0022 option to win ? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do not endorse or support any product and/or method. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI usually create a list of transfer windows alarms in Kerbal Alarm Clock and play with maneuver nodes when I get close to them to plan for my burns.\u003C/p\u003E\u003Cp\u003EBefore that, I had printed sheets of transfer angles based on data from \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-13T09:09:58Z\u0022 title=\u002205/13/2014 09:09  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 13, 2014\u003C/time\u003E by Alephzorg\u003C/strong\u003E\n\u003Cbr\u003ETypo\n\u003C/span\u003E\n"}]}