{"TopicId":72256,"ForumId":55,"TopicTitle":"Part Function","CreatedByName":"TeeGee","CreatedById":82434,"CreatedDateTime":"2014-05-13T15:46:20Z","PageNum":1,"Articles":[{"CreatedByName":"TeeGee","CreatedById":82434,"CreatedDateTime":"2014-05-13T15:46:20Z","Content":"\n\u003Cp\u003EHello, some ideas for KSP:\u003C/p\u003E\u003Cp\u003EParts:\u003C/p\u003E\u003Cp\u003ENothing other than batteries/solar panels, lights, engines and wings really do anything. Antenae are a waste of weight, docking port sizes mean nothing, pods that seat 1 kerbal differ only in weight and appearance, and engine nacelles do absolutely nothing. \u003C/p\u003E\u003Cp\u003EI\u0027d recommend that antenae be required on probes (unmanned craft), docking ports allow crew to be transferred WITHOUT going EVA, different pods have different drag coefficients and possibly built int RCS thrusters (spaceplane pods need this), engine nacelles are requirements for air-breathing engines to work.\u003C/p\u003E\u003Cp\u003E- More on the docking ports, which have always bothered me, they really serve no function in KSP other than look bigger and weigh heavier. As I mentioned before, the larger the docking port, the more kerbals we can get through. So maybe if we need to transfer kerbal from ship A to B, the TIME it takes for the crew to leave ship A to B should be less on craft with bigger docking ports. And to go one step further, maybe FUEL transfer rates should increase with larger docking ports as well (like when we are refueling a craft in space, if it has a bigger docking port it will refuel faster). \u003C/p\u003E\u003Cp\u003ELike as of right now, I just use the smallest/lightest docking port for everything because weight = delta v in space. The heavier the craft, the more delta v and thrust is required to get where u wanna go. I have NO incentive to use the other docking ports other than how it looks on my spacecraft. \u003C/p\u003E\u003Cp\u003E- Engine nacelles should be used for specific engines. If we want to build a spaceplane to orbit, we need to use the engine precooler for the ramjet engines. If we just want to use normal airbreathing engines, the other nacelle is fine as well. If we don\u0027t use the nacelles, the engines shouldnt work at ALL. If we use the wrong nacelle, the jet engines explode due to overheating when the craft goes to higher speeds. \u003C/p\u003E\u003Cp\u003E- pods need unique function to justify their weight. I have no idea why anyone would use the 3 man pod over stacking 3 lander cans for our spacecraft, it\u0027s just a waste of weight. One could even use the 4 seater for optimal results, but I would rather use the 4 lander cans because it is LIGHTER. The heavier the pod, the more it should be able to do. \u003C/p\u003E\u003Cp\u003EEx: Heavier pods should have built in ladder, rcs thrusters, less drag (if spaceplane pod), illuminated cockpit (or even see through cockpit windows so we can see our kerbals inside!), better control whee/more monoprop, built in thermoelectric generator, more oxygen (when life support is implemented and prob even more food), and ablative thermal tiles that are useful. \u003C/p\u003E\u003Cp\u003E-Thermal tiles need to have a \u0022life bar\u0022. When we reenter the atmo, the tile health bar should progressively decrease the hotter the reentry is. If we go too steep, the more the bar drains. The tiles can ONLY be repaired back at the KSP hanger. If we use craft without tiles, we should be able to attach a shield to our craft that can withstand reentry. This means that reentry shielding is an important part of a successful space program because we need to take into account heat shield durability and maintenance(cost).\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-13T16:40:12Z","Content":"\n\u003Cp\u003EThe connection strength of the different sizes of docking ports varies greatly. Not a big deal if you\u0027re just docking to transfer fuel, but very important if you\u0027re building something big in orbit via multiple launches. I agree that crew transfer through docking ports should be possible, seems like an obvious feature and I\u0027m not sure why it hasn\u0027t been implemented.\u003C/p\u003E\u003Cp\u003EAntennae are useful for transmitting science results back to Kerbin on craft that you don\u0027t plan to recover.\u003C/p\u003E\u003Cp\u003EHeavy craft require the exact same amount of delta-V to perform a given maneuver as lighter ones.\u003C/p\u003E\u003Cp\u003EBigger pods do provide more torque and more monopropellant, and they reduce part count compared to multiple smaller pods. They also provide different sized connection points and aesthetics, which may or may not be important to you. Though I do agree that they could use more differentiation.\u003C/p\u003E\n"},{"CreatedByName":"TeeGee","CreatedById":82434,"CreatedDateTime":"2014-05-13T22:07:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHeavy craft require the exact same amount of delta-V to perform a given maneuver as lighter ones.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I had 1 tank of fuel and 1 rocket engine, I get X amount delta v.\u003C/p\u003E\u003Cp\u003EIf I had the exact same fuel and engine layout \u002B another part with mass X, delta v drops. The more ur engine has to push, the more force pushes back on the engine causing the engine to burn more fuel moving weight than changing velocity.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-13T22:18:09Z","Content":"\n\u003Cp\u003EDifferent craft require differing amounts of fuel for the same maneuver, but the delta-V required stays the same.\u003C/p\u003E\n"}]}