{"TopicId":72400,"ForumId":16,"TopicTitle":"How to go to planets/moons which are on a lower orbit around the sun/planet?","CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2014-05-15T00:33:32Z","PageNum":1,"Articles":[{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2014-05-15T00:33:32Z","Content":"\n\u003Cp\u003EHow to go to planets/moons which are on a lower orbit around the sun/planet? Ive once gone to Gilly, but that was just trial and error, so how should I go to, uhh, Moho for example? I mean the simplest and most efficient path. I know that I should burn retrograde, but when you are on a normal orbit, and you dont have ginormous TWR, its impossible to do it without falling to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Orionkermin","CreatedById":91013,"CreatedDateTime":"2014-05-15T00:42:10Z","Content":"\n\u003Cp\u003EOn the most basic level you need to burn retrograde relative to kerbin\u0027s orbit around the sun. This means you burn prograde in your orbit at the point that your ejection angle leaves Kerbin on its retrograde. Hope that made any sense ^^;\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2014-05-15T01:01:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Orionkermin\u0022 data-cite=\u0022Orionkermin\u0022\u003E\u003Cdiv\u003EOn the most basic level you need to burn retrograde relative to kerbin\u0027s orbit around the sun. This means you burn prograde in your orbit at the point that your ejection angle leaves Kerbin on its retrograde. Hope that made any sense ^^;\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOrian has it right. To see how your ejection angle affects your trajectory around the sun, create a maneuver node in your orbit around Kerbin and drag the prograde marker until the delta-v readout says about 1000 m/s. \u003C/p\u003E\u003Cp\u003EZoom out and look at what your orbit around the sun will be.\u003C/p\u003E\u003Cp\u003ENow zoom back in and move your maneuver node somewhere else around Kerbin (say, 90 degrees ahead) and look at what happens.\u003C/p\u003E\u003Cp\u003EThe bottom line is that if you burn prograde and you leave Kerbin in the same direction it\u0027s travelling around the sun, you\u0027ll be on your way to intersecting Duna\u0027s orbit. If you burn progade and you leave Kerbin in the opposite direction, you\u0027ll be on your way to Eve. Hope that helps.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-15T01:08:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EvilotionCR2\u0022 data-cite=\u0022EvilotionCR2\u0022\u003E\u003Cdiv\u003E... I know that I should burn retrograde, but when you are on a normal orbit, and you dont have ginormous TWR, its impossible to do it without falling to Kerbin.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, like posted above. You will burn toward your prograde marker NOT toward the retrograde marker. But do your burn when your craft is between Kerbin and the Sun. (Daylight side.)\u003C/p\u003E\n"},{"CreatedByName":"Nedal","CreatedById":104926,"CreatedDateTime":"2014-05-15T12:30:24Z","Content":"\n\u003Cp\u003EYep, burn Prograde during the day to eject to a lower kerbol orbit. Burn Prograde at night to eject to a higher kerbol orbit. \u003C/p\u003E\u003Cp\u003EAnother note regarding efficiency. When ejecting for a lower orbit, you want your new kerbol apoaps to be right on kerbins orbital line. Or your new periaps to be on kerbins kerbol orbit when ejecting to a higher orbit.\u003C/p\u003E\u003Cp\u003EYou adjust for this by burning at different times for different distances. For instance flying to moho, you would burn closer to noon, than you would for burning to eve, as burning to moho requires more deltaV which would straighten out your ejection path. \u003C/p\u003E\u003Cp\u003EPlay around with it for a bit, and you should see what I mean.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-05-15T16:41:35Z","Content":"\n\u003Cp\u003EAnd \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/47863-\u0022 rel=\u0022external nofollow\u0022\u003EPreciseNode\u003C/a\u003E helps a lot in this regard, as you can easily change the time of the burn \u002B/- a multiple of seconds while zoomed out far enough to see the whole Sunar System map.\u003C/p\u003E\n"}]}