{"TopicId":72599,"ForumId":18,"TopicTitle":"Interstellar","CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-05-17T09:19:18Z","PageNum":10,"Articles":[{"CreatedByName":"Moss","CreatedById":106413,"CreatedDateTime":"2014-11-20T09:28:18Z","Content":"\n\u003Cp\u003EI may be late to the party on this one, but having seen this movie I\u0027m convinced me that there should science fiction/ adventure gameplay support in the base game, even if it never becomes stock.\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2014-11-20T17:27:07Z","Content":"\n\u003Cp\u003EI finally got to see it yesterday with a friend, and I loved it. I don\u0027t care if there were minor scientific errors (things like that don\u0027t bug me in films), Interstellar is a damn good film!\u003C/p\u003E\u003Cp\u003EIf you\u0027ll excuse me, I\u0027ve got to make a Ranger-esque ship in KSP now...\u003C/p\u003E\n"},{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2014-11-20T19:55:56Z","Content":"\n\u003Cp\u003ESo apparently there\u0027s some hard facts given about the Gargantua system in \u0022The Science of Interstellar\u0022; Gargantua itself is a supermassive black hole, weighing in at approximately 100 million solar masses, rotating with an angular velocity approaching the speed of light. While the required math to figure this out is not something I\u0027m confident with, it\u0027s been determined that there do exist stable orbits around such an object where one would experience time dilation on par with what is seen in the movie. Whether or not it\u0027s at all plausible for a planet avoid being torn apart in such an orbit is another question, but IIRC, Kip Thorne seems to think the second planet they visit was the least plausible because the material strength of ice wouldn\u0027t allow the formation of the frozen clouds.\u003C/p\u003E\u003Cp\u003EThe bigger problem, which Scott Manley points out in his review, is that at first glance, the required delta v\u0027s would be absolutely absurd. After derping around with the equations for gravitational time dilation for a while, assuming Miller\u0027s World has a mostly circular orbit, it would orbit about at a distance about 67 million kilometers greater than the semimajor axis of Mars, or 295,392,295 km. Using basic equations for orbital velocities, I\u0027m coming up with an orbital velocity of 0.707106782 c (211,985,280 m/s) for Miller\u0027s World, where is definitely fast enough for relativistic effects to become \u0022significant\u0022 though from what I recall, at such speeds the gravitational time dilation would still dwarf the speed induced dilation. Frame dragging from the black holes rotation probably comes into play as well, but I haven\u0027t even the foggiest idea how to estimate that.\u003C/p\u003E\u003Cp\u003ENow, it\u0027s stated that Mann\u0027s world doesn\u0027t experience significant time dilation from proximity to the black hole, and, taking that statement fairly liberally (every hour on Mann\u0027s world=1.5 hours on Earth) and assuming a circular orbit, Mann\u0027s world would orbit at around 527,486,241 kilometers above the singularity, which is between the orbits of Mars and Jupiter. At this distance the orbital velocity of Mann\u0027s world would be around 158,635,258 m/s, or 0.529150263 c.\u003C/p\u003E\u003Cp\u003EI have no idea how to calculate the minimum delta v to transfer between two orbits, but based on the delta v costs to transfer to mars, it\u0027s similar to the difference between the two bodies\u0027 mean orbital velocities, which in this case is 211,985,280 m/s-158,635,258 m/s, or about 53,000 Km/s, which corresponds to 0.177956518 c. On the plus side, because the hypothetical orbital period of Mann\u0027s world would be around 6 hours, and Miller\u0027s world significantly less, transfer windows would appear all the time. On the less positive side, I suspect they\u0027d be extremely short.\u003C/p\u003E\u003Cp\u003ENow, the Delta-V requirements for the Endurance mission (though not the design, which doesn\u0027t appear to have that great of a mass ratio) would be feasible with beamed core antimatter (exhaust velocity is something like 0.3 c), and maybe with extremely efficient nuclear fusion based propulsion if you squint at it the right way. \u003C/p\u003E\u003Cp\u003EThat begs several questions however:\u003C/p\u003E\u003Cp\u003EA. If they have access to that kind of propulsion, wouldn\u0027t it be trivial to evacuate Earth even without discovering the secrets of gravity manipulation?\u003C/p\u003E\u003Cp\u003EB. Given that the mission is under significant time pressure, why wouldn\u0027t they opt for a more aggressive outbound flight? Using a 1g Brachistochrone trajectory, it would take about 17 days to reach Saturn and about 10 million km/s of delta V, which could be accommodated for in the delta V budget by some extra drop tanks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T20:07:48Z\u0022 title=\u002211/20/2014 08:07  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by InfinityArch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2014-11-20T20:23:16Z","Content":"\n\u003Cp\u003ENow, even though I\u0027m probably off by a fairly sizable margin for a variety of regions, I went back and redid the numbers with even more liberal interpretations of the dialogue.\u003C/p\u003E\u003Cp\u003EFor a model which assumes 1 hour on Mann\u0027s world is a day of Earth time, then we come up with an orbital velocity of 211,801,185 m/s, and a difference of a mere 184.095 Km/s. That\u0027s actually well within the realm of plausibility for electromagnetic propulsion systems. Of course, in that version, Mann\u0027s world has an SMA of 295,906.021 Km, which I have a sneaking suspicion might be too close to Miller\u0027s world for their orbits to be stable. Going down to 1 hour=12 hours on Earth, we\u0027re looking at a velocity difference of around 740 km/s, which is beyond the exhaust velocity of VASMIR (and mass ratios become unreasonably large after that point from what I know), but well within the reasonable limits of a helium-3/deuterium fusion based propulsion system (maximum exhaust velocity given as 7,840 km/s by Atomic Rockets).\u003C/p\u003E\u003Cp\u003EAs far as the Ranger to Miller\u0027s world and back thing goes, I really don\u0027t have time to go through the math for that (and I\u0027ve have to make even more assumptions that would probably f\u0027 up the final result even more), but I suspect you\u0027d come up with something low enough that a fusion based nuclear thermal rocket could manage it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T20:27:24Z\u0022 title=\u002211/20/2014 08:27  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by InfinityArch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AndrewBCrisp","CreatedById":57119,"CreatedDateTime":"2014-11-20T22:13:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022InfinityArch\u0022 data-cite=\u0022InfinityArch\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat begs several questions however:\u003C/p\u003E\u003Cp\u003EA. If they have access to that kind of propulsion, wouldn\u0027t it be trivial to evacuate Earth even without discovering the secrets of gravity manipulation?\u003C/p\u003E\u003Cp\u003EB. Given that the mission is under significant time pressure, why wouldn\u0027t they opt for a more aggressive outbound flight? Using a 1g Brachistochrone trajectory, it would take about 17 days to reach Saturn and about 10 million km/s of delta V, which could be accommodated for in the delta V budget by some extra drop tanks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA) I believe the big stumbling block that made gravity manipulation preferable to building more rockets was logistical and social, rather than engineering. There were plenty of clues in the film that \u003C/p\u003E\u003Cp\u003Ea) Humanity had experienced a minor or major population crash prior to the events of the film,\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E The surviving humans had locked themselves into a cycle of self-denial, insisting that so long as they have enough farmers, they\u0027ll get through these Tough Times okay, and \u003C/p\u003E\u003Cp\u003Ec) Until the Tough Times end, any extraneous spending - like on more spacecraft - would be met with a massive public blowback, possibly including angry mobs ready and willing to kill everyone in the NASA bunker. \u003C/p\u003E\u003Cp\u003EThere was no real way for NASA to get public support for a major rocket-building program without revealing the ugly truth that the Blight is winning, and that our time on Earth can be measured in decades if not years. Either the public would not believe them, and send in the angry mobs to destroy the bunker; or the public \u003Cstrong\u003Ewould\u003C/strong\u003E believe them, and in a panic destroy the bunker trying to get aboard the rockets already built. Plan A - the mass evacuation of Earth - needed to be presented with everything already in place, and all the public needing to do was pack their things and enter the stations. \u003C/p\u003E\u003Cp\u003EPlus, given the near-desperate timescale of the evacuation, building the stations on Earth and lofting them into space via gravity manipulation saves precious time. A conventional evacuation plan would need time to build all the needed launch facilities, time to build the rockets, time to build the space-based station-construction facilities, and \u003Cem\u003Ethen\u003C/em\u003E time to build the stations themselves. Gravity manipulation neatly cuts out the first three phases of the conventional plan.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E I suspect that the secrecy of the project - and the need for time to solve the gravity manipulation problem - were the major reasons for the 2 years to Saturn. Every launch from the Earth risks detection by people not sympathetic to the existence of NASA, so keeping the number of launches to a minimum helps. Those extra drop-tanks might save time for the mission, but also risk discovery, meaning \u003Cem\u003EEndurance\u003C/em\u003E might complete its mission and return to find the bunker destroyed by the people left behind. \u003C/p\u003E\u003Cp\u003EPlus, the gravity manipulation project was still at the theoretical stage when the \u003Cem\u003EEndurance\u003C/em\u003E launched. Even assuming a Manhattan-Project approach, going from equations to working gravity drives might take years. It was a tremendous act of faith on the part of NASA to start building their first station before the gravity problem was solved.\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2014-11-23T22:58:47Z","Content":"\n\u003Cp\u003ECooper: \u0022set humor to 75%\u0022\u003C/p\u003E\u003Cp\u003ERobot: \u0027Ten seconds to self-destruct...\u0022\u003C/p\u003E\u003Cp\u003ECooper: \u0022Make that 60%\u0022\u003C/p\u003E\u003Cp\u003EI loved the scene where the kid hits a baseball straight up and knocks out a window on the \u0022roof\u0022\u003C/p\u003E\n"},{"CreatedByName":"SpaceXray","CreatedById":113396,"CreatedDateTime":"2014-11-24T22:04:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FishInferno\u0022 data-cite=\u0022FishInferno\u0022\u003E\u003Cdiv\u003ECooper: \u0022set humor to 75%\u0022\u003Cp\u003ERobot: \u0027Ten seconds to self-destruct...\u0022\u003C/p\u003E\u003Cp\u003ECooper: \u0022Make that 60%\u0022\u003C/p\u003E\u003Cp\u003EI loved the scene where the kid hits a baseball straight up and knocks out a window on the \u0022roof\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETARS and CASE were the best robots ever.\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2014-11-25T01:53:09Z","Content":"\n\u003Cp\u003EOk, so I asked this before, and didn\u0027t get a response. Is there actually proof that the rocket was a Saturn V? In the scenes where it shows its engines in the launch chamber, there appears to be only 3 engines.\u003C/p\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2014-11-25T03:41:02Z","Content":"\n\u003Cp\u003EI thought it was something like a SLS without the SRBs.\u003C/p\u003E\n"},{"CreatedByName":"Airlock","CreatedById":101601,"CreatedDateTime":"2014-11-25T07:06:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FishInferno\u0022 data-cite=\u0022FishInferno\u0022\u003E\u003Cdiv\u003EOk, so I asked this before, and didn\u0027t get a response. Is there actually proof that the rocket was a Saturn V? In the scenes where it shows its engines in the launch chamber, there appears to be only 3 engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee here: \u003Ca href=\u0022http://endurance.interstellarmovie.net/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://endurance.interstellarmovie.net/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Ranger shuttles were launched \u0022belly-to-belly\u0022 on top of a \u0022 large multi-stage booster\u0022 - most likely to be a modified Saturn V. \u003C/p\u003E\u003Cp\u003EDid some searching and found this - apparently, an unused template mission patch for the film - \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cFwu5ma.png\u0022 alt=\u0022cFwu5ma.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E Woops, actually it\u0027s from the same site: \u003Ca href=\u0022http://patchcreator.interstellarmovie.net/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://patchcreator.interstellarmovie.net/\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-25T07:08:55Z\u0022 title=\u002211/25/2014 07:08  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 25, 2014\u003C/time\u003E by Airlock\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceXray","CreatedById":113396,"CreatedDateTime":"2014-11-25T14:32:59Z","Content":"\n\u003Cp\u003ELooks a lot like the Saturn V. And yes, the 2 Rangers were launched belly-to-belly on top, which is why they did a launch in the first place instead of taking off with the Rangers one by one and using up the special and expensive fuel the Rangers used.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-11-25T15:15:12Z","Content":"\n\u003Cp\u003EIt isn\u0027t Saturn V.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://www.wallpaperup.com/uploads/wallpapers/2014/06/10/367002/c28cfc439ce01f52d156da54729013a0.jpg\u0022 alt=\u0022c28cfc439ce01f52d156da54729013a0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s the wallpaper I\u0027ve seen in cinema. It looks like an Atlas V to me.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.thespacereview.com/archive/2042a.jpg\u0022 alt=\u00222042a.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceXray","CreatedById":113396,"CreatedDateTime":"2014-11-25T16:51:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EIt isn\u0027t Saturn V.\u003Cp\u003E\u003Ca href=\u0022https://www.wallpaperup.com/uploads/wallpapers/2014/06/10/367002/c28cfc439ce01f52d156da54729013a0.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.wallpaperup.com/uploads/wallpapers/2014/06/10/367002/c28cfc439ce01f52d156da54729013a0.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s the wallpaper I\u0027ve seen in cinema. It looks like an Atlas V to me.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.thespacereview.com/archive/2042a.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.thespacereview.com/archive/2042a.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENever seen that poster on official sources. Must be fake.\u003C/p\u003E\u003Cp\u003EAnd an Atlas V can\u0027t launch 2 Rangers, only a small satellite or probe.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-11-25T17:04:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceXray\u0022 data-cite=\u0022SpaceXray\u0022\u003E\u003Cdiv\u003ENever seen that poster on official sources. Must be fake.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPosters are often knocked together by local distributors, and might end up not having anything to do with the actual movie. As a pretty infamous example, here\u0027s the polish poster for \u0027Weekend at Bernies\u0027;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cdn-www.cracked.com/articleimages/dan/posters/bernies.jpg\u0022 alt=\u0022bernies.jpg\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceXray\u0022 data-cite=\u0022SpaceXray\u0022\u003E\u003Cdiv\u003EAnd an Atlas V can\u0027t launch 2 Rangers, only a small satellite or probe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs this your first time seeing a science fiction film? Next you\u0027ll tell the shuttle couldn\u0027t reach an NEO and didn\u0027t carry a gatling gun...\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2014-11-25T21:17:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FishInferno\u0022 data-cite=\u0022FishInferno\u0022\u003E\u003Cdiv\u003ECooper: \u0022set humor to 75%\u0022\u003Cp\u003ERobot: \u0027Ten seconds to self-destruct...\u0022\u003C/p\u003E\u003Cp\u003ECooper: \u0022Make that 60%\u0022\u003C/p\u003E\u003Cp\u003EI loved the scene where the kid hits a baseball straight up and knocks out a window on the \u0022roof\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eloved that scene too although during that scene, was i the only one that noticed that the o\u0027neill cylinder that they were on isn\u0027t really wide enough to sustain a earth like gravity with a reasonable amount of rotation like say about 1 to 2 rotations a minute for a truly reasonable sized cylinder. Although considering they were doing research artificial gravity, they probably already solved problem and did not need rotation but wanted to make sure space with in the cylinder was used efficiently...\u003C/p\u003E\n"},{"CreatedByName":"SpaceXray","CreatedById":113396,"CreatedDateTime":"2014-11-25T22:21:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Helix935\u0022 data-cite=\u0022Helix935\u0022\u003E\u003Cdiv\u003Eloved that scene too although during that scene, was i the only one that noticed that the o\u0027neill cylinder that they were on isn\u0027t really wide enough to sustain a earth like gravity with a reasonable amount of rotation like say about 1 to 2 rotations a minute for a truly reasonable sized cylinder. Although considering they were doing research artificial gravity, they probably already solved problem and did not need rotation but wanted to make sure space with in the cylinder was used efficiently...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe cylinder was rotaing at around 4-5 rpm, we see that during the final shot of Cooper preparing to fly away from the station in the Ranger.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-11-25T22:49:37Z","Content":"\n\u003Cp\u003EHaven\u0027t seen this yet but I plan to. I\u0027m just hoping that KSP hasn\u0027t ruined yet another scifi space movie for me lol \u0022You can\u0027t do that!\u0022 \u0022It doesn\u0027t work like that!\u0022 \u0022That wouldn\u0027t work to get a rendez-vous...\u0022 And so on... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TythosEternal","CreatedById":117821,"CreatedDateTime":"2014-11-26T03:30:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EIt isn\u0027t Saturn V.\u003Cp\u003EThat\u0027s the wallpaper I\u0027ve seen in cinema. It looks like an Atlas V to me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is indeed an Atlas V in the poster, and was definitely not what was in the film. Nonetheless, that poster (whether it\u0027s fake or independently-produced) is downright gorgeous. Better than most of the real ones, in fact (IMHO, of course).\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-11-26T05:54:25Z","Content":"\n\u003Cp\u003EI hope I\u0027m not too egregiously late to the party, but I just saw the film today. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EOverall I think it was good, though definitely not Nolan\u0027s best film. I ended up paying very little attention to the orbital physics (fortunately), so those didn\u0027t end up irritating me as much as they might have. However.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EI\u0027ll be the millionth person to rant that the scene where he goes into Gargantua is a bunch of hooey. I did actually sort of call that he\u0027d end up being the \u0022ghost\u0022 / \u0022Them\u0022 early in the film, so by the time he went in I basically knew what was coming (It\u0027s full of stars!). But I hope this movie doesn\u0027t go giving anyone any bright ideas about jumping into black holes because they glossed over what we do know (as well as we can hope anyway) about what\u0027s inside that event horizon.\u003C/p\u003E\u003Cp\u003EFirst things first, it\u0027s kinda sad that they didn\u0027t take the opportunity to show what it\u0027d look like to um... I forgot his name. McConaughey. To him as he went in. We know already that the event horison is only black from outside - from inside, you can\u0027t really tell when you\u0027ve gone past it at first, until everything starts going all blue-shifted and yadda yadda yadda. That would have been an epic place to blow the visual effects budget on. Oh well.\u003C/p\u003E\u003Cp\u003EAnd also there\u0027s the part about spaghettification. You don\u0027t get spaghettified magically - you get spaghettified like in the medieval torture device where they tie your arms and legs to a frame and then turn a crank to stretch it out until you scream in agony. And then you get drawn and quartered, and then your quarters get drawn and quartered. Nature may not be evil, but it isn\u0027t gentle either. Poor astronaut dude would have been in for a really painful experience if he tried that in real life. [/rant]\u003C/p\u003E\u003Cp\u003EOh yeah, and P.S. who else here cringed at their gross misinterpretation of Newton\u0027s Third Law? (claiming that you have to drop the shuttles in order to escape because for some reason ditching stuff automatically makes you go faster)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EI did love the part where the guy had to dock with a spinning ship. I tried that in KSP once... ONCE. Took the whole blasted day and in my case the ship was barely rotating. \u0027Course they did have the convenient benefit of a docking port right on the rotational axis xD\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-26T06:02:02Z\u0022 title=\u002211/26/2014 06:02  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 26, 2014\u003C/time\u003E by parameciumkid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-11-26T09:06:19Z","Content":"\n\u003Cp\u003EI thought they were really lucky that the explosion set the uncontrolled Endurance spinning exactly on it\u0027s longitudinal rotation axis. In real life, a chaotic explosion it would have put the rotation on a random axis, which would have made docking impossible.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-26T09:09:21Z\u0022 title=\u002211/26/2014 09:09  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 26, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2014-11-26T09:18:28Z","Content":"\n\u003Cp\u003EI once managed to dock with uncontrollable rotating debris (a fuel tank actually). I thought I would rub F9 button down to its base in the process but I actually managed it (MJ\u0027s smart S.A.S. helped a lot though). I wouldn\u0027t want to repeat this ever again. I even went as far as to add control cores and radioisotope power sources to my circularization stages.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-11-26T12:32:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceXray\u0022 data-cite=\u0022SpaceXray\u0022\u003E\u003Cdiv\u003ENever seen that poster on official sources. Must be fake.\u003Cp\u003EAnd an Atlas V can\u0027t launch 2 Rangers, only a small satellite or probe.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. One of the largest cinema franchises in Europe sports fake posters. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EHave you ever seen a \u003Cem\u003Emovie\u003C/em\u003E? There\u0027s some liberty in the making of it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EI thought they were really lucky that the explosion set the uncontrolled Endurance spinning exactly on it\u0027s longitudinal rotation axis. In real life, a chaotic explosion it would have put the rotation on a random axis, which would have made docking impossible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Edid\u003C/span\u003E rotate on a random axis. It is visible when the two docking ports are close together. There\u0027s wobbling. BTW, as far as I know, those were actual models, and not CGI, for which I applaud Nolan\u0027s team.\u003C/p\u003E\u003Cp\u003EProbably the best scene in the movie. Very powerful with awesome music.\u003C/p\u003E\u003Cp\u003EMonths ago I tried doing stuff in KSP, similar scenarios, so watching this on a big screen was something I could appreciate even more.\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2014-11-26T16:45:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003E-snip-\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E-more snip-\u003C/p\u003E\u003Cp\u003EOh yeah, and P.S. who else here cringed at their gross misinterpretation of Newton\u0027s Third Law? (claiming that you have to drop the shuttles in order to escape because for some reason ditching stuff automatically makes you go faster)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E-even more snip-\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure the one they wanted was Newton\u0027s Second Law; \u003Cem\u003EF=ma\u003C/em\u003E perfectly fits. Of course, it\u0027s more complex than just \u003Cem\u003EF=ma\u003C/em\u003E, but it fits. I didn\u0027t cringe, just mentally corrected them. No big deal for a film that has become one of my favourites \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-11-26T17:10:59Z","Content":"\n\u003Cp\u003EI\u0027ve tried to perform the docking with a fast rotating, poorly precessing object in KSP. It is very, very difficult and if there weren\u0027t magnetic properties of the ports, I\u0027d never do it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/26223177319559295/DFF99BD2AD31F4AC14A6D42D3430C1F08A809692/\u0022 alt=\u0022DFF99BD2AD31F4AC14A6D42D3430C1F08A809692\u0022\u003E\u003C/p\u003E\u003Cp\u003EOriginal soundtrack helped a lot. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gan_HOPE326","CreatedById":128974,"CreatedDateTime":"2014-11-26T17:20:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003EI hope I\u0027m not too egregiously late to the party, but I just saw the film today. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EOverall I think it was good, though definitely not Nolan\u0027s best film. I ended up paying very little attention to the orbital physics (fortunately), so those didn\u0027t end up irritating me as much as they might have. However.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EI\u0027ll be the millionth person to rant that the scene where he goes into Gargantua is a bunch of hooey. I did actually sort of call that he\u0027d end up being the \u0022ghost\u0022 / \u0022Them\u0022 early in the film, so by the time he went in I basically knew what was coming (It\u0027s full of stars!). But I hope this movie doesn\u0027t go giving anyone any bright ideas about jumping into black holes because they glossed over what we do know (as well as we can hope anyway) about what\u0027s inside that event horizon.\u003C/p\u003E\u003Cp\u003EFirst things first, it\u0027s kinda sad that they didn\u0027t take the opportunity to show what it\u0027d look like to um... I forgot his name. McConaughey. To him as he went in. We know already that the event horison is only black from outside - from inside, you can\u0027t really tell when you\u0027ve gone past it at first, until everything starts going all blue-shifted and yadda yadda yadda. That would have been an epic place to blow the visual effects budget on. Oh well.\u003C/p\u003E\u003Cp\u003EAnd also there\u0027s the part about spaghettification. You don\u0027t get spaghettified magically - you get spaghettified like in the medieval torture device where they tie your arms and legs to a frame and then turn a crank to stretch it out until you scream in agony. And then you get drawn and quartered, and then your quarters get drawn and quartered. Nature may not be evil, but it isn\u0027t gentle either. Poor astronaut dude would have been in for a really painful experience if he tried that in real life. [/rant]\u003C/p\u003E\u003Cp\u003EOh yeah, and P.S. who else here cringed at their gross misinterpretation of Newton\u0027s Third Law? (claiming that you have to drop the shuttles in order to escape because for some reason ditching stuff automatically makes you go faster)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EI did love the part where the guy had to dock with a spinning ship. I tried that in KSP once... ONCE. Took the whole blasted day and in my case the ship was barely rotating. \u0027Course they did have the convenient benefit of a docking port right on the rotational axis xD\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy interpretation of that was\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003Efor the spaghettification, it\u0027s been shown clearly that Gargantua is, well, gargantuan. Probably a supermassive black hole with many million suns of mass. Otherwise, that planet couldn\u0027t have survived orbiting it close enough to have such a high time warp factor, nor the astronaut would have managed to pass the event horizon without harm. Given that, it might as well be that he never reached the point of spaghettification - after all Magical Future Humans managed to snatch him away and put him into their Tesseract space or whatever. So there\u0027s that, I say he simply was caught before he got too close to the singularity (that thing must have been several million km in radius anyway).\u003C/p\u003E\u003Cp\u003EFor the ships/3rd law, I just assumed they counted on ejecting all that mass with explosive bolts to gain a bit of momentum, plus of course losing mass. So yeah, not 100% exact but people complained about the science being \u0022too convoluted\u0022 like this already \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\u003Cp\u003EOn another note, am I the only one who was calculating DeltaV and ISP for that amazing atmospheric lander of theirs in his head during the movie \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E? That was truly something, atmospheric decent without parachutes AND take off on two Earth-like planets in a row with no refuel and no stages. Must have been an atomic motor \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-27T12:08:24Z\u0022 title=\u002211/27/2014 12:08  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 27, 2014\u003C/time\u003E by Gan_HOPE326\u003C/strong\u003E\n\u003C/span\u003E\n"}]}