{"TopicId":73022,"ForumId":32,"TopicTitle":"Orbitcoin - KSP financials and the rise of the reusable spacecraft","CreatedByName":"Progressm","CreatedById":80659,"CreatedDateTime":"2014-05-22T00:01:26Z","PageNum":1,"Articles":[{"CreatedByName":"Progressm","CreatedById":80659,"CreatedDateTime":"2014-05-22T00:01:26Z","Content":"\n\u003Cp\u003EI have seen the topic mentioned in passing here and there, but only started to think about it since paying around with cargo SSTOs; in stock KSP, what would be the earliest possible tech tree stage to create a reusable spacecraft (I.e. multiple trips without vab / hangar)? \u003C/p\u003E\u003Cp\u003EI presume this question will become valid once money is introduced. I guess you need at least a docking port and some kind of wheels for a refuelling / loading vehicle researched.\u003C/p\u003E\u003Cp\u003EAnyone given this any thought yet?\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-05-22T00:38:19Z","Content":"\n\u003Cp\u003ESubject to the number of tankers you station outside the VAB/SPH for refuelling the only question is, what constitutes a \u0027trip\u0027? If you have a parachute you can go up and back down. If you have docking ports or KAS you can refuel. In real-life the refuelling would be easier, of course, and everything else harder.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-05-22T00:45:41Z","Content":"\n\u003Cp\u003EAssuming a reusability system is implemented \u0027properly\u0027, then it will reward you for recovering a complete craft. Now, this of course operates under the assumption that, like a real space program, you bring it into the hangar/VAB to reload a payload, do some routine maintenence, and send it on it\u0027s merry way again. By this logic, you won\u0027t have to have the ground infrastructure to refuel and reload a payload without going through the VAB/SPH.\u003C/p\u003E\u003Cp\u003EAlso by this logic, any SSTO spaceplane capable of putting up payloads will do the job. Unfortunately, the stock tech tree has all the parts needed for SSTOs in the latter ~1/2-2/3 of it. Prioritizing that area would require some work (a few good Mun/Minmus runs could probably do the job assuming you unlock nothing but the bare minimums outside of the spaceplane stuffs).\u003C/p\u003E\n"},{"CreatedByName":"Progressm","CreatedById":80659,"CreatedDateTime":"2014-05-22T00:58:31Z","Content":"\n\u003Cp\u003ETrue. If such VAB/SBH routine maintenance option wasn\u0027t implemented, you\u0027d have to wait until some rover wheels and a docking port to make a tanker. Then you could collect all Kerbin biomes with a basic single stage hopper rocket \u0026amp; return between biomes to refuel.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-22T02:27:23Z","Content":"\n\u003Cp\u003EI trust in no coin other than \u003Ca href=\u0022http://www.loadingartist.com/comic/making-money/\u0022 rel=\u0022external nofollow\u0022\u003Ehatcoin\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-05-22T04:29:22Z","Content":"\n\u003Cp\u003EOrdogecoin ;P\u003C/p\u003E\u003Cp\u003EMuch money. Very space. Wow. Such funding.\u003C/p\u003E\n"},{"CreatedByName":"Shivaran","CreatedById":93615,"CreatedDateTime":"2014-05-22T08:50:48Z","Content":"\n\u003Cp\u003EVery explosions! Such Kerbal! Wow!\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-05-22T10:12:50Z","Content":"\n\u003Cp\u003ESuch avoid! Much danger! Very offtopic! Such threadlock! Doge sad!\u003C/p\u003E\n"},{"CreatedByName":"Doctor Axel","CreatedById":64944,"CreatedDateTime":"2014-05-22T13:35:01Z","Content":"\n\u003Cp\u003EMy biggest question mark at the moment is what kind of benefit we\u0027ll get from Recovering a landed vessel - at the moment it just gives us science, but it will probably also be used to implement vessel reusability.\u003C/p\u003E\u003Cp\u003EBy my reckoning it could go one of two ways, depending on how \u0027buying parts\u0027 is going to work:\u003C/p\u003E\u003Cp\u003E-if you actually have an inventory of parts that you have to draw from to build ships, recovering a vessel could put those parts back in your inventory (maybe a chance you won\u0027t get the part back if it has suffered a lot of impacts, I dunno).\u003C/p\u003E\u003Cp\u003E-if you just design a vessel in the VAB and pay for it in a lump sum when you spawn it for launch, recovering a vessel would put the value of its constituent parts and resources back in your wallet (minus a small/medium percentage, probably - recovery, refurbishing etc)\u003C/p\u003E\u003Cp\u003EI\u0027d be cool with either approach - what do we think?\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2014-05-22T13:40:44Z","Content":"\n\u003Cp\u003EIf you tried real hard you could do a two-stage fully recoverable space taxi with a space worthy but still suborbital lifter.\u003C/p\u003E\u003Cp\u003EBasic premise is this, the lifter stage gets you close but not quite to orbit, but still into space on a suborbital trajectory. The upper stage burns to insert itself into a preliminary stable orbit before you lose the lifter stage due to atmospheric reentry. Switch back to the lifter stage, land it.\u003C/p\u003E\u003Cp\u003EYou\u0027d need a probe core, large parachutes and probably landing legs to pull this off.\u003C/p\u003E\u003Cp\u003EIf Squad adds a feature that allows jettisoned stages to be land safely without them being controlled (a circumvention of the current \u0022atmosphere clears non-controlled vessels in suborbital trajectories\u0022 mechanic) I believe you could achieve full re-usability regardless of the number of stages.\u003C/p\u003E\u003Cp\u003EThe main problem with recovering spent stages is that you encounter the problem of having to be in two (or more) places at the same time to simulate them. With multiplayer this would be easy, but for singleplayer it\u0027s trickier. I\u0027m not sure if the engine can simulate two different places with two different spacecraft at the same time on one machine, without needing a significant rewrite of some old eldritch code that handles ingame scenes.\u003C/p\u003E\u003Cp\u003EEDIT: as to what Doctor Axel said, I personally think we should get the option to either keep the vessel intact which still allows you to modify the recovered craft in the VAB/SPH (like say you lost a landing leg or goo canister on your way back so you add a new one, then put it on a new lifter stage or something) and one to disassemble it for parts to be re-purposed for something else.\u003C/p\u003E\u003Cp\u003EModifying would yield no additional cost, bar the cost of recovery of the craft, but it would give you less options in changing the design unless you pay a disassembly cost penalty for swapping them around (VAB editor should have a \u0022restore to recovered state\u0022 button in such a scenario).\u003C/p\u003E\u003Cp\u003EDisassembly would return the parts into your stock but at an additional cost of disassembly, or it would give you a 90% or something discount on buying another version of that part (depending on whether an actual stockpile and storage of parts is used or not).\u003C/p\u003E\u003Cp\u003EUnless Kerbal rockets are indeed lego filled with rocket fuel then I guess having dissasembly and assembly costs is pointless. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-22T13:50:57Z\u0022 title=\u002205/22/2014 01:50  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 22, 2014\u003C/time\u003E by Pulstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Doctor Axel","CreatedById":64944,"CreatedDateTime":"2014-05-22T14:07:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pulstar\u0022 data-cite=\u0022Pulstar\u0022\u003E\u003Cdiv\u003Eas to what Doctor Axel said, ---awesome idea---\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m a fan. My only ish with that idea is actually related to part 1 of your post - what if two distinct parts of your ship get recovered? Could you put them together again? Would they be treated as a root vessel or a subassembly? I would be absolutely down with stuff like that but I suspect Squad would want it to be more simple.\u003C/p\u003E\u003Cp\u003EEven if Kerbal rockets are basically Rocket Fueled Legos there could be costs to assembling/disassembling/refurbishing. Maybe the rockets are Kraglized before launch. =P\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-05-22T14:30:45Z","Content":"\n\u003Cp\u003ECopying an\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/73161-Part-storage-for-later-use?p=1034304\u0026amp;viewfull=1#post1034304\u0022 rel=\u0022external nofollow\u0022\u003E old post of me\u003C/a\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/73161-Part-storage-for-later-use\u0022 rel=\u0022external nofollow\u0022\u003Ein this post\u003C/a\u003E over shamelessly. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EEither the rule will be players get only scrap value for recovered parts, as the materials would be deemed unsafe for reuse due to wear and tear or a real storage system will have to be introduced or Kerbals are a throw-away society and everything is lost once it is on the launchpad.\u003C/p\u003E\u003Cp\u003ECircumventing part storage by refunding the costs for a part looks like a solution, but:\u003C/p\u003E\u003Cp\u003E1. Refunding the full value (for a used part even) makes an economy system arbitrary.\u003C/p\u003E\u003Cp\u003EBill does not have enough Kesetas for a new Mainsail, but he still has 20 burned solid boosters fished out of the bay in the barn. He sells these to buy a new Mainsail.\u003C/p\u003E\u003Cp\u003EThis at least simulates the storage of the monetary value of recovered parts, but it is not really storing anything, simply exchanging parts arbitraily, as you could not end up with the realistic situation of having not enough money to built a Mainsail if you bought 20 boosters the day before.\u003C/p\u003E\u003Cp\u003E2. Refunding at a reduced value does no longer simulate \u0022real\u0022 storage.\u003C/p\u003E\u003Cp\u003EBob landed a pod softly in the bay. Bill sells it at a reduced value - and buys a new one for full price.\u003C/p\u003E\u003Cp\u003EEven perfectly reusable parts would have to be bought back at full price. Everything the player does not manually park at KSC (like a spaceplane) would be sold at a loss, rebuying it no longer simulates having in storage.\u003C/p\u003E\u003Cp\u003ESo, if reusability were to be a thing in KSP - besides parking a spaceplane next to the hangar or building a huge crane to dock a pod onto a new rocket - it would have to go all the way really:\u003C/p\u003E\u003Cp\u003EScrapped parts would have to be stored as a numerical value in the VAB. As soon as the player presses launch this value would be reduced as would be the budget by the costs of the parts newly bought to assembe the rocket.\u003C/p\u003E\u003Cp\u003EThis would also open the possibility to introduce \u0022mission parts\u0022 from contracts, special payload put into the players storage to be rocketed to its destination.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-05-22T14:35:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pulstar\u0022 data-cite=\u0022Pulstar\u0022\u003E\u003Cdiv\u003EIf you tried real hard you could do a two-stage fully recoverable space taxi with a space worthy but still suborbital lifter.\u003Cp\u003EBasic premise is this, the lifter stage gets you close but not quite to orbit, but still into space on a suborbital trajectory. The upper stage burns to insert itself into a preliminary stable orbit before you lose the lifter stage due to atmospheric reentry. Switch back to the lifter stage, land it.\u003C/p\u003E\u003Cp\u003EYou\u0027d need a probe core, large parachutes and probably landing legs to pull this off.\u003C/p\u003E\u003Cp\u003EIf Squad adds a feature that allows jettisoned stages to be land safely without them being controlled (a circumvention of the current \u0022atmosphere clears non-controlled vessels in suborbital trajectories\u0022 mechanic) I believe you could achieve full re-usability regardless of the number of stages.\u003C/p\u003E\u003Cp\u003EThe main problem with recovering spent stages is that you encounter the problem of having to be in two (or more) places at the same time to simulate them. With multiplayer this would be easy, but for singleplayer it\u0027s trickier. I\u0027m not sure if the engine can simulate two different places with two different spacecraft at the same time on one machine, without needing a significant rewrite of some old eldritch code that handles ingame scenes.\u003C/p\u003E\u003Cp\u003EEDIT: as to what Doctor Axel said, I personally think we should get the option to either keep the vessel intact which still allows you to modify the recovered craft in the VAB/SPH (like say you lost a landing leg or goo canister on your way back so you add a new one, then put it on a new lifter stage or something) and one to disassemble it for parts to be re-purposed for something else.\u003C/p\u003E\u003Cp\u003EModifying would yield no additional cost, bar the cost of recovery of the craft, but it would give you less options in changing the design unless you pay a disassembly cost penalty for swapping them around (VAB editor should have a \u0022restore to recovered state\u0022 button in such a scenario).\u003C/p\u003E\u003Cp\u003EDisassembly would return the parts into your stock but at an additional cost of disassembly, or it would give you a 90% or something discount on buying another version of that part (depending on whether an actual stockpile and storage of parts is used or not).\u003C/p\u003E\u003Cp\u003EUnless Kerbal rockets are indeed lego filled with rocket fuel then I guess having dissasembly and assembly costs is pointless. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is plausible, you will need an upper stage on the payload who has good TWR because of the time restrain, however it don\u0027t need much dV 700-400 m/s you can also land the upper stage after use. \u003C/p\u003E\u003Cp\u003EFirst stage will have to land either on the peninsula a bit north of equator or reach the next continent, here you will have to refuel it with some fuel and fly it back to pad.\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2014-05-22T15:31:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis would also open the possibility to introduce \u0022mission parts\u0022 from contracts, special payload put into the players storage to be rocketed to its destination.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh this is great, you could for example get an Ion Engine testing mission before you research it with one xenon tank and a single engine added to the part stockpile. Also the VAB already displays \u0022in stock\u0022 values (or used to), so I guess that a stockpile will be used anyway. I just hope that parts get auto-bought on launch.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork_werewolf","CreatedById":90749,"CreatedDateTime":"2014-05-22T16:04:09Z","Content":"\n\u003Cp\u003EA third option could be to have a store of \u0022used\u0022 parts. These could be refurbish for something like 10% of their value. Assume the Kerbals take it apart and replace the most damaged/used parts. They would sit in the inventory and be useless until refurbished, meaning they cost nothing till you want to reuse them\u003C/p\u003E\u003Cp\u003EIn terms of a lifter it might be best to launch the first stage straight up. 2300 of Delta-V is needed to add sideways velocity and this takes you away from KSC. Launch straight up to say 70k, you have 47k up and 47k down to add 23k sideways velocity with the second stage before the first auto de-orbits. 70k straight up is much easier to achieve and you might have the fuel left to land at KSC though I would use a parachute for the last 500m if it was me. This is sort of the space-X\u0027s F9R idea but they don\u0027t have to deal with auto deletion or only being able to control one craft at a time. \u003C/p\u003E\u003Cp\u003EThis would require Basic Rocketry, survivability (for a parachute) and Flight control (for a Stayputnik). Yea the Stayputnik is not ideal but this seems about minimum. I also realise that getting 23k Delta-V is still going to drain a ship at an early stage but even if you have to dump some tanks you could still save 50% of your ships cost.\u003C/p\u003E\n"}]}