{"TopicId":73162,"ForumId":55,"TopicTitle":"The Ressources-mining feature, do you miss it ?","CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2014-05-23T11:06:23Z","PageNum":5,"Articles":[{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-27T09:55:13Z","Content":"\n\u003Cp\u003EYep, that certainly could be true, but deciding which features should be at the front of the queue is really just a matter of opinion, not something that can be decided by logic and argument. I\u0027m sure we all have our own preferred priority list, in Squad\u0027s opinion resources aren\u0027t currently priority number 1.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-27T10:03:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ETime spent developing the ISRU is time spent not developing something else. Such as better aerodynamics, more parts, fixing the bugs that continue to plague the game, or even getting the 1.0 release out and Squad going on to develop their next big thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t want Squad to move on to \u0022their next big thing\u0022 anytime soon, do you?\u003C/p\u003E\u003Cp\u003EThe biggest reason I came to KSP is because I\u0027ve always been a space-junkie. Simply fascinated by space. Growing up, I wanted to be an astronaut for the longest time... Later, I simply couldn\u0027t get enough of Star Wars (I love the scope of the universe). But a REALISTIC space game- that\u0027s a masterpiece that\u0027s never been done on this scale before, and maybe never will again in the future...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EAnd while it\u0027s highly likely to be enjoyable, highly likely to enrich the game, I don\u0027t see ISRU as a core part of the game. I wouldn\u0027t say it\u0027s something KSP \u003Cem\u003Eneeds\u003C/em\u003E to be an accurate and fun experience, in the same sense that it needs better aerodynamics and needs bug fixes.\u003Cp\u003ETrue, you can level these accusations at most game features (career mode, for example), but it should still be remembered that there\u0027s an opportunity cost to everything. And that, as I previously stated, if Squad put in every cool feature they\u0027ll end up with a bloated mess.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, true, it needs better aerodynamics- but after that, is there anything else that it needs that you can realistically think they might add? (I can virtually guarantee they\u0027re not going to add axial tilt or N-body physics, for example, unless one of those becomes an explosively popular mod first... Believe it or not, there actually is a modder working on implementing N-body physics, but he estimates it\u0027ll take at least the better part of a year before he\u0027ll be done, given how much he is having to teach himself as he goes along...)\u003C/p\u003E\u003Cp\u003EI would argue that In-Situ Resource Utilization *IS* an absolute necessity for any realistic space program. How many manned interplanetary missions have there been in real-life? None as far as I know- and mainly because of the terrible expense of launching, from Earth (it takes an enormous amount of effort to get a kg of a\\*anything* to orbit using current launch technologies), not only all the fuel you need to get to another planet, and equipment you\u0027ll need when there, but also all the fuel you\u0027ll need to get \u003Cstrong\u003E*back*\u003C/strong\u003E from another planet.\u003C/p\u003E\u003Cp\u003EIn-Situ Resouce Utilization is the only realistic way we can ever hope to put a man on Mars in the next two decades, for instance, and NASA seems to realize this- which is why they\u0027ve included some version of In-Situ Resource Utilization in every manned interplanetary \u0022reference mission plan\u0022 since 1998 or so... (it\u0027s also part of why they recently put a Sabatier Reactor on the ISS- not only to save on life-support costs, but also to test ISRU technologies in a space-environment...) \u003Cstrong\u003EIn real life, it\u0027s simply too expensive to do an interplanetary manned mission any other way.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s a link to the document for the Mars \u00225.0 Design Reference Architecture\u0022 released in 2009, if you\u0027re interested, by the way:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/pdf/373665main_NASA-SP-2009-566.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/pdf/373665main_NASA-SP-2009-566.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003EP.S. NASA also similarly recently released a document suggesting the use of ISRU as a necessary component to get to and back from Jupiter\u0027s moon Callisto, by the way: \u003Ca href=\u0022http://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20030063128.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20030063128.pdf\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-27T10:09:57Z\u0022 title=\u002205/27/2014 10:09  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 27, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-27T11:53:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EWell, true, it needs better aerodynamics- but after that, is there anything else that it needs that you can realistically think they might add?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGosh, dozens of things (not things that I personally necessarily think they might realistically add, but speaking for the forum in general based on what I\u0027ve seen...)\u003C/p\u003E\u003Cp\u003E- Better IVA views with more info and controllable cockpits\u003C/p\u003E\u003Cp\u003E- The ability to move around a ship in IVA\u003C/p\u003E\u003Cp\u003E- Clouds and weather effects\u003C/p\u003E\u003Cp\u003E- Boat parts\u003C/p\u003E\u003Cp\u003E- Science that doesn\u0027t suck (this would be mine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E )\u003C/p\u003E\u003Cp\u003E- Money (contracts?)\u003C/p\u003E\u003Cp\u003E- Reputation (contracts?)\u003C/p\u003E\u003Cp\u003E- Observatory exploration\u003C/p\u003E\u003Cp\u003E- More planets (someone always wants more planets)\u003C/p\u003E\u003Cp\u003E- More parts (someone always wants more parts)\u003C/p\u003E\u003Cp\u003E- Life support\u003C/p\u003E\u003Cp\u003E- Re-entry heat\u003C/p\u003E\u003Cp\u003E- Robotics\u003C/p\u003E\u003Cp\u003E- Fairings\u003C/p\u003E\u003Cp\u003E- Cities and other plantary features\u003C/p\u003E\u003Cp\u003EA lot of these are on the \u0022what not to suggest\u0022 list because they come up so often. Some have been mentioned in passing by Squad as a future possibility, or being played with in some side branch. It\u0027s not entirely clear which (if any) have been ruled out, which might actually be in development, and which might only be a future consideration. But I can guarantee one thing: for every item on this list, there are players who think that item should be the #1 priority. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-05-27T11:56:13Z","Content":"\n\u003Cp\u003ENorthstar does it really matter that NASA is doing it? The question shouldn\u0027t be is this realistic, it should be is this going to achieve a good gameplay expirence. Sorry but that is really bugging me, you keep bringing up NASA, and I pat you on the back for doing your research. But it means diddly squat when compared to gameplay weather or not NASA is doing that. Explain to me why it would enrich my gaming expirence then I will agree with you.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-27T11:59:17Z","Content":"\n\u003Cp\u003EMy view? You can\u0027t miss something you never had.\u003C/p\u003E\u003Cp\u003EPersonally I\u0027m happy that resource mining isn\u0027t included in the stock game. The tyranny of the rocket equation is the core challenge in the game. I\u0027m not in any rush to change that. The kethane mod has proved that you can implement an ISRU system through mods, so for those that want to play that way they\u0027ve got an option open.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-05-27T12:14:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003ENorthstar does it really matter that NASA is doing it? The question shouldn\u0027t be is this realistic, it should be is this going to achieve a good gameplay expirence. Sorry but that is really bugging me, you keep bringing up NASA, and I pat you on the back for doing your research. But it means diddly squat when compared to gameplay weather or not NASA is doing that. Explain to me why it would enrich my gaming expirence then I will agree with you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell here we\u0027re getting into \u0022one man\u0027s muck is another man\u0027s brass\u0022 territory. I personally know someone who utterly refuses to use NERVAs for instance. They don\u0027t add anything to \u003Cem\u003Ehis\u003C/em\u003E game, even though many, many other people have fun with them. So he just doesn\u0027t use them. Myself, I haven\u0027t really bothered with ions, even though people seem to have fun sending slowboats to the sun with them.\u003C/p\u003E\u003Cp\u003EI would ask that you give KSP Interstellar a try. Create a separate installation if you like so you don\u0027t ruin your existing save file. You don\u0027t have to get into dusty-plasma reactors, creating new types of nuclear fuel to power them with nor reprocessing actinides and disposing of depleted fuels. You don\u0027t even have to bother with the beamed power side of things at all. You may have to bother with putting some small heat sinks on the craft as KSPi introduces heat management into the game, but it\u0027s really not that big a deal unless you\u0027re using the nuke reactors or huge amounts of solar panels.\u003C/p\u003E\u003Cp\u003EJust give it a try. Make creating a Munar ISRU a mission objective, try the hybrid aluminium/O2 engines on for size. Just to see what you think. One small 62.5cm nuke reactor has enough fuel to last more than the duration of any Munar or Minmus mission, gives enough juice to power a couple of ISRUs, and you only need a couple of small radiators to stop it overheating. At the end of the day, even with KSPi installed, you don\u0027t need to use any of the extra bits (asides maybe the heat sinks) in order to carry on as usual. And, if you find you like the ISRU, well, it\u0027s an extra toy to play with.\u003C/p\u003E\u003Cp\u003EAnd given that Squad\u0027s implementation of an ISRU might not even need to use the extra nuclear reactor parts of KSPi, that just makes things even more simple. Actually you can use a KSPi ISRU with just solar panels if I recall correctly, it just takes a long while to extract or refine anything due to the reduced power available.\u003C/p\u003E\u003Cp\u003EAgain, give it a try. If you don\u0027t like it, you don\u0027t have to use it. Just like many of the other stock parts. Like NERVAs and ions, for instance.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-05-27T12:18:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe tyranny of the rocket equation is the core challenge in the game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd when you can send 300 tons into LKO with your eyes closed and without bothering with the SLS parts, then what?\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-05-27T12:23:17Z","Content":"\n\u003Cp\u003EI will have to give it another try at somepoint, last I played was before the solar sail came in .But that wasn\u0027t my point, my point was that just because NASA does it doesn\u0027t mean we should, it really grinds me the wrong way because it says nothing about how it will affect the game, apart from brining it more into line with reality.\u003C/p\u003E\u003Cp\u003EI get what you are saying about KSPI and once I have a bit more time I will give it the attention it deserves.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EAnd when you can send 300 tons into LKO with your eyes closed and without bothering with the SLS parts, then what?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGet some mods, there is only so much a game can give you. It\u0027s a hard truth, sorry.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-27T12:25:28Z\u0022 title=\u002205/27/2014 12:25  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 27, 2014\u003C/time\u003E by Dodgey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-27T12:26:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EI don\u0027t want Squad to move on to \u0022their next big thing\u0022 anytime soon, do you?\u003C/div\u003E\u003C/blockquote\u003EWell, there\u0027s a fair bit still to do with KSP, but I don\u0027t want them to be developing KSP 1 forever. I\u0027d like to see what else they can come up with, and I\u0027d like to see what they can do with KSP 2, when they\u0027re free to make some big changes to overcome limitations in the first game (for example, they could switch to a custom physics engine that doesn\u0027t have Unity\u0027s issues).\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI would argue that In-Situ Resource Utilization *IS* an absolute necessity for any realistic space program. How many manned interplanetary missions have there been in real-life? None as far as I know- and mainly because of the terrible expense of launching, from Earth (it takes an enormous amount of effort to get a kg of a\\*anything* to orbit using current launch technologies), not only all the fuel you need to get to another planet, and equipment you\u0027ll need when there, but also all the fuel you\u0027ll need to get \u003Cstrong\u003E*back*\u003C/strong\u003E from another planet.\u003C/div\u003E\u003C/blockquote\u003EI would counterague firstly that the Kerbol system is not the solar system. A rocket that in the real world can make LEO can make orbit around just about any celestial in KSP (ignoring details like limited engine restarts and propellant boiloff that KSP doesn\u0027t simulate). In Delta-V terms the complete Saturn V-CSM-LM stack is up there with Tylo and Eve land and return missions in KSP. True, KSP\u0027s rockets are a bit worse to partly counteract this, but still the Kerbals have it easy for space exploration.\u003Cp\u003ESecondly, how many ISRU missions have there been in real life? None. How many ISRU missions are actually at the stage of building the hardware? None. With a few exceptions KSP\u0027s stock parts are based on past or present stuff, not future plans. If we allow ISRU in the game, why not allow nuclear electric engines? Why not allow Orion Drive? Why not allow space elevators? Etc.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-27T12:37:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EGet some mods, there is only so much a game can give you. It\u0027s a hard truth, sorry.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s true. But the way I interpret technicalfool\u0027s implication is this: That challenge was in the game 18 months ago, and nothing\u0027s changed since then, despite 18 months of development. Well, that would be the extreme interpretation anyway, whether or not that\u0027s quite what TF intends. \u003C/p\u003E\u003Cp\u003EIn any case, I wouldn\u0027t agree with that particular interpretation. At the very least, the challenge of working with orbital mechanics has been added, along with rovers and in-atmosphere aircraft. \u003C/p\u003E\u003Cp\u003EBut one can\u0027t deny that all of that\u0027s been around for almost as long, and I can\u0027t think of any new gameplay that\u0027s been added since. Personally I think (hope!) that\u0027s because Squad has been building the lower level foundations required for additional gameplay elements, and hence my earlier answer to the question posted by the OP.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-27T12:45:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EBoat parts\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOff topic, but is this really something people have been clamoring for in the core game? Are people feeling limited in their ability to make \u003Cem\u003Espace boats\u003C/em\u003E?\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-27T13:23:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EAnd when you can send 300 tons into LKO with your eyes closed and without bothering with the SLS parts, then what?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe you\u0027re probably nearing the \u0022endgame\u0022, if a sandbox can be said to have such a thing. What\u0027s not likely to keep you any more interested when you\u0027re at the top of the learning curve is making the game easier.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-05-27T13:24:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EOff topic, but is this really something people have been clamoring for in the core game? Are people feeling limited in their ability to make \u003Cem\u003Espace boats\u003C/em\u003E?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, there have been a number of requests for propellor, or some kind of water propulsion parts. It does make sense, what with Eve, Laythe and Kerbin having big oceans to wander around or cross to reach other lands and islands.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-05-27T13:30:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EThe you\u0027re probably nearing the \u0022endgame\u0022, if a sandbox can be said to have such a thing. What\u0027s not likely to keep you any more interested when you\u0027re at the top of the learning curve is making the game easier.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dunno, I seem to be having lots of fun with beamed power and ISRU missions so far, on top of Kethane. If anything it\u0027s more of a challenge, since I\u0027m trying things like sending craft that would normally never manage a Duna mission out to Minmus or Mun to refuel first. I\u0027m making \u0022Hopper\u0022 craft that bounce around multiple biomes while on Mun or Minmus, refuelling between steps before coming home. It opens up more stuff to do, which in a sandbox-like game, is basically a life-extending thing.\u003C/p\u003E\u003Cp\u003EThis is the sort of thing that could turn a contracted extraplanetary mission from \u0022expensive but doable\u0022 into \u0022cheap enough to have a massive profit\u0022, depending on how complicated a player wishes to make their craft, and indeed, mission. And why should a player not be rewarded for taking that option?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-27T13:32:34Z\u0022 title=\u002205/27/2014 01:32  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 27, 2014\u003C/time\u003E by technicalfool\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-27T13:54:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EI dunno, I seem to be having lots of fun with beamed power and ISRU missions so far, on top of Kethane.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, adding content and changing core gameplay is what mods are for. But we\u0027re talking about what should and shouldn\u0027t be in the stock game. I think the stock game is about launching rockets. If you want to extend the game using mods, go for your life.\u003C/p\u003E\n"},{"CreatedByName":"DoToH","CreatedById":68428,"CreatedDateTime":"2014-05-29T20:17:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EIndeed, adding content and changing core gameplay is what mods are for.\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EAnd what new feature implementing while on alpha stage of development is for.\u003C/p\u003E\u003Cp\u003EThe \u0022if you want it, install a mod\u0022 answer is well known and little constructive. Many of us wanting some sort of ISRU already have a mod about it installed. So did many people before with docking mods or plane mods, and those features became stock.\u003C/p\u003E\u003Cp\u003EWe are just sharing ideas about why and how this could be done (maybe devs could use some of them). \u003C/p\u003E\u003Cp\u003EYou think it shouldn\u0027t be stock... can you give a reason (other than \u0022there is a mod that does it\u0022)? No offense, Im just asking for a more detailed explanation. Do you think it would affect gameplay? too much complexity? low priority feature but ok to have it in 1.0?....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-29T20:20:36Z\u0022 title=\u002205/29/2014 08:20  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 29, 2014\u003C/time\u003E by DoToH\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-30T00:14:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EHow many ISRU missions are actually at the stage of building the hardware?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDidn\u0027t you see me post about the Sabatier reactor on the ISS? (\u003Ca href=\u0022http://www.nasa.gov/mission_pages/station/research/news/sabatier.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/mission_pages/station/research/news/sabatier.html\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003EOr have you heard about NASA\u0027s construction of prototype CO2-capture equipment for use on Mars?\u003C/p\u003E\u003Cp\u003E(just one of the \u003Cstrong\u003Edozens\u003C/strong\u003E of links on CO2 adsorber prototypes at NASA: \u003Ca href=\u0022http://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20120015003.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20120015003.pdf\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003E(this is another: \u003Ca href=\u0022http://isru.nasa.gov/CarbonDioxideOxygen.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://isru.nasa.gov/CarbonDioxideOxygen.html\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003EISRU is becoming a thing in reality. NASA has an entire project called the \u003Cstrong\u003EMARCO POLO (Mars Atmosphere and Regolith COllector/PrOcessor for Lander Operations)\u003C/strong\u003E project being worked on at Johnson Space Center, for instance...\u003C/p\u003E\u003Cp\u003EAnyways, it would add to the scope and fun of the game. It would draw more players to KSP, and allow more realistic missions... IF you want to up the difficulty level, you could always play with Real Solar System mod (or bug SQUAD to implement at least a slight scale-up of the stock game- I have been pushing for them to go from 10% to 20% scale for a while now...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E----------\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EIndeed, adding content and changing core gameplay is what mods are for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMany features now part of the stock game were once part of mods. Docking, for example.\u003C/p\u003E\u003Cp\u003EAnd alpha development is precisely when new features are *supposed to* be added. Please remember this isn\u0027t a \u0022feature-complete\u0022 game yet...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EBut we\u0027re talking about what should and shouldn\u0027t be in the stock game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere have been plenty of reasons why ISRU \u003Cstrong\u003Eshould\u003C/strong\u003E be added brought up. Can you think of any reasons it should *not*?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EI think the stock game is about launching rockets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbal Space Program is about what players and the devs want to make it about. Spaceplanes aren\u0027t rockets, and they\u0027re already in the game- and used to only be mod territory. Why should ISRU be as well?\u003C/p\u003E\u003Cp\u003EMay I also remind you of the part of the game\u0027s title \u0022Space Program\u0022. In-Situ Resource Utilization is purely a feature of space programs. Can you think of \u003Cstrong\u003EANY\u003C/strong\u003E other realistic or interesting use of a Sabatier Reactor (takes CO2 and H2 and makes methane and water- one is currently deployed on the ISS) besides life-support and making fuel off-planet? A game called **** \u0022space program\u0022 is \u003Cstrong\u003Eprecisely\u003C/strong\u003E where ISRU belongs.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E----------\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EI dunno, I seem to be having lots of fun with beamed power and ISRU missions so far, on top of Kethane. If anything it\u0027s more of a challenge, since I\u0027m trying things like sending craft that would normally never manage a Duna mission out to Minmus or Mun to refuel first. I\u0027m making \u0022Hopper\u0022 craft that bounce around multiple biomes while on Mun or Minmus, refuelling between steps before coming home. It opens up more stuff to do, which in a sandbox-like game, is basically a life-extending thing.\u003Cp\u003EThis is the sort of thing that could turn a contracted extraplanetary mission from \u0022expensive but doable\u0022 into \u0022cheap enough to have a massive profit\u0022, depending on how complicated a player wishes to make their craft, and indeed, mission. And why should a player not be rewarded for taking that option?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like your thinking.\u003C/p\u003E\u003Cp\u003EMore features = more play time. Enough said about that.\u003C/p\u003E\u003Cp\u003ERewarding players for adding complexity to their missions, and learning a new system- also a great idea...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E----------\u003C/p\u003E\u003Cp\u003EOh, and for those wondering what In-Situ Resource Utilization would ADD the the game, I *highly* recommend you check out this YouTube video, in which a player re-created NASA\u0027s Constellation Mission (which relied on ISRU for its Mars component), using Kethane for his ISRU system. He seemed to have a lot of fun imitating NASA\u0027s plan...\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Tp6yj2k0Fpc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAlso, here is a book which further discusses NASA\u0027s plans for ISRU on Mars and the Moon (though the author does not seem to understand that the intended reason for melting down Moon regolith is *not* to obtain water-ice-, but to obtain Oxygen for life-support and ascent propellent by electrolyzing Aluminum Oxide regolith...)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://books.google.com/books?id=gfYolGeTePkC\u0026amp;pg=PA247\u0026amp;lpg=PA247\u0026amp;dq=Mars\u002BConstellation\u002BISRU\u0026amp;source=bl\u0026amp;ots=asxWe33fgV\u0026amp;sig=wE43VQOV6o3UzbnSSOEvoTSCPh0\u0026amp;hl=en\u0026amp;sa=X\u0026amp;ei=PtOHU5ipEdaeqAaIgYLYAw\u0026amp;ved=0CDkQ6AEwAg#v=onepage\u0026amp;q=Mars%20Constellation%20ISRU\u0026amp;f=false\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://books.google.com/books?id=gfYolGeTePkC\u0026amp;pg=PA247\u0026amp;lpg=PA247\u0026amp;dq=Mars\u002BConstellation\u002BISRU\u0026amp;source=bl\u0026amp;ots=asxWe33fgV\u0026amp;sig=wE43VQOV6o3UzbnSSOEvoTSCPh0\u0026amp;hl=en\u0026amp;sa=X\u0026amp;ei=PtOHU5ipEdaeqAaIgYLYAw\u0026amp;ved=0CDkQ6AEwAg#v=onepage\u0026amp;q=Mars%20Constellation%20ISRU\u0026amp;f=false\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-03T11:01:15Z\u0022 title=\u002206/03/2014 11:01  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 3, 2014\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-30T02:43:52Z","Content":"\n\u003Cp\u003EI like the paraphrase of George Mallory in the video (watch it already if you haven\u0027t before:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Tp6yj2k0Fpc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E)\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003E\u0022Because it\u0027s there- mountains are meant to be climbed, rules are meant to be broken\u0022\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI think the same sentiment sums up the greatest reason why KSP should include a complex and realistic ISRU system- for the challenge. So it\u0027s there- another mountain to be climbed.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhy visit Eeelo, why set up a colony on Laythe in KSP? Because you can. Their very existence is a challenge to the human (or Kerbal) spirit.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe same applies to an ISRU system. Why should players do it, ultimately? Because they can.\u003C/strong\u003E You think it\u0027s EASY landing multi-ton refineries on Vall or Tylo, and then finding the electricity to power them out by Jool where there\u0027s hardly any sunlight (especially if the devs properly implement the Inverse-Square rule soon, which they are looking into by all accounts...) Or developing 100% reusable launch systems to get that fuel to orbit? It\u0027s not. Not for most players (not eve for me). \u003Cstrong\u003EIt\u0027s a challenge- a mountain to climb, a rule to be broken.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E For the same reasons, I think KSP should switch over to a larger scale, closer to reality- to make the game more of a challenge. Yes, a scale 20% or 30% instead of 10% of reality would add to launch-times and time-to-orbit, but it would also increase the Delta-V requirements, and thus the challenge, of getting to orbit...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-30T02:49:13Z\u0022 title=\u002205/30/2014 02:49  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 30, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-30T03:32:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EI think the same sentiment sums up the greatest reason why KSP should include a complex and realistic ISRU system- for the challenge. So it\u0027s there- another mountain to be climbed.\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe same applies to an ISRU system. Why should players do it, ultimately? Because they can.\u003C/strong\u003E You think it\u0027s EASY landing multi-ton refineries on Vall or Tylo, and then finding the electricity to power them out by Jool where there\u0027s hardly any sunlight (especially if the devs properly implement the Inverse-Square rule soon, which they are looking into by all accounts...) Or developing 100% reusable launch systems to get that fuel to orbit? It\u0027s not. Not for most players (not eve for me). \u003Cstrong\u003EIt\u0027s a challenge- a mountain to climb, a rule to be broken.\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWhile these are challenges that an ISRU system creates, I would say they are not challenges a \u003Cem\u003Ecomplicated\u003C/em\u003E ISRU system creates that a simple one does not. When a system starts having more than a few different raw materials, when it starts having long multi-step conversion processes that require a whole bunch of different parts, I feel it\u0027s going to be easy to just end up with a bunch of tickboxes to check at build time and an interplanetary fetch quest to make your stuff.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E For the same reasons, I think KSP should switch over to a larger scale, closer to reality- to make the game more of a challenge. Yes, a scale 20% or 30% instead of 10% of reality would add to launch-times and time-to-orbit, but it would also increase the Delta-V requirements, and thus the challenge, of getting to orbit...\u003C/div\u003E\u003C/blockquote\u003ESquad should be a bit careful here though. A scale-up may be good for the experienced players, but IIRC when I first played it took me a few hours play just to make orbit, which I did with a really inefficient rocket flown really poorly. It\u0027s not good to make things too hard for newcomers.\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-30T07:13:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DoToH\u0022 data-cite=\u0022DoToH\u0022\u003E\u003Cdiv\u003EAnd what new feature implementing while on alpha stage of development is for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot really. The game may be alpha, but it\u0027s not a case of \u0022throw everything to the wall and see what sticks\u0022. Features should only be implemented if they\u0027re intended to be in the final game.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe \u0022if you want it, install a mod\u0022 answer is well known and little constructive.\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EIt\u0027s also a fact. KSP has a huge mod scene. Mods exist to extend the stock game and change it. Just because you like a mod doesn\u0027t mean it should be stock.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EMany of us wanting some sort of ISRU already have a mod about it installed. So did many people before with docking mods or plane mods, and those features became stock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, but that doesn\u0027t in itself mean that every popular mod should be made stock. The most popular mod out there is probably Mechjeb, but you won\u0027t ever see that in stock either.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou think it shouldn\u0027t be stock... can you give a reason (other than \u0022there is a mod that does it\u0022)? No offense, Im just asking for a more detailed explanation. Do you think it would affect gameplay? too much complexity? low priority feature but ok to have it in 1.0?....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve already given a reason in my original reply, but I\u0027ll repeat it if you like. I think the rocket equation and the need to get everything you want in space up from the surface of Kerbin is the main source of difficulty in the game. I know there are mods that allow you to mine resources and build and launch ships from other planets, but the core game is about launching rockets from Kerbin. Anything that moves the game away from that paradigm rightly belongs in modland IMO. The core game should have some focus and not try to implement everything. They\u0027ve deliberately built the game to be moddable so that if you want to change that focus you can.\u003C/p\u003E\u003Cp\u003ENote that I\u0027m not arguing against ISRU being in KSP. Just that I don\u0027t think there\u0027s any need for it to be in \u003Cem\u003Estock\u003C/em\u003E KSP.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-30T07:16:33Z\u0022 title=\u002205/30/2014 07:16  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 30, 2014\u003C/time\u003E by Seret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-05-30T08:22:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EOff topic, but is this really something people have been clamoring for in the core game? Are people feeling limited in their ability to make \u003Cem\u003Espace boats\u003C/em\u003E?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey gave us seas and water, but nothing to use on them.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-30T08:23:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003Ethe core game is about launching rockets from Kerbin. Anything that moves the game away from that paradigm rightly belongs in modland IMO.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure if that\u0027s really a tenable position... if it were true the game could have been called \u0022finished\u0022 18 months ago.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-30T11:51:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003ENot sure if that\u0027s really a tenable position... if it were true the game could have been called \u0022finished\u0022 18 months ago.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, yes. The core of the game has been finished for quite a while. KSP is a game about building, launching and crashing rockets. Maybe a bit of flying them too. We\u0027ve been doing that for ages. We\u0027re now at the point where they\u0027re adding all the extra stuff (such as career mode) on top of that core.\u003C/p\u003E\u003Cp\u003EI\u0027m not saying that there shouldn\u0027t be anything in the game that builds on that core, I\u0027m saying there shouldn\u0027t be anything which detracts from it. ISRU potentially means you could reach a point in the game where you never had to launch anything from KSP. I don\u0027t think that really matches the devs\u0027 vision for the game, from what they\u0027ve said in the past.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-30T12:03:31Z","Content":"\n\u003Cp\u003ENot so sure, Seret, they were implementing ISRU but didn\u0027t like how it turned out.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-05-30T12:31:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ENot so sure, Seret, they were implementing ISRU but didn\u0027t like how it turned out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey found it \u0022made the game less fun\u0022. Without playing what they tested who can say why. Either way, I wouldn\u0027t expect to see it return. They\u0027re not exactly falling over themselves to implement it.\u003C/p\u003E\u003Cp\u003EStill, the question was \u0022do you miss resource mining?\u0022 and I\u0027ve explained why I really don\u0027t think its absence takes anything away from the game. I\u0027m not really trying to convince anyone of anything, although I would suggest that you\u0027re setting yourself up for disappointment if you sit around pining for it.\u003C/p\u003E\n"}]}