{"TopicId":73189,"ForumId":16,"TopicTitle":"Is docking required to return from the Mun?","CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-05-23T21:56:18Z","PageNum":1,"Articles":[{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-05-23T21:56:18Z","Content":"\n\u003Cp\u003EBy the way, I don\u0027t literally mean \u0022does the game require you to dock\u0022, it\u0027s just that I\u0027ve heard about the Apollo missions when they realized that landing with all the return fuel would be too much to carry. Is it the same with KSP? I\u0027ve been trying to build a Mun rocket that can return the crew, but I suck at docking/rendezvous, at least in Kerbin orbit.\u003C/p\u003E\u003Cp\u003ESo, in KSP Mun missions, is it possible to just land with all the fuel for the return trip? If so, how hard would this be? Any help is appreciated! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-23T22:16:17Z\u0022 title=\u002205/23/2014 10:16  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 23, 2014\u003C/time\u003E by Nikola7007\u003C/strong\u003E\n\u003Cbr\u003EThread answered\n\u003C/span\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-05-23T21:59:20Z","Content":"\n\u003Cp\u003ENot at all. You can easily create a singe vessel. Even IRL Apollo style wasn\u0027t completely necessary, although it worked exceptionally well. Apollo style is best suited for trips to Duna or plantets/moons further away. \u003C/p\u003E\u003Cp\u003EThis, dubbed the \u0022Toyota Corolla\u0022 lander, can get you from the surface of the moon back to Kerbin, given you get it there fully fueled, which shouldn\u0027t be that hard.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/h9rLPKB.jpg\u0022 alt=\u0022h9rLPKB.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EP.S. I\u0027m not going to pressure you to download mods, but Kerbal Engineer Redux will greatly help you design ships with its Delta V readout.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-23T22:05:36Z\u0022 title=\u002205/23/2014 10:05  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 23, 2014\u003C/time\u003E by Tank Buddy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2014-05-23T22:09:47Z","Content":"\n\u003Cp\u003EThe amount of dV you need to return from Mun is very miniscule. My advise would be to look at someone like Scott Manley who makes absolutely beautiful tutorials.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/cmAMGJm-bwU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EObserve how he makes his manouvers and you will get very good with basic manouvers.\u003C/p\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-05-23T22:15:43Z","Content":"\n\u003Cp\u003EAh, ok. Thanks guys!\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-05-23T23:00:47Z","Content":"\n\u003Cp\u003EOfcourse not.\u003C/p\u003E\u003Cp\u003EPlus, you can just put a decoupler on your pod and add a parachute, then you\u0027d be fine. You won\u0027t even have to worry about weight.\u003C/p\u003E\u003Cp\u003EIts just wasting alot of fuel to dock to a space station just to go back into the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-23T23:43:22Z","Content":"\n\u003Cp\u003EOne of the original ideas for manned Moon missions was actually a one-stage vessel that would land the entire thing and take-off again. The reason for the Apollo program using a lander (and that lander splitting in two when it left the Moon) was that it had huge delta-v savings. Less fuel used to land means way, way less fuel required at launch. In KSP, we have the luxury of not having to care about that stuff, we can just strap even more boosters onto our rockets, efficiency be damned.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-05-23T23:44:23Z","Content":"\n\u003Cp\u003EDue to the differences in the Kerbal universe and the power/mass of engines and fuel available an \u0027Apollo\u0027 style mission is much harder than a direct return. A one-man (Kerbal) capsule only needs a bit more than 45-units of fuel (a small tank) and one tiny 48-7S to launch from Mun and return to Kerbin. Just remember to put a parachute on top of it!\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2014-05-24T00:54:39Z","Content":"\n\u003Cp\u003EEchoing what Pecan said above (he must have seen my design), this little fella is able to return directly to Kerbin from either Minmus or Mun without docking with an orbiting command ship, which is why it is fitted with a parachute.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.88qv.com/net/bug8.png\u0022 alt=\u0022bug8.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-05-24T01:07:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EOne of the original ideas for manned Moon missions was actually a one-stage vessel that would land the entire thing and take-off again. The reason for the Apollo program using a lander (and that lander splitting in two when it left the Moon) was that it had huge delta-v savings. Less fuel used to land means way, way less fuel required at launch. In KSP, we have the luxury of not having to care about that stuff, we can just strap even more boosters onto our rockets, efficiency be damned.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso, in RL an all-in-one setup would require spending fuel to land the heat shield on the moon and lift it back off, but in KSP we don\u0027t need those.\u003C/p\u003E\u003Cp\u003EFurthermore, the delta v requirements are a lot less in KSP.\u003C/p\u003E\u003Cp\u003EEDIT: All mine are direct returns. I started out with something almost exactly like the one Tank Buddy posted above, but I had issues with it tipping over, and now I use a wider lander made with two radially attached FL-T200s with 48-7S engines, and put two landing legs on each tank. The two side tanks/engines are attached with radial decouplers and get jettisoned on the way home.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-24T01:12:57Z\u0022 title=\u002205/24/2014 01:12  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 24, 2014\u003C/time\u003E by NERVAfan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-24T02:39:35Z","Content":"\n\u003Cp\u003EAs mentioned, a direct ascent Mun landing is entirely viable thanks to the Kerbol system being smaller and thus requiring less delta-V to get around than the real solar system. In fact it\u0027s the better option in career mode since you\u0027ll get more science for returning the lander.\u003C/p\u003E\u003Cp\u003EEven if you \u003Cem\u003Edo\u003C/em\u003E choose a Munar orbit rendezvous, you don\u0027t need to dock. Just rendezvous the lander to within a hundred metres or two of the orbiter then EVA the Kerbals over. That\u0027s how I\u0027ve tended to do my early career Mun landings. Don\u0027t forget the science!\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2014-05-24T04:11:53Z","Content":"\n\u003Cp\u003EThis gets down to the way you want to play.\u003C/p\u003E\u003Cp\u003EPersonally I think Apollo missions are more fun - and they give you a better learning experience for harder missions. Noone\u0027s going to try and land on Tylo without having that lander separate from its transport.\u003C/p\u003E\n"},{"CreatedByName":"joekidd1992","CreatedById":110769,"CreatedDateTime":"2014-05-24T04:14:33Z","Content":"\n\u003Cp\u003EI land with the top and usually have a lot of fuel even after landing on the Mun. Then it is just lifting off out of the Mun\u0027s orbit and then maneuvering to get the PE on Kerbin down low enough. I usually drop everything but the pod right before the burn. I\u0027ve never had any issues except the 2nd stage is a little hard to maneuver to the right position. With a little bit of practice, I was able to move it around well enough.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/2rzwf1t.jpg\u0022 alt=\u00222rzwf1t.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-24T11:29:41Z","Content":"\n\u003Cp\u003EWhen the Mun was originally added Apollo-style was impossible, because we didn\u0027t have persistence or docking yet. Only one active craft meant direct return was the \u003Cem\u003Eonly\u003C/em\u003E way to land on the Mun and return.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2014-05-24T12:38:30Z","Content":"\n\u003Cp\u003EThis fairly basic design is enough to get a 3 man capsule to the Mun and back with no docking involved. The munar transfer stage has enough fuel to establish the parking orbit at Kerbin, transfer to and establish an orbit at the Mun, and do most of the descent braking to the surface. This leaves the lander with almost all of it\u0027s fuel to finalise the descent to the surface and then return to Kerbin.\u003C/p\u003E\u003Cp\u003EThe lifting stage is jettisoned whilst still sub-orbital at Kerbin, and the Munar transfer stage is jettisoned when sub-orbital at Mun, so no parts are left floating in space as debris.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.88qv.com/KSP/3mun1.png\u0022 alt=\u00223mun1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.88qv.com/KSP/3mun2.png\u0022 alt=\u00223mun2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.88qv.com/KSP/3mun3.png\u0022 alt=\u00223mun3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EETA: Looking back at that design, I have made a small change to make it look slightly better and get rid of the gap between the lander and the insertion stage at the top of the rocket. I replaced the LV909 engine on the lander with 3 of the small Rockomax radial engines attached directly to the fuel tank.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-24T13:15:20Z\u0022 title=\u002205/24/2014 01:15  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 24, 2014\u003C/time\u003E by Scarecrow88\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-05-24T15:27:07Z","Content":"\n\u003Cp\u003ETwo Minmus and Mun designs (Long Tom and Fat Sally), and an interplanetary satellite-delivery transfer vehicle:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/0szOz#0\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"}]}