{"TopicId":73331,"ForumId":44,"TopicTitle":"Next-Generation launch technologies achievable with CURRENT technology","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-25T03:42:50Z","PageNum":1,"Articles":[{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-25T03:42:50Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u0022Earth is the cradle of the mind- but one cannot stay in the cradle forever.\u0022\u003C/span\u003E\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E- Konstantin Eduardovich Tsiolkovsky -\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe title says it all folks, I\u0027m interested in discussing launch technologies that can be achieved with \u003Cstrong\u003ECURRENT\u003C/strong\u003E technology (that means, all the underlying technologies have already been developed, and at least seem common use in some non-space application: they don\u0027t have to have been tested in space yet...) Ones that can get humanity to space CHEAPLY, and thus finally help mankind to grow beyond the \u0022cradle\u0022 of Earth, and find ways to better-negotiate the Tsiolkovsky Rocket Equation, for which that man has become so famous...\u003C/p\u003E\u003Cp\u003EI would like to remind everybody that none of these technologies have seen full-scale use yet. That means there \u003Cstrong\u003EWILL\u003C/strong\u003E be engineering and technical challenges to meet to implement them. That does \u003Cstrong\u003ENOT\u003C/strong\u003E mean that they can\u0027t be done with nothing but our current understanding of physics and engineering. The Microwave Beamed Power launch system I discuss below is a perfect example- it would benefit greatly if used with a high-altitude launch site (such as in the Rocky Mountains) in order to minimize atmospheric diffraction of the microwaves as the beam\u0027s path-length through the atmosphere increases... We\u0027ve never built a truly high-capacity mountain launch site before, but that certainly doesn\u0027t mean it can\u0027t be done. The engineering challenges are \u003Cstrong\u003ENOT\u003C/strong\u003E beyond us...\u003C/p\u003E\u003Cp\u003E(Thermal rockets, like \u003Cstrong\u003Eall\u003C/strong\u003E normal chemical ones, also benefit from high-altitude launches due to reduced atmospheric compression of their exhaust column- which improves their ISP; from the higher optimal takeoff velocity- which means higher launchpad TWR designs will benefit from reduced gravity-losses without causing excessive drag-losses; from reduced total air-resistance and energy losses from drag; and slightly from the reduced total altitude they have to climb to orbit...)\u003C/p\u003E\u003Cp\u003EI\u0027ll start it off with a few great ideas that would be \u003Cstrong\u003EINCREDIBLY\u003C/strong\u003E powerful when combined (either launch system with microwave power)\u003C/p\u003E\u003Cp\u003EFirst of all, magnetic launch-assist systems: because \u003Cstrong\u003EREAL\u003C/strong\u003E drag falls off exponentially at hypersonic speeds, and there\u0027s no reason we can\u0027t launch our rockets at Mach 26 (Mach 25 is orbital velocity) out the end of basically a hyper-powered Maglev in a vacuum tube (note that the tube exits at the TOP of a mountain, where the air is thinner)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/StarTram\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/StarTram\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESecond, Microwaved Beamed Power Thermal Rocketry- because we\u0027ve had the technology to efficiently create the super-powerful microwave beams since 2005 (when there was a breakthrough in gyrotron technology), and the technology to build receivers for those microwaves (which were previously very inefficient to generate) since at least 1964 with the invention of the \u0022rectenna\u0022 (a technology which now sees everyday use in smart-cards and RFID tags \u003Ca href=\u0022https://en.wikipedia.org/wiki/Rectenna\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Rectenna\u003C/a\u003E).\u003C/p\u003E\u003Cp\u003EThe microwaves can either be turned directly into electricity, and used to run electric engines like scaled-up multi-megawatt VASIMR engines; or used to heat up a thermal receiver for lower-ISP but higher-thrust thermal rocketry comparable to Nuclear Thermal Rockets- but without the heavy/\u0022dangerous\u0022 reactors...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Beam-powered_propulsion#Microwave_propulsion\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Beam-powered_propulsion#Microwave_propulsion\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThird, and the most familiar/ lowest tech of these technologies, Space-X style reusable launch vehicle flight profile. It should be an all but foregone conclusion to most people by now that, unless the industry-controlling launch giants somehow manage to kill SpaceX with lawsuits or such, it will probably be a successful concept. The launch profile might get altered a little- for instance perhaps the first stage will be detached sooner in order to reduce its airspeed during descent- but it\u0027s fairly sure to work IMHO:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/SpaceX_reusable_launch_system_development_program\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/SpaceX_reusable_launch_system_development_program\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELast, but not least, are Momentum Exchange Tethers. A \u0022Skyhook\u0022 basically. While it would *NOT* work for objects on the ground with current materials technology, it could made to pick up rockets or aircraft flying in the atmosphere at Mach 12, and carry them the rest of the way to orbit. \u0022Single Stage to Tether\u0022 as it\u0027s basically been called. Of course, the tether itself would be subject both to atmospheric drag (on the part entering the atmosphere) and to energy/momentum loss to the spacecraft it scooped up...\u003C/p\u003E\u003Cp\u003EThe main advantage would be that a tiny high-ISP engine (such as a scaled-up VASIMR, possibly powered by beamed microwave power) on the tether could operate at very low thrust to rebuild the lost momentum between each vehicle it scooped up Combined with a magnetic launch assist system, virtually all the energy for launches could be provided from electricity (and a very small amount of propellent) from Earth or orbital power satellites, and VERY little engine mass, and a LOt less fuel mass, would need to be accelerated...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Momentum_exchange_tether#Earth_launch_assist_bolo\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Momentum_exchange_tether#Earth_launch_assist_bolo\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d love to see other concepts, as people discuss them here. And thoughts/comments about how the technologies could be combined is always welcome- for instance perhaps the new VASIMR engine could be scaled up to the multi-megawatt range like is already being planned for the future, and combined with Microwave Beamed Power for an electric-propulsion upper stage to a Space-X style launch...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-13T07:15:25Z\u0022 title=\u002206/13/2014 07:15  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 13, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-25T04:05:25Z","Content":"\n\u003Cp\u003ESpaceX is pretty darn cool, in that they\u0027ve basically made a tall pointy object take-off and then land again with thrust from the bottom. It\u0027s like the spacey-gigantic-rocket-explody equivalent of balancing a broom on your hand...with more explody.\u003C/p\u003E\u003Cp\u003EStarTram is a nifty idea if you have lots and lots of electrical power available for cheap. Fusion power would be an obvious candidate if it can be made to work, fission a decent second.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-25T04:29:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003ESpaceX is pretty darn cool, in that they\u0027ve basically made a tall pointy object take-off and then land again with thrust from the bottom. It\u0027s like the spacey-gigantic-rocket-explody equivalent of balancing a broom on your hand...with more explody.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s cool, it\u0027s cheap(er), and it WORKS. What more could you ask for?\u003C/p\u003E\u003Cp\u003EThe greatest difficult they\u0027ve had so far is preventing the rocket from spinning out of control when it hits the lower atmosphere... Not something they shouldn\u0027t be able to overcome (personally, I\u0027ve had the same problem with my own Space-X imitation launches when they didn\u0027t have any reaction wheels. The key to fixing it appeared to be running the engines at low power to benefit from the thrust-vectoring... Aerodynamic control surfaces might also work...)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EStarTram is a nifty idea if you have lots and lots of electrical power available for cheap. Fusion power would be an obvious candidate if it can be made to work, fission a decent second.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven with current electricity costs, the electrical costs, while significant, are a LOT less than the current cost of getting things to orbit (the electricity only costs approx. $1 per kg. The system as a whole, without combination with other technologies, was optimistically estimated to cost $43 /kg- so it\u0027s a very small part of the total cost). So it\u0027s not really something that we need to wait for better methods of power generation for...\u003C/p\u003E\u003Cp\u003EAnd if it brought costs down of getting things to orbit low enough (especially if combined with beamed microwave power for the circularization stage- which could use the leftover water used for internal hull coolant during ascent as propellent), SpaceTram might allow for low-cost launch of solar power satellites that would beam their power back down to Earth- potentially bringing down the market price of electricity, and making the launches in turn even cheaper in a virtuous cycle... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-25T04:34:10Z\u0022 title=\u002205/25/2014 04:34  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 25, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-25T04:32:30Z","Content":"\n\u003Cp\u003EHuh. Well, there you go. Cheaper ways to space in our future. Maybe when I\u0027m old and grey we\u0027ll be at a point where I could get myself launched into space to die. That\u0027d be fun...I think. Just as long as I have a kill switch. Nice, giant dose of morphine would do.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-05-25T08:56:31Z","Content":"\n\u003Cp\u003EMost of those are not \u0022Current\u0022 technology. When evaluating various technological solutions to a problem, you need to take into account the concept of Technological Readiness Level.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Technology_readiness_level\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Technology_readiness_level\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn your list, only SpaceX\u0027s landing technology is \u0022current\u0022 tech at TRL 6-7. The others are TRL 1-2 at best.\u003C/p\u003E\u003Cp\u003EMost of the time, the reason we are not developing new launch systems is because they don\u0027t make sense economically. The entire world launch industry is scaled to perform 10 to 30 orbital launches per year. That is not because launches are expensive. It\u0027s because there is no demand for more frequent orbital launches, and the current \u0022sweet spot\u0022 is where it is. Trade studies are done all the time, but the infrastructure and research investments simply don\u0027t make sense with any current or foreseeable launch rates.\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-05-25T12:19:59Z","Content":"\n\u003Cp\u003ENo, drag doesn\u0027t fall of at hypersonic speeds. The drag coefficient falls of, but the total drag gets higher. However things get shot out of maglev at a 10 degree angle, so it gets out of the lower part of the atmosphere very quickly.\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2014-05-25T12:36:01Z","Content":"\n\u003Cp\u003EExplanation:\u003C/p\u003E\u003Cp\u003EWe are entering the chicken and the egg problem. First of all, we don\u0027t have enough Space McGuffin\u003Csup\u003Etm\u003C/sup\u003E for we to seriously explore space. Because of that, no one wants to go to space. Then, no one develops cheaper launch techs. The sat guys that loves putting satellites into space are discouraged from putting it there, because of the costs. So, no one develops the necessary Space McGuffin\u003Csup\u003Etm\u003C/sup\u003E that will start massive amount of space exploration.\u003C/p\u003E\u003Cp\u003EAnd necessary rules and regulations slow down launches, but its necessary because no one wants to start Kessler syndrome. If we have cheap space access Kessler syndrome is more likely to happen.\u003C/p\u003E\n"},{"CreatedByName":"Fox62","CreatedById":23673,"CreatedDateTime":"2014-05-25T16:01:03Z","Content":"\n\u003Cp\u003EI see your fancy electro-magnetic launch vehicles and raise you an Orion drive.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/enginelist.php#id--Pulse--Orion\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/enginelist.php#id--Pulse--Orion\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI win. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kruleworld","CreatedById":69697,"CreatedDateTime":"2014-05-25T22:57:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003Ethere\u0027s no reason we can\u0027t launch our rockets at Mach 26\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat kind of G-loading does a mach 26 launch create? how do you stop everything turning into pancakes?\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-26T00:02:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aghanim\u0022 data-cite=\u0022Aghanim\u0022\u003E\u003Cdiv\u003EAnd necessary rules and regulations slow down launches, but its necessary because no one wants to start Kessler syndrome. If we have cheap space access Kessler syndrome is more likely to happen.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not more likely to happen, it\u0027s \u003Cstrong\u003Egoing\u003C/strong\u003E to happen. Even if we stop new/extra launches completely, we\u0027ve already reached a point where we absolutely need active management of orbital debris to prevent the catastrophic effect of Kessler syndrome. If we keep launching as many objects as we do right now, it\u0027ll be bad, and increasing numbers of launches would be even more catastrophic.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.esa.int/spaceinvideos/Videos/2013/04/The_Space_Debris_Story_2013\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.esa.int/spaceinvideos/Videos/2013/04/The_Space_Debris_Story_2013\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.esa.int/Our_Activities/Operations/Ground_Systems_Engineering/ESA_Space_Debris_Office\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.esa.int/Our_Activities/Operations/Ground_Systems_Engineering/ESA_Space_Debris_Office\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-26T00:20:05Z\u0022 title=\u002205/26/2014 12:20  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 26, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2014-05-26T02:32:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELast, but not least, are Momentum Exchange Tethers. A \u0022Skyhook\u0022 basically. While it would *NOT* work for objects on the ground with current materials technology, it could made to pick up rockets or aircraft flying in the atmosphere at Mach 12, and carry them the rest of the way to orbit. \u0022Single Stage to Tether\u0022 as it\u0027s basically been called. Of course, the tether itself would be subject both to atmospheric drag (on the part entering the atmosphere) and to energy/momentum loss to the spacecraft it scooped up...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHang on you want to structurally dock two craft moving at mach 12 in atmosphere? That sounds reasonable to you?\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-26T08:20:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drakesdoom\u0022 data-cite=\u0022drakesdoom\u0022\u003E\u003Cdiv\u003EHang on you want to structurally dock two craft moving at mach 12 in atmosphere? That sounds reasonable to you?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKeep in mind the rotation speed would be synchronized with orbital velocity such that the lower tip speed would also be Mach 12 at its lowest point- so the aircraft or rocket would be getting hooked by something temporarily moving at the same speed. Using a magnetic launch-assist tube would also help, by reducing the time from launch to tether altitude (rockets in the tube could safely be accelerated at relatively high G\u0027s due to the lack of air in the tube and the controlled environment) as well as providing nearly all the velocity necessary to reach Mach 12 in the upper atmosphere (the exit velocity from the launch tube at 5-6 km altitude could be up to Mach 26). This would be safest and work best with unmanned cargo craft, of course.\u003C/p\u003E\u003Cp\u003EA number of engineers seem to think it\u0027s possible- so I\u0027m inclined to agree with them.\u003C/p\u003E\u003Cp\u003EKeep in mind this is in the high reaches of the UPPER atmosphere- where there\u0027s a LOT less air pressure to cause drag. In fact, the altitudes where this version of the Skyhook would reach to would be best reached with rockets- essentially more of a low suborbital trajectory than atmospheric flight.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-26T08:31:46Z\u0022 title=\u002205/26/2014 08:31  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 26, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-05-26T10:03:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EKeep in mind the rotation speed would be synchronized with orbital velocity such that the lower tip speed would also be Mach 12 at its lowest point- so the aircraft or rocket would be getting hooked by something temporarily moving at the same speed. Using a magnetic launch-assist tube would also help, by reducing the time from launch to tether altitude (rockets in the tube could safely be accelerated at relatively high G\u0027s due to the lack of air in the tube and the controlled environment) as well as providing nearly all the velocity necessary to reach Mach 12 in the upper atmosphere (the exit velocity from the launch tube at 5-6 km altitude could be up to Mach 26). This would be safest and work best with unmanned cargo craft, of course.\u003Cp\u003EA number of engineers seem to think it\u0027s possible- so I\u0027m inclined to agree with them.\u003C/p\u003E\u003Cp\u003EKeep in mind this is in the high reaches of the UPPER atmosphere- where there\u0027s a LOT less air pressure to cause drag. In fact, the altitudes where this version of the Skyhook would reach to would be best reached with rockets- essentially more of a low suborbital trajectory than atmospheric flight.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, however it would require good timing, the hook and the plane will have zero relative speed at a point but move in very different trajectory so the window will be very short.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-26T10:07:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003ETrue, however it would require good timing, the hook and the plane will have zero relative speed at a point but move in very different trajectory so the window will be very short.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed- that\u0027s why you want a magnetic launch-assist (so you can get to speed and altitude very quickly, and don\u0027t have to spend large amounts of time building up speed when your window is so short) and an unmanned rocket (human pilots can\u0027t match the accuracy and precision of a drone- and no lives are lost if anything should go wrong...)\u003C/p\u003E\u003Cp\u003ENote I said \u0022rocket\u0022, *not* \u0022plane\u0022. A magnetic launch assist tube doesn\u0027t work so well with a plane... (all that wing area shooting out of a vacuum tube into atmosphere at Mach 26, at 6 km altitude and a 10 degree angle above the horizon? Forget about it- any plane would burn up or spin out of control... Even the rockets require a massive cooling system estimated to make up 10% of their mass to manage the heat at that speed/altitude...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-26T10:12:31Z\u0022 title=\u002205/26/2014 10:12  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 26, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sndrtj","CreatedById":110589,"CreatedDateTime":"2014-05-26T10:43:06Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kruleworld\u0022 data-cite=\u0022Kruleworld\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EWhat kind of G-loading does a mach 26 launch create? how do you stop everything turning into pancakes?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMach 26 is a speed, not an acceleration. To reach escape velocity (7.5 km/s, Mach 25.5), 12 minutes of acceleration at 1G will be enough. However, for that acceleration, you need a tube of 52,000 km to reach escape velocity. Since that\u0027s larger than the circumference of Earth, that\u0027s unpractical. For greater acceleration you need an ever smaller tube. At 5G, you need \u0022only\u0022 2250km. At 15G you need just 250km, and at 25G you only need 90km. Perhaps one can shorten the route further by applying short ms bursts of super acceleration (~100G) at intervals.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-05-26T11:53:09Z","Content":"\n\u003Cp\u003ENone of those things are \u0022CURRENT technology\u0022.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-05-26T14:32:29Z","Content":"\n\u003Cp\u003EI\u0027m rather skeptical about this. Most of the technology the OP mentioned are still in the drawing boards. The closest thing in the list to reality is SpaceX\u0027s reusable booster, and that\u0027s still a WIP prototype.\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-05-26T16:06:28Z","Content":"\n\u003Cp\u003EFor a single stage to tether option, the docking altitude would have to be above the Karman line. Not only docking inside the atmosphere would be terribly difficult, but the tether would be damaged and slowed down at every rotation, whether a ship docks or not.\u003C/p\u003E\u003Cp\u003EA magnificent idea to \u0027reload\u0027 the tether is to send mass (like bags of dust) from the moon. Since the moon\u0027s surface has a higher gravitational potential energy than Earth\u0027s surface or even LEO, you could send stuff from the moon (with a form of cannon), and use the kinetic energy to send ships from suborbital trajectories to LEO and beyond.\u003C/p\u003E\u003Cp\u003EThe problem with startram is that it requires an absurd amount of power for a short duration, which either means having a bunch of power plant that will work only a few minutes every day, or a way to store a lot of massive energy and a very large output power. Star Tram people propose to use superconductor loop storage, which would be very difficult to achieve on useful scale.\u003C/p\u003E\u003Cp\u003EYou also have the massive deceleration when getting out of the tube, and the sonic boom.\u003C/p\u003E\u003Cp\u003EAn alternative to startram that would be significantly easier and cheaper is ram accelerator. I\u0027m too lazy to find it, but there is a group working on it, and they could reach very high velocity with a glorified steel tube and a biconic projectile, enough to reach orbit with a small hybrid rocket.\u003C/p\u003E\u003Cp\u003EThe advantages over magnetic acceleration are:\u003C/p\u003E\u003Cp\u003E-energy stored as chemicals\u003C/p\u003E\u003Cp\u003E-technology proven on smaller scale (same speeds, just smaller projectiles)\u003C/p\u003E\u003Cp\u003E-much cheaper to build\u003C/p\u003E\u003Cp\u003E-shorter tube\u003C/p\u003E\u003Cp\u003EThe inconvenient are:\u003C/p\u003E\u003Cp\u003E-super high acceleration makes it useful only for reinforced stuff (1000G levels)\u003C/p\u003E\u003Cp\u003E-vibrations\u003C/p\u003E\u003Cp\u003E-many compartments needed (you need different mixes of gases at different pressures as you go faster)\u003C/p\u003E\u003Cp\u003E-vehicle shape limited by biconic projectile shape.\u003C/p\u003E\u003Cp\u003EAll in all, a much more likely option for the near to mid future.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-26T21:56:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sndrtj\u0022 data-cite=\u0022sndrtj\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMach 26 is a speed, not an acceleration. To reach escape velocity (7.5 km/s, Mach 25.5), 12 minutes of acceleration at 1G will be enough. However, for that acceleration, you need a tube of 52,000 km to reach escape velocity. Since that\u0027s larger than the circumference of Earth, that\u0027s unpractical. For greater acceleration you need an ever smaller tube. At 5G, you need \u0022only\u0022 2250km. At 15G you need just 250km, and at 25G you only need 90km. Perhaps one can shorten the route further by applying short ms bursts of super acceleration (~100G) at intervals.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe launch tube would accelerate the rocket at 30 G\u0027s along a 130 km tube in the first iteration of the launch tube (and would thus only be usable with unmanned rockets).\u003C/p\u003E\u003Cp\u003EThere\u0027s nothing unrealistic or futuristic about scaling up existing magnetic technology to accomplish this- it simply would be a MASSIVE undertaking, in the same kind of manner as a space elevator would... (though not QUITE that large or expensive)\u003C/p\u003E\u003Cp\u003EWe already dig tunnels longer than 130 km- the Delaware Aqueduct is a 4.1 meter diameter and 137 km long tunnel drilled through solid rock to provide New York city with approximately half of its water supply, for instance:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_longest_tunnels_in_the_world\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_longest_tunnels_in_the_world\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Delaware_Aqueduct\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Delaware_Aqueduct\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHowever, the first version (later, lower-G versions for manned spacecraft are planned) of the magnetic launch-assist tube would likely be built above-ground anyways:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u0022The tunnel tube itself for Gen-1 has no superconductors, no cryogenic cooling requirements, and none of it is at higher elevation than the local ground surface. Except for probable usage of SMES as the electrical power storage method, superconducting magnets are only on the moving spacecraft, inducing current into relatively inexpensive aluminum loops on the acceleration tunnel walls, levitating the craft with 10 centimeters clearance, while meanwhile a second set of aluminum loops on the walls carries an AC current accelerating the craft: a linear synchronous motor.\u0022\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-26T21:57:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ENone of those things are \u0022CURRENT technology\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, you\u0027re \u003Cstrong\u003Edead wrong.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBuilding it \u003Cstrong\u003EBIGGER \u003C/strong\u003Edoesn\u0027t mean the technology required is unrealistic or futuristic. The launch-assist tube, for instance, doesn\u0027t require a single technology we don\u0027t already use for other applications...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-26T22:01:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EI\u0027m rather skeptical about this. Most of the technology the OP mentioned are still in the drawing boards. The closest thing in the list to reality is SpaceX\u0027s reusable booster, and that\u0027s still a WIP prototype.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe closest thing on the list to being feasible with current technology is actually the magnetic launch-assist tube: which we\u0027ve had the technology to build since at least the 1980\u0027s...\u003C/p\u003E\u003Cp\u003ESpaceX\u0027s resuable vehicle has some problems with steep hypersonic re-entry on the lower stage, and even higher-energy re-entry on the upper stage from orbital velocity...\u003C/p\u003E\u003Cp\u003ENonetheless, both of these technologies (SpaxeX-style reusable launch vehicles, and magnetic launch-assist tubes) are perfectly doable with today\u0027s technology.\u003C/p\u003E\u003Cp\u003ESometimes you have to spend a lot of money (i.e. building a huge launch tube) in order to save a lot of money (i.e. drastically cutting the cost of getting things to orbit).\u003C/p\u003E\u003Cp\u003EObviously none of these things have actually been built yet, even if we already have the technology- or we wouldn\u0027t be talking about them as possible instead of existing launch systems. But just because something \u003Cstrong\u003EHASN\u0027T\u003C/strong\u003E been done with today\u0027s technology \u003Cstrong\u003E*doesn\u0027t*\u003C/strong\u003E mean it \u003Cstrong\u003ECAN\u0027T\u003C/strong\u003E be done with today\u0027s technology...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-26T22:03:46Z\u0022 title=\u002205/26/2014 10:03  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 26, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-26T22:14:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003EFor a single stage to tether option, the docking altitude would have to be above the Karman line. Not only docking inside the atmosphere would be terribly difficult, but the tether would be damaged and slowed down at every rotation, whether a ship docks or not.\u003Cp\u003EA magnificent idea to \u0027reload\u0027 the tether is to send mass (like bags of dust) from the moon. Since the moon\u0027s surface has a higher gravitational potential energy than Earth\u0027s surface or even LEO, you could send stuff from the moon (with a form of cannon), and use the kinetic energy to send ships from suborbital trajectories to LEO and beyond.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s kind of the idea as proposed, actually- except for the part about the Moon-dust, which is nevertheless also a good idea...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003EThe problem with startram is that it requires an absurd amount of power for a short duration, which either means having a bunch of power plant that will work only a few minutes every day, or a way to store a lot of massive energy and a very large output power. Star Tram people propose to use superconductor loop storage, which would be very difficult to achieve on useful scale.\u003Cp\u003EYou also have the massive deceleration when getting out of the tube, and the sonic boom.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe energy-storage is certainly a problem- but it\u0027s not something we can\u0027t figure out with today\u0027s technology. After all we already store absurd amounts of power for particle-accelerators...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003EAn alternative to startram that would be significantly easier and cheaper is ram accelerator. I\u0027m too lazy to find it, but there is a group working on it, and they could reach very high velocity with a glorified steel tube and a biconic projectile, enough to reach orbit with a small hybrid rocket.\u003Cp\u003EThe advantages over magnetic acceleration are:\u003C/p\u003E\u003Cp\u003E-energy stored as chemicals\u003C/p\u003E\u003Cp\u003E-technology proven on smaller scale (same speeds, just smaller projectiles)\u003C/p\u003E\u003Cp\u003E-much cheaper to build\u003C/p\u003E\u003Cp\u003E-shorter tube\u003C/p\u003E\u003Cp\u003EThe inconvenient are:\u003C/p\u003E\u003Cp\u003E-super high acceleration makes it useful only for reinforced stuff (1000G levels)\u003C/p\u003E\u003Cp\u003E-vibrations\u003C/p\u003E\u003Cp\u003E-many compartments needed (you need different mixes of gases at different pressures as you go faster)\u003C/p\u003E\u003Cp\u003E-vehicle shape limited by biconic projectile shape.\u003C/p\u003E\u003Cp\u003EAll in all, a much more likely option for the near to mid future.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree that the chemical propulsion tube is in any way more likely (the challenges of building a rocket that can survive 1000-G acceleration are nothing to sneeze at), but it\u0027s certainly an option as well. Additionally, there\u0027s always the option of a sort of hybrid tube- one that relies on a combination of chemical charges placed behind the rocket and magnets to accelerate the craft to high velocities...\u003C/p\u003E\u003Cp\u003EFinally, on the subject of launch-assist tubes, let\u0027s not forget that it\u0027s a case of diminishing returns the faster you launch the rocket. The greatest savings to rocket mass and payload fraction are going to come from the first 8-10 Mach of acceleration... So you might be able to build a shorter tube with a reduced rate of acceleration, and still easily get a SSTO (or 100% reusable 2-stage) rocket to orbit with more reasonable cost/expense, engineering challenges, and still decent payload fraction...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-26T22:23:07Z","Content":"\n\u003Cp\u003EOne more bit regarding the energy storage (more of you guys should actually read the articles on Wikipedia in detail before commenting)\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003E\u0022The largest challenge for Gen-1 is considered by the researchers to be sufficiently affordable storage, rapid delivery, and handling of the power requirements.\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EFor needed electrical energy storage (discharged over 30 seconds with about 50 gigawatt average and about 100 gigawatts peak), SMES cost performance on such unusual scale is anticipated of around a dollar per kilojoule and $20 per kW-peak. Such would be novel in scale but not greatly different planned cost performance than obtained in other smaller pulse power energy storage systems (such as quick-discharge modern supercapacitors dropping from $151/kJ to $2.85/kJ cost between 1998 and 2006 while being predicted to later reach a dollar per kJ, lead acid batteries which can be $10 per kW-peak for a few seconds, or experimental railgun compulsator power supplies). The study notes pulsed MHD generators may be an alternative.\u0022\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ENote that I edited out the (many) references from the article- as the hyperlinks don\u0027t work correctly by simple copy-pasting.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-05-26T22:24:12Z","Content":"\n\u003Cp\u003EActually SpaceX doesn\u0027t have any problems with reentry of the first stage. It initially had difficulties with picking roll up, but the landing legs improve aerodynamic roll stability. The last test actually successfully hovered over the water and splashed down. Once they manage to successful splashdowns within less than one mile of their target area, they will even try to land it on land, which they expect to happen later this year. After that, it\u0027s taking apart a few landed stages to ensure none of the parts break during flight and then they will actually reuse the first stages.\u003C/p\u003E\u003Cp\u003EHowever reusing the second stage is a totally different thing. That really only is on paper currently and it will still take years until they manage to successfully reuse a second stage.\u003C/p\u003E\u003Cp\u003EThe launch assist tube is something that we have never tried before to build. However for reusing a falcon 9s first stage, all of the components needed to do it have already been built and tested, it just needs a little bit more testing before it will actually be used.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-26T22:34:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003EActually SpaceX doesn\u0027t have any problems with reentry of the first stage. It initially had difficulties with picking roll up, but the landing legs improve aerodynamic roll stability.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe roll-stability problems were actually what I was thinking of when I wrote that...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003EThe last test actually successfully hovered over the water and splashed down. Once they manage to successful splashdowns within less than one mile of their target area, they will even try to land it on land, which they expect to happen later this year. After that, it\u0027s taking apart a few landed stages to ensure none of the parts break during flight and then they will actually reuse the first stages.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s good to know they\u0027re making steady progress...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003EHowever reusing the second stage is a totally different thing. That really only is on paper currently and it will still take years until they manage to successfully reuse a second stage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed- but that\u0027s mostly because they\u0027re prioritizing the first stage (it\u0027s much easier to accomplish, and the reusable 2nd stage isn\u0027t much good without a reusable 1st stage...)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003EThe launch assist tube is something that we have never tried before to build. However for reusing a falcon 9s first stage, all of the components needed to do it have already been built and tested, it just needs a little bit more testing before it will actually be used.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you\u0027re being over-optimistic about the timeline for the Falcon 9r (the reusable variant). It will probably take much longer than SpaceX predicts, as is typical for such things.\u003C/p\u003E\u003Cp\u003EOn the other hand, for the launch-assist tubes, we already have all the needed technologies for the 1st-generation tube proposed by \u0022SpaceTram\u0022 developed with MagLev, high-speed trains, and particle accelerators. The greatest challenge is simply scaling them up... It probably won\u0027t happen nearly as soon as SpaceX- but that\u0027s only due to a lack of political will, or private funding, for such an enormous project to be carried out...\u003C/p\u003E\u003Cp\u003EOne of my other points is that it\u0027s not entirely inconceivable for multiple technologies to be combined. For instance, if you build a version of the launch-assist tube that curves up to a vertical, instead of 10-degree, launch; and reduce the tube exit velocity to maybe only 1.2-2.4 km/s instead of 7-8; then you could use the launch-assist tube in combination with a SpaceX-style reusable launch vehicle to cheaply boost things to quite a bit higher orbits, or with much higher payload-fractions... (remember, due to the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Rocket_equation\u0022 rel=\u0022external nofollow\u0022\u003ERocket Equation\u003C/a\u003E, the first couple thousand m/s Delta-V are BY FAR the most expensive...)\u003C/p\u003E\u003Cp\u003EPerhaps you could also combine all three of the technologies I suggested- for instance a launch-assist tube, that launches a two-stage reusable rocket, that sheds its lower stage for SpaceX-style recovery, before the upper stage gives it its final boost to an orbital tether well above the Karman Line...\u003C/p\u003E\u003Cp\u003EIMHO, the biggest problem with the launch-assist tubes is actually that they\u0027re setting their sights too high- they\u0027re looking to provide the majority of orbital velocity from the ground, instead of simply using a launch-assist tube to push the rocket past the thickest part of the lower atmosphere where rockets are most inefficient, and into the upper atmosphere where the remaining Delta-V to orbit will be much cheaper due to the rocket equation and the smaller overall fuel fractions required as a result...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-26T22:44:47Z\u0022 title=\u002205/26/2014 10:44  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 26, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"}]}