{"TopicId":73334,"ForumId":55,"TopicTitle":"Is upscaling the size of the planets even possile in the future?","CreatedByName":"Evenger14","CreatedById":47013,"CreatedDateTime":"2014-05-25T04:47:15Z","PageNum":1,"Articles":[{"CreatedByName":"Evenger14","CreatedById":47013,"CreatedDateTime":"2014-05-25T04:47:15Z","Content":"\n\u003Cp\u003EAfter playing KSP (200\u002B hours..), it\u0027s really given me a new appreciation for just how big the Earth is, and how much it takes to get off it. \u003C/p\u003E\u003Cp\u003EI was wondering if it\u0027s even possible to upscale the planets/moons in KSP or not. Not to 1:1 scale, maybe just double the current size, and this is more of a thought exercise than a real suggestion. IIRC (and I may not) Kerbin is something like 1/10 the size of Earth, and using something like the Falcon 9 as an example: Earth rockets are 3.5m or so in diameter, and so are the KSP rockets, yet shouldn\u0027t they be able to be 1/10 the size and be as capable as the RL equivalents? \u003C/p\u003E\u003Cp\u003EYes, you can design a 1.25m rocket that can land on the Mun, but it\u0027s pretty tricky, and normally involves asparagus staging, where the Saturn V was just one starscraper of pure power. I guess I\u0027m really just confused on how the whole scalling thing works in KSP versus real life.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ASiDhja.png\u0022 alt=\u0022ASiDhja.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EImage Source: \u003C/span\u003E\u003Ca href=\u0022http://www.reddit.com/r/spacex/comments/26e87h/comparison_between_the_size_of_the_first_stage_on/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003Ehttp://www.reddit.com/r/spacex/comments/26e87h/comparison_between_the_size_of_the_first_stage_on/\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-05-25T05:21:47Z","Content":"\n\u003Cp\u003EI know this is a \u0022download a mod\u0022 answer, but the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55145-0-23-5-Real-Solar-System-v6-1-4-29-14\u0022 rel=\u0022external nofollow\u0022\u003ERSS mod\u003C/a\u003E shows that it is indeed possible.\u003C/p\u003E\u003Cp\u003EIt also apparently makes even getting into LKO a rather difficult engineering task.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-05-25T05:27:40Z","Content":"\n\u003Cp\u003EThe problem is not the possibility, it\u0027s the implications of doing so, and the scope of the game.\u003C/p\u003E\u003Cp\u003EAlso, no, with planets one tenth the size of real planets, that doesn\u0027t make your rockets one tenth smaller, that\u0027s not really how it works. Remember that real life rocket engines and real life fuel tanks compared to their KSP equivalent are actually pretty different on many points.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-05-25T08:37:54Z","Content":"\n\u003Cp\u003EOne of the main reasons the Devs chose this scale is so that getting to orbit doesn\u0027t take so long and isn\u0027t too difficult. Even now getting to orbit takes about 15 mins and for new players is extremely difficult.\u003C/p\u003E\u003Cp\u003EIf you upscaled planets or downscaled parts the climb to orbit would take an entire hour (many people only have a very short time to play) and even the most experienced of us would struggle to leave the atmosphere!\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-05-26T00:11:02Z","Content":"\n\u003Cp\u003EI feel as though the universe should be scaled up, not necessarily with larger bodies, but with larger distances\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-05-26T00:59:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skyler4856\u0022 data-cite=\u0022Skyler4856\u0022\u003E\u003Cdiv\u003EI feel as though the universe should be scaled up, not necessarily with larger bodies, but with larger distances\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProblem with this, is that even at the current maximum time warp, getting to Jool or Eeloo takes a rather long time. Long enough that at least in 23.5, I haven\u0027t even bothered to go there yet. Moho is as much of a challenge delta-v wise, but doesn\u0027t involve sitting around and watching paint dry for entertainment as your ship inches its way toward the SOI.\u003C/p\u003E\u003Cp\u003EPut the planets \u0022realistic\u0022 distances apart, and you can kiss goodbye to anybody ever bothering with trying the outer planets. At least until maximum time warp is at least a thousand times faster than it currently is.\u003C/p\u003E\u003Cp\u003EJust take a look at this video from 8m15s onward. You\u0027ll see what I mean:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/fLIvJVGZD-Y?start=495\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-26T01:01:46Z\u0022 title=\u002205/26/2014 01:01  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 26, 2014\u003C/time\u003E by technicalfool\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-05-26T01:33:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EIf you upscaled planets or downscaled parts the climb to orbit would take an entire hour (many people only have a very short time to play) and even the most experienced of us would struggle to leave the atmosphere!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is simply not true. It takes about \u003Ca href=\u0022http://www.nasa.gov/mission_pages/station/structure/elements/soyuz/timeline_overview.html\u0022 rel=\u0022external nofollow\u0022\u003Enine minutes\u003C/a\u003E for the Soyuz to get into orbit (a similar time when playing an RSS install) and many people, myself included, get out of the atmosphere playing RSS every single day.\u003C/p\u003E\u003Cp\u003EAnyway, it\u0027s definitely possible, but you would have to tweak a lot of things about the game. Even my own config for RSS, which is a 6.4:1 scaled Kerbin solar system, requires tweaking of some sort to make it playable. Sure, you can use bone stock parts, but you need some pretty ridiculous launchers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-26T01:37:14Z\u0022 title=\u002205/26/2014 01:37  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 26, 2014\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"}]}