{"TopicId":73354,"ForumId":16,"TopicTitle":"Finally i landed !","CreatedByName":"Scarredclown","CreatedById":110611,"CreatedDateTime":"2014-05-25T13:33:12Z","PageNum":1,"Articles":[{"CreatedByName":"Scarredclown","CreatedById":110611,"CreatedDateTime":"2014-05-25T13:33:12Z","Content":"\n\u003Cp\u003EToday i finally land a probe on Minmus ! Wasnt very pretty, lost a lot of fuel , but i manage to get it back in one piece ! Should i send other probe to practice before sending a kerbal mission ? Will i get science point for multiple probe mission ?\u003C/p\u003E\u003Cp\u003ELately i\u0027m a bit at loss to get new science point...\u003C/p\u003E\n"},{"CreatedByName":"MadMooMan","CreatedById":109260,"CreatedDateTime":"2014-05-25T13:43:49Z","Content":"\n\u003Cp\u003ENo, firstly you want to keep practising with your probes until you are confident you can get a Kerbal back in one piece. Also as you send more probes slowly increase the weight of each probe, as bringing a Kerbal with you does add weight. And no, multiple missions won\u0027t gather more science, unless you visit a different biome each time. The KSP wiki has biome maps for the Mun, Minmus and Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-05-25T13:59:37Z","Content":"\n\u003Cp\u003ECongratulations. I\u0027m sure your second landing will go alot easier now that you understand how it works. You\u0027ll gain a bit more science on your next craft returning from minmus surface, but not alot.\u003C/p\u003E\u003Cp\u003EYou can do a couple of things from here:\u003C/p\u003E\u003Cp\u003ESend another probe to practice.\u003C/p\u003E\u003Cp\u003ESend another probe with science instruments. You\u0027ll still need to send a kerbal for EVA report and surface samples ofcourse.\u003C/p\u003E\u003Cp\u003EJust send a kerbal. Don\u0027t forget to quicksave before landing offcourse.\u003C/p\u003E\u003Cp\u003ENow that you can land on Minmus, your science problems should end. There is a wealth of science to be gained from Minmus, with multiple biomes, each giving you a full batch of science (goo, material bay, surface sample, EVA report, crew report, and the advanced science parts once you get them).\u003C/p\u003E\u003Cp\u003EAnd now that you know the basics of landing, you can also try going to Mun. It\u0027s a little more difficult to land because of the higher gravity, but apart from that it\u0027s exactly the same (your minmus lander should be capable of going to and landing on Mun to. They cost rougly the same amount of fuel. Just make sure you have enough thrust to counter Mun\u0027s increased gravity)\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-05-25T18:20:10Z","Content":"\n\u003Cp\u003ENo screenshots? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut yes, I would also advise practicing a few more times before risking a (fictional) life. You can even practice with the crewed design if you add a probe core to it and take the pilot out before launch.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-05-25T19:45:30Z","Content":"\n\u003Cp\u003EAlso, it\u0027d be fun to build a probe ship that you can land on spot A, take off, land on spot B, take off and return. If you look up some of the biome maps, you can do separate experiments in each biome.\u003C/p\u003E\n"},{"CreatedByName":"joekidd1992","CreatedById":110769,"CreatedDateTime":"2014-05-25T20:03:42Z","Content":"\n\u003Cp\u003EI\u0027ve never done probes. I really don\u0027t know how to use them. Congrats on your landing!\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-05-25T20:37:43Z","Content":"\n\u003Cp\u003ESend a kerbal whenever you feel ready for the challenge. and remember f5 for quicksave and f9 for quick load are your friends.\u003C/p\u003E\u003Cp\u003ESemi-related advice on powered landing follows:\u003C/p\u003E\u003Cp\u003EWhen I was first starting to learn to play the game, I created a \u0022practice lander\u0022 probe that consisted of a Stayputnik core, the flatest 1.25m tank, an LV 909, and landing legs. and maybe some batteries. Annyway, I strapped the whole thing to the top of a solid booster and shot it up, then to the west of the KSC and practiced controlled landings.\u003C/p\u003E\u003Cp\u003EDid it over and over.\u003C/p\u003E\u003Cp\u003Eand over.\u003C/p\u003E\u003Cp\u003Eand over.\u003C/p\u003E\u003Cp\u003Eand then a few more times for good measure.\u003C/p\u003E\u003Cp\u003EIt gave me a good idea of what to expect during a powered landing. Then I tried landing on Minmus (per Scott Manley\u0027s recommendation), and that went smoothly, and the Mun was the next target. For that, I found that keeping my horizontal speed value close to my altitude value in km (e.g. 60 m/s at 60 km high). That method is super inefficient, but good to \u003Cem\u003Elearn\u003C/em\u003E on. With experience, you\u0027ll find what works best for you. Unfortunately, there\u0027s not shortcut for experience.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-05-25T21:14:44Z","Content":"\n\u003Cp\u003EWhat everyone else has been saying: Keep on practising until you\u0027re good at it. The good thing is that Minmus has plenty of biomes to extract that delicious science from.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t mind mods, SCANsat can help you in building satellites to map those biomes. It also allows you to obtain more science, as the scanning parts will build up a reservoir of science for you to collect/transmit as they reveal more of the planet.\u003C/p\u003E\n"},{"CreatedByName":"joekidd1992","CreatedById":110769,"CreatedDateTime":"2014-05-25T22:13:20Z","Content":"\n\u003Cp\u003EAlso, I\u0027ve decided to start planting flags, so I know where not to land again. If Possible.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-05-25T22:32:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022joekidd1992\u0022 data-cite=\u0022joekidd1992\u0022\u003E\u003Cdiv\u003EAlso, I\u0027ve decided to start planting flags, so I know where not to land again. If Possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso doubles as a way of relocating the biomes when you get new science instruments to use. Just name the flags after the biomes they\u0027re in!\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-25T23:49:04Z","Content":"\n\u003Cp\u003EIf your probe had a science instrument, try hitting a different biome with your second one.\u003C/p\u003E\u003Cp\u003EAs far as mods go, it\u0027s worth getting one that shows your surface/\u0022radar\u0022 altitude. VOID will do this in a head-up-display and is my pick, or Engineer Redux gives the info in the Surface window. MechJeb\u0027ll probably do it too. Whichever mod you use, it\u0027s so much easier than trying to judge things from shadows (which might not even show if you have graphics detail down).\u003C/p\u003E\n"},{"CreatedByName":"Scarredclown","CreatedById":110611,"CreatedDateTime":"2014-05-29T21:32:29Z","Content":"\n\u003Cp\u003EAfter landing one probe on Minmus, i was feeling a bit cockyn and my next mission was with a kerbal... all goes well, but i got it back with almost no fuel left ! I must build a better rocket. But how do you know witch biome you are in ???\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-05-29T21:43:30Z","Content":"\n\u003Cp\u003EIf you have a kerbal along then just do a crew report and it will tell you. If it is a probe then you will need some sort of science experiment you can run...\u003C/p\u003E\n"},{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2014-05-30T03:58:19Z","Content":"\n\u003Cp\u003EIf you want to collect science on minmus EVA reports and surface samples are the big payoff. If you land on one of the flats you can usually use the EVA pack to visit nearby biomes. Also, each of the flats are different biomes so visit a few and their surroundings. (try to land near the edge. Also, when you get back to the capsule with your surface samples transmit them and go back out and get another to return. The combined science points for doing both is more than you get for just a returned sample.\u003C/p\u003E\u003Cp\u003EYour first visit with just eva reports and surface samples should get you 800 to 1000 points and will allow you to unlock enough of the tech tree to send a larger mothership based mission. \u003C/p\u003E\u003Cp\u003EGive it a good fuel supply and lab module to reset experiment bays and team it with a lander with a couple of science jr and goo canisters. The lander goes to the surface and uses the sci jr and goo. Takes off and lands in a new location and uses sci jr and goo. Pilot EVA\u0027s and takes data from experiment bays disabling them.\u003C/p\u003E\u003Cp\u003ELander takes off and docks with mothership. Lander refuels and lab module resets landers experiment bays. Pilot EVA\u0027s and removes data from lander and puts it in mothership capsule. Lander goes back to surface and repeats over and over.\u003C/p\u003E\u003Cp\u003ELater.... a small data courier travels from kerbin to mothership in minmus orbit. Courier pilot retrieves data from mothership capsule and returns it to kerbin for big science gain. Plus all you get from transmitting data. Remember how you get more if you transmit and return.\u003C/p\u003E\u003Cp\u003EOnce you clean out minmus you move the entire operation to the Mun. At some point you probably want to add a refueler or kethane operation, but your mothership should have enough fuel for quite a few lander operations.\u003C/p\u003E\n"}]}