{"TopicId":73396,"ForumId":18,"TopicTitle":"2001: A Space Odyssey Sucks","CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2014-05-25T21:24:21Z","PageNum":4,"Articles":[{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-05-31T17:51:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EHowever, the movie is truly great, and you need to watch it seriously and almost meticulously.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs with any artform, you need to do some work. Just passive consumption will not get you far.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EKubrick\u0027s movies share his established style of wide angles, silence and details, which really require careful observation, but they\u0027re not perfect.\u003C/div\u003E\u003C/blockquote\u003EI feel that the first Alien movie borrows a lot in those respects, without copying too blatantly. It is quite a different movie, but the long, wide, slow shots have the same distinct feel and are obviously inspired by 2001.\u003Cp\u003EI think it is funny that Alien borrowed quite a bit from 2001, but at the same time introduced major swathes of new stuff, which in its turn made it the new scifi standard. It is also striking how much the sequel, Aliens, is another movie completely. Much more a modern movie in the action kind of way. It has its own merits though.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-05-31T17:59:42Z","Content":"\n\u003Cp\u003EWow, this thread is still going? \u003C/p\u003E\u003Cp\u003E2001 was fantastic to me, but the pace is too slow for some (like Icarus). I don\u0027t really mind methodical pacing, and still enjoyed it greatly. And yknow what - who cares? I say let people like and dislike what they want, as long as neither party complains to the other about liking or disliking something. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-31T18:01:44Z\u0022 title=\u002205/31/2014 06:01  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 31, 2014\u003C/time\u003E by NovaSilisko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-05-31T19:51:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EWow, this thread is still going? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the only way to ensure a thread with more replies than this, would be to post a thread with the title: \u0022Space sucks\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI feel that the first Alien movie borrows a lot in those respects, without copying too blatantly. It is quite a different movie, but the long, wide, slow shots have the same distinct feel and are obviously inspired by 2001.\u003Cp\u003EI think it is funny that Alien borrowed quite a bit from 2001, but at the same time introduced major swathes of new stuff, which in its turn made it the new scifi standard. It is also striking how much the sequel, Aliens, is another movie completely. Much more a modern movie in the action kind of way. It has its own merits though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne of the reasons I like Alien and Aliens, but can\u0027t stand Alien3 and Resurrection. Not just the plot elements, but the complete lack of disregard for the feel of the universe. The first two felt like \u0022real space\u0022 to me. It pushed the envelope of believability in places, but still felt like what I would expect being in space to feel like. Even hyper-sleep and terraforming are given some extra love so that they feel more like speculative technology instead of \u0027magic.\u0027\u003C/p\u003E\u003Cp\u003EThen after Aliens, everything turns into Syfy, and you have penal prison planets and a testbed for the Firefly series.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-31T19:59:11Z\u0022 title=\u002205/31/2014 07:59  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 31, 2014\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2014-05-31T19:58:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EWhen you watch older movies, you need to watch them in the context of their time. The perfect example is Metropolis. It\u0027s a masterpiece by the standards back then. It\u0027s a childlish pile of crap by today\u0027s art standards.\u003Cp\u003EI hate new flash and bang movies, with annoying characters and overexplaining things, with \u0022everything must look cool\u0022, with LOUDNESS and frantic camera movements to conceal crappy CGI, but I do think that \u00222001\u0022 does \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Epartially\u003C/span\u003E suck.\u003C/p\u003E\u003Cp\u003EKubrick was an awesome director, but not even he could escape the need for dazzling people. Some of the technologies and movie magic seen in that movie were completely new, so he used them \u003Cstrong\u003Efor the sake of using them\u003C/strong\u003E. It was a bad move.\u003C/p\u003E\u003Cp\u003EHowever, the movie is truly great, and you need to watch it seriously and almost meticulously. It\u0027s not something you watch with a bunch of friends over popcorn at your place.\u003C/p\u003E\u003Cp\u003EKubrick\u0027s movies share his established style of wide angles, silence and details, which really require careful observation, but they\u0027re not perfect.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI always watch movies three times to make sure I catch everything. When a movie is really good, I watch it a lot. But 2001 is so bad for me I could barely make it through the first watch. I simply and utterly stinks. \u003C/p\u003E\u003Cp\u003ENow, if they EVER remake this movie, then they should solely focus on the third act, because for a while there, I enjoyed it. I love HAL as a character, and his death scene sent chills up my spine.\u003C/p\u003E\u003Cp\u003EHey, there should be a KSP movie about Jeb trying to shut down a rampant MechJeb! MGM, Dreamworks, Disney, work on it and get back to me in a few years.\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2014-05-31T20:17:41Z","Content":"\n\u003Cp\u003EThere were two other books in the series.\u003C/p\u003E\u003Cp\u003EI want to see 2061 and 3001 before we think about remaking the first one tbh. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-05-31T20:46:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Icarus_Vice\u0022 data-cite=\u0022Icarus_Vice\u0022\u003E\u003Cdiv\u003EI always watch movies three times to make sure I catch everything. When a movie is really good, I watch it a lot. But 2001 is so bad for me I could barely make it through the first watch. I simply and utterly stinks. \u003Cp\u003ENow, if they EVER remake this movie, then they should solely focus on the third act, because for a while there, I enjoyed it. I love HAL as a character, and his death scene sent chills up my spine.\u003C/p\u003E\u003Cp\u003EHey, there should be a KSP movie about Jeb trying to shut down a rampant MechJeb! MGM, Dreamworks, Disney, work on it and get back to me in a few years.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, then it\u0027s about your taste. I don\u0027t think it\u0027s wrong. It\u0027s your taste.\u003C/p\u003E\u003Cp\u003EI think it would be a disaster to remake it. The director who\u0027d even speak about it would be utterly shunned by the academia. It\u0027s simply one of those movies you don\u0027t remake. Ever.\u003C/p\u003E\u003Cp\u003EI\u0027d like to see \u00222001\u0022 on big screen, but chances for that are slim. Maybe, if someone made a total digital restoration and enchanced the sound, it would be a big hit, but honestly, I have doubts about that. Hollywood has raised a pathetic global audience that readily gulps down crap it produces in copious amounts.\u003C/p\u003E\u003Cp\u003ENassault did something similar to what you\u0027re mentioning.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/GJvtKCgOnFg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-31T20:50:40Z","Content":"\n\u003Cp\u003E2001 without the first two acts would be all wrong. The idea that we\u0027re primitives in comparison to the monolith makers is one of the central themes.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-05-31T20:59:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E2001 without the first two acts would be all wrong. The idea that we\u0027re primitives in comparison to the monolith makers is one of the central themes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that is quite a dangerous thing to say. It is rare, but from time to time a visionary comes by that does everything all wrong, which ends up being more right than anything you could ever imagine. Even then, there will always be a couple naysayers that cling to the old, of course.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-31T21:33:37Z","Content":"\n\u003Cp\u003EIt\u0027s possible that a remake of 2001 consisting of just the third act could be good, but it wouldn\u0027t be 2001.\u003C/p\u003E\n"},{"CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2014-05-31T21:35:26Z","Content":"\n\u003Cp\u003EThe real question is; who would play all the major roles?\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-05-31T22:06:37Z","Content":"\n\u003Cp\u003EI\u0027m not fond of most remakes. To me, it demonstrates a lack of creativity; unless the original director (obviously living) were to do a remake in order to take advantage of better production technologies, or the remake were more true to its inspiration (i.e. novel, etc.).\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-05-31T22:44:01Z","Content":"\n\u003Cp\u003ERemake no, remaster on the other hand. I think that we have demonstrated that the film by general consensus is a very good one and a classic. It\u0027s just not your film, simple as that. To me it sounds like you are looking at the plot too superficially. But in any case it just isn\u0027t your type of film, not a bad film, just not your film.\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-05-31T22:58:06Z","Content":"\n\u003Cp\u003EHere is why I adore \u003Cem\u003E2001\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EIn my opinion, it is \u003Cstrong\u003EThe Most Technically Accurate Science-Fiction Film Ever Made, Given the Time that It Was Made In.\u003C/strong\u003E It forecasted all sorts of wild technological innovations, from TV screens in the seatbacks of airplanes... \u003Cem\u003Eto the iPad\u003C/em\u003E. I\u0027m serious. Look it up. The actual spacecraft have an amazing amount of technological sophistication and would likely actually work in real life (with a few changes), as opposed to every single other science-fiction movie ever made. I won\u0027t even go into the poor designs and lack of foresight in \u003Cem\u003E2010\u003C/em\u003E, but they serve as a view of what conventional science fiction was at the time. For someone who knows anything about space, \u003Cem\u003E2010\u003C/em\u003E is difficult to believe and unpleasant to watch.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E2001\u003C/em\u003E\u0027s plot is slow but very present. Instead of Kubric forcing the plot down your throat, you have to discover (HA) what\u0027s happening yourself. This may take a while and a couple of watchings, but there is a heck of a lot going on behind the scenes, enough to write a book about (and there actually have been books written about it). \u003C/p\u003E\u003Cp\u003EPretty much every bit of \u003Cem\u003E2001\u003C/em\u003E is now clichÃƒÂ©. The music is clichÃƒÂ©, the monoliths are clichÃƒÂ©, HAL is clichÃƒÂ©, and the warp through space is clichÃƒÂ©. But this is because the movie is so good! If the movie was really as poor as you\u0027re making it, it would have very quickly faded out of view. Ironically, today we see the film as a string of clichÃƒÂ©s \u003Cem\u003Eprecisely because Kubric was so avant-garde during his day that people remembered what he made.\u003C/em\u003E So you absolutely can\u0027t blame him for that.\u003C/p\u003E\u003Cp\u003EI won\u0027t say that \u003Cem\u003E2001\u003C/em\u003E is my favorite film of all time but it\u0027s certainly way up there. I won\u0027t criticize you for disliking it; different strokes for different folks, after all. But I really admire the movie and urge people to watch it if they haven\u0027t already. Don\u0027t let this thread keep you from watching \u003Cem\u003E2001.\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2014-05-31T23:51:01Z","Content":"\n\u003Cp\u003EPersonally, I didn\u0027t like it because of how slow it was and how long the \u0022flashing lights\u0022 scenes lasted. I had read the book beforehand, so I knew the plot, but there were scenes that dragged on \u003Cem\u003Eway\u003C/em\u003E longer than they should have.\u003C/p\u003E\n"},{"CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2014-06-01T00:38:40Z","Content":"\n\u003Cp\u003EHonestly, I never noticed how cliche it was. But remember, quality is like time,\u003Cem\u003E it\u0027s relative. \u003C/em\u003EI hate it, you like it, but there is no clear definition of good or bad.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-06-01T03:03:12Z","Content":"\n\u003Cp\u003EThere are lots of movies out there. Many are hardly worth the time to watch. Others are well done and entertaining or informative. Some are original and cause reflection during that evening. But rarely one comes along which is nothing less than profound. Such a movie inspires thought which continues throughout one\u0027s life. To me, \u00222001\u0022 is such a movie.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-06-01T04:32:07Z","Content":"\n\u003Cp\u003EWhether one likes the movie or not, it sure inspires discussion. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think its on this Tuesday evening on TCM, in the US.\u003C/p\u003E\n"},{"CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2014-06-01T05:09:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dispatcher\u0022 data-cite=\u0022Dispatcher\u0022\u003E\u003Cdiv\u003EThere are lots of movies out there. Many are hardly worth the time to watch. Others are well done and entertaining or informative. Some are original and cause reflection during that evening. But rarely one comes along which is nothing less than profound. Such a movie inspires thought which continues throughout one\u0027s life. To me, \u00222001\u0022 is such a movie.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s just a problem when that thought is \u0022this movie sucks....\u0022\u003C/p\u003E\n"},{"CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2014-06-01T05:10:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GeneCash\u0022 data-cite=\u0022GeneCash\u0022\u003E\u003Cdiv\u003EBingo. That\u0027s the problem right there in a nutshell. I\u0027m sitting in a movie theatre. I don\u0027t have those notes, and I may not even have read the book. It\u0027s Kubrick\u0027s job to explain things to me or at least make the movie comprehensible. I shouldn\u0027t have to go find script notes to be able to say \u0022ah ok, now I see what\u0027s going on.\u0022\u003Cp\u003EHe failed.\u003C/p\u003E\u003Cp\u003ENow that I have read the books and the script notes, and I\u0027m a compleat space nut I can say there were some nice realistic elements and SFX that literally defined the state of the art at the time. As far as I\u0027m concerned, it\u0027s got the only realistic depiction of an AI I\u0027ve ever seen. And I love those bits. I still say \u0022it\u0027s full of stars\u0022 a lot.\u003C/p\u003E\u003Cp\u003EBut it\u0027s still not a good movie.\u003C/p\u003E\u003Cp\u003EI read the book and I go \u0022wow, damn, that\u0027s awesome\u0022 but I watch the movie and I (or people I\u0027ve shown it to) go \u0022er, wait, whut? hold on, explain things to me, what\u0027s going on here?\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. This is my entire experience with 2001. I\u0027m not even half an hour in and I\u0027m like, whut?\u003C/p\u003E\n"},{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-06-01T13:05:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GeneCash\u0022 data-cite=\u0022GeneCash\u0022\u003E\u003Cdiv\u003EBingo. That\u0027s the problem right there in a nutshell. I\u0027m sitting in a movie theatre. I don\u0027t have those notes, and I may not even have read the book. It\u0027s Kubrick\u0027s job to explain things to me or at least make the movie comprehensible. I shouldn\u0027t have to go find script notes to be able to say \u0022ah ok, now I see what\u0027s going on.\u0022 \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs a kind of an intellectual boomerang I\u0027m gonna ask why do you feel that movies need to be made exclusively comprehensible on first or second time watching? You don\u0027t expect this from a painting, a poem, a song or a sculpture nor always from a book. You\u0027re expected to stare at Mona Lisa\u0027s smile after centuries and still ponder what it\u0027s really about or you can read a poem over and over and over, find new thoughts rising and new feelings. And not to mention authors like Sartre who can easily pour a lifetime of thoughts in a book. If a movie is not easily understood, why exactly is it not a good movie?\u003C/p\u003E\u003Cp\u003EI can agree that it\u0027s longwinded and difficult at times to watch and obviously the art of storytelling an conveying ideas through film has developed a lot in the last 40\u002B years. I can totally understand if someone doesn\u0027t like it. I don\u0027t like opera. It\u0027s incomprehensible, loud and boring with cliche stories. \u003C/p\u003E\u003Cp\u003EHowever saying that Kubrick failed or that there\u0027s no plot is something that I think is a bit of an oversimplification. Just as I can\u0027t really say Pavarotti is a bad singer because I haven\u0027t got a clue what he\u0027s yodling about now. 2001 is not a movie made for quick entertainment, it\u0027s more philosophy and art and exactly as was inteded by the director. If Kubrick had failed, there would be no 10 page discussion. You couldn\u0027t get two pages from Transformers unless you start posting pictures of Megan Fox. \u003C/p\u003E\u003Cp\u003EIf you want to see a REALLY long winded and boring movie, go watch Stalker or any other Tarkovski movie.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-01T13:26:19Z","Content":"\n\u003Cp\u003E^^^this, why is it that films are always expected to be clear, concise and entertaining. What is wrong with a film that at the end of it you can that was well made, I didn\u0027t really enjoy it as much as other films but it was very well made.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-06-01T14:40:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Icarus_Vice\u0022 data-cite=\u0022Icarus_Vice\u0022\u003E\u003Cdiv\u003EIt\u0027s just a problem when that thought is \u0022this movie sucks....\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EObviously your OP was intended to invite \u0022discussion\u0022, and your position on the movie is clear, as is the view of everyone who has posted in reply. So we each go away with the same opinion of the movie as we started with. That\u0027s fine; we also understand each other\u0027s opinions on the movie a little better. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2014-06-01T19:06:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Creature\u0022 data-cite=\u0022Creature\u0022\u003E\u003Cdiv\u003EAs a kind of an intellectual boomerang I\u0027m gonna ask why do you feel that movies need to be made exclusively comprehensible on first or second time watching? You don\u0027t expect this from a painting, a poem, a song or a sculpture nor always from a book. You\u0027re expected to stare at Mona Lisa\u0027s smile after centuries and still ponder what it\u0027s really about or you can read a poem over and over and over, find new thoughts rising and new feelings. And not to mention authors like Sartre who can easily pour a lifetime of thoughts in a book. If a movie is not easily understood, why exactly is it not a good movie?\u003Cp\u003EI can agree that it\u0027s longwinded and difficult at times to watch and obviously the art of storytelling an conveying ideas through film has developed a lot in the last 40\u002B years. I can totally understand if someone doesn\u0027t like it. I don\u0027t like opera. It\u0027s incomprehensible, loud and boring with cliche stories. \u003C/p\u003E\u003Cp\u003EHowever saying that Kubrick failed or that there\u0027s no plot is something that I think is a bit of an oversimplification. Just as I can\u0027t really say Pavarotti is a bad singer because I haven\u0027t got a clue what he\u0027s yodling about now. 2001 is not a movie made for quick entertainment, it\u0027s more philosophy and art and exactly as was inteded by the director. If Kubrick had failed, there would be no 10 page discussion. You couldn\u0027t get two pages from Transformers unless you start posting pictures of Megan Fox. \u003C/p\u003E\u003Cp\u003EIf you want to see a REALLY long winded and boring movie, go watch Stalker or any other Tarkovski movie.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe reason that a movie needs to be comprehensible on a first viewing is simple; you have no idea whether the audience will like your film, or if they\u0027ll want to rewatch it, so the message must be put forwards the first time watching.\u003C/p\u003E\u003Cp\u003ENow, with 2001, not only do you need to watch the film multiple times, but you also need to read the book and the script notes to get the point of it all. If I don\u0027t even like the movie, what makes Kubrick think I\u0027ll want to read the book? \u003C/p\u003E\u003Cp\u003EAgain, had the third act been the main premise of the film, with it\u0027s chilling depiction of an AI, some excellent (if not slightly wooden) characters, and a sense of both paranoia and isolation, this film would\u0027ve been so much better. \u003C/p\u003E\u003Cp\u003EAs for the cliches, this is the only place I can defend Kubrick. When this movie was released, none of the cliches in the movie were actually cliches.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-06-01T19:35:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Icarus_Vice\u0022 data-cite=\u0022Icarus_Vice\u0022\u003E\u003Cdiv\u003EThe reason that a movie needs to be comprehensible on a first viewing is simple; you have no idea whether the audience will like your film, or if they\u0027ll want to rewatch it, so the message must be put forwards the first time watching.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDifferent films handle ambiguity quite well to a certain degree. Perhaps nowhere near as high of a degree as 2001, but the withholding of information can give a film great longevity.\u003C/p\u003E\u003Cp\u003EAn example more contemporary: Star Wars. Original Trilogy, I mean. There\u0027s a saga that didn\u0027t need to go out of its way to explain every little nuance. It left so much to our imaginations, that fans were able to keep the fire going for decade and a half. Nobody knew how the war got started, but we could use what information we had to make an educated guess. People bickered about whether or not the Alliance was even the definitive \u0027good guy\u0027 in the whole ordeal. What exactly was \u0022The Force?\u0022 Was it an intelligent entity like some kind of \u0027heartbeat of the universe?\u0027 A collective unconscious? Did it have \u0022a plan?\u0022 How did Vader get hurt? How did Luke and Leia get hidden from him? People were gathering as much data as they could about the capabilities of Star Destroyers and the Death Star, trying to guess at what kind of resources and power would be required. Even how powerful a \u0022death ray\u0022 would need to be in order to nuke a planet.\u003C/p\u003E\u003Cp\u003EThere\u0027s what you get when you leave things to the imagination. Or you could then surrender your intellectual property to the \u0022insta-gratification\u0022 movement of modern society and, \u0022Oh, by the way, it\u0027s because of Midichlorians.\u0022\u003C/p\u003E\u003Cp\u003E2001 doesn\u0027t spell everything out for you because you\u0027re expected to analyze it yourself. Instead of just having you sit back and watch explorers do their science, Kubrick is inviting you to BE an explorer. Observe, hypothesize, and have fun doing it. You\u0027re even granted ample time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-01T20:03:16Z\u0022 title=\u002206/01/2014 08:03  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 1, 2014\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CyclonicTuna","CreatedById":21888,"CreatedDateTime":"2014-06-01T20:03:53Z","Content":"\n\u003Cp\u003EEveryone has their opinions, I don\u0027t see how yours needs a thread of its own.\u003C/p\u003E\n"}]}