{"TopicId":73423,"ForumId":55,"TopicTitle":"Career Mode Science refinement (and budget)","CreatedByName":"reilithion","CreatedById":111788,"CreatedDateTime":"2014-05-26T04:36:46Z","PageNum":1,"Articles":[{"CreatedByName":"reilithion","CreatedById":111788,"CreatedDateTime":"2014-05-26T04:36:46Z","Content":"\n\u003Cp\u003EI\u0027ve read a few of the suggestions for changing advancement through career mode, and I have my own idea(s) to put forth. Mine are also motivated by the observation that unlocking new rocket parts does not seem like a natural consequence of taking a soil sample on Minmus [MC_STEEL\u0027s post, \u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66247-Science-is-not-suposed-to-be-grindy%21\u0022 rel=\u0022external nofollow\u0022\u003E[Discussion] Science is not supposed to be grindy!\u003C/a\u003E\u0022].\u003C/p\u003E\u003Cp\u003EIt seems rather more likely that achieving a landing on the Mun would result in a larger budget. I suggest that the current \u0022Science Points\u0022 determine the maximum budget you had for any particular rocket. Make as many rockets as you want, but any given one cannot exceed the per-rocket budget set by your current level of achievement.\u003C/p\u003E\u003Cp\u003ERocket parts, on the other hand, ought to become available as your engineers learn more about rocketry! Successfully recovered flights (and perhaps even catastrophic failures!) should earn you research toward unlocking parts \u003Cem\u003Erelated to the parts used on the flight\u003C/em\u003E. So if I wanted to unlock the Z-200 Rechargeable Battery Bank, I\u0027d need to fly a few times with a Z-100 Rechargeable Battery Pack strapped to my rocket.\u003C/p\u003E\u003Cp\u003EI invite discussion on the specifics of this system. For example, if the current tech tree remains the same, should you have to use every part in a particular technology in order to unlock a technology that depends on it? A case can be made to go either way. But I think this idea is a simple enough refinement that it could be implemented easily, and I suspect it would make career mode both more fun and a little more realistic.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-05-26T09:52:29Z","Content":"\n\u003Cp\u003EIf you don\u0027t want grinding, than you will have to rethink your suggestion a little.\u003C/p\u003E\u003Cp\u003EMaking it so that I can only unlock the next level of battery if I use the current battery an X number of times IS grinding. It\u0027s the very definition of grinding.\u003C/p\u003E\u003Cp\u003E\u0022I want to unlock the mainsail. Gues I have to launch 10 more rockets with Skippers in them\u0022\u003C/p\u003E\u003Cp\u003ESo that doesn\u0027t work.\u003C/p\u003E\u003Cp\u003EThe current system of getting science points would work a lot better in that regard.\u003C/p\u003E\u003Cp\u003EWhat it currently is: You bring home data points from science, and in return of those data points, you get budget which you can use to research new tech (the science points are the representation of that budget).\u003C/p\u003E\u003Cp\u003EThe budget we get in .24 is offcourse a different kind of budget, but I believe that science points and money budget are going to be interchangable.\u003C/p\u003E\n"},{"CreatedByName":"reilithion","CreatedById":111788,"CreatedDateTime":"2014-05-27T06:37:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EIf you don\u0027t want grinding, than you will have to rethink your suggestion a little.\u003Cp\u003EMaking it so that I can only unlock the next level of battery if I use the current battery an X number of times IS grinding. It\u0027s the very definition of grinding.\u003C/p\u003E\u003Cp\u003E\u0022I want to unlock the mainsail. Gues I have to launch 10 more rockets with Skippers in them\u0022\u003C/p\u003E\u003Cp\u003ESo that doesn\u0027t work.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d like to refute the idea that my suggestion would necessarily devolve into grinding. What if the research value of a flight depended upon the distance you went with it (or flight time), and some measure of the success of the flight? Early technologies could be unlocked with single, relatively small launches, and later technologies would require more research value.\u003C/p\u003E\u003Cp\u003EIt could easily be arranged so that, as you naturally ventured further outward for more science points, you would also be accruing more rocket research because your flights would be going longer and farther. You wouldn\u0027t be launching 10 rockets to unlock your mainsail unless that was specifically your goal. You\u0027d launch a small rocket to unlock some science points and some simple rocket parts. Then you\u0027d use those better rocket parts and larger budget to launch a better rocket, which would get you more science points and more advanced rocket parts. That doesn\u0027t sound grindy at all.\u003C/p\u003E\u003Cp\u003E\u0022So then, wait. How would it differ from the current system?\u0022 one might well ask. In two important ways: First, the particular new parts you unlocked would depend on which ones you\u0027ve actually been using. This adds realism because it reflects the nature of research -- we don\u0027t learn much about a technology unless we\u0027re actually using it! I\u0027d also argue that it\u0027d add fun because if you had a goal technology you wanted to unlock, you\u0027d have to be creative when building a rocket, because it might require you to use some parts you wouldn\u0027t have used otherwise.\u003C/p\u003E\u003Cp\u003ESecond, you could make advancements separately. This is a greater creative freedom than the game currently has. If you want to play it as a rocket research company, you can! Grab a few early science points and then focus solely on test flights for unlocking rocket parts. Want to focus on scientific inquiry? Unlock the rocket parts you really need and go to all the planets! Build big and simple and ignore the technologies you deem unnecessary. Feeling completionist? Make every new launch an opportunity to get both science and rocket research. Spend a little more fuel to put something experimental in orbit, or bring an experimental engine along on your mission to Duna!\u003C/p\u003E\u003Cp\u003EI wasn\u0027t trying to make suggestions specifically to reduce the grindiness of Science. Rather, I thought of something I believe would make the game both more fun and more realistic. Done right (with some good balance), I think it could add depth and creative freedom to the game. And if the grindiness doesn\u0027t get significantly worse, so much the better.\u003C/p\u003E\n"}]}