{"TopicId":73495,"ForumId":16,"TopicTitle":"Maneuver Node DeltaV not going down","CreatedByName":"Chronin","CreatedById":108953,"CreatedDateTime":"2014-05-26T21:32:51Z","PageNum":1,"Articles":[{"CreatedByName":"Chronin","CreatedById":108953,"CreatedDateTime":"2014-05-26T21:32:51Z","Content":"\n\u003Cp\u003ESo I\u0027m currently in Orbit around Eve, and I had a maneuver node to get me into a Kerbin encounter. The maneuver said it was going to be a 3m 34s burn, so I began burning at 1m 47s. The first strange thing that happened was that my DeltaV for the burn wasn\u0027t going down, but it was slowly increasing. I was facing right at the node, and I\u0027ve tried it at many different times (T- 2m, T- 0s, T- 1m, etc etc). The other thing that happened was that although I was burning pro-grade, my periapsis was going down quite rapidly. I increased my orbit with Hyper-Edit, but the effects were the same. I would hate to be stuck in Eve\u0027s orbit after all the work I did there. Anyone know why this might be? If you want, I can post a video showing it, though don\u0027t expect more that 5fps.\u003C/p\u003E\u003Cp\u003E-Chronin\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-26T21:47:23Z","Content":"\n\u003Cp\u003EAre you controlling the vessel from the correct part?\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-26T21:49:44Z","Content":"\n\u003Cp\u003EProbably \u0022Control from here\u0022 set to a point that isn\u0027t facing in the same direction as the engines are thrusting, for example a docking port on the side of a ship. You can right-click any manned or unmanned command module, or docking port or claw, and choose \u0022control from here\u0022 to set the navball orientation to that part. (SAS will also use that part as its reference, which matters for wobbly rockets.)\u003C/p\u003E\n"},{"CreatedByName":"Chronin","CreatedById":108953,"CreatedDateTime":"2014-05-26T21:54:15Z","Content":"\n\u003Cp\u003EThanks for making me feel stupid. Seriously though, thanks. I forgot to set the control back to the main capsule after docking with my gilly ship. Again,thanks, I was really frustrated about this.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-05-26T22:05:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chronin\u0022 data-cite=\u0022Chronin\u0022\u003E\u003Cdiv\u003EThanks for making me feel stupid. Seriously though, thanks. I forgot to set the control back to the main capsule after docking with my gilly ship. Again,thanks, I was really frustrated about this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ve all been there. Consider yourself lucky. I flew an entire mission with a probe core (the only controllable part) on upside down. Real pain, that.\u003C/p\u003E\n"}]}