{"TopicId":73491,"ForumId":55,"TopicTitle":"Can too slow of development kill KSP?","CreatedByName":"MajorSpittle","CreatedById":95381,"CreatedDateTime":"2014-05-26T20:58:54Z","PageNum":1,"Articles":[{"CreatedByName":"MajorSpittle","CreatedById":95381,"CreatedDateTime":"2014-05-26T20:58:54Z","Content":"\n\u003Cp\u003EI love this game but I never play it because there is no Multiplayer (I\u0027m a social person) and the lack of a \u0022story line\u0022 or \u0022purpose\u0022.\u003C/p\u003E\u003Cp\u003EI see the developer blogs and a cheer on the developers (last update was GREAT) but I find it disconcerting the number of people working on the game. Nobody is making any Mining or Colonization parts. Nobody is working on alternate Space centers or Kerbal races. Nobody is working on Kerbal A.I. or Cities and such to dress up the game and lay the foundation for a more immersive environment.\u003C/p\u003E\u003Cp\u003EPlease don\u0027t take this as me taking shots at the developers because I don\u0027t mean it that way. I just see so much potential in the game and so much desire from the community to have the game expanded and developed faster.\u003C/p\u003E\u003Cp\u003EI hope it is not money holding up the game. I have bought a copy for me and my brother. I would have NO Problem spending that much again for a Mining addon, or a \u0022Colonization Part Pack\u0022, or a \u0022Return of the Jebi\u0022 StarWars pack......\u003C/p\u003E\u003Cp\u003EI don\u0027t know much about developing a game, but how can people develop \u0022Kerthane\u0022 mods, \u0022Dangerous Re-entry\u0022, \u0022Planet Packs\u0022, and \u0022Sound Packs\u0022 just in their spare time so quickly and the developers not be able to develop for sale mod packs as quickly to help propel production of the game.\u003C/p\u003E\u003Cp\u003EI would love to hear from the developer as to where they picture this game being in 10 months? What it will look like and what the development path is? Will I be able to buy add-ons (yes I want to give you money) and will I be able to play online with family and friends?\u003C/p\u003E\u003Cp\u003EI am very much looking forward to currency, just as I was looking forward to the asteriods and larger rocket parts. But I played maybe 3 hours after the last update because I had nobody to play the game with. I wish nothing but the greatest success for the developers and hope the community doesn\u0027t end up dying off from boredom. I know that sounds real bad to say, but I find myself checking on the game\u0027s progress less and less.\u003C/p\u003E\n"},{"CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2014-05-26T21:08:55Z","Content":"\n\u003Cp\u003EThey are using Unity. Ksp is held together by the force of ducktape. The more they add to the game, the more laggier and prone to crashes it will become.\u003C/p\u003E\u003Cp\u003EUnity is a great and \u0027simple\u0027 engine to use, but it is just not enough power to realise the dreams of the devs.\u003C/p\u003E\n"},{"CreatedByName":"MajorSpittle","CreatedById":95381,"CreatedDateTime":"2014-05-26T21:12:19Z","Content":"\n\u003Cp\u003ESo the game will never be much more then it is now? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Time to release this puppy then and start work on KSP II with a real engine.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-05-26T21:14:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MajorSpittle\u0022 data-cite=\u0022MajorSpittle\u0022\u003E\u003Cdiv\u003EI don\u0027t know much about developing a game, but how can people develop \u0022Kerthane\u0022 mods, \u0022Dangerous Re-entry\u0022, \u0022Planet Packs\u0022, and \u0022Sound Packs\u0022 just in their spare time so quickly and the developers not be able to develop for sale mod packs as quickly to help propel production of the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, for one, modders don\u0027t generally have a team of QA people they answer to and can put out a fairly incomplete product and refine it as needed. I\u0027ll guaranty you that Kethane took a lot longer than a few months to get to the state it is in now. Deadly Reentry is the product of several people\u0027s work as well, over quite some time. You should take a good long look at modder development time, not to put out an initial product, but to put out a polished, relatively bug free and balanced piece of game, to get a solid grasp of how much time it takes the KSP devs to get something out there. Maybe then you\u0027ll understand why their small team of devs is actually working pretty hard.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-05-26T21:16:35Z","Content":"\n\u003Cp\u003EThis discussion of the game\u0027s development has been moved to the development discussion sub-forum. \u003C/p\u003E\u003Cp\u003ESquad is a small group making their first game. I don\u0027t think development is particularly slow, in proportion to the number of people working on it. But I must, once again, take issue with thecomparison to the work of mod-makers, which comes up again and again. This complaint fails to take into consideration that mod-makers are making creating alterations or additions to \u003Cstrong\u003Ealready working code\u003C/strong\u003E. And who created, maintains, and updates the code that runs the game? Squad does. Of course it\u0027s going to be faster and easier to modify or add to a functioning system than it was to create the functioning system in the first place, so there\u0027s realy no basis for comparing the two. \u003C/p\u003E\u003Cp\u003ETo know more about where the game\u0027s development is going, follow the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/70-The-Daily-Kerbal\u0022 rel=\u0022external nofollow\u0022\u003EDevnotes section of the forum\u003C/a\u003E, and read over the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Planned_features\u0022 rel=\u0022external nofollow\u0022\u003Eplanned features list\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2014-05-26T21:16:46Z","Content":"\n\u003Cp\u003EThe game will be more than it is today.\u003C/p\u003E\u003Cp\u003EBut since the limitations of unity is now felt by the devs. Development will be slower due to having to fix bugs, reprogram and streamlining the codes in the hopes of getting a little more extra out of unity.\u003C/p\u003E\u003Cp\u003EAnd the more they add, the slower the development will become\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2014-05-26T21:24:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dedjal\u0022 data-cite=\u0022Dedjal\u0022\u003E\u003Cdiv\u003EUnity is a great and \u0027simple\u0027 engine to use, but it is just not enough power to realise the dreams of the devs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s putting it too strongly. There is a great deal that can be done with Unity There are some things Unity prevents, but it is progressing and the limitations are being pushed back with every year.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MajorSpittle\u0022 data-cite=\u0022MajorSpittle\u0022\u003E\u003Cdiv\u003ESo the game will never be much more then it is now? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Time to release this puppy then and start work on KSP II with a real engine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo way Squad will do that! The moment they announce suspension of KSP 1, sales will fall through the basement. With significantly reduced cash flow they would be very hard-pressed to create a new game, with new code, from an engine they haven\u0027t worked with before. No, what will happen is that Squad will complete KSP 1, release it, debug it, and maybe start adding extra content. Then, and only then, they might consider KSP 2 with a new engine. Or maybe not - that is entirely up to them.\u003C/p\u003E\u003Cp\u003EI know this thread started in the General Discussion forum so you won\u0027t have read the Suggestions forum stickies, but it\u0027s worth pointing out that Resources, mining and colonisation are all areas that are listed as \u0022Do not suggest\u0022. This isn\u0027t because they Won\u0027t Happen (they may) but because they are suggested so often that there is very little point in discussing them yet again.\u003C/p\u003E\u003Cp\u003EFor what it is worth, Squad implemented Resources - and found that the implementation was \u0022not fun to play\u0022, and decided to get on with other things and think about it again.\u003C/p\u003E\n"},{"CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2014-05-26T21:36:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E \u003Cp\u003EFor what it is worth, Squad implemented Resources - and found that the implementation was \u0022not fun to play\u0022, and decided to get on with other things and think about it again.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd then they implemented science because that, apperently, was fun!\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-05-26T22:13:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dedjal\u0022 data-cite=\u0022Dedjal\u0022\u003E\u003Cdiv\u003EThe game will be more than it is today.\u003Cp\u003EBut since the limitations of unity is now felt by the devs. Development will be slower due to having to fix bugs, reprogram and streamlining the codes in the hopes of getting a little more extra out of unity.\u003C/p\u003E\u003Cp\u003EAnd the more they add, the slower the development will become\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBullcrap. KSP has made great strides in stability and performance, while still adding new stuff like larger parts and asteroids. It was a few months ago, but the devs said they still hadn\u0027t had to rewrite anything Unity-wise to completely fit their needs. Maybe that\u0027s changed in the meantime, but at least at that time Unity out of the box was still allowing them to do what they wanted. That means the engine works great for them.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-05-26T23:41:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dedjal\u0022 data-cite=\u0022Dedjal\u0022\u003E\u003Cdiv\u003EAnd then they implemented science because that, apperently, was fun!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, they implented science because it is the core of the career mode.\u003C/p\u003E\u003Cp\u003EAs for the speed off updates, you have to remember that even big studio titles take several years to finish. KSP really isn\u0027t going all that slow. It just feels that way because we are there for the entire ride, rather than just the time between announcement and release that normal titles go through (a few months, during which you don\u0027t think about it that much)\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-05-27T00:23:53Z","Content":"\n\u003Cp\u003ESlow development of a game won\u0027t kill it, but it\u0027s certainly not healthy for the development either. \u003C/p\u003E\u003Cp\u003EHowever, slow game development \u002B trying to capitalize on early release \u002B poor communication between the devs and fan base is really \u003Cem\u003Ereally\u003C/em\u003E bad for the game. I think a game could do alright with two of those three, but KSP is, IMO, dealing with all 3.\u003C/p\u003E\u003Cp\u003EThe game development is going slow, probably for several reasons. Based on information on the forums, SQUAD\u0027s site and interviews, I think the following facts are relevant:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESquad isn\u0027t primarly a game studio\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe team working on KSP seems to be relatively small\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKSP got the greenlight to keep HarvesteR from quitting SQUAD several years ago\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe game is, admittedly, complex\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EA note on why Harv was going to quit, apparently SQUAD was kept taking on more projects, but wasn\u0027t hiring people to keep up with the increased work. (The source article is here: \u003Ca href=\u0022http://www.polygon.com/features/2014/1/27/5338438/kerbal-space-program\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.polygon.com/features/2014/1/27/5338438/kerbal-space-program\u003C/a\u003E). So it\u0027s well within the realm of possibility that the developers aren\u0027t getting the support they need to keep up an optimal development pace\u003C/p\u003E\u003Cp\u003EI don\u0027t think the devs have good communication with the fan base. I\u0027ve pointed out the problems I\u0027ve seen in my previous posts. A summary would be:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDevs rarely deign to make official announcements about the state of the game (HarvesteR\u0027s recent 0.24 update is noteworthy \u003Cem\u003Ebecause\u003C/em\u003E it happens so rarely)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe devs (or the mods via the devs) primarily seem to address issues only as a last resort.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIMO, the devs do a poor job of addressing issues when they rarely DO come around to it. (See the resources issue, where HarV\u0027s statement was repeating the KerbalKon statement nearly verbatim, instead of actually explaining anything).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMost announcement really seem to have a lot of \u0022spin\u0022 to try to put KSP and SQUAD in the best possible light, instead of being direct.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThere\u0027s a lot of very vague communication\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThere is no officially released definition of \u0022scope complete\u0022. One that would be labeled \u0022subject to change\u0022 would be more than we have now (the \u0022Planned features\u0022 listed above is completely unofficial and cobbled from many sources, some probably obsolete)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFinally, early release. I don\u0027t have a problem with it. I think it\u0027s a great idea, because small developers can get the funds for development when they need them! But you have to make the release work for the good of the game. Extremely infrequent dev communication that is vague when it happens is \u003Cem\u003Enot\u003C/em\u003E good for the game. \u003C/p\u003E\u003Cp\u003EIf the developer is clear about the game\u0027s features and constantly keeping the community updated with the game\u0027s current and planned future status, there\u0027s no reason for anyone to speculate about the state of the game, and players can make informed decisions.\u003C/p\u003E\u003Cp\u003EIf the developer is unclear about the game\u0027s features and does a poor job he community informed about the game\u0027s current and future status, speculation starts and as Harvester pointed out last week, speculation is not good.\u003C/p\u003E\u003Cp\u003ESo, I\u0027m glad KSP had an early release because I like the game, but early releases are a two-edged sword. I think KSP is getting cut on the back-end because SQUAD didn\u0027t realize what they were getting into. I think KSP at release is going to be a good game, but I think it could get to release with much less choppy waters if SQUAD had been more open with the fan base.\u003C/p\u003E\u003Cp\u003EAgain, it\u0027s my opinion and an explanation of where it came from.\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2014-05-27T01:03:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MajorSpittle\u0022 data-cite=\u0022MajorSpittle\u0022\u003E\u003Cdiv\u003ESo the game will never be much more then it is now? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Time to release this puppy then and start work on KSP II with a real engine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*Engage deafening applause*\u003C/p\u003E\u003Cp\u003EI don\u0027t fire up KSP much anymore for the same reason. The game is capable, and quite frankly, deserving of so much more.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-27T02:20:01Z","Content":"\n\u003Cp\u003EYeah. Right. Squad will write a new engine for \u0022KSP 2\u0022. And pigs fly and fairies are real and I\u0027m actually a two-thousand-ton bagel with little hands to type with on a keyboard.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-05-27T03:03:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EThis complaint fails to take into consideration that mod-makers are making creating alterations or additions to \u003Cstrong\u003Ealready working code\u003C/strong\u003E. And who created, maintains, and updates the code that runs the game? Squad does. Of course it\u0027s going to be faster and easier to modify or add to a functioning system than it was to create the functioning system in the first place, so there\u0027s realy no basis for comparing the two. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe other thing people don\u0027t take into account is that a feature in the stock game requires that it works with every other feature in the stock game. This is as opposed to mods, which don\u0027t have to work with other mods because the mod\u0027s author can just say \u0022well if you don\u0027t feel like running my mod then don\u0027t. If you like the other mod better then use it instead.\u0022 That sort of approach doesn\u0027t work in the stock game. Also, mod writers don\u0027t have to find a good balance that makes everyone happy. If a mod changes the gameplay in such a way that only a minority of the players will like it, that\u0027s fine in a mod. It\u0027s not fine in the stock game to do that.\u003C/p\u003E\u003Cp\u003EMy only worry is that they might have reached market saturation already during early release. By the time they are ready to sell the final product at full price instead of the early access discount, there might not be anyone left who\u0027d be interested in buying it who hasn\u0027t bought it already.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-27T03:06:31Z\u0022 title=\u002205/27/2014 03:06  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 27, 2014\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-05-27T03:10:48Z","Content":"\n\u003Cp\u003ESo much facepalm.\u003C/p\u003E\u003Cp\u003EI will never comprehend how people can have so little understanding of how game development on this scale works. It\u0027s not even worth trying to refute points.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-05-27T04:59:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xaiier\u0022 data-cite=\u0022Xaiier\u0022\u003E\u003Cdiv\u003ESo much facepalm.\u003Cp\u003EI will never comprehend how people can have so little understanding of how game development on this scale works. It\u0027s not even worth trying to refute points.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, someone who knows better than anyone else here could enlighten us...\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-05-27T05:03:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xaiier\u0022 data-cite=\u0022Xaiier\u0022\u003E\u003Cdiv\u003ESo much facepalm.\u003Cp\u003EI will never comprehend how people can have so little understanding of how game development on this scale works. It\u0027s not even worth trying to refute points.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m going to second LethalDose\u0027s sentiment above. You wouldn\u0027t mind giving us the benefit of the doubt and presenting your side of the argument as well, would you?\u003C/p\u003E\n"},{"CreatedByName":"nobbers12345","CreatedById":104741,"CreatedDateTime":"2014-05-27T05:30:26Z","Content":"\n\u003Cp\u003EI kind of agree, perhaps not kill it, but definitely won\u0027t help the game when it finally releases.\u003C/p\u003E\u003Cp\u003EWith the implementation of steam sales, I think the amount of players will begin to plateau because anyone who will ever want it has already bought it.\u003C/p\u003E\u003Cp\u003EHowever, the donations people will likely give could possible support the game as it drags along.\u003C/p\u003E\n"},{"CreatedByName":"Nobody","CreatedById":64303,"CreatedDateTime":"2014-05-27T05:44:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MajorSpittle\u0022 data-cite=\u0022MajorSpittle\u0022\u003E\u003Cdiv\u003EI love this game but I never play it because there is no Multiplayer (I\u0027m a social person) and the lack of a \u0022story line\u0022 or \u0022purpose\u0022.\u003Cp\u003EI see the developer blogs and a cheer on the developers (last update was GREAT) but I find it disconcerting the number of people working on the game. Nobody is making any Mining or Colonization parts. Nobody is working on alternate Space centers or Kerbal races. Nobody is working on Kerbal A.I. or Cities and such to dress up the game and lay the foundation for a more immersive environment.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI think you found the reason why those things are taking so long. They assigned them to someone with almost no programing experience and then forgot to tell me about it.\u003Cp\u003EYes development going to slow can hurt the game but so can going to fast. A rushed job will be buggy and unstable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-27T05:47:14Z\u0022 title=\u002205/27/2014 05:47  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 27, 2014\u003C/time\u003E by Nobody\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-27T06:36:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nobbers12345\u0022 data-cite=\u0022nobbers12345\u0022\u003E\u003Cdiv\u003EI kind of agree, perhaps not kill it, but definitely won\u0027t help the game when it finally releases.\u003Cp\u003EWith the implementation of steam sales, I think the amount of players will begin to plateau because anyone who will ever want it has already bought it.\u003C/p\u003E\u003Cp\u003EHowever, the donations people will likely give could possible support the game as it drags along.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not as if they couldn\u0027t sell expansions to the game if they *really needed to*...\u003C/p\u003E\u003Cp\u003EThe game is nowhere near market saturation. So many people still haven\u0027t even heard of the game. The player-base continues to grow vibrantly, and there are always more kids coming of age into mature gamers capable of playing something like KSP...\u003C/p\u003E\u003Cp\u003EThe best thing Squad could do would be to increase the number of developers. They have a small team now, and it seems like many of them are working on supplemental things like Google\u002B spreadsheets (to take a recent example) and running the forums rather than the actual code.\u003C/p\u003E\u003Cp\u003EI\u0027m not criticizing- those functions need to be filled. But they could easily double the number of developers working on code by hiring just a few programmers, since the vast majority of the devs currently aren\u0027t actually working on coding...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-27T07:39:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EWell, someone who knows better than anyone else here could enlighten us...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps I can help a little. I\u0027ve been a professional programmer since 1998. I don\u0027t work on games these days, but I did do some game work back in 1999. In any case, the relevant points here aren\u0027t specific to game development, but rather just large development projects in general. I\u0027ve been working on enterprise level projects for most of my career.\u003C/p\u003E\u003Cp\u003ESo with that said, let me try to say something about this point (and give a bit more detail regarding Vanamonde\u0027s earlier comment):\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MajorSpittle\u0022 data-cite=\u0022MajorSpittle\u0022\u003E\u003Cdiv\u003EI don\u0027t know much about developing a game, but how can people develop \u0022Kerthane\u0022 mods, \u0022Dangerous Re-entry\u0022, \u0022Planet Packs\u0022, and \u0022Sound Packs\u0022 just in their spare time so quickly and the developers not be able to develop for sale mod packs as quickly to help propel production of the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELarge programs are composed of a number of \u0022layers\u0022 of code, and the layers are composed of independent \u0022objects\u0022 that can communicate with each other. The layers are constructed such that the higher layers depend on the lower layers, but the lower layers don\u0027t depend on the higher layers (at least, this is how they should be constructed).\u003C/p\u003E\u003Cp\u003EWhen modders are doing their work, they are working with some of the very high layers. Squad (and Unity) have exposed some of the layers to the community so that mods can be created. Building on top of the higher layers doesn\u0027t have any impact on the lower layers, so you don\u0027t have to go through and test the whole KSP codebase when making mods. You work against a static and (over the short term) stable layer that has been provided for you.\u003C/p\u003E\u003Cp\u003ESquad, in the meantime, works on the whole stack. \u003C/p\u003E\u003Cp\u003EIdeally the lower layers don\u0027t have to be modified too often, but large design decisions can require that lower layer code gets reworked. When this happens a lot of additional work (largely testing) is done to make sure that you haven\u0027t broken any of the higher layers. If you find something has broken, it can often mean a *lot* of work to fix.\u003C/p\u003E\u003Cp\u003EIn addition to this, Squad\u0027s internal plans for future features and updates might include changes anywhere in the stack. An example of this might be switching to 64 bit unity. So they have some idea about what may change in future, and what kind of impact that might have. If some of those changes might be lower level changes, then they have a decision to make: Build the new high level stuff now, then test it and potentially rebuild it again later when you update the lower layers. Or just wait until the lower layers are updated, and then build the higher layers. \u003C/p\u003E\u003Cp\u003EThe advantage of the former approach is that new features get released quickly. The disadvantage is that it means more work in the long run.\u003C/p\u003E\u003Cp\u003EThe advantage of the latter approach is that it is an efficient method that results in fewer bugs and less testing. The disadvantage is that the higher level stuff gets updated more slowly.\u003C/p\u003E\u003Cp\u003ESince Squad is a relatively small team, the latter approach is a more sensible one to take. You could say \u0022just hire more programmers\u0022, but it\u0027s not quite that simple. Each time a new programmer is added they start off with no knowledge of what has gone before. They must be brought up to speed, learning the quirks and idiosyncrasies of the existing code base. And since the existing code base is large, this takes a long time. In fact, it\u0027s almost impossible to get a new developer on a project that already has a large code base up to speed with everything. The best you can do is hope that the code is modular enough that they only need to know about the areas they are working against directly.\u003C/p\u003E\u003Cp\u003EModders don\u0027t have this detailed, multi layer plan. They just have the higher layers that have been exposed for them to use, and build against whatever is available \u0022now\u0022. They can\u0027t decide whether to hold off and wait for lower level changes to come through, because they\u0027re not exposed to those layers in the first place, and don\u0027t know in detail what those plans might be. So a modder just goes ahead and builds whatever they think works best using whatever is currently exposed. If things change in the future the mod might break - and indeed, this happens all the time. Many, many KSP mods have \u0022died\u0022 due to core game updates. We as a community might not really care - someone else will come along and build a new mod that works with the new version of KSP, and we\u0027re happy. But the double, or triple, or quadruple development effort that this process creates isn\u0027t something that any respectable development team would want as part of their process, because it ultimately reduces available resources.\u003C/p\u003E\u003Cp\u003ENow someone might say \u0022I know mods that have continued to work through several versions of KSP\u0022. And that would be correct. Some mods don\u0027t need much updating, or only need minor updating, in order to remain compatible. You might think this defeats the argument against approach 1. Not much rework was required after all, so why not just go ahead and add the high level features now?\u003C/p\u003E\u003Cp\u003EAh, but the very reason why not much work was required, the very reason why mods can be built quickly and updated quickly, is that Squad themselves did a very large amount of work to ensure that the high layer stayed consistent through lower layer changes. In other words, Squad has spent a very very large amount of time so that the modders don\u0027t have to. Squad\u0027s other option would be to say \u0022hey, we made some changes, we were able to make them quickly but pretty much all mods are now broken. Too bad modders, go build your mods again\u0022. But if they took this approach the number and quality of mods for KSP would be massively reduced, because people wouldn\u0027t bother putting in the effort if their stuff broke all the time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-27T08:57:19Z\u0022 title=\u002205/27/2014 08:57  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 27, 2014\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darkmuminek","CreatedById":79107,"CreatedDateTime":"2014-05-27T07:39:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xaiier\u0022 data-cite=\u0022Xaiier\u0022\u003E\u003Cdiv\u003ESo much facepalm.\u003Cp\u003EI will never comprehend how people can have so little understanding of how game development on this scale works. It\u0027s not even worth trying to refute points.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just love it when someone criticizes KSP and the fanboy police arrives in seconds with no arguments at all. Frankly speaking KSP is a bad game. Not in terms of idea or gameplay, but because of slow development and horrible communication. Right now the main line of communication between developers and player base are the devnotes which, for me, don\u0027t work at all. Most of the time they consist of statements like: \u0022We are doing something right now, we won\u0027t tell you what or when it will happen\u0022 or \u0022We were at someplace and we\u0027re tired but now we are preparing to go someplace else and we will be tired too\u0022. The best example is this forum, where mostly the only occasion to get some reaction from the team is \u0022thread closed\u0022 when someone dares to post something from the dreaded \u0022what not to suggest\u0022 list.\u003C/p\u003E\u003Cp\u003EAs for the development, we know how it works. We know it takes time and resources. We know and understand it\u0027s an early access game but I think SQUAD lost it some time ago. The game\u0027s been in development for three or four years and yet most functionalities come from mods. Reentry effects and damage? There\u0027s a mod for that. Better atmospheric model? Try FAR. Basic flight and orbital data? Yeah, go and install Kerbal Engineer or MechJeb. Kerbal Alarm Clock, Crew Manifest, KAS, Infernal Robotics, Kethane... these should be stock. Instead we get the, in my opinion, completely unnecessary ARM Pack. It\u0027s great we\u0027ve got asteroids now. Too bad all you can do is dock with them just the same as you can dock with another ship. Too bad you don\u0027t focus on what\u0027s important. The science system is completely broken. There\u0027s no fun in preforming the experiments, there\u0027s no sense of achievement. Just spamming the \u0022get science\u0022 button. Another example? 64-bit. Unity announced a few months ago that the new version of their engine will have proper 64-bit support for Windows. Did anyone from SQUAD bother to tell us they\u0027re looking into it? Don\u0027t think so...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EThis complaint fails to take into consideration that mod-makers are making creating alterations or additions to already working code. And who created, maintains, and updates the code that runs the game? Squad does. Of course it\u0027s going to be faster and easier to modify or add to a functioning system than it was to create the functioning system in the first place, so there\u0027s realy no basis for comparing the two.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but I don\u0027t understand how one person (or even a group of them), working for free, in their spare time can do a better job than a studio of professional developers. Of course it took a lot of time and work to make the best mods but eventually they got finished, they are compatible with other mods and once again - all of this done by someone who has a family, a job, school and does it for free.\u003C/p\u003E\u003Cp\u003EEvery time there\u0027s talk about development of KSP I compare it to Space Engineers. It\u0027s also a complex, sandbox, space game made by a small studio. Yet they manage to release weekly updates. Granted, they have their own engine and the updates are smaller than the KSP ones but still they deliver what the players want, they are in constant contact with their fans, they listen to them and give them complete information about the status of the game and it\u0027s planned features. Why can\u0027t SQUAD do the same?\u003C/p\u003E\u003Cp\u003EAs for the OP\u0027s question. Yes, I think it can kill a game. To be honest I don\u0027t believe we\u0027ll ever see a finished KSP. I give it two, maybe three years after which it\u0027ll get abandoned. This saddens me because it\u0027s a great game with great potential but the developer forgot what\u0027s it all about.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-27T09:13:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022darkmuminek\u0022 data-cite=\u0022darkmuminek\u0022\u003E\u003Cdiv\u003EMost of the time they consist of statements like: \u0022We are doing something right now, we won\u0027t tell you what or when it will happen\u0022\u003Cp\u003E\u0026lt;...\u0026gt;\u003C/p\u003E\u003Cp\u003Eand give them complete information about the status of the game and it\u0027s planned features. Why can\u0027t SQUAD do the same?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I just made a large and detailed post \u0022defending\u0022 Squad\u0027s position on development, I must agree with these specific sentiments about communication.\u003C/p\u003E\u003Cp\u003ESquad has taken the position that \u0022letting people know about things that \u003Cem\u003Emight\u003C/em\u003E happen, or \u003Cem\u003Ecurrent under-construction ideas\u003C/em\u003E\u0022 is a bad move, because it \u0022sets people up for disappointment\u0022, or something along these lines. Squad points to the \u0022resources\u0022 de-listing as evidence of this, and seems to assume that the matter is therefore proven.\u003C/p\u003E\u003Cp\u003EBut that\u0027s not the right approach to take.\u003C/p\u003E\u003Cp\u003EWhat Squad has historically done is announce features close to release, but providing very few details about how things might work, and then provided a second update at time of release to say \u0022it\u0027s done\u0022. But this denies the community the opportunity to provide useful feedback. The community was not upset by the postponement/cancellation of resources merely because they\u0027d heard it was coming. It was upset because no other ideas for \u0022things we might be able to do beyond going places and landing there\u0022 were raised, and Squad explicitly said they weren\u0027t going to reveal any draft plans for what that might be.\u003C/p\u003E\u003Cp\u003ETransparency doesn\u0027t mean letting people know something has been released. It means letting people know what your ideas are \u003Cem\u003Ewhile they\u0027re still being worked on\u003C/em\u003E. It doesn\u0027t matter if those ideas are changing. Recently we\u0027ve even seen people in this forum write things like \u0022there\u0027s no point talking about contracts until contracts are released\u0022. But what if the community can come up with good contract related ideas? Right now people are left to make suggestions in a vacuum - we don\u0027t know if the suggestion is even remotely compatible with what Squad might end up doing. There\u0027s no starting point that the community can work from when building their suggestions.\u003C/p\u003E\u003Cp\u003EThis isn\u0027t to say that Squad should do whatever the community wants and ignore their own plans. It\u0027s simply the acknowledgement that when you have thousands of dedicated players, some of them are going to come up with ideas and post them, it might turn out that they can come up with better ideas than half a dozen people. And if those half dozen people like the ideas, they can incorporate them, or incorporate the aspects that they like, or maybe they don\u0027t want to use the idea as stated but it gives them another idea of their own. Squad still gets to put into the game exactly what Squad wants to, their pool of available ideas just becomes larger. But without any information from Squad on, even vaguely, what kind of things they\u0027re thinking about, the pool is full of random flotsam and jetsam. And if there\u0027s no information provided until something is released, \u003Cem\u003Eit\u0027s too late for the community to bother providing feedback\u003C/em\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-27T09:27:37Z\u0022 title=\u002205/27/2014 09:27  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 27, 2014\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darkmuminek","CreatedById":79107,"CreatedDateTime":"2014-05-27T10:01:15Z","Content":"\n\u003Cp\u003EI agree with you. Listening to suggestions and sharing your thoughts is very important in not only game development but nearly all aspects of life. It doesn\u0027t mean that everyone should start posting their ideas in the suggestions forum nor does it mean Squad should implement everything people write there but having a look from time to time and taking some things into consideration is generally a good idea. Instead the only replies people get there are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EIt\u0027s on the \u0022what not to suggest\u0022 list, go to hell.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThere\u0027s a mod for that.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESome general good/bad words from other users that give nothing of value.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EA normal, or better said - standard, game development process has two parties: the developer who does all the work and the publisher who gives the money and tells the developer whad he\u0027d like in the game. In case of indie games there\u0027s no publisher and that\u0027s why they\u0027re called \u0022indie\u0022. However KSP is also an Early Access game meaning that people (us) gave their money to the developer trusting they can deliver a complete product in the near future. This makes us a form of publishers meaning we have the right to:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ecomplain\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ehave expectations\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ehave suggestions\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eask questions\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eget the answers to these questions\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eget reliable information about the status of the game\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOnce again, Squad. This is your game. You decide how it looks like or what features will it have. However it is because of us, our trust and money that you can make it happen. A thing you (and many other indie devs) seem to forget too often.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-27T10:04:54Z","Content":"\n\u003Cp\u003EI think that\u0027s going a bit far, but I don\u0027t want to open up the \u0022obligations/entitlements\u0022 discussion.\u003C/p\u003E\n"}]}