{"TopicId":73721,"ForumId":55,"TopicTitle":"Sun should be brighter and scarier up close.","CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-05-31T05:07:58Z","PageNum":1,"Articles":[{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-05-31T05:07:58Z","Content":"\n\u003Cp\u003ESo I ventured into low Kerbol orbit today and was disappointed at how ... dim it looks up close. It looks like a yellow gas giant with a couple of black spots. Compare that to the (fairly) realistic depiction in movies like \u003Cem\u003ESunshine\u003C/em\u003E: it\u0027s so bright, the whole screen looks bright white from up close.\u003C/p\u003E\u003Cp\u003EObviously KSP won\u0027t ever be quite that accurate, but there should be a lot more to acknowledge the fact that your ship is in the most dangerous environment known to Kerbalkind. Even if it\u0027s not a huge solar flare or coronal loop, at least have it be brighter and difficult to make out its spherical shape.\u003C/p\u003E\u003Cp\u003EFrom\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/wBa9oyYeL5o?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E, the sun used to be like that until it got its spherical model in version 0.11. Could the two be combined to make a semi-realistic solar experience?\n"},{"CreatedByName":"cwhiz","CreatedById":109362,"CreatedDateTime":"2014-05-31T05:27:17Z","Content":"\n\u003Cp\u003EHmmm, I actually think the Sun looks pretty imposing up close. I\u0027ve never actually thought any depictions of the Sun appeared \u0022scary\u0022 so I can\u0027t really help there. I looked at the video and I actually think the current version of the Sun looks fine because of better detail but this is just my personal taste.\u003C/p\u003E\n"},{"CreatedByName":"travis575757","CreatedById":83941,"CreatedDateTime":"2014-05-31T14:48:50Z","Content":"\n\u003Cp\u003EYeah i agree, the same thing with jool too. Both should look like they have no surface with very opaque atmospheres that get harder to see through as they get deeper, for Kerbol it should be so bright that you can\u0027t look at it very well up close without your screen turning completely white. As you get closer every part of your ship starts to glow red and eventually overheats if you get too close. special shield would be required to get closer to it then Moho.\u003C/p\u003E\n"},{"CreatedByName":"halflife77","CreatedById":65970,"CreatedDateTime":"2014-06-14T03:59:40Z","Content":"\n\u003Cp\u003EI do believe your are right. Although i do think Kerbol is simply majestic now (my desktop background is currently a screenshot of a death probe I sent into the sun) It could still be just a little bit better and more epic. Maybe Kerbol deserves it\u0027s own custom music when you get near it. Like, epic beyond imagination music.\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2014-06-14T04:28:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022halflife77\u0022 data-cite=\u0022halflife77\u0022\u003E\u003Cdiv\u003EMaybe Kerbol deserves it\u0027s own custom music when you get near it. Like, epic beyond imagination music.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe\u0027s onto something...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/WteEusedMVo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2014-06-14T08:30:20Z","Content":"\n\u003Cp\u003EWell it will probably get solar prominences and flares as well as other visuals for the sun in the future. The Wiki mentions that, but as with everything on the wiki related to long term plans take it with a grain of salt.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-06-14T14:57:02Z","Content":"\n\u003Cp\u003EKerbol is pretty terrifying up close IMO\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-06-18T18:01:53Z","Content":"\n\u003Cp\u003E\u002B1. Kerbol was a complete disappointment after getting up close.\u003C/p\u003E\u003Cp\u003EForget for a moment about solar flares, prominences or anything like that - it\u0027s just not bright enough. It should be nearly blinding, while right now it DOES look like a huge gas giant.\u003C/p\u003E\u003Cp\u003EI guess much more elaborate stuff like heat mechanics will be added when they\u0027ll get around implementing heat shields but brightness with strong flares is something that can be added quite easily (perhaps also some god rays? Under some camera angles it\u0027ll look weird with no rays visible, but when viewing ship towards sun center of mass - it\u0027ll look stunning).\u003C/p\u003E\n"}]}