{"TopicId":73829,"ForumId":16,"TopicTitle":"Massive solar array unstable - Heavily Modified","CreatedByName":"MoparGamer","CreatedById":112053,"CreatedDateTime":"2014-06-01T14:45:14Z","PageNum":1,"Articles":[{"CreatedByName":"MoparGamer","CreatedById":112053,"CreatedDateTime":"2014-06-01T14:45:14Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i1372.photobucket.com/albums/ag346/MoparGamer/Untitled5_zps1fa425e2.png\u0022 alt=\u0022Untitled5_zps1fa425e2.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem: for the duration of most of the flight there wasn\u0027t an issue. Upon returning from doing a quick maneuver on a different vessel, the satellite decided to start shaking uncontrollably.\u003C/p\u003E\u003Cp\u003EHere are some pictures\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i1372.photobucket.com/albums/ag346/MoparGamer/Untitled_zpsf9a50bbb.png\u0022 alt=\u0022Untitled_zpsf9a50bbb.png\u0022\u003E\u003Cp\u003EPicture 1: The satellite as its supposed to be.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1372.photobucket.com/albums/ag346/MoparGamer/Untitled3_zpse019393e.png\u0022 alt=\u0022Untitled3_zpse019393e.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 2: The top right and bottom left begin to shake.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1372.photobucket.com/albums/ag346/MoparGamer/Untitled2_zpsa29f0d94.png\u0022 alt=\u0022Untitled2_zpsa29f0d94.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 3: The satellite shakes out of control\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1372.photobucket.com/albums/ag346/MoparGamer/Untitled4_zpsa53a7f9b.png\u0022 alt=\u0022Untitled4_zpsa53a7f9b.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 4: The satellites functional purpose is put to an end, Everything breaks off. Soon after it starts dancing.\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EI attempted restarting ksp, turning SAS off and on(And keeping it off/on), retracting the solar panels, and compacting the Infernal Robotics(IR) contraption, and updating IR to .15d instead of .14, none of it worked. Soon after I Hyperedited the satellite into the desired orbit, to save myself from having to do another 3h\u002B of burning.\u003C/p\u003E\u003Cp\u003ESo my question is, do you have any idea of what I\u0027ve done wrong here, and any suggestions on how to avoid or fix this issue?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-01T18:52:27Z\u0022 title=\u002206/01/2014 06:52  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 1, 2014\u003C/time\u003E by MoparGamer\u003C/strong\u003E\n\u003Cbr\u003EGrammatical\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-06-01T17:26:57Z","Content":"\n\u003Cp\u003EYou might have issues with solar panel clipping, try providing some space between panels.\u003C/p\u003E\n"},{"CreatedByName":"Procyon","CreatedById":57510,"CreatedDateTime":"2014-06-01T17:40:44Z","Content":"\n\u003Cp\u003Eseen the sas module do this on some of my small Sat\u0027s. turning torque off and on with sas enabled seemed to work. dunno if its the same issue with that monster tho.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-01T17:43:22Z","Content":"\n\u003Cp\u003EDid you ever leave it before that fateful time?\u003C/p\u003E\u003Cp\u003EThose pictures are really dark so it\u0027s really hard to see. It could be resonance (where the ship simply shakes itself apart upon loading) or part clipping like Taki said.\u003C/p\u003E\u003Cp\u003EI helped save one ship recently where disabling the torque on a reaction wheel right when the craft loaded seemed to shop the impending explosion. Then shifting some fuel around stopped the resonance from happening again.\u003C/p\u003E\u003Cp\u003EAlso, one of my large station modules blew itself apart on a later loading (already had been to that part several times) because my struts became detached during VAB editing and I didn\u0027t catch it. In that case, a slight bump caused the resonance to go out of control and it came apart. So perhaps you need some strategically placed struts.\u003C/p\u003E\u003Cp\u003EEdit: Ah yeah, ninja Procyon said the same thing about the torque. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MoparGamer","CreatedById":112053,"CreatedDateTime":"2014-06-01T18:15:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EDid you ever leave it before that fateful time?\u003Cp\u003EThose pictures are really dark so it\u0027s really hard to see.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI left it to do a quick maneuver and when I returned it began doing this :L\u003C/p\u003E\u003Cp\u003EI\u0027ll try and get you guys a cleaner image of the ship, but currently, IR doesn\u0027t want to show me the servo control menu... \u003C/p\u003E\u003Cp\u003EI\u0027ve tried doing what you guys have recommended, the current Kerbol (Sun) satellite appears to be beyond saviour as the panels \u0026amp; MW receivers clip, and the satellite begins shaking before the ship becomes responsive or before I can transfer fuel. (Is it normal for a ship to be unresponsive for 5-10 seconds after initial loadup?)\u003C/p\u003E\u003Cp\u003EThanks for the help so far\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-01T20:00:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MoparGamer\u0022 data-cite=\u0022MoparGamer\u0022\u003E\u003Cdiv\u003EI left it to do a quick maneuver and when I returned it began doing this :L\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, sorry. I saw that part but I meant to ask if you had left it any time prior to what you described.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MoparGamer\u0022 data-cite=\u0022MoparGamer\u0022\u003E\u003Cdiv\u003EI\u0027ll try and get you guys a cleaner image of the ship, but currently, IR doesn\u0027t want to show me the servo control menu... \u003Cp\u003EI\u0027ve tried doing what you guys have recommended, the current Kerbol (Sun) satellite appears to be beyond saviour as the panels \u0026amp; MW receivers clip, and the satellite begins shaking before the ship becomes responsive or before I can transfer fuel. (Is it normal for a ship to be unresponsive for 5-10 seconds after initial loadup?)\u003C/p\u003E\u003Cp\u003EThanks for the help so far\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s pretty normal for the ship to be unresponsive for a few seconds. Typically because the physics and background number crunching is being loaded. Sometimes you can get in there and right click to select stuff like the reaction wheels before the physics activates.\u003C/p\u003E\u003Cp\u003EIf you have two parts clipped together (and that\u0027s causing the problem) then it might not be possible to save it by doing any mass or reaction wheel trickery. It\u0027s worth a try though. After that, you may just have to send a replacement.\u003C/p\u003E\n"}]}