{"TopicId":73820,"ForumId":44,"TopicTitle":"Do you believe in the existence of highly advanced ancient Earth civilization before?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-01T10:45:58Z","PageNum":2,"Articles":[{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2014-06-01T17:12:34Z","Content":"\n\u003Cp\u003Ei kinda like the asimov metaphor when man rediscover the ability to count in their head without machine, i need two silex and a tv show \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-06-01T17:13:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EAnyone ever seen enough of \u0022The World Without Us\u0022 to know how long it would take for all evidence of our current civilization to go poof?\u003Cp\u003E\u0027course, I have yet to even find any criticisms about how accurate it may or may not be.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA civilisation as advanced as us would find our remains:\u003C/p\u003E\u003Cp\u003E- The remains of apollo and various other robotic landings on the moon would stay there very long.\u003C/p\u003E\u003Cp\u003E- The \u0027lack of fossil fuel\u0027 will stay long. The very sudden increase of CO2 in the atmosphere will be measureable in ice layers in the future.\u003C/p\u003E\u003Cp\u003E- They will have a fossil record. A sudden mass extinction event will be noticed.\u003C/p\u003E\u003Cp\u003E- Noble metals will be found in unnatural forms. If a fossilised t-rex skelleton can pass the test of time, a gold reserve will too.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-06-01T17:27:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022N_las\u0022 data-cite=\u0022N_las\u0022\u003E\u003Cdiv\u003EA civilisation as advanced as us would find our remains:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs well as the other points here, this would also apply literally; there are huge numbers of us and we deliberately bury our dead, so we\u0027d likely show up in in relatively large numbers. The fossil record would show a group of clearly large-brained organisms suddenly appearing worldwide at the same time as almost all other animals larger than a housecat go extinct; clear signs of civilisation at some level.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-01T17:47:03Z","Content":"\n\u003Cp\u003EWe\u0027ve also built some things out of natural materials in geologically stable areas. The Mount Rushmore monument in the U.S., for example. That\u0027s going to be there for a long, long time.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-06-01T17:49:00Z","Content":"\n\u003Cp\u003ENot to mention ceramics \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Obiects made from clay fired in kilns can last for a very, very long time. Earliest we found date to 1400 years ago, and are still easily recognizable as man-made. Glass can last even longer - and boy, do we produce a lot of this stuff yearly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-06-01T18:44:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EThey did. Have a look at the various Pyramids all aligned along an past equator line around the Earth.\u003Cp\u003EAlso most master builders will tell you even nowadays buildings like the Cheops pyramid are not buildable with this precision.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat\u0027s the old fallacy of thinking that just because they lived long ago the ancient Egyptians were stupid, so they must have had help from some superadvanced alien race (or time travelers).\u003C/p\u003E\u003Cp\u003EIt\u0027s simply not true. \u003C/p\u003E\u003Cp\u003EAnd that \u0022precision\u0022 isn\u0027t true either. That assumes they were aligned like that using theodolites and deliberately placed as they were, rather than the known accurate way of a guy squinting along a ruler, a method that worked for thousands of years before people decided they needed to invent computerised equipment and only allow people trained to use it to be building engineers.\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2014-06-01T18:53:07Z","Content":"\n\u003Cp\u003Ei need some ants that explore, conquer and expand, that work or don\u0027t (some species ratio are kinda fun btw), that domestic other species \u0026amp;etc.\u0026amp;etc... i just forget one thing amongst other how old are ants and what\u0027s occured since.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EEDIT:\u003C/span\u003E if i was an ant wich is not the case i could pheromonally think:\u0022 hehe watch thoose silly human there so proud of themselves, bah nevermind next meteore will wipe them like dinausaurs before.\u0022\u003C/p\u003E\u003Cp\u003Ejust look under your feet you might had miss some civs. xD\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-01T19:02:59Z\u0022 title=\u002206/01/2014 07:02  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 1, 2014\u003C/time\u003E by WinkAllKerb\u0026#39;\u0026#39;\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Creature","CreatedById":106457,"CreatedDateTime":"2014-06-01T18:57:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003ENot to mention ceramics \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Obiects made from clay fired in kilns can last for a very, very long time. Earliest we found date to 1400 years ago, and are still easily recognizable as man-made. Glass can last even longer - and boy, do we produce a lot of this stuff yearly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure if you mean something else than ceramics in general, but there\u0027s plenty of older ceramics around. The earliest ceramics here in the northern periferia dates to about 5000 b.c making it roughly 7000 years old. This stuff is easily found in any stone age habitat in large quantities and it\u0027s preserved very well.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-06-01T19:57:39Z","Content":"\n\u003Cp\u003EHumans? Probably would be way too obvious, way too much evidence left.\u003C/p\u003E\u003Cp\u003ENow, you could have a \u0022low tech\u0022-but-ahead-of-its-time civilization we\u0027ve missed -- humans were around quite a while before we have any evidence of civilization, so there could have been, say, a small local civilization on the level of say, Sumer or whatever 30,000 years ago we\u0027ve missed because it existed in a place that\u0027s underwater now and didn\u0027t build big monuments out of stone that lasted.\u003C/p\u003E\u003Cp\u003EWhen you start going way back in geological time, it gets a bit more believable that we could miss a high-tech civilization, but even then -- if they got to our level -- our ubiquitous use of artificial materials would probably leave some sign in the fossil record. (Now maybe we\u0027ve seen it already and just assumed it\u0027s natural... cool SF concept, but I doubt it.)\u003C/p\u003E\u003Cp\u003EThe bigger problem for really long ago (dinosaurs etc.) civilizations is, what was the intelligent being and where did it come from? Primates have lots of species and a significant fossil record. There isn\u0027t anything like that in the Mesozoic or earlier -- the \u0022big-brained\u0022 dinosaurs were still pretty dumb by the standards of modern birds, though larger-brained than other dinosaurs. There\u0027s a huge amount of evolution required from anything we\u0027ve seen to even an ape level of brain size and complexity, much less a human one.\u003C/p\u003E\u003Cp\u003ENow, maybe you could squeeze something into the Cenozoic from a dolphin lineage or a corvid (crows/jays/etc) or parrot line, ravens and African grey parrots are apparently comparable to ape intelligence so you can imagine a sapient species coming from those lineages, but none of them has hands so... I really doubt it.\u003C/p\u003E\u003Cp\u003E(Although I\u0027ve written an SF story using the concept, a Miocene marsupial species that was killed off by the freezing of Antarctica, and all that\u0027s left to find (above ice) are a few artifacts left by explorers in Argentina and the southern tip of Africa. They were bronze-age-at-best though.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tychochallenge\u0022 data-cite=\u0022tychochallenge\u0022\u003E\u003Cdiv\u003Eperhaps certain types of (raptor) dinosaurs became intelligent and created a civilization, but existed for such a brief period that no evidence of them would be found like in Baxter\u0027s novel Evolution\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIIRC in that bit \u0022The Hunters of Pangaea\u0022 they died off because the rifting of Pangaea messed up the sauropod migration routes and killed them off, and they depended on hunting sauropods. Which is silly because continental drift is so utterly slow on the timescale of individual lives -- they would have had \u003Cem\u003Eplenty\u003C/em\u003E of time to adapt, much longer than the entire existence of humanity. And we survived the extinction of our own megafauna in a much shorter period, we just learned to fish and to hunt smaller game and so on (and then to domesticate livestock and grow crops).\u003C/p\u003E\u003Cp\u003ENow, a species that was way less \u0022exploring\u0022 than humans -- maybe one that evolved on an isolated island -- could potentially have gone extinct from local conditions. Or you could have a species that evolved just immediately before the end-Cretaceous extinction. Neither would have the chance to build a civilization, though, and both situations seem sort of a stretch to me. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003E. Consequently, if we end up killing ourselves, any other intelligent species that might evolve after us will have a much tougher time reaching our own level of technology because the easily available high-yield fossil fuels will be much harder to come by because of us.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think you need fossil fuels to develop a technological civilization. Steam engines can burn wood, and biological oils can be used as fuel, and you could probably use that to get to the point that you could develop solar or nuclear power. It likely would delay your Industrial Revolution by a century or two, as wood-burning steam engines and use of biological oils (before a Green Revolution and modern biotech) wouldn\u0027t let you do stuff on that \u003Cem\u003Escale\u003C/em\u003E, but on the grand scale a century or two isn\u0027t that much.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-06-01T20:48:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andrewas\u0022 data-cite=\u0022andrewas\u0022\u003E\u003Cdiv\u003EHumanity hasn\u0027t been around long enough for a high tech civ to fall and for all the traces to vanish. Remember, we regularly find stone tools from the first tool-using humans, we\u0027d find remnants of high technology just as easily. Nor could such a high tech group arise in isolation, leaving us to miss them because we haven\u0027t looked where their village was - to develop high technology, you need a large population, and posessing that tech would lead the group to expand. Any way you look at it, an ancient high tech civ should have us pulling ancient smartphones out of the rubble.\u003Cp\u003EIt\u0027s a little more practical to look at pre-human high tech cubs, but then we\u0027d probably find something even from a dinosaur civilisation. Today\u0027s landfills will have traces of technology for millions of years, in the form of materials that don\u0027t occur in nature even if nothing recognizable survives.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, landfills will conserve stuff as you dig it down, copper, aluminum, and ceramic breaks down far less than bones. Even from something like a dinosaur civilization we would find fossils of technology.\u003C/p\u003E\u003Cp\u003EThe only thing who might be possible but unlikely is an towns and regional civilizations predating the end of the ice age. One town in Tyrkia is 10.000 year old, still stone age and pretty small scale compared to Egypt but might even have primitive writing.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-06-01T21:39:07Z","Content":"\n\u003Cp\u003EThe pyramids in Gizeh are maybe older then 10.000 years. The problem is only most of the so called egyptian academics fail to open their minds for other possibilities then the established thinking of 200.000 workers worked for at least 20 years only for the Cheops pyramid and we are not talking about the others. Sorry i can only laugh at such narrow mindness. I am not saying that aliens came down and built the thing but i see the speechlessness of them when they try to explain things. They won\u0027t admit that they have no clue. It is such a big shame not to know something is\u0027nt it? Sorry if i am someone to teach people stuff for sure i would not tell my students such nonsense, i would rather die before taking that shame on me telling them lies. All this big monuments are perfectly doing what they are supposed to do, they are reminding us of how little we really know.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThe great pyramid is at over 29 degrees north, and axial tilt doesn\u0027t exactly change rapidly. In order for it to be on a \u0027past equator line\u0027, it\u0027d have to be literally billions of years old.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess you have written records of this time that proof your words? Or you somehow magically measured the axial tilt back then?\u003C/p\u003E\u003Cp\u003EFact is nobody knows exactly whats there in Earths core. Or you want to tell me now that we have send probes down there?\u003C/p\u003E\u003Cp\u003EIs it so unbelievable that something happened with Earths core and tilted the axis about 10000-15000 years ago which ended in a global catastrophe? Is it so unbelievable that the people back then saw this coming and build monuments around the equator line at that time to warn the generations to come? For me that is more plausible then pharaos making graves for themself and that all the time living.\u003C/p\u003E\u003Cp\u003EI am not saying that this is the only explaination and the truth, but i am saying it is worth considering alternative possibilities when thinking about this matter.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-06-01T21:39:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003EHumans? Probably would be way too obvious, way too much evidence left.\u003Cp\u003ENow, you could have a \u0022low tech\u0022-but-ahead-of-its-time civilization we\u0027ve missed -- humans were around quite a while before we have any evidence of civilization, so there could have been, say, a small local civilization on the level of say, Sumer or whatever 30,000 years ago we\u0027ve missed because it existed in a place that\u0027s underwater now and didn\u0027t build big monuments out of stone that lasted.\u003C/p\u003E\u003Cp\u003EWhen you start going way back in geological time, it gets a bit more believable that we could miss a high-tech civilization, but even then -- if they got to our level -- our ubiquitous use of artificial materials would probably leave some sign in the fossil record. (Now maybe we\u0027ve seen it already and just assumed it\u0027s natural... cool SF concept, but I doubt it.)\u003C/p\u003E\u003Cp\u003EThe bigger problem for really long ago (dinosaurs etc.) civilizations is, what was the intelligent being and where did it come from? Primates have lots of species and a significant fossil record. There isn\u0027t anything like that in the Mesozoic or earlier -- the \u0022big-brained\u0022 dinosaurs were still pretty dumb by the standards of modern birds, though larger-brained than other dinosaurs. There\u0027s a huge amount of evolution required from anything we\u0027ve seen to even an ape level of brain size and complexity, much less a human one.\u003C/p\u003E\u003Cp\u003ENow, maybe you could squeeze something into the Cenozoic from a dolphin lineage or a corvid (crows/jays/etc) or parrot line, ravens and African grey parrots are apparently comparable to ape intelligence so you can imagine a sapient species coming from those lineages, but none of them has hands so... I really doubt it.\u003C/p\u003E\u003Cp\u003E(Although I\u0027ve written an SF story using the concept, a Miocene marsupial species that was killed off by the freezing of Antarctica, and all that\u0027s left to find (above ice) are a few artifacts left by explorers in Argentina and the southern tip of Africa. They were bronze-age-at-best though.)\u003C/p\u003E\u003Cp\u003EIIRC in that bit \u0022The Hunters of Pangaea\u0022 they died off because the rifting of Pangaea messed up the sauropod migration routes and killed them off, and they depended on hunting sauropods. Which is silly because continental drift is so utterly slow on the timescale of individual lives -- they would have had \u003Cem\u003Eplenty\u003C/em\u003E of time to adapt, much longer than the entire existence of humanity. And we survived the extinction of our own megafauna in a much shorter period, we just learned to fish and to hunt smaller game and so on (and then to domesticate livestock and grow crops).\u003C/p\u003E\u003Cp\u003ENow, a species that was way less \u0022exploring\u0022 than humans -- maybe one that evolved on an isolated island -- could potentially have gone extinct from local conditions. Or you could have a species that evolved just immediately before the end-Cretaceous extinction. Neither would have the chance to build a civilization, though, and both situations seem sort of a stretch to me. \u003C/p\u003E\u003Cp\u003EI don\u0027t think you need fossil fuels to develop a technological civilization. Steam engines can burn wood, and biological oils can be used as fuel, and you could probably use that to get to the point that you could develop solar or nuclear power. It likely would delay your Industrial Revolution by a century or two, as wood-burning steam engines and use of biological oils (before a Green Revolution and modern biotech) wouldn\u0027t let you do stuff on that \u003Cem\u003Escale\u003C/em\u003E, but on the grand scale a century or two isn\u0027t that much.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlcohol-burning internal combustion engines are another option. You just need fermenting plant mass and distillery to make plenty of fuel.\u003C/p\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2014-06-01T21:49:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EThe pyramids in Gizeh are maybe older then 10.000 years. The problem is only most of the so called egyptian academics fail to open their minds for other possibilities then the established thinking of 200.000 workers worked for at least 20 years only for the Cheops pyramid and we are not talking about the others. Sorry i can only laugh at such narrow mindness. I am not saying that aliens came down and built the thing but i see the speechlessness of them when they try to explain things. They won\u0027t admit that they have no clue. It is such a big shame not to know something is\u0027nt it? Sorry if i am someone to teach people stuff for sure i would not tell my students such nonsense, i would rather die before taking that shame on me telling them lies. All this big monuments are perfectly doing what they are supposed to do, they are reminding us of how little we really know.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the problem is that most of them refuse the consider the idea that the egyptians might have used slave labor for them. Most of the things I seen on the pyramids they assume they were built with paid labor.\u003C/p\u003E\u003Cp\u003E200,000 free men building a pyramid in 20 years, why not 1,000,000 slaves being worked to death to build one in a fraction of the time.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-06-01T22:04:44Z","Content":"\n\u003Cp\u003ESlavery, while widespread then, was not exactly providing an army of cheap labourers. A slave was quite expensive commodity, available in numbers only after succesful wars. Generally, they were NOT worked to death - because it was economically counterproductive. To replace 1 million of dead slaves, you would have to wage a huge war (or series of smaller ones) which is expensive in itself. Not to mention problems with population density \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Catching so many able-bodied men would be difficult in a time, when a city with 10 000 population was considered huge.\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-06-01T22:06:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI guess you have written records of this time that proof your words? Or you somehow magically measured the axial tilt back then?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFunny, isn\u0027t it? YOU claimed they were all along a past equator line. So one would think you have written records or magical measurments?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIs it so unbelievable that something happened with Earths core and tilted the axis about 10000-15000 years ago which ended in a global catastrophe? Is it so unbelievable that the people back then saw this coming and build monuments around the equator line at that time to warn the generations to come? For me that is more plausible then pharaos making graves for themself and that all the time living.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis has to be sarcasm... This idea is seriously more plausible to you than a pharaos making graves for themselfes?\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-06-01T22:26:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022N_las\u0022 data-cite=\u0022N_las\u0022\u003E\u003Cdiv\u003EThis has to be sarcasm... This idea is seriously more plausible to you than a pharaos making graves for themselfes?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot to mention that they actually written down that they were for the pharaos.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-06-01T22:36:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI guess you have written records of this time that proof your words? Or you somehow magically measured the axial tilt back then?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E You\u0027re the one claiming to have records of exact changes. The billions of years figure is simply the last time anything could possibly have occurred that would be violent enough to change the axial tilt-just think about how much energy that would actually take. An impact large enough to change axial tilt 30-odd degrees would likely wipe out life, never mind any civilisation.\u003C/p\u003E\n"},{"CreatedByName":"ecat","CreatedById":68747,"CreatedDateTime":"2014-06-01T22:53:05Z","Content":"\n\u003Cp\u003EOT: No. There is no evidence for an advanced ancient civilisation, while it may be nice to dream it would be unwise to believe such ever existed.\u003C/p\u003E\u003Cp\u003ECould an advanced civilisation have existed but left no trace? Highly unlikely.\u003C/p\u003E\u003Cp\u003EWould a civilisation not based on the fossil fuel economy advance with little trace? I think advancement would be unlikely. It is one thing to exploit renewable energy resources but ignoring the fact that such exploitation would leave behind tell tail deposits, how does one replace with wood all the advanced chemicals, plastics and resultant manufacturing processes enabled by fossil fuel? \u003C/p\u003E\u003Cp\u003EMy favourite video on the evidence for advanced ancient civilisations and possible alien intervention:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/j9w-i5oZqaQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003EEnjoy\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-06-01T23:54:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003ENot to mention that they actually written down that they were for the pharaos.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEgypt is pretty old, as in the pyramids was build 2000 years before the last Pharaohs. \u003C/p\u003E\u003Cp\u003EPyramids are pretty simple to build, main issue of building them large is logistic and cost. Yes you have some construction issues but some hundred year solved this. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Snefru%27s_Bent_Pyramid_in_Dahshur.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/File:Snefru%27s_Bent_Pyramid_in_Dahshur.jpg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-02T00:17:54Z","Content":"\n\u003Cp\u003EIn any case. Even if we had no idea how they were built or why it doesn\u0027t mean that we can substitute something else in. To do so is an argument from ignorance.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-06-02T00:22:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EAlcohol-burning internal combustion engines are another option. You just need fermenting plant mass and distillery to make plenty of fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWould work however you would need lots of farmland for it, run into the issue that you need highly efficient mechanical farming to get any output outside of curiosities. \u003C/p\u003E\u003Cp\u003EThey would be far better off staying with steam.\u003C/p\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2014-06-02T01:15:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003ESlavery, while widespread then, was not exactly providing an army of cheap labourers. A slave was quite expensive commodity, available in numbers only after succesful wars. Generally, they were NOT worked to death - because it was economically counterproductive. To replace 1 million of dead slaves, you would have to wage a huge war (or series of smaller ones) which is expensive in itself. Not to mention problems with population density \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Catching so many able-bodied men would be difficult in a time, when a city with 10 000 population was considered huge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s no wonder people think the pyramids were built by aliens if there\u0027s the kind of thinking everyone shares.\u003C/p\u003E\u003Cp\u003ESecondly there\u0027s nothing stating that 10 000 was considered a large city. At this point our knowledge of ancient civilizations is based on stories and ruins.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-06-02T01:23:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ecat\u0022 data-cite=\u0022ecat\u0022\u003E\u003Cdiv\u003EOT: No. There is no evidence for an advanced ancient civilisation, while it may be nice to dream it would be unwise to believe such ever existed.\u003Cp\u003ECould an advanced civilisation have existed but left no trace? Highly unlikely.\u003C/p\u003E\u003Cp\u003EWould a civilisation not based on the fossil fuel economy advance with little trace? I think advancement would be unlikely. It is one thing to exploit renewable energy resources but ignoring the fact that such exploitation would leave behind tell tail deposits, how does one replace with wood all the advanced chemicals, plastics and resultant manufacturing processes enabled by fossil fuel? \u003C/p\u003E\u003Cp\u003EMy favourite video on the evidence for advanced ancient civilisations and possible alien intervention:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/j9w-i5oZqaQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003EEnjoy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI want to sue you, you don\u0027t send a link to an very interesting three hour long movie to people who just came home late at night.\u003C/p\u003E\u003Cp\u003EAnd yes it was interesting, mostly the giant blocks in Lebanon. \u003C/p\u003E\u003Cp\u003EMore interesting, why has the guy using the saw in the preview picture an much more detailed hair than the guy with the statue.\u003C/p\u003E\u003Cp\u003EPerhaps the guy making the painting knew him.\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2014-06-02T01:27:00Z","Content":"\n\u003Cp\u003EIf you really want to get an archeologist to mutter and scowl ask them how the stones at Baalbek were moved or how the stones at Secsayhuaman were cut.\u003C/p\u003E\u003Cp\u003Elet\u0027s just say that some things that were once known have been lost\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-06-02T01:40:47Z","Content":"\n\u003Cp\u003EOf course no. There are no traces of such civilization, and there simply wasn\u0027t enough time for them to evolve, assuming we\u0027re talking about a species that emerged on Earth, and not some visitors that were settling here because of reasons.\u003C/p\u003E\u003Cp\u003EThe archaeological records undoubtedly support the current scientific consensus about the evolution of our species and civilization. There simply aren\u0027t any physical remnants of anyone more advanced than us and there would have to be. Some artificial materials degrade very slowly. Radioisotope distribution and composition in nature before explosion of Trinity were consistent and did not indicate of any artificial radioisotope production before that.\u003C/p\u003E\u003Cp\u003EAny civilization more advanced than us would leave such remnants.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EThey did. Have a look at the various Pyramids all aligned along an past equator line around the Earth.\u003Cp\u003EAlso most master builders will tell you even nowadays buildings like the Cheops pyramid are not buildable with this precision.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s bull****, times two. Not only they aren\u0027t aligned like that, but their precision is not stunning, and it can be replicated today. All they needed was enough people. You\u0027d be surprised what superstition and slavery are capable of. To them, pharaohs were live embodiments of deities. Living gods on Earth.\u003C/p\u003E\u003Cp\u003EI\u0027d suggest you to stop watching pseudoscientific shows and channels like History channel, and to learn stuff from proper sources.\u003C/p\u003E\n"}]}