{"TopicId":73820,"ForumId":44,"TopicTitle":"Do you believe in the existence of highly advanced ancient Earth civilization before?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-01T10:45:58Z","PageNum":6,"Articles":[{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-04T07:41:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat really is debatable.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat you\u0027re describing is how satellite nav is \u003Cem\u003Euseful\u003C/em\u003E. You\u0027re not describing how it\u0027s \u003Cem\u003Eessential\u003C/em\u003E. If all our satellites fell from the sky tomorrow we\u0027d adapt and continue advancing.\u003C/p\u003E\u003Cp\u003ESatnav is extremely useful, but we were pretty advanced before we had it, and only a subset of tasks would be hampered by it\u0027s absence going forward.\u003C/p\u003E\n"},{"CreatedByName":"DJEN","CreatedById":61378,"CreatedDateTime":"2014-06-04T07:48:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EIs there a justification for this belief?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is mere belief, with no evidence.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-06-04T07:56:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003ELink? I highly doubt such a navigation system would be accurate to within a few meters (down to centimetres depending on the sensitivity of your equipment), and be universally accessible around the world (with some very slight annoyances at the poles).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I wish. The only reason I know this even existed is because I snagged a device (nobody cared about it, I asked) from one of my old temp jobs. They specialized in gas resources, so I\u0027m guessing this was used for surveying. Basically looked like a big box (similar to a retro army radio) with a quartz screen and a huge retractable antenna. By the time I got around to playing with it, the old grid system was offline. \u003C/p\u003E\u003Cp\u003EI can\u0027t recall though if this system was international, or just limited to the USA. I\u0027ll have to see if I can find where I stashed the darned thing now. When I had it in my hand, I was able to find info about the \u0027grid\u0027 on Wikipedia, but that was a couple years ago. My memory is betraying me now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-04T07:59:55Z\u0022 title=\u002206/04/2014 07:59  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 4, 2014\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-06-04T08:08:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EYeah, I wish. The only reason I know this even existed is because I snagged a device (nobody cared about it, I asked) from one of my old temp jobs. They specialized in gas resources, so I\u0027m guessing this was used for surveying. Basically looked like a big box (similar to a retro army radio) with a quartz screen and a huge retractable antenna. By the time I got around to playing with it, the old grid system was offline. \u003Cp\u003EI can\u0027t recall though if this system was international, or just limited to the USA. I\u0027ll have to see if I can find where I stashed the darned thing now. When I had it in my hand, I was able to find info about the \u0027grid\u0027 on Wikipedia, but that was a couple years ago. My memory is betraying me now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou might be referring to Omega:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Omega_%28navigation_system%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Omega_%28navigation_system%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-04T08:12:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EYou might be referring to Omega:\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Omega_%28navigation_system%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Omega_%28navigation_system%29\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s also a lot of RF navigational infrastructure still used by aircraft (VORTACs, etc).\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-06-04T08:15:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EYou might be referring to Omega: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Omega_%28navigation_system%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Omega_%28navigation_system%29\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, that\u0027s it. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-06-04T10:31:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EYou might be referring to Omega:\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Omega_%28navigation_system%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Omega_%28navigation_system%29\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuick scan of that page reads that the accuracy of Omega was around 1-4 km. That\u0027s...quite paltry in comparison to the accuracy achieved by GPS using a high-quality receiver.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EThere\u0027s also a lot of RF navigational infrastructure still used by aircraft (VORTACs, etc).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue enough, though GPS has supplanted a lot of it in civil aviation. Used to be that planes would use those transmitters to stay in certain flight paths so as to not run into each other. Now its far more common to just fly GPS direct and use VOR stations for management in an airport\u0027s local airspace.\u003C/p\u003E\u003Cp\u003EBesides, unless I\u0027m mistaken, VOR can\u0027t give you positional data on your aircraft, only rough directional data on what bearing the transmitter is. Certainly not accurate enough (if it could; I suppose you could try to triangulate your position from two or three stations) for use in our (somewhat frighteningly) congested airspace.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-06-04T10:41:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EUhhhh, no. Go back, read the posts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had read the posts. Explain to me how GPS being based on relativity implies that we can\u0027t substitute that with radio towers.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-04T10:55:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003ENow its far more common to just fly GPS direct and use VOR stations for management in an airport\u0027s local airspace.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrictly speaking they use inertial with periodic updates from GPS. \u003C/p\u003E\u003Cp\u003EYou do get some folks flying light aircraft straight off GPS under VFR. I\u0027ve seen cropdusters with rows of lights on the engine cowl giving the pilot steering queues. They just fly around the perimeter of the field, plug in swath width and the GPS system does all the rest. Impressive stuff.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-04T10:58:42Z\u0022 title=\u002206/04/2014 10:58  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 4, 2014\u003C/time\u003E by Seret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-06-04T11:16:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZetaX\u0022 data-cite=\u0022ZetaX\u0022\u003E\u003Cdiv\u003EI had read the posts. Explain to me how GPS being based on relativity implies that we can\u0027t substitute that with radio towers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh dear. Okay, I\u0027ll take you through it step-by-step. First, Dodgey says this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003ETrue they don\u0027t have to be space faring but it makes sense. Think about our GPS system. Our communication system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee, right there? GPS system.\u003C/p\u003E\u003Cp\u003EThen NASAFanboy, quoting the above from Dodgey, says:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EWho said they have to be in space?\u003Cp\u003EWho said they would span the globe?\u003C/p\u003E\u003Cp\u003ELarge networks of radio towers and underground cables can do the job too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen I say, responding specifically to the last line, concluding that NASAFanboy is suggesting that GPS can be done with merely radio towers and underground cables, say this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EGPS exists because we understand relativity and have satellites, period. You can\u0027t replace that with radio towers and underground cables.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo first off, that\u0027s not a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Non_sequitur_%28logic%29\u0022 rel=\u0022external nofollow\u0022\u003Enon sequitur\u003C/a\u003E as you suggested. What I said indeed does follow from those posts before.\u003C/p\u003E\u003Cp\u003ESpecifically in reference to the accuracy of GPS, without general relativity we could not turn the different timings of the signals coming from three satellites into accurate positional data. If you attempted to do so, you would inevitably get erroneous results because you wouldn\u0027t be taking into account the slight variance in the passage of time between your frame of reference and those of the satellites.\u003C/p\u003E\u003Cp\u003ESome reading: \u003Ca href=\u0022http://www.astronomy.ohio-state.edu/~pogge/Ast162/Unit5/gps.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.astronomy.ohio-state.edu/~pogge/Ast162/Unit5/gps.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUnderground cables are out for the rather obvious reason that they do not create a signal, so you have nothing with which to triangulate your position. Radio towers are, by their nature, limited in range because they are on earth. At the very least they are bound by the necessity to create a taller tower the more range you require. To replace the GPS system with radio towers would require, for one, exceptionally accurate receivers and a vast network of towers, if your goal is to cover the globe. We\u0027re talking build-islands-in-the-ocean kind of vast. So perhaps it isn\u0027t entirely impossible, but again, I seriously doubt that you would get anywhere close to the same accuracy, to say nothing of the complexity of such a network and the mess it would leave behind had it been created by some sort of advanced civilization. O.o\u003C/p\u003E\u003Cp\u003EAnd, after all the work, you still wouldn\u0027t get the same accuracy without nanosecond precision. Find me some super-advanced civilization that did this on Earth and I\u0027ll eat my hat.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EStrictly speaking they use inertial with periodic updates from GPS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh true enough. Inertial navigation systems are annoyingly bad without those updates though, with compounding errors as they move that eventually add-up to them being useless if not corrected. Handy for if/when you lose sight of the GPS sats though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-04T11:24:37Z\u0022 title=\u002206/04/2014 11:24  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 4, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-04T11:37:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EInertial navigation systems are annoyingly bad without those updates though, with compounding errors as they move that eventually add-up to them being useless if not corrected. Handy for if/when you lose sight of the GPS sats though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re actually a bit more useful than that. They provide a lot more data than GPS (such as the aircraft\u0027s attitude and exact velocity) and it\u0027s continuous rather than discrete, so can generate things like HUD symbology. But yes, dead reckoning does need a kick in the pants periodically to stay in communion with reality.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-06-04T11:58:51Z","Content":"\n\u003Cp\u003Ephoenix_ca, would you seriously make the claim that we didn\u0027t have an \u0027advanced civilisation\u0027 before the activation of the GPS network? If not, how is any of this relevant to the thread?\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-06-04T11:59:05Z","Content":"\n\u003Cp\u003EWhen pesants of the middle ages toiled in the shadows of the roman aquiducts, there was ample evidence of an advanced prior civilization.\u003C/p\u003E\u003Cp\u003EWe passed that point ages ago.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-04T12:39:24Z","Content":"\n\u003Cp\u003EWhile underground cables have the advantage with bandwidth, the cost and versatility doesn\u0027t even come close to what satellites can do. Telegraph doesn\u0027t even compare to the complexity and cost of a modern fiber optic system.\u003C/p\u003E\u003Cp\u003EKryten, the point is about space travel. If there was an advanced civilisation why aren\u0027t any of their satellites in orbit. Someone asked why they needed them, we said for GPS and communication. Someone argued that we didn\u0027t need satellites for GPS and communication. That\u0027s what phoenix_ca was refuting.\u003C/p\u003E\u003Cp\u003EMay I remind you all that we haven\u0027t even mentioned military applications or weather predictions. As well as the curiosity that the prevalent in humanity.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-06-04T13:26:25Z","Content":"\n\u003Cp\u003EAlso only because we pollute every space we conquer does not mean other\u0027s do the same. There could have been a civilization that took all their trash with them, now argue that.\u003C/p\u003E\u003Cp\u003EOnly beacause we are the cancer of this world does not mean everybody has to be.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-06-04T13:27:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EIf there was an advanced civilisation why aren\u0027t any of their satellites in orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas mid-20th century civilisation not \u0022advanced\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-04T15:18:20Z","Content":"\n\u003Cp\u003E@gpisic: I agree with you.\u003C/p\u003E\u003Cp\u003EAnd to answer the original question: yes I believe one, or more, civilization(s) have existed before and may be even still very alive (the one we called \u0022extraterrestrial\u0022 or a part of them).\u003C/p\u003E\u003Cp\u003E1st: simple maths, oldest human being like remains have been dated back to 4.5 millions years old, it\u0027s quite old, considering \u0022our\u0022 current civilization could be back dated to cave-men (a few 100 000 years ONLY). It\u0027s not so crazy to believe some human beings have already evolve long time ago (even after 1 million years), in only 100000 years, they could reach some technologies, then for one reason or another, they \u0022died\u0022, so in more than 3 millions years under various climates changes, geological and cosmic events and natural erosion, many or all of theirs creations and legacy have disappeared for good.\u003C/p\u003E\u003Cp\u003E2nd: various testimonies from a remote past still exists but they can\u0027t be strictly dated (C-14 dating can only be use of organisms and only for those younger than ~ 50 000 years, other methods are also not precise), and many of them shows very strange and unexplained design and purpose like Central and South America\u0027s pyramids and others. Even more strange is the fact no known technologies today can either be use to built such kind of constructions !\u003C/p\u003E\u003Cp\u003E(except the undisclosed method use by the builder of Coral Castle, Edward Leedskalnin).\u003C/p\u003E\u003Cp\u003EAlso, we tend to forgot how our civilization has evolve due to some critical choices \u0022made\u0022 during its history, think about it: fire, language, gun powder, wheels, religion, money and stupidity in random order \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, have forged all civilization. Modern trains and cars width have been set according to the old roman\u0027s pavestone road width made for horse powered chariot ! And basically: fire \u002B powder \u002B some geometry and physics lead to current rocket science.\u003C/p\u003E\u003Cp\u003EWhat if the powder has never been invented ? Or not use the same way ?\u003C/p\u003E\u003Cp\u003EI also watch the show (mysterious cities of gold) long ago and it looks like it is based upon old accounts from indian epic MahÃƒÂ¢bhÃƒÂ¢rata which also talk about things some people have interpreted to be nuclear weapons.\u003C/p\u003E\u003Cp\u003EFor interested people, I recommend Ancient Aliens, some conclusions are a bit too easy and too fast, but facts can\u0027t be denied (ancient texts and buildings for example).\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-06-04T15:32:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EWas mid-20th century civilisation not \u0022advanced\u0022?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProblem with advanced civilization is that you can put the bar wherever you want, I put it as faster than light travel and say no. \u003C/p\u003E\u003Cp\u003EIndustrial civilization is easier to define, and its over 150 year old. \u003C/p\u003E\u003Cp\u003ENow an previous industrial civilization has more problems than traces like waste or empty mines, its the knowledge, very unlikely that people will forget useful things like guns or steam engines, this hits simpler stuff like iron, writing or the wheel, they got copied fast people also trade a lot so hard to be too isolated. \u003C/p\u003E\u003Cp\u003EFor some civilization before humans, something local might not be found, however this also require that we don\u0027t find traces of the species leading up the the intelligent one, this too is very unlikely.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2014-06-04T15:58:40Z","Content":"\n\u003Cp\u003EHow on earth does this not fall into the banned conspericy theory talk... this is the most rediculous thing I\u0027ve seen posted here.\u003C/p\u003E\u003Cp\u003EOccam\u0027s Razor, look it up.\u003C/p\u003E\u003Cp\u003EYou\u0027re suggesting the ancient civilization and expecting people to accept it if they can\u0027t prove it didn\u0027t exist, the world and science don\u0027t work that way. \u003C/p\u003E\u003Cp\u003EYou have the outlandish claim proof it\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-06-04T16:02:25Z","Content":"\n\u003Cp\u003ENo matter how unlikely something is it should be considered to be the truth because unlikely is not impossible. As long as someone can\u0027t proof something right or wrong every theory is valid.\u003C/p\u003E\u003Cp\u003ETo win in the lottery is very unlikely yet there is an winner almost every week.\u003C/p\u003E\u003Cp\u003ETo call someone advanced is not a matter of putting a bar somewhere. It is more a matter of perspective. For some native tribe our civilization could be something very uncivilized because we do not live in harmony with the nature. For them our efforts could mean nothing then destruction. Also we could learn stuff from them (to live in harmony with nature).\u003C/p\u003E\u003Cp\u003EWe think of our selfes that we are soooo civilized still countries have wars and people die.\u003C/p\u003E\u003Cp\u003EGreat great Civilization.\u003C/p\u003E\u003Cp\u003EYou see, just a matter of perspective.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-06-04T16:22:31Z","Content":"\n\u003Cp\u003EThere is a difference between hypotheses that is outright wrong, and ones that, while extremely unlikely, cannot be proven wrong. This discussion of ancient advanced civilizations are the latter.\u003C/p\u003E\u003Cp\u003EI\u0027ll give you a different example: There may be aliens on Mars. The possibility is still there. However, recent discoveries by several spacecrafts have observed that there are no signs that life has developed there. Would you, among all this facts, confidently claim that there are living aliens on Mars, on the sole basis of the very-unlikely chance that there actually are?\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-06-04T16:25:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003ENo matter how unlikely something is it should be considered to be the truth because unlikely is not impossible. As long as someone can\u0027t proof something right or wrong every theory is valid.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it should be considered speculation. To be considered valid, a hypothesis needs evidence.\u003C/p\u003E\u003Cp\u003EI can speculate that there are pink unicorns flying around in teapots on Pluto. I have zero evidence, it is unlikely, but it is not impossible. \u003C/p\u003E\u003Cp\u003EHowever, nobody will accept to take my theory into consideration, and rightly so, because it is mere speculation. Just like your ancient civilization.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-06-04T16:45:27Z","Content":"\n\u003Cp\u003EClose this thread pls.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-06-04T17:29:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ENo, it should be considered speculation. To be considered valid, a hypothesis needs evidence.\u003Cp\u003EI can speculate that there are pink unicorns flying around in teapots on Pluto. I have zero evidence, it is unlikely, but it is not impossible. \u003C/p\u003E\u003Cp\u003EHowever, nobody will accept to take my theory into consideration, and rightly so, because it is mere speculation. Just like your ancient civilization.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do not know to which speculation you are referring to. Pyramids, the monuments in the Peru highland, the gigantic heads in the easter islands and many more are hard evidence. You want to tell me now they are not relevant or what?\u003C/p\u003E\u003Cp\u003EAnd you want to tell me that we perfectly know how all this was build by some cave people with stone tools? Please do not ridicule yourself.\u003C/p\u003E\u003Cp\u003EThe only difference in my hypothesis from the established theory is that i claim that these buildings where built much earlier and for a different purpose yet you say my speculation is the same as believing in pink unicorns?\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-06-04T17:40:53Z","Content":"\n\u003Cp\u003EYour hypothesis revolves around the idea of why and how these buildings were built. The existence and composition of said buildings does not provide enough evidence to support said hypothesis.\u003C/p\u003E\n"}]}