{"TopicId":73893,"ForumId":34,"TopicTitle":"ModStatistics 1.0.3 - Anonymous mod usage statistics - Now for public distribution!","CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-02T05:02:45Z","PageNum":2,"Articles":[{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-06-02T20:15:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JewelShisen\u0022 data-cite=\u0022JewelShisen\u0022\u003E\u003Cdiv\u003EBecause as it is designed now, the plugin sends the info each time KSP closes. Also no personal info is ever needed or collected.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat doesn\u0027t explain how you find the \u0022common link\u0022...?\u003C/p\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2014-06-02T20:16:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EThat doesn\u0027t explain how you find the \u0022common link\u0022...?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes everybody have Mod X? If that is the only mod in common then there is the problem. If they have three mods in common then it is one of the three. It is a simple matter of just looking through and doing a compare.\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-06-02T20:27:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JewelShisen\u0022 data-cite=\u0022JewelShisen\u0022\u003E\u003Cdiv\u003EDoes everybody have Mod X? If that is the only mod in common then there is the problem. If they have three mods in common then it is one of the three. It is a simple matter of just looking through and doing a compare.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would people who are having a problem show up in your reports at all? They\u0027re going to uninstall your mod and you have no way to track them when they\u0027re gone.\u003C/p\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2014-06-02T20:39:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EWhy would people who are having a problem show up in your reports at all? They\u0027re going to uninstall your mod and you have no way to track them when they\u0027re gone.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou assume that they will uninstall the mod the moment they find any issues at all and that simply isn\u0027t the case. Besides while this will still report usage even if you only have it once it is mostly made for tracking the usage by players that KEEP it installed. That was my point originally when I mentioned using this to see if my users also use FAR.\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-06-02T20:51:48Z","Content":"\n\u003Cp\u003EAt the moment we don\u0027t really know anything about what users have installed other than what gets downloaded (and that can be hard to know based on the varying quality of download hosting options.) We also don\u0027t know what errors users are having other than what gets reported on forums / github / similar. Something that automates the gathering and presentation of data in either of these areas would be a step forward, and I commend Majiir for taking one such step. I am looking forward to see what else others have to contribute in this area beyond just criticism.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-02T20:59:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EI can picture a twinkle in your eye as you write that. We both know the average user.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUh? The average user probably won\u0027t care, if that\u0027s what you mean. There\u0027s nothing sinister here. Again I ask: Which collected data do you object to?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EDownload tracking can and does get you this information, if you have an accurate counter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt turns out it doesn\u0027t. With restricted redistribution, download counts give a reasonable upper bound, but it says nothing about how many people actually use the mod. What percentage of players update within a week of release? How many times on average does a user download the mod? Is it the same userbase, or is there a lot of churn? Usage stats combined with download stats can answer a lot of these questions, but download stats alone don\u0027t say much. (I have raw server logs for a number of mods, including some I didn\u0027t author. They\u0027re nice to have, but not as useful as you\u0027d think.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EWriting a plugin like this but saying that the most obvious, useful function that plugin could do is \u003Cem\u003Esomehow not in its scope\u003C/em\u003E is silly and makes the real reason obvious.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EErm, what? It\u0027s a \u003Cem\u003Eusage statistics mod\u003C/em\u003E. You\u0027re asking it to be an error reporting mod. You might as well ask me to make Kethane an autopilot. There is nothing special or hard about gathering a list of installed plugins; if you want, go ahead and make an error reporting tool. That\u0027s just not what this project is about.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EMy opinion is that you need to consider some way to make it useful to the user.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Gosh, my game is crashing a lot. Why don\u0027t I check the stats site and see which of my mods has a high crash rate?\u0022 It\u0027s not very useful for a user to see his \u003Cem\u003Eown\u003C/em\u003E data for a single session, but aggregate statistics (for a single user or the entire population) can provide insight. Have you not seen the \u003Cem\u003Ehundreds\u003C/em\u003E of forum threads and Reddit posts titled \u0022what are some popular mods I should download?\u0022 It would be nice to have some real data to answer that question. What \u003Cem\u003Eare\u003C/em\u003E the most popular mods? Kethane and KAS? Interstellar and B9? MechJeb and KER? What mods cause loading time to increase? What mods do people tend to try for a minute and then immediately uninstall? What mods do people play with for hours on end? Are there mods that people leave running overnight? (Could be a bad thing!)\u003C/p\u003E\u003Cp\u003EThis plugin can be useful for a lot of people in a lot of different ways. There are a lot of ways in which it can be improved; I just coded it \u003Cem\u003Eyesterday\u003C/em\u003E. You don\u0027t see the value? Fine, but please don\u0027t spam my thread just because you aren\u0027t satisfied by the many good answers already given.\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-06-02T21:39:57Z","Content":"\n\u003Cp\u003ESorry, I didn\u0027t mean to imply anything sinister. Text can make things sound different than what was meant. Getting users to read instructions can be challenging as I\u0027m sure you know\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EErm, what? It\u0027s a \u003Cem\u003Eusage statistics mod\u003C/em\u003E. You\u0027re asking it to be an error reporting mod. You might as well ask me to make Kethane an autopilot. \u003C/div\u003E\u003C/blockquote\u003EWell, the actual meat of the mod is little more than a few handfuls of code. Loop through the various loaded assemblies, get their versions, and then use whatever you\u0027re using to serialize it and send it out. I figured since the error reporting would be so similar and related that it\u0027d just make sense to roll it in there too rather than to make an entire second framework where most of that code is going to end up duplicated. \u0022Error reporting\u0022 and \u0022usage statistics\u0022 are closely related in my mind; that\u0027s typically what tools like this do. But you\u0027re right, it\u0027s your mod and I\u0027m sorry\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E\u0022Gosh, my game is crashing a lot. Why don\u0027t I check the stats site and see which of my mods has a high crash rate?\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would be error reporting, apparently a separate and unrelated mod...? This is exactly the kind of thing I\u0027m trying to talk you into adding, so I don\u0027t understand if this was sarcastic or what. I\u0027ll stay out of your thread if my feedback is unwanted\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-02T21:45:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EThat would be error reporting, apparently a separate and unrelated mod...? This is exactly the kind of thing I\u0027m trying to talk you into adding, so I don\u0027t understand if this was sarcastic or what.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECrash reporting is relatively easy to fit into the stats regime, mainly because it\u0027s a necessary feature. (Stats are collected when the game closes, but if it crashes instead, we need to detect that and report on the session as far as it got.) The problem with error reporting in a more general sense is that it vastly complicates the privacy issue. I don\u0027t want to have the mod send any data that could potentially include personal information, and error logs certainly could.\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2014-06-03T09:32:30Z","Content":"\n\u003Cp\u003EYes but error logs don\u0027t have to be submitted automatically. Just show the user the data and let him press \u0022Send this stuff\u0022. At least from a legal pov this should be safe? Maybe with some flag to only \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003ELoop through the various loaded assemblies, get their versions, [..] \u0022Error reporting\u0022 and \u0022usage statistics\u0022 are closely related in my mind; that\u0027s typically what tools like this do.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMost assemblies don\u0027t have a version info embedded, so you might have to do ugly stuff like generating a file hash and resolving that from your database. Also error reporting has a bunch of other difficulties, especially preventing spam of known reports or resolved issues. It would extend this project by a lot and would require constant effort to maintain the project and while it would be awesome, i can understand that Majiir doesn\u0027t want that.\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-06-03T18:19:01Z","Content":"\n\u003Cp\u003EI wasn\u0027t thinking automatic reports, more just a way for a user to quickly and easily upload their depersonalized log and a short message describing the problem.\u003C/p\u003E\u003Cp\u003ERe:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Faark\u0022 data-cite=\u0022Faark\u0022\u003E\u003Cdiv\u003EMost assemblies don\u0027t have a version info embedded, so you might have to do ugly stuff like generating a file hash and resolving that from your database.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought this\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EList of plugins detected and their versions\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eindicated that version info was included already. That\u0027s why not having any way for the user to upload a log is so frustrating to me; I thought about 95% of the work was already done. You could copy-paste the entire project, add about 30 lines and for the cost of storing some logs on the server for a day have a very useful, widely desirable debugging utility for modders to distribute with all of their mods.\u003C/p\u003E\u003Cp\u003EAnyway, won\u0027t cloud the thread any more\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-03T18:27:20Z","Content":"\n\u003Cp\u003EI just think of a good use to this plug-in Majiir and others, as people talks about necro \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81712-prevent-necros?goto=newpost\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E, stats allow modders to know some people still have a real interest in their work and may push them to keep their mods alive and updated. As I guess anyone will be more please to spend time on something people actually use than on something on one even know about it.\u003C/p\u003E\u003Cp\u003EBut for such purpose, again, your plug-in needs to know exactly parts use, and how much they are used, not just a subdir of GameData dir is there. Which also allow modder to know which part to take care of in a big set (example: if one engine in KWRocketry or NovaPunch is very appreciated, and one is almost never use, if both have issues, priorities comes by themselves)\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-03T21:12:53Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EModStatistics 0.0.2 has been released. The download link in the \u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81764-ModStatistics-0-0-1-Anonymous-mod-usage-statistics-Beta-release-seeking-testers?p=1189593\u0026amp;viewfull=1#post1189593\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Efirst post\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E has been updated.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis is another beta release. Changes were primarily related to the reporting format. The plugin now has a dependency which is packaged with the mod; I\u0027m interested to see how this fares on various platforms.\u003C/p\u003E\u003Cp\u003EChanges in this version:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EReports are now sent as JSON instead of XML.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EScene times are sent ordered by the GameScenes enumeration. This acts to hide the order in which the user entered scenes.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe current time is now only sampled once during scene switches. This makes scene timers slightly more accurate.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-03T21:47:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EI thought this (\u0022List of plugins detected and their versions\u0022) indicated that version info was included already. That\u0027s why not having any way for the user to upload a log is so frustrating to me; I thought about 95% of the work was already done. You could copy-paste the entire project, add about 30 lines and for the cost of storing some logs on the server for a day have a very useful, widely desirable debugging utility for modders to distribute with all of their mods.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s true that version information is included, but getting versions is basically a one-liner (assuming the file version is correct, which it almost never is):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EAssemblyLoader.loadedAssemblies.Skip(1).Select(a =\u0026gt; a.name \u002B \u0022 \u0022 \u002B assembly.assembly.GetName().Version);\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf someone needs a server to run an error reporting service, they\u0027re free to get in touch with me. I don\u0027t think error reporting is in the scope of this project. I\u0027m not writing an error reporting mod. If there\u0027s some context in which reporting errors becomes easy or useful from a statistics point of view, I\u0027ll consider it.\u003C/p\u003E\u003Cp\u003EIt seems you\u0027re frustrated because this is \u0022almost\u0022 what you\u0027re looking for, but I think you\u0027re off in that estimation. Besides, if that\u0027s really the case, then it shouldn\u0027t take anyone more than an hour or so to put together what you want. I\u0027d head to the requests forum.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003EBut for such purpose, again, your plug-in needs to know exactly parts use, and how much they are used, not just a subdir of GameData dir is there. Which also allow modder to know which part to take care of in a big set (example: if one engine in KWRocketry or NovaPunch is very appreciated, and one is almost never use, if both have issues, priorities comes by themselves)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m working on a configuration and plugins system that will allow modders to customize how ModStatistics reports certain things. I\u0027ll also be considering part usage, but that could very well become a plugin to ModStatistics rather than a full-fledged component of it, at least at first.\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2014-06-04T07:20:25Z","Content":"\n\u003Cp\u003EMajiir wants a post to segregate his posts so they don\u0027t molest eachother, therefore everybody go test the thing I made and tell me how broken it is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79175-Virgin-Kalactic-Responsive-Fuel-Burning-Generator-and-RequestResource%28%29-upgrade\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/79175-Virgin-Kalactic-Responsive-Fuel-Burning-Generator-and-RequestResource%28%29-upgrade\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-04T07:37:23Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EModStatistics 0.0.3 has been released. The download link in the \u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81764-ModStatistics-0-0-1-Anonymous-mod-usage-statistics-Beta-release-seeking-testers?p=1189593\u0026amp;viewfull=1#post1189593\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003Efirst post\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E has been updated.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis is another beta release. Note that reports generated by prior versions are no longer accepted by the server. That said, the server can now properly parse and validate reports, so data collected with this version can be analyzed. I\u0027ll be working on a simple website to serve as proof of concept. The plugin still needs some work, but I\u0027d like to see how the whole system works before I develop it much more.\u003C/p\u003E\u003Cp\u003EChanges in this version:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECrashes are now detected, and reports for the crashed session are sent at the next start. Crash reports send the same information as normal ones, but they indicate that a crash occurred.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESeveral changes were made to the report format to make reports easier to parse, validate and process on the server.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFixed a minor discrepancy in how report end times are generated.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded assembly version to the user agent string.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2014-06-04T07:44:58Z","Content":"\n\u003Cp\u003EI feel that with this new version my anonymously reported nonidentifiable usage statistics reports are more secure than ever before.\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-06-04T08:32:14Z","Content":"\n\u003Cp\u003EI just updated to v0.0.3 and KSP hung on loading with module manager going bonkers on loading, logging:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ENullReferenceException: Object reference not set to an instance of an object\u003Cbr\u003E  at UrlDir\u002B.MoveNext () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at ModuleManager.ConfigManager.Update () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Erepeatedly.\u003C/p\u003E\u003Cp\u003ECould it be that ModuleManager is trying to parse the .cfg file for ModStatistics and getting into a mess?\u003C/p\u003E\u003Cp\u003EUpdate:\u003C/p\u003E\u003Cp\u003EJust so you know the attempt to load it worked. I have noticed in the past that an empty (or empty other than comments) .cfg file can cause module manager to get upset. Perhaps having added the id to the cfg file, it was then able to start the second time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-04T08:37:25Z\u0022 title=\u002206/04/2014 08:37  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 4, 2014\u003C/time\u003E by codepoet\u003C/strong\u003E\n\u003Cbr\u003Eadded update\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-06-04T08:34:46Z","Content":"\n\u003Cp\u003EI remember having problems with that exact issue in my IRC plugin. It\u0027s probably best to rename the config file.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-04T09:23:35Z\u0022 title=\u002206/04/2014 09:23  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 4, 2014\u003C/time\u003E by blizzy78\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-04T09:18:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022codepoet\u0022 data-cite=\u0022codepoet\u0022\u003E\u003Cdiv\u003EI just updated to v0.0.3 and KSP hung on loading with module manager going bonkers on loading, logging:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ENullReferenceException: Object reference not set to an instance of an object\u003Cbr\u003E  at UrlDir\u002B.MoveNext () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E  at ModuleManager.ConfigManager.Update () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Erepeatedly.\u003C/p\u003E\u003Cp\u003ECould it be that ModuleManager is trying to parse the .cfg file for ModStatistics and getting into a mess?\u003C/p\u003E\u003Cp\u003EUpdate:\u003C/p\u003E\u003Cp\u003EJust so you know the attempt to load it worked. I have noticed in the past that an empty (or empty other than comments) .cfg file can cause module manager to get upset. Perhaps having added the id to the cfg file, it was then able to start the second time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have had the same* issue the first time I launch KSP (0.23), but the first exception comes from Active Texture Management mod., Second run was ok.\u003C/p\u003E\u003Cp\u003E* except it is ModuleManager.ConfigManager.OnGUI ()\u003C/p\u003E\u003Cp\u003Ein my case.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-04T09:21:57Z\u0022 title=\u002206/04/2014 09:21  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 4, 2014\u003C/time\u003E by Justin Kerbice\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-04T18:25:24Z","Content":"\n\u003Cp\u003EThanks for the (bug) report. I\u0027ve sorted out a few issues with server parsing as well. Some of you probably have unsent reports stacked up, so those should be coming in soon. (The server was incorrectly rejecting them before.)\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-06-04T19:28:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003EI have had the same* issue the first time I launch KSP (0.23), but the first exception comes from Active Texture Management mod., Second run was ok.\u003Cp\u003E* except it is ModuleManager.ConfigManager.OnGUI ()\u003C/p\u003E\u003Cp\u003Ein my case.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESurely the ultimate solution though is for a change to ModuleManager to make it handle .cfg files with no contents. (I had the problem myself with CLS trying to ship a blank .cfg file to remove config that had shipped with a previous version and was now obsolete.)\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-04T23:51:47Z","Content":"\n\u003Cp\u003EOkay, some basic stats are up!\u003C/p\u003E\u003Cp\u003EBy plugin name: \u003Ca href=\u0022http://stats.majiir.net/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://stats.majiir.net/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBy plugin folder: \u003Ca href=\u0022http://stats.majiir.net/folders\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://stats.majiir.net/folders\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENeither of these gives a very good picture, so I\u0027m still thinking about how to best categorize plugins. This is mostly a test to make sure the data is structured well for querying. I\u0027ll probably have to change (again) how scene times are reported, but everything else seems fine.\u003C/p\u003E\u003Cp\u003EI\u0027ll be adding various tables as I go, but let me know if there\u0027s anything in particular you\u0027d like to see.\u003C/p\u003E\u003Cp\u003E[EDIT] And here\u0027s crash info: \u003Ca href=\u0022http://stats.majiir.net/crashes\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://stats.majiir.net/crashes\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E[EDIT 2] And here\u0027s average total loading time: \u003Ca href=\u0022http://stats.majiir.net/loading\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://stats.majiir.net/loading\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo it turns out computing statistics is hard. Some of the more complex analysis will have to wait, especially because it\u0027s hard to work with such a small data set. I\u0027m still not sure how to approach the mod categorization issue, so I\u0027m still operating under the (flawed) assumption that plugins correspond to mods. The queries will work fine once that changes anyway.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-05T04:19:48Z\u0022 title=\u002206/05/2014 04:19  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 5, 2014\u003C/time\u003E by Majiir\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2014-06-05T04:16:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EOkay, some basic stats are up!\u003Cp\u003EBy plugin name: \u003Ca href=\u0022http://stats.majiir.net/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://stats.majiir.net/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBy plugin folder: \u003Ca href=\u0022http://stats.majiir.net/folders\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://stats.majiir.net/folders\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENeither of these gives a very good picture, so I\u0027m still thinking about how to best categorize plugins. This is mostly a test to make sure the data is structured well for querying. I\u0027ll probably have to change (again) how scene times are reported, but everything else seems fine.\u003C/p\u003E\u003Cp\u003EI\u0027ll be adding various tables as I go, but let me know if there\u0027s anything in particular you\u0027d like to see.\u003C/p\u003E\u003Cp\u003E[EDIT] And here\u0027s crash info: \u003Ca href=\u0022http://stats.majiir.net/crashes\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://stats.majiir.net/crashes\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome that so far I only have a single crash listed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Can I start spreading this among my user base yet and is there a way that mod authors can get access to see what our users are also using with our mods?\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-06-05T04:42:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JewelShisen\u0022 data-cite=\u0022JewelShisen\u0022\u003E\u003Cdiv\u003EAwesome that so far I only have a single crash listed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Can I start spreading this among my user base yet and is there a way that mod authors can get access to see what our users are also using with our mods?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d rather not put the current version into the wild. It has a few issues and limitations. I could possibly have the next version ready for a first run with the public (although I might code in an expiration date so it doesn\u0027t cause problems too far into the future).\u003C/p\u003E\u003Cp\u003ERight now the only available information is what\u0027s on the site, but that will change daily. \u0022This mod commonly goes with\u0022 is something that will be public. There \u003Cem\u003Emight\u003C/em\u003E be stats available for author\u0027s viewing only, but I\u0027m trying to keep all the stats as innocuous as possible, so there shouldn\u0027t be any need to lock certain information down.\u003C/p\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2014-06-05T05:18:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EI\u0027d rather not put the current version into the wild. It has a few issues and limitations. I could possibly have the next version ready for a first run with the public (although I might code in an expiration date so it doesn\u0027t cause problems too far into the future).\u003Cp\u003ERight now the only available information is what\u0027s on the site, but that will change daily. \u0022This mod commonly goes with\u0022 is something that will be public. There \u003Cem\u003Emight\u003C/em\u003E be stats available for author\u0027s viewing only, but I\u0027m trying to keep all the stats as innocuous as possible, so there shouldn\u0027t be any need to lock certain information down.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome. Perhaps just let authors see the crash data as they are the only ones who really need it?\u003C/p\u003E\n"}]}