{"TopicId":74143,"ForumId":55,"TopicTitle":"Recovery/Reusability Ideas","CreatedByName":"marshrover","CreatedById":112197,"CreatedDateTime":"2014-06-04T21:33:25Z","PageNum":1,"Articles":[{"CreatedByName":"marshrover","CreatedById":112197,"CreatedDateTime":"2014-06-04T21:33:25Z","Content":"\n\u003Cp\u003EI\u0027ve thought of some ideas for recovery functionality, here they are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cbr\u003E[*=1]When you recover vessel a dialog pops up asking you whether you want to throw it away or send it to the \u0027Refurbishing hangar\u0027 \u003Cbr\u003E[*=1]The Refurbishing Hangar is a new Space Center building. \u003Cbr\u003E[*=1]In it you can refuel fuel tanks and SRBs, repack chutes, and repair damage for a small amount of money. \u003Cbr\u003E[*=1]Once refurbished the craft can either be set to its Pre-Recovery position or to the Launchpad/Runway. \u003Cbr\u003E[*=1]The further away the craft is being recovered from/sent to the more it costs.\u003Cbr\u003E[*=1]Repairing damage means that all the parts decoupled/broken are visible as transparent objects and can be replaced by clicking on them.\u003Cbr\u003E[*=1]Also there is a button that lets you replace all broken/decoupled parts. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-05T08:45:48Z\u0022 title=\u002206/05/2014 08:45  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 5, 2014\u003C/time\u003E by marshrover\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-06-04T21:41:41Z","Content":"\n\u003Cp\u003ESounds pretty good. Another option should be to add a new payload, which will briefly put you in the SPH to connect it.\u003C/p\u003E\n"},{"CreatedByName":"marshrover","CreatedById":112197,"CreatedDateTime":"2014-06-05T08:46:51Z","Content":"\n\u003Cp\u003ESee OP for more info on repairing.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-05T08:56:02Z","Content":"\n\u003Cp\u003ESounds pretty complicated and from financial point of view does not accomplish more than (partial) refund on all recoveded parts and full refund on any recovered fuel.\u003C/p\u003E\u003Cp\u003EIf there are any refunds on recovery, I believe there should be equal refunds on any parts you let disappear in Kerbin\u0027s atmosphere (such as spent stages).\u003C/p\u003E\n"}]}