{"TopicId":74160,"ForumId":16,"TopicTitle":"Redezvous in Solar Orbit","CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-05T00:34:49Z","PageNum":1,"Articles":[{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-05T00:34:49Z","Content":"\n\u003Cp\u003EI\u0027m about to rescue an astronaut stranded in solar orbit. He is orbit crosses the Keribin orbit but has a higher periapsis. Now I can do a Kerbin escape when the planet is at the point where the orbit crosses and do an ordinary rendezvous. (set the target, look for the closest approach, burn to improve it, etc.) But I was reading stuff about interplanetary transfers and it sounds like its is possible to have a faster and more efficient path. However, everything I read is about going from one circular orbit to another circular orbit, not going from a circular orbit to a similar elliptical orbit. Anyone know where I can find info on that?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-07T09:31:20Z\u0022 title=\u002206/07/2014 09:31  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 7, 2014\u003C/time\u003E by davidpsummers\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-06-05T02:19:20Z","Content":"\n\u003Cp\u003EScreenshoot help explain the situation.\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-05T06:37:03Z","Content":"\n\u003Cp\u003EOK, here is a link to a screen shot of the situation...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.flickr.com/photos/doctordavid/14349264354/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.flickr.com/photos/doctordavid/14349264354/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe stranded ship has the lime-green orbit and Kerbin is the light blue. \u003C/p\u003E\u003Cp\u003EMy ship is in orbit around Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"meyst","CreatedById":59881,"CreatedDateTime":"2014-06-05T08:05:56Z","Content":"\n\u003Cp\u003EThat\u0027s a significant challenge and you have some options.\u003C/p\u003E\u003Cp\u003EMaths, I think this is a Lambert\u0027s problem. If you understand the terminology to get the orbits detailed information you can use \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003EAlex moon\u0027s excellent launch window planner \u003C/a\u003Eto add your stranded ship as \u0027a body\u0027 in the solar system and it will chart possible intercept courses as a delta Vee pork chop plot, recommend the most efficient option and give you the information needed to execute it.\u003C/p\u003E\u003Cp\u003EYou can wait, after a few years the stranded ship should end up with a relatively close intercept to Kerbin and when it does send your rescue ship out such that the ship you are sending out has the exact same Periapsis and patiently narrow the gap every subsequent orbit by the usually method of using a slightly higher Apoapsis if you are ahead of it and slightly lower Apoapsis if you are behind it and need to catch up. I recommend you practice matching and closing with an eccentric orbit first. Launching two probes into orbit together, sending one out on an orbit just short of a Mun transfer and intercepting it when the probe on the eccentric orbit returns. \u003C/p\u003E\u003Cp\u003ECreate opportunities. Build a big multi-stage rescue rocket with a ridiculous amount of delta V, around 15,000 - 20,000 M/S available once in Kerbin\u0027s orbit sounds about right to me (the Moar approach)\u003C/p\u003E\u003Cp\u003Eoption A) (The even Moar approach) Use the brute force to make an ugly high energy intercept, match the targets orbit when you get close.\u003C/p\u003E\u003Cp\u003Eoption \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Put the rescue ship in a circular orbit around the sun (the lower your solar orbit the easier and faster it is to make an intercept but the more fuel you will burn doing it) use the in game maneuver node tool to plot and execute an orbit from this circular orbit that\u0027s Apoapsis intercepts a part of the targets orbit (higher intercepts above the sun with the target will be easier to work with due to lower relative velocities at time of intercept)\u003C/p\u003E\u003Cp\u003EI think unmanned rescue ships are best, if it doesn\u0027t work out right you aren\u0027t inadvertently creating more new lost in space problems.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-05T09:21:16Z","Content":"\n\u003Cp\u003ENot very effective but fast:\u003C/p\u003E\u003Cp\u003E- time warp until kerbin is between the ship and sun (better leave the ship slightly ahead)\u003C/p\u003E\u003Cp\u003E- launch directly towards the ship\u003C/p\u003E\u003Cp\u003E- perform rendezvous as if you\u0027re in Kerbin orbit (just distances are bigger and encounter markers less reliable)\u003C/p\u003E\u003Cp\u003E- after rescuing the ship, burn (more or less) directly towards Kerbin to get intercept\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-05T09:23:52Z\u0022 title=\u002206/05/2014 09:23  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 5, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-05T11:15:55Z","Content":"\n\u003Cp\u003EI have a ship capable of 3700 m/s (or a bit more, I added a smaller stage after the calculation). I did a rough estimate on the Launch Window Planner and there were plenty of trajectories below this. (Some were only just over 1000 m/s, which is good since I need to get back). I did have questions about how to apply it....\u003C/p\u003E\u003Cp\u003ERegarding my targets orbit...\u003C/p\u003E\u003Cp\u003E-My Acending/Descending Node wrt Kerbin is only 0.1 degrees. So maybe I can just assume an inclination of 0 (which makes the longitude of ascending node 0). Think I can get away with this?\u003C/p\u003E\u003Cp\u003E-Argument of pariapsis is the angle of the peripasis wrt a reference direction, I assume that is Kerbin? I\u0027ll have to estimate that since the game won\u0027t give it to me?\u003C/p\u003E\u003Cp\u003E-It wants the time of the last passage by the periapsis, or the next one?\u003C/p\u003E\u003Cp\u003E-So the info it gets me is an ejection angle and the ejection delta-V. If they are 166 degree to prograde and 871 m/s, I look at the prograde marker, add 166 degree, point in that direction and burn for 871 m/s. I guess I will have to use a burn set up for the right amount of time, and move it until it gives the right angle wrt prograde on the ball?\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-05T11:18:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003ENot very effective but fast:\u003Cp\u003E- time warp until kerbin is between the ship and sun (better leave the ship slightly ahead)\u003C/p\u003E\u003Cp\u003E- launch directly towards the ship\u003C/p\u003E\u003Cp\u003E- perform rendezvous as if you\u0027re in Kerbin orbit (just distances are bigger and encounter markers less reliable)\u003C/p\u003E\u003Cp\u003E- after rescuing the ship, burn (more or less) directly towards Kerbin to get intercept\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I was going to wait until Kerbin crosses the target ships orbit. But away from Kerbin until I (with as little left over dV as possible) escape Kerbin and do a rendevous as normal. I think you are saying do this when the sun, Kerbin, and the ship are lined up instead? Is that better?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-05T11:49:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022davidpsummers\u0022 data-cite=\u0022davidpsummers\u0022\u003E\u003Cdiv\u003EWell, I was going to wait until Kerbin crosses the target ships orbit. But away from Kerbin until I (with as little left over dV as possible) escape Kerbin and do a rendevous as normal. I think you are saying do this when the sun, Kerbin, and the ship are lined up instead? Is that better?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESimilarly to how you need to have a target planet at appropriate \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ephase angle\u003C/a\u003E for optimal approach, you need that ship at appropriate phase angle as well. It\u0027s just that the angle is not that big since the ship\u0027s orbital period is not that different from Kerbin\u0027s as it is e.g. for Duna. So I\u0027d give that ship about 10-15 degrees of phase angle at the most distant point, the closer to Kerbin it gets the less. You don\u0027t need to be extremely precise since then you\u0027ll be correcting your approach anyway (I did write it is not the most fuel efficient approach).\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-05T14:19:21Z","Content":"\n\u003Cp\u003EYou may not need to send anything out into solar orbit...\u003C/p\u003E\u003Cp\u003ELet\u0027s assume you don\u0027t send another ship. Your Kerbal has about 500m/s of delta-V in their EVA pack. That\u0027s going to be more than enough.\u003C/p\u003E\u003Cp\u003EStay in your ship for now, set Kerbin as your target, and put down a maneuver node at the point where your orbit crosses Kerbin\u0027s orbit. This should be at or near your current closest approach.\u003C/p\u003E\u003Cp\u003EPut a second maneuver node 90 degrees behind that (actually 270 degrees ahead). When you place the second node, you will see the \u0022target position at closest approach\u0022 shift. That\u0027s because we are now looking at the closest approach one orbit ahead.\u003C/p\u003E\u003Cp\u003EIs the target position now very close to the intersection point? If not, right click on the second node you placed, and click the bottom right button to set it \u0022one orbit ahead\u0022. The target position will shift again, indicating what is going to happen at the crossing point two orbits from now.\u003C/p\u003E\u003Cp\u003ERepeat this procedure until the target position is \u0022pretty close\u0022. A few cm away on screen. It shouldn\u0027t take more than two or three orbits.\u003C/p\u003E\u003Cp\u003ENow go back to that first node. If the target position marker is currently ahead of the intersection point, it means you\u0027re getting there a little bit too late after three orbits. So add a little retrograde to that first maneuver. Keep adding retrograde until you get an intercept. It won\u0027t take much delta V... almost certainly less than 50 m/s, maybe just a few m/s. If the target position marker is behind, you need to add a bit of prograde instead.\u003C/p\u003E\u003Cp\u003ELet\u0027s assume you needed to add a bit of retrograde for the rest of this example, and that the intercept will happen three orbits from now.\u003C/p\u003E\u003Cp\u003ENow warp around to the that first node you placed at the intersection of the orbits. Orient your ship so that it is facing prograde. \u003C/p\u003E\u003Cp\u003EIt\u0027s time to get out. Delete the maneuver nodes, you don\u0027t really need them anymore and they just make things confusing.\u003C/p\u003E\u003Cp\u003EEVA, and orient your kerbal so that he is facing directly down the line of the ship, and towards the back. He will now be facing retrograde.\u003C/p\u003E\u003Cp\u003EUse your EVA pack to thrust forwards, ie, retrograde. Your EVA pack has about 500m/s, so use this as a benchmark (.5 EVA fuel will be about 1/10th of the total, or about 50m/s). Keep switching in and out of map view with kerbin as the focus in order to see your kerbin periapsis shift. Get it as low as you can. Towards the end you will just be tapping the EVA jets for a split second to make changes. Keep deleting and adding the maneuver node back so you can click on the \u0022next orbit\u0022 button as necessary to see what is going to happen. \u003C/p\u003E\u003Cp\u003ENow, you\u0027re probably going to have to make a correction or two. You will not have delta-v indicators, or current velocity indicators, while on EVA. But you\u0027re not going to need them.\u003C/p\u003E\u003Cp\u003EWarp around until you are in the Kerbin intercept orbit (in our example, 3 orbits later). Plop down a maneuver node. It doesn\u0027t really matter where. Now pull the radial in or radial out handles as necessary to bring your periapsis lower. We are using radial in and radial out *only*, because it\u0027s easy to use the sun as a reference for which way you are facing. Facing the sun? Radial in. If you need to burn radial out, face the sun, then swing the camera around so you are looking directly at your Kerbal\u0027s face, and tap the forward EVA key to turn him 180 degrees.\u003C/p\u003E\u003Cp\u003EIf you need to make normal corrections it\u0027s a bit harder. Hopefully you won\u0027t have to, because we don\u0027t care about whether we are coming in equatorially. We just need a periapsis low enough for capture via aerobrake. That\u0027s going to be at around 35-40km, by the way.\u003C/p\u003E\u003Cp\u003EAgain, you can\u0027t see what your required delta-v is, nor how much delta-v you have spent, so keep switching in and out of map view when you use your EVA pack to see the effect of your \u0022burns\u0022. Remember, you don\u0027t weigh much, so small taps result in significant changes.\u003C/p\u003E\u003Cp\u003ENow, all of that is probably pretty hard to follow... so I made a video for you!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/LNxk4w99gbc\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/LNxk4w99gbc\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-06-05T14:55:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022davidpsummers\u0022 data-cite=\u0022davidpsummers\u0022\u003E\u003Cdiv\u003E-My Acending/Descending Node wrt Kerbin is only 0.1 degrees. So maybe I can just assume an inclination of 0 (which makes the longitude of ascending node 0). Think I can get away with this?\u003Cp\u003E-Argument of pariapsis is the angle of the peripasis wrt a reference direction, I assume that is Kerbin? I\u0027ll have to estimate that since the game won\u0027t give it to me?\u003C/p\u003E\u003Cp\u003E-It wants the time of the last passage by the periapsis, or the next one?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EYou can read most of these out from the persistence file. Alternatively VOID\u0027s extended orbital information gives you most of it. And the time of any periapsis passage will do.\u003Cp\u003EI\u0027m not sure exactly how I\u0027d do this rendezvous, but I can think of a couple of methods:\u003C/p\u003E\u003Cp\u003EIf you aren\u0027t in a hurry, wait until Kerbin\u0027s around the target\u0027s periapsis, then leave Kerbin\u0027s SOI. Put yourself in a phasing orbit, probably between Kerbin\u0027s and the target\u0027s but maybe wider than the target\u0027s, such that in a few orbits you\u0027ll have an intersect near your shared periapsis.\u003C/p\u003E\u003Cp\u003EIf you are in a hurry, wait until Kerbin\u0027s \u0022catching up\u0022 on the target, then leave, taking a short(ish) diagonal trajectory between the two orbits to an intersect.\u003C/p\u003E\u003Cp\u003EOr you could take a third option: don\u0027t send a rescue mission at all. I can\u0027t imagine it would take more than a small correction from it to get onto a Kerbin aerobrake trajectory. Monopropellant, residual fuel, or even Get Out And Push might be able to it, and EVAing the Kerbal back to low Kerbin orbit on his own would certainly be possible. (Challenging, but possible).\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-05T22:59:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EYou can read most of these out from the persistence file. Alternatively VOID\u0027s extended orbital information gives you most of it. And the time of any periapsis passage will do.\u003Cp\u003EI\u0027m not sure exactly how I\u0027d do this rendezvous, but I can think of a couple of methods:\u003C/p\u003E\u003Cp\u003EIf you aren\u0027t in a hurry, wait until Kerbin\u0027s around the target\u0027s periapsis, then leave Kerbin\u0027s SOI. Put yourself in a phasing orbit, probably between Kerbin\u0027s and the target\u0027s but maybe wider than the target\u0027s, such that in a few orbits you\u0027ll have an intersect near your shared periapsis.\u003C/p\u003E\u003Cp\u003EIf you are in a hurry, wait until Kerbin\u0027s \u0022catching up\u0022 on the target, then leave, taking a short(ish) diagonal trajectory between the two orbits to an intersect.\u003C/p\u003E\u003Cp\u003EOr you could take a third option: don\u0027t send a rescue mission at all. I can\u0027t imagine it would take more than a small correction from it to get onto a Kerbin aerobrake trajectory. Monopropellant, residual fuel, or even Get Out And Push might be able to it, and EVAing the Kerbal back to low Kerbin orbit on his own would certainly be possible. (Challenging, but possible).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe persistence file is a link on the site?\u003C/p\u003E\u003Cp\u003EI found some places that would give me detailed info, but they all involved having already installed a part on the ship.\u003C/p\u003E\u003Cp\u003EDo you know why the entry for when you want to leave doesn\u0027t go below a year?\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2014-06-05T23:44:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022davidpsummers\u0022 data-cite=\u0022davidpsummers\u0022\u003E\u003Cdiv\u003EThe persistence file is a link on the site?\u003Cp\u003EI found some places that would give me detailed info, but they all involved having already installed a part on the ship.\u003C/p\u003E\u003Cp\u003EDo you know why the entry for when you want to leave doesn\u0027t go below a year?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe persistent file is the savegame. Go into the savegames folder, get into proper subfolder and you\u0027ll see persistent.ess and quicksave.ess\u003C/p\u003E\u003Cp\u003E(well, I think ess is the extension. The savegame, in any case)\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-06T00:08:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022juanml82\u0022 data-cite=\u0022juanml82\u0022\u003E\u003Cdiv\u003EThe persistent file is the savegame. Go into the savegames folder, get into proper subfolder and you\u0027ll see persistent.ess and quicksave.ess\u003Cp\u003E(well, I think ess is the extension. The savegame, in any case)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EClose, persistence.sfs and quicksave.sfs in the saves/Save_Name folder. But the rest is right. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-06T01:40:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EYou can read most of these out from the persistence file. Alternatively VOID\u0027s extended orbital information gives you most of it. And the time of any periapsis passage will do.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, thanks. I found it. It gives...\u003C/p\u003E\u003Cp\u003ESMA = 16195287240.3846\u003C/p\u003E\u003Cp\u003E ECC = 0.161534375525393\u003C/p\u003E\u003Cp\u003E INC = 0.134881427300168\u003C/p\u003E\u003Cp\u003E LPE = 8.50860896655636\u003C/p\u003E\u003Cp\u003E LAN = 195.382865403951\u003C/p\u003E\u003Cp\u003E MNA = 2.03855206470513\u003C/p\u003E\u003Cp\u003E EPH = 88196591.6516588\u003C/p\u003E\u003Cp\u003EThe only number I can\u0027t pull out is which one is the \u0022Arguement of Periapsis\u0022? Thought I guess \u0022LPE is the \u0022longitude of the periapsis\u0022 and wikpedia says \u0022Especially in discussions of binary stars and exoplanets,the terms \u0022longitude of periapsis\u0022 or \u0022longitude of periastron\u0022 are often used synonymously with \u0022argument of periapsis.\u0022 so I can use LPE for that?\u003C/p\u003E\u003Cp\u003E(Oh, and when I add the time to the next periapsis to the calander time, it is 365 days in a year?)\u003C/p\u003E\u003Cp\u003EUsing the dV of the suit seems a bit like cheating, and I have the rocket ready anyways and it will teach me stuff I can use later.\u003C/p\u003E\u003Cp\u003EJust to confirm, one I have Alex\u0027s launch window, I burn at the ejection angles listed for the ejection delta V?\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-12T06:03:04Z","Content":"\n\u003Cp\u003EWell, my rescue ship is on its way. Since Kerbin crossed the orbit in question, I just ejected from the Kerbin SOI with as small a burn as possible (to dump me into Kerbin\u0027s orbit as closely as possible) and then treated it as a standard rendezvous. It seemed safer than the transfer calculation (and the odds that the map would show the intercept as I set up the maneuver mode seemed non-existent). \u003C/p\u003E\u003Cp\u003EIn the end I had to actually raise my apoapsis past that of the target (to no have to go around the sun for a few years) so it probably wasn\u0027t as efficient.\u003C/p\u003E\u003Cp\u003EHere is a picture of the ship just before it left my space station (from the twin orange tanks on down, boy was it wobbly !!!!)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ncTUOsy.png\u0022 alt=\u0022ncTUOsy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWell, my rescue ship is on its way. Since Kerbin crossed the orbit in question, I just ejected from the Kerbin SOI with as small a burn as possible (to dump me into Kerbin\u0027s orbit as closely as possible) and then treated it as a standard rendezvous. It seemed safer than the transfer calculation (and the odds that the map would show the intercept as I set up the maneuver mode seemed non-existent). \u003C/p\u003E\u003Cp\u003EIn the end I had to actually raise my apoapsis past that of the target (to no have to go around the sun for a few years) so it probably wasn\u0027t as efficient.\u003C/p\u003E\u003Cp\u003EHere is a picture of the ship just before it left my space station (from the twin orange tanks on down, boy was it wobbly !!!!)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ncTUOsy.png\u0022 alt=\u0022ncTUOsy.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-06-12T13:02:31Z","Content":"\n\u003Cp\u003EIt\u0027s how I would have worked it, let the other ship catch up with you...\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-06-18T01:51:25Z","Content":"\n\u003Cp\u003EWell, I have picked Bill up. He was there for about 10 years (I stranded him when I couldn\u0027t even do orbital flights and it took my a long time to build up). He has another year getting back, but he is in a Kerbin return trajectory. I only needed a short burn to get back because it turned out in a year he was going to make a close approach to Kerbin. (He still needed rescuing because without fuel, a close approach was still a \u0022near miss\u0022.)\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-06-18T03:11:10Z","Content":"\n\u003Cp\u003ECongrats on the success!\u003C/p\u003E\u003Cp\u003EOh, and as for \u0022why the entry for when you want to leave doesn\u0027t go below a year\u0022, that\u0027s because the game calendar starts at year 1, day 1.\u003C/p\u003E\n"}]}