{"TopicId":74285,"ForumId":21,"TopicTitle":"Of Jetpacks and SSTOs","CreatedByName":"Three1415","CreatedById":85754,"CreatedDateTime":"2014-06-06T07:35:27Z","PageNum":1,"Articles":[{"CreatedByName":"Three1415","CreatedById":85754,"CreatedDateTime":"2014-06-06T07:35:27Z","Content":"\n\u003Cp\u003EI have been lurking on these forums for quite awhile now, waiting to debut with something I consider remarkable; and, at last, I present to you [*trumpet fanfare*]:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EA Jetpack\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EI have found that I am terrible at naming things, but regardless, I have created, through much stacking of toroidal tanks, a jetpack in the style of a Manned Maneuvering Unit.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Hfx3rWQ.png\u0022 alt=\u0022Hfx3rWQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EIn terms of general specifications, the craft\u0027s propulsion consists of a single Basic Jet. Between its the outer intake and SAS module lie seven toroidal tanks and two Oscar-Bs (with a duplicate set on the other side), providing a total of 163 units of liquid fuel, enough to run the Basic Jet for approximately twenty-seven minutes; with a top speed of, at ~1500 meters, 210 m/s, this craft can traverse essentially any reasonable distance from KSC in an extremely short time. As is evident, it seats (literally) one Kerbal; in addition, four circular intakes provide a plentiful supply of oxygen; power is provided by four RTGs clipped into the engine body; and two standard SAS modules ensure stability. As (at least with my piloting skills) the craft is essentially impossible to land, a MK16 parachute (regular size) is clipped into the upper frame; this, as well as about 1/3 throttle applied at ~100 meters, is sufficient for a safe landing at about 6 m/s. After deployment and landing, the seated Kerbal can repack the parachute, though it may be necessary to zoom into the body of the craft to access it; the craft is 62 parts in total. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EPressing the 1 key toggles the engine; 2 deploys the parachute. Hovering is achieved at approximately 35 kilo-newtons of thrust, or about 40% throttle.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/qtnhr\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EJavascript is disabled. View full album\u003C/span\u003E\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EGiven the fuel capacity of the craft, I was prepared to challenge someone to rework the fuel lines, refill the tanks with oxidizer, and convert this jetpack into an SSTO, until I realized that I was \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003Enot\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E going to pass up that opportunity. Thus, I introduce to you \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EThe SSTOpack\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E(I mean, really? What do you even call this sort of thing?)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5Dxw22q.png\u0022 alt=\u00225Dxw22q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter about an hour and a half clipping yet more parts (without the Alt \u002B F12 option, mind you), adding more engines, and reworking the fuel lines, I at last created a fully functional SSTO that far surpassed my expectations.\u003C/p\u003E\u003Cp\u003ESpecifications:\u003C/p\u003E\u003Cp\u003EPropulsion: 1 Turbojet Engine (for atmospheric travel), and 1 LV-909 (for orbital adjustments)\u003C/p\u003E\u003Cp\u003EPropellant: 163 units liquid fuel, 179 units oxidizer (to compensate for jet fuel usage)\u003C/p\u003E\u003Cp\u003EPowerplant: 4 RTGs\u003C/p\u003E\u003Cp\u003EControl: Two SAS modules\u003C/p\u003E\u003Cp\u003EIntakes: 3 ram air intakes, 4 circular intakes\u003C/p\u003E\u003Cp\u003ECapacity: 1 Kerbal\u003C/p\u003E\u003Cp\u003EPart Count:74\u003C/p\u003E\u003Cp\u003EWet Mass: 5.2 tons.\u003C/p\u003E\u003Cp\u003ELanding Gear: 1 Regular MK 16 parachute.\u003C/p\u003E\u003Cp\u003EAction Groups: 1: Toggle Turbojet\u003C/p\u003E\u003Cp\u003E 2: Toggle LV-909\u003C/p\u003E\u003Cp\u003E 3: Deploy parachute\u003C/p\u003E\u003Cp\u003EThis small apparatus can, from launch at KSC, achieve a 150 km x 150 km orbit with approximately 60 units of liquid fuel left to spare, giving it access to all of LKO, with its outer operational bounds at approximately Kerbin-synchronous orbit, if not beyond. The launch profile is as follows: Simply fly straight up to a height of ~12 km, then conduct a gravity turn, with direct of travel between 15 and 20 degrees above the horizon; continue gaining speed and slowly decrease throttle after about 25 km; with proper management, the turbojet can remain operational to 45 km, at which point one should cut it, toggle to the LV-909, and conduct a requisite burn at the apoapsis, which should be between 75 or 80 km; re-entry is just as simple, and enough liquid fuel should remain to traverse the majority of Kerbin after re-entry, as I had to do after missing the KSC (as I always do) after re-entry in the album below: \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/RrheD\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EMuch like the standard jetpack, a safe landing is achieved at about 6 m/s; throttle up to about 1/3 at ~100 meters above the terrain to slow your velocity after deploying the parachute. \u003C/p\u003E\u003Cp\u003EThe abundance of struts within the design wards of Xactar\u0027s wiggle horse, which I find otherwise attacks during flight. Also, the clipped parts have some strange effects during impacts; sometimes an unfortunate Jebediah Kerman is ejected at approximately a kilometer per second, and sometimes one simply bounces for no reason (Danny2462 would be intrigued \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E).\u003C/p\u003E\u003Cp\u003EAs I am rather new to this (evidenced by all of my 1 post), how does one go about sharing craft files, assuming that anyone wants to fiddle around with this? \u003C/p\u003E\u003Cp\u003EAlso, I do wonder if I have broken some kind of record for smallest SSTO by volume; certainly I hope that I have \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. My apologies in (how does one word this? \u0022Retreat?\u0022) for the walls of text; any feedback or criticism is welcome.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-06T16:29:38Z\u0022 title=\u002206/06/2014 04:29  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 6, 2014\u003C/time\u003E by Three1415\u003C/strong\u003E\n\u003Cbr\u003EGrammar suffers somewhat at 3:30 A.M :P.\n\u003C/span\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-06-06T09:59:20Z","Content":"\n\u003Cp\u003EAn interesting approach. I like it. I usually steer away from clipping, but you\u0027ve made something look rather cool. Nice one.\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2014-06-06T16:17:39Z","Content":"\n\u003Cp\u003ECool Man. I love the idea. Looks like a turbo mega jetpack to little Kerbals! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Error","CreatedById":58941,"CreatedDateTime":"2014-06-06T16:33:45Z","Content":"\n\u003Cp\u003EJeb... I found your ride.\u003C/p\u003E\u003Cp\u003EThis is cool. How\u0027d you pack enough fuel for an SSTO into that little package?\u003C/p\u003E\n"},{"CreatedByName":"Tangle","CreatedById":66808,"CreatedDateTime":"2014-06-06T16:45:52Z","Content":"\n\u003Cp\u003ETo post it, there are a few good sites: Dropbox, Mediafire, Google Drive, or Curse.\u003C/p\u003E\n"},{"CreatedByName":"DaveVato","CreatedById":79739,"CreatedDateTime":"2014-08-17T22:07:38Z","Content":"\n\u003Cp\u003EThree1415, very cool! Did you ever post the craft files for these?\u003C/p\u003E\n"},{"CreatedByName":"Nik_601","CreatedById":104747,"CreatedDateTime":"2014-08-18T09:13:04Z","Content":"\n\u003Cp\u003EGood job! I like your jetpacks, especially, SSTOpack:)\u003C/p\u003E\u003Cp\u003EBtw,i have my own jetpack too, but it uses monopropellant\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Eqiku9y.png\u0022 alt=\u0022Eqiku9y.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fikakillen","CreatedById":117462,"CreatedDateTime":"2014-08-18T13:29:10Z","Content":"\n\u003Cp\u003ENice one, cant wait for the .CRAFT file!\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Volcanix","CreatedById":117245,"CreatedDateTime":"2014-08-18T14:23:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Error\u0022 data-cite=\u0022The Error\u0022\u003E\u003Cdiv\u003EJeb... I found your ride.\u003Cp\u003EThis is cool. How\u0027d you pack enough fuel for an SSTO into that little package?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess part clipping. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-08-18T23:15:08Z","Content":"\n\u003Cp\u003EThis. Is. Jeb-Worthy.\u003C/p\u003E\n"}]}