{"TopicId":74306,"ForumId":36,"TopicTitle":"A Question About Making An Insanely Strong Part","CreatedByName":"I.T Marcus","CreatedById":86085,"CreatedDateTime":"2014-06-06T14:58:28Z","PageNum":1,"Articles":[{"CreatedByName":"I.T Marcus","CreatedById":86085,"CreatedDateTime":"2014-06-06T14:58:28Z","Content":"\n\u003Cp\u003EOkay, so I have been working on a mod dedicated to rovers. It was suggested to me to make something similar to NASA\u0027s inflatable impact shields for the rovers like curiosity. The question I have is that if I wanted to make such a shield... could it be done by just upping the crash and heat tolerance? So for example say you have a REALLY heavy rover.. you use drouges to slow their descent, per your landing protocol; you ditch the chute and inflate the impact shield to absorb the impact and leave your rover in peace... possibly upside down. I also have a worry that ksp physics will not enjoy the fact that something is surviving a fall from orbit.\u003C/p\u003E\u003Cp\u003EThanks for reading my question!\u003C/p\u003E\u003Cp\u003EThis is a copy of a post I had in another category, I had no responses and figured it would be better to post here since this is the Add-On Development area \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-06T15:15:01Z","Content":"\n\u003Cp\u003EI don\u0027t think it\u0027ll work so well, I have witnessed multiple time crash where in fact parts attached to a strong part will suffer as well (in fact the joint breaks first, the parts move all around and hit the ground then they are destroyed). Even if the such strong part survive alone !\u003C/p\u003E\u003Cp\u003EDo your own experiments, create a super strong box (5000 m/s tolerance for example) or even take a part and play with it, attach it to a small rocket, attach things on it, have fun by crash a lot.\u003C/p\u003E\u003Cp\u003EAnd such things make sense when you think of it, remember old cars without all those modern safety devices, a hard impact on a wall lead people inside to suffer from major injuries even when no direct hit occurred.\u003C/p\u003E\u003Cp\u003ESo you have to create a part which can absorb kinetic energy on impact (based on landing gears for example). I guess it could be possible to build a \u0022landing leg\u0022 made by two big parts connected by a big shock absorber, kind of an \u0022hydraulic press\u0022 in shape.\u003C/p\u003E\n"},{"CreatedByName":"I.T Marcus","CreatedById":86085,"CreatedDateTime":"2014-06-06T15:33:22Z","Content":"\n\u003Cp\u003EHmmm, good idea! I think the part itself will be acted as a landing gear... as I plan on having the kinetic energy to be dissipated throughout the gas that inflates it.\u003C/p\u003E\u003Cp\u003ENonetheless, thanks for answering \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2014-06-06T16:40:52Z","Content":"\n\u003Cp\u003EThat\u0027s interesting. What exactly are you planning to do?\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-06-06T18:20:04Z","Content":"\n\u003Cp\u003EThis has been done before. I think the Lionhead pack was the one that had a rover that uses an airbag landing system. It does work well.\u003C/p\u003E\u003Cp\u003EThe key most likely is that the payload is attached by a single stack node and is completely enclosed by the airbag\u0027s shell. The airbag\u0027s collision body prevents all contact with the ground and most likely had a very high breakingForce and breakingTorque.\u003C/p\u003E\n"},{"CreatedByName":"I.T Marcus","CreatedById":86085,"CreatedDateTime":"2014-06-09T01:51:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003EThat\u0027s interesting. What exactly are you planning to do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst off, sorry late reply\u003C/p\u003E\u003Cp\u003EWhat I\u0027m planning to do is make a module to aid in delivering rovers to the ground without accidently breaking any wheels/other parts\u003C/p\u003E\u003Cp\u003ESo probably the part with act as the above post described. Might experiment by making the collision box enlarge when \u0027inflate animation\u0027 is played so that even if the payload does bounce around it still has a decent radius to do so without making contact with the ground... then have a GUI button to slowly deflate and decouple the impact modules... if that makes sense\u003C/p\u003E\u003Cp\u003EThanks for answering, and again sorry for late reply! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-09T06:33:53Z","Content":"\n\u003Cp\u003EIt looks like you will do an airdrop platform as used to deliver vehicle or supplies to ground based troops (which could be use also in cargo planes in KSP the same way)\u003C/p\u003E\u003Cp\u003EI\u0027m not sure bigger collider will be any help as I wrote above, but experiments have to be done to find the best/cheaper way to achieve your goal.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-06-10T14:38:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EThis has been done before. I think the Lionhead pack was the one that had a rover that uses an airbag landing system. It does work well.\u003Cp\u003EThe key most likely is that the payload is attached by a single stack node and is completely enclosed by the airbag\u0027s shell. The airbag\u0027s collision body prevents all contact with the ground and most likely had a very high breakingForce and breakingTorque.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyes I used that mod a lot, it can also be used on airless bodies, it don\u0027t handle any impact but is pretty tough.\u003C/p\u003E\u003Cp\u003Eit was an nice way to learn how to land as a 20-30 m/s landing was no problems, it was even less sensitive to horizontal speed as it just rolled.\u003C/p\u003E\u003Cp\u003Ethink you can use it for other probe rovers too, however its pretty small.\u003C/p\u003E\n"}]}