{"TopicId":74315,"ForumId":44,"TopicTitle":"So. Much. Planets.","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-06-06T17:24:45Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-06-06T17:24:45Z","Content":"\n\u003Cp\u003EI want to see this in KSP with Planet Factory.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.newscientist.com/article/dn25653-ultimate-solar-system-could-contain-60-earths.html?cmpid=RSS%7CNSNS%7C2012-GLOBAL%7Conline-news#.U4235ZRdX3C\u0026amp;utm_source=howtogeek\u0026amp;utm_medium=email\u0026amp;utm_campaign=newsletter\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.newscientist.com/article/dn25653-ultimate-solar-system-could-contain-60-earths.html?cmpid=RSS%7CNSNS%7C2012-GLOBAL%7Conline-news#.U4235ZRdX3C\u0026amp;utm_source=howtogeek\u0026amp;utm_medium=email\u0026amp;utm_campaign=newsletter\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.newscientist.com/data/images/ns/cms/dn25653/dn25653-1_1200.jpg\u0022 alt=\u0022dn25653-1_1200.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.newscientist.com/data/images/ns/cms/dn25653/dn25653-2_1200.jpg\u0022 alt=\u0022dn25653-2_1200.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-06-06T17:44:30Z","Content":"\n\u003Cp\u003EImagine if somehow, most of the planets have developed life. Interplanetary alien communities arising from a single solar system...\u003C/p\u003E\u003Cp\u003EThat would make a good sci-fi story.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-06-06T17:55:56Z","Content":"\n\u003Cp\u003EMy dad mentioned that it would make a great federation.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-06-06T18:09:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EImagine if somehow, most of the planets have developed life. Interplanetary alien communities arising from a single solar system...\u003Cp\u003EThat would make a good sci-fi story.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EImagine if they\u0027re like humans. \u003C/p\u003E\u003Cp\u003EIn a future, one of our starships enters an massive planetary system to find out that every world has been throughlu nuked from top to bottom with no survivors of a once great interplanetary civilization.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-06-06T18:29:27Z","Content":"\n\u003Cp\u003EImagine there is a planet called Earth, the people on this planet conclude that every other beeing in the whole universe is the same as them with the only thought of nuking themselves.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-06-06T19:53:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EImagine if they\u0027re like humans. \u003Cp\u003EIn a future, one of our starships enters an massive planetary system to find out that every world has been throughlu nuked from top to bottom with no survivors of a once great interplanetary civilization.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t be so negative. We humans have nukes for 70 years now and despite intense hatred and many wars, only two have ever been deployed and the morality of those is heavily debated till this day. Considering that we\u0027re a bunch of primates that need 3 years of training to not **** ourselves that\u0027s pretty impressive.\u003C/p\u003E\u003Cp\u003EIf martians existed on a similar technological level as us it is extremely unlikely to lead to an interplanetary nuclear exchange. We can\u0027t even get martian rocks to earth with current tech, there is absolutely no material gain involved. It\u0027d be a massive waste of resources to launch all those nukes with absolutely no payoff whatsoever. Not to mention that if we ever launched those missiles it\u0027d take 6 months for them to hit, giving the Martians plenty of time to prepare and launch second strikes.\u003C/p\u003E\u003Cp\u003EAnyway, while that theoretical model for a planetary system is pretty neat I have to question how valid those worlds would be for life. All those double planets and moons are likely to be tidally locked to one another, which means extremely long days. The moons around the gas giants have to deal with huge radiation doses. Tidal heating in the moons would be tremendous which would poison the atmospheres etc.\u003C/p\u003E\u003Cp\u003EOf course there could be life adapted to these conditions, but I wonder how \u0027earthlike\u0027 the planets would be.\u003C/p\u003E\n"},{"CreatedByName":"Tux","CreatedById":111829,"CreatedDateTime":"2014-06-06T19:57:12Z","Content":"\n\u003Cp\u003Eextremophiles!\u003C/p\u003E\u003Cp\u003Ethe study of extremophiles makes me convinced there is life all over the place.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-06-06T20:03:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003E... only two have ever been deployed ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly two were ever deployed in anger! But the actual number of atomic devices detonated is a lot higher. And when I say a lot higher I mean \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E2000\u002B !!!\u003C/strong\u003E\u003C/span\u003E: \u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_nuclear_weapons_tests\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_nuclear_weapons_tests\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-06-06T20:07:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EDon\u0027t be so negative. We humans have nukes for 70 years now and despite intense hatred and many wars, only two have ever been deployed and the morality of those is heavily debated till this day. Considering that we\u0027re a bunch of primates that need 3 years of training to not **** ourselves that\u0027s pretty impressive.\u003Cp\u003EIf martians existed on a similar technological level as us it is extremely unlikely to lead to an interplanetary nuclear exchange. We can\u0027t even get martian rocks to earth with current tech, there is absolutely no material gain involved. It\u0027d be a massive waste of resources to launch all those nukes with absolutely no payoff whatsoever. Not to mention that if we ever launched those missiles it\u0027d take 6 months for them to hit, giving the Martians plenty of time to prepare and launch second strikes.\u003C/p\u003E\u003Cp\u003EAnyway, while that theoretical model for a planetary system is pretty neat I have to question how valid those worlds would be for life. All those double planets and moons are likely to be tidally locked to one another, which means extremely long days. The moons around the gas giants have to deal with huge radiation doses. Tidal heating in the moons would be tremendous which would poison the atmospheres etc.\u003C/p\u003E\u003Cp\u003EOf course there could be life adapted to these conditions, but I wonder how \u0027earthlike\u0027 the planets would be.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow if you had multiple planets with life in a solar system, it would be low chance of the other even has some sort of civilization then the first develop space travel.\u003C/p\u003E\u003Cp\u003E7000 year on earth if pretty generous compared with time we has had life. \u003C/p\u003E\u003Cp\u003ESome chance of fining intelligent life but not above stone age. \u003C/p\u003E\u003Cp\u003EThat is unless something stop some civilization to reach space, an aquatic species could be intelligent even have a civilisation but could newer get pass stone age as its hard to melt metal underwater. \u003C/p\u003E\u003Cp\u003EMore relevant an system with life on multiple planets will give an far more space activity, the other planets should be far easier to set up self supplied bases on and increase the cilvilisation chance of long term survival.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-06-06T20:14:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EOnly two were ever deployed in anger! But the actual number of atomic devices detonated is a lot higher. And when I say a lot higher I mean \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E2000\u002B !!!\u003C/strong\u003E\u003C/span\u003E: \u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_nuclear_weapons_tests\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_nuclear_weapons_tests\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EObviously I mean deployed in combat. If we\u0027re gonna count nuclear tests then we hit a rather slippery slope. Are bullets fired in training counted as an act of war as well?\u003C/p\u003E\u003Cp\u003EThere is a rather big difference between a test conducted in relative safety and controlled conditions and active combat deployment. Your own signature applies rather well here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-06-06T21:28:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E the arrangement of planets must be scientifically plausible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe ultimate solar system: a binary star system supporting 60 habitable planets\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou keep using that word. I do not think it means what you think it means.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-06-07T00:26:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EImagine if they\u0027re like humans. \u003Cp\u003EIn a future, one of our starships enters an massive planetary system to find out that every world has been throughlu nuked from top to bottom with no survivors of a once great interplanetary civilization.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it would be boring to have all 36 planets in system #2 to be populated entirely by humans. I might as well say that the humans emerged on one planet and colonized the others, which were barren.\u003C/p\u003E\u003Cp\u003EI\u0027d rather have only 4-6 planets reaching the space age, the rest being in various stages of civilization development eras, like industrial or pre-industrial ages (or tribals for that matter). They could have evolved from different species,depending on what creatures thrived on each planet. They could have first contact when they developed the radio, far before anyone have directly seen an inhabitant of the other planets.\u003C/p\u003E\u003Cp\u003EInterplanetary warfare, though, would be unlikely in my opinion. Why waste time and resources trying to obliterate another planet? They had to have something they gain to even think of attacking in the first place; invasions are expensive.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-06-07T04:04:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EImagine if somehow, most of the planets have developed life. Interplanetary alien communities arising from a single solar system...\u003Cp\u003EThat would make a good sci-fi story.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeen done (sorta). The Tollan from Stargate explained their refusal to give technology to Earth because of what happened in their own history. They developed space flight, found that another planet in their solar system was inhabited by humans, but at a far lesser stage of development. They uplifted them, giving their technology freely, and the humans on that planet obliterated themselves.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2014-06-07T04:35:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EDon\u0027t be so negative. We humans have nukes for 70 years now and despite intense hatred and many wars, only two have ever been deployed and the morality of those is heavily debated till this day. Considering that we\u0027re a bunch of primates that need 3 years of training to not **** ourselves that\u0027s pretty impressive.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn fact having nukes almost certainly has been what\u0027s prevented world war 3 from breaking out, and it would have been fought with massive amounts of chemical and biological weapons...\u003C/p\u003E\u003Cp\u003EBut he has a point. Extreme competitiveness within (or between) the leading species on a planet is the most likely way to develop the means towards space travel.\u003C/p\u003E\u003Cp\u003EIn an environment with multiple planets close enough to make contact between them possible in a stage where that extreme competitiveness has not been tempered by a few centuries of reflection (and we\u0027re not there by far, we\u0027ve centuries to go yet in that process) it\u0027s quite possible for the situation to lead to both planets trying to win the other by war and destroying the other species in the process.\u003C/p\u003E\u003Cp\u003EWe\u0027re competitive because of paranoia and expansionist instincts. Xenophobia is the result of that, and is far more likely to lead to wars of extinction than the other guys looking much the same but talking funny or having weird moustaches.\u003C/p\u003E\n"},{"CreatedByName":"DJEN","CreatedById":61378,"CreatedDateTime":"2014-06-07T04:42:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EImagine there is a planet called Earth, the people on this planet conclude that every other beeing in the whole universe is the same as them with the only thought of nuking themselves.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWe\u0027re competitive because of paranoia and expansionist instincts. Xenophobia is the result of that, and is far more likely to lead to wars of extinction than the other guys looking much the same but talking funny or having weird moustaches.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConclusion: Humanity can\u0027t stay this way. It has to cease being human, and go beyond itself.\u003C/p\u003E\u003Cp\u003EIn other words: Give up those condemned human values and thoughts, for they will hinder progress and survival.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-06-07T16:13:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eother guys looking much the same but talking funny or having weird moustaches.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPffft... Hipsters.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-06-07T19:30:20Z","Content":"\n\u003Cp\u003EI want that gas giant system in ksp ._.\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2014-06-08T01:21:02Z","Content":"\n\u003Cp\u003EI have a lot of things to say about this article.\u003C/p\u003E\u003Cp\u003ERegarding system 1: none of the planets are actually in a Trojan configuration. For an object to be a trojan, it must be definition be at or orbiting the L4 or L5 point of another object. L4 and L5 are only stable if (a) M1 is much larger than M2 - this means you can\u0027t have a binary star with a planet orbiting at one of the star\u0027s trojan points unless the stars differ greatly in mass - and (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E M2 is much larger than M3 - this means that two planets cannot be mutual trojans, which is the scenario in system 1. In general, the rule of thumb is that M1 must be at least 10X heavier than M2 and M2 must be at least 10X heavier than M3.\u003C/p\u003E\u003Cp\u003EThere is, however, a way for two objects of similar mass to share an orbit. It\u0027s called a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Horseshoe_orbit\u0022 rel=\u0022external nofollow\u0022\u003Ehorseshoe orbit.\u003C/a\u003E Basically, M2 and M3 are both orbiting M1. M2 is in a slightly lower orbit, so it eventually catches up to M3. Gravitational attraction between the two causes M2 to speed up and M3 to slow down. This causes M2 to be pulled into a higher orbit, slowing down as a result, while M3 is pulled into a lower orbit and speeds up. Now M3 is moving faster, so it eventually catches up to M2, and the cycle repeats itself. If M2 is much, much larger than M3 (as is the case for the several asteroids in horseshoe orbits with Earth), M2\u0027s orbit doesn\u0027t really change. Note that a full horseshoe orbit cycle can take hundreds of orbits. For example, \u003Ca href=\u0022https://en.wikipedia.org/wiki/2002_AA29s\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/2002_AA29\u0027s\u003C/a\u003E cycle with Earth takes a total of 190 years.\u003C/p\u003E\u003Cp\u003EIn any case, both the trojan points and horseshoe orbits may be disrupted by external perturbations. For example, the moon\u0027s trojan points are unstable due to the sun. The same would likely be true for planets very close together. Unless there are long-term simulations on these kinds of arrangement, I would guess that the horseshoe orbits in system 1 may be unstable, and the trojan points in system 2 definitely are.\u003C/p\u003E\u003Cp\u003EActually, the situation is even worse for system 2. First of all, to retain a life-supporting atmosphere a moon probably has to be at least 10% the mass of Earth. Those gas-giants have 5 moons each, so at least 0.5 Earths of material in the moon system. Now, Jupiter and Saturn are both about 5000 times more massive than their moon systems, rings, etc. This means that each of those \u0022Jupiters\u0022 would actually be at least 8 jupiter masses, and likely some would actually be small brown dwarfs, at 13 jupiter masses or greater.\u003C/p\u003E\u003Cp\u003EThe larger an object is compared to its parent, the more effectively it destabilizes the orbits of everything nearby. For example, Saturn\u0027s moons get along quite nicely despite being so tightly packed, and Ceres is too small to clear out the rest of the asteroid belt. On the other hand, objects like Jupiter and Earth\u0027s moon throw anything that gets too close out of the system.\u003C/p\u003E\u003Cp\u003ETrying to pack four 8\u002B jupiter mass planets into the habitable zone of a red dwarf star would result in celestial Highlander. You\u0027ll end up with fewer planets than you started with, and at most one will remain in an orbit capable of supporting life.\u003C/p\u003E\u003Cp\u003EThere\u0027s another problem with system 2. Any planet in the HZ of a red dwarf star is going to be tidally locked to its parent. Extremely large moons might overpower the tidal forces from the star, but the habitable moons are way too small to tidelock the gas giants. Now this means that moons will all have orbital periods shorter than their parents\u0027 rotational periods. In this situation, the moons will eventually spiral in and collide with the parents. This same effect is likely why Venus and Mercury have no moons (neither of them are technically tidally locked, but they spin too slowly for a moon in a stable orbit.\u003C/p\u003E\u003Cp\u003EBasically, a red dwarf\u0027s habitable zone might be around for hundreds of billions of years, but any moons there won\u0027t be.\u003C/p\u003E\u003Cp\u003EPretty much all the the concepts used in this \u0022ultimate system\u0022 are feasible. Two habitable planets in a horseshoe orbit with each other? Possible. A gas giant with habitable trojans? Possible. A \u0022double planet\u0022? Possible. A binary star with habitable worlds around both stars? Possible. Gas giants with habitable moons? Possible. Habitable planets around red dwarfs? Possible. Several planets in a star\u0027s habitable zone? Possible.\u003C/p\u003E\u003Cp\u003EAll of those at once? Not possible.\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2014-06-08T01:55:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EI think it would be boring to have all 36 planets in system #2 to be populated entirely by humans. I might as well say that the humans emerged on one planet and colonized the others, which were barren.\u003Cp\u003EI\u0027d rather have only 4-6 planets reaching the space age, the rest being in various stages of civilization development eras, like industrial or pre-industrial ages (or tribals for that matter). They could have evolved from different species,depending on what creatures thrived on each planet. They could have first contact when they developed the radio, far before anyone have directly seen an inhabitant of the other planets.\u003C/p\u003E\u003Cp\u003EInterplanetary warfare, though, would be unlikely in my opinion. Why waste time and resources trying to obliterate another planet? They had to have something they gain to even think of attacking in the first place; invasions are expensive.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, one species emerging and colonizing the others is probably what would happen.\u003C/p\u003E\u003Cp\u003ELet\u0027s take \u003Ca href=\u0022https://en.wikipedia.org/wiki/Drake%27s_equation\u0022 rel=\u0022external nofollow\u0022\u003EDrake\u0027s equation\u003C/a\u003E, and apply it to a single star system. We can ignore the first couple variables, because we know we have 60 planets in the habitable zone.\u003C/p\u003E\u003Cp\u003ENow: not all planets in the HZ will actually be habitable. Some will be like Venus or Mars, for various reasons. Still, I\u0027ll be generous and assume that all 60 planets are in fact habitable. Not all habitable planets necessarily develop life, but currently most scientists think that pretty much all of them do.\u003C/p\u003E\u003Cp\u003EHere\u0027s where things get tricky. Life and complex life are not the same thing.\u003C/p\u003E\u003Cp\u003EEarth has supported life for 3.5 billion years. It has only supported complex, land-dwelling life (aquatic organisms, however smart they may be, are unlikely to discover fire. No fire means no metal smelting, which means no electronics for communication, and definitely no rocket engines) for 400 million years. Now, that life seem to have been steadily increasing in intelligence, but let\u0027s say that Earth has had animals with the potential to evolve into something that could build a spaceship for about 50 million years.\u003C/p\u003E\u003Cp\u003ENow it gets worse. Humans have been smart enough to make stone tools for about 2 million years. We\u0027ve only had agriculture for ten thousand. In another 1000 years, we\u0027ll probably have colonies all over our solar system, if not beyond.\u003C/p\u003E\u003Cp\u003EWith 60 life-supporting planets in a system, 50 are either \u0022slimeworlds\u0022 or have no land. Maybe 5 of the remaining 10 will develop intelligent (as in smart enough to make and use tools) life. Those that do will, like Earth, develop many such species. Eventually one will develop advanced technology like agriculture and cities, and in the blink of an eye that species will be in orbit.\u003C/p\u003E\u003Cp\u003EIf that one species is environmentally conscious, they\u0027ll mostly study and explore the other 59 worlds, and in the off chance one of them has any life that\u0027s advanced to the stone age, they might share technology. If not, they\u0027ll colonize, terraform, and exploit the others.\u003C/p\u003E\u003Cp\u003EIf a system with multiple habitable planets is colonized by multiple species, then unless they have radically different biochemistry I\u0027d put my money on them coming from the same planet.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-06-08T03:30:56Z","Content":"\n\u003Cp\u003ESo, at most we\u0027re looking at, at most, 5 intelligent-life-bearing planet (could be more, but not very likely), only one (or two, but that\u0027s even less likely) of which have developed spaceflight. And that\u0027s assuming all 60 planets are indeed habitable.\u003C/p\u003E\u003Cp\u003EThough, I could also say that some of the life developed in the system might be emerging in the unlikely places, or developing technology in ways that we do not expect. Seaborne species, for example, might use other energy source to smelt metal (lava vents?), or simply use other materials in their place. That may not get them very far(still no rocket engines), but if they ever discovered the radio, that\u0027s enough for them to notice (or be noticed) that they are not alone in the system.\u003C/p\u003E\u003Cp\u003EI think the development of radio communication would be a crucial element in such a system. Humans got away with broadcasting detectable messages in the 20\u003Csup\u003Eth\u003C/sup\u003E century because there were nobody else close enough around to hear them. If the same thing happens in a system with more than one inhabited planets, they\u0027ll probably either think that the other species\u0027 transmission is background static (though a very odd one at that), recognize them as another species in their system, or believe the other \u0027voices\u0027 there are from deities.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-08T03:33:45Z\u0022 title=\u002206/08/2014 03:33  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 8, 2014\u003C/time\u003E by shynung\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2014-06-08T15:41:25Z","Content":"\n\u003Cp\u003ENow I wonder, how could the circumstellar dust all be within the habitable zone at first... And the perturbation... (it\u0027ll be non-keplerian, non-binary too...)\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2014-06-08T21:59:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003ESo, at most we\u0027re looking at, at most, 5 intelligent-life-bearing planet (could be more, but not very likely), only one (or two, but that\u0027s even less likely) of which have developed spaceflight. And that\u0027s assuming all 60 planets are indeed habitable.\u003Cp\u003EThough, I could also say that some of the life developed in the system might be emerging in the unlikely places, or developing technology in ways that we do not expect. Seaborne species, for example, might use other energy source to smelt metal (lava vents?), or simply use other materials in their place. That may not get them very far(still no rocket engines), but if they ever discovered the radio, that\u0027s enough for them to notice (or be noticed) that they are not alone in the system.\u003C/p\u003E\u003Cp\u003EI think the development of radio communication would be a crucial element in such a system. Humans got away with broadcasting detectable messages in the 20\u003Csup\u003Eth\u003C/sup\u003E century because there were nobody else close enough around to hear them. If the same thing happens in a system with more than one inhabited planets, they\u0027ll probably either think that the other species\u0027 transmission is background static (though a very odd one at that), recognize them as another species in their system, or believe the other \u0027voices\u0027 there are from deities.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally, as I mentioned, I don\u0027t think you\u0027d actually get anywhere near 60 habitable planets in one system. There\u0027s definitely room for three distinct \u0022orbital lanes\u0022 in the HZ, but I\u0027m not sure about 6 unless you consider a habitable zone out to 3 AU. That\u0027s for Earth-sized planets. With the right orbital resonance, you might be able to fit 2 gas giants. However, I\u0027d expect such system\u0027s to mostly be like Saturn\u0027s: most of the mass in one, or maybe two habitable moons. In addition, a single gas giant could definitely have trojans. I\u0027m not sure if they\u0027d be stable for a pair.\u003C/p\u003E\u003Cp\u003EOne option not mentioned is the possibility of habitable planets in orbital resonances with gas giants (other than 1:1, aka a trojan or horseshoe orbit). For example, the 2:3 and 3:2 resonances (as seen with Pluto and the Hilda family of asteroids respectively) seem to be stable. They might both result in eccentric orbits, but not enough to make a planet uninhabitable. However planets in such resonances could destabilize the orbits of trojans, and vice versa.\u003C/p\u003E\u003Cp\u003EIn a best-case scenario, including:\u003C/p\u003E\u003Cp\u003E4-5 terrestrial planets, one or two in horseshoe orbits or double planet relationships with others\u003C/p\u003E\u003Cp\u003ETwo gas giants with two habitable moons each and maybe a resonant planet\u003C/p\u003E\u003Cp\u003EOne gas giant with two habitable moons, two trojans, and a resonant planet\u003C/p\u003E\u003Cp\u003EI\u0027d say 4-6 is the maximum number of EARTHLIKE habitable planets a single star could support.\u003C/p\u003E\u003Cp\u003EIf you also includes the possiblity of ammonia-based or methane-based life, the habitable zone gets much bigger. However, ammonia and methane require a narrower range of conditions to remain liquid on a planetary surface than water does, so I wouldn\u0027t expect to actually see more than one such planet in a single system.\u003C/p\u003E\u003Cp\u003EIcy moons with subsurface oceans are likely to be very common wherever there are cold gas giants, but life that develops there won\u0027t be building spaceships, and life from other worlds will have a very hard time contacting it.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-06-09T00:11:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003EIn fact having nukes almost certainly has been what\u0027s prevented world war 3 from breaking out, and it would have been fought with massive amounts of chemical and biological weapons...\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe way I (and I think most of the world) looks at it nukes almost \u003Cem\u003Ecaused\u003C/em\u003E world war three. If it ever happens, they will also ensure that very little will be left afterwards. Nukes are not a solution, they are a major hazard to everyone and anything living on earth.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-06-09T15:19:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EThe way I (and I think most of the world) looks at it nukes almost \u003Cem\u003Ecaused\u003C/em\u003E world war three. If it ever happens, they will also ensure that very little will be left afterwards. Nukes are not a solution, they are a major hazard to everyone and anything living on earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually... The automobile is a much bigger threat. It kills and maims millions every year and has for years. Plus it\u0027s... you know... via enviromental effects part of killing around a 100 million more. \u003C/p\u003E\u003Cp\u003EMore on topic. \u003C/p\u003E\u003Cp\u003EIf you think panspermia is possible, wouldn\u0027t life evolving in just one place, dramatically increase the chance of life somewhere else?\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-06-09T15:24:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EActually... The automobile is a much bigger threat. It kills and maims millions every year and has for years. Plus it\u0027s... you know... via enviromental effects part of killing around a 100 million more. \u003Cp\u003EMore on topic. \u003C/p\u003E\u003Cp\u003EIf you think panspermia is possible, wouldn\u0027t life evolving in just one place, dramatically increase the chance of life somewhere else?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow does an automobile kill? don\u0027t you mean the people who drive the automobile?\u003C/p\u003E\n"}]}