{"TopicId":74325,"ForumId":50,"TopicTitle":"How to Trick the Automatic Stage sorter","CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2014-06-06T18:36:08Z","PageNum":1,"Articles":[{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2014-06-06T18:36:08Z","Content":"\n\u003Cp\u003ESo you want to build a probe mothership to deploy probes to every Biome on the Mun with one Launch (or to Minmus). But when you try to build it you get all wonky stage setups and it\u0027s quite annoying to redo it all every time you add a new engine or stack separator right? Well here\u0027s how to trick it to get what you want.\u003C/p\u003E\u003Cp\u003EI\u0027ll use the picture of my new Artemis 0 science probe to show you:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/n6Ki8Br.png\u0022 alt=\u0022n6Ki8Br.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI mounted all the probes this mothership with stack separators. The trick that got the rest of the auto sorter to work for me is that double separator stack you see between the probe rack and the transfer stage. It works like this:\u003C/p\u003E\u003Cp\u003EThe stack arranger (when you click reset) assumes each stack layer you put is in the next stage out from the core of the ship (the first piece you placed). If I build a ship that has a crew pod with parachutes on it, one stack separator, and an engine with fuel on it:\u003C/p\u003E\u003Cp\u003EThe parachutes end up in stage 0, the engine in stage 1. If I build a rack behind this and put more stack separators on the ends to attach ships to: it now assumes those new ships will be in stage 4. The rack took up stage 3. Anything I build below the rack will end up in stage 4 with my dropships. To get around that simply stack another stack separator below the center separator. Now all the dropships stay in stage 4 and anything new on the center ends up in stage 5. \u003C/p\u003E\u003Cp\u003EFor each stack separator you put on the ships on the top rack you need 1 new separator on the center stack to keep the auto sorter working for you. Now you can build all your ridiculously complex ascent stages without bothering the stack setup for your payload.\u003C/p\u003E\u003Cp\u003ERemember that the radial decouplers also count towards this mechanism. If you mount dropships with them then add another separator to the center stalk. Also be sure to strut the top properly so you\u0027re not relying on the stack separators structural integrity.\u003C/p\u003E\u003Cp\u003ETry it out!\u003C/p\u003E\n"}]}