{"TopicId":74327,"ForumId":32,"TopicTitle":"Whats the weirdest thing to happen to you?","CreatedByName":"Geo793","CreatedById":63485,"CreatedDateTime":"2014-06-06T19:14:19Z","PageNum":1,"Articles":[{"CreatedByName":"Geo793","CreatedById":63485,"CreatedDateTime":"2014-06-06T19:14:19Z","Content":"\n\u003Cp\u003EOne time I was flying a plane and it crashed into the ground. What then happened was one of the wings survived and still had SAS on, so its flapper continued flapping away until it gained so much speed it left Kerbin and entered into an orbit around the sun. I didn\u0027t have the heart to delete it, so I renamed it the Little Wing that Could.\u003C/p\u003E\u003Cp\u003EEdit: Im sorry that I couldn\u0027t put in screenshots, I couldn\u0027t remember the right button at the time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-06T19:29:37Z\u0022 title=\u002206/06/2014 07:29  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 6, 2014\u003C/time\u003E by Geo793\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"aman608","CreatedById":100178,"CreatedDateTime":"2014-06-06T19:34:46Z","Content":"\n\u003Cp\u003EF1 for screenshot that or F2 one of them hides the GUI\u003C/p\u003E\u003Cp\u003EThe weirdest thing for me has to be Bill Kerman surviving a 200 m/s impact into the Mun\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-06-06T19:46:31Z","Content":"\n\u003Cp\u003EI\u0027ve heard of control surfaces causing some odd effects like that. I had the cockpit with canards get separated from a large spaceplane I was trying to fly. Well, it got blown off in a pretty bad explosion halfway down the runway. It sailed up and just kind of hung there in the air, moving up and down just 50 meters or so from the surface, for like 5 minutes before I finally tilted it to a point that it floated back down and safely landed in the water.\u003C/p\u003E\u003Cp\u003EI found the kraken on Kerbin once... I went to pick up a crashed ship I had dropped an asteroid with to bring it back to KSC, and when I attached a winch to it everything in my immediate area just fell through the planet and went to blackness. I panicked and killed the game\u0027s process in Windows. Reloaded and everything was fine but a piece of the ship (a small tank with an engine) was gone from the wreckage.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-06T19:52:06Z\u0022 title=\u002206/06/2014 07:52  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 6, 2014\u003C/time\u003E by Duke23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-06-06T19:58:12Z","Content":"\n\u003Cp\u003EI had to decouple the return stage of a mun lander and use a flipped over buggy as a ramp to get it into orbit again. It worked like a charm \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E.\u003C/p\u003E\u003Cp\u003EHey it was the second ever mission to the mun!\u003C/p\u003E\n"},{"CreatedByName":"quietsamurai98","CreatedById":69270,"CreatedDateTime":"2014-06-06T20:04:39Z","Content":"\n\u003Cp\u003EUnder some circumstances, parts can move very far away from where they are connected without breaking the connection, before being pulled back by an unknown force.\u003C/p\u003E\n"},{"CreatedByName":"pauix","CreatedById":11977,"CreatedDateTime":"2014-06-06T20:06:35Z","Content":"\n\u003Cp\u003EThe weirdest thing that happened to me was when one of my ships started spinning around while I was out planting a flag. Since Gilly\u0027s \u003Cem\u003Egravity\u003C/em\u003E is very small, the ship ended up flying over the horizon, and when I came back to Gilly after attending some other problems the ship had disappeared with Bill and Bob inside, leaving Jeb stranded there with no way to get back. And to top it off, a few launches after that incident Bill and Bob appeared in the Astronaut Complex like nothing happened. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avera9eJoe\u0022 data-cite=\u0022Avera9eJoe\u0022\u003E\u003Cdiv\u003EI had to decouple the return stage of a mun lander and use a flipped over buggy as a ramp to get it into orbit again. It worked like a charm \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E.\u003Cp\u003EHey it was the second ever mission to the mun!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESecond mission and already bringing vehicles to the MÃƒÂ¼n? I\u0027ve yet to make an useful land vehicle on Kerbin, let alone send it into space \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"corvustech","CreatedById":111036,"CreatedDateTime":"2014-06-06T20:32:27Z","Content":"\n\u003Cp\u003EOnce I was testing a design for a rescue ship that had two one-kerbal pods in a diamond shape with radial chutes on one and a cap chute on the other, and a decoupler between them. After one revolution in orbit I decelerated and ejected the pod pair, and at 13000 I cracked the pods apart. \u003C/p\u003E\u003Cp\u003EThe one I had control over behaved normally, but the one with the cap chute jiggled like mad and when it landed in the water, sat on top of it with its chute still up like it was falling. That smelled like Kraken Bait so now I don\u0027t use uncontrolled descent stages with anything or anyone important on them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-06T20:38:54Z\u0022 title=\u002206/06/2014 08:38  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 6, 2014\u003C/time\u003E by corvustech\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Harry Mckay","CreatedById":111970,"CreatedDateTime":"2014-06-06T22:12:05Z","Content":"\n\u003Cp\u003EI decided to send my Munar Science Rover to Minmus, figured that it should make it since everyone says the same rockets can travel to each. Unfortunately it was clearly going to run out of fuel while circularizing it\u0027s orbit prior to setting up a Minmus window, because I never circularize my orbits when going to the Mun. To make matters worse, I\u0027d accidentally switched to a nearby orbiter before I figured out it wouldn\u0027t make it, and therefore couldn\u0027t revert the flight. Also, being a Mun/Minmus lander, it had no \u0027chutes.\u003C/p\u003E\u003Cp\u003ERather than attempt a rescue mission, I thought I might be able to use what little fuel I had left in the LV-Ns to deorbit, and cushion it\u0027s crash enough for the vehicle itself to survive. It all worked well at first, had enough fuel after de-orbiting to burn hard as it neared the ground. Just before it hit (at about 100m/s) I separated the rover from the rocket, thinking that little bit might save it. It didn\u0027t.\u003C/p\u003E\u003Cp\u003EAfter the massive explosion, however, I realized the command module had somehow survived, so the two pilots survived as well. Sadly, the two in the science module did, but since they had very little in the way of courage and were mid-range stupid, I didn\u0027t mind terribly letting them be the first two Kerbals to enter the \u0022Lost\u0022 section of the manifest. Also serves as a reminder to double check my calculations before re-purposing vessels to other roles.\u003C/p\u003E\u003Cp\u003EI\u0027m still working on a way to get that rover to Minmus.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-06-06T23:52:14Z","Content":"\n\u003Cp\u003EDescending over Kerbin for landing and noticing the terrain was blurry, then seeing the blue orb in the core of the planet, then hitting the ground and exploding while the parachutes were only semi-deployed. Evidently the visible terrain didn\u0027t load (so I was just seeing it like when you\u0027re looking from orbit), and nor did whatever bit the parachutes measure altitude against to fully deploy, but there was still something solid.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m still mystified as to how one of my memorial flags planted outside mission control vanished. I definitely didn\u0027t deliberately recover it, and I don\u0027t *think* I accidentally recovered it either. Maybe I hit it with some flying debris in a test launch or something.\u003C/p\u003E\n"},{"CreatedByName":"gamowin","CreatedById":47184,"CreatedDateTime":"2014-06-06T23:55:52Z","Content":"\n\u003Cp\u003EMy rocket falling through the launchpad as soon as it was loaded in, partially blew up, and was then flung at impossible speeds THROUGH planet Kerbin into the void of space forever.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-06-06T23:58:34Z","Content":"\n\u003Cp\u003EMy weirdest experience so far happened rather recently. I discovered that if you use a Klaw on a landed ship to dock to a flying ship (I was trying to use a Klaw as a helipad of sorts to allow ships to land on it and refuel), KSP gets so confused about which ship is doing what that the planet surface disappears, and you completely lost control of both ships and can only watch helplessly as they start falling into a scary black void.\u003C/p\u003E\u003Cp\u003EOddly enough this doesn\u0027t seem to happen if you\u0027re controlling the landed ship at the moment of contact.\u003C/p\u003E\u003Cp\u003ENo screenshots because the Kraken.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-06-07T00:05:44Z","Content":"\n\u003Cp\u003EThe weirdest thing for me was the Hell Kraken destroyed my Minmus lander and then crashed the game. When I reloaded the game, 3 pieces of my lander were reported as being on the surface of the Sun. Sadly I didn\u0027t think to get a screenshot before going to each piece and having it instantly explode.\u003C/p\u003E\n"},{"CreatedByName":"Dat_Spacewaffle","CreatedById":101662,"CreatedDateTime":"2014-06-07T01:12:09Z","Content":"\n\u003Cp\u003Ewhen my ship started shaking like a person who went outside without a coat in -90 degree weather when SAS was enabled. I think it might be the Novapunch Liquid Fueled Boosters, because every other craft I have works fine except the ones with the liquid boosters\u003C/p\u003E\n"},{"CreatedByName":"Victus","CreatedById":104706,"CreatedDateTime":"2014-06-07T01:23:41Z","Content":"\n\u003Cp\u003EMy Kerbals died on impact in their Habitat modded ship (using cheats I landed) but they somehow died and were just twitching in the compartment, it was really freaky.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-06-07T03:58:09Z","Content":"\n\u003Cp\u003EMy kerbal had been out for a hike on Duna, and as he got close to the lander again, the ship suddenly shot off into the distance at great speed. It didn\u0027t fly away, mind you. It just zipped off horizontally and was gone in a second. I loaded a save and tried again, and off the ship went again. I loaded once more and approached walking rather than running, and the ship sat there calmly and allowed the pilot to get in and fly home.\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2014-06-07T04:26:54Z","Content":"\n\u003Cp\u003ETwo days ago I was launching a new module to a spacestation. The decoupler and separation motors shattered for some reason, leaving the module intact but without control or thrust in the middle of a debris cloud. I rendezvoused with a claw to retrieve and re-send the module, but as I approached, I was nearly struck (400 m away) by a peice of debris from a mun mission more than a year ago, at a relative speed of at least 800m/s.\u003C/p\u003E\u003Cp\u003EAll the while, I was listening to the soundtrack to Gravity. (I eventually managed to get the module docked.)\u003C/p\u003E\u003Cp\u003EA good day.\u003C/p\u003E\n"},{"CreatedByName":"smysha","CreatedById":103125,"CreatedDateTime":"2014-06-07T06:33:59Z","Content":"\n\u003Cp\u003EEven before I installed Deadly Reentry, I lost my SSTO/spaceplane/space yacht in reentry into the atmosphere of Laythe. Ship just broke apart. Why? ~6000 m\\s reentry speed, that\u0027s why. Jeb left inside cockpit. All he had is a small room of B9 Mk2 cockpit and 2 radiators from KLSPI. And you know what? Using lifting body effect, I managed to land him in one piece. \u003C/p\u003E\u003Cp\u003EAfther that, I had a stupid idea. I said Jeb to go to EVA - I just wanted to make screenshot. He stood on the top of cockpit, but it was too dark. Then I time-warped...\u003C/p\u003E\u003Cp\u003EAnd that was my first time when I summoned the Kraken.\u003C/p\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2014-06-07T07:05:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EDescending over Kerbin for landing and noticing the terrain was blurry, then seeing the blue orb in the core of the planet, then hitting the ground and exploding while the parachutes were only semi-deployed. Evidently the visible terrain didn\u0027t load (so I was just seeing it like when you\u0027re looking from orbit), and nor did whatever bit the parachutes measure altitude against to fully deploy, but there was still something solid.\u003Cp\u003EAlso, I\u0027m still mystified as to how one of my memorial flags planted outside mission control vanished. I definitely didn\u0027t deliberately recover it, and I don\u0027t *think* I accidentally recovered it either. Maybe I hit it with some flying debris in a test launch or something.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve had the latter happen before. Had a tiny rover like in my avatar parked maybe three hundred metres from the launchpad, so it could watch the launches when I was done field testing it. Sat there very happily and I occasionally used it to access the higher time warps when I was trying to speed up craft in LKO. Never recovered it or anything until one day it was gone. Always assumed some bit of debris nailed it. \u003C/p\u003E\u003Cp\u003EOther weird things: I was goofing around with BASE jumping off the top of the VAB with the personal parachutes. Jeb\u0027s never opened and I couldn\u0027t get him helmet-down in time, but he survived the fall just fine anyway. Which is especially lulz worthy considering how many kerbals I\u0027ve lost just walking around the KSC grounds and going poof on some invisible, odd bit of terrain.\u003C/p\u003E\n"},{"CreatedByName":"J4CKAL2014","CreatedById":111883,"CreatedDateTime":"2014-06-07T13:08:19Z","Content":"\n\u003Cp\u003EWas attempting to dock a manned craft with an observation station I had around the moon, set up a Hohmann transfer and went for time acceleration. Unfortunately, I hadn\u0027t realised that the orbit of my station was so low that my renedevous trajectory...sort of...went through the moon. Next thing I know, my ship is 6km above the moon coming in at 600m/s. Tried desperately to brake with the engines and sort of succeeded - only hit the Mun doing 400m/s! Command capsule exploded, as did the rest of the craft, and I thought Seanfred and Billy-Bobbrett were goners...until the command capsule magically reappeared intact flying away from the surface at around 420m/s about 2 seconds later! :@\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2014-06-07T13:31:16Z","Content":"\n\u003Cp\u003EJust now, I was landing in a Mun canyon, and I came in a bit wrong, ended up coming in fast on the very steep side, 2 legs slammed down on the up hill side and the whole lander flipped over, but the slope was so steep that it it didn\u0027t land down on it\u0027s side, it was falling at the angle as the slope and it flipped right over twice and I was able to fire the engines to slow it just as it hit the bottom. 2 broken legs to fix in Eva but other than that it was totally fine.\u003C/p\u003E\n"},{"CreatedByName":"pauix","CreatedById":11977,"CreatedDateTime":"2014-06-07T14:34:24Z","Content":"\n\u003Cp\u003EToday I went to check on the Kerbals I accidentally stranded on Laythe. They somehow had managed to place the capsule a full kilometer under Laythe\u0027s oceans:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/H44QPkS.jpg\u0022 alt=\u0022H44QPkS.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TotalNewb","CreatedById":109160,"CreatedDateTime":"2014-06-07T14:54:57Z","Content":"\n\u003Cp\u003EAfter deploying parachutes in 4x physics warp:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QacpV2Y.png\u0022 alt=\u0022QacpV2Y.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat barely noticeable thing in the center is a probe core. Also, flying at 0.5c is pretty cool.\u003C/p\u003E\u003Cp\u003EBTW, is there any way to automatically upload screenshots from ksp to imgur?\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2014-06-26T05:05:51Z","Content":"\n\u003Cp\u003Ei had it where for some reason after accidentally kicked a KAS container on Mun, all the kerbals i had stationed in a nearby base had suddenly taken up residence inside the KAS container, it even had an IVA....\u003C/p\u003E\u003Cp\u003Ei have an old \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58588-the-strangest-glitch-i-have-ever-seen\u0022 rel=\u0022external nofollow\u0022\u003Ethread\u003C/a\u003E with screenshots of it\u003C/p\u003E\n"},{"CreatedByName":"ZeObsidianKraken","CreatedById":113536,"CreatedDateTime":"2014-06-26T08:05:28Z","Content":"\n\u003Cp\u003EI hasd just finished a duna landing, and was bringing the crew home when I noticed kerbin didnt look right. then i realised i had somehow timewarped Inside of kerbin. and thats how i ended up with 10 kerbals crashing through the ground next to ksp, and flying off into the sun because the engine had broken.... so KSP can now be an underground exploration simulartor as well i guess.\u003C/p\u003E\n"}]}