{"TopicId":74625,"ForumId":55,"TopicTitle":"Dev speed and what should be next in the pipeline","CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-06-09T23:22:00Z","PageNum":1,"Articles":[{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-06-09T23:22:00Z","Content":"\n\u003Cp\u003EIn light of the lul that is time between KSP updates i find myself swaying to other in development games. Every game developer has their own speed that they want their game to progress. Squad themselves seem to be happy with the current pace of things, with multiple month cycles going between updates. I personally am fine with what ever speed means a quality product. But I also feel speed is a big factor in gaining momentum. \u003C/p\u003E\u003Cp\u003EUpdate .22: addition of a whole new mode, Career, science parts, development,biomes\u003C/p\u003E\u003Cp\u003EUpdate .23: tweaking of Career, new science parts, tweakables\u003C/p\u003E\u003Cp\u003EUpdate .23.5: Asteroids, NASA Involvement, the SLS, and multiple under the hood modifications to improve overall gameplay.\u003C/p\u003E\u003Cp\u003EThe last update took the most time, and .22 also took a large chunk of time. The next update has this so far instore:\u003C/p\u003E\u003Cp\u003EUpdate .24/.25: currency, reputation, contracts, recovery system, newer parts, and new UI features. \u003C/p\u003E\u003Cp\u003EI feel the next update will easily be one of the biggest updates to the game EVER. This could be one of the most focal updates the game has seen and possibly will ever see, as the framework of Career Mode and thus the main game will be set. But once that is done then what? Would it be wise to dive right back into missing fundamentals that need to be addressed such as a new aerodynamic model, or go down to the little things and tweak more parts and add new ones. Or just do housekeeping on what is already implemented partially, such as biomes and tweakables.\u003C/p\u003E\u003Cp\u003EI feel after this update, which is bound to still be far away from being released, the Dev\u0027s should take a step back from the heavy updates. Instead, focus on what needs to be finished, rather than added. Not only has the last update sucked up A LOT of momentum, it also sucked up a lot of time. This next update is bound to take similar amounts of effort, depending on how far back the Dev\u0027s actually had people working on it. (they said they were working on it along with the .23.5 update)\u003C/p\u003E\u003Cp\u003ERegardless i feel the community would appreciate at least a small interval where updates would be more frequent, and changes more minor but much needed. Its one thing to implement large changes in large time frames, another to implement small changes in small amounts of time, and a whole new thing to switch between the two styles. As i said before many things need housekeeping. These things really aren\u0027t much more than half implemented ideas that show great promise, but aren\u0027t finished yet. \u003C/p\u003E\u003Cp\u003EExamples are:\u003C/p\u003E\u003Cp\u003E1. IVA views\u003C/p\u003E\u003Cp\u003E2. Texture updates\u003C/p\u003E\u003Cp\u003E3. SpacePlane parts touchup(goes with the Texture update)\u003C/p\u003E\u003Cp\u003E4. More Biomes\u003C/p\u003E\u003Cp\u003E5. more tweakables\u003C/p\u003E\u003Cp\u003EThis goes along with changes that will defiantly be needed once the next update comes. Such as Currency tweaking, Reputation tweaking and more contract adjustments. Such minor adjustments would \u003Cstrong\u003Emake the game feel closer to finished, than further from it\u003C/strong\u003E. This all goes back to momentum and spirit of the community and their relation to the Dev team. We get the scope of the game still needs to increase, but hell we still only have 3 bodies with biomes???\u003C/p\u003E\u003Cp\u003EI\u0027m not here asking for a new Aerodynamic model, or resources, or mining, or a whole new game play aspect. I\u0027m asking for some focus on what has been done, not what needs to be done. Getting the smaller things out of the way now and giving them to players will respond to what they have been asking for a while. Especially with things such as the age of the Space Plane parts, and limited Biome selection. \u003C/p\u003E\u003Cp\u003EIts time to pick up the pace and pick up some of the pieces, i still can\u0027t see out of my MK3 cockpit!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-09T23:24:14Z\u0022 title=\u002206/09/2014 11:24  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 9, 2014\u003C/time\u003E by MKI\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2014-06-10T11:03:14Z","Content":"\n\u003Cp\u003EI think that there two ways of doing just about anything.\u003C/p\u003E\u003Cp\u003E1. Create a framework, something that gets you through all of the major parts of whatever you are doing so that you can see how all the parts work together, and then go back and modify, flesh out, and just generally improve the framework. (build the frame of a skyscraper before adding walls and lights)\u003C/p\u003E\u003Cp\u003E2. Create each part as a finished product, where everything fits together without much modification, which means that you will have far fewer end-game adjustments and tweaks, but you won\u0027t be able to see what the end product will look like until you are virtually done. (build each floor of the skyscraper in its entirety before adding the next floor)\u003C/p\u003E\u003Cp\u003EThe former seems to be the path that Squad has chosen, and it is the better options for large projects, especially ones where you\u0027re not entirely certain what all you\u0027re going to add to the final product.\u003C/p\u003E\u003Cp\u003EOf course, they are making their framework more fleshed out than I would be comfortable making it (they can release it to the public, after all), but they are still using the framework methodology, I think.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-06-10T11:40:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MKI\u0022 data-cite=\u0022MKI\u0022\u003E\u003Cdiv\u003EExamples are:\u003Cp\u003E1. IVA views\u003C/p\u003E\u003Cp\u003E2. Texture updates\u003C/p\u003E\u003Cp\u003E3. SpacePlane parts touchup(goes with the Texture update)\u003C/p\u003E\u003Cp\u003E4. More Biomes\u003C/p\u003E\u003Cp\u003E5. more tweakables\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with the general idea of an update full of small changes, but not necessary with all your examples:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E1. IVA views\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIf they\u0027re going to do this, they need to do this well. Just a spiffy new interior model will look nice, but that does nothing for playability which is the real problem with current IVAs. RPM improves IVA playability, but it is far more complex than just a new IVA and thus goes against the idea of a small-changes update.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E3. SpacePlane parts touchup(goes with the Texture update)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWhile the spaceplane parts do look like crap, I feel that it be better served by a separate update. Like the IVAs, a nice model/texture will make it look better but the core of the problem with air/spaceplanes is not how they look but how they play. It\u0027s better to design the new parts around a better aerodynamics model and a better atmospheric engine model (the current ones act more like rockets than real airbreathing engines) than having to adjust the new systems around the parts you\u0027ve already made. If they everything in one go, it\u0027s going to be a much better way to for once and for all properly integrate atmospheric flight into the game.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E4. More Biomes\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EVery much agree. The systems are there, all they need to do is come up with more science definitions and assign a biome map to each body.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E5. more tweakables\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAnother \u002B1 from me.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-10T11:45:28Z","Content":"\n\u003Cp\u003EMultiple small updates take more time and testing than one consolidated one. I say that as someone who is just as hungry for updates as everyone else. \u003C/p\u003E\u003Cp\u003EI would love it if 0.25 was a \u0022polishing\u0022 update.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-06-10T12:12:25Z","Content":"\n\u003Cp\u003EThe thing about more biomes is that they will easily and quickly complete the tech tree. Even forgetting rebalancing Minmus, just adding biomes to Duna would easily grant you 1000\u002B points upon return (depending on if you land near a boundary/have a way of visiting more than one biome). Add in a visit to Ike on the way and you really only need one trip to Duna to complete the tree.\u003C/p\u003E\u003Cp\u003EI think what would be best is remake the tech tree. Keep the first half as it is, so people can actually get the tech needed to go places, but add in more nodes, separate out the parts, increase science needed etc.. Otherwise, people can just go to Duna once and be done with the tree. The only reason to go other places would be because you now can, not because you need to. I know the same argument can be made about Minmus now, but that\u0027s because it\u0027s so OP. Should be more in line with the Mun, possibly a little bit higher.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-10T13:00:42Z","Content":"\n\u003Cp\u003EThe economy of science points will change when you\u0027re using them to trade for money or reputation, more biomes without a tech tree rework might still be balanced.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-06-10T13:26:45Z","Content":"\n\u003Cp\u003ESeems like a nice idea to resolve the always constant lack of communication and transparency between the community and developers, also without depeding on \u0027oranges\u0027 to repass information, like forum moderators.\u003C/p\u003E\u003Cp\u003EMy guess is that this will be ignored in favor of maintaining the status quo, like it has always been.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-06-10T14:05:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EThe thing about more biomes is that they will easily and quickly complete the tech tree. Even forgetting rebalancing Minmus, just adding biomes to Duna would easily grant you 1000\u002B points upon return (depending on if you land near a boundary/have a way of visiting more than one biome). Add in a visit to Ike on the way and you really only need one trip to Duna to complete the tree.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe tech tree was balanced based on the biomes available when it was added (Kerbin and Mun). If they add the rest of the biomes, I imagine they\u0027d redo all the science values to compensate. Also filling out the tech tree doesn\u0027t seem to be the end goal of the career mode. The devs have said that it was a way to introduce new players to all the various parts. Exploration is the goal and science, contracts, etc. are ways to help you explore.\u003C/p\u003E\n"},{"CreatedByName":"Jas1126","CreatedById":99760,"CreatedDateTime":"2014-06-10T15:24:09Z","Content":"\n\u003Cp\u003ESomething that really confuses me is why their team is still so small. Are sales so terrible that they can\u0027t bring in a few more people? Temp-hires or volunteers (College students looking for experience) maybe? Just something to speed up progress.\u003C/p\u003E\u003Cp\u003EI thought the point of Early Access was to get more funding for a more efficient development process. Starting to think otherwise.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-10T15:29:16Z","Content":"\n\u003Cp\u003EJas1126, it would be worth your time to learn about The Mythical Man-hour. Adding developers doesn\u0027t necessarily speed development, and can often slow it.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-06-10T22:10:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EJas1126, it would be worth your time to learn about The Mythical Man-hour. Adding developers doesn\u0027t necessarily speed development, and can often slow it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlthough you should be reminded of the Myth of the Genius Programmer. SQUAD has been contracting people known for the quality of their mods above the rest (C7, Bac9, Nova, etc.), which either abandoned development to pursue better opportunities or are on hold taking care of other stuff, instead of working with the team after hiring.\u003C/p\u003E\u003Cp\u003EHow that has helped game development if at all? Who knows...\u003C/p\u003E\n"},{"CreatedByName":"Rowsdower","CreatedById":91811,"CreatedDateTime":"2014-06-10T23:04:58Z","Content":"\n\u003Cp\u003ELet\u0027s get this thread back on track here. Would you prefer updates that continue the size and scope of the way they\u0027ve been going or smaller, more incremental updates?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-10T23:21:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rowsdower\u0022 data-cite=\u0022Rowsdower\u0022\u003E\u003Cdiv\u003ELet\u0027s get this thread back on track here. Would you prefer updates that continue the size and scope of the way they\u0027ve been going or smaller, more incremental updates?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich way do the devs think will allow them to reach feature completeness sooner? That way.\u003C/p\u003E\u003Cp\u003EOf course we as players would like more frequent updates, but I\u0027m not sure that\u0027s what\u0027s best for the game. More releases means more time in the testing phase. More frequent updates means more work for modders to keep their mods compatible rather than developing new features or other mods. Updates often break saves, so there\u0027s the risk that that will happen more frequently. I\u0027d prefer larger less frequent updates to smaller more frequent ones.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-10T23:25:30Z","Content":"\n\u003Cp\u003ELarger more featureful updates please.\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-06-10T23:35:57Z","Content":"\n\u003Cp\u003EThey would do it faster, but Unity causes development hindrances when there is much content, and that\u0027s why they are taking so much time.\u003C/p\u003E\u003Cp\u003EHopefully Unity 5 will cause less problems.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-06-10T23:52:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rowsdower\u0022 data-cite=\u0022Rowsdower\u0022\u003E\u003Cdiv\u003ELet\u0027s get this thread back on track here. Would you prefer updates that continue the size and scope of the way they\u0027ve been going or smaller, more incremental updates?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m definitely down for less frequent but larger updates.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-06-10T23:53:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rowsdower\u0022 data-cite=\u0022Rowsdower\u0022\u003E\u003Cdiv\u003ELet\u0027s get this thread back on track here. Would you prefer updates that continue the size and scope of the way they\u0027ve been going or smaller, more incremental updates?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELess frequent/larger updates with features of quality.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-06-11T01:30:44Z","Content":"\n\u003Cp\u003EIf we\u0027re talking bug fixes, then a good portion of the guys here should stop calling the game an alpha. Since bug fixes are not features.\u003C/p\u003E\u003Cp\u003EAs for the false dilemma, neither. We don\u0027t even know what\u0027s been done in regards to features/updates to choose between frequent or eventual updates.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-06-11T15:58:01Z","Content":"\n\u003Cp\u003EI\u0027d rather have frequent small updates. Just to keep me interested.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-06-12T18:29:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MKI\u0022 data-cite=\u0022MKI\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E1. IVA views\u003C/p\u003E\u003Cp\u003E2. Texture updates\u003C/p\u003E\u003Cp\u003E3. SpacePlane parts touchup(goes with the Texture update)\u003C/p\u003E\u003Cp\u003E4. More Biomes\u003C/p\u003E\u003Cp\u003E5. more tweakables\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think 4 and 5 are entirely reasonable and i expect to see some of that in the near future. \u003C/p\u003E\u003Cp\u003EBut the other points are about game assets many of which might very well be just placeholders. No point in updating those if they will eventually be replaced by better prettier assets.\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2014-06-12T19:16:19Z","Content":"\n\u003Cp\u003EPoint 3 is on the agenda for the near future from what Maxmaps told us in a squadcast two or three weeks ago. Hugo is probably working on that already, as per what was written in the recent devnotes.\u003C/p\u003E\u003Cp\u003EAs far as the rate of development is concerned, I think that the current approach is good. Release when a feature is fully functional even if it lacks content. There are pretty big frameworks that have to be implemented so it is better the devs can do them start to finish.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-06-12T19:18:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Javster\u0022 data-cite=\u0022Javster\u0022\u003E\u003Cdiv\u003EI\u0027d rather have frequent small updates. Just to keep me interested.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, IMO Squad puts \u003Cem\u003Ea lot\u003C/em\u003E more polish into each of their updates than many other indy studios with early access games, which is one possible reason that development moves at its current pace. I would also prefer more frequent smaller updates.\u003C/p\u003E\u003Cp\u003EAlso on this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rowsdower\u0022 data-cite=\u0022Rowsdower\u0022\u003E\u003Cdiv\u003ELet\u0027s get this thread back on track here. Would you prefer updates that continue the size and scope of the way they\u0027ve been going or smaller, more incremental updates?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy statement above stands, fully understanding we\u0027d get multiple smaller updates with a few parts, tweaks, opimizations, etc, before we get the \u003Cem\u003Ebig\u003C/em\u003E systematic updates, contracts, budgets and... Uh... whatever else in the realm of \u0022scope complete\u0022 that I can\u0027t add because Squad won\u0027t say what that is.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, I would understand if \u003Cem\u003Eany\u003C/em\u003E update has some bugs when it goes live. Because that\u0027s part of \u0022early access\u0022.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-12T19:23:39Z\u0022 title=\u002206/12/2014 07:23  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 12, 2014\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-06-13T12:01:50Z","Content":"\n\u003Cp\u003EI have no problem with few but large updates, but i do think there is a place for the occasional hotfix. There have been a few in the past, but also some not that i think should have been: the fuel usage bug, and currently the glitchy ARM stack decoupler. It\u0027s hard to imagine those are not trivial to fix (a mod that fixed the fuel usage bug was created only a few days after release, and the stack decoupler is just a part using well established code, looks like something was goofed).\u003C/p\u003E\n"},{"CreatedByName":"boony","CreatedById":97469,"CreatedDateTime":"2014-06-13T12:13:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EWhich way do the devs think will allow them to reach feature completeness sooner? That way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E100% agree. \u003C/p\u003E\u003Cp\u003ELatest dev note from Harvester covers that topic:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003EWorking with minimal content during development isn\u0027t a bad thing for developers. I can\u0027t count how many times I\u0027ve dreaded the prospect of having to go through all the 170\u002B parts and their configs, to make some tweak or another. Having less parts in the game would have certainly made life easier for us on many a situation... It would also have made for a much less interesting game. This, as with so many other things, is something we have to maintain in balance.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo 4 and 5 may slow down development in the long run, which means a -1 from me.\u003C/p\u003E\u003Cp\u003E1 and 2 seem like eye candy and so i can forego it in favour of new features. \u003C/p\u003E\u003Cp\u003ELess frequent updates mean less frequent waiting for mods and installs, so that\u0027s absolutely fine with me.\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2014-06-14T01:13:20Z","Content":"\n\u003Cp\u003EI\u0027m pretty happy with the current rate of updates.\u003C/p\u003E\u003Cp\u003EI would love to see more dev-blogs in the vein of Harvesters procedural craters article however. Part of the appeal of buying into the early-access / alpha model (to me at least), is the potential to get an insight to the development process itself.\u003C/p\u003E\n"}]}