{"TopicId":7472,"ForumId":21,"TopicTitle":"Tiny 1","CreatedByName":"Twinky827","CreatedById":17455,"CreatedDateTime":"2012-03-03T15:52:20Z","PageNum":1,"Articles":[{"CreatedByName":"Twinky827","CreatedById":17455,"CreatedDateTime":"2012-03-03T15:52:20Z","Content":"\n\u003Cp\u003EI liked the Little Sipper very much for it\\\u0027s smallness and i wanted to come up with something similar. This design, Tiny 1, is heavier but easier to fly than Little Sipper, as it has an advanced SAS unit. I hope everyone enjoys. Note: Once again I am using the small rocket idea from Little Sipper which was not my idea. Also Jackariah is the craft tiny 1 was just the first launch to mun.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-03-05T11:56:18Z","Content":"\n\u003Cp\u003EHi Twinky827\u003C/p\u003E\u003Cp\u003EI hope you don\\\u0027t mind, but I repaired your Tiny 1 rocket, it now has more power and can not only reach orbit, it should also be able to get to the Mun and come back again, making it a decent Medium orbiter.\u003C/p\u003E\u003Cp\u003EI think its too heavy to land on the Mun though, but I left the landing legs on because its possible to land on Kerbin with them, all you have to do is, before you need to land, drag stage 1 above stage 0 so the decoupler won\\\u0027t fire, open the chute and use a little thrust to help slow you down for a safe landing.\u003C/p\u003E\u003Cp\u003EHave fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2012-03-05T17:31:49Z","Content":"\n\u003Cp\u003EHere\\\u0027s an even more improved version. All engines have been replaced by LV-T30\\\u0027s. This increases your thrust and fuel efficiency. The winglets and some non-essential struts were taken away to conserve mass. I have not done a full flight test on it yet, but maybe you can try it out before I do later today.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-03-05T18:40:07Z","Content":"\n\u003Cp\u003EI like the Mk3 but I\\\u0027d have kept an LV-T45 engine on the main section of the rocket, the vectoring thrust would improve control.\u003C/p\u003E\u003Cp\u003EAnd there\\\u0027s no need to make the pipes so short, they added a spot of colour \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2012-03-05T22:09:50Z","Content":"\n\u003Cp\u003EIn the case of a tall or wide rocket with a high moment of inertia, thrust vectored engines make sense in terms of maneuverability. However, this rocket is neither, and thus does not require vectored thrust. If you need to make rapid changes in pitch or heading on your way to orbit, you\\\u0027re doing something wrong.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-03-05T22:18:23Z","Content":"\n\u003Cp\u003EHey I just know what works for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EVectored thrust can alleviate many control issues, but it\\\u0027s Twinkys rocket and that was the way I found it.\u003C/p\u003E\n"},{"CreatedByName":"Twinky827","CreatedById":17455,"CreatedDateTime":"2012-03-05T22:36:50Z","Content":"\n\u003Cp\u003EThanks for making all these updates! I\\\u0027m not the best rocket scientist as my signature says, but I get along..... With help....\u003C/p\u003E\n"},{"CreatedByName":"Twinky827","CreatedById":17455,"CreatedDateTime":"2012-03-05T22:57:08Z","Content":"\n\u003Cp\u003EBoth can get there.... But its either my inexperience (probably) but it blew into the mun WAY too fast and I couldn\\\u0027t stop its because, well I didn\\\u0027t have enough fuel\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-03-05T23:04:26Z","Content":"\n\u003Cp\u003Eyou\\\u0027ll make it, when your orbit changes to the Mun you may need to thrust sideways to get the line out of the ground, I like to get it so it shows my pariapsis is about 5k.\u003C/p\u003E\n"}]}