{"TopicId":74742,"ForumId":16,"TopicTitle":"Symmetry options?","CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-06-11T06:48:44Z","PageNum":1,"Articles":[{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-06-11T06:48:44Z","Content":"\n\u003Cp\u003Eokay.... Mods: Please feel free to move this question elsewhere if this is the wrong spot. \u003C/p\u003E\u003Cp\u003EI was screwing around playing with a hidden symmetry mode thanks to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/82717-I-Just-Bugged-the-Game-into-Five-Sided-Symmetry?highlight=fold\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread here\u003C/a\u003E and made a 5X symmetry satellite that I parked in orbit at Eve, because why not? And I had a question pop into my head. I asked it in a diff thread, but decided a full thread is warranted.\u003C/p\u003E\u003Cp\u003EOkay, here it is: We all know about the traditional symmetries this game offers, 1, 2, 3, 4, 6 and 8 times symmetry. My question is this: IF you can glitch the game into 5X and \u0026lt;someone else did 7X\u0026gt; why are these not STANDARD symmetry modes? I mean, they are stable and will fly, which, to my limited knowledge of coding tells me, its in the game somewhere, why not make this spectacular stuff default options?\u003C/p\u003E\u003Cp\u003EDevs?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-11T07:47:15Z","Content":"\n\u003Cp\u003EI think it is because they don\u0027t work well with angle snap feature.\u003C/p\u003E\u003Cp\u003EEditor has 15 degree angle snap (don\u0027t confuse with 5 degree rotation step) and that means you have 24 steps into full circle. That number is divisible by 2, 3, 4, 6, 8, but not by 5 and 7.\u003C/p\u003E\u003Cp\u003EIf you build something in 6-fold symmetry, you can attach a single piece on any of the symmetric parts and still have it \u0022straight\u0022.\u003C/p\u003E\u003Cp\u003EIf you use 5-fold symmetry, it won\u0027t allow you to put the additional piece straight on any but the one initial part.\u003C/p\u003E\u003Cp\u003ESo IMO the idea was that provided symmetry modes were enough and comfortable to use.\u003C/p\u003E\u003Cp\u003EI am not really missing x5 or x7 symmetries, what I\u0027d like to see is subsymmetries (build something at x6, then place something on it in x2 or x3 - or even break it up into two x3 or three x2 groups) and maybe more symmetry modes such as mirror symmetry in VAB, and x4 mirror and x8 mirror symmetries in both VAB and SPH.\u003C/p\u003E\n"},{"CreatedByName":"thescientist","CreatedById":69046,"CreatedDateTime":"2014-06-11T10:07:40Z","Content":"\n\u003Cp\u003EI think the game has some problems to simulate exactly the position of x7 simmetries and such.\u003C/p\u003E\u003Cp\u003EAnyway, I think the goal of the mod is exacly filling that gap to give you a better playing experience. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2014-06-11T10:17:51Z","Content":"\n\u003Cp\u003EI don\u0027t know why it is not in game but kasuha reasons seem to be good for me.\u003C/p\u003E\u003Cp\u003EAs an alternative you could use \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/38768-0-23-5-Editor-Extensions-v1-1-2-Apr-2014-(EdTools-Editor-Tools-replacement)\u0022 rel=\u0022external nofollow\u0022\u003EEditor Extensions mod\u003C/a\u003E to add more freedom in your creation.\u003C/p\u003E\u003Cp\u003EAlso as well explained in the last \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/content/284-0-24-Update-Update-2\u0022 rel=\u0022external nofollow\u0022\u003Eharvester article\u003C/a\u003E, they have just implemented the bare minimum to test features and will in few updates start adding meat to those feature.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-11T10:21:41Z","Content":"\n\u003Cp\u003EThe Editor Extensions mod UbioZur mentions is a symmetry lover\u0027s dream. 1x-50x symmetry modes, plus more angle snap options, is delightful. Can\u0027t recommend it enough.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-11T15:34:53Z","Content":"\n\u003Cp\u003E5x symmetry does look nice, but the angle snap does make it a nightmare to line other stuff up.\u003C/p\u003E\u003Cp\u003EI think I agree that I would prefer more complex symmetry options.\u003C/p\u003E\u003Cp\u003EFor example, having only two objects of a 3-way symmetry. That leaves that third spot open for me to attach something different. So I suppose what would work out better for this is if you could remove just one of the symmetrically placed items and the rest remain\u003C/p\u003E\u003Cp\u003EThe SPH symmetry definitely needs some work. I\u0027m not even sure I can describe it, but some of the placement and symmetry is darn annoying. More mirror options would be nice.\u003C/p\u003E\u003Cp\u003EBut then again, how much is too complex for the basic game? You don\u0027t want to scare people off, but also want to make enough options for advanced users...\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-11T19:34:34Z","Content":"\n\u003Cp\u003EThen there are things that are clear errors IMO. For instance if you place a girder radially on something, you can place another girder right beside it with no problems.\u003C/p\u003E\u003Cp\u003EThen if you place a Stayputnik on top of that first girder, the surface right beside that first girder becomes bumpy all of a sudden. IMO the surface normal vector is overriden by that second object you added on top of that girder because the style how it gets bumpy corresponds to shape of that object.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/DVR47\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ftPwvX8.png\u0022 alt=\u0022ftPwvX8.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-11T19:38:56Z\u0022 title=\u002206/11/2014 07:38  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 11, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-11T23:14:55Z","Content":"\n\u003Cp\u003EYes, what Kasuha just showed. I was going to try and describe it but it was too difficult without pictures. That craziness happens all the time in the SPH. Very annoying.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-06-12T06:39:27Z","Content":"\n\u003Cp\u003EI think all of yall are making good points, but, I would LOVE for a Dev to chime in on this as well.\u003C/p\u003E\u003Cp\u003EJust some food for thought:\u003C/p\u003E\u003Cp\u003Eto increase the number of symmetry options in STOCK w/out the use of a mod, would, I think only require 2 things: adding in more degrees/steps to each circle AND adding in the number of symmetry options to sync up with the new steps.\u003C/p\u003E\u003Cp\u003EBUT, honestly, please, Id love a Dev to step in here and bandy out their thoughts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E :) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}