{"TopicId":74904,"ForumId":55,"TopicTitle":"Tracking Beacons","CreatedByName":"palioxis1248","CreatedById":100635,"CreatedDateTime":"2014-06-13T03:46:06Z","PageNum":1,"Articles":[{"CreatedByName":"palioxis1248","CreatedById":100635,"CreatedDateTime":"2014-06-13T03:46:06Z","Content":"\n\u003Cp\u003EIn light of the upcoming budget system, I\u0027m anticipating that throwing away rocket parts might cost money.\u003C/p\u003E\u003Cp\u003EThe problem/situation is familiar to everyone. You\u0027ve got your rocket flying below 35km or something like that. You jettison stages, equipped with parachutes that you\u0027ve verified can return the stages safely to the surface. But as the stages slide past 2.5km, they vanish, claimed by the Kraken or what have you. And your well thought-out recovery plan is turned to so much hot air.\u003C/p\u003E\u003Cp\u003EClearly this is unsustainable if we\u0027re gonna start charging fees for these disappearing stages. If only there was a way to keep the game from ignoring those stages past 2.5km!\u003C/p\u003E\u003Cp\u003ENow I know what some of you are gonna say. Mods! There are mods out there that can extend your physics range to 100km and more!\u003C/p\u003E\u003Cp\u003EI\u0027ve got two problems with that.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EIncreasing the physics range to 100km induces all sorts of lag as the game tries to simulate everything around, below and above your rocket.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESince the issue we\u0027re addressing here is critical to enabling a stock feature to work well, I don\u0027t think just asking players to download a mod to solve a stock problem is very thoughtful.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo here\u0027s my suggestion. All probe bodies and command pods will contain what we shall call a Tracking Beacon. This tracking beacon allows the game to selectively continue rendering physics for any object attached to it. Also included will be a separate radially mounted Tracking Beacon Unit, that serves the same function but doesn\u0027t allow you to control the parts. When spent stages equipped with Tracking Beacons are detached and slide past 2.5km, the game continues selectively rendering these objects all the way until the Tracking Beacon, which will draw power at a rate similar to small probes, runs out of power, the stage has splashed down, it has been recovered, or the Tracking Beacon has been deactivated (with a right-click context menu option/action group of course). This would allow a simple (methinks) solution to the Disappearing Stage problem, and finally allow us to recover and reuse those lower stages.\u003C/p\u003E\u003Cp\u003EOf course, I\u0027m not a game designer, so I\u0027m not sure that selectively rendering specific parts is as easy as I think it is. Suggestions/criticisms are therefore welcome and encouraged. And if the idea is solid, maybe someone float it over to Squad...?\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-06-13T03:54:21Z","Content":"\n\u003Cp\u003EI believe that the now-unavailable TT NeverUnload add-on had similar functionality, so this idea is definitely feasible from a technical perspective. \u003C/p\u003E\u003Cp\u003EI wouldn\u0027t mind seeing this as a stock feature myself.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-06-13T04:57:38Z","Content":"\n\u003Cp\u003EInstead of tracking these expended stages to the ground, it could be simpler to model conditions for recovery\u003C/p\u003E\u003Cp\u003EParts passing out of the 2.5kM \u0027atmospheric window\u0027 are checked for conditions (i.e. parachutes \u002B will land in water, parachutes\u002Blegs\u002Bwill hit land, etc) before being unloaded by the game, anything that meets the recovery conditions is automatically recovered at some calculated \u0027touchdown\u0027 recovery time (or appears in the tracking station to recover).\u003C/p\u003E\u003Cp\u003EPerhaps there will be a time delay or reduced value depending on how far away from KSC parts are recovered from\u003C/p\u003E\n"},{"CreatedByName":"palioxis1248","CreatedById":100635,"CreatedDateTime":"2014-06-13T08:54:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoMrBond\u0022 data-cite=\u0022NoMrBond\u0022\u003E\u003Cdiv\u003EInstead of tracking these expended stages to the ground, it could be simpler to model conditions for recovery\u003Cp\u003EParts passing out of the 2.5kM \u0027atmospheric window\u0027 are checked for conditions (i.e. parachutes \u002B will land in water, parachutes\u002Blegs\u002Bwill hit land, etc) before being unloaded by the game, anything that meets the recovery conditions is automatically recovered at some calculated \u0027touchdown\u0027 recovery time (or appears in the tracking station to recover).\u003C/p\u003E\u003Cp\u003EPerhaps there will be a time delay or reduced value depending on how far away from KSC parts are recovered from\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThought about that too, but the problem is short of modelling the whole process for itself it\u0027s pretty hard for the game to decide what constitutes a successful landing. Any rules of thumb implemented would discount certain... interesting recovery methods methinks. I dunno. Maybe this \u003Cem\u003Eis\u003C/em\u003E easier...\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-13T10:07:57Z","Content":"\n\u003Cp\u003EGood idea but the whole thing of tracking beacon \u002B calculate physics for parts looks like too complicated regarding what was already done in KSP.\u003C/p\u003E\u003Cp\u003ESuccessful landing is not such process resources demanding as you have mass \u002B number of chutes \u002B chutes capabilities \u002B parts resistance, all mixed can give you just enough to make something good enough for the task.\u003C/p\u003E\u003Cp\u003ETracking should be automatic I guess as NASA boosters recovery process, I think they just use a radar to get the approximate landing zone.\u003C/p\u003E\u003Cp\u003EThen if the code is smart designed enough, someone could create mod (part failure thing) to add some random \u0022spicy\u0022 which make sometimes there is bad luck and parts are destroyed partially or not.\u003C/p\u003E\u003Cp\u003EAnyway, there is a big issue to fix first as even manned command pod with a kerbal inside disappear outside this 2.5 kms range, even when there is chutes, engine, anything attached to them.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-13T11:00:36Z","Content":"\n\u003Cp\u003EPersonally I\u0027m kinda hoping there will be money refunds on any parts you recover and equal refunds on any parts that disappear in Kerbin\u0027s atmosphere (\u0022automatic recovery\u0022). With that, you\u0027ll not have to care about the fate of stages you drop on your ascent and the game will not have to deal with player requests for following them all the way to surface.\u003C/p\u003E\u003Cp\u003EWithout refunds, fully reusable (launch once, fly forever) ships would have too much of advantage.\u003C/p\u003E\u003Cp\u003EWith refunds for recovery only, SSTO/spaceplanes would have too much of advantage.\u003C/p\u003E\n"},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2014-06-13T11:53:55Z","Content":"\n\u003Cp\u003EWell, I think that there is an obvious solution to part recovery. As aerodynamics stand now there are only three points during reentry when your air/spacecraft is under any real stress:\u003C/p\u003E\u003Cp\u003EWhen parachutes first open\u003C/p\u003E\u003Cp\u003EWhen parachutes deploy\u003C/p\u003E\u003Cp\u003EOn touching the ground\u003C/p\u003E\u003Cp\u003EWhat I would do is create a \u0022simplified\u0022 physics simulation for any craft containing a parachute to determine whether or not your craft would survive these three points (simplified instead of full so that it can be done at time warp). The simulation would first determine what orientation your craft is likely to fall at, and then uses that orientation for the initial parachute calculations. If the simulation determines that your reentering object is shredded, it would continue to simulate any debris that contains a parachute until it hits the ground. Your craft would then be re-oriented by the simulation to match its new likely fall angle caused by the opening of the parachutes. The \u0022full\u0022 parachute opening would work similarly. Hitting the ground would be the tough one to simulate, I think. When your craft touches down, it would, of course, simulate the effects of hitting the ground. If you land on a slope, your craft may buckle and tip over. If the craft has many parts, it could buckle under its own weight. There are a lot of variables in this situation. Any debris that falls off will also have a simulation run to determine its landing site. The simulation would run for each piece of debris until it has reached a \u0022stable\u0022 position.\u003C/p\u003E\u003Cp\u003EI know that its probably more complicated than I make it sound, and someone would probably find a way to exploit it. Perhaps the simplified simulation could be made to be a bit more unforgiving than the actual full simulation.\u003C/p\u003E\u003Cp\u003EIt would also have to be updated to work with more advanced aerodynamics, when we get them.\u003C/p\u003E\u003Cp\u003EThat\u0027s how I would try and do it. Maybe I should make a mod.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-13T12:35:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vaporo\u0022 data-cite=\u0022Vaporo\u0022\u003E\u003Cdiv\u003EWell, I think that there is an obvious solution to part recovery. As aerodynamics stand now there are only three points during reentry when your air/spacecraft is under any real stress:\u003Cp\u003EWhen parachutes first open\u003C/p\u003E\u003Cp\u003EWhen parachutes deploy\u003C/p\u003E\u003Cp\u003EOn touching the ground\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are drogue chutes, too.\u003C/p\u003E\u003Cp\u003EEach parachute can have different setting for the height at which it opens\u003C/p\u003E\u003Cp\u003EThe moment when parachute is deployed plays role, too. In some times you save your ship by deploying the chute later or even below the full open height.\u003C/p\u003E\u003Cp\u003EThe way how the ship is oriented when the chute opens may play important role.\u003C/p\u003E\u003Cp\u003EIn the end your simplified simulation isn\u0027t that much simpler than full physics simulation.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-06-13T12:42:17Z","Content":"\n\u003Cp\u003Ehere was my imput in a similar thread: \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003Esome minecraft mods have \u0022chunk loaders\u0022 that keep areas of the game world loaded, no matter how far you are from it. perhaps squad could add a \u0022tracking beacon\u0022 part that would keep a craft loaded. to prevent it from being loaded all the time and eating up processor power, make it toggleable from the map view.\u003Cp\u003Efor example:\u003C/p\u003E\u003Cp\u003Ein orbit over kerbin.\u003C/p\u003E\u003Cp\u003Emap view, click your ship, click \u0022activate tracking beacon\u0022\u003C/p\u003E\u003Cp\u003Ebegin your re-entry to kerbin\u003C/p\u003E\u003Cp\u003Edetach your \u0022science pod\u0022 or whatever you wish to call it (ensure it has the beacon not the command craft!)\u003C/p\u003E\u003Cp\u003Efollow the command craft to touchdown\u003C/p\u003E\u003Cp\u003Euse tracking station to recover the science pod\u003C/p\u003E\u003Cp\u003Eas for recovering booster stages i think the game should auto-recover them provided they have: 1.deployed chutes and 2. a ratio of 1 chute for every 6 tons?(is that reasonable? i dont view the weight of my craft ever)\u003C/p\u003E\u003Cp\u003Ethen bigger boosters would need more chutes, cuz realisim or something...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ein hindsight i would make the beacon togglable by rightclicking it like we do solar panels, not via map view.\u003C/p\u003E\u003Cp\u003Ethis would be great for dropping a line of probes to find landing sites on duna for example.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-13T13:06:51Z\u0022 title=\u002206/13/2014 01:06  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 13, 2014\u003C/time\u003E by r4pt0r\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-06-13T14:14:07Z","Content":"\n\u003Cp\u003EWell here\u0027s my few cents regarding this matter:\u003C/p\u003E\u003Cp\u003ETracking beacons will not be necessary here. As long as your ship stays as whole you be fine. Now the first time a stage is getting rid of some parts of your rocket it would be required to make a new physics thread for the new subship and continue to calculate it\u0027s physics until it either touches down, explodes or ends up on a rail. Because at the moment there is only one physics thread this situation would be ideal to make a new physics thread in the program. Nowadays everyone uses CPU\u0027s with more cores, give them some load to compute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt would\u0027nt slow anything as long as new physics threads are made for all subships and as lonsg as the number of this subships stay overlookable. The only question that remains here, what to do when switching to the spacecenter?\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-13T14:57:05Z","Content":"\n\u003Cp\u003EI think the concept of having parts selectively tracked using tracking beacons or different physics threads are both elegant solutions.\u003C/p\u003E\u003Cp\u003EThe difficulty, I believe, comes from how the underlying game co-ordinates system works.\u003C/p\u003E\u003Cp\u003EKSP has objects covering vast distances, and the game must use some point or other as the origin for figuring out where things are. The problem with setting the origin to the sun (say) is that the numbers for the distance between the sun and your ships get very, very large. As the numbers get larger and larger the room for precision gets smaller and smaller, and you start getting rounding errors. This is where the kraken came from: different parts of your ship in very slightly different positions end up with differently rounded numbers and your ship ends up being torn apart.\u003C/p\u003E\u003Cp\u003ESquad\u0027s solution to this was elegant: make the origin of the world be the ship itself! In other words, the origin of the game\u0027s co-ordinate system actually moves with you. Since only things in a short range of the \u0022active\u0022 ship are ever undergoing physics calculations the distance to any of those things is small and there is no problem with rounding.\u003C/p\u003E\u003Cp\u003EBut the limitation of this is that you can\u0027t load things a long way away. Mods that extend the physics range are extending the range from the active vessel. Squad chose 2.5km, and yeah, mods can push this higher. 100km is still a small enough distance that rounding issues won\u0027t pop up, so no worries there. But if you have a \u0022tracking beacon\u0022 style part that selectively runs physics no matter how far away the part is, the kraken will resurface.\u003C/p\u003E\u003Cp\u003ERunning multiple different physics threads could, I suppose, be done if each thread also had a moving origin... but does this run into limitations regarding the inability of running multithreaded physics in unity? Possibly.\u003C/p\u003E\u003Cp\u003EI agree that being able to recover spent stages does seem pretty important. Some imaginative thinking is going to be needed to make it work, though, given the hurdles outlined above.\u003C/p\u003E\n"},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2014-06-13T15:00:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EThere are drogue chutes, too.\u003Cp\u003E Each parachute can have different setting for the height at which it opens\u003C/p\u003E\u003Cp\u003E The moment when parachute is deployed plays role, too. In some times you save your ship by deploying the chute later or even below the full open height.\u003C/p\u003E\u003Cp\u003E The way how the ship is oriented when the chute opens may play important role.\u003C/p\u003E\u003Cp\u003E In the end your simplified simulation isn\u0027t that much simpler than full physics simulation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Yes, there are drogue chutes, and chutes that open at different altitudes and etc. etc. etc. What you would do is run the simulation (even if unsimplified) for each time a chute opens. However, this system would mostly exist to return spent stages to Kerbin, which are generally just dropped boosters and fuel tanks with one or two simultaneously opening parachutes, not big complicated landers with numerous chute opening altitudes. (People would do it, though.) Also, the system would be there only to \u003Cem\u003Epotentially\u003C/em\u003E make physics on returning craft more lightweight, not \u003Cem\u003Eguarantee\u003C/em\u003E that there will be lightweight physics calculations on returning craft. (if you make a big enough craft *cough*Whackjob*cough*, even simplified physics will lag.)\u003C/p\u003E\u003Cp\u003E I suggested simplified physics so that the return system would be lightweight and usable at timewarp. If the devs can get full physics to work on reentering craft with reasonable speed while the focused ship is at timewarp, and at a very great distance from the reentering craft, then there is no real need for simplified physics, in which case the originally suggested beacon system would probably be better.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-13T15:10:44Z\u0022 title=\u002206/13/2014 03:10  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 13, 2014\u003C/time\u003E by Vaporo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-13T15:15:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EBut if you have a \u0022tracking beacon\u0022 style part that selectively runs physics no matter how far away the part is, the kraken will resurface.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E... and, thinking about it a little more, maybe that\u0027s OK...\u003C/p\u003E\u003Cp\u003EIf the game continues to use the current origin on the active vessel, then the active vessel will have no kraken issues. The parts that are susceptible to kraken attack will be the spent stages you are dropping back to a surface. \u003C/p\u003E\u003Cp\u003EWhy might this be acceptable? A few reasons:\u003C/p\u003E\u003Cp\u003E1) It\u0027s unlikely that these parts are ever going to be more than, say, a few thousand km away from the active vessel by the time they hit the ground. This is probably still within \u0022high precision\u0022 range, and so kraken attacks will be rare. \u003C/p\u003E\u003Cp\u003E2) Extending the physics range out to a few thousand km raises the problem of performance when you have several ships in orbit all being loaded, but if we only selectively run physics on distant objects (using a tracking beacon style mechanic) then this problem is eliminated\u003C/p\u003E\u003Cp\u003E3) Even if kraken attacks do occur they should be fairly rare. And even if they do occur, maybe we can just say that spent stages sometimes break, and that\u0027s OK.\u003C/p\u003E\u003Cp\u003E4) We could add the provision that even if something is being tracked, physics for the object are disabled once it reaches the surface.\u003C/p\u003E\u003Cp\u003EPut together this might work quite well, as long as players are willing to accept the occasional, probabilistic loss of, or damage to, spent stages.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-13T15:24:24Z","Content":"\n\u003Cp\u003E... But thinking about it a little more \u003Cem\u003Ea little more\u003C/em\u003E, this does mean you would not be able to switch to another vessel, or back to the space centre, until your spent stages had reached the surface. Or at the very least, doing so would mean the loss of the spent stages (since they will go \u0022on rails in atmosphere\u0022 and therefore disappear).\u003C/p\u003E\u003Cp\u003EThis might be somewhat counter-intuitive. I can certainly imagine a whole ton of posts from players asking why their spent stages disappeared.\u003C/p\u003E\u003Cp\u003ESimilarly, you wouldn\u0027t be able to put the active vessel into rails warp until the spent stages hit the surface.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-13T15:27:20Z\u0022 title=\u002206/13/2014 03:27  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 13, 2014\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-13T15:25:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vaporo\u0022 data-cite=\u0022Vaporo\u0022\u003E\u003Cdiv\u003EYes, there are drogue chutes, and chutes that open at different altitudes and etc. etc. etc. What you would do is run the simulation (even if unsimplified) for each time a chute opens. However, this system would mostly exist to return spent stages to Kerbin, which are generally just dropped boosters and fuel tanks with one or two simultaneously opening parachutes, not big complicated landers with numerous chute opening altitudes. (People would do it, though.) Also, the system would be there only to \u003Cem\u003Epotentially\u003C/em\u003E make physics on returning craft more lightweight, not \u003Cem\u003Eguarantee\u003C/em\u003E that there will be lightweight physics calculations on returning craft. (if you make a big enough craft *cough*Whackjob*cough*, even simplified physics will lag.)\u003Cp\u003E I suggested simplified physics so that the return system would be lightweight and usable at timewarp. If the devs can get full physics to work on reentering craft with reasonable speed while the focused ship is at timewarp, and at a very great distance from the reentering craft, then there is no real need for simplified physics, in which case the originally suggested beacon system would be better.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour idea is sure interesting and I would not object if it was put into the game. \u003Cstrong\u003EIn my opinion\u003C/strong\u003E, though, it is not realistic to expect that it will be since it is a lot of work. Particularly - however simple you consider it to be - a lot more work than other solutions.\u003C/p\u003E\u003Cp\u003ETime spent on implementing any temporary/placeholder functionality is time wasted and needs to be minimized. Therefore I believe that if devs care at all, they will look for simplest possible reasonable solution.\u003C/p\u003E\n"},{"CreatedByName":"ThirdHorseman","CreatedById":77825,"CreatedDateTime":"2014-06-13T15:57:23Z","Content":"\n\u003Cp\u003EI am sure Squad has a mechanism planned out for this, because in a \u003Ca href=\u0022https://kerbaldevteam.tumblr.com/post/87746064424/devnote-tuesdays-the-yadda-yadda-yadda-edition\u0022 rel=\u0022external nofollow\u0022\u003E recent Devnote\u003C/a\u003E Felipe talked about recovery of parts that you were testing for a contract:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENot only that, you also get to test parts which you havenÃ¢â‚¬â„¢t researched yet, which means we had to add a system to support these Ã¢â‚¬ËœexperimentalÃ¢â‚¬â„¢ parts. The main difference when testing an experimental part is that youÃ¢â‚¬â„¢ll get a limited amount of them. If you destroy them before completing the test, you will fail. In cases like SRBs, which are one-shot only, performing the test outside the target conditions wonÃ¢â‚¬â„¢t mean instant failure, but be prepared to recover that one-off prototype intact.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ESpeaking of recovery, thereÃ¢â‚¬â„¢s been a lot of progress done there as well. The Ã¢â‚¬Å“Science SummaryÃ¢â‚¬Â dialog is being overhauled into a complete Ã¢â‚¬Å“Mission SummaryÃ¢â‚¬Â, which will show not only the recovered experiment data from a mission, but also the parts you recovered (and how much funds you got back from them), as well as crews. For experimental Ã¢â‚¬ËœprototypeÃ¢â‚¬â„¢ parts, recovery also re-stocks them so you get to launch them again, in case the contract is still incomplete.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESo not sure if this \u0022recovery\u0022 he speaks of means landing a ship intact, or recovery of parts you have staged off your ship...although he does specifically mention SRBs which tend to be dropped so I would hope they have a mechanic in place to recover parts that you detach. I\u0027m sure we\u0027ll hear more about this as the next update gets closer to release. I mean, they wouldn\u0027t implement a budget and part recovery system without thinking about recovering jettisoned stages, right?\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-06-13T16:29:43Z","Content":"\n\u003Cp\u003Esimply add a parachute or 2 to parts that will hit kerbin?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-13T17:50:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThirdHorseman\u0022 data-cite=\u0022ThirdHorseman\u0022\u003E\u003Cdiv\u003EI am sure Squad has a mechanism planned out for this, because in a \u003Ca href=\u0022https://kerbaldevteam.tumblr.com/post/87746064424/devnote-tuesdays-the-yadda-yadda-yadda-edition\u0022 rel=\u0022external nofollow\u0022\u003E recent Devnote\u003C/a\u003E Felipe talked about recovery of parts that you were testing for a contract:\u003Cp\u003E\u003Cem\u003ENot only that, you also get to test parts which you havenÃ¢â‚¬â„¢t researched yet, which means we had to add a system to support these Ã¢â‚¬ËœexperimentalÃ¢â‚¬â„¢ parts. The main difference when testing an experimental part is that youÃ¢â‚¬â„¢ll get a limited amount of them. If you destroy them before completing the test, you will fail. In cases like SRBs, which are one-shot only, performing the test outside the target conditions wonÃ¢â‚¬â„¢t mean instant failure, but be prepared to recover that one-off prototype intact.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ESpeaking of recovery, thereÃ¢â‚¬â„¢s been a lot of progress done there as well. The Ã¢â‚¬Å“Science SummaryÃ¢â‚¬Â dialog is being overhauled into a complete Ã¢â‚¬Å“Mission SummaryÃ¢â‚¬Â, which will show not only the recovered experiment data from a mission, but also the parts you recovered (and how much funds you got back from them), as well as crews. For experimental Ã¢â‚¬ËœprototypeÃ¢â‚¬â„¢ parts, recovery also re-stocks them so you get to launch them again, in case the contract is still incomplete.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESo not sure if this \u0022recovery\u0022 he speaks of means landing a ship intact, or recovery of parts you have staged off your ship...although he does specifically mention SRBs which tend to be dropped so I would hope they have a mechanic in place to recover parts that you detach. I\u0027m sure we\u0027ll hear more about this as the next update gets closer to release. I mean, they wouldn\u0027t implement a budget and part recovery system without thinking about recovering jettisoned stages, right?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure he meant that recovery you perform using the green button above the altimeter or from tracking station.\u003C/p\u003E\n"},{"CreatedByName":"ThirdHorseman","CreatedById":77825,"CreatedDateTime":"2014-06-13T21:52:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure he meant that recovery you perform using the green button above the altimeter or from tracking station.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea but again he mentions SRB which are almost always staged and discarded. I would really hope that Squad would not spend all this time and energy installing a Contract and Budget system, with a stress on saving funds by recovering equipment, and not address the issue that parts vanish when in atmo. That would be a pretty big screwup IMHO...\u003C/p\u003E\n"},{"CreatedByName":"cpast","CreatedById":112846,"CreatedDateTime":"2014-06-13T23:05:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThirdHorseman\u0022 data-cite=\u0022ThirdHorseman\u0022\u003E\u003Cdiv\u003EYea but again he mentions SRB which are almost always staged and discarded. I would really hope that Squad would not spend all this time and energy installing a Contract and Budget system, with a stress on saving funds by recovering equipment, and not address the issue that parts vanish when in atmo. That would be a pretty big screwup IMHO...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think you\u0027re reading it correctly. He specifically mentions SRBs because he specifically says \u0022if you use them/test them [whatever \u0027testing\u0027 is] in the wrong conditions, you have to be prepared to recover them intact\u0022. That implies that normally, you \u003Cem\u003Ewon\u0027t\u003C/em\u003E be recovering SRBs intact. It wouldn\u0027t make sense to be able to easily use an experimental SRB on all your launches by slapping a couple parachutes on the side; if you want to use an experimental SRB (or an experimental part in general) on another mission, you should have to take special steps to ensure that it works right.\u003C/p\u003E\u003Cp\u003EThat\u0027s the biggest issue with letting you recover dropped parts: KSP doesn\u0027t have reentry heating, or maximum aerodynamic stress, or anything like that. It\u0027s really, really easy to slap a bunch of radial parachutes on a booster, and the parachutes don\u0027t weigh a ton. 3 stock radial parachutes are enough to safely recover an ARM LFB and stock nosecone; 5 suffice for a Mainsail (with its lower impact rating). they weigh only 0.45 tons. That means that recovery becomes trivial for all but the smallest rockets (where the 0.15 tons for one parachute could actually matter). Recovering should not be easy. I\u0027d *like* to be able to reuse parts of my boosters, and it\u0027d be realistic to have that idea, but doing something like this would practically eliminate the point of designing for reusability. Budget should encourage careful design, where you actually have to think about how to recover as much as possible, and it\u0027s hard to recover everything; if you can just slap a few parachutes on and call it a day, there\u0027s zero challenge in designing for recovery, and pretty much every single ship becomes trivially fully recoverable.\u003C/p\u003E\n"},{"CreatedByName":"palioxis1248","CreatedById":100635,"CreatedDateTime":"2014-06-14T03:07:38Z","Content":"\n\u003Cp\u003EActually the real reason I opined for tracking beacons instead of just rendering for every booster with parachutes on or something like that is this:\u003C/p\u003E\u003Cp\u003ESay your 1000 part rocket undergoes rapid spontaneous unplanned disassembly at 20km. Not saying that it would happen, but let\u0027s assume pessimistically that the thing breaks apart into as many pieces as you\u0027ve got parachutes, each piece attached to a parachute. Now the game will try to render each piece, even if the piece was not designed to be recovered/was actually part of a single piece in the first place. The worst is when you have your jumbo 64 tank with 8 parachutes on it, and it explodes and all 8 parachutes end up getting rendered for no reason. So yeah. I felt beacons would be more elegant, because the game only ever need render as many parts as there are beacons. Actually come to think of it, I just realised that activating beacons should be a stageable event, such that they only ever activate if everything goes as planned. Then the game need not render them at all if your ship just blows up.\u003C/p\u003E\u003Cp\u003EAs for why I\u0027m not comfortable with the simplified physics calculation idea, I think cpast\u0027s post pretty much explains it.\u003C/p\u003E\n"},{"CreatedByName":"mstrfalco","CreatedById":73805,"CreatedDateTime":"2014-06-14T04:43:33Z","Content":"\n\u003Cp\u003EGuys I think you should look at this mod called FMRS and how it tackled the problem. The mod creates a save for stages you drop while ascending, then once you have gotten to orbit you can jump back to a stage at the particular moment it was dropped and land it. Once landed you can jump forward in time back to the main vessel but the landed parts remain landed. It is really fun and I have been doing many falcon 9 style landings. No problems found so far either. If there will be rewards for recovery of parts this mod would certainly allow you to recover every part you intent to.\u003C/p\u003E\u003Cp\u003EThe mod can be found on Curse here: \u003Ca href=\u0022http://www.curse.com/ksp-mods/kerbal/220566-fmrs-v0-1-00\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.curse.com/ksp-mods/kerbal/220566-fmrs-v0-1-00\u003C/a\u003E\u003C/p\u003E\n"}]}