{"TopicId":75156,"ForumId":55,"TopicTitle":"The ability to fire Kerbonauts and refresh the list in the Astronaut Complex","CreatedByName":"Sylandro","CreatedById":80729,"CreatedDateTime":"2014-06-15T21:17:49Z","PageNum":1,"Articles":[{"CreatedByName":"Sylandro","CreatedById":80729,"CreatedDateTime":"2014-06-15T21:17:49Z","Content":"\n\u003Cp\u003ETitle says it all.\u003C/p\u003E\u003Cp\u003EIf you had a bunch of unwanted Kerbonauts, or Kerbonauts that you don\u0027t need anymore, you should have the ability to fire \u0027em.\u003C/p\u003E\u003Cp\u003EAnd if you want more and new Kerbonauts in the Astronaut Complex, you should have the ability to refresh the list, and discard applications for Kerbonauts that you don\u0027t like.\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2014-06-15T22:32:44Z","Content":"\n\u003Cp\u003ENot sure if firing Kerbonauts will ever be useful, unless we have to pay them salaries every month or year, or there\u0027s an upper limit of how many you can have hired based on your reputation. I\u0027m actually wondering how hiring them will work once the astronaut complex\u0027s functionality will get expanded upon.\u003C/p\u003E\u003Cp\u003EPerhaps it will cost funds to \u0022reroll\u0022 the applicant list. I mean, you do have to screen them with tests and examinations first out of how many eager green men there are on Kerbin to ride your rockets, that certainly has to cost money.\u003C/p\u003E\n"},{"CreatedByName":"Razor235","CreatedById":16436,"CreatedDateTime":"2014-06-15T22:40:58Z","Content":"\n\u003Cp\u003EIt\u0027s easy enough to fire Kerbals. Just arrange an unfortunate accident that may or may not result in a literal firing.\u003C/p\u003E\n"},{"CreatedByName":"federicoaa","CreatedById":94879,"CreatedDateTime":"2014-06-16T03:02:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Razor235\u0022 data-cite=\u0022Razor235\u0022\u003E\u003Cdiv\u003EIt\u0027s easy enough to fire Kerbals. Just arrange an unfortunate accident that may or may not result in a literal firing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis made my day XD\u003C/p\u003E\n"}]}