{"TopicId":75176,"ForumId":18,"TopicTitle":"Which Space Vehicle is the Best / ROUND 1","CreatedByName":"K.A.S.A.","CreatedById":112841,"CreatedDateTime":"2014-06-16T02:25:23Z","PageNum":1,"Articles":[{"CreatedByName":"K.A.S.A.","CreatedById":112841,"CreatedDateTime":"2014-06-16T02:25:23Z","Content":"\n\u003Cp\u003EShuttle Atlantis\u003C/p\u003E\u003Cp\u003EShuttle Challenger\u003C/p\u003E\u003Cp\u003EShuttle Columbia\u003C/p\u003E\u003Cp\u003EShuttle Discovery\u003C/p\u003E\u003Cp\u003EShuttle Endeavour\u003C/p\u003E\u003Cp\u003ESoyuz\u003C/p\u003E\u003Cp\u003EN1\u003C/p\u003E\u003Cp\u003ESaturn V\u003C/p\u003E\n"},{"CreatedByName":"K.A.S.A.","CreatedById":112841,"CreatedDateTime":"2014-06-16T02:28:49Z","Content":"\n\u003Cp\u003EThe 4 most voted for will move on into the semi-finals June 20! Happy voting!\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-06-16T08:41:33Z","Content":"\n\u003Cp\u003ESuggestion: present a clear definition of what you consider a \u0022space vehicle\u0022, and then research all qualifying vehicles from all nations in order to make a comprehensive poll. Right now this poll would be better titled \u0022Which space shuttle has your favorite name? Oh, I guess Saturn V is also a cool name. And I\u0027ll add the only Russian craft I know as a token, and also this thing I found linked in the Saturn V article.\u0022\u003C/p\u003E\u003Cp\u003EThis may sound like harsh judgement, but keep this in mind: if you are going to ask space enthusiasts about their favorite spaceship, you\u0027re going to get a heated, emotional discussion. If you want to do something like this in front of this audience, you must appear completely unbiased, and you must present enough options to satisfy everyone. This poll is far away from either proposition. As a result, it will go one of two ways: either it\u0027ll be largely ignored because most people sense the easily flammable material it is made of; or it will catch fire and end in an argument which may or may not get locked, but definitely will not result in a useful picture of public opinion.\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2014-06-16T09:18:07Z","Content":"\n\u003Cp\u003EHere\u0027s some suggestions for a better poll:\u003C/p\u003E\u003Cp\u003EFavorite Space Launchers\u003C/p\u003E\u003Cp\u003ESpace Shuttle\u003C/p\u003E\u003Cp\u003ESaturn V\u003C/p\u003E\u003Cp\u003ESoyuz lifter vehicle (NOT THE SPACECRAFT)\u003C/p\u003E\u003Cp\u003EN1\u003C/p\u003E\u003Cp\u003EProton\u003C/p\u003E\u003Cp\u003EI picked these choices as 1. most of them are already in the above poll and 2. these are the most commonly known launchers.\u003C/p\u003E\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2014-06-16T13:02:36Z","Content":"\n\u003Cp\u003E-Why has every shuttle its own line?Ã‚Â¨\u003C/p\u003E\u003Cp\u003E-Where are other spacecrafts? Shenzhou, Salyut, Vostok, Voschod, ISS, Mercury, Apolo, Gemini, skylab, MIR?\u003C/p\u003E\u003Cp\u003EWhy you bother doing something if you cant do it right?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-16T13:05:22Z\u0022 title=\u002206/16/2014 01:05  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 16, 2014\u003C/time\u003E by KOCOUR\u003C/strong\u003E\n\u003C/span\u003E\n"}]}