{"TopicId":75229,"ForumId":15,"TopicTitle":"Multiple animations with one GUI?","CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2014-06-16T18:31:13Z","PageNum":1,"Articles":[{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2014-06-16T18:31:13Z","Content":"\n\u003Cp\u003EIs it possible to trigger multiple animations with one GUI button in the right-click part menu? Thanks.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-06-16T18:39:50Z","Content":"\n\u003Cp\u003EHi, I know for sure that you can have several animations per part, I have yet to find a way of triggering all anims from one button press, it may be possible via a plugin. On that note Sirkut mentioned that he had developed a plugin that can operate animations in a similar way the Infernal Robotics.\u003C/p\u003E\u003Cp\u003EI must admit to being curious as to what you are planning, a few well placed questions may save you a lot of hair pulling, keyboard poundinng etc.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2014-06-16T20:29:23Z","Content":"\n\u003Cp\u003EI\u0027m doing the Open Part Mod AEI competition, and I am making multiple anims. I know how frustrating it is to have the right-click menu have 10\u002B options, and was hoping I could solve that.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-06-17T03:16:18Z","Content":"\n\u003Cp\u003Eseems like you should be able to export all the moving parts as one animation and trigger that animation in the GUI? even if the movements must be sequential, you can key that into your animation before exporting.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-06-17T05:20:43Z","Content":"\n\u003Cp\u003EIf all of them are standard animations you should just be able to combine them. But if you have looping or ping-pong animations mixed in that can make it considerably more complicated. I don\u0027t know of any way to do it other than a custom plugin.\u003C/p\u003E\n"}]}