{"TopicId":75245,"ForumId":34,"TopicTitle":"[1.1] RemoteTech v1.6.10 [2016-04-12]","CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2014-05-30T23:41:40Z","PageNum":141,"Articles":[{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-09-11T19:15:21Z","Content":"\n\u003Cp\u003E@Steven - Cheat menu location would be fine, but really anywhere in game the player could toggle it on/off would be fine too\u003C/p\u003E\u003Cp\u003E@damerell - you\u0027re still missing the point or I haven\u0027t explained it well enough. I\u0027ll assume the latter, in which case let me try again. RemoteTech is a mod that \u003Cem\u003Eimplements\u003C/em\u003E signal delay in the game, in other words it allows you to play with signal delay by using its flight computer to control the vessel. That should be the player\u0027s choice - if they want to play with signal delay they can use the supplied flight computer, if they don\u0027t they just control it as normal. However RemoteTech over-reaches in its design and \u003Cem\u003Eenforces\u003C/em\u003E signal delay by also applying it to the flight controls themselves, which if you are choosing to play with signal delay using the flight computer, you would have \u003Cem\u003Eno reason whatsoever\u003C/em\u003E to touch anyways! No one would ever want to control a ship under signal delay by using the actual controls (although I admit it would make for a fun reddit Challenge or something). So overall it\u0027s a rather pointless and frustrating bit of \u0022realism\u0022 from a gameplay standpoint.\u003C/p\u003E\u003Cp\u003EAnd yes, RemoteTech also forces you to use signal delay when it\u0027s activated when selecting part actions, but you can get around that by assigning them to an action group and disabling signal delay (for action groups only) through Action Groups Extended. I\u0027d still rather RemoteTech allow you to switch it off itself, but it\u0027s still a solution that works.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2015-09-12T00:40:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003E@damerell - you\u0027re still missing the point or I haven\u0027t explained it well enough. I\u0027ll assume the latter, in which case let me try again. RemoteTech is a mod that \u003Cem\u003Eimplements\u003C/em\u003E signal delay in the game, in other words it allows you to play with signal delay by using its flight computer to control the vessel. That should be the player\u0027s choice - if they want to play with signal delay they can use the supplied flight computer, if they don\u0027t they just control it as normal. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s no reason to limit fuel when the player could just choose to shut the engine off after a limited time.\u003C/p\u003E\u003Cp\u003EThere\u0027s no reason to have limited thrust engines when the player could just use a high thrust engine and choose not to throttle it up all the way.\u003C/p\u003E\u003Cp\u003EYou\u0027re pretending that the flight computer was added as the means to *implement* delay, when you know perfectly well it was added as the means of *dealing with* the delay that RT implements, not implementing it in the first place.\u003C/p\u003E\u003Cp\u003EI have no problem with saying that once RT\u0027s limits are active in a saved game they are active fully for that saved game. Enforcing that is sort of the point of RT. My annoyance is with not having an option to selectively choose which savegames are subject to RT\u0027s limitations and which aren\u0027t. \u003C/p\u003E\u003Cp\u003ERT is like a hard mode for the game. But it should be like the stock game\u0027s hard mode options like no-revert - a hard mode option you pick per savegame, not something that once you use it in one saved game it destroys your ability to ever use any other saved games that aren\u0027t set up for it.\u003C/p\u003E\u003Cp\u003ERight now the only way to do that is to maintain entirely separate installations of KSP itself, which seems like overkill just to work around the lack of an option to de-enforce RT, and requires some ModuleManager magic if you want to still be able to test craft designs that contain RT antenna in them, but without RT\u0027s functionality.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-09-12T01:43:04Z","Content":"\n\u003Cp\u003EWell since no else seems to be in support of this, I\u0027ll just fork my own version.\u003C/p\u003E\u003Cp\u003ESteven if you were the one who actually fixed the bug like you said you were going to do a couple weeks/months back, would you mind sharing what I need to undo? Otherwise I guess I can just peruse the Diffs...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-12T01:53:03Z\u0022 title=\u002209/12/2015 01:53  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 12, 2015\u003C/time\u003E by Gaiiden\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2015-09-12T21:13:23Z","Content":"\n\u003Cp\u003Ejo jo, small update today:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EGeneral\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAdded a new value to RTSettings to keep the throttle on connection loose (ThrottleZeroOnNoConnection=True or False)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EClean up vessel target handling (thx to geoffromer)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded Asteroid Day antennas (thx to phroggster)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded NovaPunch antennas (thx to blnk2007)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"rottielover","CreatedById":73403,"CreatedDateTime":"2015-09-13T02:47:25Z","Content":"\n\u003Cp\u003E\u0022 Added NovaPunch antennas (thx to blnk2007) \u0022 - Question, is that on a request basis? Can someone add the AIES dishes and Antennas? (is that already done and I missed it?)\u003C/p\u003E\n"},{"CreatedByName":"Borskey","CreatedById":151048,"CreatedDateTime":"2015-09-13T04:33:56Z","Content":"\n\u003Cp\u003EI\u0027m having some trouble with the \u0022integrated 3.0 Km omnidirectional always on\u0022 antennas that are supposed to be built into the probe cores.\u003C/p\u003E\u003Cp\u003EThis antenna doesn\u0027t seem to function properly in my game. For example of how they are supposed to work- in this video \u003Ca href=\u0022https://youtu.be/0sUjsI9SpB4?t=297\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://youtu.be/0sUjsI9SpB4?t=297\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHe builds a simple probe rocket with no added antenna, launches it, and then loses signal after a short distance. It\u0027s a demonstration for why you need an additional antenna to get further than 3km.\u003C/p\u003E\u003Cp\u003EHowever, If I try to launch this exact same rocket in my own game(just probe core\u002BSRB), my probe has no connection at the launchpad and I can not stage or do anything.\u003C/p\u003E\u003Cp\u003EMy issue is, I\u0027m building a space station, and I wanted to use little probe RCS tugs to re-arrange and dock all the different modules. They should always be within 3 km of the space station, which will always have a connection to KSC, so I shouldn\u0027t need anything other than the integrated probe core antenna. However, they are not working as they should- just like how the probe SRB doesn\u0027t work for me.\u003C/p\u003E\u003Cp\u003EDo I really have to add DP-10 antennas to my orbital construction RCS tugs?\u003C/p\u003E\u003Cp\u003EEdit: Nevermind, looks like you need the \u0022Remote Tech\u0022 node unlocked for the integrated antenna to work. Didn\u0027t realize.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-13T08:08:59Z\u0022 title=\u002209/13/2015 08:08  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 13, 2015\u003C/time\u003E by Borskey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lilienthal","CreatedById":119423,"CreatedDateTime":"2015-09-13T14:15:01Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EProblem with flight computer and holding direction\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHi all, \u003C/p\u003E\u003Cp\u003Efor quite a while I am having problems with using the flight computer to point the craft a certain direction (i.e. facing a maneuver node) on RSS/RO/RP0. \u003C/p\u003E\u003Cp\u003EThe behaviour I am seeing is that the controls (pitch, yaw) are always either \u002B100% or -100%, thereby overshooting a lot and wasting heaps of precious propellant. \u003C/p\u003E\u003Cp\u003EIs that intended behaviour? Do either people see the same? \u003C/p\u003E\u003Cp\u003EI imagine this could be solved by implementing something like:\u003C/p\u003E\u003Cp\u003Epitch_control = if (pitch is already moving in the right direction) {0.1 * (pitch_actual-pitch_target)} else { 0.2 *(pitch_actual-pitch_target)} \u003C/p\u003E\u003Cp\u003EThat at least has worked for me in kOS. \u003C/p\u003E\u003Cp\u003EThis probably would need to go into: \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/blob/develop/src/RemoteTech/FlightComputer/FlightCore.cs\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/RemoteTechnologiesGroup/RemoteTech/blob/develop/src/RemoteTech/FlightComputer/FlightCore.cs\u003C/a\u003E Function SteeringHelper, but I am not quite sure. \u003C/p\u003E\u003Cp\u003EWhat do you think? Would that help? Is already someone working on that? \u003C/p\u003E\u003Cp\u003ETbh, I can kind of read C# (used C\u002B\u002B 10 yrs ago), but don\u0027t know how to compile etc. If anyone wants to pair up with me, I am happy to give advice on the math side. \u003C/p\u003E\u003Cp\u003EBest, \u003C/p\u003E\u003Cp\u003EGustav,\u003C/p\u003E\u003Cp\u003EPS: Sorry if I missed an already happening discussion, couldn\u0027t find a recent one.\u003C/p\u003E\n"},{"CreatedByName":"Poodmund","CreatedById":128643,"CreatedDateTime":"2015-09-13T14:33:35Z","Content":"\n\u003Cp\u003EDoes the inclusion of the:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EControlAntennaWithoutConnection = True\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E... line in the setting config file now render the RemoteTech XF redundant? Does it do the same thing?\u003C/p\u003E\n"},{"CreatedByName":"Farix","CreatedById":98315,"CreatedDateTime":"2015-09-13T16:55:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Poodmund\u0022 data-cite=\u0022Poodmund\u0022\u003E\u003Cdiv\u003EDoes the inclusion of the:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EControlAntennaWithoutConnection = True\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E... line in the setting config file now render the RemoteTech XF redundant? Does it do the same thing?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe that line is from RemoteTech XF itself.\u003C/p\u003E\n"},{"CreatedByName":"zamboni","CreatedById":10844,"CreatedDateTime":"2015-09-14T08:24:26Z","Content":"\n\u003Cp\u003EHiya all.\u003C/p\u003E\u003Cp\u003EI recently noticed a problem that I *thought* was due to several mods I installed a day or so ago, but the problem looks to be with RT, and there all along. \u003C/p\u003E\u003Cp\u003EI was on the launchpad and tried to send some science, but the transmission was instant, and didn\u0027t yield any type of science for it (and the data collected was cleared). The communication was apparently was being sent through the launch clamp but never got through. I spent time tonight deleting the several mods that I installed, and I had the same behavior. It wasn\u0027t until I looked at the RT .cfg files that I realized what is happening. Here is a screenshot of the debug after tying to send some science back:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MlhqEqM.jpg\u0022 alt=\u0022MlhqEqM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI believe it may have been like this all along, because I am pretty sure now all of the science I have transmitted from the launchpad was without using the clamps (I usually just strapped a new science part on a mk1 capsule sitting on the launchpad itself and then did the science that way and then did a quick recovery). \u003C/p\u003E\u003Cp\u003EWhat I think is happening: Although the clamps are fitted with an \u0022antenna\u0022 in the .cfg file:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@PART[launchClamp1]:FOR[RemoteTech]\u003Cbr\u003E{\u003Cbr\u003E\t%MODULE[ModuleRTAntennaPassive] {\u003Cbr\u003E\t\t%OmniRange = 5000\u003Cbr\u003E\t}\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThere is no associated transmitter parameter. So when it tries to transmit, but there is no parameter there it gets sent to nowhere, and the data is cleaned out. I was able to fix this by inserting a random parameter:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@PART[launchClamp1]:FOR[RemoteTech]\u003Cbr\u003E{\u003Cbr\u003E\t%MODULE[ModuleRTAntennaPassive] {\u003Cbr\u003E\t\t%OmniRange = 5000\u003Cbr\u003E\u003Cbr\u003E\t%TRANSMITTER {\u003Cbr\u003E\t\t\t%PacketInterval = 0.15\u003Cbr\u003E\t\t\t%PacketSize = 3\u003Cbr\u003E\t\t\t%PacketResourceCost = 0.1\u003Cbr\u003E\t\t}\u003Cbr\u003E\t}\t\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EScience is now sent and credited accordingly.\u003C/p\u003E\n"},{"CreatedByName":"damerell","CreatedById":123074,"CreatedDateTime":"2015-09-14T13:26:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003E@damerell - you\u0027re still missing the point or I haven\u0027t explained it well enough. I\u0027ll assume the latter, in which case let me try again. RemoteTech is a mod that \u003Cem\u003Eimplements\u003C/em\u003E signal delay in the game, in other words it allows you to play with signal delay by using its flight computer to control the vessel. That should be the player\u0027s choice - if they want to play with signal delay they can use the supplied flight computer, if they don\u0027t they just control it as normal. However RemoteTech over-reaches in its design and \u003Cem\u003Eenforces\u003C/em\u003E signal delay by also applying it to the flight controls themselves, which if you are choosing to play with signal delay using the flight computer, you would have \u003Cem\u003Eno reason whatsoever\u003C/em\u003E to touch anyways!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it\u0027s fairly clear that the design was to enforce signal delay. How you choose to deal with that - the flight computer, MechJeb, kOS, SmartParts, or even just putting up with it (the .16s to Minmus is perceptible but hardly overwhelming, and the delay to a local command centre might be longer but not prohibitive, so the idea that if signal delay applies you\u0027ll never touch the flight controls doesn\u0027t hold up) - is up to you.\u003C/p\u003E\u003Cp\u003EI see absolutely no problem with Steven\u0027s per-savegame idea. I see no problem with a debug menu cheat to turn off signal delay. I can\u0027t, however, see any point in making one particular mode of control immune to signal delay because one particular user wants it.\u003C/p\u003E\u003Cp\u003EThe player\u0027s choice is simple. If they want to play with signal delay, turn on signal delay.\u003C/p\u003E\n"},{"CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2015-09-14T15:55:59Z","Content":"\n\u003Cp\u003ESo, summer vacation are now over and i\u0027m back.\u003C/p\u003E\u003Cp\u003EHere are the current flight plan for the next feature \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/milestones/1.7.0\u0022 rel=\u0022external nofollow\u0022\u003Erelease v1.7.0 (dated for 31.10)\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/482\u0022 rel=\u0022external nofollow\u0022\u003ERemoteTech_Settings into the savegame folder \u0026amp; RT option Window\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/481\u0022 rel=\u0022external nofollow\u0022\u003EFlightcomputer overhaul = add RCS Translation \u0026amp; Rover Computer\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/365\u0022 rel=\u0022external nofollow\u0022\u003EAPI needs a way to get connection status of individual antennas\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/267\u0022 rel=\u0022external nofollow\u0022\u003EFeature: Better status for local controlled ships\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/233\u0022 rel=\u0022external nofollow\u0022\u003EEnable other mods to push custom commands to the flightcomputer\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/73\u0022 rel=\u0022external nofollow\u0022\u003EAdding maneuvers from the maneuver node to the flightcomputer\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll do my best to keep the defined release date for this feature branch.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2015-09-14T18:28:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Peppie23\u0022 data-cite=\u0022Peppie23\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E- \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/233\u0022 rel=\u0022external nofollow\u0022\u003EEnable other mods to push custom commands to the flightcomputer\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat would it take to for you to add generic text input fields to this? I read through the github issue, and it looks pretty old, but it only mentions simple fixed one-shot events, events tha are invisible in RT, and events where the mod tells RT what to do. But for us kOS devs what would be really nice is if you allowed us to go the other way around.\u003C/p\u003E\u003Cp\u003EInstead of \u0022kOS sends a request to RT\u0027s flight computer\u0022 it would be \u0022RT\u0027s flight computer sends a request to kOS\u0022.\u003C/p\u003E\u003Cp\u003EThe idea being to allow RT users to embed kOS commandline strings into the RT flight computer, that RT tells us to execute when the event fires off. The only sticking point being we\u0027d need some way to get the user to pick which kOS CPU part its talking about. when the craft has more than one.\u003C/p\u003E\u003Cp\u003Eis that general idea too much of a change or is it pretty simple?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T18:32:08Z\u0022 title=\u002209/14/2015 06:32  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lilienthal","CreatedById":119423,"CreatedDateTime":"2015-09-14T18:53:15Z","Content":"\n\u003Cp\u003EGreat Stuff. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Peppie23\u0022 data-cite=\u0022Peppie23\u0022\u003E\u003Cdiv\u003ESo, summer vacation are now over and i\u0027m back.\u003Cp\u003EHere are the current flight plan for the next feature \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/milestones/1.7.0\u0022 rel=\u0022external nofollow\u0022\u003Erelease v1.7.0 (dated for 31.10)\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/481\u0022 rel=\u0022external nofollow\u0022\u003EFlightcomputer overhaul = add RCS Translation \u0026amp; Rover Computer\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll do my best to keep the defined release date for this feature branch.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes this mean that the problems I mentioned in post #3508 will be solved? (i.e. the problem that the RCS attitude control can only do \u002B100% or -100%, oscillates a lot and uses heaps of propellant.) - Or is this not a common problem? \u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003EGustav\u003C/p\u003E\n"},{"CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2015-09-14T19:27:28Z","Content":"\n\u003Cp\u003EHi Steven,\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E... but it only mentions simple fixed one-shot events ...\u003C/div\u003E\u003C/blockquote\u003E Not only. You can create a one-shot event to the flight computer how SirDiazo would need this for his ActionGroup Mod. Small preview: \u003Ca href=\u0022http://i.imgur.com/TgwybAk.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/TgwybAk.jpg\u003C/a\u003E (The Receive Data - will trigger a callback method from another mod)\u003Cp\u003EThe second way to create an event is, for example, like our \u0022Hold prograde\u0022. So, for another example: The Autopilot from mechjeb. If this event is triggered we will call your defined callback until you will tell us that your event is done OR the user will stop this event from the flight computer (via cancel command - that we also trigger to you)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E... The idea being to allow RT users to embed kOS commandline strings into the RT flight computer ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf we can\u0027t bind kOS and RT with this functionality its up to you (or the other kOS Devs) to help me to do this. Create a Task on our github page and tell me what i should do, or make a pull request with this feature. i\u0027m absolutely not familiar with kOS in any case.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHi Lilienthal,\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilienthal\u0022 data-cite=\u0022Lilienthal\u0022\u003E\u003Cdiv\u003E... RCS attitude control can only do \u002B100% or -100%, oscillates a lot and uses heaps of propellant.\u003C/div\u003E\u003C/blockquote\u003E hmm na not really, i only thought about an functionality to create a command like: rsc thrust prograde for 5s or 5m/s (what ever). \u003Cstrong\u003EBUT\u003C/strong\u003E i\u0027m not opposed to add another slider to control the rcs thrust, so yeah maybe \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EI have no Infos about a problem that the flight computer attitude program would drain so much monoprop for the rcs thrusters, but in any case our SteeringHelper would need an overhaul as well ^^ but not for 1.7\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2015-09-14T21:30:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Peppie23\u0022 data-cite=\u0022Peppie23\u0022\u003E\u003Cdiv\u003EHi Steven,\u003Cp\u003E Not only. You can create a one-shot event to the flight computer how SirDiazo would need this for his ActionGroup Mod. Small preview: \u003Ca href=\u0022http://i.imgur.com/TgwybAk.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/TgwybAk.jpg\u003C/a\u003E (The Receive Data - will trigger a callback method from another mod)\u003C/p\u003E\u003Cp\u003EThe second way to create an event is, for example, like our \u0022Hold prograde\u0022. So, for another example: The Autopilot from mechjeb. If this event is triggered we will call your defined callback until you will tell us that your event is done OR the user will stop this event from the flight computer (via cancel command - that we also trigger to you)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes I saw that but as far as I can tell neither one allowed the user to type in a string argument for the event in the RT Flight Computer user interface. It\u0027s the ability to get user-supplied type-in data that you then send to us when you tell us the event is happening that I\u0027m referring to. That would allow us to support people typing in generic kOS commands into the RT flight computer\u0027s future events.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf we can\u0027t bind kOS and RT with this functionality its up to you (or the other kOS Devs) to help me to do this. Create a Task on our github page and tell me what i should do, or make a pull request with this feature. i\u0027m absolutely not familiar with kOS in any case.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know next to nothing about RT\u0027s internals but a few of the other kOS devs do. I\u0027ll bring this up with them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI have no Infos about a problem that the flight computer attitude program would drain so much monoprop for the rcs thrusters, but in any case our SteeringHelper would need an overhaul as well ^^ but not for 1.7\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI hear rumors that both kOS and RT cropped their SteeringHelper code from the same original source. We\u0027ve just undergone a massive overhaul to ours (not released yet) that helps repair a lot of its ugly behaviors.\u003C/p\u003E\n"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-09-14T21:47:29Z","Content":"\n\u003Cp\u003E1.7.0 sounds like everything I have wanted from RT for a long time. Can\u0027t wait.\u003C/p\u003E\n"},{"CreatedByName":"blnk2007","CreatedById":143465,"CreatedDateTime":"2015-09-15T00:09:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rottielover\u0022 data-cite=\u0022rottielover\u0022\u003E\u003Cdiv\u003E\u0022 Added NovaPunch antennas (thx to blnk2007) \u0022 - Question, is that on a request basis? Can someone add the AIES dishes and Antennas? (is that already done and I missed it?)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEDIT: There is already an AIES config.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-15T00:14:03Z\u0022 title=\u002209/15/2015 12:14  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 15, 2015\u003C/time\u003E by blnk2007\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Panel","CreatedById":147540,"CreatedDateTime":"2015-09-15T02:53:18Z","Content":"\n\u003Cp\u003EI\u0027ve been wondering for a while what is going to happen to the mod when 1.1 is released. Will it overwrite the game\u0027s mechanic?\u003C/p\u003E\n"},{"CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2015-09-15T06:49:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Panel\u0022 data-cite=\u0022Panel\u0022\u003E\u003Cdiv\u003E... Will it overwrite the game\u0027s mechanic?\u003C/div\u003E\u003C/blockquote\u003E We\u0027ll see what squad brings in with ksp 1.1\n"},{"CreatedByName":"federicoaa","CreatedById":94879,"CreatedDateTime":"2015-09-15T09:31:09Z","Content":"\n\u003Cp\u003EHi, I\u0027m trying to get a full list of commands for the computer but I can only find basic info. \u003C/p\u003E\u003Cp\u003EI want to know, for example, how to do staging and actions groups.\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"},{"CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2015-09-15T10:00:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022federicoaa\u0022 data-cite=\u0022federicoaa\u0022\u003E\u003Cdiv\u003EHi, I\u0027m trying to get a full list of commands for the computer but I can only find basic info. \u003Cp\u003EI want to know, for example, how to do staging and actions groups.\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi federicoaa,\u003C/p\u003E\u003Cp\u003Edo you mean kOS ? We have no command list ... or i don\u0027t understand you ^^ To stage or toggle the action groups just hit your defined keys for it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"federicoaa","CreatedById":94879,"CreatedDateTime":"2015-09-15T12:14:27Z","Content":"\n\u003Cp\u003ENono, but I actually found some videos of people using RT and I think I know now, but the manual does not explain very well I think (there should be more examples)\u003C/p\u003E\u003Cp\u003EI did not know how to make, for example, that the ship deploy panels (lets say action group 1), I thought you had to input something, KOS like.\u003C/p\u003E\u003Cp\u003EBut I discovered that you set the delay and just press \u00271\u0027 and it\u0027s done. It\u0027s so simple it\u0027s not intuitive \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BananaDealer","CreatedById":60684,"CreatedDateTime":"2015-09-16T16:04:33Z","Content":"\n\u003Cp\u003EHmmm... I seem to have ran into some connection issues since the latest RT update. When using third-party antennae (like the ones in the Tantares mod, or the Modular Rocket Systems one), which are supposedly RT-compatible. Basically, probe craft list as \u0022No Connection\u0022 even while on the launchpad pre-launch. I\u0027m gonna try to reproduce with stock parts, if possible.\u003C/p\u003E\n"},{"CreatedByName":"Gryphon","CreatedById":58513,"CreatedDateTime":"2015-09-16T23:54:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BananaDealer\u0022 data-cite=\u0022BananaDealer\u0022\u003E\u003Cdiv\u003EHmmm... I seem to have ran into some connection issues since the latest RT update. When using third-party antennae (like the ones in the Tantares mod, or the Modular Rocket Systems one), which are supposedly RT-compatible. Basically, probe craft list as \u0022No Connection\u0022 even while on the launchpad pre-launch. I\u0027m gonna try to reproduce with stock parts, if possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMake sure they have the correct modules being added. There are plenty of examples of this as ModuleManager patches included in the RemoteTech directory.\u003C/p\u003E\n"}]}