{"TopicId":75245,"ForumId":34,"TopicTitle":"[1.1] RemoteTech v1.6.10 [2016-04-12]","CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2014-05-30T23:41:40Z","PageNum":16,"Articles":[{"CreatedByName":"Starstrider42","CreatedById":104043,"CreatedDateTime":"2014-07-06T17:22:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003ERunning RemoteTech 1.4.0\u003Cp\u003EI have a constellation of comms satellites around Kerbin, using a mix of 88-88 (40 Gm) and KR-14 (60Gm) dishes. Call them C1,C2,C3,C4. And all is well. I have 100% coverage out to MinMus\u003C/p\u003E\u003Cp\u003EI have a relay sat at the edge of Kerbin Space, running several GX-128 (400 Gm) dishes. Call it R1. And all is well, and reach this sat from anywhere in Kerbin SOI.\u003C/p\u003E\u003Cp\u003EAll sats are linked to KSC, their closest neighbors, my outer relay sat R1, and \u0022active vessel\u0022\u003C/p\u003E\u003Cp\u003EI have another relay sat of very similar design, also with GX-128\u0027s, that has just exited Kerbin SOI. Call it R2.\u003C/p\u003E\u003Cp\u003EIt is linked to KSC, and R1. R1 is also linked to R2.\u003C/p\u003E\u003Cp\u003ESeen from R1, all vessels are linked. (second picture)\u003C/p\u003E\u003Cp\u003EHowever, seen from R2, It shows link to R1, and THEN NOTHING. It is disconnected!\u003C/p\u003E\u003Cp\u003EThis same connection lasted until the exact moment when it left Kerbin SOI.\u003C/p\u003E\u003Cp\u003EAll vessels are powered, connected, functional and have ample power. Except R2 now has gone disconnected..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust to be sure I understand things correctly, is this your network:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ESatellite C# \u003Cbr\u003EAntenna 1: KSC\u003Cbr\u003EAntenna 2: Left neighbor\u003Cbr\u003EAntenna 3: Right neighbor\u003Cbr\u003EAntenna 4: R1\u003Cbr\u003EAntenna 5: Active Vessel\u003Cbr\u003E\u003Cbr\u003ESatellite R1\u003Cbr\u003EAntenna 1: KSC\u003Cbr\u003EAntenna 2: One of the C-series satellites\u003Cbr\u003EAntenna 3: R2\u003Cbr\u003E\u003Cbr\u003ESatellite R2\u003Cbr\u003EAntenna 1: KSC\u003Cbr\u003EAntenna 2: R1\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThat sounds like it should work. C# has a permanent, non-active connection to R1, and R1 has a permanent, non-active connection to R2. Sounds like bug report material.\u003C/p\u003E\u003Cp\u003ETo my knowledge (including successful interplanetary missions), Active Vessel \u003Cstrong\u003Edoes\u003C/strong\u003E work outside Kerbin\u0027s SoI. In fact, that\u0027s the main place where it\u0027s worth using. \u003Cstrong\u003EMeCripp\u003C/strong\u003E, if you have a bug report we\u0027d be happy to take it, but please don\u0027t state speculation as facts. You\u0027ve confused quite a few other players.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Creat\u0022 data-cite=\u0022Creat\u0022\u003E\u003Cdiv\u003EI\u0027m not yet aware of any changes that are already coming in that respect, but can I suggest adding consistency to \u003Cem\u003EActive Vessel\u003C/em\u003E a priority?\u003Cp\u003EMost problems with RT2 posted here (or anywhere else) have to do with this feature. I agree with those that say it has it\u0027s uses, but at the moment the actual use cases are extremely limited due to its limits, which are neither obvious nor explained (or warned about) in the UI.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027ll have to be more specific. What about it is inconsistent? I know \u003Cem\u003Econes\u003C/em\u003E are inconsistent (as you outline below), and that\u0027s scheduled for fixing...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Creat\u0022 data-cite=\u0022Creat\u0022\u003E\u003Cdiv\u003EPart of the problem is also that it\u0027s not very obvious why a certain link is (or is not) active when looking at the map, the/only primary tool to diagnose a network. A player controlling a probe/sat currently above the MÃƒÂ¼n - intended as a relay for crafts in it\u0027s shadow - can see the connection to their main network around Kerbin, because those satellites have AV as a target. As far as I know there is no way to see why the connection is made (is it targeted? inside a cone? due to active vessel?). Once he switches to the vessel behind the MÃƒÂ¼n - which would now need that relay - he get\u0027s no connection and doesn\u0027t know why. He\u0027s not told \u0022Active Vessel: no line of sight\u0022, \u0022Out of range\u0022 or anything else along those lines. All this could be in a tooltip (if KSP allows that) or drawn as text next to satellites (with a new button in the lower-right corner to toggle this). As a more minimalist and less intrusive alternative, color-coding the relay-satellite-icons (and potentially the lines to the target) could also work. Preferably with a key at the side to explain what it all means, like so:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EGreen (normal line): Connect/Targeted\u0027\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGreen (dashed line): \u0027Connected/Active Vessel\u0027\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGreen (dotted line): \u0027Connectec/In target Cone\u0027\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYellow (normal line): \u0027LoS Obstruction\u0027\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYellow (dashed line): \u0027LoS Obstruction/Active Vessel\u0027\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYellow (dotted line): \u0027Connectec/In target Cone\u0027\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERed: same as above, meaning \u0027Out of Range\u0027\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere was an old feature request (\u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/31\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/RemoteTechnologiesGroup/RemoteTech/issues/31\u003C/a\u003E) for something very much like this. I think RemoteTech does need to give more feedback, but specific suggestions like this one will help make the idea much more focused and useful. Would you mind posting this on the thread I\u0027ve linked?\u003C/p\u003E\u003Cp\u003EDisclaimer: I can\u0027t promise that all the specific errors you mention can actually be checked for and isolated. But I\u0027ll leave that call to people more familiar with the network code than I am.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boomerang\u0022 data-cite=\u0022Boomerang\u0022\u003E\u003Cdiv\u003EForgive me if I missed anyone going into any more detail on this, but I noticed mention of efforts to make future versions of RT2 more compatible with kOS with regards to the flight computer. And I was wondering if there are plans, even if they\u0027re far off, to improve the flight computer to the point where using kOS wouldn\u0027t be necessary for more advanced planned piloting, or if it\u0027s going to be left as is for now. \u003Cp\u003EI ask because I\u0027ve looked into kOS and it\u0027s not really my cup of tea, but on the other hand, l\u0027d like to be able to play with signal delay enabled as well.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe intent of the flight computer was to make RemoteTech playable without forcing players to download an autopilot mod. The idea was that players who \u003Cem\u003Edo\u003C/em\u003E want fully-featured autopilot would have installed kOS or MechJeb anyway. I would very much like to see support for both, although apparently there are some fundamental conflicts between how RemoteTech and MechJeb do things, so that may be a while off.\u003C/p\u003E\u003Cp\u003ESo to answer your question, no. We\u0027re planning to make the current features more reliable (which I agree is badly needed), but we\u0027re not currently planning to add anything as complex as, say, automated landings. We may change that stance in the future if MechJeb integration really seems impossible.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crimor\u0022 data-cite=\u0022Crimor\u0022\u003E\u003Cdiv\u003EAny chance for modular dishes at some point? Where you can tweak the FoV of it, like make it wider but you lose distance, narrower and you gain it, etc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOld suggestion, shot down by Cilph: \u003Ca href=\u0022https://github.com/Cilph/RemoteTech2/issues/225\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Cilph/RemoteTech2/issues/225\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo my answer is \u0022not soon\u0022. (Also, I suspect AdmiralTigerclaw would never forgive us for something so unrealistic. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E )\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-06T17:27:01Z\u0022 title=\u002207/06/2014 05:27  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 6, 2014\u003C/time\u003E by Starstrider42\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lepla","CreatedById":114134,"CreatedDateTime":"2014-07-06T21:42:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EAh...\u003Cp\u003EThanx.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehow do you do to see the lines that represent remote communication?\u003C/p\u003E\n"},{"CreatedByName":"Creat","CreatedById":27315,"CreatedDateTime":"2014-07-06T22:37:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starstrider42\u0022 data-cite=\u0022Starstrider42\u0022\u003E\u003Cdiv\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Creat\u0022 data-cite=\u0022Creat\u0022\u003E\u003Cdiv\u003E... long text about active vessel, mentioning it has inconsistencies ...\u003C/div\u003E\u003C/blockquote\u003EYou\u0027ll have to be more specific. What about it is inconsistent? I know \u003Cem\u003Econes\u003C/em\u003E are inconsistent (as you outline below), and that\u0027s scheduled for fixing...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy first issue is that \u0027Active vessel\u0027 works like a targeted connection, not like a cone. Take the example from my last post, if the probe is behind the MÃƒÂ¼n, it should automatically route via the relay-satellite because it\u0027s inside a cone. I have told the sats around Kerbin to connect to whatever I\u0027m trying to control, so trying a little harder would seem reasonable. This would allow relays to use \u0027Active Vessel\u0027 instead of always having to manually target cones at wherever I\u0027m operating at. This is not a big deal, I\u0027m just explaining it in more detail as I remember that I was \u003Cem\u003Ereally\u003C/em\u003E surprised when I learned that active vessel would only establish a direct connection and not just act as if the dish was just aimed at the active vessel (i.e. cone targeting).\u003C/p\u003E\u003Cp\u003EAs a side note: I\u0027d love to have even directly targeted connections work with a cone, because in reality they would. You just point the dish in some direction, if a signal comes from that direction it\u0027ll be received (provided it\u0027s the right frequency and stuff, but we don\u0027t model that [yet?] \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ). But I can understand how that would probably start causing performance problems on large or huge networks, especially with the fixed cone behavior giving more potential targets. Finding connections and routes for signals should stay relatively cheap, the game has enough stuff to do after all...\u003C/p\u003E\u003Cp\u003EMy second issue isn\u0027t one: On the page before my post \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/83305-Development-Resumed-RemoteTech-2?p=1248994\u0026amp;viewfull=1#post1248994\u0022 rel=\u0022external nofollow\u0022\u003Esomeone said\u003C/a\u003E it didn\u0027t work outside SoI, so I took their word for it (as I haven\u0027t used it since the 1.x days and thought it might\u0027ve been changed since then). Sorry for that... I did try to look this stuff up, but the wiki is still under construction it seems and I didn\u0027t find anything about it...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starstrider42\u0022 data-cite=\u0022Starstrider42\u0022\u003E\u003Cdiv\u003EThere was an old feature request (\u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/31\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/RemoteTechnologiesGroup/RemoteTech/issues/31\u003C/a\u003E) for something very much like this. I think RemoteTech does need to give more feedback, but specific suggestions like this one will help make the idea much more focused and useful. Would you mind posting this on the thread I\u0027ve linked?\u003Cp\u003EDisclaimer: I can\u0027t promise that all the specific errors you mention can actually be checked for and isolated. But I\u0027ll leave that call to people more familiar with the network code than I am.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure thing. I\u0027ve corrected and refined the text a bit and posted it to that thread. I really hope it\u0027ll find some use or at least provide some inspiration, as we do need a way to actually diagnose a problem. It might also be helpful having access to target lists (or a visualization of targets) set for any satellite from the map. I\u0027ve added a paragraph to the end detailing that idea a bit more.\u003C/p\u003E\u003Cp\u003E@Everyone: please do \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/issues/31\u0022 rel=\u0022external nofollow\u0022\u003Ego to that thread\u003C/a\u003E and add your ideas, a bit more attention from users might make the devs take a look at it sooner \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MrWizerd","CreatedById":106063,"CreatedDateTime":"2014-07-07T06:49:14Z","Content":"\n\u003Cp\u003EHi, I don\u0027t want to throw a wrench in these conversations but I had an idea, in the LLL part set there is a rotating fish, and while I have been learning to make new parts I found out how the sun trace code makes the solar panels track the sun. I thought to myself that out would be neat if other things could be pointed and tracked in a similar way. I realize this is sort of an affectation but could something like this work within a mod like remote tech or is it fundamentally a no go because it would have to be added to the core game?\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-07-07T07:38:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrWizerd\u0022 data-cite=\u0022MrWizerd\u0022\u003E\u003Cdiv\u003EHi, I don\u0027t want to throw a wrench in these conversations but I had an idea, in the LLL part set there is a rotating fish, and while I have been learning to make new parts I found out how the sun trace code makes the solar panels track the sun. I thought to myself that out would be neat if other things could be pointed and tracked in a similar way. I realize this is sort of an affectation but could something like this work within a mod like remote tech or is it fundamentally a no go because it would have to be added to the core game?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I get this correctly, you could be able to make antennae track the angular position of their target. Would be an extremely cool effect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E. \u003C/p\u003E\u003Cp\u003EBut then, I will have to change how vessels are built, so to allow more space for those big dishes to rotate. Communication masts may become essential to make enough space, and probably some new parts (deployable/extensible masts) may be required.\u003C/p\u003E\u003Cp\u003EThen, antennae should be coded to have some hard limit (at least, by a couple of tweakables) on the horizontal and vertical rotation they can assume IRT the mounting node.\u003C/p\u003E\u003Cp\u003EAnd if really this takes ground, I can foresee (for those really loving realism) a future version of RT2 that checks the orientation of the dishes with all other conditions for successful connection.\u003C/p\u003E\u003Cp\u003EYes, I love this idea...\u003C/p\u003E\n"},{"CreatedByName":"JDP","CreatedById":30775,"CreatedDateTime":"2014-07-07T13:08:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrWizerd\u0022 data-cite=\u0022MrWizerd\u0022\u003E\u003Cdiv\u003EHi, I don\u0027t want to throw a wrench in these conversations but I had an idea, in the LLL part set there is a rotating dish, and while I have been learning to make new parts I found out how the sun trace code makes the solar panels track the sun. I thought to myself that out would be neat if other things could be pointed and tracked in a similar way. I realize this is sort of an affectation but could something like this work within a mod like remote tech or is it fundamentally a no go because it would have to be added to the core game?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETracking dishes where implemented in RT1 and ever since RT2 started development it has been one of the most often suggested features. I did in fact implement tracking dishes in the old RT2 repo under Cilph, and adding them here would be no problem. The main issue is with the part models themselves: none of the dishes added by RT2 or already present in stock have the needed joints to rotate.\u003C/p\u003E\u003Cp\u003ESo in short; it would be easy to code but would necessitate all new dish models and maybe some custom code for each of the stock dishes. Since RT2 is in short supply on modelers skilled in making stockalike models I sadly don\u0027t see tracking dishes being implemented anytime soon. I could reimplement tracking dishes in the code though, so prospective RT modelers have something to work with.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-07-07T14:54:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JDP\u0022 data-cite=\u0022JDP\u0022\u003E\u003Cdiv\u003ETracking dishes where implemented in RT1 and ever since RT2 started development it has been one of the most often suggested features. I did in fact implement tracking dishes in the old RT2 repo under Cilph, and adding them here would be no problem. The main issue is with the part models themselves: none of the dishes added by RT2 or already present in stock have the needed joints to rotate.\u003Cp\u003ESo in short; it would be easy to code but would necessitate all new dish models and maybe some custom code for each of the stock dishes. Since RT2 is in short supply on modelers skilled in making stockalike models I sadly don\u0027t see tracking dishes being implemented anytime soon. I could reimplement tracking dishes in the code though, so prospective RT modelers have something to work with.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould the joints be separate parts, connecting to an antenna and a base structure, so that existing antennae are not directly affected? Would be possible with your code to actually define the orientation of such joints instead of the antennae mounted on them?\u003C/p\u003E\u003Cp\u003EI guess modeling a rotary joint is somewhat easier than a rotating antenna (and probably some parts in other mods, e.g. Infernal Robotics, are already good to use as joints).\u003C/p\u003E\n"},{"CreatedByName":"Rayder","CreatedById":95226,"CreatedDateTime":"2014-07-07T15:00:45Z","Content":"\n\u003Cp\u003EIMO it would make dish placement even more complicated as sometimes even the very large dishes can be tricky to mount on some satellites - especially if you\u0027re using FAR. You would have to make sure that the dish doesn\u0027t collide with the satellite / craft.\u003C/p\u003E\n"},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2014-07-07T15:23:20Z","Content":"\n\u003Cp\u003EI don\u0027t think the larger dishes would be mounted on any special joints anyway. Beyond a certain point, it probably just becomes a case of \u0027just turn the satellite\u0027.\u003C/p\u003E\n"},{"CreatedByName":"JDP","CreatedById":30775,"CreatedDateTime":"2014-07-07T15:32:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022diomedea\u0022 data-cite=\u0022diomedea\u0022\u003E\u003Cdiv\u003ECould the joints be separate parts, connecting to an antenna and a base structure, so that existing antennae are not directly affected? Would be possible with your code to actually define the orientation of such joints instead of the antennae mounted on them?\u003Cp\u003EI guess modeling a rotary joint is somewhat easier than a rotating antenna (and probably some parts in other mods, e.g. Infernal Robotics, are already good to use as joints).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s actually a very good idea. Of course I\u0027d have to take a look at infernal robotics to see how to properly move attached parts with the joints. All in all it shouldn\u0027t be too hard to write up. I do believe that I\u0027d have to restrict attachment of dishes to only attach nodes, since only one dish should be placed on the joint and the direction vector of any attached dish should be constant.\u003C/p\u003E\u003Cp\u003EOf course this still is in need of a model. I could make it myself, but I\u0027ve never been good at anything but the minimalistic look of RT1. I\u0027ll make a mockup once I get to a computer (I\u0027m currently on a tablet) and any part modelers will be welcome to contact me with their designs.\u003C/p\u003E\u003Cp\u003EAnd of course this would only be a visual enhancement, just like it was in RT1.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-07T15:34:54Z\u0022 title=\u002207/07/2014 03:34  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 7, 2014\u003C/time\u003E by JDP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2014-07-07T16:19:05Z","Content":"\n\u003Cp\u003EWhy not just have the whole satellite rotate? There are few positions a sat with 2 to 4 panels can be in where the sun wouldn\u0027t hit a solar panel, people won\u0027t make requests for multiple part update, nor would there be any modeling issues. Alternatively one could just use the powered rotator and 90 pivotron from IR to make it move in specified directions.\u003C/p\u003E\n"},{"CreatedByName":"JDP","CreatedById":30775,"CreatedDateTime":"2014-07-07T16:38:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sharpspoonful\u0022 data-cite=\u0022sharpspoonful\u0022\u003E\u003Cdiv\u003EWhy not just have the whole satellite rotate...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would only work if the sat had only one dish. A relay sat can typically need at least two.\u003C/p\u003E\n"},{"CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2014-07-07T20:38:35Z","Content":"\n\u003Cp\u003EI\u0027m having an issue with an interplanetary probe. When it leaves the SOI of Kerbin I lose coms with it. \u003C/p\u003E\u003Cp\u003EHere\u0027s how I have my network configured:\u003C/p\u003E\u003Cp\u003EProbe (Untitled Space Craft \u0026lt;- because I forgot to change the name):Kr-14 targeting Kerbin\u003C/p\u003E\u003Cp\u003ERelay Station in Geostat: targets Mission Control with a DTS and KR-14\u0027s targetting Duna and Sun.\u003C/p\u003E\u003Cp\u003EI assume I am doing something wrong but I\u0027m not sure what.\u003C/p\u003E\n"},{"CreatedByName":"Yellowsign","CreatedById":114419,"CreatedDateTime":"2014-07-07T20:59:43Z","Content":"\n\u003Cp\u003Ei had an idea for this mod but didnt know where to post it, so here you go.\u003C/p\u003E\u003Cp\u003EI would love something that could tell me when my satellites are going to go in and out of connection with KSC or a command center. It could be just a simple count down timer by the delay clock, telling you (T- Hours,Minutes,Seconds till signal loss) and (T- Hours,Minutes,Seconds till signal up-link). Would that be possible?\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2014-07-07T22:07:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkipSpikowski\u0022 data-cite=\u0022SkipSpikowski\u0022\u003E\u003Cdiv\u003EI\u0027m having an issue with an interplanetary probe. When it leaves the SOI of Kerbin I lose coms with it. \u003Cp\u003EHere\u0027s how I have my network configured:\u003C/p\u003E\u003Cp\u003EProbe (Untitled Space Craft \u0026lt;- because I forgot to change the name):Kr-14 targeting Kerbin\u003C/p\u003E\u003Cp\u003ERelay Station in Geostat: targets Mission Control with a DTS and KR-14\u0027s targetting Duna and Sun.\u003C/p\u003E\u003Cp\u003EI assume I am doing something wrong but I\u0027m not sure what.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAfaik the Kr-14 only has a 0.04 degree targeting cone. So at 90Mm (outside Kerbins SoI) your Probe targets a cone of about 31km radius on Kerbin and almost all the time, your Relay Station is somewhere else.\u003C/p\u003E\u003Cp\u003EAfaik with such mini cones you must target the Relay Station itself.\u003C/p\u003E\u003Cp\u003EOf course you lose connection when your Relay Station is behind Kerbin, MÃƒÂ¼n or Minmus...\u003C/p\u003E\u003Cp\u003EFor a nearly 100% uptime at that distance you need 3 dishes. 2 Pointed at Kerbin com sats and 1 pointed at a comsat in front of or behind the MÃƒÂ¼n (or a relay station on the MÃƒÂ¼n surface opposite to Kerbin).\u003C/p\u003E\u003Cp\u003Eedit: Of course the relay stations need KR-14s set to \u0022active vessel\u0022, so they establish connection once you take command of the probe again. Permanent connection from relays to probe is unnecessary imho.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-07T22:10:41Z\u0022 title=\u002207/07/2014 10:10  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 7, 2014\u003C/time\u003E by Yemo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-07-07T22:15:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkipSpikowski\u0022 data-cite=\u0022SkipSpikowski\u0022\u003E\u003Cdiv\u003EI\u0027m having an issue with an interplanetary probe. When it leaves the SOI of Kerbin I lose coms with it. \u003Cp\u003EHere\u0027s how I have my network configured:\u003C/p\u003E\u003Cp\u003EProbe (Untitled Space Craft \u0026lt;- because I forgot to change the name):Kr-14 targeting Kerbin\u003C/p\u003E\u003Cp\u003ERelay Station in Geostat: targets Mission Control with a DTS and KR-14\u0027s targetting Duna and Sun.\u003C/p\u003E\u003Cp\u003EI assume I am doing something wrong but I\u0027m not sure what.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour probe is targetting Kerbin? Which has nothing to receive transmission from your probe except in a very narrow window of time when Mission Control has line of sight to your probe? Mission Control also only has the ability to reach inside its own SOI for communication.\u003C/p\u003E\u003Cp\u003EYou have no network with everything you\u0027ve built and aimed. You just have a thing in space attempting to talk to the Sun and Duna and a probe trying to talk to the planet Kerbin. Nothing is connected. Communication is a two-way street and you don\u0027t even have one way.\u003C/p\u003E\n"},{"CreatedByName":"JDP","CreatedById":30775,"CreatedDateTime":"2014-07-07T22:31:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yellowsign\u0022 data-cite=\u0022Yellowsign\u0022\u003E\u003Cdiv\u003Ei had an idea for this mod but didnt know where to post it, so here you go.\u003Cp\u003EI would love something that could tell me when my satellites are going to go in and out of connection with KSC or a command center. It could be just a simple count down timer by the delay clock, telling you (T- Hours,Minutes,Seconds till signal loss) and (T- Hours,Minutes,Seconds till signal up-link). Would that be possible?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPossible, yes. But somewhat complicated and possibly very laggy to implement. The way the plugin currently finds a valid connection is roughly looking for the closest approximation to a straight line between each command station and the satellite, then choosing the shortest resulting path. Doing this takes a bit of toll on your computer and if done inefficiently or excessively will cause lag.\u003C/p\u003E\u003Cp\u003ELet\u0027s say you want to the system to predict just 1 hour in the future and want a resolution of 1 second. That would mean that your computer suddenly has to find 3600 connections where it would normally only have to find one.\u003C/p\u003E\n"},{"CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2014-07-07T23:33:12Z","Content":"\n\u003Cp\u003EI figured it was something I was doing, but didn\u0027t know what because inside the Kerbin SOI I can just target the Mun or Minmus and have the Sats around the moons target Kerbin and it works. But I see what you\u0027re saying. I need to actually target the probe and the proble needs to target the relay station. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EYour probe is targetting Kerbin? Which has nothing to receive transmission from your probe except in a very narrow window of time when Mission Control has line of sight to your probe? Mission Control also only has the ability to reach inside its own SOI for communication.\u003Cp\u003EYou have no network with everything you\u0027ve built and aimed. You just have a thing in space attempting to talk to the Sun and Duna and a probe trying to talk to the planet Kerbin. Nothing is connected. Communication is a two-way street and you don\u0027t even have one way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-07-07T23:59:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JDP\u0022 data-cite=\u0022JDP\u0022\u003E\u003Cdiv\u003ETracking dishes where implemented in RT1 and ever since RT2 started development it has been one of the most often suggested features. I did in fact implement tracking dishes in the old RT2 repo under Cilph, and adding them here would be no problem. The main issue is with the part models themselves: none of the dishes added by RT2 or already present in stock have the needed joints to rotate.\u003Cp\u003ESo in short; it would be easy to code but would necessitate all new dish models and maybe some custom code for each of the stock dishes. Since RT2 is in short supply on modelers skilled in making stockalike models I sadly don\u0027t see tracking dishes being implemented anytime soon. I could reimplement tracking dishes in the code though, so prospective RT modelers have something to work with.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECoulded we just use the old dishes ?\u003C/p\u003E\n"},{"CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2014-07-08T00:25:46Z","Content":"\n\u003Cp\u003EQuestion:\u003C/p\u003E\u003Cp\u003EWhen and why would I ever use the SOI targeting? I\u0027m not really sure how this works, so can someone point me in the right direction?\u003C/p\u003E\n"},{"CreatedByName":"Creat","CreatedById":27315,"CreatedDateTime":"2014-07-08T01:53:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkipSpikowski\u0022 data-cite=\u0022SkipSpikowski\u0022\u003E\u003Cdiv\u003EQuestion:\u003Cp\u003EWhen and why would I ever use the SOI targeting? I\u0027m not really sure how this works, so can someone point me in the right direction?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you mean by \u0022SOI targeting\u0022? Do you mean targeting a celestial body in the target list?\u003C/p\u003E\n"},{"CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2014-07-08T02:34:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Creat\u0022 data-cite=\u0022Creat\u0022\u003E\u003Cdiv\u003EWhat do you mean by \u0022SOI targeting\u0022? Do you mean targeting a celestial body in the target list?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, how in the list you see Kerbin, Duna, etc...\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-07-08T03:24:34Z","Content":"\n\u003Cp\u003Eit\u0027s just the closest you can get to having a dish behave like an Omni. Instead of having to specifically tell it what satellite to point at to get a link between two planets, it will auto-connect to any satellite orbiting the planet within its cone to give you a link back to MC on Kerbin\u003C/p\u003E\n"},{"CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2014-07-08T03:32:25Z","Content":"\n\u003Cp\u003ESo just to clarify: if I have a sat at Duna and it points to Kerbin and one at Kerbin that points at Duna, then they will connect, correct?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003Eit\u0027s just the closest you can get to having a dish behave like an Omni. Instead of having to specifically tell it what satellite to point at to get a link between two planets, it will auto-connect to any satellite orbiting the planet within its cone to give you a link back to MC on Kerbin\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-07-08T03:36:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkipSpikowski\u0022 data-cite=\u0022SkipSpikowski\u0022\u003E\u003Cdiv\u003ESo just to clarify: if I have a sat at Duna and it points to Kerbin and one at Kerbin that points at Duna, then they will connect, correct?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes If it as the range and is in the cone and line of sight.\u003C/p\u003E\n"}]}