{"TopicId":75320,"ForumId":55,"TopicTitle":"Tweakables for fuel ducts","CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-06-17T18:30:45Z","PageNum":1,"Articles":[{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-06-17T18:30:45Z","Content":"\n\u003Cp\u003EI\u0027d like the ability to be selective about what resources can is transported through fuel ducts. Specifically, ducts that only transport LiquidFuel \u003Cem\u003Eor\u003C/em\u003E Oxidizer. To avoid part bloatd, I think would be best implemented as a tweakable option, with one button for \u0022enable/disable LiquidFuel flow\u0022 and a separate button for \u0022enable/disable Oxidizer flow\u0022.\u003C/p\u003E\u003Cp\u003EI\u0027ve had some space plane designs where it would have been nice to have better control over automated resource flow.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-06-17T18:40:30Z","Content":"\n\u003Cp\u003EHmmmm... But couldn\u0027t you just click on that little green arrow for the tanks Oxidizer to stop flow? I\u0027m struggling to think of a case where this idea would be useful vs. the Tank Flow stop... :s\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-06-17T18:50:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Random Tank\u0022 data-cite=\u0022Random Tank\u0022\u003E\u003Cdiv\u003EHmmmm... But couldn\u0027t you just click on that little green arrow for the tanks Oxidizer to stop flow? I\u0027m struggling to think of a case where this idea would be useful vs. the Tank Flow stop... :s\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESometimes I want the Oxidizer to be flowing from that tank, just not to the engines being fed by the ducts. Changing the green arrow also requires clicking the tank and changing the setting. This takes a few seconds, and can lead to fuel imbalances, which in turn can lead to planes not flying straight, which can lead to having a bad day.\u003C/p\u003E\u003Cp\u003EFor example, I could build the center of a spaceplane with Mk2 fuselages, and standard rocket tanks on pylons port \u0026amp; starboard. I put an LVT-45 on the central fuselage and turbojets on the pylons. I want to send Oxidizer to central fuselage, but I don\u0027t want the LVT-45 to use the fuel from the pylons. I also can\u0027t lock out the fuel to the plyons, because then the turbojets have no fuel.\u003C/p\u003E\u003Cp\u003EThis is one example, I have had others.\u003C/p\u003E\u003Cp\u003EMaking the green arrow/red circle togglable by actions groups could help some, but it wouldn\u0027t have the full functionality of what I\u0027m requesting.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-17T19:31:16Z","Content":"\n\u003Cp\u003EI was testing similar design just recently. Of course I did not route oxidizer and liquid fuel individually, I just made sure all engines have access to whole storage and it worked just right. I don\u0027t have the design available just now but below is the essence.\u003C/p\u003E\u003Cp\u003EWith that, I have no problems with fuel pipes being tweakable to only conduct oxidizer or liquid fuel. It does not collide with the fuel flow implementation so it should be simple enough and it might help with some designs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Nink8UT.jpg\u0022 alt=\u0022Nink8UT.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-17T19:50:29Z\u0022 title=\u002206/17/2014 07:50  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 17, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-06-17T19:45:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EFor example, I could build the center of a spaceplane with Mk2 fuselages, and standard rocket tanks on pylons port \u0026amp; starboard. I put an LVT-45 on the central fuselage and turbojets on the pylons. I want to send Oxidizer to central fuselage, but I don\u0027t want the LVT-45 to use the fuel from the pylons. I also can\u0027t lock out the fuel to the plyons, because then the turbojets have no fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh ok, that\u0027s a good point, more useful for controlling the Dry CoM I spose. Not a hard one to implement, I just genuinely couldn\u0027t think of a use :3 \u003C/p\u003E\u003Cp\u003E\u002B1\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-17T19:57:37Z","Content":"\n\u003Cp\u003EBy the way, there is a design hack that allows routing liquid fuel and oxidizer separately at a cost of mounting some extra parts.\u003C/p\u003E\u003Cp\u003EThe engine draws liquid fuel from the left tank and oxidizer from the right tank. The two small fuel tanks were initially empty and only serve as fuel switches.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3NugCfx.jpg\u0022 alt=\u00223NugCfx.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-17T20:09:07Z","Content":"\n\u003Cp\u003E@LethalDose: take a look at Goodspeed fuel pump, it does exactly what you need, as you can set priority to tank and choose to pump/balance all/one of the resources (when using \u0022options\u0022 in context menu).\u003C/p\u003E\u003Cp\u003EBut it can be also seen as cheat because it breaks fuel cross-feed property of parts (you can magically balance LF through a decoupler for example)\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-06-17T23:17:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003E@LethalDose: take a look at Goodspeed fuel pump, it does exactly what you need, as you can set priority to tank and choose to pump/balance all/one of the resources (when using \u0022options\u0022 in context menu).\u003Cp\u003EBut it can be also seen as cheat because it breaks fuel cross-feed property of parts (you can magically balance LF through a decoupler for example)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlthough I\u0027ve had need for this functionality in the past, I don\u0027t currently. In the example above, I was simply demonstrating a use for the requested feature. If I find myself in need to do this again, I\u0027ll look at this mod (at least I assume it\u0027s a mod). Thank you for the suggestion.\u003C/p\u003E\u003Cp\u003EHowever, as I placed this thread in the suggestion section, the point is that I\u0027m recommending fuel ducts be tweakable \u003Cem\u003Ein stock\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-06-17T23:41:43Z","Content":"\n\u003Cp\u003EAnd make them reversible!\u003C/p\u003E\n"}]}