{"TopicId":75419,"ForumId":16,"TopicTitle":"Plane unstable on take off/landing","CreatedByName":"vitorboschi","CreatedById":59814,"CreatedDateTime":"2014-06-18T19:51:52Z","PageNum":1,"Articles":[{"CreatedByName":"vitorboschi","CreatedById":59814,"CreatedDateTime":"2014-06-18T19:51:52Z","Content":"\n\u003Cp\u003EHi all! Can someone help me fix the stability of my plane? It flyes really well, but I can\u0027t make it stable on take off / landing. When it reaches about 50 m/s, it begins to steer and then I quickly lose control and it crashes.\u003C/p\u003E\u003Cp\u003EPics:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/C22TC7q.jpg\u0022 alt=\u0022C22TC7q.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eljm7cX.jpg\u0022 alt=\u0022eljm7cX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/T1VIxpc.jpg\u0022 alt=\u0022T1VIxpc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/S2hps7p.jpg\u0022 alt=\u0022S2hps7p.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Od5WERD.jpg\u0022 alt=\u0022Od5WERD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI tried to add the struts under the wings, but they doesn\u0027t seem to help.\u003C/p\u003E\u003Cp\u003EThanks in advance!\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-06-18T19:58:08Z","Content":"\n\u003Cp\u003EI would say your wheel configuration has something to do with it. You don\u0027t need it angled that much, especially for a plane that small. \u003C/p\u003E\u003Cp\u003EYou also have a canard on your tail. Those don\u0027t really go there, so you\u0027re trying to fly without any real yaw control. Its possible that its causing your plane to veer a bit on takeoff.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-06-18T19:58:51Z","Content":"\n\u003Cp\u003EI am going to say, I think your wing wheels are not straight. I think they maybe toe\u0027d in just a bit which is causing your problems. \u003C/p\u003E\u003Cp\u003EI think the Firespitter wheels have a right click and check alignment option, you should see some lines show up in the SPH when you do this. It will show you if they are in alignment or out.\u003C/p\u003E\n"},{"CreatedByName":"vitorboschi","CreatedById":59814,"CreatedDateTime":"2014-06-18T20:18:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003EI would say your wheel configuration has something to do with it. You don\u0027t need it angled that much\u0027 date=\u0027 especially for a plane that small.\u003Cp\u003EYou also have a canard on your tail. Those don\u0027t really go there, so you\u0027re trying to fly without any real yaw control. Its possible that its causing your plane to veer a bit on takeoff.[/quote\u0027]\u003C/p\u003E\u003Cp\u003EChanged the canard to a tail fin and it seens just a little better on take off, but it\u0027s still bad. Now I\u0027m trying ti muck with the wheels alignment.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hodo\u0022 data-cite=\u0022Hodo\u0022\u003E\u003Cdiv\u003EI am going to say, I think your wing wheels are not straight. I think they maybe toe\u0027d in just a bit which is causing your problems. \u003Cp\u003EI think the Firespitter wheels have a right click and check alignment option, you should see some lines show up in the SPH when you do this. It will show you if they are in alignment or out.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt looks there\u0027s no aligment check option. Maybe its part of another mod? Anyway, I\u0027m trying to change the wheels angle a bit. Update: This is new in version 6.3.1. You have to press F2 to activate it. Restarting KSP and checking wheels! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-18T20:25:08Z\u0022 title=\u002206/18/2014 08:25  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 18, 2014\u003C/time\u003E by vitorboschi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vitorboschi","CreatedById":59814,"CreatedDateTime":"2014-06-18T20:36:29Z","Content":"\n\u003Cp\u003EAlright, Firespitter says the wheels are all aligned, so I took the front wheel a bit more to the nose, and it helped a bit. I can now go up to about 65m/s before it becomes unstable. Any other ideas?\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-06-18T22:11:20Z","Content":"\n\u003Cp\u003EIs there any movement anywhere at all when the plane loads? Any wing movement during flight? \u003C/p\u003E\u003Cp\u003EIf so, add struts. \u003C/p\u003E\u003Cp\u003EAre you making any manual movements during launch? If so, try turning on SAS then only steering as needed left and right. Don\u0027t try to pull up, let the runway launch you. Sometimes trying to pitch up adds weight to your rear landing gears and they might camber, which will make your plane roll.\u003C/p\u003E\u003Cp\u003EAlso try adding another engine to the back using a bi-adapter, then adjust the wings for COL. More thrust!\u003C/p\u003E\n"},{"CreatedByName":"vitorboschi","CreatedById":59814,"CreatedDateTime":"2014-06-19T00:07:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003EIs there any movement anywhere at all when the plane loads? Any wing movement during flight? \u003Cp\u003EIf so, add struts. \u003C/p\u003E\u003Cp\u003EAre you making any manual movements during launch? If so, try turning on SAS then only steering as needed left and right. Don\u0027t try to pull up, let the runway launch you. Sometimes trying to pitch up adds weight to your rear landing gears and they might camber, which will make your plane roll.\u003C/p\u003E\u003Cp\u003EAlso try adding another engine to the back using a bi-adapter, then adjust the wings for COL. More thrust!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t noticed any flexing on the structure of the plane, however, removing the two kethane extractors made the plane really stable, so I guess the problem is excessive loading. Thanks guys!\u003C/p\u003E\n"},{"CreatedByName":"i like turtles","CreatedById":169426,"CreatedDateTime":"2014-06-19T12:42:29Z","Content":"\n\u003Cp\u003Ealso, make sure that the CoL is not too far away from CoM. Make sure it is just behind CoM.\u003C/p\u003E\n"},{"CreatedByName":"feudalord","CreatedById":135072,"CreatedDateTime":"2015-01-11T08:35:33Z","Content":"\n\u003Cp\u003EThis is a bug of this game, it cant be fixed guys! I spent almost 2 weeks testing different aircraft configurations but the cause of this wobble during take off just cannot be identified. Although I have on occasions successfully created aircrafts tat can go high speed on the runway, ususally my aircraft will wobble during take off. I have experimented with those aircraft tat are stable on the runway and found tat even the tiniest shift in the position of landing gears, like a centimeter shift in whichever direction will cause a stable aircraft to become unstable. I have tried putting landing gears as far apart as possible, removing all fins and wings, make aircraft super light, make aircraft super heavy, hanging weights on either side of the aircraft, allow steering, disable steering, use different landing gear, shifting center of mass and pressure, use symmetry, dont use symmetry, unicycle, bicycle, tricycle, quadracycle, manually rotating and aligning landing gear, use alignment guide lines, giant centipede with 20 wheels... you name it, every single thing tat can be done has been done. I have scoured the internet for a solution, even learned some physics along the way.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2015-01-11T16:43:33Z","Content":"\n\u003Cp\u003EI can personally say I\u0027ve never had a problem with aircraft stability on the ground that couldn\u0027t be fixed by making sure the gear had zero camber and straddled the CoM. \u003C/p\u003E\u003Cp\u003EAlso, I think your CoL should be ahead of the rear wheels, but I\u0027ve never had the CoL and CoM so far apart this was an issue. It \u003Cem\u003Emay\u003C/em\u003E be an issue with the plane above.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-01-11T17:35:22Z","Content":"\n\u003Cp\u003EI\u0027ve had some problems with Retrofuture nosewheels just not being stiff/strong enough and bending, which causes all sorts of wild steering shenanigans - as I wanted to actually use them I tried a bunch of things, but usually end up using Bahamut0\u0027s adjustable gear. Your craft may just be too heavy for the FS gear.\u003C/p\u003E\n"}]}