{"TopicId":75467,"ForumId":16,"TopicTitle":"How to land a space plane?","CreatedByName":"kbkline","CreatedById":94494,"CreatedDateTime":"2014-06-19T12:10:54Z","PageNum":1,"Articles":[{"CreatedByName":"kbkline","CreatedById":94494,"CreatedDateTime":"2014-06-19T12:10:54Z","Content":"\n\u003Cp\u003EI haven\u0027t tried building and flying to many planes so I have questions...... I have been able to fly and land on the small island landing strip (some how) but how in the world do you figure out (a) where KSP is at from orbit and (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E what\u0027s the best way to learn how to land to begin with. I know it takes practice but man it\u0027s hard to me. From what I can tell mechjeb doesn\u0027t know how to land either as it always puts me in the ocean any time I try. Is there a good video or tutorial on any of this?\u003C/p\u003E\n"},{"CreatedByName":"FiesesAlien","CreatedById":98893,"CreatedDateTime":"2014-06-19T12:31:40Z","Content":"\n\u003Cp\u003EI have a similar Question but with Ferram Aerospace Mod. I tryd to build a ssto like Scott Manley did (\u003Ca href=\u0022http://abload.de/image.php?img=ssto17qrj.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://abload.de/thumb/ssto17qrj.png\u0022 alt=\u0022ssto17qrj.png\u0022\u003E\u003C/a\u003E) but i crash all the time after iam in the air over 10km -\u0026gt; 20km. My ascend is 45 degree up to 10km, then trying to be around 5 degree to mach 1,5 and around 20km. Mostly i ended up with mach 3 - 4 and bursting into parts. When i try to hold mach 1,5 i start to descent again. And when i finally try to go to 90Ã‚Â° and fire the rocket-engine (rapier-engine) 100% of the time i crash. And even watching scott manley doesnt gave me the clou (he does it so fast, the tutorials all are freakin\u0027 old and only stock-kerbal... i hate stock-kerbal, ive done everything there, i dont wanna play stock kerbal...)\u003C/p\u003E\u003Cp\u003EThe Picture is my attemp number 30 to build a ssto-plane.\u003C/p\u003E\u003Cp\u003EHeeeelp \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-06-19T13:27:24Z","Content":"\n\u003Cp\u003EUsing Kerbalmaps.com You can locate KSC from orbit (Assuming you don\u0027t have the Cloud mod)\u003C/p\u003E\u003Cp\u003EIt looks like THIS: \u003Cimg src=\u0022http://i.imgur.com/GWv39cr.jpg\u0022 alt=\u0022GWv39cr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow, getting there is a different story. You want to start your burn about 1/4th of the way around the planet from Kerbin (Depending on altitude and design, it will take some trial and error). As far as ctually landing, if you have MechJeb what you can do is open up spaceplane guidance and target the KSC Runway. Landing is then all about controlling airspeed and altitude.\u003C/p\u003E\u003Cp\u003E@FiesesAlien: As far as crashing, if your aircraft is falling apart due to aerodynamic failure then you are probably trying to make a large course correction while moving too fast too low in the atmosphere. Your initial ascent is fine, but you should only drop your nose to about 20 degrees until the RAPIER switches over, or the atmosphere gets thin enough that you can maneuver.\u003C/p\u003E\n"},{"CreatedByName":"DepletedUraniumPenetrator","CreatedById":113262,"CreatedDateTime":"2014-06-19T14:31:35Z","Content":"\n\u003Cp\u003EYou also can just plant a flag at the KSC. This way you can target it and always easily find it on the map.\u003C/p\u003E\n"},{"CreatedByName":"FiesesAlien","CreatedById":98893,"CreatedDateTime":"2014-06-19T14:57:45Z","Content":"\n\u003Cp\u003EThx @ Taki117. With the 20 degree Nose-Setting iam now in space with my ssto! \u003Ca href=\u0022http://abload.de/image.php?img=ssto27jkxh.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://abload.de/thumb/ssto27jkxh.png\u0022 alt=\u0022ssto27jkxh.png\u0022\u003E\u003C/a\u003E Also i have roughly 105 dV over to descent back and landing is no problem for me (iam better at landing jets then at anyhting else).\u003C/p\u003E\u003Cp\u003EThx.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-06-19T15:17:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FiesesAlien\u0022 data-cite=\u0022FiesesAlien\u0022\u003E\u003Cdiv\u003EI have a similar Question but with Ferram Aerospace Mod. I tryd to build a ssto like Scott Manley did (\u003Ca href=\u0022http://abload.de/image.php?img=ssto17qrj.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://abload.de/thumb/ssto17qrj.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://abload.de/thumb/ssto17qrj.png\u003C/a\u003E) but i crash all the time after iam in the air over 10km -\u0026gt; 20km. My ascend is 45 degree up to 10km, then trying to be around 5 degree to mach 1,5 and around 20km. Mostly i ended up with mach 3 - 4 and bursting into parts. When i try to hold mach 1,5 i start to descent again. And when i finally try to go to 90Ã‚Â° and fire the rocket-engine (rapier-engine) 100% of the time i crash. And even watching scott manley doesnt gave me the clou (he does it so fast, the tutorials all are freakin\u0027 old and only stock-kerbal... i hate stock-kerbal, ive done everything there, i dont wanna play stock kerbal...)\u003Cp\u003EThe Picture is my attemp number 30 to build a ssto-plane.\u003C/p\u003E\u003Cp\u003EHeeeelp \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk landing is the easy part..... lol\u003C/p\u003E\u003Cp\u003EHere is what I do to land in FAR at KSC. Mind you I also have DRE so I have some additional concerns like burning up in the atmosphere. I set my PE for just over the island base at around 20km altitude. As I hit the atmosphere interface I lose a lot of energy and it brings my point of impact around the western end of the continent that KSC is on. This is fine, I drop my altitude to about 15km and cruise on the jet engines till I am in site of the mountains west of KSC. Then I begin to descend to 5km altitude. I cut throttle so I also begin to slow down. Ideally I want to be going about 10m/s slower than my take off speed on landing, with a rate of decent no faster than 10m/s. Once my wheels touch the ground I try and keep the nose up while tapping the brakes so I don\u0027t flip the aircraft. I suggest taking your nose landing gear off of your brakes action, because it will only make things worse when trying to stop. \u003C/p\u003E\u003Cp\u003EIf you are going to cruise at near hypersonic speeds I highly suggest being up around 25km altitude, the air pressure up there is much thinner and you want have as much dynamic pressure at mach 4. \u003C/p\u003E\u003Cp\u003EAnd if you are going to fast when you get to KSC, just take your time and turn around slowly, and try again. I usually make a giant circle when I over shoot and try again from the same direction I first came in. But basically landing in FAR is like landing in real life, find a good glide plain and follow it to the runway.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-06-19T16:53:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hodo\u0022 data-cite=\u0022Hodo\u0022\u003E\u003Cdiv\u003EOk landing is the easy part..... lol\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot for everyone, and it\u0027s really not fair to trivialize landing. Especially for those having trouble with it.\u003C/p\u003E\u003Cp\u003EFor me, learning to land was one of the biggest sources of headaches in this game (even without FAR, but I was WAAAAY worse with it) and kept me off SSTOs for months. What worked for me was practice to learn what airspeeds were safe to avoid stalls in my SSTOs. The problem is there\u0027s no blanket answer like \u0022maintain a 4 degree glide path at 200 m/s\u0022 to solve it because every aircraft flies differently.\u003C/p\u003E\u003Cp\u003EIn addition to tons or practice, learning to manage air speed and altitude using pitch was very helpful too. [At least in FAR] You can shed airspeed by nosing up when your engines are low or off. The increase AoA leads to increased drag (I think) and some horizontal speed is converted to vertical speed, which is then bled of by gravity. I don\u0027t try to land if my speed is over 150 m/s, and I aim for somewhere between 90 and 120.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-06-20T02:06:01Z","Content":"\n\u003Cp\u003EI have a small rover on the west end of the runway so I always know where KSC is and more importantly, can always target it. If you are coming in from LKO in stock then the simple rough landing is to do your re-entry burn when you are on the opposite side of Kerbin to KCS and drop your periapsis down to 35km. Coast in and goose your jets if you are puling up short or nose down if you are over-shooting. Experiment with the height of your periapsis to get an exact, no-throttle landing.\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-06-20T02:12:53Z","Content":"\n\u003Cp\u003EI always have a rover that\u0027s flipped over somewhere near the runway, I use that.\u003C/p\u003E\u003Cp\u003EIf I dont have it, I look for 3 tiny islands.\u003C/p\u003E\n"}]}