{"TopicId":75525,"ForumId":21,"TopicTitle":"Single Stage Mun Lander - Kerbin to Mun and back","CreatedByName":"Soora666","CreatedById":69466,"CreatedDateTime":"2014-06-20T01:09:02Z","PageNum":1,"Articles":[{"CreatedByName":"Soora666","CreatedById":69466,"CreatedDateTime":"2014-06-20T01:09:02Z","Content":"\n\u003Cp\u003EHi once again, my newest design is here and this time rather than a tiny SSTO its a fairly small SSTM! I took the SSTO 1 step further from what i build before and decided to aim for a ship capable to taking off from kerbin, landing on the mun and getting back again without refueling or losing any parts. \u003C/p\u003E\u003Cp\u003EAfter much testing and many trials i present to you my ship!\u003C/p\u003E\u003Cp\u003EAs usual here is my download link for the ship if anyone is interested in trying it out for themselves. \u003Ca href=\u0022http://speedy.sh/GbjvM/Single-Stage-Mun-Lander.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://speedy.sh/GbjvM/Single-Stage-Mun-Lander.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is a video showing the full event from take off at kerbin to the eventual landing back at kerbin\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/KGEM9Ga3VL4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThis trip took me a fair while to complete and although it isnt perfect i managed to successfully do it. It could be better, even as it is it could be utilized better in the stages with better control and usage of gravity to make things quicker but hopefully this will suffice. As the prototype it will change and i might post a new version in the future if it proves to be a much better ship, otherwise this is fine as a proof of concept \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEnjoy and thanks for checking out my ship. Some screenshots of the ship flying and fully deployed are below!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lLM9wVp.png\u0022 alt=\u0022lLM9wVp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o8kmVZ1.png\u0022 alt=\u0022o8kmVZ1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4DC0XJO.png\u0022 alt=\u00224DC0XJO.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Larrt_M","CreatedById":104021,"CreatedDateTime":"2014-06-20T10:27:49Z","Content":"\n\u003Cp\u003ENow this looks interesting! I need to try this. Nice work!\u003C/p\u003E\n"},{"CreatedByName":"Soora666","CreatedById":69466,"CreatedDateTime":"2014-06-21T21:24:21Z","Content":"\n\u003Cp\u003EThanks, when i started designing it i wasnt sure it would even be doable without making something massive. Turns out trials and testing work wonders ^^\u003C/p\u003E\u003Cp\u003ELet me know how it goes when you try it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-06-21T22:19:39Z","Content":"\n\u003Cp\u003Eare those ion engines?\u003C/p\u003E\n"},{"CreatedByName":"Soora666","CreatedById":69466,"CreatedDateTime":"2014-06-24T04:41:26Z","Content":"\n\u003Cp\u003Eyes, the landing gear is connected to the ion engines and their xenon gas tanks.\u003C/p\u003E\u003Cp\u003ENeeded the ion engines to be able to make this craft small enough and light enough to be efficient for a single stage. It takes a while to make maneuvers with them but it allows for a much nicer craft \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}