{"TopicId":75600,"ForumId":44,"TopicTitle":"DId you have any problem with allergies?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-20T23:40:00Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-20T23:40:00Z","Content":"\n\u003Cp\u003EI know that most people with Asperger syndrome have some allergies \u003C/p\u003E\u003Cp\u003EI just pass the tests for local anesthesia because I have allergies and dentist, I do not know why afraid to take a chance, and just give me anesthes shot \u003C/p\u003E\u003Cp\u003EI have very good teeth, so there was no need to give me anesthesia, but now I have a problem with the damn wisdom teeth \u003C/p\u003E\u003Cp\u003EI wrote about it here: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.wrongplanet.net/postp6116833.html\u0026amp;highlight=#6116833\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.wrongplanet.net/postp6116833.html\u0026amp;highlight=#6116833\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Redjoker","CreatedById":68444,"CreatedDateTime":"2014-06-21T00:22:31Z","Content":"\n\u003Cp\u003ESince it seems that English may not be your first language, I wanted to ask a question to clarify the purpose of your post. Are you asking for people to share their experiences with allergies or more specifically about people\u0027s experiences with allergies and anesthesia and dentistry?\u003C/p\u003E\u003Cp\u003EIf there even a small chance of a reaction to anesthesia, doctors/dentists/surgeons/etc. will always test to confirm that will not have a reaction because the reaction can be severe enough that it can result in swelling of the trachea and cutting off of the airflow.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-06-21T02:08:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redjoker\u0022 data-cite=\u0022Redjoker\u0022\u003E\u003Cdiv\u003ESince it seems that English may not be your first language, I wanted to ask a question to clarify the purpose of your post.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re right. Pawelek\u0027s polish. Just humor him. He\u0027s mostly harmless. \u003C/p\u003E\u003Cp\u003EP.S. I get allergies in the spring. I think it is poplar pollen that causes it. I read somewhere that allergies are an over reaction of the immune system. But maybe someone here can educate us about allergic reactions?\u003C/p\u003E\n"},{"CreatedByName":"Redjoker","CreatedById":68444,"CreatedDateTime":"2014-06-21T03:30:22Z","Content":"\n\u003Cp\u003EI just wanted to make clear what he wanted to discuss,\u003C/p\u003E\u003Cp\u003EWe really don\u0027t know why allergies occur but we do know how. When a foreign compound enters the body in a normal reaction, cells carrying antigens attach to the compound and signal cells called plasma cells to produce more antibodies of the IgA, IgM, or IgG variety which attach to mast cells. These cells release histamine, which is why most allergy meds are anti-histamine\u0027s, which causes blood vessels to expand and swelling to occur. When there no allergic reaction, this lasts for a very small period of time but, if there is the plasma cells instead release a type IgE antibody. The IgE attaches to the mast cell and still releases histamine, but this time causes the mast cell to signal the plasma cell to produce more IgE and trigger more mast cells. This creates a feedback loop that can last for some time and can cause severe swelling.\u003C/p\u003E\u003Cp\u003EI can explain parts of it in more detail if anybody wants. I also suffer from extremely mild allergies to dairy, wheat, eggs, cats, pollen, and pine trees that usually just mean itchy eyes and a runny nose if I eat some of the food or be near the others for very long.\u003C/p\u003E\n"},{"CreatedByName":"TimoVM","CreatedById":113366,"CreatedDateTime":"2014-06-21T06:14:33Z","Content":"\n\u003Cp\u003EAllow me to elaborate a bit on Redjoker\u0027s (excellent) response\u003C/p\u003E\u003Cp\u003EThe reaction underlying an allergy response is an immune response aimed at multicellular organisms (such as Helminths etc.) and large structurees created by microorganisms such as biofilms where the normal IgG mediated respons isn\u0027t enough to destroy them. (The basics of this response are already outlined in RedJoker\u0027s post)\u003C/p\u003E\u003Cp\u003EAs such, the allergy response is the most destructive immune reaction present in the body (this also gives it interesting properties since surrounding tissue will try to restrict this destructive reaction in order to prevent collateral damage)\u003C/p\u003E\u003Cp\u003EThe problem lies in the fact that this specific IgE respons exists alongside the standard immune response on bacteria, the IgG response. An allergy is basically caused when a foreign compound evokes an IgE mediated response, onstead of the standard immune response. While research is still ongoing on the cause of this \u0022abnormal\u0022 response, it remains difficult to determine the exact nature of this unexpected immune reaction.\u003C/p\u003E\n"},{"CreatedByName":"Nao","CreatedById":23462,"CreatedDateTime":"2014-06-21T08:33:27Z","Content":"\n\u003Cp\u003E@PakledHostage lol mostly harmless haha well said \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E \u0026lt;3\u003C/p\u003E\u003Cp\u003EI have allergy for apples! Whenever i eat one (i love them, and polish apples are awesome) my lips are getting bigger and whole mouth feels hot and itchy.\u003C/p\u003E\u003Cp\u003EOh and @Redjoker or @TimoVM, could reaction (runny, itchy nose, shorter than standard flue etc) to dust from dry cut grass could be signs of an allergy to some grass pollens? My friend works at an airport as ground marshal (there is a lot of grass around), and never had any alleries/problems with this but this year he had an reaction to it and it looked exactly like my allergic reactions to grass pollens. \u003C/p\u003E\u003Cp\u003EI was also wondering if some of the irritations from grass dusts etc could be caused \u0022mechanically\u0022 rather than \u0022chemically\u0022 (like with asbestos, mechanically is a bad wording too but idk better hehe) and could that be also called allergy (since some people are sensitive to it and others not).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-21T08:38:21Z\u0022 title=\u002206/21/2014 08:38  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 21, 2014\u003C/time\u003E by Nao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-21T09:49:18Z","Content":"\n\u003Cp\u003EThe only thing I do not understand why the nurse gave me the ****ing venflon if it did not use, I had a total of two venflons (actually 3, but one was failed) first venflon have to to replace, because it start swelling and pain. \u003C/p\u003E\u003Cp\u003EThe doctor said it\u0027s just in case there was a strong allergic reaction to the drug to be tested, so they not need search for vein\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-21T11:40:25Z","Content":"\n\u003Cp\u003E\nHuh, didn\u0027t know there was a link between allergies and Asperger\u0027s.\n\u003C/p\u003E\n\u003Cp\u003E\nI have pollen allergies that bother me through the summer but they can be controlled with over-the-counter medication. They didn\u0027t manifest until I was in my teens.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-29T22:43:29Z\u0022 title=\u002209/29/2018 10:43  PM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 29, 2018\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Redjoker","CreatedById":68444,"CreatedDateTime":"2014-06-21T15:21:52Z","Content":"\n\u003Cp\u003E@Nao It could be just irritation since the main purpose of muscus is to capture foreign materials like dust and bacteria and to leave the body with them to prevent an infection or irritation in the body.\u003C/p\u003E\u003Cp\u003E@Pawelk This was just so that they could be ready to give a dose of ephinnephrine quickly if you had a severe reaction.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-21T16:03:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redjoker\u0022 data-cite=\u0022Redjoker\u0022\u003E\u003Cdiv\u003E@Nao It could be just irritation since the main purpose of muscus is to capture foreign materials like dust and bacteria and to leave the body with them to prevent an infection or irritation in the body.\u003Cp\u003E@Pawelk This was just so that they could be ready to give a dose of ephinnephrine quickly if you had a severe reaction.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eephinnephrine?\u003C/p\u003E\n"},{"CreatedByName":"Redjoker","CreatedById":68444,"CreatedDateTime":"2014-06-21T16:33:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003Eephinnephrine?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I can\u0027t spell within an hour of waking up. I meant epinephrine, which is also known as adrenaline. It causes the airways to expand and allow more air in. This is used because the danger of a severe allergic reaction known as anaphylaxis is that the swelling of tissue can cause the airways to be constricted and prevent airflow to the lungs.\u003C/p\u003E\u003Cp\u003ESide note: Epinephrine is called adrenaline when you are referring to the fight or flight response.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-21T17:44:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redjoker\u0022 data-cite=\u0022Redjoker\u0022\u003E\u003Cdiv\u003ESorry, I can\u0027t spell within an hour of waking up. I meant epinephrine, which is also known as adrenaline. It causes the airways to expand and allow more air in. This is used because the danger of a severe allergic reaction known as anaphylaxis is that the swelling of tissue can cause the airways to be constricted and prevent airflow to the lungs.\u003Cp\u003ESide note: Epinephrine is called adrenaline when you are referring to the fight or flight response.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks very much \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Napaeozapus","CreatedById":7909,"CreatedDateTime":"2014-06-21T21:19:00Z","Content":"\n\u003Cp\u003EI was starting to have allergies for a few years but a couple years ago I changed my diet quite a lot. Now I don\u0027t have any allergies or get sick in general.\u003C/p\u003E\u003Cp\u003EWhatever I was reacting to in my brother\u0027s house quit bothering me too.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-06-22T01:40:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redjoker\u0022 data-cite=\u0022Redjoker\u0022\u003E\u003Cdiv\u003ESorry, I can\u0027t spell within an hour of waking up. I meant epinephrine, which is also known as adrenaline. It causes the airways to expand and allow more air in. This is used because the danger of a severe allergic reaction known as anaphylaxis is that the swelling of tissue can cause the airways to be constricted and prevent airflow to the lungs.\u003Cp\u003ESide note: Epinephrine is called adrenaline when you are referring to the fight or flight response.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as I know, only in USA it\u0027s called epinephrine. In other countries, at least the ones where English isn\u0027t primary language, the chemical is called adrenaline.\u003C/p\u003E\n"},{"CreatedByName":"Redjoker","CreatedById":68444,"CreatedDateTime":"2014-06-22T02:11:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EAs far as I know, only in USA it\u0027s called epinephrine. In other countries, at least the ones where English isn\u0027t primary language, the chemical is called adrenaline.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my experience epinephrine is the scientific term and is used by the World Health Organization, while adrenaline is the term used by most people even in the US. For example a common term for a thrill seeker is an adrenaline junkie.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-22T03:26:44Z\u0022 title=\u002206/22/2014 03:26  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 22, 2014\u003C/time\u003E by Redjoker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-28T08:24:00Z","Content":"\n\u003Cp\u003EI wonder what can cause allergy? My mother was born in 1948, told me that when she went to school there was only one child with allergies in the entire school. \u003C/p\u003E\u003Cp\u003EOnce I heard one of our Polish eminent specialist in allergies said that the Americans and the British are guilty of plague of allergy in Poland, said that as a joke, not to offend the two nations. \u003C/p\u003E\u003Cp\u003EHis point here is that the allergy she started to spread after the Polish agriculture began to apply insecticides on a large rock in the early 60\u0027s. \u003C/p\u003E\u003Cp\u003EThe greatest success enjoyed (Azotox) known in the West as DDT :-) \u003C/p\u003E\u003Cp\u003EI read that even the Communist Party campaigned, you could even call Azotox (DDT) advertising , distribute it for free to the PGR (state farms) and gave it to private farmers. Many farmer did not like to use Azostox, believed that the Axotox is not useful or even harmful, but the party could use \u0022various means of persuasion\u0022 to the recalcitrant farmers. \u003C/p\u003E\u003Cp\u003ENow, some experts believe that much of the of allergy is due to the use of Azotox (DDT)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T12:51:27Z\u0022 title=\u002206/28/2014 12:51  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by Pawelk198604\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-06-28T21:06:03Z","Content":"\n\u003Cp\u003EInteresting fact, many scientists believe that living in an obscenely clean environment may contribute to a development of allergies\u003C/p\u003E\u003Cp\u003ESource: \u003Ca href=\u0022http://www.sciencedaily.com/releases/2010/04/100413160901.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.sciencedaily.com/releases/2010/04/100413160901.htm\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Napaeozapus","CreatedById":7909,"CreatedDateTime":"2014-06-28T22:19:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skyler4856\u0022 data-cite=\u0022Skyler4856\u0022\u003E\u003Cdiv\u003EInteresting fact, many scientists believe that living in an obscenely clean environment may contribute to a development of allergies\u003Cp\u003ESource: \u003Ca href=\u0022http://www.sciencedaily.com/releases/2010/04/100413160901.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.sciencedaily.com/releases/2010/04/100413160901.htm\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as out gut bacteria, should probably also consider the effect of diet, antibiotics, antimicrobials and other things.\u003C/p\u003E\n"},{"CreatedByName":"TimoVM","CreatedById":113366,"CreatedDateTime":"2014-06-29T00:36:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nao\u0022 data-cite=\u0022Nao\u0022\u003E\u003Cdiv\u003EOh and @Redjoker or @TimoVM, could reaction (runny, itchy nose, shorter than standard flue etc) to dust from dry cut grass could be signs of an allergy to some grass pollens? My friend works at an airport as ground marshal (there is a lot of grass around), and never had any alleries/problems with this but this year he had an reaction to it and it looked exactly like my allergic reactions to grass pollens. [\\Quote]\u003Cp\u003ESuch a reaction could indeed be a sign of an allergy, though you\u0027d need to test to confirm whether your friend reacts on grass or something else. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nao\u0022 data-cite=\u0022Nao\u0022\u003E\u003Cdiv\u003EI was also wondering if some of the irritations from grass dusts etc could be caused \u0022mechanically\u0022 rather than \u0022chemically\u0022 (like with asbestos, mechanically is a bad wording too but idk better hehe) and could that be also called allergy (since some people are sensitive to it and others not).[\\Quote]\u003Cp\u003ETechnically this would be possible, though the lungs have a few defense mechanisms against this. The presense of the grass dust would then be detected, allowing a chemical response (the line between mechanical and chemical tends to blur a bit there)\u003C/p\u003E\u003Cp\u003EI\u0027d also like to note that asbestos is a tad bit more harmful compared to other things. The basic response to asbestos splinters is to absorb them and degrade them inside the cells of the lung. The problem is that asbestos has a very robust chemical structure which the cell is incapable of degrading. (this is also why asbestos was so popular, because it was pretty much inert to most standard chemical reactions)\u003C/p\u003E\u003Cp\u003EFurthermore, because asbestos tends to splinter, cells will effectively fill themselves with really sharp, indestructible needles\u0027 perfectly capable of rupturing the cell membrane. This combined with the overexpression of degradation pathways leads to severe cell damage, leading to cell death or the development of cancer.\u003C/p\u003E\u003Cp\u003ESo the answer would be, \u0022yes, but not in the same way compared to Asbestos.\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2014-06-29T03:05:30Z","Content":"\n\u003Cp\u003EI have Asperger.\u003C/p\u003E\u003Cp\u003ESo regarding allergies.\u003C/p\u003E\u003Cp\u003EI was allergic to pollen or what that is in english. Stuff that flowers stick on bees. But that was in my childhood, no longer allergic to that.\u003C/p\u003E\u003Cp\u003EI am intolerent of lactose and gluten. So no dairy products or stuff made of wheat etc.\u003C/p\u003E\u003Cp\u003EThat\u0027s it for me, I think.\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2014-06-29T06:28:03Z","Content":"\n\u003Cp\u003EI have Celiac Disease (not a true allergy, but the effects are the same.) I know how you feel.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-29T09:00:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rpayne88\u0022 data-cite=\u0022rpayne88\u0022\u003E\u003Cdiv\u003EI have Celiac Disease (not a true allergy, but the effects are the same.) I know how you feel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you are allergic to gluten, also once had this disease, but the disease, disappeared by itself, maybe not entirely by it self.\u003C/p\u003E\u003Cp\u003EAfter all traditional treatment failed my mom tried alternative medicine. In mid 90\u0027s the doctors from Mongolia come to Poland, they used traditional Chinese medicine, and Chinese treatment was cheaper and more effective than chemical drugs used by our doctors.\u003C/p\u003E\n"},{"CreatedByName":"Napaeozapus","CreatedById":7909,"CreatedDateTime":"2014-06-29T13:56:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003ESo you are allergic to gluten, also once had this disease, but the disease, disappeared by itself, maybe not entirely by it self.\u003Cp\u003EAfter all traditional treatment failed my mom tried alternative medicine. In mid 90\u0027s the doctors from Mongolia come to Poland, they used traditional Chinese medicine, and Chinese treatment was cheaper and more effective than chemical drugs used by our doctors.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat was the Chinese treatment you were given?\u003C/p\u003E\u003Cp\u003EFrom what I have read gluten intolerance can cause other allergies from causing intestinal damage which allows incompletely digested material to be absorbed into the body.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-06-29T20:47:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Napaeozapus\u0022 data-cite=\u0022Napaeozapus\u0022\u003E\u003Cdiv\u003EWhat was the Chinese treatment you were given?\u003Cp\u003EFrom what I have read gluten intolerance can cause other allergies from causing intestinal damage which allows incompletely digested material to be absorbed into the body.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis was mainly therapy with herbs and acupuncture, now I no longer have allergies to gluten\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2014-06-30T07:10:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003EThis was mainly therapy with herbs and acupuncture, now I no longer have allergies to gluten\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would like to know the EXACT herbs and dosages they gave you.\u003C/p\u003E\n"}]}