{"TopicId":75753,"ForumId":55,"TopicTitle":"Multiplayer time warp theory","CreatedByName":"YourEverydayWaffle","CreatedById":83957,"CreatedDateTime":"2014-06-23T02:32:02Z","PageNum":1,"Articles":[{"CreatedByName":"YourEverydayWaffle","CreatedById":83957,"CreatedDateTime":"2014-06-23T02:32:02Z","Content":"\n\u003Cp\u003EHey all. I wanted to see what you think of my concept here for KSP time warp in multiplayer. The one big drawback. is it would require a server with huge physical memory as well as RAM. My concept is this: similar to the \u0022Relative Sync\u0022 method, the game keeps track of the most chronologically advanced player\u0027s save. This is the \u0022warp ceiling\u0022. The least chronologically advanced player is important as well, and this is the \u0022warp floor\u0022. So, each player\u0027s progress is saved as they go on, as a sort of timeline of events. This timeline is \u0022unraveled\u0022 for any players who reach that point in time, that is, players who reach any points that the time line covers will see the past of other players at that point. Player\u0027s progress is like a printer. It \u0022prints\u0022 it\u0027s past onto a paper, which is pushed down a line. Somewhere on that line is a scanner (another player), which has a printer attached as well. It can read the past actions of the first printer, but can also print it\u0027s own actions for other players further down the line. Time warp would be as simple as moving the printer/scanner forward on the line of paper, closer to the \u0022ceiling\u0022. \u003C/p\u003E\u003Cp\u003ESo... is this valid, or not (and is it the same as Kessler multiplayer [was unable to tell if warp was available on Kessler])? Thanks for an feedback. Sorry if I am just mirroring Kessler without knowing it, too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor those of us who think better visually, I drew this (with some sweet MS Paint skills, if I do say so): \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/22ljDsJ.png\u0022 alt=\u002222ljDsJ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-06-23T04:00:41Z","Content":"\n\u003Cp\u003EThis is sound, so long as there are no collisions/docking. And it\u0027s essentially how any good MP server works. Because of network lag, everyone playing in a shooter is at a slightly different delay from the server. So when you shoot someone, how does the server know if you hit? Well, info on when and where you shot is sent to the server, and server keeps some logged data on movement of every entity. So it sees if you\u0027d hit the enemy based on where that enemy was when you fired. And if so, it subtracts health.\u003C/p\u003E\u003Cp\u003EOf course, in a shooter, we are talking less than a second of data being buffered this way. And if you got shot, typically, all it means is that you found out that you\u0027ve been killed a fraction of a second later than it actually happened. Not a problem. even with explosions, if your position shifts slightly due to prediction miss, it\u0027s not a huge deal.\u003C/p\u003E\u003Cp\u003EBut in KSP, if you even nudge someone most gently during docking, it will shift their future location by hundreds of kilometers. If server suddenly decides to take that into account, it can mean all sorts of trouble for the player that leads the warp ceiling. You really need to figure out how to deal with these sorts of situations if you want warp to be de-synchronized.\u003C/p\u003E\u003Cp\u003EP.S. Memory isn\u0027t an issue, by the way. So long as you only store changes of ship configuration and trajectories of individual ships, it\u0027s peanuts. You can have years worth of data stored in RAM. Which is what you want here, of course.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-06-23T06:04:37Z","Content":"\n\u003Cp\u003EThread discussing development moved to Suggestions and Development Discussion.\u003C/p\u003E\u003Cp\u003E...Carry on!\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-06-23T07:27:36Z","Content":"\n\u003Cp\u003EHello - I\u0027m the developer of DarkMultiPlayer and was a dev on KerbalMultiPlayer! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s a few different ways of tackling the multiplayer problem, and I have 2 major ways that offer different playstyles of solving the problem.\u003C/p\u003E\u003Cp\u003EThe first is probably the more intuitive but less useful master controlled warp, in which players can\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/pGfUvyTaetQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. I find this solution lacking unless you\u0027re on voice chat and are all trying to do the same thing.\u003Cp\u003EThe way KMP solves the problem, and the way DMP prefers to solve the problem is by using something called subspaces, which is basically relative sync. Each player has a \u0022timeline\u0022 (subspace) they are on, and they can warp/sync to the future players.\u003C/p\u003E\u003Cp\u003EDMP keeps hold of the future updates, but DMPServer only holds on to the latest updates, making the CPU and RAM requirements nearly nothing.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/CcS2MYO8fEs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E, the spectator is actually watching events play out as their timeline crosses the future. This is probably similar to your suggestion \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-23T13:03:58Z","Content":"\n\u003Cp\u003EFrom the last thread on multiplayer timewarp:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EAsynchronous timewarp has some problems. \u003Cp\u003EImagine two players are racing to intercept an asteroid. Player 1 plots his intercept, does his burn and goes full timewarp and intercepts. Player 2 plots a little more carefully and finds an earlier intercept, does his burn, but only warps at half the rate. Player 1 arrives first in real time and thinks he\u0027s won the race, Player 2 arrives later in real time and earlier in game time. If Player 2 adjusts the course of the asteroid, how does the game reconcile the play that Player 1 has already performed?\u003C/p\u003E\u003Cp\u003EOr imagine two players are messing around with spaceplanes supported by a orbiting fuel depot with 1000 units of fuel. Player 1 launches, transfers to the Mun under timewarp, then returns under timewarp, and docks with the station and takes on 600 units of fuel. Player 2 spends some time flying around Kerbin, using more real time but less game time since he isn\u0027t warping. He then ascends to rendezvous with the station and attempts to take on 600 units of fuel. Should he be able to? If yes, does Player 1 lose fuel?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve not heard yet a good solution to those types of situations. A \u0022warp master\u0022 sidesteps sync problems, but at the cost of player boredom when they\u0027re ready to warp but the master isn\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2014-06-23T13:46:23Z","Content":"\n\u003Cp\u003ESome problems..\u003C/p\u003E\u003Cp\u003EIsn\u0027t being in the past a way to kill other players at no defense?\u003C/p\u003E\u003Cp\u003ELet\u0027s say you had an interplanetary generic fuel tank that was going to magically leave kerbin orbit in 2 yrs. Player BD decides to time warp 2 years into the future to cause it to leave, leaving players U, V, and N in the past. What if player N smashed the thaumic accelerator on the generic fuel tank in orbit around kerbin while player BD\u0027s present fuel tank is in orbit around the sun? Would the future have to override the past? Would any alterations made in the past destroy the future completely?\u003C/p\u003E\u003Cp\u003EPlayer N isn\u0027t an observer. He plays in the past along with U and V because going into the future would screw things up for V, and N wants to do things like build a base with U. What can player N do if BD goes into the future and makes a burn using N\u0027s warhead? If the future were to override the past, player N\u0027s warhead would probably blow up or something.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-23T13:54:41Z\u0022 title=\u002206/23/2014 01:54  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 23, 2014\u003C/time\u003E by Tery215\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-06-23T14:02:09Z","Content":"\n\u003Cp\u003EThis system might work only if you assume ghost-mode. Meaning: Players cannot interact with each other unless they\u0027re at exactly same point of time - any attempt to do anything with a ships owned by another player will cause clipping with no interaction what so ever.\u003C/p\u003E\u003Cp\u003EBut even then - this system is flawed because it requires game to transfer and store quite a large amounts of data, data that isn\u0027t collected right now (otherwise we\u0027d have a reply mode), so it\u0027d require tons of work that only adds on top of what is necessary for the multiplayer.\u003C/p\u003E\u003Cp\u003ETBH: If anything I\u0027d prefer wrap master over an idea from original poster. Even if it could be implemented in some reasonable time window.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-23T14:04:17Z\u0022 title=\u002206/23/2014 02:04  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 23, 2014\u003C/time\u003E by Sky_walker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-23T14:42:24Z","Content":"\n\u003Cp\u003EI thought this was settled? Each player/ship is in their own time zone, in order to interact with another object you have to be synced with them (in the same time zone), this could be done though the map view with a button that says sync with. Ships can only be moved forward in time to prevent funny things with time travel, so to dock with a fuel depo that is behind you chronologically you have to bring it forward in time by hitting the sync with button. If you are behind it chronologically you have to sync forward to be able to interact with it.\u003C/p\u003E\u003Cp\u003EIf you are infront of an object you would see a ghost of where it would be if it was synced with you and ditto if you where behind it, a ghost of where it was.\u003C/p\u003E\u003Cp\u003EThis prevents paradoxes as only one true instance of an object ever exists at one time. To prevent griefing a set a permissions could be created to determine who could bring an object through time or who could control it; white list, black list, private, puclic, friends, admin only ect ect.\u003C/p\u003E\u003Cp\u003EThe only issue would be ghosts jumping around madly in the future when a ship is accelerating in the past.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-23T14:47:30Z","Content":"\n\u003Cp\u003EYou can\u0027t ghost into the future. \u003C/p\u003E\u003Cp\u003EI believe the goal of the OP is to make the game feel like other players are there (to make the game feel more populated and alive) even if you\u0027re not synched with them, and suggets a method by which you see where they were (in their past) at your current present. But yes, they would have to be non-interactable (ghosts) and it would, as you say, require the exactly same kind of functionality as a replay feature.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-23T14:51:43Z","Content":"\n\u003Cp\u003EWhy can\u0027t you ghost into the future? If I\u0027m in orbit around duna at 100 km by 120 km, the game can calculate where I would be in x amount of time, that\u0027s what it has to do then just display a ghosted version of the ship (slightly transparent maybe) at that time and place. Honestly it\u0027s exactually what KMP does, or did more accuratly. It\u0027s been done.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-23T14:52:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EShips can only be moved forward in time to prevent funny things with time travel, so to dock with a fuel depo that is behind you chronologically you have to bring it forward in time by hitting the sync with button.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow would rendezvous work? Say I want to use a fuel depot, so I rendezvous with it only to discover I have to timewarp ahead (either ship or depot) a bunch. That timewarp will ruin the rendezvous because it\u0027s impossible to perfectly match the orbits.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-23T14:58:16Z","Content":"\n\u003Cp\u003ESync with the depo before you rendezvous, or perhaps the feature from the mod Burn Together where ships can remain locked together during time warp could be implemented.\u003C/p\u003E\u003Cp\u003EEdit: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75170-WIP-Plugin-(0-23-5)-Burn-Together!-Alpha-v5-1-(5-14-14)\u0022 rel=\u0022external nofollow\u0022\u003EHere\u003C/a\u003E is the Burn Together mod.\u003C/p\u003E\n"},{"CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2014-06-23T15:06:03Z","Content":"\n\u003Cp\u003Ei don\u0027t understand why this is a theory. KMP already does something a little like this. Someone should just test all these paradoxes on KMP and see what happens.\u003C/p\u003E\u003Cp\u003EEither everything will be smoothed out using only in game time or a new kraken will be born.\u003C/p\u003E\u003Cp\u003ETHE TIME KRAKEN! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-06-23T15:57:51Z","Content":"\n\u003Cp\u003EAnother solution for the multiplayer problem:\u003C/p\u003E\u003Cp\u003EDisable time warp completely and add some kind of warpdrive into the game. Finish. All problems solved.\u003C/p\u003E\u003Cp\u003EEdit: The warpdrive should only be capable of accelerating your current flight direction, so that you can not save dV requirements with it. Basically same as timewarp without actually tampering with the time only travelling speed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-23T16:01:32Z\u0022 title=\u002206/23/2014 04:01  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 23, 2014\u003C/time\u003E by gpisic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-06-23T16:00:19Z","Content":"\n\u003Cp\u003EThe ultimate solution to all of the problems in Kerbal:\u003C/p\u003E\u003Cp\u003EAdd teleportation device with an unlimited range.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-23T16:02:20Z","Content":"\n\u003Cp\u003EHave multiple players settle their differences in real time on a much smaller map with firearms. Oh wait...\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2014-06-23T16:45:25Z","Content":"\n\u003Cp\u003EWhat I\u0027d actually love is a \u0027hard mode\u0027 multiplayer with no timewarp AND no warp drive, that lets you set SMS and email / chat notifications to your smartphone. Have \u0022control\u0022 determined by an avatar character, so if you want to make sure SOMEONE is around to execute the next maneuver node, either install a probe core with autopilot capabilities, or have multiple crewmembers on the ship that are each controlled by a different player, so that SOMEONE will be awake and not at work to take control of the ship after getting the SMS.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-23T16:50:28Z","Content":"\n\u003Cp\u003EUgh, no. That game would not be practical outside of LKO, and barely practical there.\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2014-06-23T16:55:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EUgh, no. That game would not be practical outside of LKO, and barely practical there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI Dwarf Fortress. What is this \u0022practical\u0022 you speak of?\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-06-23T17:51:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ialdabaoth\u0022 data-cite=\u0022ialdabaoth\u0022\u003E\u003Cdiv\u003EI Dwarf Fortress. What is this \u0022practical\u0022 you speak of?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think even the Dorfs would get bored at a real-time journey to Jool or Eeloo.\u003C/p\u003E\u003Cp\u003ESee you next year?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-06-23T18:04:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EThe only issue would be ghosts jumping around madly in the future when a ship is accelerating in the past.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is a huge problem. Ok, so lets say that any two players trying to dock together are always concurrent and on voice-chat. Trying to dock up with another player without comms is a suicide pact anyways. So accelerating ghosts won\u0027t matter there. But what of stations?\u003C/p\u003E\u003Cp\u003ESuppose, I want to dock to a station that another player is docking to at the same time, but his game time is several hours into the future. Any bump I make against the station during docking will send it tens of kilometers off course. But it gets worse. Suppose, another player docks to a station first, but in the future compared to my timeline. I dock to station and bump it off course. Should it move the station along with docked ship? Probably. According to game logic, they are one ship now, anyways. But what if the ship that docked to the station also gets interacted with in its past timeline? Who gets moved where? Technically, docking wouldn\u0027t even have happened.\u003C/p\u003E\u003Cp\u003EHonestly, this is a royal mess. Ghosting offers a lot of advantages, but it\u0027s far from paradox-free.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-06-23T21:07:06Z","Content":"\n\u003Cp\u003EBut you aren\u0027t able to bump the station if it is several hours ahead. You have to sync with it in order to physically interact with it, which would bring you into the same time reference as your buddy. If you are not in the same time reference as a ship you can\u0027t interact with it, that\u0027s how it prevents paradoxes, it only looks like the station is there in the past, but you can only interact with it in the present.\u003C/p\u003E\u003Cp\u003EMan that got confusing fast.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-06-23T21:54:10Z","Content":"\n\u003Cp\u003EHm. Good point. That still doesn\u0027t exclude problems with two people trying to dock to it at the same time, though. Say, the time ordering is (station, ship 1, ship 2). Both ships want to dock to station. Naturally, if ship 1 fast-forwards the station to own time, it will start throwing things off for ship 2 who is trying to approach for docking. Or if ship 2 starts fast-forwarding station to own time while you are trying to dock with it. Of course, it\u0027s a fairly minor issue compared to everything else. And it results in inconvenience, rather than hard sync issues.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-06-24T01:21:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EHm. Good point. That still doesn\u0027t exclude problems with two people trying to dock to it at the same time, though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf they\u0027re actually at the same TIME, as in the same subspace, there are no problems whatsoever- aside from the obvious ones of players working out between each other who gets to dock to what docking port and how much fuel they can take, etc. No problems with causality or continuity, though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003ESay, the time ordering is (station, ship 1, ship 2). Both ships want to dock to station.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut a station is just another vessel, as KSP sees it. Naturally, only one of the players actually OWNS the station- the other is just using it on configurable permission (or perhaps a third players owns it and is allowing both to use it).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003ENaturally, if ship 1 fast-forwards the station to own time, it will start throwing things off for ship 2 who is trying to approach for docking\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou miss the fundamental impossibility of the problem you are bringing up- Player 2 cannot approach for docking in the first place, as he is not in sync with the station.\u003C/p\u003E\u003Cp\u003EEven if Player 2 could see a ghost of where the ship was predicted to be, based on its orbit in the past, he would have to know that due to floating-point errors, etc (which we already deal with in single-player when trying to plan a rendezvous- which is why you ALWAYS have to adjust your rendezvous as you get closer...) it would be impossible to know precisely where the station would be anyways.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EOr if ship 2 starts fast-forwarding station to own time while you are trying to dock with it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s more an issue of control- namely, who is in control of the Station. If both players had somehow ended up sharing permission for time-warp, it would be their own stupid fault if they couldn\u0027t work out an agreement so Player 1 could finish his docking/refueling before Player 2 synced the station up with himself to allow docking/rendezvous.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EOf course, it\u0027s a fairly minor issue compared to everything else. And it results in inconvenience, rather than hard sync issues.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty much. The issues with multiplayer you described are mostly inconveniences of players working out between themselves who gets to control the time-warp of shared vessels (the warp-master solution is just taking this to the extreme, where one player controls the time-warp for ALL vessels). It\u0027s not like other multiplayer games don\u0027t already have similar issues- the allocation of a limited amount of ammo/medkits between players in many FPS games, for instance. One selfish player can ruin everybody else\u0027s experience.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-06-24T06:48:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EYou miss the fundamental impossibility of the problem you are bringing up- Player 2 cannot approach for docking in the first place, as he is not in sync with the station.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe can approach the ghost. Naturally, you\u0027d first get yourself into \u0022mostly\u0022 right place, then fast-forward the station. Otherwise, you are just denying it to a bunch of people who could have used it at a different time.\u003C/p\u003E\n"}]}