{"TopicId":75938,"ForumId":36,"TopicTitle":"[1.0.x] [V1.9f] Kerbal Foundries wheels, anti-grav repulsors and tracks","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-25T17:24:04Z","PageNum":135,"Articles":[{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-22T16:46:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Madrias\u0022 data-cite=\u0022Madrias\u0022\u003E\u003Cdiv\u003EThe APU also has the advantage of having, at least to me, a more aesthetically pleasing look to it. It looks like something designed to generate power in an atmosphere. It\u0027s also a great addition to aircraft where you need power for certain applications without producing a significant amount of thrust from your main engine, like while you\u0027re trying to land while using reaction wheels to keep the plane steady.\u003Cp\u003E-snipped stuff-\u003C/p\u003E\u003Cp\u003EIt\u0027s not throwing out the Fuel Cells because it can\u0027t make electricity without oxygen, but it means you\u0027re not lugging around oxidizer on your Laythe Exploration Rover, which means less overall weight in your ship to get it there.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wanted to weigh in on this. Yeah, it does look great (needs its base to be assigned a texture though) but there is one problem with it: the thrust. Granted, it produces an extremely small amount of thrust, however I have had some trouble with several flight assistance mods where I had to disable certain features because the APU was being taken into consideration when calculating the thrust of the craft and was limiting the rest of the engines to match. This fact alone is a good reason to at least switch out the module within it to something that runs independently of the engine module. It shouldn\u0027t be too hard to assign a sound, and even a tiny little particle to an exhaust pipe or something, to run along with the fuel-to-power conversion. It also shouldn\u0027t be too difficult to add an intake air/atm requirement for a fuel-cell style module attached to the APU model for the up side of not needing oxidizer.\u003C/p\u003E\n"},{"CreatedByName":"Space Scumbag","CreatedById":70411,"CreatedDateTime":"2015-07-22T22:00:53Z","Content":"\n\u003Cp\u003EHey guys,\u003C/p\u003E\u003Cp\u003Ecan someone of you elaborate the current state of this mod? I try to keep up and read the latest comments/conversations from time to time, but here in this thread is happening so much. Too much if you don\u0027t have the time to read all of it. So, maybe you can add a new, updated FAQ in the first post? What features are you currently working on, what will be the biggest changes in the next update, any estimation for the next release, what\u0027s up with DustFX, a final release? etc.\u003C/p\u003E\u003Cp\u003EThis would be really nice of you and could probably help others to stay up to date.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-22T23:24:00Z","Content":"\n\u003Cp\u003EGood call, actually! Reading the thread would be quite a gargantuan task to be fair, and most of it is dev stuff that most won\u0027t necessarily be interested in. I\u0027ll do a little status update when I have a few minutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-23T05:17:08Z","Content":"\n\u003Cp\u003EThink we\u0027re ready to do a thread in the release board for this next update? I also wonder how large a specific thread should be before we try to lock it down and start a fresh thread for the dev stuff.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T05:20:48Z\u0022 title=\u002207/23/2015 05:20  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T07:08:26Z","Content":"\n\u003Cp\u003EYeah, it\u0027s getting a little out of hand, isn\u0027t it! Given the major changes, I\u0027d like to keep the up coming release as beta - there will be bugs to iron out. Once that\u0027s settled, let\u0027s release at 2.0!\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T12:22:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Space Scumbag\u0022 data-cite=\u0022Space Scumbag\u0022\u003E\u003Cdiv\u003EHey guys,\u003Cp\u003Ecan someone of you elaborate the current state of this mod? I try to keep up and read the latest comments/conversations from time to time, but here in this thread is happening so much. Too much if you don\u0027t have the time to read all of it. So, maybe you can add a new, updated FAQ in the first post? What features are you currently working on, what will be the biggest changes in the next update, any estimation for the next release, what\u0027s up with DustFX, a final release? etc.\u003C/p\u003E\u003Cp\u003EThis would be really nice of you and could probably help others to stay up to date.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027s on the agenda for now:\u003C/p\u003E\u003Cp\u003E- All wheels and tracks configs need to be updated for balances and new features.\u003C/p\u003E\u003Cp\u003E- Code clean-up.\u003C/p\u003E\u003Cp\u003E- KSP\u0027s part loader calculates wrong sizes for some parts.\u003C/p\u003E\u003Cp\u003EI think we don\u0027t have a list of what to change/add in future. There\u0027ll probably a big brainstorming session after the next release. This is also necessary because we want to change the development process a bit.\u003C/p\u003E\u003Cp\u003EThere\u0027s no release date for the next version because we only put work into this mod when we\u0027ve got some free time. We just don\u0027t know when it\u0027s ready.\u003C/p\u003E\u003Cp\u003EDustFX is finished and will be included in the next release.\u003C/p\u003E\u003Cp\u003E@lo-fi \u0026amp; Gaalidas\u003C/p\u003E\u003Cp\u003EMaybe we should start a release thread in the add-ons forum where users can download the latest stable version, ask about specific stuff and report bugs. This dev thread we\u0027ll use just for coordinating development, helping each other, etc. just like we did till now.\u003C/p\u003E\u003Cp\u003EBut that also means we\u0027d have to watch an additional thread.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T12:27:37Z\u0022 title=\u002207/23/2015 12:27  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T13:28:00Z","Content":"\n\u003Cp\u003EThanks *Aqua*.\u003C/p\u003E\u003Cp\u003EI made a little headway on the reported part sizes. I managed to grab a value for the size of the craft before the tracks are attached in OnAwake(), and was hoping to use this to pass to GetModuleSize(). \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EHowever, the value gets cleared when the part is attached, presumably because an instance of the part prefab is instantiated when it\u0027s actually attached, or some some jiggery.\u003C/span\u003E (I was being an idiot) Annoyingly, if you just zero the craft size, two things happen: It won\u0027t launch because it says you need the size to be calculated, and the icon for the vessel in the load menu gets huge. This is actually quite good, as it tells me that this is governed by the reported craft size for that icon, rather than anything else.\u003C/p\u003E\u003Cp\u003EI was thinking of looking into the OnEditorAttach() method to see if I can grab a sensible pre-attach value there. but I\u0027ve not got round to it yet. The other possibility is to make our own method for determining the craft size and passing that back to GetModuleSize, after zeroing the silly value it gets from the stock method. I don\u0027t know how hard this will be, though.\u003C/p\u003E\u003Cp\u003EI think it\u0027s probably about time for a release thread, yes. Granted, it does mean monitoring two threads, but lots of stuff gets buried quite quickly here.. I guess I\u0027ll go make one!\u003C/p\u003E\u003Cp\u003EThe other thing that probably needs figuring out is whether to split the parts up into motive, structural and utility. Wheel, tracks, landing gear \u0026amp; legs and repulsors certainly live together as they share commong modules in the plugin. Rover bodies, rollcages, trailer hitches and other shenanigans I\u0027ve got planned maybe do not. I\u0027m favouring splitting in two, with the motive stuff and util/structural separate.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T14:09:19Z\u0022 title=\u002207/23/2015 02:09  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T14:13:58Z","Content":"\n\u003Cp\u003EOK, I\u0027ve got a handle on the vessel size thing. See latest commit. Needs testing to make sure it\u0027s robust (it\u0027s truly game-breaking if we get it wrong as it won\u0027t let craft launch), but at least that\u0027s something.\u003C/p\u003E\u003Cp\u003EI know that incorrect values will occur if the tracks are attached, taken off, more parts added, then placed again. Have a look and see what you think, anyway. But at least that\u0027s some kind of progress on a nasty bug :/\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T14:24:25Z","Content":"\n\u003Cp\u003EAh, so that\u0027s what the commit was about. \u003C/p\u003E\u003Cp\u003EI\u0027m currently replicating what the PartIconFixer mod does. Maybe we can use that approach to fix the reported part sizes too. But it\u0027ll take more work until I can show some results.\u003C/p\u003E\u003Cp\u003ESpliting the parts up is a good idea! Didn\u0027t Gaalidas want to write a config for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104231-1-0-x-Filter-Extensions-2-4-0-%28Jul-21%29\u0022 rel=\u0022external nofollow\u0022\u003EFilter Extentions\u003C/a\u003E? I\u0027m not sure if I remember correctly.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003ENinja\u0027d again. ^^\u003C/p\u003E\u003Cp\u003EI\u0027ll quickly have a look at the new commit.\u003C/p\u003E\u003Cp\u003EEdit 2:\u003C/p\u003E\u003Cp\u003EOk. It\u0027s a small commit and I\u0027m not sure if that\u0027s really a good approach to fix that bug. IMO we should fix the size values ASAP which would be at the end of the loading scene just after the PartLoader messed up. Everything which comes after that (editor etc.) would (hopefully) use the corrected values. That means we don\u0027t have to use the IPartSizeModifier interface.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T14:31:25Z\u0022 title=\u002207/23/2015 02:31  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T14:38:35Z","Content":"\n\u003Cp\u003EDid you find where the actual size values are stored in the part prefab? I couldn\u0027t figure that out... Lots of other things, but not that!\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T14:53:21Z","Content":"\n\u003Cp\u003EIt seems the Bounds object represents the size (get it through GetComponent() or similar). If that\u0027s true we need to replace it with a corrected one. I didn\u0027t investigate that yet but it seems likely.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EI just discovered PartIconFixer needs .Net 4.0 but our plugin and KSP use .Net 3.5. *sigh*\u003C/p\u003E\u003Cp\u003EI wonder why the mod works. It uses methods which aren\u0027t provided by Mono.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T15:08:06Z\u0022 title=\u002207/23/2015 03:08  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T15:18:56Z","Content":"\n\u003Cp\u003EActually, I\u0027ve never tried compiling it! xEvilReeperx is and evil genius, that\u0027s why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECertain things do work with later versions of .net, but not all. Hit and miss! Which IDE are you using?\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T15:23:56Z","Content":"\n\u003Cp\u003EI use Visual Studio 2012 Professional (I have a DreamSpark Premium account provided by my university).\u003C/p\u003E\u003Cp\u003EWhen I get a new computer somewhere this or the next year I\u0027ll probably switch to VS2015 (not sure which editions I\u0027ll have access to at that point).\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EOk, it wasn\u0027t difficult to replace the .Net 4.0 methods with something .Net 3.5 allows.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T15:26:06Z\u0022 title=\u002207/23/2015 03:26  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T15:46:55Z","Content":"\n\u003Cp\u003EI use VS 2012 Express.\u003C/p\u003E\u003Cp\u003EOK, I think you\u0027re onto something. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E            print(_trackSurface.GetRendererBounds());\u003Cbr\u003E            List\u0026lt;Bounds\u0026gt; bound = new List\u0026lt;Bounds\u0026gt;( part.GetRendererBounds());\u003Cbr\u003E            for(int i = 0; i \u0026lt; bound.Count(); i\u002B\u002B)\u003Cbr\u003E                print(bound[i]);\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eyields this for the medium track (in KFTrackSurface):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[LOG 16:26:06.030] Center: (-0.5, -1.3, -1.1), Extents: (3.8, 14.5, 4.6)\u003Cbr\u003E[LOG 16:26:06.030] Center: (-0.8, 9.4, 0.1), Extents: (0.3, 0.3, 0.3)\u003Cbr\u003E[LOG 16:26:06.031] Center: (-0.5, 9.4, 0.2), Extents: (0.1, 0.2, 0.2)\u003Cbr\u003E[LOG 16:26:06.032] Center: (-0.8, 10.0, 0.1), Extents: (0.3, 0.3, 0.3)\u003Cbr\u003E[LOG 16:26:06.032] Center: (-0.5, 10.0, 0.2), Extents: (0.1, 0.2, 0.2)\u003Cbr\u003E[LOG 16:26:06.039] Center: (-0.8, 10.6, 0.1), Extents: (0.3, 0.3, 0.3)\u003Cbr\u003E[LOG 16:26:06.040] Center: (-0.5, 10.6, 0.2), Extents: (0.1, 0.2, 0.2)\u003Cbr\u003E[LOG 16:26:06.041] Center: (-0.4, 10.0, 0.3), Extents: (0.1, 1.3, 0.2)\u003Cbr\u003E[LOG 16:26:06.042] Center: (-0.8, 8.9, 0.3), Extents: (0.3, 0.2, 0.2)\u003Cbr\u003E[LOG 16:26:06.042] Center: (-0.8, 11.1, 0.3), Extents: (0.3, 0.2, 0.2)\u003Cbr\u003E[LOG 16:26:06.043] Center: (-0.5, -1.3, -1.1), Extents: (3.8, 14.5, 4.6)\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBut can they actually be set? If I\u0027m reading it correctly, PartIconFixer uses calculated bounds to set some calculations up, but it doesn\u0027t actually attempt to pass the values back to the GO that got baked.\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T15:55:33Z","Content":"\n\u003Cp\u003EI\u0027m missing a \u0022SetBounds\u0022 method, too. In that case we should modify the bounds which are already there. A Bound object has a few methods for that.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T16:14:26Z","Content":"\n\u003Cp\u003EWait a minute. Think I\u0027ve got it:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://docs.unity3d.com/ScriptReference/SkinnedMeshRenderer-localBounds.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://docs.unity3d.com/ScriptReference/SkinnedMeshRenderer-localBounds.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T16:19:43Z","Content":"\n\u003Cp\u003EHow and where do you want to use that?\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T16:28:39Z","Content":"\n\u003Cp\u003EThe track surface has a component called SkinnedMeshrenderer which handles the dynamic animation of the track surface. The thing the caught my eye was \u0022\u003Cspan style=\u0022font-family:\u0027Open Sans\u0027;\u0022\u003E\u003Cspan style=\u0022color:#455463;\u0022\u003EIt is recomputed every time when \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022http://docs.unity3d.com/ScriptReference/SkinnedMeshRenderer-updateWhenOffscreen.html\u0022 rel=\u0022external nofollow\u0022\u003EupdateWhenOffscreen\u003C/a\u003E\u003Cspan style=\u0022font-family:\u0027Open Sans\u0027;\u0022\u003E\u003Cspan style=\u0022color:#455463;\u0022\u003E is enabled, but in this case it would be exactly the size of the mesh at that frame.\u0022\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027Open Sans\u0027;\u0022\u003E\u003Cspan style=\u0022color:#455463;\u0022\u003EPromising... Testing now...\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T16:38:03Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wMcZnv6.jpg\u0022 alt=\u0022wMcZnv6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhoops! Small (or rather big) mistake.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-23T16:40:38Z","Content":"\n\u003Cp\u003EGot it. I\u0027m sure KSP used to over-write the values set in Unity as I tried this before - they can be set in that component from the inspector - but doesn\u0027t seem to now. How strange. Anyway, the values are always ~10x out. We can force them in code if needed as they are setable. I think we might have a solution!\u003C/p\u003E\u003Cp\u003EEDIT: That\u0027s hilarious! Having fun?\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T17:07:29Z","Content":"\n\u003Cp\u003ENew commit is out.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/b6Ihq0e.png\u0022 alt=\u0022b6Ihq0e.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWe just need to add \u0022IconOverride {}\u0022 to all part cfgs which have that bug.\u003C/p\u003E\u003Cp\u003ELook at the code. KFPersitenceManager.FixPartIcon() might be a good place to fix the other size issue, too.\u003C/p\u003E\u003Cp\u003EEdit: The scale display is wrong. I don\u0027t know why.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T17:11:58Z\u0022 title=\u002207/23/2015 05:11  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-23T17:28:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022*Aqua*\u0022 data-cite=\u0022*Aqua*\u0022\u003E\u003Cdiv\u003ESpliting the parts up is a good idea! Didn\u0027t Gaalidas want to write a config for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104231-1-0-x-Filter-Extensions-2-4-0-%28Jul-21%29\u0022 rel=\u0022external nofollow\u0022\u003EFilter Extentions\u003C/a\u003E? I\u0027m not sure if I remember correctly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlready did. the \u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104231-1-0-x-Filter-Extensions-2-4-0-%28Jul-21%29\u0022 rel=\u0022external nofollow\u0022\u003EFilter Extentions\u003C/a\u003E\u0022 config is in the \u0022Parts\u0022 folder, and the two icons for it are in the \u0022Assets\u0022 folder. I did the research and discovered that I don\u0027t need to give the entire icon path to the config as long as KSP loads it up as a completely unique texture, which I believe that are right now. This allows us to distribute it within uor own folder without needing to supply a \u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104231-1-0-x-Filter-Extensions-2-4-0-%28Jul-21%29\u0022 rel=\u0022external nofollow\u0022\u003EFilter Extentions\u003C/a\u003E\u0022 folder in our release package. The parts themselves are categorized in the same way that KSP does that itself: by the category assignment. The category for KF will be a stand alone category (that is, not within the manufacturer category only, though it \u003Cem\u003Eis\u003C/em\u003E in there.) and will contain subcategories mimicking the stock categories. To split the parts up further, you simply need to decide what kind of part they are and set the part configs up accordingly. I am unsure if there is an easy way for me to add a completely new category, or split the parts up further than stock category assignments, but I\u0027ll look into it if required.\u003C/p\u003E\u003Cp\u003EEDITS:\u003C/p\u003E\u003Cp\u003EIcon Scales... That\u0027s promising. However, I\u0027d be curious as to how that will work alongside the icon fixer mod, if the end user has that too. Also, I\u0027m unsure if it actually fixed it, but I was pretty sure the scale visualizer was working right under PartIconFixer... can anyone confirm this? If so, it should be possible for us to fix it as well. It just seems like we are reinventing the wheel (okay, lo-fi already did that, granted) by implementing it ourselves and, considering PartIconFixer doesn\u0027t even need an entry in the part configs, it feels like a step backwards. If the two mods start to conflict, then we\u0027ll at least need to do some reflection work to make sure that the offending mod does not interfere.\u003C/p\u003E\u003Cp\u003EI\u0027m going to reiterate this as I think it got missed due to posts after my last edit... Just something to consider.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaalidas\u0022 data-cite=\u0022Gaalidas\u0022\u003E\u003Cdiv\u003EI had an idea a while back and I keep forgetting to mention it. Your rover body is pretty good (not counting the super oversized texture of course, which really needs to be resampled or something. I\u0027d hate to see it simply resized and loose details) but it\u0027s pretty limited as far as it\u0027s size. I was thinking, if it could be separated into three parts (a front part, a middle part with the cargo bay, and an end piece) then it could be made to any size needed for someone\u0027s rover needs, and different middle pieces could be made to suit different needs then. Sorta like a simplified version of the other rover bodies you were working on a while back. If the cargo bay portion lacked end pieces too, then the cargo bay could be stretched to suit the user\u0027s needs. You could even provide half-length portions and such. The great thing about all this is that since you\u0027d simply be cutting up the model you should be able to use the exact same texture for all the parts, thus reducing any need for extra texture memory consumption. I don\u0027t want to add this to the next release obviously, since we\u0027re rather close, but it would be something to add to the to-do list for afterwards. I might even tackle it myself if I ever learn how to do unity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022*Aqua*\u0022 data-cite=\u0022*Aqua*\u0022\u003E\u003Cdiv\u003EKFPersitenceManager.FixPartIcon()\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m unsure if the place for that is in the persistence manager, since that was supposed to house save and load routines, wasn\u0027t it? I\u0027d have made a new class to handle part icons.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T17:27:01Z\u0022 title=\u002207/23/2015 05:27  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-23T17:29:54Z","Content":"\n\u003Cp\u003EOh you already wrote a config for that? I didn\u0027t noticed it.\u003C/p\u003E\u003Cp\u003EI don\u0027t know if the scale works correctly in PartIconFixer. Must check that. I literally just copied the important parts of that mod. I added some checks so that only KF parts with that new node in the cfg will be fixed*. I believe it will run after PartIconFixer and overwrites what it did to KF parts. That should be no problem because both do the same.\u003C/p\u003E\u003Cp\u003E* That way we can specify which part icons will be fixed. PartIconFixer processes all parts it thinks must be fixed.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EIt must read the part cfgs and it must run at the end of the loading scene that\u0027s why I\u0027ve chosen KFPersistenceManager.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-23T17:33:08Z\u0022 title=\u002207/23/2015 05:33  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 23, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SmashBrown","CreatedById":102799,"CreatedDateTime":"2015-07-23T19:51:23Z","Content":"\n\u003Cp\u003EDoes anyone have a .cfg that they could provide me with to put the anti grav stuff into experimental motors in the ctt? Please.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-24T00:21:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022*Aqua*\u0022 data-cite=\u0022*Aqua*\u0022\u003E\u003Cdiv\u003EOh you already wrote a config for that? I didn\u0027t noticed it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not even sure \u0022wrote\u0022 is the correct way to say it. I basically copied another config and renamed a few things. I\u0027ve had it for quite some time too, just never got around to sharing.\u003C/p\u003E\n"}]}