{"TopicId":75985,"ForumId":20,"TopicTitle":"Kerbal Stuff, an open-source Space Port replacement","CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-26T03:42:09Z","PageNum":2,"Articles":[{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-06-26T19:37:49Z","Content":"\n\u003Cp\u003Enice! just set myself up. Thanks!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://beta.kerbalstuff.com/mod/16/Kerdoz_the_Great\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://beta.kerbalstuff.com/mod/16/Kerdoz_the_Great\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Eisfunke","CreatedById":113588,"CreatedDateTime":"2014-06-26T19:47:45Z","Content":"\n\u003Cp\u003ELooks really nice! Maybe kommunity will accept this better than Curse. Keep up the good work!\u003C/p\u003E\u003Cp\u003EWhere do you host this? Is it going to endure the load of the kommunity if it grows bigger?\u003C/p\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-26T19:51:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eisfunke\u0022 data-cite=\u0022Eisfunke\u0022\u003E\u003Cdiv\u003ELooks really nice! Maybe kommunity will accept this better than Curse. Keep up the good work!\u003Cp\u003EWhere do you host this? Is it going to endure the load of the kommunity if it grows bigger?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s currently hosted by Majiir, on beefy servers that can easily endure the load.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-26T20:11:52Z","Content":"\n\u003Cp\u003E@SirCmpwn: a random feature idea I just got =\u0026gt; get some kind of counters of mods popularity (main page display count, downloads, followers, others all together, maybe in a weighted average), and display the least popular mods.\u003C/p\u003E\u003Cp\u003EKind of the opposite of the former spaceport feature.\u003C/p\u003E\u003Cp\u003EWhy you may ask \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ? Because when there is thousands of mods, some may be ignored for a while and can disappear far \u0022below the ground\u0022 before someone finally dig and found them. I lost the count on how many times I\u0027ve discovered here an \u0022old mod\u0022 which is as great as hidden ! I guess I\u0027m not the only one in such situation.\u003C/p\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-26T20:14:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003E@SirCmpwn: a random feature idea I just got =\u0026gt; get some kind of counters of mods popularity (main page display count, downloads, followers, others all together, maybe in a weighted average), and display the least popular mods.\u003Cp\u003EKind of the opposite of the former spaceport feature.\u003C/p\u003E\u003Cp\u003EWhy you may ask \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ? Because when there is thousands of mods, some may be ignored for a while and can disappear far \u0022below the ground\u0022 before someone finally dig and found them. I lost the count on how many times I\u0027ve discovered here an \u0022old mod\u0022 which is as great as hidden ! I guess I\u0027m not the only one in such situation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI hope to feature cool/new mods on the front page, which would ideally get them some traction. I\u0027m not a huge fan of having a part of the site dedicated to \u0022the worst mods\u0022.\u003C/p\u003E\n"},{"CreatedByName":"tygoo7","CreatedById":57345,"CreatedDateTime":"2014-06-26T20:52:22Z","Content":"\n\u003Cp\u003EThis is really cool. I like it a lot more than Curse. Are you going to add categories like parts, plugins, engines, science, ect.? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-26T21:04:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tygoo7\u0022 data-cite=\u0022tygoo7\u0022\u003E\u003Cdiv\u003EThis is really cool. I like it a lot more than Curse. Are you going to add categories like parts, plugins, engines, science, ect.? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s planned.\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-06-26T21:37:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mishkin_007\u0022 data-cite=\u0022Mishkin_007\u0022\u003E\u003Cdiv\u003EYou rush this thing together in a few hours? Visually ugly and lacking all around.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you have any issue or suggestion for the website, go \u003Ca href=\u0022https://github.com/SirCmpwn/KerbalStuff/issues?state=open\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E and open a clear, well formed issue or design suggestion.\u003C/p\u003E\u003Cp\u003EIf you\u0027d rather be a prat instead, keep up the good work.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-26T21:40:38Z\u0022 title=\u002206/26/2014 09:40  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 26, 2014\u003C/time\u003E by sal_vager\u003C/strong\u003E\n\u003Cbr\u003ELanguage\n\u003C/span\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-26T22:18:18Z","Content":"\n\u003Cp\u003EI\u0027ve heard your feedback on the design, and I sat down with a friend of mine who does design for a living. We went over the site and I heard his suggestions, and I feel more confident about the visual direction I can take this.\u003C/p\u003E\u003Cp\u003EI\u0027ve started working on redesigning it, you can see the progress here: \u003Ca href=\u0022http://beta.kerbalstuff.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://beta.kerbalstuff.com/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2014-06-27T01:31:47Z","Content":"\n\u003Cp\u003EThis is amazing of several levels. I really hope this takes off.\u003C/p\u003E\u003Cp\u003EAnd as much as I like the little preview images behind the text, it\u0027s pretty non functional unless the images are offset to the right. Which would look pretty great if everyone did it.\u003C/p\u003E\u003Cp\u003EI also don\u0027t get why the white bar thing with the text on it slides over to the right when you mouse over the mod. Are you planning to have more text appear there?\u003C/p\u003E\u003Cp\u003EGreat work!\u003C/p\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-27T01:33:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mushroomman\u0022 data-cite=\u0022mushroomman\u0022\u003E\u003Cdiv\u003EThis is amazing of several levels. I really hope this takes off.\u003Cp\u003EAnd as much as I like the little preview images behind the text, it\u0027s pretty non functional unless the images are offset to the right. Which would look pretty great if everyone did it.\u003C/p\u003E\u003Cp\u003EI also don\u0027t get why the white bar thing with the text on it slides over to the right when you mouse over the mod. Are you planning to have more text appear there?\u003C/p\u003E\u003Cp\u003EGreat work!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe animation just adds a little extra interactivity is all. Regarding the \u0022offset to the right\u0022, I don\u0027t think it\u0027s a huge deal. People will learn about it and upload images accordingly.\u003C/p\u003E\n"},{"CreatedByName":"Keldaria","CreatedById":106284,"CreatedDateTime":"2014-06-27T01:34:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SirCmpwn\u0022 data-cite=\u0022SirCmpwn\u0022\u003E\u003Cdiv\u003EI\u0027ve heard your feedback on the design, and I sat down with a friend of mine who does design for a living. We went over the site and I heard his suggestions, and I feel more confident about the visual direction I can take this.\u003Cp\u003EI\u0027ve started working on redesigning it, you can see the progress here: \u003Ca href=\u0022http://beta.kerbalstuff.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://beta.kerbalstuff.com/\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA few thoughts, these are just my thoughts so take them as they are\u003C/p\u003E\u003Cp\u003E1: I like the redesign so far, the biggest change I like is the monochromatic background instead of a screenshot. Perhaps its just me but a busy background tends to distract from the rest of the site, especially if your putting text directly on it. If you like the style of a picture or image based background I\u0027d suggest just having it show on the edges on higher resolutions and leaving the center underlayed with a single color to avoid eyestrain.\u003C/p\u003E\u003Cp\u003E2: I like that some images from the mods can be shown in the backgrounds of the mod link on the mod selection screens so you can potentially see what you might be getting in part packs. However this also brings a possible ugly side effect as you probably need to include a way to report a mod that someone might put up with an undesirable picture, or undesirable file. Last thing you really probably want is a XXX picture posted on your front page for god knows how long because someone on the internet thought it would be funny. So an easy way to screen, moderate and remove bad content is something that needs to be considered (which maybe you already have and there is a background moderators functionality that I haven\u0027t seen.. I haven\u0027t really dug into the code so I would know).\u003C/p\u003E\u003Cp\u003E3: The sliding overlays on the mod links from the selection pages seems to be an interesting feature but entirely random in how they are currently working and deciding where the base overlay is vs where it goes when it hovers. Some mods seem to show a full overlay from the start while others start half covered. It would be interesting to see this feature expanded however so when hovering over a mod link it will expand and show a mods summary description for ease of use. (NOTE: this feature seems to have become more consistent since I started typing this post, so I assume your working on this =P )\u003C/p\u003E\u003Cp\u003E4: Pictures in the actual mod area\u0027s are good, and clicking on the image sends you to the actual image. That isn\u0027t bad, but I think it would be a nicer approach if you set them up to enlarge in some type of overlay window. Just seems odd for them to redirect to the actual image file is all. You may also think about making an image gallery tab so users can toggle to it and see what parts and or functions a mod might be making available to them. The way that its setup now is great for a handful of photos mind you but you never know when more than a few would be nice.\u003C/p\u003E\u003Cp\u003E5: Mods without images seem a little off on the selection area by appearing as a white box with text. You might try creating a generic image that gets applied if no other images are available. This image could also coordinate with a particular category of mod when those get added. It doesn\u0027t have to be anything dramatic, just something to soften the impact on those pages. \u003C/p\u003E\u003Cp\u003E6: You\u0027ve already adjusted the search bar which is great. I was confusing its submit button earlier with a button that would go to a mod submission page, so I\u0027m very happy to see the button relabel to \u0022Search\u0022 =). I would have probably still kept it in the menu bar at the top however so that it would always be accessible. \u003C/p\u003E\u003Cp\u003E7: I like the fact that your account/profile remains private and not publicly viewable until you say otherwise. Mind you I don\u0027t mind it personally if all my stuff is public, but after handling forums and websites for many clans, I do understand that some people just like privacy. The profile itself is very basic yet sufficient enough to serve its purposes, but I always tended to like simple and basic for this sort of stuff. After all, we don\u0027t need every website to be a facebook style profile setup do we?\u003C/p\u003E\u003Cp\u003E8: The profile page image appears to be the background, while not a terrible idea (I actually like it to be honest), I do feel there should be a slightly transparent overlay box for the text to be placed on for ease of reading. Case in point your profile page has areas where your background makes it harder to read what you\u0027ve wrote.\u003C/p\u003E\u003Cp\u003E9: I found a comment section on your blog section. I do feel that I should point out that if your comment system doesn\u0027t make use of your websites login system to post comments then IMO it should probably just be removed. Its just awkward signing into a website and then finding I need to sign in to a different service to comment on something at that website. \u003C/p\u003E\u003Cp\u003E----------List of Feature Suggestions -----------\u003C/p\u003E\u003Cp\u003E1: allow users to create and share mod lists independent of their follow list. I know for many games that enable mods that I like to check and see what other people are using so that I know what to look at or try. Well why not formalize this by allowing users to create, publish and even vote/rank mod lists. These list should allow both the use of hosted mods from your site and the ability of the list creator to link to off site mods. Such lists would make it infinitely easier for friends to share their favorite mod setups, Make server owners for multiplayer servers easily able to show potential joiners what they need, and would allow for newbies to easily find that amazing mod list that makes things super realistic or find what others are using. These lists should also allow search tags or possibly categories to make them easier to sort and find what your looking for.\u003C/p\u003E\u003Cp\u003E2: Its already been suggested that you expand to include ships/vessels. I think this is only a natural extension of a mod repository. You could even allow mod makers to link/post to sample ships to help users get into the mod easier. FAR for example, I found extremely hard to adjust to until I downloaded and experimented with a few ships that were made with Far in mind. It also helps everyone cure the \u0022I wanna fly Apollo 11*\u0022 flu that I\u0027m sure we all get from time to time (* replace apollo 11 with whatever ship you always wanted to play with). Ship creators could also link to mod list (if you set that up) so that users will know which mods are needed for the ship to work.\u003C/p\u003E\u003Cp\u003E3: Comment system on mod page, it would be nice to have a limited comment system for mod pages. This should be limited, probably twitter style (140 characters) to keep the comments short and sweet and not promote forum style conversations. You goal should be to create a service that compliments the KSP forums and not something that tries to compete (which I\u0027m sure you would agree with). \u003C/p\u003E\u003Cp\u003EThank you for taking your time to look over my feedback, feel free to use or ignore it as you wish, I understand that its simply not possible to please everyone all the time so I take no offense if things get ignored or if you / others disagree with my opinions =)\u003C/p\u003E\u003Cp\u003ENice work so far, I\u0027m really feeling like its coming together. Let me know if I can be of any further assistance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-27T01:39:30Z\u0022 title=\u002206/27/2014 01:39  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 27, 2014\u003C/time\u003E by Keldaria\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-27T01:49:11Z","Content":"\n\u003Cp\u003EThanks for the detailed feedback! I\u0027ll see if I can respond to all of it.\u003C/p\u003E\u003Cp\u003E1: Do you like the background now? I think I\u0027ve settled on this one.\u003C/p\u003E\u003Cp\u003E2: Admins are able to edit/delete mods as if they were the owners of the mods. If this is abused, I might change it. There is partial support for requiring modders to have their first couple of mods manually approved, I might turn that on if need be.\u003C/p\u003E\u003Cp\u003E3: This should be consistent now.\u003C/p\u003E\u003Cp\u003E4: I kind of like how it behaves now. Nice and simple, no BS.\u003C/p\u003E\u003Cp\u003E5: I agree, but I\u0027ll sort this out later.\u003C/p\u003E\u003Cp\u003E6: The navigation bar is pretty much going away, so I don\u0027t think this is entirely relevant any more.\u003C/p\u003E\u003Cp\u003E7: The minimalism is indeed something I wanted. The reasoning behind allowing private profiles is so that users could use the site to subscribe to mods and such without showing up publicly.\u003C/p\u003E\u003Cp\u003E8: This is totally broken as a side effect of the redesign, I\u0027ll fix it soon.\u003C/p\u003E\u003Cp\u003E9: You can leave comments anonymously or with just a name. This was just an easy way to get comments for blog posts. Might change it at some point.\u003C/p\u003E\u003Cp\u003EFeature suggestions:\u003C/p\u003E\u003Cp\u003E1: I think this would be a good application for a third party site to build\u003C/p\u003E\u003Cp\u003E2: Still unsure about that, but I am considering it. It seems like many modders are against it and they\u0027re the most important ones to please.\u003C/p\u003E\u003Cp\u003E3: No, comments are intentionally left out.\u003C/p\u003E\n"},{"CreatedByName":"Keldaria","CreatedById":106284,"CreatedDateTime":"2014-06-27T02:23:53Z","Content":"\n\u003Cp\u003E1: Background is good, slightly textured but it doesn\u0027t take away from the rest of the site. Just need to make sure it doesn\u0027t blend with any of the text making it hard to read. I know you\u0027ll ensure that part later so I\u0027m not to concerned atm if a few area\u0027s have a part or 2 thats hard to read like the stuff formally in the banner... mind you its not that bad but you understand what I mean.\u003C/p\u003E\u003Cp\u003E2: good to hear, if you can\u0027t trust admins then I\u0027m not sure why they would be admins anyways. \u003C/p\u003E\u003Cp\u003E3: looks good\u003C/p\u003E\u003Cp\u003E4: if that\u0027s what you like that\u0027s fine, I just felt it might look like a more polished site if clicking on images would blow them up in the window instead of taking to the image file, just a personal preference I think.\u003C/p\u003E\u003Cp\u003E5: noted, I figured you\u0027d be sorting a number of the items I mentioned out later anyways. \u003C/p\u003E\u003Cp\u003E6: Hmm, not necessarily a choice I would have made, but I always find it difficult to make a website properly function without some sort of common menu bar. I\u0027ve seen some websites operate pretty well with a minimalist style and functionality, but I just have never been able to make one work well myself, so my opinions here should be taken with a grain of salt I suppose. I guess we both have slightly different opinions on what a community repository should be, I always figured something more robust and more inclusive would be nice, focused on 1 or 2 specifics no doubt but built up with features that compliment those core functions. You seem to be more focused on just the task at hand, not a bad thing, just different strokes and all that jazz =).\u003C/p\u003E\u003Cp\u003E7: Minimalist style is something I enjoy too, and when it makes sense, minimalist features to keep the site from getting its true identity confused. Profiles are an excellent example of where sites can go overboard, Vbulletin 4 IMO really went overboard when they almost created a facebook style profile setup for members. \u003C/p\u003E\u003Cp\u003E8: Construction dust is just part of the process.\u003C/p\u003E\u003Cp\u003E9: It appears to require that you register with Disquis or signin with one of their SSO plugin accounts. However maybe my browser is borked.. not too concerned tho, as I said, I just think the feature should ether be scrapped or merged under your login system if you want to keep it, as I don\u0027t like sites with features that are schizophrenic when it comes to using a login. Mind you its not a big or key feature here so this might not be a big deal to most.\u003C/p\u003E\u003Cp\u003EFeature Suggestions\u003C/p\u003E\u003Cp\u003E1: That\u0027s fine, I just felt it was a natural extension of a mod repository as you would already theoretically have a fair share of the mods being hosted there and it would be convenient for users to just make a list by just selecting which mods they want to add to it.\u003C/p\u003E\u003Cp\u003E2: Not sure why the modders would be/are against it. However I\u0027ll take your word on it. Just seems again like a natural compliment to a mod repository. Ship files typically make mods they use more popular as they might otherwise not get downloaded, so I thought it would have been the opposite. I\u0027m still somewhat new around here tho, so what do I know =P.\u003C/p\u003E\u003Cp\u003E3: fair enough, they weren\u0027t needed and to some extent would have created additional moderator work if they were to be monitored. So I can see why they would be left out.\u003C/p\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-27T03:48:50Z","Content":"\n\u003Cp\u003ERedesigned the mod listing page: \u003Ca href=\u0022http://beta.kerbalstuff.com/mod/16\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://beta.kerbalstuff.com/mod/16\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2014-06-28T02:18:51Z","Content":"\n\u003Cp\u003EMy two cents on the new design:\u003C/p\u003E\u003Cp\u003ENice work! The background fits in way better now. Just one thing: could you add the white bar back at the top, where the Kerbal Stuff logo is?\u003C/p\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-28T02:19:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FCISuperGuy\u0022 data-cite=\u0022FCISuperGuy\u0022\u003E\u003Cdiv\u003EMy two cents on the new design:\u003Cp\u003ENice work! The background fits in way better now. Just one thing: could you add the white bar back at the top, where the Kerbal Stuff logo is?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I will probably add that back in (but not immediately).\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-06-28T02:45:14Z","Content":"\n\u003Cp\u003EI registered before it went open beta will my account still be there or I have to register again I tried the forgot password link but generated the following error\u003C/p\u003E\u003Cp\u003ENot Found\u003C/p\u003E\u003Cp\u003EThe requested URL was not found on the server. If you entered the URL manually please check your spelling and try again.\u003C/p\u003E\u003Cp\u003ERowsdower said he would publish any news on a new community site so I will PM him\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T02:49:53Z\u0022 title=\u002206/28/2014 02:49  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by Virtualgenius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-28T02:46:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Virtualgenius\u0022 data-cite=\u0022Virtualgenius\u0022\u003E\u003Cdiv\u003EI registered before it went open beta will my account still be there or I have to register again I tried the forgot password link but generated the following error\u003Cp\u003ENot Found\u003C/p\u003E\u003Cp\u003EThe requested URL was not found on the server. If you entered the URL manually please check your spelling and try again.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou will have to register again, there was a database wipe. Thanks for reminding me to implement the forgotten password page, though (whoops).\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-06-28T02:51:02Z","Content":"\n\u003Cp\u003EMy pleasure always happy to help out as i would really love to see this take off, I have re-registered worked perfectly\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T02:56:34Z\u0022 title=\u002206/28/2014 02:56  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by Virtualgenius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-28T07:25:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SirCmpwn\u0022 data-cite=\u0022SirCmpwn\u0022\u003E\u003Cdiv\u003EI hope to feature cool/new mods on the front page, which would ideally get them some traction. I\u0027m not a huge fan of having a part of the site dedicated to \u0022the worst mods\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuite a late reply, the idea was not to \u0022promote\u0022 worst mods but to avoid mods people don\u0027t know too much to disappear deep inside mods catalog.\u003C/p\u003E\u003Cp\u003ESome example of good stuffes: SurfaceLights which add lights similar to KSPX abandonned lights, or the WIP/unfinished DoPToOT Aerospace, both are good, but how many people are still aware of them ?\u003C/p\u003E\n"},{"CreatedByName":"Thesonicgalaxy","CreatedById":71406,"CreatedDateTime":"2014-06-28T08:16:26Z","Content":"\n\u003Cp\u003EI already LOVE the idea of this, and I\u0027m loving the site. However, I encountered this and wasn\u0027t able to upload my mod.\u003C/p\u003E\u003Cp\u003E\u0022\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003ENot Found\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe requested URL was not found on the server. If you entered the URL manually please check your spelling and try again.\u0022\u003C/p\u003E\u003Cp\u003EI\u0027ll try again in the morning. See if it works then. I am still loving this way more than curse though.\u003C/p\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-28T08:19:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thesonicgalaxy\u0022 data-cite=\u0022Thesonicgalaxy\u0022\u003E\u003Cdiv\u003EI already LOVE the idea of this, and I\u0027m loving the site. However, I encountered this and wasn\u0027t able to upload my mod.\u003Cp\u003E\u0022\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003ENot Found\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe requested URL was not found on the server. If you entered the URL manually please check your spelling and try again.\u0022\u003C/p\u003E\u003Cp\u003EI\u0027ll try again in the morning. See if it works then. I am still loving this way more than curse though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat URL is in your address bar, and at what point did this error occur? I saw someone hit a 404 on \u0022/create\u0022, which is the old URL. It\u0027s now \u0022\u003Ca href=\u0022http://beta.kerbalstuff.com/create/mod\u0022 rel=\u0022external nofollow\u0022\u003E/create/mod\u003C/a\u003E\u0022, but the old URL isn\u0027t mentioned anywhere on the site.\u003C/p\u003E\n"},{"CreatedByName":"Thesonicgalaxy","CreatedById":71406,"CreatedDateTime":"2014-06-28T08:28:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SirCmpwn\u0022 data-cite=\u0022SirCmpwn\u0022\u003E\u003Cdiv\u003EWhat URL is in your address bar, and at what point did this error occur? I saw someone hit a 404 on \u0022/create\u0022, which is the old URL. It\u0027s now \u0022\u003Ca href=\u0022http://beta.kerbalstuff.com/create/mod\u0022 rel=\u0022external nofollow\u0022\u003E/create/mod\u003C/a\u003E\u0022, but the old URL isn\u0027t mentioned anywhere on the site.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt happens as I\u0027m uploading my mod, after a while it takes me there and /create/mod is in the address bar.\u003C/p\u003E\n"},{"CreatedByName":"SirCmpwn","CreatedById":112036,"CreatedDateTime":"2014-06-28T08:31:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thesonicgalaxy\u0022 data-cite=\u0022Thesonicgalaxy\u0022\u003E\u003Cdiv\u003EIt happens as I\u0027m uploading my mod, after a while it takes me there and /create/mod is in the address bar.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, I see, you hit a somewhat obscure edge case there. You must make your profile public before you can create a mod. Sorry about that, you can do it on \u003Ca href=\u0022http://beta.kerbalstuff.com/profile\u0022 rel=\u0022external nofollow\u0022\u003Eyour profile page\u003C/a\u003E.\u003C/p\u003E\n"}]}