{"TopicId":76017,"ForumId":20,"TopicTitle":"How do I get mods onto the game?","CreatedByName":"JackKerbin","CreatedById":113735,"CreatedDateTime":"2014-06-26T15:47:38Z","PageNum":1,"Articles":[{"CreatedByName":"JackKerbin","CreatedById":113735,"CreatedDateTime":"2014-06-26T15:47:38Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EApologies if this is the wrong place to ask this. I\u0027ve had the demo version of KSP for quite a while and have only recently upgraded to the full version. I was looking at mods on here, and downloaded Mechjeb, but it hasn\u0027t seemed to have had any effect on the game.\u003C/p\u003E\u003Cp\u003EFor context, I\u0027m playing on a Macbook Pro, with the game bought off Steam. The mods I\u0027ve bought have been downloaded and unzipped and are currently sitting in my Downloads folder. I can seem to find a file of KSP, just an application icon.\u003C/p\u003E\u003Cp\u003EI\u0027m sure there\u0027s a very easy solution to this but I\u0027ve had a look around on here all day and haven\u0027t been able to find one yet!\u003C/p\u003E\n"},{"CreatedByName":"Keldaria","CreatedById":106284,"CreatedDateTime":"2014-06-26T20:02:43Z","Content":"\n\u003Cp\u003EFirst let me preface this with the fact that, I don\u0027t have a mac, I don\u0027t use a mac, and I\u0027m not sure how accurate this will be for you.\u003C/p\u003E\u003Cp\u003EHowever first you\u0027ll need to locate where your KSP install is, according to the web searches it should be something like\u003C/p\u003E\u003Cp\u003E~/Library/Application Support/Steam/steamapps/STEAMUSERNAME/Kerbal Space Program/\u003C/p\u003E\u003Cp\u003Eor\u003C/p\u003E\u003Cp\u003E~/Library/Application Support/Steam/steamapps/common/Kerbal Space Program/\u003C/p\u003E\u003Cp\u003EWhen you install it, you should get a popup on steam telling you exactly where your installing the game to, so for example you could install another game and see which folder that your basic installs are going to and proceed from there\u003C/p\u003E\u003Cp\u003ENext you need to drop the MechJeb folder into the Gamedata folder within your KSP install folder. Please verify what is inside your mod folder before moving it. If it contains a GameData folder inside, then you need to drop the contents of that into the gamedata folder, as its been packaged differently. Some Mods have folders that get dropped into Subassembles , Ships, or other folders just keep this in mind and make sure they all get to the correct spots. (I know this sounds confusing but trust me its pretty simple, just look at what folders are in the mod root folder and you should be able to figure out what goes where)\u003C/p\u003E\u003Cp\u003ENow for MechJeb, the features may not be apparent on load, any current vessels you have on a saved game won\u0027t have anything different. You can however build new vessels that use the MechJeb features, simple start with the MechJeb Probe Capsule, or add a mechjeb control box (under the controls tab with RCS thrusters \u0026amp; Control Wheels) to your ship somewhere and you will see a tab pop up on the right in the build menu. The tab when clicked will give you the windows you select. Please note there are even more windows available when flying a ship MechJeb equiped, so check it out there too.\u003C/p\u003E\u003Cp\u003EI hope this was helpful. Please note this might not be 100% accurate for you because, I don\u0027t use macs.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-06-26T20:10:12Z","Content":"\n\u003Cp\u003EOne thing to note: with Macs, its apparently pretty easy to replace contents instead of merging them. Be sure to keep a backup of the Squad and NASAmission in case things go wrong.\u003C/p\u003E\n"},{"CreatedByName":"JackKerbin","CreatedById":113735,"CreatedDateTime":"2014-06-26T22:33:05Z","Content":"\n\u003Cp\u003EThank you very much to both of you... after a bit of working I\u0027ve gotten to the file! I knew I\u0027d need to add the mods to a file, I just didn\u0027t know which file and where to find it!\u003C/p\u003E\n"}]}