{"TopicId":76021,"ForumId":44,"TopicTitle":"Big Dumb Boosters- and why we\u0026#039;re overthinking this whole rocketry business","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-06-26T16:45:05Z","PageNum":4,"Articles":[{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-08-22T23:10:55Z","Content":"\n\u003Cp\u003EActually, it is often used for a pressure-fed stage. But that\u0027s beside the point. Single stage, expandable rockets with high safety margins and (comparatively) low payloads are the original meaning, and that\u0027s a viable approach. Say, two or three engines, made cheaply (by sacrificing efficiency, not reliability), topped by a single, thick-walled tank and a small, solid kick stage. What you get is nearly-SSTO rocket that leaves few debris, uses cheap technology (small solids are cheap) and doesn\u0027t cost much. Or just cut the liquid stage altogether and slap a large, dual-nozzle SRB (so that roll control isn\u0027t a problem) and a small one together, add fairings and \u003Cem\u003Evoila! \u003C/em\u003EIt would likely be even cheaper than anything liquid, SRBs are rather inexpensive.\u003C/p\u003E\u003Cp\u003EThere is a trend towards things like this. All-solid rockets are the mainstay of American small LV market, so it\u0027s just a matter of reducing staging equipment and number of boosters. I think it\u0027s just a matter of time before somebody figures out that strapping a Star-48 atop a modified 4-segment RSRM might be a good idea (you can even re-use the RSRM afterwards). It won\u0027t carry much, but it could rather cheap.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-08-22T23:24:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003EI think, that you should make that comparison, between a mass produced Big Dumb Booster and a mass produced \u0022super-heavy smart booster\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think I ever addressed this point, by the way.\u003C/p\u003E\u003Cp\u003EThe whole point behind an Aquarius-style Big Dumb Booster (as opposed to a Space Dragon-style BDB, which is entirely different) is that you end up mass-producing the rockets for the CURRENT payload-to-orbit being sent up each year, TODAY AND NOW, rather than needing to increase the annual launch mass (a difficult and expensive proposition) in order to reap the benefits of mass production.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELet\u0027s make up some numbers:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETake the fact that an Aquarius is projected to launch 1 ton to orbit per launch.\u003C/p\u003E\u003Cp\u003ECompare that to a Smart Booster that might launch say, 12 tons to orbit per launch (there are actual Smart Boosters in this size range)\u003C/p\u003E\u003Cp\u003ELet\u0027s say that you need to launch 24 tons of low-value consumables to orbit a year. This figure isn\u0027t *too far* from the real one: the ISS requires approx. 9.07 metric tons of consumables a year according to a Lockheed Martin article on ISS consumables. Other consumables include station-keeping fuel for fresh satellite launches (you launch the satellite empty on a Smart Booster, and rendezvous with the Aquarius, the Aquarius fuel-depot, or Aquarius tug, in LEO to transfer over the station-keeping fuel), consumables for other space stations, etc...\u003C/p\u003E\u003Cp\u003ETo launch that with Aquarius-style BDB\u0027s, you would need to build 36 rockets a year (3 rockets a month, with a 33% failure rate)- reaping some of the benefits of mass production, as well as reduced ground infrastructure costs (which tend to decrease *SHARPLY* with increasing launch frequency) etc.\u003C/p\u003E\u003Cp\u003ETo launch that with a 12-ton Smart Booster, you would launch just over 2 rockets per year (with a *very low* failure rate). That leaves your launchpad and production facilities idle most of the year, and drastically drives up the cost of getting these low-value consumables to orbit.\u003C/p\u003E\u003Cp\u003EEven with a *much lower* estimate of annual low-value consumables launches of just 12 tons (assuming the vast majority of satellites launch with their station-keeping fuel onboard rather then going for the cheaper option of utilizing Aquarius\u0027 orbital consumables-depot system for this purpose, and 75% of all Aquarius payloads utlimately go to the ISS), you still have 18 launches a year vs. just 1 Smart Booster launch a year to orbit this same quantity of supplies.\u003C/p\u003E\u003Cp\u003EThe economic benefits of an Aquarius-style Big Dumb Booster should be *OBVIOUS*.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E Please remember that Aquarius\u0027 $700 million development budget also included the costs for developing AND launching (atop a separate Smart Booster) a LEO \u0022consumables-depot\u0022 where Aquarius launches would accumulate needed consumables ahead-of-need, as well as a small reusable chemical-propelled (non-nuclear) \u0022orbital tug\u0022 to move these supplies (in larger increments of maybe 10 or 12 tons at a time- each Aquairus only launches 1 ton at a time) from the depot to the ISS and other destinations as-needed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-22T23:36:52Z\u0022 title=\u002208/22/2014 11:36  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 22, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-08-23T00:14:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELet\u0027s say that you need to launch 24 tons of low-value consumables to orbit a year. This figure isn\u0027t *too far* from the real one: the ISS requires approx. 9.07 metric tons of consumables a year according to a Lockheed Martin article on ISS consumables. Other consumables include station-keeping fuel for fresh satellite launches (you launch the satellite empty on a Smart Booster, and rendezvous with the Aquarius, the Aquarius fuel-depot, or Aquarius tug, in LEO to transfer over the station-keeping fuel), consumables for other space stations, etc...\u003C/p\u003E\u003Cp\u003ETo launch that with Aquarius-style BDB\u0027s, you would need to build 36 rockets a year (3 rockets a month, with a 33% failure rate)- reaping some of the benefits of mass production, as well as reduced ground infrastructure costs (which tend to decrease *SHARPLY* with increasing launch frequency) etc.\u003C/p\u003E\u003Cp\u003ETo launch that with a 12-ton Smart Booster, you would launch just over 2 rockets per year (with a *very low* failure rate). That leaves your launchpad and production facilities idle most of the year, and drastically drives up the cost of getting these low-value consumables to orbit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E In reality, the rocket responsible for sending most supplies to the ISS flies about 16 times a year; because it can do the kind of missions aquarius isn\u0027t capable of doing; crewed and high-energy ones. Aquarius is restricted to a tiny portion of the actual demand: economies of scale will work against it, not with it.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-12-09T07:41:43Z","Content":"\n\u003Cp\u003ENot to necro this thread, but this is still an interesting topic worth discussing...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EIn reality, the rocket responsible for sending most supplies to the ISS flies about 16 times a year; because it can do the kind of missions aquarius isn\u0027t capable of doing; crewed and high-energy ones. Aquarius is restricted to a tiny portion of the actual demand: economies of scale will work against it, not with it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, and that\u0027s not right at all. Aquarius benefits from economies of scale by having incredibly low payload-capacity (only 1 metric ton per launch). Thus, even with the limited portion of demand it is restricted to (payloads with low intrinsic value- such as ISS consumables and fuel for missions beyond LEO), it still can be mass-produced (it would take 60-100 launches a year just for ISS consumables). \u003C/p\u003E\u003Cp\u003EOf course, it\u0027s not the only game in town for low-cost launches relying on mass-production and low payload-capacities. There is also the Microwave Beamed Power approach being developed by Escape Dynamics, for instance, which can easily be scaled-up for manned missions:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://nextbigfuture.com/2014/02/escape-dynamics-and-microwave-power.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://nextbigfuture.com/2014/02/escape-dynamics-and-microwave-power.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUltimately, only one low-cost launch system can succeed. Big Dumb Boosters. Microwave Beamed Power spaceplanes (the much higher ISP makes spaceplanes much more feasible). Conventional spaceplanes. \u003Ca href=\u0022https://en.wikipedia.org/wiki/StarTram\u0022 rel=\u0022external nofollow\u0022\u003EStarTram\u003C/a\u003E-style mangetic launch-assist. I just hope ONE of them makes it to operation in the next 20-30 years...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-12-09T08:09:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003ENot to necro this thread, but this is still an interesting topic worth discussing...\u003Cp\u003EOh, and that\u0027s not right at all. Aquarius benefits from economies of scale by having incredibly low payload-capacity (only 1 metric ton per launch). Thus, even with the limited portion of demand it is restricted to (payloads with low intrinsic value- such as ISS consumables and fuel for missions beyond LEO), it still can be mass-produced (it would take 60-100 launches a year just for ISS consumables). \u003C/p\u003E\u003Cp\u003EOf course, it\u0027s not the only game in town for low-cost launches relying on mass-production and low payload-capacities. There is also the Microwave Beamed Power approach being developed by Escape Dynamics, for instance, which can easily be scaled-up for manned missions:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://nextbigfuture.com/2014/02/escape-dynamics-and-microwave-power.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://nextbigfuture.com/2014/02/escape-dynamics-and-microwave-power.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUltimately, only one low-cost launch system can succeed. Big Dumb Boosters. Microwave Beamed Power spaceplanes (the much higher ISP makes spaceplanes much more feasible). Conventional spaceplanes. \u003Ca href=\u0022https://en.wikipedia.org/wiki/StarTram\u0022 rel=\u0022external nofollow\u0022\u003EStarTram\u003C/a\u003E-style mangetic launch-assist. I just hope ONE of them makes it to operation in the next 20-30 years...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAn downside with one ton to LEO is that you would need to dock with IIS so you will need an functional spacecraft capable of doing this, it will cut into your useful payload a lot. \u003C/p\u003E\u003Cp\u003EAdd the extra work docking all the small crafts. \u003C/p\u003E\u003Cp\u003EAlso an decent chance the stuff sent up is an mix between life support and stuff needed for experiments, some who are not cheap or easy to replace. \u003C/p\u003E\u003Cp\u003ELaunching smaller mass produced satellites irdium or gps might work better for an small launcher, they need specific orbits so you only launch that small payload.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-12-09T08:18:13Z","Content":"\n\u003Cp\u003EHmm... Elon Munsk\u0027s description of BDBs makes me think they would be good for orbital refueling.\u003C/p\u003E\u003Cp\u003ESend up a pressure fed stage, dock it with pressure left in the tanks. Pump the excess out to refuel better rockets, and repurpose the tanks as orbital consruction materials. Let anything you dont need decay into earth\u0027s atmo.\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-12-09T14:07:05Z","Content":"\n\u003Cp\u003EWell, as I see it: if the Big Dumb Booster concept made economic sense, people would be making BDBs. People aren\u0027t making BDBs. Therefore, BDBs don\u0027t make economic sense.\u003C/p\u003E\u003Cp\u003EPart of it I suspect is the tyranny of the rocket equation: a heavy upper stage means a heavier lower stage. It makes a large amount of economic sense to optimize your upper stages. You could apply the BDB concept solely to the first stage, but that means development costs are going into a concept only used for one part of the rocket.\u003C/p\u003E\n"},{"CreatedByName":"Fuzzy Dunlop","CreatedById":27329,"CreatedDateTime":"2014-12-09T20:15:54Z","Content":"\n\u003Cp\u003EI think part of the problem is that while dumb \u003Cem\u003Ecan\u003C/em\u003E mean \u0022cheap\u0022 \u003Cem\u003Ebig\u003C/em\u003E often means \u0022much more expensive than first thought\u0022. It\u0027s the infrastructure cost as much as anything. I doubt Sea Dragon was meant to launch from the ocean right from the initial inception, but once on the drawing board it grew so huge that there was no economic way to handle it on land.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-12-10T23:07:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starman4308\u0022 data-cite=\u0022Starman4308\u0022\u003E\u003Cdiv\u003EWell, as I see it: if the Big Dumb Booster concept made economic sense, people would be making BDBs. People aren\u0027t making BDBs. Therefore, BDBs don\u0027t make economic sense.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dunno - there have really not been that many orbital launch vehicles, and most of those come from really just 2-3 \u0022traditions\u0022. There\u0027s plenty of room for cultural biases and historical contingencies to exclude plenty of viable options in a world that small (e.g. the SLS is being built the way it is to use Shuttle heritage, despite the fact that the reasons the Shuttle was designed the way it was don\u0027t apply to SLS at all).\u003C/p\u003E\u003Cp\u003ENew LV makers like SpaceX and India may be starting to change this, but the barrier to entry is so high that we\u0027re very far from exploring all viable options.\u003C/p\u003E\u003Cp\u003E(And I think there \u003Cem\u003Eis\u003C/em\u003E a strong cultural bias that space stuff is necessarily super-high-standards, super-expensive. Cubesats and SpaceX\u0027s vertical integration may be beginning to change this, too, but that will be a long process if it ever happens.)\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-12-10T23:38:04Z","Content":"\n\u003Cp\u003EI think that the BDB concept would have been brilliant for quite a long time. However reusable rockets may change that in the future.\u003C/p\u003E\u003Cp\u003EI hate the concept of throwing parts of the vehicle away. However carefully designing it with the most high tech stuff possible, and then throwing it away is an even worse way of dong things. BDBs could save a lot of money while doing the same job. Sure it would take more fuel but that is a tiny part of the overall cost.\u003C/p\u003E\u003Cp\u003EBDBs vs re usable rockets is something else though. Being able to reuse them may save more than even a very simple expendable rocket.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-12-11T15:35:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022YNM\u0022 data-cite=\u0022YNM\u0022\u003E\u003Cdiv\u003EVery kerbal design IMO... but that\u0027s a really modular concept !\u003Cp\u003ENow, who\u0027s going to launch Apollo-style Mun mission with just a bunches of \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/S1_SRB-KD25k\u0022 rel=\u0022external nofollow\u0022\u003ES1 SRB-KD25k\u003C/a\u003E for launching it into Kerbin orbit ? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, now we have costs in career mode that is exactly how I launch most of my craft. Unless I am going for historical accuracy.\u003C/p\u003E\u003Cp\u003EI have a bunch of the largest SRB, a few of the medium and some small ones as the three lifter stages and I tailor the thrust and fuel to get a pretty good orbit so that the last stage burns up and the payload needs minimal fuel to attain orbit.\u003C/p\u003E\u003Cp\u003EIt\u0060s really cheap.\u003C/p\u003E\u003Cp\u003EAs far as I know, in RL an SRB is as reliable as any other rocket type. They are human rated anyway.\u003C/p\u003E\u003Cp\u003EEDIT :\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EHmm... Elon Munsk\u0027s description of BDBs makes me think they would be good for orbital refueling.\u003Cp\u003ESend up a pressure fed stage, dock it with pressure left in the tanks. Pump the excess out to refuel better rockets, and repurpose the tanks as orbital consruction materials. Let anything you dont need decay into earth\u0027s atmo.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI made a station guide using almost exactly that concept, although I had not heard it until now. You send up a lot of large SSTO which act as your fuel store and they form a station which is a utility base for future missions. Some craft use karbonite for easier gamepley in KSP but most craft are stock and one acts like a refueller.\u003C/p\u003E\u003Cp\u003EIt\u0060s here if anyone would like a look.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/97475-Standard-Utility-Construction-Kit\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/97475-Standard-Utility-Construction-Kit\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-11T15:40:52Z\u0022 title=\u002212/11/2014 03:40  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 11, 2014\u003C/time\u003E by John FX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-01-18T02:20:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EActually, now we have costs in career mode that is exactly how I launch most of my craft. Unless I am going for historical accuracy.\u003Cp\u003EI have a bunch of the largest SRB, a few of the medium and some small ones as the three lifter stages and I tailor the thrust and fuel to get a pretty good orbit so that the last stage burns up and the payload needs minimal fuel to attain orbit.\u003C/p\u003E\u003Cp\u003EIt\u0060s really cheap.\u003C/p\u003E\u003Cp\u003EAs far as I know, in RL an SRB is as reliable as any other rocket type. They are human rated anyway.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn KSP, SRB-based lifters are much cheaper than liquid rockets, but still not nearly as cheap as a Space-X style launch using liquid rockets. There is no way to built rockets to looser engineering standards, and accept the necessary hit in payload fraction that entails, opting for just building it bigger instead (\u003Cstrong\u003Ewhich is the entire principle behind a Big Dumb Booster\u003C/strong\u003E- i.e. that a rocket with 1/3rd the payload-fraction due to looser engineering standards might cost a lot less than 3 times a much per ton of rocket0 and can thus be built bigger/heavier instead...)\u003C/p\u003E\u003Cp\u003EWhat I\u0027d REALLY like to see is a realistic and tweakable relationship between part mass and cost in Procedural Parts mod (so I can use much heavier parts with much lower cost to approximate the Big Dumb Booster concept...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E The parts in a Big Dumb Booster aren\u0027t *necessarily* heavier in real life- but instead are built to a much wider tolerance of masses and strengths. If a part could be as much as \u002B/- 10% the designed strength, then you need to design it with 10% extra strength in case it ends up on the weaker end, for instance. With the Rocket Equation, even such small extra tolerances rapidly add up into greatly-diminished payload-fraction (but at the benefit of much lower cost-per-kg).\u003C/p\u003E\u003Cp\u003EAlternatively, you can go the way of Aquarius and combine the extra mass/strength variance with slim engineering margins for a high failure rate overall (as much as 1 in 3 for the Aquarius rocket). But that\u0027s not really a Big Dumb Booster in the truest sense of the word- as it is not necessarily any larger than a comparable-capacity \u0022Smart Booster\u0022, only dumber to bring down costs...\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-01-18T03:14:28Z","Content":"\n\u003Cp\u003EI think that if there were bigger margins on launch vehicles, then they could be made cheaper. For example, if everything is running less than its full potential, and one engine fails, you can proportionally increase the thrust of the others to help account for that.\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2015-01-18T04:42:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EHmm... Elon Munsk\u0027s description of BDBs makes me think they would be good for orbital refueling.\u003Cp\u003ESend up a pressure fed stage, dock it with pressure left in the tanks. Pump the excess out to refuel better rockets, and repurpose the tanks as orbital consruction materials. Let anything you dont need decay into earth\u0027s atmo.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dunno about this whole BDB aproach to refueling.\u003C/p\u003E\u003Cp\u003EI mean, there\u0027s asteroids (And Deimos and Phobos) up there with water ice already. Might as well use Kuck mosquitos to refuel your depot. \u003C/p\u003E\u003Cp\u003E(You\u0027ll need a chemical plant to synthesize hydrogen peroxide for propellant, of course. Plus enough power for that and to electrolyze the ice.)\u003C/p\u003E\u003Cp\u003EInitial cost\u0027ll be steep, though. At least three superheavy launches I think, one for the Mosquito, one for the chemical plant\u002Bsolar panels, and one big dumb tank for an ice depot. After that, though, it practically pays for itself.\u003C/p\u003E\n"},{"CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-01-22T05:32:32Z","Content":"\n\u003Cp\u003EThe NASA developed Morpheus lander now makes easy suborbital spaceflight since NASA has opened up NASA developed technology to commercial licensing:\u003C/p\u003E\u003Cp\u003ENASA Technology Transfer for suborbital and air-launched orbital launchers.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EI don\u0027t think NASA fully appreciates the usefulness of the Morpheus development. Here I\u0027ll show how the Morpheus itself can be used to produce suborbital launchers, and also the stages for orbital launchers. For instance the Morpheus can be used to provide the solution to DARPA\u0027s ALASA air launched, small orbital system.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://exoscientist.blogspot.com/2015/01/nasa-technology-transfer-for-suborbital.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://exoscientist.blogspot.com/2015/01/nasa-technology-transfer-for-suborbital.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T04:31:32Z\u0022 title=\u002201/24/2015 04:31  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by Exoscientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-01-22T09:50:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exoscientist\u0022 data-cite=\u0022Exoscientist\u0022\u003E\u003Cdiv\u003EThe NASA developed Morpheus lander now makes easy suborbital spaceflight since NASA has opened up NASA developed technology to commercial licensing:\u003Cp\u003ENASA Technology Transfer for suborbital and air-launched orbital launchers.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EI don\u0027t think NASA fully appreciates the usefulness of the Morpheus development. Here I\u0027ll show how the Morpheus itself can be used to produce suborbital launchers, and also the stages for orbital launchers. For instance the Morpheus can be used to provide the solution to DARPA\u0027s ALASA air launched, small orbital system.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://exoscientist.blogspot.com/2015/01/nasa-technology-transfer-for-suborbital.html%C3%83%C2%AF%C3%82%C2%BB%C3%82%C2%BF\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://exoscientist.blogspot.com/2015/01/nasa-technology-transfer-for-suborbital.htmlÃ¯Â»Â¿\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat blog post has been removed. But what has Morpheus got to do with Big Dumb Boosters ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-22T09:55:29Z\u0022 title=\u002201/22/2015 09:55  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 22, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Louella","CreatedById":89561,"CreatedDateTime":"2015-01-22T18:39:22Z","Content":"\n\u003Cp\u003EI think large, simple rockets have a role to play in space, but the requirement for that role has not as yet arisen.\u003C/p\u003E\u003Cp\u003Ethey make sense for large, cheap payloads, with losses being acceptable.\u003C/p\u003E\u003Cp\u003EThis makes them suitable for doing several things, such as for supply missions for colonisation of Mars. Not for Mars exploration, but for colonisation. Launch a few thousand big cheap rockets, with supplies, with the understanding that not all of the supplies will reach Mars.\u003C/p\u003E\u003Cp\u003EThere is a comparison, or a couple of them, from the 2nd world war. The British Sten gun, designed when the threat of invasion was highest, could be made by almost any workshop, with as little as 5 man-hours of work, instead of by the specialised firearms manufacturers, who were under pressure. The early models were very basic, while later models, produced after the threat of invasion had diminished, were higher standard.\u003C/p\u003E\u003Cp\u003EThe more relevant comparison, is I think, the Liberty ship. These ships, built from standardised parts, could be built by all sorts of engineering fabricators, not just shipyards. They were cheap and quick to build. They were not the most finely built ships in use, but they did the job, and were a large factor in the outcome of the war.\u003C/p\u003E\u003Cp\u003EBig Dumb Boosters would be the rocketry equivalent of the Liberty Ship. Simple, cheap, and can be built by manufacturers other than rocketry builders.\u003C/p\u003E\u003Cp\u003EFor when you need a lot of stuff put into space, at as cheap a cost as possible, with the understanding that not all of them will succeed.\u003C/p\u003E\u003Cp\u003EHowever, we currently don\u0027t live in a situation where space exploration/exploitation/colonisation needs a Liberty Ship equivalent. For better or worse.\u003C/p\u003E\n"},{"CreatedByName":"Bryce Ring","CreatedById":129673,"CreatedDateTime":"2015-01-22T20:21:41Z","Content":"\n\u003Cp\u003EBob that link had some garbage at the end of the link address.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0066cc;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E%EF%BB%BF\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://exoscientist.blogspot.com.au/2015/01/nasa-technology-transfer-for-suborbital.html%EF%BB%BF\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://exoscientist.blogspot.com.au/2015/01/nasa-technology-transfer-for-suborbital.html%EF%BB%BF\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethis one worked.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://exoscientist.blogspot.com.au/2015/01/nasa-technology-transfer-for-suborbital.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://exoscientist.blogspot.com.au/2015/01/nasa-technology-transfer-for-suborbital.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kruleworld","CreatedById":69697,"CreatedDateTime":"2015-01-22T23:27:47Z","Content":"\n\u003Cp\u003EI do agree there is a lot of \u0027elitism\u0027 in the rocketry fields.\u003C/p\u003E\n"},{"CreatedByName":"Exoscientist","CreatedById":27117,"CreatedDateTime":"2015-01-24T05:11:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bryce Ring\u0022 data-cite=\u0022Bryce Ring\u0022\u003E\u003Cdiv\u003EBob that link had some garbage at the end of the link address.\u003Cp\u003E\u003Cspan style=\u0022color:#0066cc;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E%EF%BB%BF\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://exoscientist.blogspot.com.au/2015/01/nasa-technology-transfer-for-suborbital.html%EF%BB%BF\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://exoscientist.blogspot.com.au/2015/01/nasa-technology-transfer-for-suborbital.html%EF%BB%BF\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethis one worked.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://exoscientist.blogspot.com.au/2015/01/nasa-technology-transfer-for-suborbital.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://exoscientist.blogspot.com.au/2015/01/nasa-technology-transfer-for-suborbital.html\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Thanks for noticing the garbled link. I corrected the link in that prior post.\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBig dumb boosters are supposed to be very simple designs. For one thing they use the much simpler pressure-fed engines rather than turbopumps. Indeed, about the complexities of developing turbopump-powered rocket engines, a saying among rocket engineers is \u0022orbital systems are turbopump developments with rockets attached.\u0022\u003C/p\u003E\u003Cp\u003E The simplicty of pressure-fed engines has allowed many amateurs to build such engines in their backyards. More advanced amateurs have used them to also launch rockets. The Morpheus lander uses pressure-fed engines and is suborbital capable. That NASA is now allowing commercial licensing of their technology means the many amateur and commercial concerns building pressure-fed rockets can now actually accomplish suborbital launches.\u003C/p\u003E\u003Cp\u003E Big dumb boosters though are thought of as orbital systems. However, with staging suborbital rockets can be used to produce orbital rockets.\u003C/p\u003E\u003Cp\u003E Bob Clark\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T12:01:43Z\u0022 title=\u002201/25/2015 12:01  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by Exoscientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2015-01-25T12:49:22Z","Content":"\n\u003Cp\u003EYou\u0027ve gotta run the numbers to see if it works out. Lets say that your budding space program is building a rocket to land on the moon, and you have the option of using solid motors and hybrid solid-liquid ones, at 250 ISP, or Hydrogen, at 450 ISP.\u003C/p\u003E\u003Cp\u003E18 km/s is what you need in delta-v. Let\u0027s assume that in each design, each stage is 5% non-fuel, and that the hydrogen rocket has 5 stages. The final one that returns being 5 tonnes dry.\u003C/p\u003E\u003Cp\u003EEach stage has 3.6 km/s of delta-v.\u003C/p\u003E\u003Cp\u003ESo the rocket would weigh 430 tonnes at launch. Note that these numbers are optimistic, as in reality, the dry mass of the landing stage will be much higher. If the stages took 15% of the mass, we\u0027d see a rocket at something like 900-1000 tonnes. Realistically, spent stages have quite significant masses, and low altitude performance is low.\u003C/p\u003E\u003Cp\u003ENow if we have solids at 5% mass, we have 9 stages... And a whopping 15000 tonnes of booster. Remember, this is with the same formula that gave hydrogen boosters 430 tonnes for the same mission.\u003C/p\u003E\u003Cp\u003EAnd 15% basically becomes madness. 53000 tonnes of MOAR BOOSTERS to accomplish the same task as 1000 of efficient rocket, and scaling solid motors to where the bottom stage weighs 30,000 tonnes wouldn\u0027t be simple or cheap to do.\u003C/p\u003E\u003Cp\u003EAt some point, a clever economist might ask why not go to orbit using gunpowder in an iron keg at 150 ISP? Why not is because having 9 stages, each almost twice as big as the last, ends up making a rocket with 10000 tonnes of boom barrel for every tonne of payload to LEO. Sure, it might be technically possible, but it\u0027s really not a good idea when modern hydrogen vehicles can get payload fractions of almost 4%. There is no way that making a reliable rocket out of iron boom barrels is 400 times cheaper per kg than modern rocketry.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAs has been mentioned elsewhere, any rocket with an ISP lower than around 1/6th it\u0027s mission delta-v is probably cost-prohibitively massive. There are places and times for big dumb boosters with low payload fractions, but they aren\u0027t particularly affordable for trying to reach orbit or beyond in real life, due to the tyranny of the rocket equation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T12:39:13Z\u0022 title=\u002201/25/2015 12:39  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by Pds314\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-01-25T13:30:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exoscientist\u0022 data-cite=\u0022Exoscientist\u0022\u003E\u003Cdiv\u003EThe Morpheus lander uses pressure-fed engines and is suborbital capable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E This is nonsense. It barely hits 200m.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2015-01-25T14:07:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThis is nonsense. It barely hits 200m.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETechnically, I believe that does qualify as a suborbital trajectory.\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-01-25T15:57:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pds314\u0022 data-cite=\u0022Pds314\u0022\u003E\u003Cdiv\u003ETechnically, I believe that does qualify as a suborbital trajectory.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei think you need to hit the karman line (100km) before getting back on earth to qualify as suborbital \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-01-25T16:04:58Z","Content":"\n\u003Cp\u003EWell, while it was a trajectory that was definitely not an orbit, it was not suborbital\u003Cem\u003E spaceflight.\u003C/em\u003E That is what we are talking about here, and space is defined as that which is beyond Karman line.\u003C/p\u003E\n"}]}