{"TopicId":76084,"ForumId":55,"TopicTitle":"Cranking the Scale Up to ELEVEN!","CreatedByName":"Hogbobson","CreatedById":95002,"CreatedDateTime":"2014-06-27T13:07:48Z","PageNum":1,"Articles":[{"CreatedByName":"Hogbobson","CreatedById":95002,"CreatedDateTime":"2014-06-27T13:07:48Z","Content":"\n\u003Cp\u003EHelloooo, happy lovely community people!\u003C/p\u003E\u003Cp\u003EI was thinking, Intestellar travel sounds AWESOME! I am a huge fan of the idea of having not only the Kerbol System to explore, but several star systems. I can\u0027t wait for the thing to happen properly, either through mods or the main game.\u003C/p\u003E\u003Cp\u003EBut more star systems is an idea as old as the game. We don\u0027t want to hear about that.\u003C/p\u003E\u003Cp\u003EThen I think a bit further. I would like more star systems... how about more GALAXIES?\u003C/p\u003E\u003Cp\u003EI admit, it\u0027s a ridiculous, too big, many years down the line idea, but I just like the idea of not being limited, you know? No matter where you turn your ship, you will *eventually* hit something. And if it floats people\u0027s boat, bloody stage a mission to Andromeda! Now, that must be grand. The sheer scale of the space station needed to have a crew survive that distance.\u003C/p\u003E\u003Cp\u003EEven if FTL is seen as kinda meh by some, there should be no problem having timewarp 10^9, or even more. The only problem I see with that is if the distance is too far, evolution and mutation might start to kick in and yadda yadda yadda. But still! The sheer scale and thought and... whoa.\u003C/p\u003E\u003Cp\u003EAnd why stop there? Add galaxy clusters! Now THERE\u0027S a distance that sucks to travel without FTL. But... yeah, I might just be obsessed with a grand Universe.\u003C/p\u003E\u003Cp\u003EI have no idea how it should be coded, no idea how there should be power for that in a Desktop (though Spore does a Galaxy pretty well? Or do I not know Spore at all?), and no idea if it should even be considered, but I like big in my Space Simulators, and I\u0027ll goddang enjoy the idea, and hope someone will mod it in KSP 2.16 or something. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat are people\u0027s thoughts on MORE SCALE?\u003C/p\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-06-27T13:12:09Z","Content":"\n\u003Cp\u003EI like the idea of KSP 2 (as in, a whole sequel to KSP) being about interstellar travel, if they ever made it. But until then I don\u0027t really see it happening...\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-06-27T14:30:50Z","Content":"\n\u003Cp\u003Eksp 2 should really be a prequel, where we take an adolecent jeb questing around kerbin to give the dragonfire amulet to the emperor\u0027s illegitimate long-forgotten son.\u003C/p\u003E\u003Cp\u003Eidk about you all, but i just want our current system a bit more fleshed out. tunnels and caverns on some bodies to explore, maybe an underground lake accessable only by dropping in vertically through a small hole in the ceiling. id like the terrain scatter to be solid, so its actually a hazzard when landing. more things to do on those planets would be cool too\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-06-27T18:11:08Z","Content":"\n\u003Cp\u003EKSP 2? There\u0027s not even a single guarantee that KSP 1 will be finished, let alone any possibility for a new game.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-06-27T21:24:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MR4Y\u0022 data-cite=\u0022MR4Y\u0022\u003E\u003Cdiv\u003EKSP 2? There\u0027s not even a single guarantee that KSP 1 will be finished, let alone any possibility for a new game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe was merely getting the message across trough exaggeration. No need to get mad.\u003C/p\u003E\n"},{"CreatedByName":"Twreed87","CreatedById":50017,"CreatedDateTime":"2014-06-28T00:47:24Z","Content":"\n\u003Cp\u003ENo thanks. Galaxies would require billions and billions of planets, which would have to be procedurally generated, so they\u0027d lack detail and be super repetitive. And what would be the point? You\u0027d never visit even the tiniest fraction of it all.\u003C/p\u003E\u003Cp\u003EAt most, I think one other solar system could be kinda cool. There could be another star that\u0027s kinda like the Proxima Centuari of the Kerbin system. It would be very, very far, and very hard to reach, but it would have a couple planets around it with something really, really interesting or rewarding. Reaching it would be basically the endgame.\u003C/p\u003E\n"},{"CreatedByName":"velve","CreatedById":112979,"CreatedDateTime":"2014-06-28T02:14:46Z","Content":"\n\u003Cp\u003EThe scale of the planets we currently have are more than sufficient I think, as r4pt0r was saying, aving more detail in our current setup would be the likely first step. The only problem is that in a game, a planet is nothing more than a visual, they are not entirely interesting(for example the moon in kerbal looks pretty decent no? This does not mean there is much to do on it), unless we can eventually have some way of drilling into the surface collecting physical samples for expanded research etc. Obviously some planets could have unique valleys and caverns and that sort, this would be cool. But as soon as they all have that, it becomes a little less unique.\u003C/p\u003E\u003Cp\u003EThe ideal scenario for me would be more mechanics into actual colonization. Using the unique metallurgy of each of the 16 planets including moons, to be able to create various subsets of structures each with a unique feel. To actually feel like this group of kerbals are now actually calling this place home. I feel this is going to far, perhaps not that in depth but something among those lines. Just some more stuff to do on these planets we currently have. Even though duna is red and resembles mars, Eve is this mysterious purple resembling venus, as soon as you have taken in the sights and collected your science, Well thats kind of it, both have the same mechanics yet visually they are miles apart. There is no gameplay setting them apart. I could explore a texture of mars for example on my pc if I wanted to.\u003C/p\u003E\u003Cp\u003EI have not played spore, perhaps this is starting to sound like that? Hope not though, it doesn\u0027t look good. I don\u0027t intend to make KSP out to be a game it was not meant to be. But with more fleshing out it could be more the game it thought it was going to be.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-06-28T02:36:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003EHe was merely getting the message across trough exaggeration. No need to get mad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not getting mad. I\u0027m just being realistic.\u003C/p\u003E\n"}]}