{"TopicId":76147,"ForumId":36,"TopicTitle":"VTOL/VSTOL Flight Control Computer *Icarus Aerospace*","CreatedByName":"Dedalous","CreatedById":102925,"CreatedDateTime":"2014-06-28T05:58:57Z","PageNum":1,"Articles":[{"CreatedByName":"Dedalous","CreatedById":102925,"CreatedDateTime":"2014-06-28T05:58:57Z","Content":"\n\u003Cp\u003EThe planned purpose for this mod is as a flight computer/automatic stabilizer for VTOL capable craft. Long have I played KSP, and been in love with VTOL craft, but been unable to fly them. Without computer guidance, most designs are inherently unstable, and difficult to fly. So, I\u0027m working on this.\u003C/p\u003E\u003Cp\u003EThe plugin is in development at the moment, so this thread is currently for questions, advice, and help seeking, as I\u0027m new to KSP modding, or modding in general, and have to learn a whole new way to think to implement 3D stability control. I\u0027m also trying to feel out the community response to see if this is even worth the guaranteed headaches it\u0027s going to cause. Anyway, enough blathering, and on to features!\u003C/p\u003E\u003Cp\u003EPlanned features, in order of implementation(Subject to change as things are discovered/figured out):\u003C/p\u003E\u003Cp\u003E - Roll/pitch/yaw stability control, with the ability to roll/pitch for forward and lateral movement, then return to center, and lateral skew for heading change\u003C/p\u003E\u003Cp\u003E - Thrust balancing through the COM so shifting fuel mass/poor design won\u0027t cause crashes\u003C/p\u003E\u003Cp\u003E - Altitude hold\u003C/p\u003E\u003Cp\u003E - Dynamic lift control, so total lift stays the same no matter orientation, leveraging throttle, engine gimble, and wing lift.\u003C/p\u003E\u003Cp\u003E - Manual/automatic switching between altitude hold/hover and flight modes\u003C/p\u003E\u003Cp\u003EFor now, that\u0027s all I\u0027d like to accomplish, as those are all the features I can think would be needed for such a specialized system. If any of you with more experience in this field see something I need to add or modify to make this work, feel free to comment or PM me. As I said, I\u0027m a modding n00b, so any help is appreciated.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-10T10:50:51Z\u0022 title=\u002207/10/2014 10:50  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 10, 2014\u003C/time\u003E by Dedalous\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dedalous","CreatedById":102925,"CreatedDateTime":"2014-07-03T08:08:12Z","Content":"\n\u003Cp\u003E*Edit* No longer abandoned. Lets see how long this lasts before I get frustrated and give up.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-10T10:49:30Z\u0022 title=\u002207/10/2014 10:49  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 10, 2014\u003C/time\u003E by Dedalous\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2014-07-07T08:54:16Z","Content":"\n\u003Cp\u003EI find it disappointing that the project was abandoned since I\u0027ve been looking for something that does this for a while. I use Diazo\u0027s vertical speed controller and it makes landers and VTOL\u0027s much easier to fly. This seemed like it would be a good companion.\u003C/p\u003E\u003Cp\u003EI\u0027ve had a number of mods that install the Firespitter.dll but I\u0027ve never seen an interface for it. \u003C/p\u003E\u003Cp\u003EIs there another firespitter plugin or does the one I\u0027ve already got do something I wasn\u0027t aware of?\u003C/p\u003E\n"},{"CreatedByName":"Dedalous","CreatedById":102925,"CreatedDateTime":"2014-07-10T10:48:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerba Fett\u0022 data-cite=\u0022Kerba Fett\u0022\u003E\u003Cdiv\u003ESNIP\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou need to have a declared VTOL engine. For instance, in the patched B9 pack, the rotating VTOL engines, powered by firespitter, have context menu commands to control the VTOL. Also, after playing around with these engines, I\u0027ve discovered that while it has all the features I wanted, the interface is clunky and cumbersome. I also can\u0027t run a COM Thrust balancer like TCA into the mix without introducing massive instability, so I\u0027m going to resume developing this plugin. If for no other reason than I\u0027m too lazy to build a balanced VTOL.\u003C/p\u003E\n"},{"CreatedByName":"BelgarionNL","CreatedById":95432,"CreatedDateTime":"2014-07-10T22:04:03Z","Content":"\n\u003Cp\u003Ewell I would love if you got some help from the community on this! right now I am also using TCA to manually land but its a massive pain in the ass. so yes I would love if you or someone else could make a plugin that can balance engine thrust and then lands smoothly\u003C/p\u003E\n"},{"CreatedByName":"How2FoldSoup","CreatedById":82003,"CreatedDateTime":"2014-07-10T23:34:06Z","Content":"\n\u003Cp\u003EI\u0027ve actually been thinking of trying to make someting similar. I don\u0027t mind building balanced VTOLs but I wanted an intuitive way to switch from horizontal flight and vtol to mode for landing and this looks like it could be it. I\u0027m glad you decided to go through with it.\u003C/p\u003E\u003Cp\u003ESoup\u003C/p\u003E\n"}]}