{"TopicId":76140,"ForumId":15,"TopicTitle":"Trouble with glass","CreatedByName":"Cfuller","CreatedById":113206,"CreatedDateTime":"2014-06-28T04:12:39Z","PageNum":1,"Articles":[{"CreatedByName":"Cfuller","CreatedById":113206,"CreatedDateTime":"2014-06-28T04:12:39Z","Content":"\n\u003Cp\u003EI know the mod has been done and I appreciate the fine work the person has done on it. Namely Nazari for his cage system. I\u0027m curious on how to actually make the\u003C/p\u003E\u003Cp\u003Emodels has a transparent texture. I have been fiddling with blender and it does the transparency, but never shows up in KSP. What would be easier to use to do this?\u003C/p\u003E\u003Cp\u003EWould it be better with Unity or Blender. I want to learn about how to perform this skill. I would appreciate any help or comments. Thanks\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-06-28T04:57:42Z","Content":"\n\u003Cp\u003Esave a texture either as 32bit TGA or PNG.\u003C/p\u003E\u003Cp\u003Ein Unity, select one fo the KSP/Alpha type shaders. Cutoff types only allows 2bit Alpha; Translucent is 8bit, allows you to get semi-transparent areas. Unlit is self-illuminated and not affected by lighting in the game, you adjust the color to set the brightness.\u003C/p\u003E\u003Cp\u003EIn the texture setting, check Alpha is Transparency box. Not necessary, but a redundancy measure. \u003C/p\u003E\u003Cp\u003EIf things look inverted, make sure you assigned the correct texture to the shader. If the shader is expecting alpha channel and doesn\u0027t find one, things can look odd.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T05:34:20Z\u0022 title=\u002206/28/2014 05:34  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-06-28T14:55:46Z","Content":"\n\u003Cp\u003EI had experimented with transparency and translucency for my translucent fueled adapters. In this case, the trick was to give the illusion that a liquid could be in the tank before use, and after use could look empty (since the game does not draw fuel or oxidizer as liquids which can be seen draining from transparent tanks). BTW, these adapters have reduced drag too.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://farm4.staticflickr.com/3787/13259028105_1483087efd_o.png\u0022 alt=\u002213259028105_1483087efd_o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECurrently my adapters are not available (were at SpacePort). After the KSP version 0.24 update, I\u0027ll probably make them available at Curse.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T15:01:43Z\u0022 title=\u002206/28/2014 03:01  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by Dispatcher\u003C/strong\u003E\n\u003C/span\u003E\n"}]}