{"TopicId":76198,"ForumId":16,"TopicTitle":"ships Loading distances","CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-06-28T19:39:50Z","PageNum":1,"Articles":[{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-06-28T19:39:50Z","Content":"\n\u003Cp\u003EHi all, Sorry to post here but I have look all the place and cant find the answer.\u003C/p\u003E\u003Cp\u003ESo I have a big enterprise going on minmus using the MKS and I need to knoo how to change (manually if needed) the loading distances of objects in the game.\u003C/p\u003E\u003Cp\u003EI have see that, the game will load stuff at 11.0 to 10.0 meter but some parts load at 3.0M to 2.5M.\u003C/p\u003E\u003Cp\u003ESo is there a way to restrict the loading distances in the area of 3.0 Meters to save CPU process time to keep the game at normal speeds, like change all the parts to load at 3K or 4k, that way I can have all the stuff I have in Minmus and have some decent Fps to play.\u003C/p\u003E\u003Cp\u003ERight now I have 5 main parts on Minmus but only the Rigg will use most of the Fps ( it have 89 Tons and more that 300-400 parts) I use it to mine Kethane, them Base core, PDU, Constru, Bio, Kerbit, etc etc, and im dropping to 20 to 26 Fps and I need to send the rest of the Mods to build the base but by the looks of it in the end I will have like 10Fps or less so I need a way to slow down the lag and the only way to do that is to have the parts loading distance change.\u003C/p\u003E\u003Cp\u003EI have change the config file to have the lest lag possible but it still slowdown some times, like launching a 1500 parts ship will drop to 10 to 15 Fps, so this or any other idea will be nice (thz).\u003C/p\u003E\u003Cp\u003EBest regards to all.\u003C/p\u003E\u003Cp\u003ESpecs :\u003C/p\u003E\u003Cp\u003EIntel i5-760 Quad core\u003C/p\u003E\u003Cp\u003EIntel Extreme DP55KG\u003C/p\u003E\u003Cp\u003EKingstone 10Gb DDR3\u003C/p\u003E\u003Cp\u003E2X ATI R7 260 OC / CrossFire\u003C/p\u003E\u003Cp\u003ERig\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.custume-server.com/up/uploads/rigg.jpg\u0022 alt=\u0022rigg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-28T19:55:13Z\u0022 title=\u002206/28/2014 07:55  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 28, 2014\u003C/time\u003E by custume\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-06-29T00:25:20Z","Content":"\n\u003Cp\u003EUnless you have some mod that changes load distance it should always be at 2.5km.\u003C/p\u003E\n"},{"CreatedByName":"SergeantBlueforce","CreatedById":73432,"CreatedDateTime":"2014-06-29T06:50:12Z","Content":"\n\u003Cp\u003EI know this isn\u0027t really answering your question, but KSP is badly optimised, meaning that it lags hugely for seemingly no reason.\u003C/p\u003E\u003Cp\u003EDue to the fact that the lag you seem to be having is the result of a very large vessel, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55657-0-23-5-Kerbal-Joint-Reinforcement-v2-3-4-14-14\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Emay\u003C/em\u003E\u003C/span\u003E work.\u003C/p\u003E\u003Cp\u003EAs for the loading distance of ships, there is no way to change it from altering configs; to my knowledge, the only way to adjust it is by changing the game\u0027s code, so I\u0027d say your best bet for this is too request a loading distance adjuster, as I\u0027ve seen mods adjust it before.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-29T06:53:02Z\u0022 title=\u002206/29/2014 06:53  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 29, 2014\u003C/time\u003E by SergeantBlueforce\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-06-29T14:09:01Z","Content":"\n\u003Cp\u003EHi again,\u003C/p\u003E\u003Cp\u003ETHz for the answers,\u003C/p\u003E\u003Cp\u003E looks like I have no way of getting the game faster on huge ships but its ok, all the tweaks I made to the game now looks ok i got 32Fps (\u002B or - ) and that\u0027s not bad for the massive number of parts also im getting some decent Fps from the big big ships (like 1500 or more).\u003C/p\u003E\u003Cp\u003ESergeant, thz for the idea but my problem is not pphysics, I don\u0027t fear the kraken my problem is speed (lag), there was a mod that solves my problem but is not ready for version 23.5, is the joining mod (or something like that) that weld parts together that way the part count stay low, I have to wait for it .\u003C/p\u003E\u003Cp\u003ERegards to all\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-06-29T18:37:51Z","Content":"\n\u003Cp\u003EWhat setting are you using for delta physics? Think that\u0027s what it\u0027s called.\u003C/p\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-06-30T09:19:15Z","Content":"\n\u003Cp\u003EHere is my config:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.custume-server.com/up/uploads/settings.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.custume-server.com/up/uploads/settings.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit reason : to big\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-03T16:15:29Z\u0022 title=\u002207/03/2014 04:15  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 3, 2014\u003C/time\u003E by custume\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SergeantBlueforce","CreatedById":73432,"CreatedDateTime":"2014-06-30T15:48:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022custume\u0022 data-cite=\u0022custume\u0022\u003E\u003Cdiv\u003ESergeant, thz for the idea but my problem is not pphysics, I don\u0027t fear the kraken my problem is speed (lag), there was a mod that solves my problem but is not ready for version 23.5, is the joining mod (or something like that) that weld parts together that way the part count stay low, I have to wait for it .\u003Cp\u003ERegards to all\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you will find that KJR will help, as it strengthens connections between parts, meaning that it will help in the same way part weld does.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-30T16:19:54Z","Content":"\n\u003Cp\u003EIt is very unlikely to help in the same way that \u0022welding\u0022 does as welding actually turns multiple parts into one part for the physics simulation leading to a large reduction in part count. Making stronger joints between parts just means that your ship will flex and wobble (and fall apart) less, all the same physics calculations would still be done...\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-06-30T18:57:35Z","Content":"\n\u003Cp\u003ELag when high part count ships are visible is due to the physics calculations being single-threaded. There\u0027s no config change, mod, setting or even a hack that will change that. Not even the 64bit version. Physics are still being calculated in a single thread.\u003C/p\u003E\u003Cp\u003EEdit: although the part welding mod would help as it makes multiple parts into 1, its no use to stuff in flight. Unless you can parse craft files and are comfortable with savefile editing, there\u0027s no way to change a ship in flight. You could make a replica in the VAB, make that one part, then copy the craft contents to replace the active one though.\u003C/p\u003E\u003Cp\u003EAnd also, please could you wrap your settings config in CODE tags or upload it elsewhere. Makes for easier forum reading, especially on mobile.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-30T19:03:14Z\u0022 title=\u002206/30/2014 07:03  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 30, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-07-03T16:09:30Z","Content":"\n\u003Cp\u003EHi again to all,\u003C/p\u003E\u003Cp\u003ESo side the part welding mod there is no way to change or relieve some lag from part count, I use that mod in the old version (22 or 23 I think) and if I only weld some parts (like structural connections and/or all the stuff that do not need to move and that reduce a lot of lag.\u003C/p\u003E\u003Cp\u003EWhat im saying (asking) is a way (or by hand, mod or by the developers ) to set the loading distances of objects to 3 or 4 Kilometers and not 10, or a option to define that.\u003C/p\u003E\u003Cp\u003EI know for a physics point of view is nice to load at 10K but what I will do at 10K, I don\u0027t even see the dam ship only at 4 to 3 K I start to see the ship(a small thing in space) so thereÃ‚Â´s no point (from a user point of view) to load the ship that far away.\u003C/p\u003E\u003Cp\u003EI have never read the saves looking for that and yes I have edited some files/configs and created some to help me on the game (like a trash burner for the TAC Life support to burn excess trash) but I did not see (or try to see) that part in the save file or needed, I do not need to change the ship in fight so there is no need to read the save file but is a great idea.\u003C/p\u003E\u003Cp\u003EI will upload the config file to my server and add a link and not the hole text.\u003C/p\u003E\u003Cp\u003EBest regards to all and thank you all for the answers\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003Eto really, really relieve the lag is to add to the game a similar option that weld parts, I will try to explain but English is not my 1Ã‚Âº language.\u003C/p\u003E\u003Cp\u003EFor example \u0022almost all structural parts have to be 1 single part for the physic\u0027s process\u0022 like if you add 2 steel beans or more they became 1 part, or all the struts and segments the same (if they are together they have to be 1 part) from the physics point of view it makes sense if they are together them they have to turn, twist or roll in the same direction so they are (\u002B or -) a single part.\u003C/p\u003E\u003Cp\u003EIm not saying to do that to all the parts (not even half) but all the parts that will (if together) work on the basics of a single part, that way the process power needed is not so great, from the point of view of the code is not that big deal to change that but the problem will be how some parts react to that config, well to process something in terms of speed, direction and so on that can get messy but I think is the only way to get this game fast to run on (normal machines).\u003C/p\u003E\u003Cp\u003EThe other thing that will help is to add the multicore function, that way the game will use all the available cores to process the physics, my machine is not bad ( it have almost 4 years) but is still very strong but a (normal machine) will be slower that mine so any thing to help speed up the game is excellent, I know there is the 64 version but is not working so good.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-03T16:44:56Z\u0022 title=\u002207/03/2014 04:44  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 3, 2014\u003C/time\u003E by custume\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-07-03T16:12:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003EUnless you have some mod that changes load distance it should always be at 2.5km.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s 10km isn\u0027t it? Or am I confusing this with something else?\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-07-03T16:44:43Z","Content":"\n\u003Cp\u003EKsp loads things by default at 2.5k\u003C/p\u003E\u003Cp\u003EYou can change this with various mods, one I know of is \u0022Lazor Systems\u0022 which has an option to increase draw distance in its menu.\u003C/p\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-07-03T16:55:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tortoise\u0022 data-cite=\u0022Tortoise\u0022\u003E\u003Cdiv\u003EKsp loads things by default at 2.5k\u003Cp\u003EYou can change this with various mods, one I know of is \u0022Lazor Systems\u0022 which has an option to increase draw distance in its menu.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehmm that looks nice.\u003C/p\u003E\u003Cp\u003EAre you sure about the 2.5K or that is the textures ??\u003C/p\u003E\u003Cp\u003EFor me the textures is not the problem, my GPUÃ‚Â´s hardly work and the lag starts at 10K so or is a mod doing the lag or the physic\u0027s load at 10K and that is my problem, I need to have a lot of parts (base at minmus) and they can be far ( like 5K or 6k) but I don\u0027t need for the game to load that (is to far to even see).\u003C/p\u003E\u003Cp\u003EGoing to check that mod out maybe will help, thz\u003C/p\u003E\u003Cp\u003ERegards to all\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EHmm looks good, later on I will try it but looks great, the game start (according to the mod) at 22.000 K loading distance, I have change it to default (2.5) and later I will try if the lag is gone.\u003C/p\u003E\u003Cp\u003EThe problem will still be there but if it works I can manage the process load on the cpu using the mod\u003C/p\u003E\u003Cp\u003ETHz for the help Tortoise\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-03T17:15:58Z\u0022 title=\u002207/03/2014 05:15  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 3, 2014\u003C/time\u003E by custume\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-07-03T17:41:09Z","Content":"\n\u003Cp\u003EHave you got Skillful? That changes the default render range to 10km...\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-07-03T18:01:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022custume\u0022 data-cite=\u0022custume\u0022\u003E\u003Cdiv\u003Ehmm that looks nice.\u003Cp\u003EAre you sure about the 2.5K or that is the textures ??\u003C/p\u003E\u003Cp\u003EFor me the textures is not the problem, my GPUÃ‚Â´s hardly work and the lag starts at 10K so or is a mod doing the lag or the physic\u0027s load at 10K and that is my problem, I need to have a lot of parts (base at minmus) and they can be far ( like 5K or 6k) but I don\u0027t need for the game to load that (is to far to even see).\u003C/p\u003E\u003Cp\u003EGoing to check that mod out maybe will help, thz\u003C/p\u003E\u003Cp\u003ERegards to all\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EHmm looks good, later on I will try it but looks great, the game start (according to the mod) at 22.000 K loading distance, I have change it to default (2.5) and later I will try if the lag is gone.\u003C/p\u003E\u003Cp\u003EThe problem will still be there but if it works I can manage the process load on the cpu using the mod\u003C/p\u003E\u003Cp\u003ETHz for the help Tortoise\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problem, and yea by default it\u0027s 2.5km\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-07-03T18:09:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tortoise\u0022 data-cite=\u0022Tortoise\u0022\u003E\u003Cdiv\u003EKsp loads things by default at 2.5k\u003Cp\u003EYou can change this with various mods, one I know of is \u0022Lazor Systems\u0022 which has an option to increase draw distance in its menu.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAah it was Lazor all along!\u003C/p\u003E\u003Cp\u003ENow set to 1km. Thanks for the diagnosis.\u003C/p\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-07-04T01:04:22Z","Content":"\n\u003Cp\u003Elooks nice but I had some mix results, I had to change the distance to 1k for the ships to load at 2.5 and I got more lag after using this mod.\u003C/p\u003E\u003Cp\u003EBut I try to use the x64 version and now its great, is faster, using all cores and works better on ati cards, had some problems on the crossfire (some artifacts on the scenery) but now looks better, using the mod to keep distances to a minimal and its working good.\u003C/p\u003E\u003Cp\u003ESee test (using Dx9) 1500 parts (\u002B or -) 20 to 28 Fps\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.custume-server.com/up/uploads/afgsgffdfasss.jpg\u0022 alt=\u0022afgsgffdfasss.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-04T01:06:30Z\u0022 title=\u002207/04/2014 01:06  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 4, 2014\u003C/time\u003E by custume\u003C/strong\u003E\n\u003C/span\u003E\n"}]}