{"TopicId":76287,"ForumId":16,"TopicTitle":"My craft keeps leaning in launch - could someone download it and help figure why?","CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2014-06-29T23:05:29Z","PageNum":1,"Articles":[{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2014-06-29T23:05:29Z","Content":"\n\u003Cp\u003EYou can download my craft here: \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/1918347/Manned%20advanced%20science%20craft%20for%20Ike.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/1918347/Manned%20advanced%20science%20craft%20for%20Ike.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou\u0027d need to copy it to your folder at:\u003C/p\u003E\u003Cp\u003EKerbal Space Program\\saves\\**YOUR_NAME**\\Ships\\VAB\u003C/p\u003E\u003Cp\u003EIt leans during launch and cannot be controlled. It has the \u0022inline advanced stabiliser\u0022 that all the kids are talking about but it\u0027s impossible to reach orbit with it. Thanks for any insight.\u003C/p\u003E\u003Cp\u003EFeel free to take it to Ike, in the event you can stop it from leaning.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-06-29T23:12:04Z","Content":"\n\u003Cp\u003EA picture would help here (So we didn\u0027t have to download the craft) On an unrelated note, is this in career mode?\u003C/p\u003E\u003Cp\u003EOn a much related note I fixed it. Wasn\u0027t able to get it to Ike (I don\u0027t think you have the fuel for that, but I could be wrong) but I did manage to get it into a solar orbit.\u003C/p\u003E\u003Cp\u003ECraft File\u003Ca href=\u0022https://docs.google.com/file/d/0BzOU_F85Qj0YZ1A1ZU1EMFNFcTg/edit\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/file/d/0BzOU_F85Qj0YZ1A1ZU1EMFNFcTg/edit\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-29T23:47:29Z\u0022 title=\u002206/29/2014 11:47  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 29, 2014\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-06-29T23:48:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022THX1138\u0022 data-cite=\u0022THX1138\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt leans during launch and cannot be controlled. It has the \u0022inline advanced stabiliser\u0022 that all the kids are talking about \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor all who didn\u0027t download the craft file: a 12x bundle of these ARM pencil-boosters for a first stage. Second stage is wrapped in eight more of these boosters. Looks like a career ship, the core of the second stage is Rockomax-32 tanks and a Skipper engine.\u003C/p\u003E\u003Cp\u003EThere\u0027s a few control surfaces (which happen to be dead center at launch time) and exactly ONE sas module near the top.\u003C/p\u003E\u003Cp\u003EDear THX: your ship is lacking control. A single reaction wheel(1) on such a large vessel has pretty much no effect at all.\u003C/p\u003E\u003Cp\u003EWhat can you do?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003Emore reaction wheels. About one wheel for ~40 tons should be fine. Try to distribute them over the craft, if you can do so without great hassle. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGimbaling Engines. Equip your first stage with a liquid fuel core, too. The gimbals do you no good when the engine isn\u0027t running / throttled down, though. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Emore control surfaces near the tail of your first stage. The ones you do have will work nicely once the first stage is gone, but they\u0027re just in the wrong place to help right after launch. \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBTW: the first stage is strutted down nicely, but dangling boosters on your second stage will at the very least cause severe rolling, possibly even disintegration. No amount of gimbals and reaction wheels can compensate for that.\u003C/p\u003E\u003Cp\u003E(1): It was not always thus, but these days, Reaction Wheels and SAS Module do exactly the same thing in the same way. One is heavier than the other for historical reasons.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-29T23:52:16Z\u0022 title=\u002206/29/2014 11:52  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 29, 2014\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-06-30T02:51:35Z","Content":"\n\u003Cp\u003EWhile the SRB cluster is fine for a boost stage, they are inefficient in later stages. I see struts scattered about. Additionally, the SRBs generally are not steerable.\u003C/p\u003E\u003Cp\u003EFor the upper stage, the SRBs are better off clustered close to the core instead of double stacked the way they are and dangling as others have mentioned.\u003C/p\u003E\u003Cp\u003ECurrently playing with this deep space 3 Kerbal monster. Have the orbiter nailed down. Plan to add several small probes to the payload section and send it on its way to explore the Jool system. The nuke in the payload stage also supplies continuous power. There are also four pairs of drop tanks. Enough fuel remains in the core launch stage for an escape to solar orbit where a long burn of the nuke will not be an issue for interplanetary flight. Note, only one additional SAS was added to aid maneuvering. Ship is quite stable in flight. I found the NASA engines to be more efficient with a bit more power then the Griffons I used earlier. Results, a bit better launch speed with fuel savings.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XzFGc4W.jpg\u0022 alt=\u0022XzFGc4W.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RDmtHop.jpg\u0022 alt=\u0022RDmtHop.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-30T02:53:47Z\u0022 title=\u002206/30/2014 02:53  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 30, 2014\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"}]}