{"TopicId":76467,"ForumId":34,"TopicTitle":"[0.25] Realism Overhaul w/ RedAV8R [Terminated]","CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-07-02T02:30:27Z","PageNum":58,"Articles":[{"CreatedByName":"Luscion","CreatedById":120200,"CreatedDateTime":"2014-09-29T03:31:20Z","Content":"\n\u003Cp\u003EMy bad, it was a conflict with mod thats not 100% supported as yet, maybe i should read properly next time. I\u0027ve now uninstalled it and everything\u0027s fine\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-29T08:00:10Z","Content":"\n\u003Cp\u003EGlad you got it sorted out! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2014-09-29T10:38:32Z","Content":"\n\u003Cp\u003EI haven\u0027t played in a long time but I updated and installed everything again last weekend. I was just busy building a rocket and I seem to be running into a problem: this particular rocket is VASTLY overperforming.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uVi2pEl.png\u0022 alt=\u0022uVi2pEl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s a 70,4mT payload. The fairings weight almost 4mT, the fairing base 1,2mT. That\u0027s a single RS-68 engine at the bottom(which has full 0% - 100% throttle capability) and the second stage is powered by three RL-10A-4-1/2 engines. The second stage provides 6,800m/s dV. With a small 5m(diameter) x 6m tank. For aproximately 75mT of payload and fairings.\u003C/p\u003E\u003Cp\u003EI\u0027m using the newest version of Kerbal Engineer and it works in all other capacities but it could be the problem with wrong calculations. This just seems a little weird to me though.\u003C/p\u003E\u003Cp\u003EEDIT: I still don\u0027t know quite what the problem is but it is definitively a problem with Kerbal Engineer. It\u0027s acting in a most peculiar fashion. Ignore this post then.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-29T12:25:07Z","Content":"\n\u003Cp\u003EHello!\u003C/p\u003E\u003Cp\u003EFirst of all I have found two quite strange things yet that are suspected to be either bugs of some sort or just mistakes in the module manager patch adding files. The first thing is that the Apollo capsule is six metres near the bottom instead of four as it is supposed to be. Maybe that is the reason that its top node is not aligned with the actual hatch on top of it.\u003C/p\u003E\u003Cp\u003EAnd the second thing is that some engines have strange stats. For example the deep throttle capable engine from the post above with its default fuel mixture has a rated thrust of mere five units. By the way are these kilonewtons?\u003C/p\u003E\u003Cp\u003EThen do you consider adding more different engines? Some parts from different packs and mods simulate the same engine two or three times while there is a sort of gap between the very very small engines and very big ones especially if you are limited to a certain diameter. Also why is the very nice trick with those huge domes on the engines disappearing inside the tanks gone? Maybe engines with domes should have two attachment nodes to better fit them visually depending on the situation? Do you still have the configs with their coordinates?\u003C/p\u003E\u003Cp\u003EDoes the mod affect the Hot Rockets in any way?\u003C/p\u003E\u003Cp\u003EI have just suddenly noticed in game that some engines burning hydrolox have realistic blue exhaust flames instead of their native orange ones.\u003C/p\u003E\u003Cp\u003EAnd another one question that I would like to ask. I have constructed a launch vehicle tuned for low orbit insertions with a central core of two stages and four side liquid fueled boosters. Its centre of lift point is normally quite far behind its centre of mass during the whole flight and its centre of thrust is aligned and all of its potentially wobbly booster joints are fixed firmly in place with triangle strut constructions. The problem is that in flight under mechjeb control at some point in flight it is becoming progressively wobbly as the control inputs are becoming so aggressive that no obvious deviation exists at all but the controls are just jumping left and right as crazy in a minute the whole rocket is constantly jumping left and right as crazy. What can the reason for this be?\u003C/p\u003E\u003Cp\u003EThank you!\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-29T12:54:07Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@kitspace:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EApollo...what Apollo. Details kitspace, details. I can\u0027t fix something if I don\u0027t know what to fix.\u003C/p\u003E\u003Cp\u003EEngine stats? What are you talking about? the engine above? The post above? Some magic picture I cant see? I see nothing with 5 units of anything. Yes, thrust is in kN though.\u003C/p\u003E\u003Cp\u003EIf you want specific engines added, then suggest an engine and a model to go with it.\u003C/p\u003E\u003Cp\u003EThe \u0027feature\u0027 of nodes to hide the fuel tank on engines has been removed because I don\u0027t care for it. I don\u0027t care for the fuel tank either, and unfortunately when scaling the engine made that fuel tank huge. If somebody else wants to go though and add nodes to do so, feel free to do it and make a git pull request to add it. It\u0027s not tough, but I\u0027ve got enough on my plate to focus my energy elsewhere.\u003C/p\u003E\u003Cp\u003EDo you see HotRockets on the OP list? Did you even look? Must not have, because it\u0027s not there. Then first of all it\u0027s not supported. Second, if it\u0027s not listed then it\u0027s not tested either. If it\u0027s not tested, then I have NO IDEA if RO affects HotRockets.\u003C/p\u003E\u003Cp\u003EI have no idea. You didn\u0027t post a log, you didn\u0027t post the craft file. You didn\u0027t post a darn thing I can use to replicate the issue.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-29T13:20:15Z\u0022 title=\u002209/29/2014 01:20  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 29, 2014\u003C/time\u003E by RedAV8R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-09-29T12:59:33Z","Content":"\n\u003Cp\u003EI\u0027m working (slowly) on a HR patch for RO. It\u0027s not supported as of now, though.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-29T14:34:44Z","Content":"\n\u003Cp\u003EPosted by mistake.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-29T14:36:44Z","Content":"\n\u003Cp\u003EApollo?\u003C/p\u003E\u003Cp\u003EAh you think of the real life historic parts. Sorry. I mean just the big stock three man command capsule as it is usually considered to represent the Apollo capsule.\u003C/p\u003E\u003Cp\u003EI mean the RocketMan post directly above mine. This engine is nothing more than the most obvious example that I can see around in my game. I just could not remember its name exactly but I know that it is the big grey one that has the deep throttle capacity. If I just go and grab this engine from the part list in my game its rated thrust will be five kilonewtons and that means it can hardly lift itself.\u003C/p\u003E\u003Cp\u003EI am not suggesting any specific engines to be added but just any engines that could meet the requirements for moderate thrust engines as currently in my opinion there is a too big difference between the engines in the matter of their thrust level.\u003C/p\u003E\u003Cp\u003ESorry what do you mean when saying that scaling the engine made that fuel tank huge? Is that correct that this feature was already implemented from the beginning with the scaled engines?\u003C/p\u003E\u003Cp\u003EThat is really weird and that is exactly what made me ask this question originally. It is not supposed to have any effect on the visual appearance of course including mods that change visual appearance but strange enough some engines have blue exhaust flames and these are the ones that burn hydrogen. I did not notice this until now so it made me doubt if Realism overhaul is doing this.\u003C/p\u003E\u003Cp\u003EThe craft probably has a little bit of excessive control authority but the main problem is that something most likely Ferram aerospace research makes mechjeb just use extremely aggressive control inputs with no good reason even with all the anti wobble patches.\u003C/p\u003E\u003Cp\u003EThank you.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2014-09-29T15:28:53Z","Content":"\n\u003Cp\u003EThe engine that can hardly lift itself is based on the RL-10 and was designed for use on the Altair Lunar Lander. On the Moon it has MORE than enough thrust. Use a different engine that\u0027s better suited. The RS-68 for example can throttle between 52% and 100%(I think) thrust. That\u0027s enough throttle ability for a controlled ascent if you really need it.\u003C/p\u003E\u003Cp\u003EThe engines are modelled after real-life counterparts. They\u0027re exactly as they should be. There\u0027s a wide variety of engines already from a large amount of different packs and they suit my needs fine. Try using two low thrust engines. or try @NathanKell\u0027s RftS pack for different engines. \u003C/p\u003E\u003Cp\u003EI\u0027ve had that issue with MechJeb since at least 0.18.4. Thus I don\u0027t use it. I find especially with RSS and RO and other related mods it becomes unbearable to use most of the time.\u003C/p\u003E\u003Cp\u003EIf the engines are sized properly with the nodes in the lowered positions as they were before, the mounting on those engines becomes very VERY large in many cases; forcing you to use a very large fuel tank to hide it anyway. Thus it becomes a pointless workaround.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-29T15:35:05Z\u0022 title=\u002209/29/2014 03:35  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 29, 2014\u003C/time\u003E by ANWRocketMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-29T15:46:37Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@kitspace:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t mean anything. I\u0027m asking you for details. You said the Apollo, that\u0027s pretty vague statement when this mod touches at least 3 replicas plus countless other pods that some lay person can call \u0022Apollo\u0022. When I ask for details. I mean use the name found in the VAB and what mod/pack it originally comes from. Something like \u0022the stock Mk1-2 Command Pod\u0022 is what I am looking for. Is this what you mean? If it is, then no, the bottom is not 6m. Not with RO it isn\u0027t. Bet you have some other unsupported mod installed that changes things, or have installed something wrong.\u003C/p\u003E\u003Cp\u003ESince I still have absolutely NO IDEA what engine you are talking about because of your lack of details. The only RS-68 found in RO (by my count) is one found in the AIES pack, and no. It\u0027s not 5kN. Again, you\u0027ve got something installed that is unsupported or installed something wrong. FWIW, look at the picture you are talking about stated plain as day 3,552kN. This is your problem, not ROs.\u003C/p\u003E\u003Cp\u003EEngines in general. So you are going to whine, but not do anything constructive to fix it. Considering your first two points are showing a botched or unsupported install, chances are once things are corrected, you\u0027ll see this isn\u0027t the case.\u003C/p\u003E\u003Cp\u003EIncluded engines in RO range from RCS of all flavors, from 0.5N thrusters to 8000kN RD-170 series engines and everything in between. There are over 100 different types of liquid, electric, nuclear and solid engines now included with RO. Where exactly is there a gap that needs filled? It may be your opinion, but unless you have something to back up your claim or more details of exactly what you are looking for I can\u0027t help you. If you have a favorite that I\u0027m missing, then by all means let me know. Here is an idea...check out \u003Ca href=\u0022https://en.wikipedia.org/wiki/Comparison_of_orbital_rocket_engines\u0022 rel=\u0022external nofollow\u0022\u003ETHIS PAGE\u003C/a\u003E. The list is vastly incomplete, but there is a wide variety on it of all shapes and power levels. If there is one there you like, or want to have, then let me know.\u003C/p\u003E\u003Cp\u003EIt was a \u0027feature\u0027 of the previous versions of RealEngines by SFJackBauer. Since RO now contains remnants of RealEngines, it\u0027s not anymore. Tank bloat is bad, no way around it without actually removing it from the model, which is required by the one who made it. I recommend using engines that don\u0027t have tank boat at all. ANWRocketMan hit the nail on the head when it comes to why I removed what was there and didn\u0027t add it to anything new.\u003C/p\u003E\u003Cp\u003EI have no idea. Not my problem. Read the OP.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEffects: As comprehensive as this mod is, I have not, and am not working on effects. This includes engines and any other part. This means that effects for some engines aren\u0027t going to match what they actually look like. If somebody wants to start working on them, please PM me, get a git account, and issue pull requests as you work on them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs Dragon01 stated, he\u0027s working on something, but his work in this regard is not included with RO at this time.\u003C/p\u003E\u003Cp\u003EYou can wildly propose theories as to why something is broken all day long. This thread isn\u0027t the place for it without details, logs, and examples provided to test. I can\u0027t help you.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-29T15:49:44Z\u0022 title=\u002209/29/2014 03:49  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 29, 2014\u003C/time\u003E by RedAV8R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"O Nerd","CreatedById":90266,"CreatedDateTime":"2014-09-29T17:28:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EO Nerd: Yes, that *is* for RSS. That\u0027s why it\u0027s not the original link.\u003Cp\u003EHowever, it hasn\u0027t been updated for v7.\u003C/p\u003E\u003Cp\u003EInstead, you should use Trigger Au\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/93115\u0022 rel=\u0022external nofollow\u0022\u003ETransfer Window Planner\u003C/a\u003E, which is that, but ingame.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy god, how did i not see that \u0022For RSS\u0022? I\u0027m so dumb. Well, thanks Lilienthal and Nathan!\u003C/p\u003E\n"},{"CreatedByName":"A_Burnt_Rodent","CreatedById":123884,"CreatedDateTime":"2014-09-29T20:59:45Z","Content":"\n\u003Cp\u003EFirst off thanks to all involved for the hard work on this (now essential) mod, and second, apologies if this has already been asked but here goes; are there any plans to add waste heat management, or does anyone know if KSP-I (Plugin only) can be used safely?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-29T21:20:06Z","Content":"\n\u003Cp\u003ERealHeat is a WIP right now, waiting to replace Deadly Reentry. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"A_Burnt_Rodent","CreatedById":123884,"CreatedDateTime":"2014-09-29T22:00:42Z","Content":"\n\u003Cp\u003EOk, thanks. Will new parts e.g. heat exchanger/radiators be included?\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-30T10:21:52Z","Content":"\n\u003Cp\u003ERight at the moment of wrighting this I am starting to install right everything again from scratch exactly following your instructions step by step. Let us see if this helps with this in any way. I really hope it helps to sort it out but I can not think of a reason for the previous install to be botched simply because it was done using the same procedure from the original post.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-30T16:20:35Z","Content":"\n\u003Cp\u003EUnfortunately it did not help much.\u003C/p\u003E\u003Cp\u003EI will add details and logs in a few minutes.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-30T16:40:11Z","Content":"\n\u003Cp\u003ESo here are the details on the problems experienced.\u003C/p\u003E\u003Cp\u003EI suppose that some mods have updated since the patches were made or there are some mistakes in the configs.\u003C/p\u003E\u003Cp\u003EAll the mods are installed exactly as instructed in the original post in order of appearance there and of course all of them are from the supported list.\u003C/p\u003E\u003Cp\u003EAll the mods installed here have been downloaded today no more than a few hours ago from their respective forum threads.\u003C/p\u003E\u003Cp\u003EThe install includes all of the recomended and required mods and some of the supported part packs.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/o3p7y37yt/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s10.postimg.org/o3p7y37yt/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://postimg.org/image/vgxyaaanj/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s27.postimg.org/vgxyaaanj/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://postimg.org/image/qtwhm9cof/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s27.postimg.org/qtwhm9cof/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/a\u003E \u003Ca href=\u0022http://postimg.org/image/ftrhhnbjx/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s22.postimg.org/ftrhhnbjx/image.jpg\u0022 alt=\u0022image.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is the log that was obtained after starting the game up and getting these pictures.\u003C/p\u003E\u003Cp\u003EBoth links are the same file just a mirror.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.sendspace.com/file/jr3fp4\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.sendspace.com/file/jr3fp4\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.filedropper.com/outputlog\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/outputlog\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-30T17:12:51Z\u0022 title=\u002209/30/2014 05:12  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 30, 2014\u003C/time\u003E by Kitspace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-30T17:12:57Z","Content":"\n\u003Cp\u003EGot one of your logs. Your install contains unsupported material. Support denied.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-30T17:16:12Z\u0022 title=\u002209/30/2014 05:16  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 30, 2014\u003C/time\u003E by RedAV8R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-30T17:28:38Z","Content":"\n\u003Cp\u003EWhat is the unsupported material in my install exactly?\u003C/p\u003E\u003Cp\u003EDoes the docking alignment indicator gauge count?\u003C/p\u003E\u003Cp\u003EIs it really able to break anything?\u003C/p\u003E\u003Cp\u003EI already told you that all these mods are from the list in the original post and are obtained by clicking the links there.\u003C/p\u003E\u003Cp\u003EI am not interested in telling you something that is not true at least to the best of my knowledge and belief and I have no reason to do so. By the way did you first see this post before the log was added on top?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-30T17:33:00Z\u0022 title=\u002209/30/2014 05:33  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 30, 2014\u003C/time\u003E by Kitspace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-30T17:32:41Z","Content":"\n\u003Cp\u003EAlso I can post some pictures of my current game data folder and the folder that I was downloading mods into.\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-30T17:33:33Z","Content":"\n\u003Cp\u003EThe simple fact is the troubleshooting directions direct you to install the required material and those on the OP list only. You failed to follow those instructions. I don\u0027t care what it is. Does it break anything, I don\u0027t know. It doesn\u0027t matter. ITS NOT ON THE LIST. You came here for help. I instructed you to follow directions. You didn\u0027t.\u003C/p\u003E\u003Cp\u003EYou are right though there have been a lot of updates since the last release. I\u0027m putting final touches on one or two things. Give me 30-45min and there will be a new release posted. Delete your current RealismOverhaul folder and reinstall. REMOVE EVERYTHING THAT IS NOT ON THE LIST. Retest. Let me know.\u003C/p\u003E\u003Cp\u003EFor space concerns and easier reading learn to edit/add to previous posts. There is an \u0022edit post\u0022 button by the reply, reply with quote buttons by every post.\u003C/p\u003E\u003Cp\u003EFWIW, now that you have given me details about what engine you were having issues with, you are right, the min/max was swapped. That has been corrected now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-30T17:39:42Z\u0022 title=\u002209/30/2014 05:39  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 30, 2014\u003C/time\u003E by RedAV8R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-30T17:55:23Z","Content":"\n\u003Cp\u003ENEW RELEASE!!!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84689\u0022 rel=\u0022external nofollow\u0022\u003Ev6.0 ALPHA 13 \\/ \u003C/a\u003E\u003C/p\u003E\u003Cp\u003E*Added AVC Support\u003C/p\u003E\u003Cp\u003E*Updated MM to v2.3.5\u003C/p\u003E\u003Cp\u003E*Added KAS Support\u003C/p\u003E\u003Cp\u003E*Added Kethane Support\u003C/p\u003E\u003Cp\u003E*Added SpacePlane Plus Support - Will be updated as necessary with inclusion into KSP 0.25\u003C/p\u003E\u003Cp\u003E*Added ScanSAT Support\u003C/p\u003E\u003Cp\u003E*Added Romfarer Robotic Arms \u0026amp; Lazor Support\u003C/p\u003E\u003Cp\u003E*Added KerbalGPS Support\u003C/p\u003E\u003Cp\u003E*Added KerbX Support\u003C/p\u003E\u003Cp\u003E*Added RLA Support back (now v11.2)\u003C/p\u003E\u003Cp\u003E*Added TaurusHCV Support\u003C/p\u003E\u003Cp\u003E*Added SDHI Service Module Support\u003C/p\u003E\u003Cp\u003E*Added AerojetKerbodyne v3.* Support\u003C/p\u003E\u003Cp\u003E*More KlockheedMartian Update/Fixes\u003C/p\u003E\u003Cp\u003E*Reworked Stock Pyrios Booster\u003C/p\u003E\u003Cp\u003E*RCS Added to multiple crew pods\u003C/p\u003E\u003Cp\u003E*Deadly ReEntry Update/Fixes\u003C/p\u003E\u003Cp\u003E*NovaPunch2 Fixes\u003C/p\u003E\u003Cp\u003E*Universal Storage Fixes\u003C/p\u003E\u003Cp\u003E*TACLS Updates/Fixes\u003C/p\u003E\u003Cp\u003E*RemoteTech2 Update/Fixes\u003C/p\u003E\u003Cp\u003E*AIES Probe Update/Fixes\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-30T17:56:40Z","Content":"\n\u003Cp\u003EWhen you say the list do you mean the supported list or just the essentially required mods list?\u003C/p\u003E\u003Cp\u003EIf you mean that I should remove everything but the essential ones even if it is in the supported packs list then no problem.\u003C/p\u003E\u003Cp\u003EOf course I will do it just it was not yet clear for me that you want me to remove the supported ones also.\u003C/p\u003E\u003Cp\u003ESorry.\u003C/p\u003E\u003Cp\u003EIt seems to work with the absolutely required and highly recomended mods but one of the supported mods brakes the stock capsule and some of the supported ones work weirdly themselves.\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-30T18:04:20Z","Content":"\n\u003Cp\u003EWhich list isn\u0027t the problem. You installed multiple things that WASN\u0027T ON ANY OF THE LISTS. You\u0027ve got new instructions. Follow them. Use your head. Now obviously you can\u0027t test a part if you don\u0027t install it. If it says supported, then it\u0027s supported, and a proper bug report is nice.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-09-30T18:48:27Z","Content":"\n\u003Cp\u003EGrats on the new release. I\u0027ll have to update asap. Here\u0027s hoping the savegame survives ( but if not whatever ). Question.. you say Romfarer is now supported? How does RSS play with an increased load distance? Are there any known significant bugs by chance?\u003C/p\u003E\n"}]}