{"TopicId":76467,"ForumId":34,"TopicTitle":"[0.25] Realism Overhaul w/ RedAV8R [Terminated]","CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-07-02T02:30:27Z","PageNum":56,"Articles":[{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-22T23:20:19Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@MaxP:\u003C/strong\u003E How about you read and follow directions of the VERY FIRST POST in it\u0027s entirety.\u003C/p\u003E\n"},{"CreatedByName":"MaxP","CreatedById":92030,"CreatedDateTime":"2014-09-22T23:43:55Z","Content":"\n\u003Cp\u003EI\u0027ve read it, just thought it is a known problem, and there is a way to fix it easily... Ok, here is the \u003Ca href=\u0022https://www.dropbox.com/s/2hv2ybeiq89u7e9/KSP.rar?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Elog\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EI have only one instance of Apollo_CM_HeatShield part, located in RedAV8R_OLDD_ApolloCSM.cfg, all parts not changed.\u003C/p\u003E\u003Cp\u003EConfig is loaded succesfully, the amount of ablative shileding is correct.\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-22T23:56:41Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@MaxP:\u003C/strong\u003E You obviously haven\u0027t read it and understood it.\u003C/p\u003E\n"},{"CreatedByName":"MaxP","CreatedById":92030,"CreatedDateTime":"2014-09-23T03:28:45Z","Content":"\n\u003Cp\u003EI\u0027ve read this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EQ: Some parts have CoM/CG offset from the true center of the part? AND/OR My craft won\u0027t fly straight, what is happening?\u003Cp\u003EA: Some parts (even more will be soon) have had their CoM adjusted to approximate real life. Once again, no, we aren\u0027t going to change it back. Soon we will add a moving CoM to further enhance realism. Remember, this Realism Overhaul not Kinda Sorta Maybe Real But Totally Fiction When Things Get Tough Overhaul. Besides, having an offset CoM is very important for making controlled reentries. Your crew might not survive, and your pod might overheat, if you can\u0027t fly a lifting reentry.\u003C/p\u003E\u003Cp\u003ECoM Related:\u003C/p\u003E\u003Cp\u003EQ: How do I make a controlled, lifting reentry with the Mk1-2 Pod?\u003C/p\u003E\u003Cp\u003EA: See this awesome video for a tutorial.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs it exactly what you mean?\u003C/p\u003E\u003Cp\u003EIf so, the pod on the video loosing speed \u003Cstrong\u003Every\u003C/strong\u003E quickly and has 4500\u002B m/s on ~54 km, with much more than 100 m/s vertical speed, while Apollo CM has 7200\u002B m/s on the same altitide with lifting reentry (10-8 degrees, Cl 0.1-0.05), with 10 degrees it can fly back to space, and I was keeping the v/s withing 30 m/s.\u003C/p\u003E\u003Cp\u003EMay be, it\u0027s due to big mass of pod, ~5.5 t. \u003Cstrong\u003EEven\u003C/strong\u003E if it will be able to go down below 43 km (where RCS thrusters \u003Cstrong\u003Ecannon keep desired angle of attack\u003C/strong\u003E), it will spend all of RCS fuel and ablative shielding earlier than the descend can be safe.\u003C/p\u003E\u003Cp\u003EAnyway, I can\u0027t imagine how to land it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-23T03:38:48Z\u0022 title=\u002209/23/2014 03:38  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 23, 2014\u003C/time\u003E by MaxP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-23T03:37:02Z","Content":"\n\u003Cp\u003ELet me spell it out for you. FASA AND OLDD ARE NOT SUPPORTED AT THIS TIME.\u003C/p\u003E\n"},{"CreatedByName":"MaxP","CreatedById":92030,"CreatedDateTime":"2014-09-23T03:56:39Z","Content":"\n\u003Cp\u003EAnd you can write it in the very first answer, not spending your and my time with two pages of comments.\u003C/p\u003E\u003Cp\u003ELet me explain, how I see it.\u003C/p\u003E\u003Cp\u003EOLDD\u0027s and FASA configs are in the pack, so not hard to tell \u0022FASA and OLDD are not \u003Cstrong\u003Efully\u003C/strong\u003E suported at this time\u0022 - with just eight caps, not thirty six.\u003C/p\u003E\u003Cp\u003EIf it was another bugs in OLDD, I would not have asked, it works well.\u003C/p\u003E\u003Cp\u003EAnd I\u0027ve asked - you know, it can be bug with the specific config, isn\u0027t it?\u003C/p\u003E\u003Cp\u003ESo calm down. Thanks anyway.\u003C/p\u003E\n"},{"CreatedByName":"griffin247","CreatedById":58122,"CreatedDateTime":"2014-09-23T07:19:04Z","Content":"\n\u003Cp\u003Ethink you shud calm down maxp the lads work very very hard to keep things rolling for us , and the ammount of questions they try to answer is very very silly ammount 90% of questions are due to people not reading the OP and understanding it and installing mods wrong\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2014-09-23T09:59:27Z","Content":"\n\u003Cp\u003EHas anyone tried RO6 in combination Persistant Momentum 1.0? \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/85990-0-23-5-Persistent-Momentum-1-0-%2814-July%29\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E[0.23.5] Persistent Momentum 1.0 (14 July)\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis mod allows for momentum to persist through time warp and game saves/loads. Allowing the creation of rotational stabilised satellites, centripetal space stations and an all round more realistic docking experience. It also adds difficulty via not being able to rely on freezing your momentum by quickly enabling and disabling time warp.\u003C/p\u003E\u003Cp\u003EI think it RO6 and Persistant Momentium make good candidates to play together since they both strive improve realism\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-23T10:18:55Z\u0022 title=\u002209/23/2014 10:18  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 23, 2014\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-23T11:40:32Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@MaxP:\u003C/strong\u003E I asked you to read the OP, why, because this is clearly stated:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EComing Soon:\u003Cp\u003EWorks in Progress or Future Plans - No Particular Order [NOTE: Packs in this list ARE NOT guaranteed to work at all, and could quite possibly cause KSP to crash]\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf which both FASA and OLDD are listed.\u003C/p\u003E\u003Cp\u003EThis issue and many others with FASA and OLDD have been brought to my attention time and time again, and my answer every time has been be patient I haven\u0027t made progress on those mods yet, when I do, all will be taken care of. You failed to see any of this. So yes, I\u0027m going to be cranky. I appreciate people reporting issues, don\u0027t get me wrong, but when the same thing OR related issues are constantly mentioned, that\u0027s when I take issue. I\u0027ll be honest, your decision to post a severely degraded, unrealistic RSS config for Soviet work that simply has payload as a goal has given me a poor first impression and kinda gives RO a bad name when you use it. Wildly defend your config and how awesome it is, then with you coming on our thread and pointing out our flaws, which we have already acknowledged if you had only read, followed by not providing the correct report the first time just furthers that impression. Have a good day.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@FreeThinker:\u003C/strong\u003E That is a distinct possibility, once the mod is more mature and bug free, even by the authors comment he needs to spend some time with it. It hasn\u0027t been touched in months.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-23T14:14:47Z\u0022 title=\u002209/23/2014 02:14  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 23, 2014\u003C/time\u003E by RedAV8R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BadRocketsCo.","CreatedById":101686,"CreatedDateTime":"2014-09-23T13:18:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RedAV8R\u0022 data-cite=\u0022RedAV8R\u0022\u003E\u003Cdiv\u003EDo me a favor, don\u0027t uninstall anything. Test things again and give me a slightly more detailed and accurate idea of what YOU see. Activate the engine, make sure the gimbal is turned on, (if you right click the part, there should be two \u0022lock gimbal\u0022 buttons). Try and change attitude, the rocket should change attitude, the exhaust animation won\u0027t move, the engine itself will, but the rocket will change attitude.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmmm...I only have 1 gimbal button. The rocket bell moves, the exhaust animation stays in place and the rocket will NOT change attitude.\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-23T13:43:12Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@BadRocketsCo.:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOk, troubleshoot 101. Install fresh KSP, install latest RO and dependencies as listed in the OP \u003Cstrong\u003EONLY\u003C/strong\u003E, install latest NP2. Try it. Let me know. If you are still having problems, grab the latest RO_NovaPunch_Engines.cfg from the git repo, try it again.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-23T14:16:15Z\u0022 title=\u002209/23/2014 02:16  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 23, 2014\u003C/time\u003E by RedAV8R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-09-23T16:39:53Z","Content":"\n\u003Cp\u003EI did a RSS/Ro install last night, and it came up with no error, but while the capsules are scaled up (looks like 2m and 4m), the 1.25m tanks are not. Is this normal (in which case tweak scale is pretty much obligatory), or did I biff applying one of the many mods I had to install somehow?\u003C/p\u003E\n"},{"CreatedByName":"Lilienthal","CreatedById":119423,"CreatedDateTime":"2014-09-23T17:01:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EI did a RSS/Ro install last night, and it came up with no error, but while the capsules are scaled up (looks like 2m and 4m), the 1.25m tanks are not. Is this normal (in which case tweak scale is pretty much obligatory), or did I biff applying one of the many mods I had to install somehow?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think this is normal behaviour. Tweakscale is on thie highly recommended list anyway. - So why don\u0027t you just install it? \u003C/p\u003E\u003Cp\u003EHave fun with RO!\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-09-23T17:25:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilienthal\u0022 data-cite=\u0022Lilienthal\u0022\u003E\u003Cdiv\u003EI think this is normal behaviour. Tweakscale is on thie highly recommended list anyway. - So why don\u0027t you just install it? \u003Cp\u003EHave fun with RO!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I dropped it in there last night. I just wanted to make sure I had not messed up one of the (too many) installs.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-24T04:18:49Z","Content":"\n\u003Cp\u003Etater, I kinda figured it was a matter of time until I saw you here. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-09-24T05:53:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003Etater, I kinda figured it was a matter of time until I saw you here. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELOL.\u003C/p\u003E\u003Cp\u003EI felt it was my responsibility to the devs given the \u0022WIP\u0022 state to experience the base game before I start beating it up too much \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo be on topic here, why are the capsules scaled, but not the tanks/parts that should fit them? I understand the need to scale from the 2/3 scale, it\u0027s just confusing for a first time install to crank it up to find that nothing fits anymore. Also, again as a new RSS/RO install, there are so many possible places I could have screwed up the install (forget one of the many mods, etc), I was \u003Cem\u003Esure\u003C/em\u003E I had done something wrong \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-24T06:14:11Z","Content":"\n\u003Cp\u003EAh. It\u0027s because with RO, the idea of getting a series of parts that match size is pretty much out the window. If your capsule is 2m wide, you can bet your bottom dollar that your LV is *not* going to be 2m wide. Well, you *might* be able to launch the Mk1 pod on a 2m-wide 2-stage staged combustion storable propellant rocket, but odds are you\u0027ll want 3m diameter. For that reason, and because only Procedural Parts supports all the various tank types (balloon, service module, etc), it has been the operating assumption that people will just use PP tanks; I don\u0027t even *have* any stock tanks in my install, I deleted them to save RAM.\u003C/p\u003E\u003Cp\u003EAlso, it\u0027s not that the pods are rescaled; they\u0027re not made larger just because, they\u0027re made larger so they are the same size as their real-life analogs, the Mercury capsule and the Apollo Block II capsule. If there were a stock 2.5m Soyuz capsule, it would be scaled *down* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe tanks, by contrast, have no real world analog parts, and thus have no reason to be rescaled.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-09-24T13:22:57Z","Content":"\n\u003Cp\u003EYeah, I understand the rationale around the scaling. It seems that tweak scale should not be sort of required. It\u0027s not about having to do it (us the PP stuff), but that as a first installer, it was not immediately obvious that I had done everything right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis looks like \u0022megamod\u0022 territory (speaking from Silent Hunter modding experience) since so many of the mods touch stuff that is critical to this one/two mods (RSS/RO). Obviously made more complicated by the WIP nature of KSP, for sure (we were happy for a rare patch to SH4, not scared it would break everything every three months \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-24T20:55:05Z\u0022 title=\u002209/24/2014 08:55  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 24, 2014\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-24T14:05:03Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@tater:\u003C/strong\u003E I\u0027ve added a question to the FAQ that specifically talks about tanks to avoid the confusion from now on. Enjoy!\u003C/p\u003E\u003Cp\u003EGenerally speaking, RO is a mega-mod, modifying all those others to perform more realistic. It can be a challenge, keeping up with so many mods. I wasn\u0027t aware RLA had been updated, substantially at that, until a person filed a report. I try to keep up, but the number of mods involved, things being missed happen.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-24T14:07:29Z\u0022 title=\u002209/24/2014 02:07  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 24, 2014\u003C/time\u003E by RedAV8R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-24T15:14:54Z","Content":"\n\u003Cp\u003EDo you still consider adding the reaction control thrusters to the capsules and command pods that still do not have them?\u003C/p\u003E\u003Cp\u003EIt seems weird that in stock we have all the pods holding the thruster propellant inside but using those magic reaction wheels and a lot of electricity to spin around at huge unwanted rates instead of just using some built in thrusters like a real thing would do...\u003C/p\u003E\u003Cp\u003EAny ideas why do we actually have that insanely oversized role of the reaction wheels in stock? I did not even know such things existed until I suddenly came across them here. Even then it was quite hard for me to find any kind of a working real life example. And certainly it was not as big as a manned capsule even the smallest one.\u003C/p\u003E\n"},{"CreatedByName":"Dr. Jet","CreatedById":99880,"CreatedDateTime":"2014-09-24T20:18:41Z","Content":"\n\u003Cp\u003EYou really should consider supporting this (\u003Ca href=\u0022http://www.curse.com/ksp-mods/kerbal/224370-soviet-probes-now-with-rockets\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.curse.com/ksp-mods/kerbal/224370-soviet-probes-now-with-rockets\u003C/a\u003E) - for early soviet probes and R7 rocket family.\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-24T20:52:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kitspace\u0022 data-cite=\u0022Kitspace\u0022\u003E\u003Cdiv\u003EDo you still consider adding the reaction control thrusters to the capsules and command pods that still do not have them?\u003Cp\u003EIt seems weird that in stock we have all the pods holding the thruster propellant inside but using those magic reaction wheels and a lot of electricity to spin around at huge unwanted rates instead of just using some built in thrusters like a real thing would do...\u003C/p\u003E\u003Cp\u003EAny ideas why do we actually have that insanely oversized role of the reaction wheels in stock? I did not even know such things existed until I suddenly came across them here. Even then it was quite hard for me to find any kind of a working real life example. And certainly it was not as big as a manned capsule even the smallest one.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis has already been added to the stock Mk1-2 and Mk1, will be in the next release.\u003C/p\u003E\u003Cp\u003EWhy is stock, stock, because \u0027reaction wheels\u0027 make things easy and playable. They actually do exist, usually found on satellites or space telescopes that must remain in a fixed attitude precisely. The ISS has at least 3 of them as well.\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-09-24T20:54:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dr. Jet\u0022 data-cite=\u0022Dr. Jet\u0022\u003E\u003Cdiv\u003EYou really should consider supporting this (\u003Ca href=\u0022http://www.curse.com/ksp-mods/kerbal/224370-soviet-probes-now-with-rockets\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.curse.com/ksp-mods/kerbal/224370-soviet-probes-now-with-rockets\u003C/a\u003E) - for early soviet probes and R7 rocket family.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou really should consider reading the first post before you go making redundant suggestions.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESkyLab by raidernick and Soviet projects!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s been there for some time now.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-09-25T09:46:05Z","Content":"\n\u003Cp\u003ESorry I did not get it but why is it redundant? I do not see the soviet probe pack in the supported list and do not remember if it was ever suggested for support either.\u003C/p\u003E\n"},{"CreatedByName":"Hattivat","CreatedById":110255,"CreatedDateTime":"2014-09-25T11:21:26Z","Content":"\n\u003Cp\u003EIt\u0027s on the \u0022coming soon\u0022 list in the OP already, that\u0027s what is meant by \u0022SkyLab by raidernick and \u003Cstrong\u003ESoviet projects\u003C/strong\u003E\u0022\u003C/p\u003E\n"}]}