{"TopicId":76551,"ForumId":16,"TopicTitle":"What was the first Easter Egg added?","CreatedByName":"Sylandro","CreatedById":80729,"CreatedDateTime":"2014-07-03T00:40:54Z","PageNum":1,"Articles":[{"CreatedByName":"Sylandro","CreatedById":80729,"CreatedDateTime":"2014-07-03T00:40:54Z","Content":"\n\u003Cp\u003ESeriously, what was the first easter egg ever added to KSP?\u003C/p\u003E\u003Cp\u003EI keep on thinking of the Munar KSC which lasted to version 0.14 to 0.14.2, but that was just a bug. I like to think of it as a easter egg, though.\u003C/p\u003E\n"},{"CreatedByName":"Blind Dead McJones","CreatedById":109600,"CreatedDateTime":"2014-07-03T02:57:38Z","Content":"\n\u003Cp\u003EWell, you can find the old KSC in the mountains north of the western desert if you know where to look. What\u0027s really weird is if you leave something on the launchpad there, the game thinks it\u0027s on the launchpad back at the current KSC which can prevent launches.\u003C/p\u003E\u003Cp\u003EOldest easter eggs are probably the monoliths, but I\u0027m not certain about that.\u003C/p\u003E\n"},{"CreatedByName":"austin4050","CreatedById":66368,"CreatedDateTime":"2014-07-03T03:11:33Z","Content":"\n\u003Cp\u003EWell technically the entire world (kerbin) got a revamp so you could say that it reset all of the easter eggs, because it was debatable a new planet. But yes I think the monoliths were first.\u003C/p\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2014-07-03T09:42:02Z","Content":"\n\u003Cp\u003Ei dont know...\u003C/p\u003E\u003Cp\u003Ebut when i first played, there\u0027s only a moon up there in the skies.\u003C/p\u003E\u003Cp\u003Eand then shortly after i quitted,\u003C/p\u003E\u003Cp\u003Ewhen i get back into the game, there are planets and anomalies, \u003C/p\u003E\u003Cp\u003Ei dont even know when the anomalies were added, but i bet the first one must be the monument a little bit north of KSC or the island runway\u003C/p\u003E\u003Cp\u003Eand many anomalies are now gone since a couple patch ago...(some are still there, but the elevation isnt right, and it doesnt render)\u003C/p\u003E\u003Cp\u003Eeg the desert temple\u003C/p\u003E\u003Cp\u003Eso my opinion is... you should treat the anomalies patch by patch,\u003C/p\u003E\u003Cp\u003Ethey often revamp them anyways,\u003C/p\u003E\u003Cp\u003Esee the runway? it was just a sand strip, and then a concrete strip and then a concrete strip\u002B a hanagar, and now it\u0027s a sand strip\u002B 2 hangar\u002B a air control tower.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-03T09:46:37Z\u0022 title=\u002207/03/2014 09:46  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 3, 2014\u003C/time\u003E by lammatt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sylandro","CreatedById":80729,"CreatedDateTime":"2014-07-03T13:33:02Z","Content":"\n\u003Cp\u003EWait, i think i saw a Nassault video where it showed the very first iteration of the KSC monolith back in 0.7.3\u003C/p\u003E\n"}]}