{"TopicId":76926,"ForumId":36,"TopicTitle":"[1.1] BDArmory v0.11.0.1 (\u002Bcompatibility, fixes) - Apr 23","CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2014-07-08T00:44:17Z","PageNum":109,"Articles":[{"CreatedByName":"SrBrahma","CreatedById":141253,"CreatedDateTime":"2015-04-22T20:32:32Z","Content":"\n\u003Cp\u003EHey, just signed up here on KSP forums to make you an request.\u003C/p\u003E\u003Cp\u003E Could you make the missiles/bombs to explode on impact even without armed? I made an mobile artillery with a bomb on each missile head, but when i arm the bomb it just unweld out of the missile body. Would be also awesome if you make a missile with joint attachment on the back, with ajustable fuel and acceleration, so i could just attach they to a docking port. Very good mod, by the way, waiting for more updates with more guns!\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-04-22T21:24:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SrBrahma\u0022 data-cite=\u0022SrBrahma\u0022\u003E\u003Cdiv\u003EHey, just signed up here on KSP forums to make you an request.\u003Cp\u003E Could you make the missiles/bombs to explode on impact even without armed? I made an mobile artillery with a bomb on each missile head, but when i arm the bomb it just unweld out of the missile body. Would be also awesome if you make a missile with joint attachment on the back, with ajustable fuel and acceleration, so i could just attach they to a docking port. Very good mod, by the way, waiting for more updates with more guns!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like it when the weapons are disarmed until firing because that way my planes and ships won\u0027t explode from a bullet to the ordinance.\u003C/p\u003E\n"},{"CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2015-04-22T21:45:22Z","Content":"\n\u003Cp\u003EDepending on how the new aerodynamics are in 1.0, I may totally revamp the way missiles work so that they use actual lift to steer and stabilize. Depending on how/if they improve the water, I could extend it to torpedos.\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003EAbout warheads, there\u0027s a partmodule already in there called \u0022BDExplosivePart\u0022. None of the included parts use it, but you can add it to parts that you want to be explosive when destroyed. Try this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E    name = BDExplosivePart\u003Cbr\u003E\u003Cbr\u003E    blastRadius = 50\u003Cbr\u003E    blastPower = 25\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDO NOT enable Proxy Detonate on the part in-game. It was an unfinished feature and may throw exceptions if used. (Actually I don\u0027t think it will throw exceptions, but it just doesn\u0027t do anything at the moment)\u003C/p\u003E\u003Cp\u003Eedit\u002B:\u003C/p\u003E\u003Cp\u003EI haven\u0027t tried it yet, but \u003Cem\u003Eodin_spain\u003C/em\u003E has created a Contract Configurator pack for BDArmory.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/116245-0-90-5dim-Military-Contract-Pack-v0-1-2015-04-22\u0022 rel=\u0022external nofollow\u0022\u003E5dim Military Contract Pack\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-22T23:49:46Z\u0022 title=\u002204/22/2015 11:49  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 22, 2015\u003C/time\u003E by BahamutoD\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-04-23T06:30:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003EDepending on how the new aerodynamics are in 1.0, I may totally revamp the way missiles work so that they use actual lift to steer and stabilize. Depending on how/if they improve the water, I could extend it to torpedos.\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003EAbout warheads, there\u0027s a partmodule already in there called \u0022BDExplosivePart\u0022. None of the included parts use it, but you can add it to parts that you want to be explosive when destroyed. Try this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E    name = BDExplosivePart\u003Cbr\u003E\u003Cbr\u003E    blastRadius = 50\u003Cbr\u003E    blastPower = 25\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDO NOT enable Proxy Detonate on the part in-game. It was an unfinished feature and may throw exceptions if used. (Actually I don\u0027t think it will throw exceptions, but it just doesn\u0027t do anything at the moment)\u003C/p\u003E\u003Cp\u003Eedit\u002B:\u003C/p\u003E\u003Cp\u003EI haven\u0027t tried it yet, but \u003Cem\u003Eodin_spain\u003C/em\u003E has created a Contract Configurator pack for BDArmory.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/116245-0-90-5dim-Military-Contract-Pack-v0-1-2015-04-22\u0022 rel=\u0022external nofollow\u0022\u003E5dim Military Contract Pack\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEver though of adding battlestar galactica style missiles that can be fired from any direction and still home in just like a good space missile should?\u003C/p\u003E\n"},{"CreatedByName":"BoomShroom","CreatedById":124216,"CreatedDateTime":"2015-04-23T06:52:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hodo\u0022 data-cite=\u0022Hodo\u0022\u003E\u003Cdiv\u003EThe biggest problem with Torpedoes in KSP is water isnt water in KSP. It is more like nearly dry concrete. So if a vessel goes to fast underwater it will just explode from the force. And if you run Ferram4s Better Buoyancy mod, then your torpedo may just sink and not work at all.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI mentioned the FS buoyancy module because that actually solves the sinking issue. I also based my post on past experience, but I gave up on it because I couldn\u0027t find a level of thrust where the torp would still move, but not jump out of the water and fly to its target. Even with Ferram\u0027s Better Buoyancy the torp would still get out off the water and detonate itself 300m or so from where it was launched.\u003C/p\u003E\n"},{"CreatedByName":"Cdodders","CreatedById":85280,"CreatedDateTime":"2015-04-23T11:15:05Z","Content":"\n\u003Cp\u003EBD did you see my suggestion?\u003C/p\u003E\n"},{"CreatedByName":"LORDPrometheus","CreatedById":61414,"CreatedDateTime":"2015-04-23T17:54:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cdodders\u0022 data-cite=\u0022Cdodders\u0022\u003E\u003Cdiv\u003EBD did you see my suggestion?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe has his own life to live that includes developing his own game and working so don\u0027t get upset if he can\u0027t respond to every single post and he rarely ever responds to suggestions since he has his own vision for the mod. I\u0027m not trying to be rude just saying to not take it personally and to please not spam the thread.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vinster7\u0022 data-cite=\u0022vinster7\u0022\u003E\u003Cdiv\u003EHow do you fire bombs/missiles? I try to hold left click like it says and they don\u0027t drop. I have to set it to an action group or manually right click it. The time it takes to reach over and press 1-10 is too long, by that time your target could maneuver away.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMake sure to double check your fine key and remember if it\u0027s set to a mouse button not to click but to hold it down when selected. Also don\u0027t forget to arm your weapons manager in the right click menu of the part because that will also prevent it from firing. Lastly make sure your weapons are not blocked by another part as they have a built in module that prevents them from firing if they are blocked unless it is done manually. (This is for bombs not missiles)\u003C/p\u003E\n"},{"CreatedByName":"91NightFox","CreatedById":140477,"CreatedDateTime":"2015-04-23T19:29:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LORDPrometheus\u0022 data-cite=\u0022LORDPrometheus\u0022\u003E\u003Cdiv\u003E Lastly make sure your weapons are not blocked by another part as they have a built in module that prevents them from firing if they are blocked unless it is done manually. (This is for bombs not missiles)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPutting that same module on the missiles would be rather handy. Avoiding internal ordinance explosions is always good. \u003C/p\u003E\u003Cp\u003EBD, would it be possible to set it up so you can select how many weapons will fire when the fire key is pressed? For example; with cannons and lasers they will all shoot at the same time, but other ordinance will only shoot once for every fire command. Being able to change that setting as needed would be very helpful. You could fire broadsides of either missiles or cannons in series or as a volley. This would functionally extend the magazine capacities and increase the rate of fire for things like howitzers and Abrams turrets, as well as make massed missile attacks or bombing runs less carpal tunnel inducing. It could also pull double duty as a ripple manager for dropping bombs; if they\u0027ll only drop when they have clearance to do so, putting in a volley amount will drop them as fast as clearance will allow with the push of a single button.\u003C/p\u003E\u003Cp\u003EThe UI for a function like that could be included as a line in the weapons manager with a click box for \u0027series\u0027 and \u0027volley\u0027 with a blank dialogue box that the user can enter the number of guns or missiles that will fire at once. Optionally there could be separate selectors for guns and missiles so that you could fire missiles in volleys and guns in series without needing to fiddle with settings when switching between weapon types.\u003C/p\u003E\n"},{"CreatedByName":"AccidentalDisassembly","CreatedById":110936,"CreatedDateTime":"2015-04-23T23:13:31Z","Content":"\n\u003Cp\u003ELast night I tried making a TweakScale config for BDArmory bombs - it didn\u0027t work particularly well (exceptions, can\u0027t attach parts in editor, bad stuff). I was wondering if you thought it ever might be possible to scale up bombs, mostly because I think it would be very entertaining to drop an absurdly large bomb on the KSC and see what happens. \u003C/p\u003E\u003Cp\u003EThe variables I tried to get TweakScale to modify (in the MissileLauncher module) are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EblastRadius\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EblastPower\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EexplosionSize\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ethrust\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EcruiseThrust\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI asked Pellinor about BDArmory \u002B TweakScale over in the TweakScale thread, and he said this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI\u0027ve never tried BDArmoury. TweakScale only works out of the box if the other module can live with having its variables manipulated without notice. So I\u0027d suggest to start small and see which values can be changed without glitches.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EA second way is that BDArmoury can use the TweakScale API to get notified on rescale and update their module themselves. I know that IR and MFT/realFuels successfully use method.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you think BDArmory could ever end up working with TS? I am just assuming that right now it does \u003Cem\u003Enot\u003C/em\u003E like having its variables manipulated without notice. Would be cool!\u003C/p\u003E\n"},{"CreatedByName":"LORDPrometheus","CreatedById":61414,"CreatedDateTime":"2015-04-24T13:01:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AccidentalDisassembly\u0022 data-cite=\u0022AccidentalDisassembly\u0022\u003E\u003Cdiv\u003ELast night I tried making a TweakScale config for BDArmory bombs - it didn\u0027t work particularly well (exceptions, can\u0027t attach parts in editor, bad stuff). I was wondering if you thought it ever might be possible to scale up bombs, mostly because I think it would be very entertaining to drop an absurdly large bomb on the KSC and see what happens. \u003Cp\u003EThe variables I tried to get TweakScale to modify (in the MissileLauncher module) are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EblastRadius\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EblastPower\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EexplosionSize\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ethrust\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EcruiseThrust\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI asked Pellinor about BDArmory \u002B TweakScale over in the TweakScale thread, and he said this:\u003C/p\u003E\u003Cp\u003EDo you think BDArmory could ever end up working with TS? I am just assuming that right now it does \u003Cem\u003Enot\u003C/em\u003E like having its variables manipulated without notice. Would be cool!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGo back a few pages and you can find a post I made about the Energy equivalency of the blast definitions in this mod and how its very very difficult to create accurate large scale bombs in KSP. I did make a mistake since I did my math based off of a 1/3rd reduction due to blast radius instead of a 1/9th (stupid inverse square law lol) but the point is still valid\u003C/p\u003E\n"},{"CreatedByName":"andreasblom","CreatedById":133693,"CreatedDateTime":"2015-04-24T14:23:23Z","Content":"\n\u003Cp\u003Ewould changing the mass of the resource reduce damage?\u003C/p\u003E\n"},{"CreatedByName":"LORDPrometheus","CreatedById":61414,"CreatedDateTime":"2015-04-24T17:54:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andreasblom\u0022 data-cite=\u0022andreasblom\u0022\u003E\u003Cdiv\u003Ewould changing the mass of the resource reduce damage?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo changing the mass of the bullet in the weapon Config will however since bullett damage is calculated with mass and velocity which is actually dependent on the gun not the round though they are fairly consistent. If you want you can make the .50 do more damage than a 30mm just by increasing the mass however increasing velocity too much will cause it to phase through objects rather than collide. I am unsure when this occurs however\u003C/p\u003E\n"},{"CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2015-04-24T18:19:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LORDPrometheus\u0022 data-cite=\u0022LORDPrometheus\u0022\u003E\u003Cdiv\u003ENo changing the mass of the bullet in the weapon Config will however since bullett damage is calculated with mass and velocity which is actually dependent on the gun not the round though they are fairly consistent. If you want you can make the .50 do more damage than a 30mm just by increasing the mass however increasing velocity too much will cause it to phase through objects rather than collide. I am unsure when this occurs however\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes the density of the ammo resource includes the mass of the casing with propellant. The bullet mass in the weapon config only includes projectile mass.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022\\\u0022 data-cite=\u0022\\\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe variables I tried to get TweakScale to modify (in the MissileLauncher module) are:\u003C/p\u003E\u003Cp\u003EblastRadius\u003C/p\u003E\u003Cp\u003EblastPower\u003C/p\u003E\u003Cp\u003EexplosionSize\u003C/p\u003E\u003Cp\u003Ethrust\u003C/p\u003E\u003Cp\u003EcruiseThrust\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EexplosionSize \u003C/strong\u003Ewas a value that told the explosion which object to spawn and which sound to play. In one of the updates, it has been removed and replaced with a model path and audio clip path. The exception you\u0027re getting by telling TweakScale to attempt to modify it may be because it doesn\u0027t exist. The other values should be able to be modified on the fly with no problems.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-24T18:28:11Z\u0022 title=\u002204/24/2015 06:28  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 24, 2015\u003C/time\u003E by BahamutoD\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JellyCubes","CreatedById":11002,"CreatedDateTime":"2015-04-24T19:30:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LORDPrometheus\u0022 data-cite=\u0022LORDPrometheus\u0022\u003E\u003Cdiv\u003EGo back a few pages and you can find a post I made about the Energy equivalency of the blast definitions in this mod and how its very very difficult to create accurate large scale bombs in KSP. I did make a mistake since I did my math based off of a 1/3rd reduction due to blast radius instead of a 1/9th (stupid inverse square law lol) but the point is still valid\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think it\u0027s that accurate to try to compare 250 lbs bombs with nuclear weapons. For smaller bombs, most of the damage may be caused by shrapnel rather than overpressure.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.cdc.gov/niosh/docket/archive/pdfs/NIOSH-125/125-ExplosionsandRefugeChambers.pdf\u0022 rel=\u0022external nofollow\u0022\u003EThis document\u003C/a\u003E states \u0022injuries are universal, fatalities are widespread\u0022 at a peak overpressure of 5 psi. \u003Ca href=\u0022http://www.ordtech-industries.com/2products/Bomb_General/Mk82/Mk82.html\u0022 rel=\u0022external nofollow\u0022\u003EA Mk82 bomb\u003C/a\u003E creates an overpressure of 5 psi at only 31 metres. Only half the reported lethal radius of 60 metres.\u003C/p\u003E\u003Cp\u003EAccording to \u003Ca href=\u0022http://nuclearweaponarchive.org/Nwfaq/Nfaq5.html\u0022 rel=\u0022external nofollow\u0022\u003EEffects of Nuclear Explosions\u003C/a\u003E, blast overpressure follows the inverse cube law. Doubling the yield of a bomb will only multiply the blast wave distance by 2^(1/3) = 1.26.\u003C/p\u003E\u003Cp\u003EA Mk82 bomb contains 87 kg of tritonal. Tritonal is ~1.2 times more powerful than TNT so the equivalent TNT yield is 104.4 kg. Dividing the yield of a one kiloton bomb by the yield of the Mk82 gives 9,578 (1,000 / 0.1044). So a 1 kT bomb has a yield 9,578 times greater than a Mk82. Taking the cubed root of that gives 21.24. Multiplying that by the (worst case) lethal radius of 60 metres gives a blast radius of a 1 kT bomb of 60 m Ãƒâ€” 21.24 = 1,274 m.\u003C/p\u003E\u003Cp\u003EThe \u003Cem\u003EEffects of Nuclear Explosions\u003C/em\u003E states that a good rule of thumb is to consider everybody inside a 5 psi radius to be a fatality. Using \u003Ca href=\u0022http://nuclearsecrecy.com/nukemap/\u0022 rel=\u0022external nofollow\u0022\u003ENukemap\u003C/a\u003E, a 1 kT bomb has a 5 psi overpressure radius of 700 m. Our 1,274 m radius estimate was only off by roughly a factor of two. Using the stated 5 psi radius of 31 metres would give us a radius 658 metres. Which is surprisingly close to 700 m.\u003C/p\u003E\u003Cp\u003EThe site also gives a formula to estimate blast radius: radius of blast in km = (yield in kT)^(0.33) * constant, where the constant is 0.71 for a 5 psi overpressure.\u003C/p\u003E\u003Cp\u003EOn a completely unrelated note, using the Hullcam VDS plugin, it is possible to attach the camera to a turret and view where it\u0027s pointing.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/4WhBW\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThe mouse can be used to rotate the turret but it works sort of like a mousejoy. Moving the mouse away from the centre of the screen will cause the turret to rotate indefinitely.\u003C/p\u003E\n"},{"CreatedByName":"AccidentalDisassembly","CreatedById":110936,"CreatedDateTime":"2015-04-24T22:36:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003EYes the density of the ammo resource includes the mass of the casing with propellant. The bullet mass in the weapon config only includes projectile mass.\u003Cp\u003E\u003Cstrong\u003EexplosionSize \u003C/strong\u003Ewas a value that told the explosion which object to spawn and which sound to play. In one of the updates, it has been removed and replaced with a model path and audio clip path. The exception you\u0027re getting by telling TweakScale to attempt to modify it may be because it doesn\u0027t exist. The other values should be able to be modified on the fly with no problems.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmmm... I also tried a TWEAKSCALEEXPONENTS {} for only blastRadius and blastPower, but that caused the same problems. I wondered if I\u0027ve got some weird franken-folder going on with old parts - but the latest release of BDArmory\u0027s mk82 bomb config looks like this, with explosionSize still in there:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E name = MissileLauncher\u003C/p\u003E\u003Cp\u003E thrust = 0 //KN thrust during boost phase\u003C/p\u003E\u003Cp\u003E cruiseThrust = 0 //thrust during cruise phase\u003C/p\u003E\u003Cp\u003E dropTime = 3 //how many seconds after release until engine ignites\u003C/p\u003E\u003Cp\u003E boostTime = 2.2 //seconds of boost phase\u003C/p\u003E\u003Cp\u003E cruiseTime = 80 //seconds of cruise phase\u003C/p\u003E\u003Cp\u003E guidanceActive = false //missile has guidanceActive\u003C/p\u003E\u003Cp\u003E blastRadius = 40 //meters\u003C/p\u003E\u003Cp\u003E blastPower = 25\u003C/p\u003E\u003Cp\u003E maxTurnRateDPS = 20 //degrees per second\u003C/p\u003E\u003Cp\u003E explosionSize = 2\u003C/p\u003E\u003Cp\u003E explModelPath = BDArmory/Models/explosion/explosionLarge\u003C/p\u003E\u003Cp\u003E explSoundPath = BDArmory/Sounds/explode1\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo that might explain some of it (some other parts I think don\u0027t have explosionSize defined?), but I don\u0027t know why it would mess up with just blastRadius and blastPower given to TweakScale to modify, unless maybe changing some other aspect of the part (mass? attach stuff? something else that TweakScale modifies?) just doesn\u0027t work with weapons, maybe?\u003C/p\u003E\u003Cp\u003EWhat I mean by that is that it *seemed* that maybe the mere application of a TweakScale module would make bombs and such break - so maybe something entirely unrelated to the actual MissileLauncher module is causing the problem.... dunno.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-24T22:40:18Z\u0022 title=\u002204/24/2015 10:40  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 24, 2015\u003C/time\u003E by AccidentalDisassembly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2015-04-24T22:47:35Z","Content":"\n\u003Cp\u003EI forgot to remove explosionSize from some of the configs but they\u0027re harmless there. I\u0027ve never written or looked at a TweakScale config so I can\u0027t help you beyond that :/\u003C/p\u003E\u003Cp\u003EBy the way, I read all the requests, but I don\u0027t have time for \u003Cem\u003Eall\u003C/em\u003E of them. I\u0027m going to be spending a good amount of time on BDArmory and my other KSP mods once 1.0 comes out though, so maybe you\u0027ll see some of them in the next update. (Just don\u0027t want you to think I\u0027m ignoring you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-24T22:50:26Z\u0022 title=\u002204/24/2015 10:50  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 24, 2015\u003C/time\u003E by BahamutoD\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-04-24T23:07:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003EBy the way, I read all the requests, but I don\u0027t have time for \u003Cem\u003Eall\u003C/em\u003E of them. I\u0027m going to be spending a good amount of time on BDArmory and my other KSP mods once 1.0 comes out though, so maybe you\u0027ll see some of them in the next update. (Just don\u0027t want you to think I\u0027m ignoring you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you need models made, give me a shout. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CrayzeeMonkey","CreatedById":77712,"CreatedDateTime":"2015-04-26T02:05:06Z","Content":"\n\u003Cp\u003EHello!\u003C/p\u003E\u003Cp\u003EI got distracted from what i was doing and decided to make a small bomb just for fun. I also took your source code and edited it in Visual Studio to modify your bomb\u0027s decouple force limit from 5 to 100, i then built it then used it for my own use in my KSP copy (It\u0027s REALLY easy to do it yourself).\u003C/p\u003E\u003Cp\u003EThe little bomb i\u0027m making is to test a little idea i had of indirect fire. Basically, my bomb would be launched (with the increased decouple speed) over buildings like a mortar and land on targets with the aid of your (EXCELLENT) bomb sight.\u003C/p\u003E\u003Cp\u003EUsing the \u0022Decouple Direction\u0022 setting shoots my bomb at different directions than what i would expect. For example, if i use \u0022Forward\u0022 my bomb would go sideways. \u0022Lateral\u0022 would make it shoot straight, which is what i want. But i\u0027d like to know at what axes the force is applied to so that i could get my part to shoot straight up while using the Forward setting.\u003C/p\u003E\u003Cp\u003ESorry for being not straightforward, i just wanted to tell you about what i was doing with the .dll so that i could give you some idea for a future update.\u003C/p\u003E\u003Cp\u003EHave an excellent day to you all!\u003C/p\u003E\u003Cp\u003EEDIT: When i try to use my bombs the aiming pipper doesn\u0027t show up, is there something i have to do to set up my part to use the bomb pipper?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-26T02:07:36Z\u0022 title=\u002204/26/2015 02:07  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 26, 2015\u003C/time\u003E by CrayzeeMonkey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2015-04-26T02:19:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sumghai\u0022 data-cite=\u0022sumghai\u0022\u003E\u003Cdiv\u003EIf you need models made, give me a shout. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, man! I\u0027ll let yo know. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrayzeeMonkey\u0022 data-cite=\u0022CrayzeeMonkey\u0022\u003E\u003Cdiv\u003EHello!\u003Cp\u003EI got distracted from what i was doing and decided to make a small bomb just for fun. I also took your source code and edited it in Visual Studio to modify your bomb\u0027s decouple force limit from 5 to 100, i then built it then used it for my own use in my KSP copy (It\u0027s REALLY easy to do it yourself).\u003C/p\u003E\u003Cp\u003EThe little bomb i\u0027m making is to test a little idea i had of indirect fire. Basically, my bomb would be launched (with the increased decouple speed) over buildings like a mortar and land on targets with the aid of your (EXCELLENT) bomb sight.\u003C/p\u003E\u003Cp\u003EUsing the \u0022Decouple Direction\u0022 setting shoots my bomb at different directions than what i would expect. For example, if i use \u0022Forward\u0022 my bomb would go sideways. \u0022Lateral\u0022 would make it shoot straight, which is what i want. But i\u0027d like to know at what axes the force is applied to so that i could get my part to shoot straight up while using the Forward setting.\u003C/p\u003E\u003Cp\u003ESorry for being not straightforward, i just wanted to tell you about what i was doing with the .dll so that i could give you some idea for a future update.\u003C/p\u003E\u003Cp\u003EHave an excellent day to you all!\u003C/p\u003E\u003Cp\u003EEDIT: When i try to use my bombs the aiming pipper doesn\u0027t show up, is there something i have to do to set up my part to use the bomb pipper?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInteresting idea. For the decouple direction, lateral is -Y (because bombs and missiles are attached from the top) and forward is Z. So make sure the bomb model is pointing in the Z direction (blue arrow) and the attach point is on the top.\u003C/p\u003E\u003Cp\u003EAs for the pipper not showing up, I haven\u0027t tried what you\u0027re describing so I don\u0027t know specifically, but try turning on \u0027debug lines\u0027 in the options and see if the simulation is even happening. If there\u0027s no purple line then the criteria for it to show up are not being met. See link\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/BahamutoD/BDArmory/blob/master/BahaTurret/MissileFire.cs#L756\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/BahamutoD/BDArmory/blob/master/BahaTurret/MissileFire.cs#L756\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit: first guess is you need to put \u0022Bomb\u0022 in the part title.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-26T02:21:08Z\u0022 title=\u002204/26/2015 02:21  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 26, 2015\u003C/time\u003E by BahamutoD\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Colonel Cbplayer","CreatedById":102399,"CreatedDateTime":"2015-04-26T03:03:01Z","Content":"\n\u003Cp\u003EIs there any way to give missile guidance to stock parts?\u003C/p\u003E\u003Cp\u003ESAS and mechjeb chase mode isn\u0027t up to the task\u003C/p\u003E\n"},{"CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2015-04-26T03:06:03Z","Content":"\n\u003Cp\u003ENot currently. This may change.\u003C/p\u003E\n"},{"CreatedByName":"MaggotKing","CreatedById":141421,"CreatedDateTime":"2015-04-26T04:30:57Z","Content":"\n\u003Cp\u003EWould it be possible to add warheads that you can attach to a vehicle so they would detonate on impact or detonate when triggered by something else. It would be like a ammo box but explosive.\u003C/p\u003E\n"},{"CreatedByName":"CrayzeeMonkey","CreatedById":77712,"CreatedDateTime":"2015-04-26T15:43:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MaggotKing\u0022 data-cite=\u0022MaggotKing\u0022\u003E\u003Cdiv\u003EWould it be possible to add warheads that you can attach to a vehicle so they would detonate on impact or detonate when triggered by something else. It would be like a ammo box but explosive.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes you could. Bahamuto mentioned a \u0022warhead\u0022 part module he didn\u0027t really make a part for. You would have to do some work to add this \u0022warhead\u0022 though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAbout warheads, there\u0027s a partmodule already in there called \u0022BDExplosivePart\u0022. None of the included parts use it, but you can add it to parts that you want to be explosive when destroyed. Try this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E    name = BDExplosivePart\u003Cbr\u003E\u003Cbr\u003E    blastRadius = 50\u003Cbr\u003E    blastPower = 25\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDO NOT enable Proxy Detonate on the part in-game. It was an unfinished feature and may throw exceptions if used. (Actually I don\u0027t think it will throw exceptions, but it just doesn\u0027t do anything at the moment)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt just detonates on impact currently according to Bahamuto.\u003C/p\u003E\u003Cp\u003EThe simplest way you could get this into KSP is to do some .cfg file editing. Just run your favorite text editor (I recommend Notepad\u002B\u002B ) and open the .cfg file of the part you want to make explosive. Then paste the code BEFORE the last squiggly bracket. Save and your edited part should go boom and do some damage. If you want both the unexplosive and explosive variants of your part, just copy said .cfg file and paste it in the same directory where the .cfg file of the part you\u0027re editing is stored, and then open your copy of the .cfg file and paste the code BEFORE the last squiggly bracket (This is VERY important).\u003C/p\u003E\n"},{"CreatedByName":"Angelo Kerman","CreatedById":106975,"CreatedDateTime":"2015-04-26T15:49:47Z","Content":"\n\u003Cp\u003EI watched DasValdez play with this mod the other day and holy moly it looked fun! I think it would be fun to combine it with kOS and the new 22.5km physics limit to create battle bots.. Kind of like that old RobotWars video game.\u003C/p\u003E\n"},{"CreatedByName":"CrayzeeMonkey","CreatedById":77712,"CreatedDateTime":"2015-04-26T17:21:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003EAs for the pipper not showing up, I haven\u0027t tried what you\u0027re describing so I don\u0027t know specifically, but try turning on \u0027debug lines\u0027 in the options and see if the simulation is even happening. If there\u0027s no purple line then the criteria for it to show up are not being met. See link\u003Cp\u003E\u003Ca href=\u0022https://github.com/BahamutoD/BDArmor...leFire.cs#L756\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/BahamutoD/BDArmor...leFire.cs#L756\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit: first guess is you need to put \u0022Bomb\u0022 in the part title.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks Bahamuto! I got the pipper working.\u003C/p\u003E\u003Cp\u003EI tried at first to add a new condition for my part to work, unfortunately it seemed to break the pipper altogether, even on the Mk82 bombs. I gave up and put \u0022Bomb\u0022 in my part.\u003C/p\u003E\u003Cp\u003EGo indirect fire!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/s2CrS\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"}]}