{"TopicId":76926,"ForumId":36,"TopicTitle":"[1.1] BDArmory v0.11.0.1 (\u002Bcompatibility, fixes) - Apr 23","CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2014-07-08T00:44:17Z","PageNum":206,"Articles":[{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-08-29T17:44:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sashan\u0022 data-cite=\u0022sashan\u0022\u003E\u003Cdiv\u003EWhat he wants to do is this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/aivaObs.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/aivaObs.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou can also see the solution for surface mounted radar, on the belly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOMG this is so cool! I\u0027m going to \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Esteal\u003C/span\u003E base on your design, when making my plane.\u003C/p\u003E\n"},{"CreatedByName":"Yski","CreatedById":119366,"CreatedDateTime":"2015-08-29T17:48:57Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EI am really interested on giving the AI the ability to use multiple weapons at the same time, or switch between them depending on the situation.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not too fond of the way the AI chooses weapons at the moment either. It might work well with small vessels with only one or two weapon types, but what about larger ships with half a dozen different weapons? I\u0027d rather be firing every weapon that\u0027s within range than try to pick just one like the AI currently does. Bonus points for having every individual turret acting independently - there\u0027s no need to focus every weapon on that incoming missile when you could spend that extra fire power blowing up something else.\u003C/p\u003E\u003Cp\u003EI can see why the weapon manager works the way it does, considering it\u0027s made primarily for small planes, but it\u0027s not how I\u0027d do things. I\u0027m kind of tempted to just make my own custom guard mode, though at the rate the AI is being updated I\u0027m not sure if I want to be trying to keep my own version up to date.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-29T17:55:35Z\u0022 title=\u002208/29/2015 05:55  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 29, 2015\u003C/time\u003E by Yski\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aerolfos","CreatedById":93635,"CreatedDateTime":"2015-08-29T18:18:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003EHow would that work? You can\u0027t see anything on the ground from orbit.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA KSP upgrade might make a loading range of 70\u002B km possible? Anyway, he means to target the ground via the designated GPS coordinates, and magically knowing where targets are because of KSP tracking station, which is RIDICULOUSLY overpowered for this sort of warfare. Knowing EXACT numbers, and positions of EVERYTHING that might possibly exist anywhere? You even get to know their classification, depending on the player (Naming Flak \u0022Flak Turret 1\u0022 helps a lot eh) And somebody is smart enough to put non-descriptive names? Well, you can control their stuff anyway! So you can get a detailed view of every single part on every craft posted at a base with some camerawork and selecting them. This is easiest to ban privately and necessary, but there are always cheaters. If they don\u0027t outright disable your guard modes, they know all there is there.\u003C/p\u003E\u003Cp\u003EMost people suggesting the satellite stuff completely ignore this though, and that you would need to balance that.\u003C/p\u003E\u003Cp\u003EAnyway, enough rant on that, now for actual stuff: Everything is looking awesome, but I would really, really want some explosive machine gun... the millennium is nice, but it\u0027s not very useful for say a flakvierling or one of the modern dual barrel AA infantry carrier things. Really, being able to have a weaker but fully automatic weapon that is explosive to use like the howitzer. The radial vulcan is really the only thing to use on a tank like that as far as I know, but that is not very effective at all. Well, theres the GAU but it is fairly inaccurate and very hard to aim with because it doesn\u0027t move you know.\u003C/p\u003E\u003Cp\u003EAnd yes, we need more teams. Three way war is quite impossible right now..\u003C/p\u003E\u003Cp\u003EAlso, I approve of the system for choosing guns mentioned earlier, with ranges and the \u0022all ranges\u0022 setting.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-29T20:10:48Z\u0022 title=\u002208/29/2015 08:10  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 29, 2015\u003C/time\u003E by Aerolfos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CondorLead","CreatedById":150335,"CreatedDateTime":"2015-08-29T19:27:20Z","Content":"\n\u003Cp\u003EThanks for the images @Nickvr628 and @Sashan, along with the AI control option I mentioned, these could open up a few opportunities for some pretty intriguing designs. Another possible feature, and likely a rather simple one, would be select-able tracer colors, that way you could set different colors to different teams or vehicles using sliders like what are on the stock lights. One issue that might prevent this is if the actual projectiles are set models, without the ability to change, but it would be a nice touch if possible.\u003C/p\u003E\n"},{"CreatedByName":"sashan","CreatedById":98897,"CreatedDateTime":"2015-08-29T19:34:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bartekkru99\u0022 data-cite=\u0022bartekkru99\u0022\u003E\u003Cdiv\u003EOMG this is so cool! I\u0027m going to \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Esteal\u003C/span\u003E base on your design, when making my plane.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s actually a plane that came with the old OPT spaceplane cockpit, later made in a separate mod. I\u0027ve modified it heavily to use Baha\u0027s landing gears and fly wit FAR. It is a very good flyer, and can carry a lot of load. \u003C/p\u003E\u003Cp\u003EAs for Vulcan - it is sticking out of radial intake from Ven\u0027s stock revamp. It is also mounted upside down. \u003C/p\u003E\u003Cp\u003EHere\u0027s the craft file. Obviously, requires mods listed above and North Kerbin Weaponry. And (maybe?) the cannon shell box found somewhere in this thread.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/j875ag8g8jz9akb/Bumble%20B730%20%28RATOL%29.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/j875ag8g8jz9akb/Bumble%20B730%20%28RATOL%29.craft?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECredit goes to OPT author, LeonK I think?\u003C/p\u003E\n"},{"CreatedByName":"CondorLead","CreatedById":150335,"CreatedDateTime":"2015-08-29T19:55:44Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aerolfos\u0022 data-cite=\u0022Aerolfos\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EA KSP upgrade might make a loading range of 70\u002B km possible? Anyway, he means to target the ground via the designated GPS coordinates, and magically knowing where targets are because of KSP tracking station...\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003ESorry about the confusion with this, in the military, when an aircraft is circling a single point, it is referred to as an orbit. I completely agree, \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EOrbital \u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003Estrike capabilities would be extremely over powered, and impossible due to the ksp rendering system. Basically, the aircraft would ascend to a specified altitude, for the IRL AC-130 Spectre and other variants, this altitude is anywhere from 1500 to 6000 feet, and it would cruise to the target location, or simply stay in a holding pattern until support is request from the ground and approved at command. Then, it approaches adjacent to the target zone, and begins to circle the target, with the target always being within the gunners\u0027 FOV, AKA Orbiting. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EAs to this... \u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aerolfos\u0022 data-cite=\u0022Aerolfos\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E \u003C/span\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EThe radial vulcan is really the only thing to use on a tank like that as far as I know, but that is not very effective at all. Well, theres the GAU but it is fairly inaccurate and very hard to aim with because it doesn\u0027t move you know. \u003C/span\u003E\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EThe current version of the mod actually already includes a 7 barrel 30mm anti air turret, the Goalkeeper CIWS. It is fully mouse controllable and I also have one outside my space center linked with a TWS Locking Radar. You are right about one thing though, there is no \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Espace efficient\u003C/span\u003E turret of a similar nature that would be fitting on an armored vehicle, such as the \u003Cspan style=\u0022color:#333333;\u0022\u003EGAU-12/U 25mm Gatling gun turrets found on the USMC LAV-AD, manufactured by general dynamics. Most images of it have pretty high exposure and aren\u0027t very good quality, as the last delivery of 90 vehicles was made in 1999, back when most cameras such as those used by the military for things like this weren\u0027t exactly hd, but I found a good illustration here that has better exposure and includes the important details.\u003C/span\u003E\u003Cimg src=\u0022http://acemodel.com.ua/pages/models/72406/lav_ad.jpg\u0022 alt=\u0022lav_ad.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-29T20:47:47Z\u0022 title=\u002208/29/2015 08:47  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 29, 2015\u003C/time\u003E by CondorLead\u003C/strong\u003E\n\u003Cbr\u003EGrammar ....-ing myself\n\u003C/span\u003E\n"},{"CreatedByName":"Aerolfos","CreatedById":93635,"CreatedDateTime":"2015-08-29T20:17:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CondorLead\u0022 data-cite=\u0022CondorLead\u0022\u003E\u003Cdiv\u003EThanks for the images @Nickvr628 and @Sashan, along with the AI control option I mentioned, these could open up a few opportunities for some pretty intriguing designs. Another possible feature, and likely a rather simple one, would be select-able tracer colors, that way you could set different colors to different teams or vehicles using sliders like what are on the stock lights. One issue that might prevent this is if the actual projectiles are set models, without the ability to change, but it would be a nice touch if possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can change them in the config easily, so shouldn\u0027t be an issue. Of course, changing it needs reloading the game but if you do that in between changes you can have the same craft make different color tracers as far as I know. \u003C/p\u003E\u003Cp\u003EMuzzle flashes need a color tool to change the image itself though, but that is only useful for lasers, right?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-08-29T21:05:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003EI just tested with the same setup you described, and the AI are engaging each other just fine. There must be some other detail you\u0027re missing. Please run the attempt again with \u0027Draw Debug Labels\u0027 enabled in the settings menu, and post your output log.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERoger that.\u003C/p\u003E\n"},{"CreatedByName":"Admiral-Helwyr","CreatedById":139347,"CreatedDateTime":"2015-08-29T21:36:31Z","Content":"\n\u003Cp\u003EI have a question Is there a ETA on the turret tutorial?\u003C/p\u003E\u003Cp\u003EI\u0027ve been putting off a Sci Fi weapons pack until I have the New tutorial.\u003C/p\u003E\u003Cp\u003EP.S Awesome work on all the targeting variants and Updates BD \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Coga19000","CreatedById":125394,"CreatedDateTime":"2015-08-29T22:14:05Z","Content":"\n\u003Cp\u003EEven though I haven\u0027t been able to play KSP lately, let alone download the latest version of BD Armory,but let me tell you that the new features have unpressed me deeply. I do have some questions, though :\u003C/p\u003E\u003Cp\u003E1) Is this mod or scheduled to be -RPM compatible? I would love to control my radars from the cockpit, and it would give the RWR some more use. \u003C/p\u003E\u003Cp\u003E2) Speaking of the RWR, I can only assume it can only detect radar-guided missiles. Is there any way to detect heat -guided missiles? (Without looking at them, of course \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003E3) Do you plan to include more space based weaponry? This is a space simulator, after all. \u003C/p\u003E\u003Cp\u003E3a) If yes, how do you plan to make radar work in vacuum? Is it going to work the same way it does in the atmoshpere? \u003C/p\u003E\u003Cp\u003E4) This is actually more of a suggestion, if I may. I noticed that the debug menu lets the radar get low -res pictures of the targeted craft. Is it possible to include it officially in the mod, if there is a realistic way of doing so? \u003C/p\u003E\u003Cp\u003E5) Also a suggestion. Technically speaking, how hard would it be to include the option to only enable GPS Guidance if a satellite with a certain instrument on it is connected? \u003C/p\u003E\u003Cp\u003E6)This question would probably be answered by playing the game, but since I can\u0027t, how have the new targeting mechanics affected cruise missiles? How are those fired and guided?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-08-29T22:18:19Z","Content":"\n\u003Cp\u003EOkay, I did as you asked but couldn\u0027t seem to find any sort of log to post.\u003C/p\u003E\u003Cp\u003EI recorded a video to display the problem, but while I was editing it together I actually spotted what my problem is:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EWhen I use Hyperedit to land a plane in it\u0027s scramble position, the BD Armory debug screen shows the craft is no longer loaded.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWhich means, after hyperedit has landed the plane, BD Armory no longer knows it exists, so it can\u0027t target other craft.\u003C/p\u003E\u003Cp\u003EI\u0027ve got a quick 45 second video showing what has happened. Stand By.\u003C/p\u003E\n"},{"CreatedByName":"DragonSlayer666","CreatedById":85239,"CreatedDateTime":"2015-08-29T22:20:57Z","Content":"\n\u003Cp\u003EHi guys,\u003C/p\u003E\u003Cp\u003EI hope you guys can help me. There used to be a link in the OP for an add-on to this awesome mod. This add-on added, among others, a semi-auto naval cannon. Like those seen on destroyers. However i can not find which add-on mod this was. Can someone give me a link?\u003C/p\u003E\u003Cp\u003EThx\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-08-29T22:22:07Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/yslK6T1FY9o\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/yslK6T1FY9o\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2015-08-29T22:38:08Z","Content":"\n\u003Cp\u003EI have to agree with the annoyance at the lack of in-hangar tweakable guard mode. Ones I had adjusted in the previous version work as they should, but I am unable to adjust them in the current version until launch. Reasonably, an individual should be able to see another plane from about 5km away, but 3.5km to understand it\u0027s a target also seems somewhat reasonable. Perhaps an investigatory stage might be warranted, so that if a plane is within 5km or so, the plan would investigate, rather than continuing its loop.\u003C/p\u003E\u003Cp\u003EI suggest this, because I\u0027ve been having an issue with launching planes with them seeing each other as targets, and yet proceeding to ignore that after they have launched because they\u0027re out of \u0022visual distance\u0022 by the time they reach altitude, and both happen to circle in directions not conducive to seeing each other again.\u003C/p\u003E\n"},{"CreatedByName":"FungusForge","CreatedById":148313,"CreatedDateTime":"2015-08-29T23:02:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DragonSlayer666\u0022 data-cite=\u0022DragonSlayer666\u0022\u003E\u003Cdiv\u003EHi guys,\u003Cp\u003EI hope you guys can help me. There used to be a link in the OP for an add-on to this awesome mod. This add-on added, among others, a semi-auto naval cannon. Like those seen on destroyers. However i can not find which add-on mod this was. Can someone give me a link?\u003C/p\u003E\u003Cp\u003EThx\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know for sure, but I think Baha took all the add-ons that weren\u0027t updated to v0.9.0 off the OP since the update did funky things to turret and missile stuff (making all those outdated parts buggy paper weights).\u003C/p\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2015-08-30T06:07:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003EPS I saw this video posted on reddit today - it\u0027s the highest quality video of live fire of many of the weapons used in BDArmory I\u0027ve seen yet. You may find it interesting. It even has the smoke countermeasures I added recently and based off photos since there weren\u0027t any good videos. I was pretty close!\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/XVXQlkpaC5k?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHooray for the fart cannon!!! XD\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-08-30T08:54:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Coga19000\u0022 data-cite=\u0022Coga19000\u0022\u003E\u003Cdiv\u003EEven though I haven\u0027t been able to play KSP lately, let alone download the latest version of BD Armory,but let me tell you that the new features have unpressed me deeply. I do have some questions, though :\u003Cp\u003E1) Is this mod or scheduled to be -RPM compatible? I would love to control my radars from the cockpit, and it would give the RWR some more use. \u003C/p\u003E\u003Cp\u003E2) Speaking of the RWR, I can only assume it can only detect radar-guided missiles. Is there any way to detect heat -guided missiles? (Without looking at them, of course \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003E3) Do you plan to include more space based weaponry? This is a space simulator, after all. \u003C/p\u003E\u003Cp\u003E3a) If yes, how do you plan to make radar work in vacuum? Is it going to work the same way it does in the atmoshpere? \u003C/p\u003E\u003Cp\u003E4) This is actually more of a suggestion, if I may. I noticed that the debug menu lets the radar get low -res pictures of the targeted craft. Is it possible to include it officially in the mod, if there is a realistic way of doing so? \u003C/p\u003E\u003Cp\u003E5) Also a suggestion. Technically speaking, how hard would it be to include the option to only enable GPS Guidance if a satellite with a certain instrument on it is connected? \u003C/p\u003E\u003Cp\u003E6)This question would probably be answered by playing the game, but since I can\u0027t, how have the new targeting mechanics affected cruise missiles? How are those fired and guided?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. I think, that he plans on adding support for RPM, but for now he has more important things to like the AI improvements.\u003C/p\u003E\u003Cp\u003E3. Same as above, and I think, that radar already works in space, there\u0027s no reason for it to not work.\u003C/p\u003E\u003Cp\u003E5. I think he was talking about it some time ago, but I\u0027m sure.\u003C/p\u003E\u003Cp\u003E6. They are GPS guided\u003C/p\u003E\n"},{"CreatedByName":"Yski","CreatedById":119366,"CreatedDateTime":"2015-08-30T09:54:36Z","Content":"\n\u003Cp\u003EHEKVs are giving null reference exceptions with the latest version, the culprit seems to be the legacyTargetVessel in DoRCS(). Just firing a HEKV should reproduce it, manually or with guard mode, with or without legacy targeting. I\u0027ll see if I have the time to look into it at some point, but I figured it best to report it in the meanwhile.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ENullReferenceException: Object reference not set to an instance of an object  at BahaTurret.MissileLauncher.DoRCS () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at BahaTurret.MissileLauncher.OnFixedUpdate () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at Part.ModulesOnFixedUpdate () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at Part.FixedUpdate () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt also appears there\u0027s a copy-paste error in HEKV\u0027s config file, homingType gets set twice. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E  name = MissileLauncher\u003Cbr\u003E\u003Cbr\u003E  thrust = 10 //KN thrust during boost phase\u003Cbr\u003E  cruiseThrust = 0 //thrust during cruise phase\u003Cbr\u003E  dropTime = 0.1 //how many seconds after release until engine ignites\u003Cbr\u003E  boostTime = 3.8 //seconds of boost phase\u003Cbr\u003E  cruiseTime = 25 //seconds of cruise phase\u003Cbr\u003E  guidanceActive = true //missile has guidanceActive\u003Cbr\u003E  blastRadius = 25 //meters\u003Cbr\u003E  blastPower = 16\u003Cbr\u003E  maxTurnRateDPS = 17 //degrees per second\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E  hasRCS = true\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E  audioClipPath = BDArmory/Sounds/rocketLoop\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E[B]  homingType = RCS[/B]\u003Cbr\u003E\u003Cbr\u003E  missileType = missile\u003Cbr\u003E[B]  homingType = aam[/B]\u003Cbr\u003E  targetingType = radar\u003Cbr\u003E  activeRadarRange = 6000\u003Cbr\u003E  maxOffBoresight = 50\u003Cbr\u003E  lockedSensorFOV = 5\u003Cbr\u003E\u003Cbr\u003E  radarLOAL = true\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-30T10:10:43Z\u0022 title=\u002208/30/2015 10:10  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 30, 2015\u003C/time\u003E by Yski\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Atatra","CreatedById":122338,"CreatedDateTime":"2015-08-30T10:09:32Z","Content":"\n\u003Cp\u003Ehey BD, i had this idea last night while building custom turrets using Infernal robotics, and i got curious, do you think it would be theoretically possible to take aspects from BDA code and IR code to create IR joints which, when activated, track the mouse on one, two, or three axis like your turrets do? for example, maybe a standard \u0027docking washer\u0027 style joint, a pivot point that could be used for gun elevation, and maybe a ball joint for gun aiming like the system used for gun aiming on tank destroyers with casemates.\u003C/p\u003E\n"},{"CreatedByName":"Yski","CreatedById":119366,"CreatedDateTime":"2015-08-30T10:15:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atatra\u0022 data-cite=\u0022Atatra\u0022\u003E\u003Cdiv\u003Ehey BD, i had this idea last night while building custom turrets using Infernal robotics, and i got curious, do you think it would be theoretically possible to take aspects from BDA code and IR code to create IR joints which, when activated, track the mouse on one, two, or three axis like your turrets do? for example, maybe a standard \u0027docking washer\u0027 style joint, a pivot point that could be used for gun elevation, and maybe a ball joint for gun aiming like the system used for gun aiming on tank destroyers with casemates.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn a word, yes. The easiest way would probably be a small kOS script, it already has support for infernal robotics parts, so pointing something at a target with them shouldn\u0027t be too difficult.\u003C/p\u003E\n"},{"CreatedByName":"Atatra","CreatedById":122338,"CreatedDateTime":"2015-08-30T10:51:33Z","Content":"\n\u003Cp\u003Ewould something like this also allow for the tracking parts to be slaved to Targeting modules with the slave turret button, because that would make building custom turrets really interesting.\u003C/p\u003E\n"},{"CreatedByName":"sashan","CreatedById":98897,"CreatedDateTime":"2015-08-30T11:52:53Z","Content":"\n\u003Cp\u003EAs for smoke countermeasures - one of Russian mercenaries took this nice video recently:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/e_mr2qp-V28?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E(watch from 01:00)\u003C/p\u003E\u003Cp\u003EAt least RUssian systems worked that way, NATO ones may be different.\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-08-30T11:57:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atatra\u0022 data-cite=\u0022Atatra\u0022\u003E\u003Cdiv\u003Ehey BD, i had this idea last night while building custom turrets using Infernal robotics, and i got curious, do you think it would be theoretically possible to take aspects from BDA code and IR code to create IR joints which, when activated, track the mouse on one, two, or three axis like your turrets do? for example, maybe a standard \u0027docking washer\u0027 style joint, a pivot point that could be used for gun elevation, and maybe a ball joint for gun aiming like the system used for gun aiming on tank destroyers with casemates.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI already suggested it both there and on IR thread. Nobody really cared about it much.\u003C/p\u003E\n"},{"CreatedByName":"1valdis","CreatedById":148940,"CreatedDateTime":"2015-08-30T12:31:15Z","Content":"\n\u003Cp\u003EWill there be AI for ground vehicles such as tanks, ATCs...? I mean possibility of driving but not just standing on one place. Maybe by manually setted path.\u003C/p\u003E\u003Cp\u003EAlso, is there possibility of enhancement of view distance past 3,5 km? It is really small distance, sometimes I need manually let the vessels fly to each other. 10 times bigger would be nice xD\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-30T12:39:47Z\u0022 title=\u002208/30/2015 12:39  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 30, 2015\u003C/time\u003E by 1valdis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Atatra","CreatedById":122338,"CreatedDateTime":"2015-08-30T13:22:44Z","Content":"\n\u003Cp\u003Ethe BDA config file in the BDarmory directory lets you adjust load distance ingame, by default i think it\u0027s set to 5km (5000m in the file) and i find it works well setting it to around 30km(30000m in the config) this generally works, but as you can read in earlier parts of this thread, there\u0027s still a lot of problems with various loading distance mechanics.\u003C/p\u003E\n"}]}