{"TopicId":76932,"ForumId":24,"TopicTitle":"Jeb is stuck in the bottom of a crater on the Mun!","CreatedByName":"Shadowfest","CreatedById":114643,"CreatedDateTime":"2014-07-08T01:12:51Z","PageNum":1,"Articles":[{"CreatedByName":"Shadowfest","CreatedById":114643,"CreatedDateTime":"2014-07-08T01:12:51Z","Content":"\n\u003Cp\u003EHello! I\u0027m pretty new to KSP. Was steam gifted it by my brother-in-law and am now hopelessly addicted. After lots of studying and trial and error, I finally made my first successful landing on the Mun! However, my landing point could\u0027ve been better, as I landed (safely, at least) right on the side wall of a crater. I decided to go EVA and do some science, and poor Jeb slid over half a kilometer down the slope into the bottom of the crater. I spent about an hour trying and trying to get back up to my ship, but to no avail! He is stuck on the Mun! The frustrating part is that my ship which (hopefully) has enough fuel to return to Kerbin is within eyesight, sitting halfway up the crater wall.\u003C/p\u003E\u003Cp\u003EI feel obligated to rescue poor Jeb, what with him making a solo flight to the Mun and being my first Kerbonaut ever to set foot on another body besides Kerbin. It seems impossible to walk back up to the ship. Once the slope of the crater wall gets too steep, poor Jeb loses his footing and goes slip sliding back down again. Is there anything I can do to help poor Jeb, or is he doomed to hang out at the bottom of the crater, staring at his ship forever?\u003C/p\u003E\u003Cp\u003EThanks in advance for any help offered!\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2014-07-08T02:09:37Z","Content":"\n\u003Cp\u003EYou should be able to take off with the EVA maneuvering jets and fly to the ship. Just watch the landing, if you\u0027re too fast, he\u0027ll either bounce or ragdoll and roll back down the hill. If your lander had a probe core, you could take control of it and fly it down into the center of the crater.\u003C/p\u003E\u003Cp\u003EIt\u0027s generally a good idea to avoid landing on slopes. For one thing, it may lead to the LEM tipping over.\u003C/p\u003E\n"},{"CreatedByName":"Shadowfest","CreatedById":114643,"CreatedDateTime":"2014-07-08T10:40:33Z","Content":"\n\u003Cp\u003EHello, Capt. Hunt! Thanks for the advice! I tried using the EVA jets to fly him up the hill but found it very difficult to control. I\u0027m not sure if I am missing a fundamental concept about that, or if I just need more practice. I like the idea of using a probe core on the lander for just such emergencies, it would\u0027ve been useful this go around, for sure!\u003C/p\u003E\u003Cp\u003EI knew that I was heading for disaster when I realized I was coming in on a steep slope, but by the time I realized where I was going to land, it was too late. I am amazed that the lander stayed upright at all, to be honest. \u003C/p\u003E\u003Cp\u003ESo right now, it looks like I\u0027ve got two options. 1) Use the EVA jets to fly Jeb back up to the ship or 2) build a rescue ship and go get him!\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-07-08T12:55:13Z","Content":"\n\u003Cp\u003EFor Kerbal EVA, controls are WASD and W will move your in the direction your CAMERA is facing. Remember that on the Mun you have gravity but no air resistance so any speed you achieve forward will have to be cancelled by pushing backwards (A). Use small bursts over holding the buttons down. Hope this helps!\u003C/p\u003E\n"},{"CreatedByName":"Shadowfest","CreatedById":114643,"CreatedDateTime":"2014-07-09T12:10:24Z","Content":"\n\u003Cp\u003EWell I tried option 1, using the EVA jetpack to fly back to the ship. Pretty much nailed it finally, but then I bumped the ship, which, as before mentioned, was sitting precariously on a slope. Well, it tumbled all the way down the crater wall just like Jeb did and then exploded.\u003C/p\u003E\u003Cp\u003ESo I tried to create an unmanned probe with a pod on it for Jeb to climb in. I was orbiting the Mun, just about to do my retrograde burn to begin my descent to the surface when my battery packs died. So now that craft is a zombie, endlessly orbiting the Mun. I\u0027m doing career mode, and haven\u0027t accumulated enough science to get solar panels yet. Just 13 points to go now though, and hopefully I\u0027ll be able to get Jeb off of the Mun soon!\u003C/p\u003E\u003Cp\u003EI\u0027m coming for ya, buddy! Stay strong!\u003C/p\u003E\n"},{"CreatedByName":"mike9606","CreatedById":90275,"CreatedDateTime":"2014-07-10T01:47:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shadowfest\u0022 data-cite=\u0022Shadowfest\u0022\u003E\u003Cdiv\u003EWell I tried option 1, using the EVA jetpack to fly back to the ship. Pretty much nailed it finally, but then I bumped the ship, which, as before mentioned, was sitting precariously on a slope. Well, it tumbled all the way down the crater wall just like Jeb did and then exploded.\u003Cp\u003ESo I tried to create an unmanned probe with a pod on it for Jeb to climb in. I was orbiting the Mun, just about to do my retrograde burn to begin my descent to the surface when my battery packs died. So now that craft is a zombie, endlessly orbiting the Mun. I\u0027m doing career mode, and haven\u0027t accumulated enough science to get solar panels yet. Just 13 points to go now though, and hopefully I\u0027ll be able to get Jeb off of the Mun soon!\u003C/p\u003E\u003Cp\u003EI\u0027m coming for ya, buddy! Stay strong!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf the pod survived, you can refuel Jeb\u0027s jetpack, and if I remember correctly you can atleast get sub-orbital with the jetpack on the Mun, maybe even a very low orbit.\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-07-10T02:32:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shadowfest\u0022 data-cite=\u0022Shadowfest\u0022\u003E\u003Cdiv\u003EWell I tried option 1, using the EVA jetpack to fly back to the ship. Pretty much nailed it finally, but then I bumped the ship, which, as before mentioned, was sitting precariously on a slope. Well, it tumbled all the way down the crater wall just like Jeb did and then exploded.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis made me laugh because I have done the same thing many, many times. XD I laugh every time... you know, that hopeless laugh where you see everything falling apart but you aren\u0027t even mad because its hilarious.\u003C/p\u003E\n"}]}