{"TopicId":76962,"ForumId":44,"TopicTitle":"ESA builds helicopter dropship for Mars rovers","CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-08T10:21:56Z","PageNum":1,"Articles":[{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-08T10:21:56Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.esa.int/Our_Activities/Technology/Dropship_offers_safe_landings_for_Mars_rovers\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.esa.int/Our_Activities/Technology/Dropship_offers_safe_landings_for_Mars_rovers\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E8 months, 3 research centers, and ESA got working proof-of-concept helicopter dropship for a small Martian rovers, hehehe. I like how they used commercially available components - from quadcopter down to the SanDisc memory card \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E. Fancy sensors, clever AI, and they have a very nice sky crane.\u003C/p\u003E\u003Cp\u003EIt will be nice to see a first man-made helicopter on another planet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESeems like the guys making mods which add rotors and a capacity to build helis were up to something \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-07-08T10:36:26Z","Content":"\n\u003Cp\u003EThis is actually just for testing. On Mars, it\u0027ll most likely use Rockets like Curiositiy did.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-07-08T10:38:58Z","Content":"\n\u003Cp\u003Esome things:\u003C/p\u003E\u003Cp\u003Efirst off, you are going to need very big rotors, very high performance motors, or both in the thin atmosphere.\u003C/p\u003E\u003Cp\u003Esecond, you cant use off the shelf components if you want any kind of endurance. everything has to be rad hard.\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2014-07-08T10:50:24Z","Content":"\n\u003Cp\u003ESD cards have been around long enough that there\u0027s probably at least one manufacturer of them that makes a rad-hard model. It\u0027s probably a lower-capacity one, however, seeing as rad-hard stuff tends to be older tech, with larger transistors in the chip and additional error-correction circuitry added, along with some kind of radiation shielding. That\u0027s the \u0022how to\u0022 for rad-hardening electronics that I know of, anyways.\u003C/p\u003E\u003Cp\u003EYou might be able to order a rad-hardened pentium-4 off-the-shelf these days.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-07-08T11:03:35Z","Content":"\n\u003Cp\u003Ei think i would prefer to just solder flash memory packages right to the board. really what good is a socketed part on a space craft that will never be serviced by human hands. eliminate the weight of the socket entirely, and a point of failure as well. its ok for prototyping of course.\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2014-07-08T12:08:46Z","Content":"\n\u003Cp\u003EWell, there\u0027s the possibility that some green alien with a large head might want the science data...\u003C/p\u003E\u003Cp\u003EAll kidding aside, this quad-copter is almost certainly intended solely for working on lander control algorithms. As such it\u0027s being done cheaply by using off-the-shelf tech that can be easily reconfigured.\u003C/p\u003E\u003Cp\u003EAs much as I agree it would be cool to see a rover make a quad-copter assisted landing on Mars, the aerodynamics of such a thing simply don\u0027t make practical sense. Sure you \u0022can\u0022 do it, but the size of the quad-copter required would probably mean you could have sent two rovers landed Curiosity-style instead.\u003C/p\u003E\u003Cp\u003EOf course, that being said, I\u0027ve always wanted to see an electric motor-glider type probe get sent to another planet. Titan would be a great place for that kind of thing, but it\u0027s so far out that you would have to use RTGs to power it. Of course the thick atmosphere means that using RTG\u0027s to power a prop plane would actually work pretty darn well compared to trying that on Earth.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-08T14:47:55Z","Content":"\n\u003Cp\u003EI doubt ESA would build a proof of concept craft and fund further studies if it\u0027d think that it doesn\u0027t make a practical sense.\u003C/p\u003E\u003Cp\u003EBTW: Some people thought the same about harpooning into comets... which ESA is about to do this year.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Efirst off, you are going to need very big rotors, very high performance motors, or both in the thin atmosphere.\u003C/p\u003E\u003Cp\u003Esecond, you cant use off the shelf components if you want any kind of endurance. everything has to be rad hard.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E@1) depends on a weight and thrust they can generate. Getting high performance motors is not a problem. Size on the other hand - might be. But considering how small the lander is - it should be doable. ESA isn\u0027t trying to drop a new curiosity out there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E And major advantage of this system over dropping cargo with a rocket-powered crane is that you can precisely drop small cargo on a rough terrain without disturbing it much.\u003C/p\u003E\u003Cp\u003E@) It\u0027s a proof of concept craft. Not even a prototype. They won\u0027t be using SanDisc cards on a Martian dropship. I thought it\u0027s obvious....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-08T14:56:17Z\u0022 title=\u002207/08/2014 02:56  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 8, 2014\u003C/time\u003E by Sky_walker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-07-08T17:30:09Z","Content":"\n\u003Cp\u003EThe atmosphere of mars has about 1% of the density of earths atmosphere. This means that you would need 100 times more surface area and therefore far more than 100 times the weight to generate the same amount of lift as on earth. I doubt that this could ever be more effective than rockets.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-07-08T18:25:36Z","Content":"\n\u003Cp\u003EBut due to the thinner atmosphere, your rotors can also spin a lot faster.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-07-08T18:42:17Z","Content":"\n\u003Cp\u003ECould they construct a hybrid? As in a helicopter that uses small thrusters to stay in the air and for control purposes. That would be interesting.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-07-09T03:58:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R0cketC0der\u0022 data-cite=\u0022R0cketC0der\u0022\u003E\u003Cdiv\u003EThe atmosphere of mars has about 1% of the density of earths atmosphere. This means that you would need 100 times more surface area and therefore far more than 100 times the weight to generate the same amount of lift as on earth. I doubt that this could ever be more effective than rockets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, my take on this is that they are testing the system.\u003C/p\u003E\u003Cp\u003EThe objective here is for the lander to find a safe landing spot during decent, this is more critical for an small rover where a 20 cm rock could have it stuck. \u003C/p\u003E\u003Cp\u003EUsing an quadcopter is far cheaper and safer than something rocket powered. You are only testing software and control anyway. \u003C/p\u003E\u003Cp\u003EHow many mechjeb landings has been aborted because of landing zone?\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2014-07-10T17:27:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003ECould they construct a hybrid? As in a helicopter that uses small thrusters to stay in the air and for control purposes. That would be interesting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, you could, but if you have thrusters that can keep you airborne and control the craft, why would you need rotors?\u003C/p\u003E\n"}]}