{"TopicId":77075,"ForumId":44,"TopicTitle":"Creating spacecraft without petroleum products (especially for aliens)","CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-07-09T14:02:24Z","PageNum":1,"Articles":[{"CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-07-09T14:02:24Z","Content":"\n\u003Cp\u003EBack around the time the shuttle was retired, a couple of peak oilers and I had a discussion about the future of spaceflight. Their concern that scarce oil resources (i.e. ultra deepwater oil) and space age materials being petroleum based would make future civilizations unable to have access to space. Because 1) spaceflight as an enterprise is based on an industry and economy that needs cheap and plentiful energy and 2) Reaching remote sources of oil requires a lot of energy imput. It\u0027s like you\u0027re trying to mine platinum with a pickaxe. Oh, and they also mention the depletion of rare earth minerals.\u003C/p\u003E\u003Cp\u003EWe all know how petroleum products (i.e. plastics, composites, etc) are EVERYWHERE in our lives, but they are also critical for spaceflight. But I\u0027m wondering, how can spacecraft be constructed without petroleum products? Or, can such products be made from biological sources? I\u0027m sure there are some papers on this subject.\u003C/p\u003E\u003Cp\u003EThis is important for us humans, but I also see it applicable for alien civilizations. See, there could be intelligent species out there, but they could be among the first era of complex life on their planet, so they don\u0027t have reserves of fossil fuels to work with. Thus, they never leave their planet, and we never see them. Forever Farmer Grey.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-07-09T14:17:18Z","Content":"\n\u003Cp\u003EThere\u0027s no reason to believe spaceflight is fundamentally dependent on fossil fuels. Look at Delta IV; versions without solids have no large composite components, and the fuel is LOX/LH\u003Csub\u003E2\u003C/sub\u003E, which can be obtained through electrolysis.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-09T14:29:40Z\u0022 title=\u002207/09/2014 02:29  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 9, 2014\u003C/time\u003E by Kryten\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-07-09T14:22:47Z","Content":"\n\u003Cp\u003EWe can synthesize fuels and lubricants from all sorts of sources, we\u0027re not limited to oil.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-07-09T14:38:23Z","Content":"\n\u003Cp\u003EThe only obvious propellants made from petroleum that I know of is RP-1 (basically rocket-grade kerosene). Aside from LH2/LOX, there\u0027s hydrazine-based fuels (MMH, UDMH), liquid methane(or ethane/propane, or other light flammable gases), nitrogen tetroxide, hydrogen peroxide, nitric acid, and more. The spacecraft can be built out of metal alloys (or even pure metals) rather than oil-based polymers.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-07-09T14:39:58Z","Content":"\n\u003Cp\u003EWe can do almost everything using only air, rocks, water and electricity. The problem is that it\u0027s so much easier to extract the stuff from a source and then manipulate it.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2014-07-09T15:01:46Z","Content":"\n\u003Cp\u003EPeak oil has probably been reached, but the tail is longer and thicker than anyone expected. There are brute force methods for sticking carbon to hydrogen, so there will always be a means of last resort to produce feedstock for plastic, but biologically derived alternative materials seem more likely. I expect hydrocarbons will decline gradually enough that substitute materials and processes will have a smooth crossover. Nuclear and solar energy will stay available for our conceivable time horizons. In ultimate, civilization-scale analyses, money cancels out of the equation. The ultimate cost is everything brings you closer to \u003Ca href=\u0022http://physics.ucsd.edu/do-the-math/2011/07/galactic-scale-energy/\u0022 rel=\u0022external nofollow\u0022\u003Eboiling the oceans\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ERare earths are actually not rare at all. There\u0027s just a sloping cost to collecting them from the earth\u0027s crust, which combined with Chinese politics, limits the amount offered on the market in a given period of time. That sloping cost just means another very long, wide tail. Peak platinum, however, is here. The economic impact is happening to be masked by the decline of the automobile industry, its largest consumer. I expect other industrial and medical uses will be threatened within 100 years. Availability of helium will eventually become a problem for advanced technologies, as there is simply no anticipated replacement for very low temperature applications. We don\u0027t need to worry though until natural gas peaks, which is yet to happen.\u003C/p\u003E\u003Cp\u003EAs for what aliens on a planet without hydrocarbons might use for fuel: cyanogen is a great fuel, and ammonia is okay, though hindered by its high heat capacity. More generally, whatever the aliens eat must have some potential as a fuel.\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-07-10T03:08:32Z","Content":"\n\u003Cp\u003EPeak Oil was reached some time ago its why gas prices are where they are today: Cheap Oil Ended in 2008. All the good stuff is drying up and we had to argument with more and more \u0022unconventional\u0022 oil sources such as tar sands, fracking, deep sea wells, all of which have lower EROEI, thus higher price. Once we could get out 50 barrels of energy for ever 1 we put in, now we are doing around 5 barrels for every one we put in, as it gets worse and more expensive alternatives like solar and biofuels start looking better and better. Anyways we could make RP-1 from algea or from Thermal-cracking or what ever, the price tag on the fuel is still rather small.\u003C/p\u003E\n"},{"CreatedByName":"Cannon_Fodder","CreatedById":3443,"CreatedDateTime":"2014-07-10T04:18:22Z","Content":"\n\u003Cp\u003EYou can get Hydrocarbons from biological processes other then fossil fuels. Right now the US Navy is working on making jet fuel from sea water by splitting the Carbon off dissolved CO2 and combining it with hydrogen split from H2O.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-10T04:20:54Z\u0022 title=\u002207/10/2014 04:20  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 10, 2014\u003C/time\u003E by Cannon_Fodder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-07-10T12:08:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rhoark\u0022 data-cite=\u0022rhoark\u0022\u003E\u003Cdiv\u003ERare earths are actually not rare at all. There\u0027s just a sloping cost to collecting them from the earth\u0027s crust, which combined with Chinese politics, limits the amount offered on the market in a given period of time. That sloping cost just means another very long, wide tail. Peak platinum, however, is here. The economic impact is happening to be masked by the decline of the automobile industry, its largest consumer. I expect other industrial and medical uses will be threatened within 100 years.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInterestingly enough, although space development is limited by these resources, it could also be the solution. Already, there are at least two companies seriously competing to be the first asteroid mining ventures. It is estimated that even small asteroids could contain more platinum than has ever been mined in the history of planet Earth, and that\u0027s not counting the other constituents. Rare earths might also exist in useful amounts. These materials are plentiful on asteroids especially because they are small, whereas on Earth the heavy atoms tend to sink towards the liquid core over millions of years, leaving hardly any for us to mine in the outer crust.\u003C/p\u003E\u003Cp\u003EObviously it will take until the end of the decade at minimum for either of them to get anywhere in terms of serious prospecting and production, even if things go their way. But it\u0027s an interesting prospect. Space development is fairly slow right now because there is no money to be made in space outside of the commercial satellite business, and even that one exists mostly because it is an enabler of terrestrial industries and not because it has merit in itself. The overall truth of the matter is that by going to space, you\u0027re only spending money you\u0027ll never get back. But should new opportunities arise to actually make a tidy profit up there, a substantial amount of people will be interested to get in on it, and space development will accelerate abruptly. Extracting resources from near Earth objects could be one such opportunity, should it turn out to be technologically feasible.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ScallopPotato\u0022 data-cite=\u0022ScallopPotato\u0022\u003E\u003Cdiv\u003EThis is important for us humans, but I also see it applicable for alien civilizations. See, there could be intelligent species out there, but they could be among the first era of complex life on their planet, so they don\u0027t have reserves of fossil fuels to work with. Thus, they never leave their planet, and we never see them. Forever Farmer Grey.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see why a lack of naturally occuring hydrocarbons would ground an intelligent species on their homeworld. These molecules are easily synthesized by scientists in the lab, which we can assume them to have if they are thinking about launching rockets into space. So if they had no alternative, that\u0027s what they would use. But I\u0027d expect there to be plenty of alternatives that we don\u0027t use merely because it\u0027s less of a bother to order hydrocarbon based products from the already existing oil infrastructure.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-10T12:14:13Z\u0022 title=\u002207/10/2014 12:14  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 10, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2014-07-10T12:17:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EThe only obvious propellants made from petroleum that I know of is RP-1 (basically rocket-grade kerosene). Aside from LH2/LOX, there\u0027s hydrazine-based fuels (MMH, UDMH), liquid methane(or ethane/propane, or other light flammable gases), nitrogen tetroxide, hydrogen peroxide, nitric acid, and more. The spacecraft can be built out of metal alloys (or even pure metals) rather than oil-based polymers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGolden spacecraft. Look awesome. Insanely low delta-V.\u003C/p\u003E\u003Cp\u003EEveryone knows that oil companies are just groups of greedy people who control the industrial world. It does not seem like coincidence that almost everyone that we use is made of oil even through there are plenty of other materials. People only started to consider alternatives to oil as we overused it and it is running out rapidly.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-07-10T12:41:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PenguinsMeep\u0022 data-cite=\u0022PenguinsMeep\u0022\u003E\u003Cdiv\u003EEveryone knows that oil companies are just groups of greedy people who control the industrial world. It does not seem like coincidence that almost everyone that we use is made of oil even through there are plenty of other materials. People only started to consider alternatives to oil as we overused it and it is running out rapidly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBack then, oil was cheap and plentiful, and contains many organic compounds, so people naturally use it to make a lot of things, including polymers and various fuels and chemicals. Nowadays, the oil wells\u0027 production has decreased enough (actually, the easy-to-get deposits has dried up, leaving the hard-to-reach ones, which is expensive to mine) to raise oil-based products considerably, which makes using petroleum alternatives more profitable than before.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-10T12:44:09Z\u0022 title=\u002207/10/2014 12:44  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 10, 2014\u003C/time\u003E by shynung\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-07-10T12:55:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003Ewhich makes using petroleum alternatives more profitable than before.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe times when we have used alternative routes to replace oil in the past have often been due to necessity, rather than economics. Germany during WW2 and South Africa during the embargoes of the apartheid era both developed extensive infrastructure to do without oil. Just goes to show how ingenious we can be in the face of scarcity.\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-07-10T15:46:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EBack then, oil was cheap and plentiful, and contains many organic compounds, so people naturally use it to make a lot of things, including polymers and various fuels and chemicals. Nowadays, the oil wells\u0027 production has decreased enough (actually, the easy-to-get deposits has dried up, leaving the hard-to-reach ones, which is expensive to mine) to raise oil-based products considerably, which makes using petroleum alternatives more profitable than before.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOil is still absurdly cheap for what it is. A barrel is 160kg of oil, equivalent to 6GJ, equivalent to 2000h of strength intensive work by a human, and costs only 100$.\u003C/p\u003E\u003Cp\u003EOnly a few things are cheaper than that and can be used for construction. On top of my mind concrete, sand and gravel.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2014-07-10T15:56:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003EOil is still absurdly cheap for what it is. A barrel is 160kg of oil, equivalent to 6GJ, equivalent to 2000h of strength intensive work by a human, and costs only 100$.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks like RP-1 will still be used for quite some time.\u003C/p\u003E\u003Cp\u003EToo bad the same can\u0027t be said about FLOX.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-10T16:57:56Z\u0022 title=\u002207/10/2014 04:57  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 10, 2014\u003C/time\u003E by shynung\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-07-10T16:52:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RuBisCO\u0022 data-cite=\u0022RuBisCO\u0022\u003E\u003Cdiv\u003EPeak Oil was reached some time ago its why gas prices are where they are today: Cheap Oil Ended in 2008. All the good stuff is drying up and we had to argument with more and more \u0022unconventional\u0022 oil sources such as tar sands, fracking, deep sea wells, all of which have lower EROEI, thus higher price. Once we could get out 50 barrels of energy for ever 1 we put in, now we are doing around 5 barrels for every one we put in, as it gets worse and more expensive alternatives like solar and biofuels start looking better and better. Anyways we could make RP-1 from algea or from Thermal-cracking or what ever, the price tag on the fuel is still rather small.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, its no more cheap oil, oil are however not used to produce electricity in any scale. No lack of coal or natural gas. \u003C/p\u003E\u003Cp\u003ECoal or gas to oil will be economic at around 120 $/ barrel putting an effective maximum price for long term.\u003C/p\u003E\n"}]}