{"TopicId":77112,"ForumId":16,"TopicTitle":"Is there a point for Satellites and Space Stations in career mode?","CreatedByName":"stildawn","CreatedById":114095,"CreatedDateTime":"2014-07-09T21:00:39Z","PageNum":1,"Articles":[{"CreatedByName":"stildawn","CreatedById":114095,"CreatedDateTime":"2014-07-09T21:00:39Z","Content":"\n\u003Cp\u003EHi All\u003C/p\u003E\u003Cp\u003EAside from a orbital fuel depot. Is there any point to satellites and space stations in career mode at present? Gathering science or anything? What do you use them for?\u003C/p\u003E\u003Cp\u003EOr is it just for show, which is perfectly fine lol.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-09T21:33:15Z\u0022 title=\u002207/09/2014 09:33  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 9, 2014\u003C/time\u003E by stildawn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-07-09T21:03:58Z","Content":"\n\u003Cp\u003ENot very much. You can put a science bay on them to clean instruments so your lander can be reused for gathering all the science... the problem is by the time you can build the stations you have most the science you need (in stock) or simply have most the science from that celestial body, which is really only minmus and the mun since they are the only ones with biomes. The only other use is as you suggest, as a fuel depot.\u003C/p\u003E\u003Cp\u003EThey get much more useful if your using modded tech trees, resource gathering mods, and remote tech 2. But, they are fun to build if you enjoy sandbox games.\u003C/p\u003E\n"},{"CreatedByName":"stildawn","CreatedById":114095,"CreatedDateTime":"2014-07-09T21:30:39Z","Content":"\n\u003Cp\u003EAh I see, thought as much.\u003C/p\u003E\u003Cp\u003EHopefully they flesh out the feature more in the future.\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-07-10T01:10:56Z","Content":"\n\u003Cp\u003EI have satellites around every planet/moon. They have an antenna and some science parts on them (the ones that don\u0027t need to be cleaned) and i just transmit science back. Plus you get to see all the cool stuff out there!\u003C/p\u003E\u003Cp\u003EAs for stations.... i have a fairly large mun station. It currently houses 18 kerbals. It started out as just a science lab with some docking ports that i sent to harvest the mun. They are fun to build and challenging.\u003C/p\u003E\n"}]}