{"TopicId":77172,"ForumId":55,"TopicTitle":"Vessel Maintenance","CreatedByName":"Scibbie_","CreatedById":114833,"CreatedDateTime":"2014-07-10T08:49:48Z","PageNum":1,"Articles":[{"CreatedByName":"Scibbie_","CreatedById":114833,"CreatedDateTime":"2014-07-10T08:49:48Z","Content":"\n\u003Cp\u003EWhat if your spaceship wobbles around a lot.\u003C/p\u003E\u003Cp\u003EWell Here\u0027s a Realistic Solution! When making something like a IPV People sometimes have the problem ; \u0022OMG MY SHIP LOOKS LIKE ITS ABOUT THE BREAK OMFG!!!!1\u0022\u003C/p\u003E\u003Cp\u003ESo here\u0027s my Solution: A Toolbox. its automatically in your pod. without limited use. or with limited use.\u003C/p\u003E\u003Cp\u003EYou can then equip the tools from toolbox and place struts on your ship. of course the struts can only be placed by going EVA and then fly towards parts to place the strut on a specific place to connect it to another place. where you also have to fly towards or else you cant place the second part of your strut\u003C/p\u003E\u003Cp\u003EBut other than that. here is not much use for it is it. What about eh.. YES! Installing RCS Trusters . and once again fly towards the place you want to place it, if you are too far away it wont be possible.\u003C/p\u003E\u003Cp\u003EBut this is only the beginning. what if your vessel gets hit by something. like another vessel when failing horrible at docking. because you go too fast. or maybe debris hits you. then your ship gets damaged . When damaged it disables the hit part until fixed. With use of the toolbox.. maybe this could also be used for repairing wheels . this will mean that on most rovers you will need to place the toolbox.\u003C/p\u003E\u003Cp\u003EWhat if you have a Probe, a vessel not controlled by a kerbal. and its damaged? then you have to fly towards it. and fix it. this will ad more types of missions to the game. like they to in real life or like in te beginning of gravity (the movie). they are fixing something.\u003C/p\u003E\u003Cp\u003EI think this will add more productivity to the game. more reasons to revisit your vessels in space.\u003C/p\u003E\u003Cp\u003EThanks to everyone who readed the entire post! If my english is bad in this post. I am very sorry im not english but dutch. thank you-\u003C/p\u003E\u003Cp\u003E-Scibbie\u003C/p\u003E\n"}]}