{"TopicId":77206,"ForumId":32,"TopicTitle":"long space walks","CreatedByName":"ohlookabirdie","CreatedById":67729,"CreatedDateTime":"2014-07-10T18:38:01Z","PageNum":1,"Articles":[{"CreatedByName":"ohlookabirdie","CreatedById":67729,"CreatedDateTime":"2014-07-10T18:38:01Z","Content":"\n\u003Cp\u003Ewhat is the furthest you have traveled on EVA in space (excluding EVA landings on moons)\u003C/p\u003E\u003Cp\u003Ei recently did a 32km ship to ship space walk because i couldn\u0027t be bothered getting closer after the ships drifted apart on time warp and i realized i forgot to transfer crew \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-07-10T18:40:10Z","Content":"\n\u003Cp\u003EI went down to minmus and came back.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zekes\u0022 data-cite=\u0022zekes\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EArriving, Desney put the ship in a 6km orbit but realized it was too low to be safe so moved it to 11km.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/99bzTOV.jpg\u0022 alt=\u002299bzTOV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EChasnie then decided to EVA to the surface. This was highly dangerous; no Zokesian kerbal had ever made the trip and survived (RIP Langley Kerman, 11-21-2013)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wPUSwPj.png\u0022 alt=\u0022wPUSwPj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was a bouncy landing... with exactly 50% fuel remaining.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KfPFo84.png\u0022 alt=\u0022KfPFo84.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe planted the flag and took a surface sample. Does not taste like cheese.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZliBrEZ.png\u0022 alt=\u0022ZliBrEZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHis ascent took him into a nice orbit, but he ran out of fuel just as he was coasting to the ladder. Desney\u0027s superb piloting skills saved the day as he backed up the \u003Cem\u003EWarspite \u003C/em\u003Eand Chasnie was able to drift to the ladder. Safe and sound!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DTJjGwR.jpg\u0022 alt=\u0022DTJjGwR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"ohlookabirdie","CreatedById":67729,"CreatedDateTime":"2014-07-10T18:43:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zekes\u0022 data-cite=\u0022zekes\u0022\u003E\u003Cdiv\u003EI went down to minmus and came back.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei said excluding eva landings\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-07-10T19:15:58Z","Content":"\n\u003Cp\u003ESo, my longest spacewalk, not counting my longest spacewalk :-p\u003C/p\u003E\u003Cp\u003EWell, about 4 km I think - 2 each way - , when a ship was about to depart for interplanetary space and I realised I\u0027d forgotten to take the Kerbin orbit science out. Just for fun I decided to do the return leg purely visual, hitting F2 to remove all instruments.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-07-10T19:19:49Z","Content":"\n\u003Cp\u003EI, too, enjoy long spacewalks, kerba koladas, \u0026amp; getting caught in meteor showers.\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-07-10T19:23:24Z","Content":"\n\u003Cp\u003EOne of my Kerbals ended up in a Trajectory around Kerbol somewhere between Jool and Dres for a couple of Years... so there is that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2014-07-10T19:25:36Z","Content":"\n\u003Cp\u003E5km or so is my longest spacewalk... never had a need to move between ships further apart than that. \u003C/p\u003E\u003Cp\u003EI did a 76km EVA flight across the surface of the Mun, though, from a crashed lander to an off-target rescue craft. If anything, I think that\u0027s a greater feat than a spacewalk across a similar distance, since I had to estimate a high ballistic arc to lob him into, or I would have run out of fuel trying to maintain a low altitude. Made it inside with like 4% fuel for the jets remaining.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-07-10T19:29:23Z","Content":"\n\u003Cp\u003ENot a landing, but more than a few times I\u0027ve run out of fuel when trying to get back to orbit around the Mun or Minmus and have had to bail out.\u003C/p\u003E\u003Cp\u003EThen fly back via jetpack, just try to land your Kerbals on their heads \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"No one","CreatedById":112131,"CreatedDateTime":"2014-07-10T19:35:41Z","Content":"\n\u003Cp\u003EWhen I was testing out my Moho lander, Jeb did several orbits of the Mun on EVA.\u003C/p\u003E\u003Cp\u003EI landed on the Mun, took off in a tiny ion thing, attempted to rendez-vous with the rest of the ship which was still in orbit to get on a slightly bigger ion thing, detach from that, and go home. Unfortunately, when I exited the command seat, he started spinning uncontrollably for no reason. To get him to stop I had to hit him, except it\u0027s really hard to hit someone while in low munar orbit on the dark side of the moon, so I kept attempting to hit him on the light side, then getting to the dark side and having to wait for the light and restarting.\u003C/p\u003E\u003Cp\u003ESwitching ships in the actual moho-landing went completely fine.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-10T19:42:17Z","Content":"\n\u003Cp\u003EIf we talk about EVAs without the help of a rover, I guess it was around 10 km far away on Mun and 10km back, which took me about an hour, because the jetpack fuel wasnÃ‚Â´t sufficient. So a total of 20km.\u003C/p\u003E\u003Cp\u003EIf we include EVAs via Rover, it may be double or triple the distance ... IIRC the longest must have been 20-30km to and 20-30 km back via rover, so 40-60km in total\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-07-10T19:49:04Z","Content":"\n\u003Cp\u003ENot very far. I don\u0027t like long spacewalks in the park.\u003C/p\u003E\n"},{"CreatedByName":"TrooperCooper","CreatedById":110599,"CreatedDateTime":"2014-07-10T20:08:29Z","Content":"\n\u003Cp\u003EWhen he did an EVA for science, Bob was... lost in space! And due to a weired clipping-kickoff combo, all his jetpack fuel burned up within a few seconds. So I had to come rescue him. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/27E92XJ.jpg\u0022 alt=\u002227E92XJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nqZHQna.jpg\u0022 alt=\u0022nqZHQna.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dM9A3wd.jpg\u0022 alt=\u0022dM9A3wd.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-07-10T20:11:45Z","Content":"\n\u003Cp\u003EHalfway from Moho. or inside Eve Orbit to LKO. \u003C/p\u003E\u003Cp\u003EMoho mission run out of fuel during midway correction burn with 200 m/s left. \u003C/p\u003E\u003Cp\u003EI did an Eva with both Kerbals and used the jetpacks for the rest of the correction burn and aerobraked them into a Kerbin orbit where I sent a ship to rescue them.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-07-10T20:13:00Z","Content":"\n\u003Cp\u003EI once had to spacewalk 2 out of 3 kerbals each about 60 km across some goofy highly eliptical orbits around Kerbin on a goofy rescue mission (that \u003Cem\u003Ealso\u003C/em\u003E didn\u0027t bring enough fuel). It took a LOT of play time. I think I launched a second, better fueled rescue for the last guy.\u003C/p\u003E\n"},{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-07-11T00:04:33Z","Content":"\n\u003Cp\u003EI once accidentally not enough fuel on my mun lander, crashed the rocket, but was able to save the pilot by getting on the ladder and jumping off at the last second. the pilot bounced, high enough to use the rcs thrusters to circularise\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-11T00:35:34Z","Content":"\n\u003Cp\u003EI once had a kerbal jog 10 km to meet the craft that was \u0022rescuing\u0022 him. I pinned shift and w and took a break.\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-07-11T01:14:21Z","Content":"\n\u003Cp\u003EI think around 20 kilometers across the mun. I know Scott Manley flew from Gilly back to Kerbin on EVA alone.\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2014-07-11T01:56:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ELike shows like Star Trek and Firefly?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETalk about the opposite ends of the spectrum. \u003C/p\u003E\u003Cp\u003EI like both. I also created the Firefly mod for Orbitersim so I lean towards Firefly more than Trek but I also did a few Trek type mods for Orbitersim. The \u0022Sidney\u0022 comes to mind.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-07-11T04:32:19Z","Content":"\n\u003Cp\u003EMy furthest spacewalk, roughly 7km. I needed to add one more member to my crew list to pilot the rover on the Mun. I don\u0027t tend to take off with EVA seats loaded, but I realized all too late that with 3 men in the crew pod, I needed to move two to Science Bay (forgot to load it out first) and that meant I needed one to stay with the ship. Insurance policy, after all. You don\u0027t crash and kill your pilot when you\u0027re driving across the Mun.\u003C/p\u003E\u003Cp\u003EWell, I got as close as I can (I\u0027m really bad at orbital rendezvous, despite being able to make it to other planets easily enough...) and just sent Neilgas Kerman across the 7km gap to sit in the rover seat the whole way to the Mun.\u003C/p\u003E\u003Cp\u003EThat mission ended well. Neilgas and the Rover were separated first, and they landed softly in the East Farside Crater (according to the Biome name I got from the EVA report). I sent down the ship with the Science Module, designed as the first available Mun base I\u0027d made in that career save. I left a probe satellite in orbit, in accordance with my own rules regarding long-duration Kerballed missions (at least one comsat in orbit, preferably modern. A comsat must have one 88-88 dish antenna, a DTS flat-folding antenna, and a Communotron, minimum, and cannot be allowed to run out of power at any time during the mission.)\u003C/p\u003E\u003Cp\u003E------\u003C/p\u003E\u003Cp\u003EMy second longest space walk was Jeb pushing his capsule retrograde to make a 100km orbit a re-entry. 3km of nudging and pushing, followed by resolutely crawling back inside and waiting to try some more (a rule I use to discourage \u0027get out and push\u0027 as well as infinite EVA fuel is that 5 minutes must pass between EVA fuel depletions. This is to allow the onboard compressors in the capsule to compress the gasses Kerbals exhale into a usable fuel. It is also to allow a Kerbal to unwind and relieve stress so that they don\u0027t become a puff of smoke out of frustration.) Then there was a 1km final burn on that walk to reach atmo. I was in the capsule then, but it still took 4 orbits to fall into the atmosphere enough to re-enter.\u003C/p\u003E\u003Cp\u003ENeedless to say, I over-engineer my fuel budgets now. At least 10% more than the mission requires.\u003C/p\u003E\n"},{"CreatedByName":"-root","CreatedById":112842,"CreatedDateTime":"2014-07-11T06:07:19Z","Content":"\n\u003Cp\u003EI left Bill outside on a return from Duna. He clung to the rail all teh way to kerbin atmo. I only noticed him when the strange heating effects made me look to see what was causing them.\u003C/p\u003E\u003Cp\u003EI dunno, hundred million kms? Not really a space walk though, he jsut happened to outside for the entire trip \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-07-11T07:02:59Z","Content":"\n\u003Cp\u003EA few kilometres, had to evacuate the crew of a craft with empty tanks - it also saved the trouble of around 1000 parts inside the \u0022physics cube of space\u0022.\u003C/p\u003E\u003Cp\u003EKAC helped a lot, as I could adjust my trajectory in EVA by watching the closest approach alarm. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-11T07:24:46Z","Content":"\n\u003Cp\u003EAddendum (to my last posting about EVAs on Mun):\u003C/p\u003E\u003Cp\u003EI just remember that one of my Kerbals (I think it was Bob) already made a longer spacewalk than the EVAs on Mun.\u003C/p\u003E\u003Cp\u003EIt was a little bit more than a full orbit around Mun.\u003C/p\u003E\u003Cp\u003EThe reason for this was a bad construction of the ladders and exteriors of the capsule for my spaceship.\u003C/p\u003E\u003Cp\u003EI did an EVA in lower munar orbit in order to get science points above one biome when Bob slowly slid from the ladder of the spaceship.\u003C/p\u003E\u003Cp\u003EAt this time I still thought it wouldnÃ‚Â´t be dramatic as it was still several minutes till the terminator and therefore the spaceship was in full sunlight (I should mention that it was a one Kerbal capsule, so I didnÃ‚Â´t have access to the ship with Bob, as only crewmember being outside).\u003C/p\u003E\u003Cp\u003EWell, I made several attempts at getting hold of the ladder and each time I wasnÃ‚Â´t able to grab it (or directly enter the c aspsule) ... then, when the terminator came, I had a slight problem, as the last attempt had led me drift some distance away from the spaceship ... so I decided to wait till the orbit would get Bob and the spaceship into sunlight again, as I wasnÃ‚Â´t able to locate the ship (which also didnÃ‚Â´t have exterior lights).\u003C/p\u003E\u003Cp\u003EWell, when sunlight came, I spend 10 minutes or more trying to locate the ship, as it was so far away, that it was only a tiny speck (which I only was able to locate when it was flying in front of Kerbin).\u003C/p\u003E\u003Cp\u003EI then spent almost the full sunlight period (before reaching the Terminator again) aligning my owb orbit to that of the ship and finally getting into the ship.\u003C/p\u003E\u003Cp\u003EI never felt so alone during a spacewalk as during this time (especially as I was playing with TAC liefesupport, meaning that the supplies of O2, Food, Water and electricity (to heat) of my Kerbals spacesuit were extremly limited (and a rescue mission from Kerbin therefore not possible). HadnÃ‚Â´t I reached the ship before my RCS fuel ran out, Bob would surely have been dead.\u003C/p\u003E\u003Cp\u003EThis experience has taught me, to first test the ladders of every spaceship on Kerbin launchpad ... and to include extensive exterior lighting for every ship (so that it is still visible for Kerbals on the nightside of a planet/moon)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-11T07:27:03Z\u0022 title=\u002207/11/2014 07:27  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 11, 2014\u003C/time\u003E by Godot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2014-07-11T23:27:04Z","Content":"\n\u003Cp\u003EI was bored and ejected a Kerbal at an Laythe intercepion trajectory from somewhere in between Duna and Dres. He landed using a parachute from Vanguard Technologies. So a few ten million of KM.\u003C/p\u003E\n"},{"CreatedByName":"Sovetskysoyuz","CreatedById":71931,"CreatedDateTime":"2014-07-11T23:48:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EAddendum (to my last posting about EVAs on Mun):\u003Cp\u003EI just remember that one of my Kerbals (I think it was Bob) already made a longer spacewalk than the EVAs on Mun.\u003C/p\u003E\u003Cp\u003EIt was a little bit more than a full orbit around Mun.\u003C/p\u003E\u003Cp\u003EThe reason for this was a bad construction of the ladders and exteriors of the capsule for my spaceship.\u003C/p\u003E\u003Cp\u003EI did an EVA in lower munar orbit in order to get science points above one biome when Bob slowly slid from the ladder of the spaceship.\u003C/p\u003E\u003Cp\u003EAt this time I still thought it wouldnÃ‚Â´t be dramatic as it was still several minutes till the terminator and therefore the spaceship was in full sunlight (I should mention that it was a one Kerbal capsule, so I didnÃ‚Â´t have access to the ship with Bob, as only crewmember being outside).\u003C/p\u003E\u003Cp\u003EWell, I made several attempts at getting hold of the ladder and each time I wasnÃ‚Â´t able to grab it (or directly enter the c aspsule) ... then, when the terminator came, I had a slight problem, as the last attempt had led me drift some distance away from the spaceship ... so I decided to wait till the orbit would get Bob and the spaceship into sunlight again, as I wasnÃ‚Â´t able to locate the ship (which also didnÃ‚Â´t have exterior lights).\u003C/p\u003E\u003Cp\u003EWell, when sunlight came, I spend 10 minutes or more trying to locate the ship, as it was so far away, that it was only a tiny speck (which I only was able to locate when it was flying in front of Kerbin).\u003C/p\u003E\u003Cp\u003EI then spent almost the full sunlight period (before reaching the Terminator again) aligning my owb orbit to that of the ship and finally getting into the ship.\u003C/p\u003E\u003Cp\u003EI never felt so alone during a spacewalk as during this time (especially as I was playing with TAC liefesupport, meaning that the supplies of O2, Food, Water and electricity (to heat) of my Kerbals spacesuit were extremly limited (and a rescue mission from Kerbin therefore not possible). HadnÃ‚Â´t I reached the ship before my RCS fuel ran out, Bob would surely have been dead.\u003C/p\u003E\u003Cp\u003EThis experience has taught me, to first test the ladders of every spaceship on Kerbin launchpad ... and to include extensive exterior lighting for every ship (so that it is still visible for Kerbals on the nightside of a planet/moon)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat about using the EVA suit lights?\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-07-11T23:53:36Z","Content":"\n\u003Cp\u003EIf we count rovers then about 60km and 60km back on Mun, which was a horrifying experience even though the rover was build very soundly (two sets of wheels in case it flipped, which it did, a lot).\u003C/p\u003E\n"}]}