{"TopicId":77352,"ForumId":16,"TopicTitle":"So what exactly are conics?","CreatedByName":"SergeantBlueforce","CreatedById":73432,"CreatedDateTime":"2014-07-12T09:44:28Z","PageNum":1,"Articles":[{"CreatedByName":"SergeantBlueforce","CreatedById":73432,"CreatedDateTime":"2014-07-12T09:44:28Z","Content":"\n\u003Cp\u003EI\u0027m asking as I saw a thread the other day saying that if you altered a config value related to them you would be able to see planet intercepts before they happened (with manoeuvre nodes and other things)\u003C/p\u003E\u003Cp\u003ECan anyone explain what they are to me?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-13T16:47:29Z\u0022 title=\u002207/13/2014 04:47  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 13, 2014\u003C/time\u003E by SergeantBlueforce\u003C/strong\u003E\n\u003Cbr\u003EMarking as answered.\n\u003C/span\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-07-12T10:06:07Z","Content":"\n\u003Cp\u003EA \u003Ca href=\u0022https://en.wikipedia.org/wiki/Conic_section\u0022 rel=\u0022external nofollow\u0022\u003Econic section\u003C/a\u003E is the curve you get when you cut through a cone with a flat plane. Depending on the angle of the plane the curve can be any of circle, ellipse, parabola or hyperbola. A body that is only being acted on by gravity (inverse square law) by one body will always follow one of these paths. As KSP only ever has one body that exerts a gravitational force on your ship (the body whose SOI you are in) then the path of your craft in that body\u0027s SOI is always one of the conic sections.\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2014-07-12T10:41:04Z","Content":"\n\u003Cp\u003EThe config change in question is how the different conic sections are displayed in map mode, tricky to explain bit it\u0027s about how they are shown to connect up when you change soi. \u003C/p\u003E\u003Cp\u003ENow say if you plot a mun intercept, when you\u0027re focused on kerbin the trajectory shown round the mun (in orange) is not very clear, it just looks kinda squiggly, but if you focus on the mun it will change and look correct, but no longer connect to the blue part. \u003C/p\u003E\u003Cp\u003EThat\u0027s cos it automatically changes the conic display mode, from relative to your current body, to relative to the local body. That\u0027s just one display mode change, there are 5 in total, and they can all be useful in showing your trajectory in clearer ways in certain situations. The most useful one however is the one i just described which squad added as an automatic change now. \u003C/p\u003E\u003Cp\u003EIf you have mechjeb, you can swap the modes easily using the manoeuvre node editor.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-12T10:53:37Z\u0022 title=\u002207/12/2014 10:53  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 12, 2014\u003C/time\u003E by Wallace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2014-07-12T10:57:34Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/11322-Different-Conic-drawing-modes\u0022 rel=\u0022external nofollow\u0022\u003EThat post\u003C/a\u003E should show you the difference easily.\u003C/p\u003E\u003Cp\u003EI believe there are a few video on youtube also.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-12T11:42:41Z","Content":"\n\u003Cp\u003EThere\u0027s two separate settings related to conics:\u003C/p\u003E\u003Cp\u003ECONIC_PATCH_DRAW_MODE: Sets which method for drawing trajectories that cross SoI boundaries will be used. The post UbioZur linked gives good examples.\u003C/p\u003E\u003Cp\u003ECONIC_PATCH_LIMIT: Sets the maximum number of SoIs through which the map view will predict your trajectory. The higher this number, the more SoI transitions can be predicted, but there is a performance penalty with higher limits.\u003C/p\u003E\n"}]}