{"TopicId":77486,"ForumId":34,"TopicTitle":"[1.3](Jan28/17) Landing Aid: Kill your horizontal velocity to land (Now optionally using RCS)","CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2014-07-13T15:54:13Z","PageNum":4,"Articles":[{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-01-18T00:59:24Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EVersion 2.2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Add support for nearby non-focus vessels.\u003C/p\u003E\u003Cp\u003E-Button on toolbar is now highlight in yellow when the mod is actively trying to control the vessel.\u003C/p\u003E\u003Cp\u003ENow when you switch away from a vessel, it remembers its settings and will keep controlling your horizontal velocity.\u003C/p\u003E\u003Cp\u003ENote that this only works within a few hundred meters of the focus vessel, if you get too far away KSP will think the vessel is debris falling to the ground and delete it. (The actual distance is uncertain, probably 300-450meters, but it varied in testing.)\u003C/p\u003E\u003Cp\u003EHover target arrows are still red for the focus vessel, but any nearby vessels hovering show their target arrows in blue.\u003C/p\u003E\u003Cp\u003EHave some formation flying:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/c5uvFLj.jpg\u0022 alt=\u0022c5uvFLj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELet me know how it goes,\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-01-29T03:59:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EVersion 2.2\u003C/strong\u003E\u003Cp\u003E-Add support for nearby non-focus vessels.\u003C/p\u003E\u003Cp\u003E-Button on toolbar is now highlight in yellow when the mod is actively trying to control the vessel.\u003C/p\u003E\u003Cp\u003ENow when you switch away from a vessel, it remembers its settings and will keep controlling your horizontal velocity.\u003C/p\u003E\u003Cp\u003ENote that this only works within a few hundred meters of the focus vessel, if you get too far away KSP will think the vessel is debris falling to the ground and delete it. (The actual distance is uncertain, probably 300-450meters, but it varied in testing.)\u003C/p\u003E\u003Cp\u003EHover target arrows are still red for the focus vessel, but any nearby vessels hovering show their target arrows in blue.\u003C/p\u003E\u003Cp\u003EHave some formation flying:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/c5uvFLj.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/c5uvFLj.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELet me know how it goes,\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA couple of comments:\u003C/p\u003E\u003Cp\u003EFirst, I\u0027m running on Windows 7, KSP 32 bit, Horizontal Landing Aid 2.2\u003C/p\u003E\u003Cp\u003EOn the first page, you say the following:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEngage Height: Regardless of which mode the mod is in, it will not activate unless you vessel is within 1000 meters of the ground. As the mod zero\u0027s out your velocity relative to a point on the surface, zeroing out too high wastes RCS as you can be moving several meters per second faster due to the larger diameter of the \u0022orbit\u0022 you are making as compared to the \u0022orbit\u0022 the ground is making. (This limit is adjustable by right-clicking the toolbar icon.)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHowever, the prompt simply says \u0022LandingAid height\u0022. Might I suggest it say something like the following: Max Engage/active height\u003C/p\u003E\u003Cp\u003ESecond, for whatever reason, when I\u0027m using it on a specific ship, it seems to be very over-controlling. I suspect it is the ship itself acting like a giant pendulum, since this is my first attempt at a skycrane, but it has been very frustrating trying to get this ship down and moved to where I want it. Is there any way to adjust the sensitivity of it, or to, maybe, limit the amount it will tilt a ship?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-29T04:07:05Z\u0022 title=\u002201/29/2015 04:07  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 29, 2015\u003C/time\u003E by linuxgurugamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-01-29T15:09:14Z","Content":"\n\u003Cp\u003EThanks for catching those.\u003C/p\u003E\u003Cp\u003EI\u0027ve re-worded the first post to remove all mentions of RCS being necessary. It has been long enough since I made that change it isn\u0027t needed any more.\u003C/p\u003E\u003Cp\u003EI\u0027ll look at the in-game text for the engage height when I get a chance.\u003C/p\u003E\u003Cp\u003EOn the ship over-controlling, does this happen in both velocity cancel mode and hover-at-location mode? Or just hover-at-location mode? \u003C/p\u003E\u003Cp\u003EIf it happens in velocity cancel mode, that may be an issue I need to look at. The vessel tip is directly proportional to your horizontal speed so it should come smoothly to a stop regardless of the vessel size, even if that is a slow stop for larger vessels.\u003C/p\u003E\u003Cp\u003EIf it is in only hover-at-location mode, I\u0027m not as sure. I did assume a minimum level of torque available for the vessel, but even if you are below this minimum torque all that should happen is that you bounce back and forth over your target location a few times, there shouldn\u0027t be actual control issues.\u003C/p\u003E\u003Cp\u003ERegardless of the mode you are in, there is a hard limit of 20Ã‚Â° off vertical that this mod will never go past. (Barring external factors, if you can\u0027t get the craft vertical with the WASD keys, this mod can\u0027t get the vessel vertical either.)\u003C/p\u003E\u003Cp\u003EI\u0027ll at least take a look at it tonight.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-01-29T17:09:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003EThanks for catching those.\u003Cp\u003EI\u0027ve re-worded the first post to remove all mentions of RCS being necessary. It has been long enough since I made that change it isn\u0027t needed any more.\u003C/p\u003E\u003Cp\u003EI\u0027ll look at the in-game text for the engage height when I get a chance.\u003C/p\u003E\u003Cp\u003EOn the ship over-controlling, does this happen in both velocity cancel mode and hover-at-location mode? Or just hover-at-location mode? \u003C/p\u003E\u003Cp\u003EIf it happens in velocity cancel mode, that may be an issue I need to look at. The vessel tip is directly proportional to your horizontal speed so it should come smoothly to a stop regardless of the vessel size, even if that is a slow stop for larger vessels.\u003C/p\u003E\u003Cp\u003EIf it is in only hover-at-location mode, I\u0027m not as sure. I did assume a minimum level of torque available for the vessel, but even if you are below this minimum torque all that should happen is that you bounce back and forth over your target location a few times, there shouldn\u0027t be actual control issues.\u003C/p\u003E\u003Cp\u003ERegardless of the mode you are in, there is a hard limit of 20Ã‚Â° off vertical that this mod will never go past. (Barring external factors, if you can\u0027t get the craft vertical with the WASD keys, this mod can\u0027t get the vessel vertical either.)\u003C/p\u003E\u003Cp\u003EI\u0027ll at least take a look at it tonight.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was doing the hover-at-location mode. I think i need to expand on my description:\u003C/p\u003E\u003Cp\u003EI have a ship which has 2-3 MKS modules stacked along with their bases. My skycrane is at the top of this stack. There is a manned module on top of the skycrane. The skycrane is only somewhat wider than the MKS modules.\u003C/p\u003E\u003Cp\u003EMy main ship landed on Minmus. Then I separated from the landing stage, and was trying to use the skycrane to move the stack to a specific point on the ground. Once there, I land, detach the lowest module, and then take off and move over to land the next one.\u003C/p\u003E\u003Cp\u003Ei\u0027m also using your Vertical Velocity control to hover.\u003C/p\u003E\u003Cp\u003EWhat happens is that I lift off, make sure that RCS and SAS is engaged, then use the Landing aid to select a landing spot. Since the rockets are at the top of this long stack, it acts like a pendulum. The 20 degrees is too much for this, there is a very severe delay in the ship responding to the rockets, so it swings back and forth, and actually orbits around the landing spot.\u003C/p\u003E\u003Cp\u003EI think that being able to reduce the max tilt to maybe 5 degrees, or some way to specify the max tilt on a per-rocket basis would help a lot.\u003C/p\u003E\u003Cp\u003EHere are a couple of pictures of one of my ships:\u003C/p\u003E\u003Cp\u003EAfter initial landing:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/hnuhqvk3wpf0qw4/screenshot9.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/hnuhqvk3wpf0qw4/screenshot9.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter separation from landing stage:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/4cj0s71tl1zwmep/screenshot10.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/4cj0s71tl1zwmep/screenshot10.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eand here is a link to one of the craft files:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/8vd25q4pvq37z8v/Minmus%20station%20%26%20lander%204.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8vd25q4pvq37z8v/Minmus%20station%20%26%20lander%204.craft?dl=0\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-29T18:54:17Z\u0022 title=\u002201/29/2015 06:54  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 29, 2015\u003C/time\u003E by linuxgurugamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-01-29T19:41:23Z","Content":"\n\u003Cp\u003EHmmm. I never did test a vessel with rockets above the CoM like that, didn\u0027t even think of it.\u003C/p\u003E\u003Cp\u003EAnyways, should be reasonably easy to fix, or at least give you access to the options to set the limits such as max degrees off vertical.\u003C/p\u003E\u003Cp\u003EI\u0027ll poke at it tonight.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-01-29T19:51:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003EHmmm. I never did test a vessel with rockets above the CoM like that, didn\u0027t even think of it.\u003Cp\u003EAnyways, should be reasonably easy to fix, or at least give you access to the options to set the limits such as max degrees off vertical.\u003C/p\u003E\u003Cp\u003EI\u0027ll poke at it tonight.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFigures I\u0027d do something like this :-) \u003C/p\u003E\u003Cp\u003EFor now, I\u0027m just doing it by hand, using the Vertical Velocity control and just goosing it by hand. Next time I\u0027ll probably add some RCS thrusters all along the sides to be able to translate while keeping upright, but would be nice to be able to automate this.\u003C/p\u003E\u003Cp\u003EThanks for looking into it.\u003C/p\u003E\n"},{"CreatedByName":"SlimJim89","CreatedById":107281,"CreatedDateTime":"2015-01-29T20:16:49Z","Content":"\n\u003Cp\u003EWhy is it that it needs the SAS to function? I don\u0027t remember it needing it in earlier versions, and as of now I can\u0027t use mechjebs Smart A.S.S at the same time.\u003C/p\u003E\u003Cp\u003EIf don\u0027t have the smartass on, your mod starts swaying my VTOL over the spot, it stays still, but it sways around a lot even if it indeed stays over its designated place.\u003C/p\u003E\u003Cp\u003EIs there a possibility to have that depency on SAS toggleable? It really does conflict with the smartass.\u003C/p\u003E\u003Cp\u003EHere\u0027s video where I use your 2 mods with Davon throttle control and Mechjebs SmartASS back in November.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/S5pGxVthOmU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-01-29T20:51:41Z","Content":"\n\u003Cp\u003ENo, the dependency on SAS is not toggelable in this version.\u003C/p\u003E\u003Cp\u003EThe previous version used the RCS thruster blocks to control horizontal velocity. However, the low thrust of the RCS blocks meant you were layering them on to get any sort of reasonable thrust. As vessels got larger the mod became kind of useless because so many RCS blocks were required. (My test Kerbal 2 generally had 16 RCS blocks on it to get even a so-so sideways acceleration.)\u003C/p\u003E\u003Cp\u003ESince version 2.0, this mod takes over the SAS system and rather then controlling the vessel directly, it changes the desired SAS direction and lets KSP control the vessel through SAS. This is why it conflicts with MechJeb, both this mod and MechJeb are trying to point the vessel in their desired direction and those directions do not match.\u003C/p\u003E\u003Cp\u003EThis new method of tipping the vessel over a bit to generate sideways thrust means the mod works with vessels of any size as the thrust available to the mod automatically scales up as the player builds bigger vessels with bigger engines.\u003C/p\u003E\u003Cp\u003ENow, the VTOL swaying in place thing is a problem, it should not be doing that. Can you give me more details on that so I can look into it? And which SASS mode are you using in MechJeb?\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"SlimJim89","CreatedById":107281,"CreatedDateTime":"2015-01-29T20:53:37Z","Content":"\n\u003Cp\u003EI\u0027ll back get at you soon with a FRAPS!\u003C/p\u003E\n"},{"CreatedByName":"SlimJim89","CreatedById":107281,"CreatedDateTime":"2015-01-30T10:37:52Z","Content":"\n\u003Cp\u003EHere\u0027s the vid. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/0J90gyFvbk8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAs you can see 1 minute in, after I\u0027ve activated your mod the ship starts to enter some heavy swaying. I\u0027ve tried what I can, and perhaps it\u0027s a design issue. I don\u0027t have any loose parts though.\u003C/p\u003E\u003Cp\u003EI do however have 400 SAS torque, and I havent tried deactivating all but the cockpit. Might give that a try!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-30T13:28:57Z\u0022 title=\u002201/30/2015 01:28  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 30, 2015\u003C/time\u003E by SlimJim89\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-01-30T15:06:38Z","Content":"\n\u003Cp\u003ENice, thanks for the video.\u003C/p\u003E\u003Cp\u003EAnd I have to say that is really weird.\u003C/p\u003E\u003Cp\u003EFirst, you are using the mod exactly as I intended, I don\u0027t see anything in the video you could do different.\u003C/p\u003E\u003Cp\u003ESecond, I have not run any tests yet, but from watching the video my first suspicion is the RCS jets. \u003C/p\u003E\u003Cp\u003EBecause I use the in-built SAS, I don\u0027t actually have direct control of them and from looking at the exhaust plumes, it looks like KSP is pulsing the RCS on max causing an overshoot.\u003C/p\u003E\u003Cp\u003EBy this, I mean following is happening in your video:\u003C/p\u003E\u003Cp\u003E1) Engage this mod. Things are good.\u003C/p\u003E\u003Cp\u003E2) Drift happens, craft is moving horizontally at a very slow speed.\u003C/p\u003E\u003Cp\u003E3) Mod changes SAS direction slightly to compensate.\u003C/p\u003E\u003Cp\u003E4) KSP sees the changed SAS direction, notes it has RCS enabled, decides to use them.\u003C/p\u003E\u003Cp\u003E5) KSP pulses the RCS but due to how they are programmed, the pulse is max thrust. All was needed was a pulse at 10% thrust.\u003C/p\u003E\u003Cp\u003E6) This mod notes the overshoot, sets the SAS direction back the other way, but farther this time to compensate for the overshoot.\u003C/p\u003E\u003Cp\u003E7) Repeat again and again, overshooting farther each time.\u003C/p\u003E\u003Cp\u003ETesting this is easy however, can you repeat the circumstances of the above video, just with the RCS off please? If I\u0027m right, the sway will not happen. If the sway still happens, something else is going on and I\u0027ll be running tests tomorrow to figure it out.\u003C/p\u003E\u003Cp\u003ERegardless, I will be making some tweaks to this mod. Looking at the math for the issue linuxgurugamer reported made me realize that on low-grav worlds I\u0027m not happy with how little sideways acceleration just tipping the vessel gets you. A 10Ã‚Â° tip is only about 15% the acceleration of the force of gravity. Quite reasonable on Kerbin, not so reasonable on the Mun (or Minmus). Have not decided on a course of action about this issue yet.\u003C/p\u003E\u003Cp\u003EThanks for the great help on this,\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-01-31T23:55:54Z","Content":"\n\u003Cp\u003EAren\u0027t the RCS jets either on or off? I wasn\u0027t aware you could control them beyond that.\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-01T00:01:39Z","Content":"\n\u003Cp\u003EOne of the features of the inbuilt SAS system is that if the RCS system is on, the SAS system will fire them automatically to supplement the torque available from reaction wheels. However I believe that they are then over-torquing the vessel when the fire because they fire on max, hence the request in my previous post to try disabling them and see what happens on reaction wheels only. (I\u0027m assuming that vessel is stable with RCS off for this request.)\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\u003Cp\u003Eedit: oops, got the two recent issues mixed up. But yes, there are a couple tricks I can do with RCS that will help. (I think, have not had a chance to test anything yet.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-01T00:09:49Z\u0022 title=\u002202/01/2015 12:09  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 1, 2015\u003C/time\u003E by Diazo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-02-01T18:04:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003EOne of the features of the inbuilt SAS system is that if the RCS system is on, the SAS system will fire them automatically to supplement the torque available from reaction wheels. However I believe that they are then over-torquing the vessel when the fire because they fire on max, hence the request in my previous post to try disabling them and see what happens on reaction wheels only. (I\u0027m assuming that vessel is stable with RCS off for this request.)\u003Cp\u003ED.\u003C/p\u003E\u003Cp\u003Eedit: oops, got the two recent issues mixed up. But yes, there are a couple tricks I can do with RCS that will help. (I think, have not had a chance to test anything yet.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETake your time. Your efforts are appreciated.\u003C/p\u003E\u003Cp\u003EI\u0027m not in a hurry, I finished those missions and will not do them again for a while. When you get a fix, I\u0027ll do one more to test it for you.\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-02-08T19:00:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EVersion 2.3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/SirDiazo/RCSLandAid/releases/tag/2.3\u0022 rel=\u0022external nofollow\u0022\u003EDownload here.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E-Limit RCS thrust to avoid over-torquing.\u003C/p\u003E\u003Cp\u003E-Add Settings screen to tweak variables.\u003C/p\u003E\u003Cp\u003E-RCS can now be used to assist in moving the vessel around. (Optional)\u003C/p\u003E\u003Cp\u003EAlright, RCS is back. While totally optional, if the RCS system is on and there are available RCS blocks, this mod will fire the RCS to assist the vessel tip in moving the vessel around.\u003C/p\u003E\u003Cp\u003EAlso added the settings so that atypical vessel builds can tweak them so this mod works better.\u003C/p\u003E\u003Cp\u003EOne trick this now opens up is that if you set the MaxTip to 0Ã‚Â° and engage the RCS, the vessel will move around with only the RCS and no tipping of the vessel. Note this does not remove the conflict with MechJeb, SAS must still be on for this to work.\u003C/p\u003E\u003Cp\u003EThis should resolve both of the recent issues, the engines above the CoM causing a pendulum and the vessel wobbling back and forth when hovering in place.\u003C/p\u003E\u003Cp\u003EHappy KSPing all.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-02-08T20:47:25Z","Content":"\n\u003Cp\u003EThank you, will try it out soon.\u003C/p\u003E\n"},{"CreatedByName":"munseeker","CreatedById":110850,"CreatedDateTime":"2015-04-29T05:16:05Z","Content":"\n\u003Cp\u003EHas anybody tried this with 1.0? Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-29T14:13:23Z","Content":"\n\u003Cp\u003EWhile I don\u0027t know of anything breaking in this mod, I have not been able to test it yet.\u003C/p\u003E\u003Cp\u003EI need to get the Vertical Velocity control working first so that the vessel will hover and KSP 1.0 broke that mod hard.\u003C/p\u003E\u003Cp\u003EI think figured that out last night though so I should be able to get to this mod tonight.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"Argonicus","CreatedById":111889,"CreatedDateTime":"2015-04-29T22:50:11Z","Content":"\n\u003Cp\u003EAny news?\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-05-01T01:30:20Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EVersion 2.4\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/SirDiazo/RCSLandAid/releases/tag/2.4\u0022 rel=\u0022external nofollow\u0022\u003EDownload here.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E-KSP 1.0 Update, no functionality changes. (KSP 1.0.2 also)\u003C/p\u003E\u003Cp\u003ENote that due to the new aero system, a vessel will tend to wobble around the target point on the ground when in target mode (red button). Cancel velocity (blue button) is not affected by this.\u003C/p\u003E\u003Cp\u003EI\u0027ll try to add some math to compensate in the next update but as everything works fine I wanted to get the KSP 1.0 update released.\u003C/p\u003E\u003Cp\u003EHappy KSPing.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-02T14:54:55Z\u0022 title=\u002205/02/2015 02:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 2, 2015\u003C/time\u003E by Diazo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OvermindDL1","CreatedById":145681,"CreatedDateTime":"2015-06-11T00:14:14Z","Content":"\n\u003Cp\u003EReporting an exception that happens a few times in code location:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ERCSLandAid.RCSLandingAid.Update\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnd this happens when the button is clicked on, the color of it does not change either though my current craft may not be capable of it, in code location:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ERCSLandAid.RCSLandingAid.LeftClick\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-11T00:16:26Z\u0022 title=\u002206/11/2015 12:16  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 11, 2015\u003C/time\u003E by OvermindDL1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-06-11T01:52:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OvermindDL1\u0022 data-cite=\u0022OvermindDL1\u0022\u003E\u003Cdiv\u003EReporting an exception that happens a few times in code location:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ERCSLandAid.RCSLandingAid.Update\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes this happen once on switching to a new vessel, most likely at the start of a new Flight scene? That\u0027s a known issue that the next version will fix.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd this happens when the button is clicked on, the color of it does not change either though my current craft may not be capable of it, in code location:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ERCSLandAid.RCSLandingAid.LeftClick\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is new however, are there any more details you could get me? An output.log in particular would be very helpful.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"OvermindDL1","CreatedById":145681,"CreatedDateTime":"2015-06-11T07:48:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diazo\u0022 data-cite=\u0022Diazo\u0022\u003E\u003Cdiv\u003EDoes this happen once on switching to a new vessel, most likely at the start of a new Flight scene? That\u0027s a known issue that the next version will fix.\u003Cp\u003EThat is new however, are there any more details you could get me? An output.log in particular would be very helpful.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is just a normal null pointer exception, easy to fix in code by checking if it is null first :-), full stacktrace:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[FONT=monospace][COLOR=#000000][EXC 18:15:56.598] NullReferenceException: Object reference not set to an instance of an object[/COLOR]\u003Cbr\u003E        RCSLandAid.RCSLandingAid.[COLOR=#ffffff]LeftClick[/COLOR][COLOR=#000000] ()[/COLOR]\u003Cbr\u003E        RCSLandAid.RCSLandingAid.\u0026lt;Start\u0026gt;b__0 (RCSLandAid.ClickEvent e)\u003Cbr\u003E        RCSLandAid.Button.clicked (System.Object realEvent)\u003Cbr\u003E        Toolbar.Command.click ()\u003Cbr\u003E        UnityEngine.Debug:LogException(Exception)\u003Cbr\u003E        Toolbar.Log:log(LogLevel, Exception, String, Object[])\u003Cbr\u003E        Toolbar.Log:error(Exception, String, Object[])\u003Cbr\u003E        Toolbar.Command:click()\u003Cbr\u003E        Toolbar.Button:click()\u003Cbr\u003E        Toolbar.Button:drawInToolbar(Rect, Boolean)\u003Cbr\u003E        Toolbar.Toolbar:drawButtons()\u003Cbr\u003E        Toolbar.Toolbar:draw()\u003Cbr\u003E        Toolbar.ToolbarManager:OnGUI()\u003Cbr\u003E[/FONT]\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"JohnMarstonArg","CreatedById":146226,"CreatedDateTime":"2015-06-13T20:40:55Z","Content":"\n\u003Cp\u003EI\u0027m having trouble installing this mod, i did everything but it doesn\u0027t activate ingame.\u003C/p\u003E\u003Cp\u003EThis is what my GameData folder looks like \u003Cimg src=\u0022http://puu.sh/inEQ6/7a1b24836e.png\u0022 alt=\u00227a1b24836e.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-06-21T14:51:33Z","Content":"\n\u003Cp\u003E@JohnMarstonArg: The GameData folder inside the .zip file should be merged with your KSP\u0027s GameData folder.\u003C/p\u003E\u003Cp\u003ELooking at your folder your installed them one level too high, the GameData\\RCSLandAid folder should be at GameData\\Diazo\\RCSLandAid.\u003C/p\u003E\u003Cp\u003EThat should fix it for you.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"}]}