{"TopicId":77514,"ForumId":15,"TopicTitle":"Multiple (science) animations in one part.","CreatedByName":"Dr. Jet","CreatedById":99880,"CreatedDateTime":"2014-07-13T19:53:10Z","PageNum":1,"Articles":[{"CreatedByName":"Dr. Jet","CreatedById":99880,"CreatedDateTime":"2014-07-13T19:53:10Z","Content":"\n\u003Cp\u003EI\u0027m currently working on unmanned soil sample collector. Model, animation sequence and draft texture are done, but when porting the part to game I had issues...\u003C/p\u003E\u003Cp\u003E3 identical \u0022ModuleScienceExperiment\u0022s (part should collect up to 3 samples) in one part do get science as intended, and animation plays correctly, but only on FIRST use of any \u0022ModuleScienceExperiment\u0022. Remaining modules do not start the animation. Experimenting with Unity animation loop settings did not help. (config example is \u0022single animation\u0022 part)\u003C/p\u003E\u003Cp\u003EWhen duplicating animation sequence in Unity (it\u0027s the same old animation from the same .blender file but with different name) I got it to work on two modules, but animation itself got corrupted (wrong turn angles) so I got to remove some colliders for testing purposes. I partly dealt with that by adding first and last keyframes to all parts at both ends of blender clip and reimporting it, but the problem still remains. (config example is \u0022double animation\u0022 part)\u003C/p\u003E\u003Cp\u003EWhen trying to add third clip at config, I realised that science modules disappeared from right-click menu and animation togglers appeared which were not there. (config example is \u0022triple animation\u0022 part)\u003C/p\u003E\u003Cp\u003EGame parts, blender and unity files are in \u003Ca href=\u0022http://kerbal.curseforge.com/ksp-mods/221887-dr-jets-chop-shop/files/2208016/download\u0022 rel=\u0022external nofollow\u0022\u003Earchive\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EI\u0027m currently stuck and see three posibilities of what went wrong.\u003C/p\u003E\u003Cp\u003E1) Maybe I understood the \u0022FxModules\u0022 option and it\u0027s relation to \u0022ModuleAnimateGeneric\u0022 completely wrong. Absolutely no info on that in Google.\u003C/p\u003E\u003Cp\u003E2) Maybe it was not a good idea to animate and re-animate LocRot on parts that only go Loc in Blender.\u003C/p\u003E\u003Cp\u003E3) Maybe I\u0027m still missing something important in Unity animation parameters.\u003C/p\u003E\u003Cp\u003ECan anyone help me finish that, please? Do not want to rework such a nice part for single use.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-07-13T22:06:18Z","Content":"\n\u003Cp\u003EI don\u0027t really know how FxModules works. I though that it just called ModuleAnimateGeneric if it was present, but it\u0027s probably more complicated than that. I\u0027m not aware of any way to get this to work using the stock ModuleScienceExperiment and ModuleAnimateGeneric. Those modules are really only suited for static experiments and for stock parts. And ModuleAnimateGeneric really doesn\u0027t handle multiple animations on the same part very well. \u003C/p\u003E\u003Cp\u003EIt\u0027s possible to make this type of multiple-sample experiment, but it requires a plug-in and it\u0027s not exactly straightforward. \u003C/p\u003E\u003Cp\u003EMy Science experiment plugin handles animations better: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/72466\u0022 rel=\u0022external nofollow\u0022\u003EDMModuleScienceAnimateGeneric\u003C/a\u003E, but it still only handles one sample per module. You could try putting three of those modules on a single part, it might work better. \u003C/p\u003E\u003Cp\u003EI\u0027ve since made a somewhat more generic science module that does work with multiple samples, I might try to work that into DMModuleScienceAnimateGeneric, but probably not any time soon.\u003C/p\u003E\n"},{"CreatedByName":"Dr. Jet","CreatedById":99880,"CreatedDateTime":"2014-07-14T09:49:37Z","Content":"\n\u003Cp\u003ETried with your plugin. Just one module for a start.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E\t{\u003Cbr\u003E    name = DMModuleScienceAnimateGeneric\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\tanimationName = drill\u003Cbr\u003E\tanimSpeed = 1\t\t\t\t\t\t//Speed to play animation\u003Cbr\u003E\tshowEndEvent = false\u003Cbr\u003E\tshowStartEvent = false\u003Cbr\u003E\tshowToggleEvent = false\u003Cbr\u003E\u003Cbr\u003E\tshowEditorEvents = false\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\tcollectActionName = Collect samples\u003Cbr\u003E\tcollectWarningText = *empty string\t\t\t//Warning text to display when retrieving data from the part during EVA - Only applicable with non-rerunnable parts\u003Cbr\u003E\tdataIsCollectable = true\t\t\t\t//Allow EVA Kerbals to collect science reports from the part\u003Cbr\u003E\tcollectActionName = Take away sample\u003Cbr\u003E\texperimentActionName = Take Sample #1\u003Cbr\u003E\texperimentID = surfaceSample\u003Cbr\u003E\thideUIwhenUnavailable = true\u003Cbr\u003E\tinteractionRange = 1.2\t\t\t\t\t//Range for EVA interaction in meters\u003Cbr\u003E\trerunnable = false\u003Cbr\u003E\tresettable = false\u003Cbr\u003E\tresettableOnEVA = true\u003Cbr\u003E\tresourceResetCost = 200\u003Cbr\u003E\tresourceToReset = ElectricCharge\u003Cbr\u003E\tresetActionName = Discard sample\u003Cbr\u003E\treviewActionName = Review sample\u003Cbr\u003E\ttransmitWarningText = There\u0027s nothing to transmit here! You\u0027ll just waste the sample!\u003Cbr\u003E\tuseActionGroups = True\u003Cbr\u003E\txmitDataScalar = 0\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\tcustomFailMessage = No collectable samples found. Are you flying? \u003Cbr\u003E\u003Cbr\u003E\texperimentWaitForAnimation = true\u003Cbr\u003E\tkeepDeployedMode = 2\u003Cbr\u003E\toneWayAnimation = true\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnimation plays continuously in loop even in VAB, won\u0027t stop playing at launchpad and does not react to experiment button. Tried with both \u0022keepDeployedMode = 2\u0022 and \u0022keepDeployedMode = 1\u0022 - still the same. Unity animation is set to \u0022default\u0022, which means \u0022play once if there are no external calls for loop\u0022. Did I miss something in config?\u003C/p\u003E\u003Cp\u003ESpeaking about plugins - it would be just wonderful, if someone write a plugin to collect science to OTHER part (with data storage module) than the part in action. It would only require one animation for multiple experiments and allow to implement Luna-16-style unmanned missions, where returning capsule contained only samples and not the drill itself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-14T09:54:18Z\u0022 title=\u002207/14/2014 09:54  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 14, 2014\u003C/time\u003E by Dr. Jet\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-07-14T22:39:27Z","Content":"\n\u003Cp\u003EThe default wrap mode should be \u0027once\u0027, but you might want to set it to that just to be sure. \u003C/p\u003E\u003Cp\u003EIt sounds like you might have the \u0027play automatically\u0027 box checked and the culling type set to \u0027always animate\u0027. Make sure the box is unchecked and the culling type is set to \u0027based on renderers\u0027. Those are the only reason I can think of for why your animation would be looping all of the time like that. The plugin doesn\u0027t really support looping animations, and never explicitly uses them, so the Unity settings are the only things that should affect how the animation behaves.\u003C/p\u003E\n"},{"CreatedByName":"Dr. Jet","CreatedById":99880,"CreatedDateTime":"2014-07-15T11:22:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003EIt sounds like you might have the \u0027play automatically\u0027 box checked and the culling type set to \u0027always animate\u0027. Make sure the box is unchecked and the culling type is set to \u0027based on renderers\u0027. Those are the only reason I can think of for why your animation would be looping all of the time like that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the generic animation module (single) works fine with the same .mu! How can it be?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-15T12:02:40Z\u0022 title=\u002207/15/2014 12:02  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 15, 2014\u003C/time\u003E by Dr. Jet\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-07-15T14:10:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dr. Jet\u0022 data-cite=\u0022Dr. Jet\u0022\u003E\u003Cdiv\u003EBut the generic animation module (single) works fine with the same .mu! How can it be?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m guessing that ModuleAnimateGeneric explicitly disables the animation on loading and sets it to run in clamp/once mode. Mine does neither of those things.\u003C/p\u003E\n"}]}