{"TopicId":77575,"ForumId":25,"TopicTitle":"SST Eeloo and back challenge","CreatedByName":"eempc","CreatedById":110483,"CreatedDateTime":"2014-07-14T10:44:40Z","PageNum":1,"Articles":[{"CreatedByName":"eempc","CreatedById":110483,"CreatedDateTime":"2014-07-14T10:44:40Z","Content":"\n\u003Cp\u003ESince the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61042-SSTO-to-Eeloo-Can-it-be-done\u0022 rel=\u0022external nofollow\u0022\u003Eold\u003C/a\u003E SSTEAB looks dead, here is a new one. The old challenge didn\u0027t have many participants and having completed every leg of this challenge except the re-entry to Kerbin, I understand why. I won\u0027t lie, it was BORING. The sooner that Eeloo gets put in place around Gas Planet 2, the better. Anyway here are the rules:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EStock engines and intakes only. After all what kind of challenge would it be if you could have a 20k DV interstellar craft with super duper warp drives? \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou can use any propellant containers, wings, and structural components, etc, from balanced mods like B9, SP\u002B, procedual fairings/wings, etc. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou must deliver one kerbal inside a module, no chairs. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EState whether you use FAR or stock aerodynamics and no switching between the two for the duration of the mission. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENo refuelling and no landers. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENo exploits or ridiculous clipping. If you go stock aerodynamics, you will need a good ratio of intakes to engines for aerospace planes, so if you need to airhog, go for it. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGravity assists are fine if you want to show off but there is also another challenge of getting to Eeloo with the least DV. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EShowcase your journey with a few pictures. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EMission Summary\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAerodynamic model: FAR\u003C/p\u003E\u003Cp\u003ETime: 17 years\u003C/p\u003E\u003Cp\u003ECraft propulsion: 2 turbojets, 2 ram intakes, SP\u002B wings and tailplanes, 1 LV-N, 1440 units of fuel, 1600 oxidiser\u003C/p\u003E\u003Cp\u003EMission accomplishments: flew to Eeloo, orbited Eeloo, landed on Eeloo, took off from Eeloo, returned to Kerbin orbit\u003C/p\u003E\u003Cp\u003EFailed to land.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EPictures Showcase\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELaunching the ill-fated craft whose CoM and CoL would be wrong later.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/82505487767333656/78903AF31533A8ADD0D22E97C5E762DEC2712468/\u0022 alt=\u002278903AF31533A8ADD0D22E97C5E762DEC2712468\u0022\u003E\u003C/p\u003E\u003Cp\u003E6972 m/s DV once in orbit\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/82505487767711828/16DC17CC0EFC0DDD12FB7729D7EDC1143849FF4E/\u0022 alt=\u002216DC17CC0EFC0DDD12FB7729D7EDC1143849FF4E\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ejection burn was messy. With such a long burn time, it actually took around 2500 m/s instead of 2100 m/s. Needed a 345 m/s correction burn to reach Eeloo.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/82505487767795827/97025B7983E7193688C1838FFEAC762FB0CDFF46/\u0022 alt=\u002297025B7983E7193688C1838FFEAC762FB0CDFF46\u0022\u003E\u003C/p\u003E\u003Cp\u003E1604 m/s needed for circularisation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/82505487767835179/41EC90CB464360373483CB2C02D0B49D8C2DC40A/\u0022 alt=\u002241EC90CB464360373483CB2C02D0B49D8C2DC40A\u0022\u003E\u003C/p\u003E\u003Cp\u003EI tried horizontal landings at 150 m/s, 100 m/s and 50 m/s horizontal speeds but the terrain was having none of them, so it had to be vertical.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/82505487767880782/751EB215EF01770117D4685600216844C8E9F0D4/\u0022 alt=\u0022751EB215EF01770117D4685600216844C8E9F0D4\u0022\u003E\u003C/p\u003E\u003Cp\u003E2027 m/s DV leftover to get into orbit and return to Kerbin. In retrospect I probably could have done a better landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/82505487767871112/708CF7E0B535BE900E0F6A5475BE2CC51EACD11C/\u0022 alt=\u0022708CF7E0B535BE900E0F6A5475BE2CC51EACD11C\u0022\u003E\u003C/p\u003E\u003Cp\u003EI had to wait about 5 years for this trajectory to open up. 10 degrees phase angle!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/82505487767980466/24F9C17BD772519AF2F7FBECC0B15685006A92F5/\u0022 alt=\u002224F9C17BD772519AF2F7FBECC0B15685006A92F5\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis was the part I realised when I should have actually tested my ship instead of throwing it together and launching. This is a retrograde entry into the upper atmosphere only to bring apoapsis down into a stable orbit. A prograde entry was too dangerous because the CoM was behind the CoL and there was literally no fuel left to shift.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/82505487768086366/2F2A49C439E234B2E17A4C6EA276B72B425BC5BA/\u0022 alt=\u00222F2A49C439E234B2E17A4C6EA276B72B425BC5BA\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter several attempts to land, I gave up. Jebediah is stuck in orbit after a 17 year journey to the most boring planet in the Kerbolar system.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-15T17:50:13Z\u0022 title=\u002207/15/2014 05:50  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 15, 2014\u003C/time\u003E by eempc\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jonatron5","CreatedById":103965,"CreatedDateTime":"2014-07-15T17:11:44Z","Content":"\n\u003Cp\u003ESeems like most peopel are avoiding this challenge. Ill try it once I get back from work. My plan is for an insanly light ssto and put like 5 ion engines on the back. Ittl be slow but it ought to get there.\u003C/p\u003E\u003Cp\u003EReserve me a spot on the leaderboards lol\u003C/p\u003E\n"},{"CreatedByName":"eempc","CreatedById":110483,"CreatedDateTime":"2014-07-15T17:42:41Z","Content":"\n\u003Cp\u003EWell I didn\u0027t exactly sell the challenge in the first paragraph, lol. But the reason I did this challenge was not only to see if it was feasible, but one day, Eeloo will be placed into orbit around a parent planet and the current challenge will no longer be doable.\u003C/p\u003E\n"},{"CreatedByName":"PLAD","CreatedById":104158,"CreatedDateTime":"2014-08-14T20:52:49Z","Content":"\n\u003Cp\u003ESorry to wait so long on this, I hadn\u0027t built a successful SSTO before and the flight took a while. I hope the thread isn\u0027t considered dead yet.\u003C/p\u003E\u003Cp\u003EMission summary: SSTO from Kerbin surface to Eeloo surface and back. Stock aerodynamics, all stock parts except for Mechjeb. 11 years 277 days total mission time.\u003C/p\u003E\u003Cp\u003EShip: 12.059 tons on the launchpad, 62 parts. No clipping except for the ladders, little girders, and one slightly misplaced air intake. 3207m/s available once in LKO. 7.5 intakes per jet engine.\u003C/p\u003E\u003Cp\u003EFlight profile: K-Mun-Eve-K-K-Jool-Eeloo out, then Eeloo-Jool-Kerbin back. Additional non-useful flybys of Minmus and Mun. 1955m/s from LKO to Eeloo surface and 942m/s from Eeloo surface to parachutes opening on Kerbin. (Softened landing with final thrust, would have landed at 17m/s without it.) \u003C/p\u003E\u003Cp\u003E LKO to Eeloo surface and back to Kerbin for 2897m/s!!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/kdwDf\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"chengong","CreatedById":118810,"CreatedDateTime":"2014-08-15T05:35:39Z","Content":"\n\u003Cp\u003EI did this back then for the Reddit orange tank challenge, but I ditched the wings and jets upon leaving atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-08-16T23:46:10Z","Content":"\n\u003Cp\u003EI know I have stock crafts capable of it if I can stick the landing. 7000\u002B m/s DV. Problem is FAR\u0027s recent rebalancing makes stock\u002BFAR nigh-impossible to efficiently burn to orbit purely on nukes, and carrying RAPIERs with you isn\u0027t exactly a good solution either.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-09-01T16:29:39Z","Content":"\n\u003Cp\u003ERe. Exploits:\u003C/p\u003E\u003Cp\u003E Is infinigliding illegal? I\u0027m working on an Eve SSTO and it relies on infinigliding and ion engines. I\u0027m pretty sure my current prototype can pull off SSTO to Eeloo and back from Kerbin (stock parts and physics). Should I give it a go, or would it be disqualified?\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"}]}