{"TopicId":77623,"ForumId":55,"TopicTitle":"Same style for shown values of money in VAB","CreatedByName":"Luxmaster-CZ","CreatedById":21176,"CreatedDateTime":"2014-07-14T18:37:40Z","PageNum":1,"Articles":[{"CreatedByName":"Luxmaster-CZ","CreatedById":21176,"CreatedDateTime":"2014-07-14T18:37:40Z","Content":"\n\u003Cp\u003EIn VAB make Cost meter and avaiable funds meter in same format. Right now, even single digits arent above its respective others, so figuring if my cost is less/more and how much do I have left need reading both values everytime and estimating it in mind, instead of single glance on counters and seeing, that left most digit of cost is more to the right than left most digit of avaiable funds, so I can add much more parts\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-07-14T18:40:08Z","Content":"\n\u003Cp\u003EAgreed. Decimal or no Decimal, pick one and stick with it. I got confused just watching the videos.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-07-14T18:42:54Z","Content":"\n\u003Cp\u003EYep, I posted this in that sneak peak video a few days ago, but it got buried:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso one thing I noted, in the VAB, with the funds counter at the bottom right, they didn\u0027t seem to be lined up the same. It looked like:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E   39576.56\u003Cbr\u003E    4315245\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a slight niggle but wouldn\u0027t it make more sense to line them up so we can immediately see which one\u0027s bigger? Maybe it was the youtube quality, but having to parse the different decimal places in the figures as well as actually reading them takes longer than just seeing if 3 is bigger than 2. Not to mention they\u0027re different fonts and have different spacing. In essence, I\u0027m just saying that this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E    39576.56\u003Cbr\u003E  4315245.00\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIs easier and quicker to parse.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECompletely agree with OP.\u003C/p\u003E\n"},{"CreatedByName":"geb","CreatedById":5399,"CreatedDateTime":"2014-07-14T19:30:28Z","Content":"\n\u003Cp\u003EYes. Same format, same width of font. Anything else is annoying.\u003C/p\u003E\n"},{"CreatedByName":"Korro","CreatedById":66526,"CreatedDateTime":"2014-07-14T23:44:50Z","Content":"\n\u003Cp\u003EThis is an perfect Example for an little thing were everybody say\u0027s yahhh is in 1 Minute done we do this at the end.\u003C/p\u003E\u003Cp\u003EThen it becomes forgotten because everybody works with the little format issue and become accustomed to this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHappens more than you think in development!\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-07-15T01:18:30Z","Content":"\n\u003Cp\u003EYep, this one seems like a no-brainer. \u002B1.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-15T01:29:01Z","Content":"\n\u003Cp\u003ESeems like common sense to me. Good idea.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-07-15T01:35:54Z","Content":"\n\u003Cp\u003E\u002B1 approved. No problem with different fonts and styles (and in fact I think I prefer that) but identical character width is a must.\u003C/p\u003E\n"},{"CreatedByName":"Farmercy","CreatedById":103831,"CreatedDateTime":"2014-07-15T13:55:16Z","Content":"\n\u003Cp\u003EWhy would you have different styles in the first place? Its not only a different style but also seems to be a different number format - wth O_o\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-07-15T14:28:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Farmercy\u0022 data-cite=\u0022Farmercy\u0022\u003E\u003Cdiv\u003EWhy would you have different styles in the first place? Its not only a different style but also seems to be a different number format - wth O_o\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDifferent styles looks nice so it\u0027s not a grid of either white squares with black numbers, or green LCD style numbers. Different fonts and colors breaks it up visually and allows you to put them in perfect columns without making it into a number grid.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-07-15T14:34:11Z","Content":"\n\u003Cp\u003ECompletely agree. Decimal point above decimal point and font width matching.\u003C/p\u003E\n"}]}