{"TopicId":77646,"ForumId":44,"TopicTitle":"KSP Community CubeSat","CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-07-14T22:43:38Z","PageNum":48,"Articles":[{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2014-09-13T15:45:25Z","Content":"\n\u003Cp\u003EIf we did a Phobos lander, would we be the first to land there?\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-09-13T18:17:49Z","Content":"\n\u003Cp\u003EAll of us. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-13T18:21:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003EIf we did a Phobos lander, would we be the first to land there?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Yes. It\u0027s far more likely we\u0027d be the fourth to fail to land there.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-09-13T18:29:19Z","Content":"\n\u003Cp\u003ESo you\u0027re saying that you think that the Phobos Lander mission would fail? Even though we\u0027re planing it to be the 5th or 4th mission?\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-13T18:49:50Z","Content":"\n\u003Cp\u003ELavochkin have done a lot more than 4 or 5 missions, and they couldn\u0027t hack it. They weren\u0027t trying to use such a constrained form-factor either.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-09-13T19:03:04Z","Content":"\n\u003Cp\u003EI checked Wikipedia, and the only Phobos mission they ever worked on was Phobos-Grunt, and that was due to a launch vehicle failure, and we won\u0027t be doing ANYTHING with LVs, we\u0027ll be making the CubeSat.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-13T19:03:40Z","Content":"\n\u003Cp\u003EThen you didn\u0027t check wikipedia very well. They made Phobos 1 and 2.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-09-13T19:10:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThen you didn\u0027t check wikipedia very well. They made Phobos 1 and 2.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd Phobos 2 had a comms failure.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-13T19:14:36Z","Content":"\n\u003Cp\u003EComputer failure. What\u0027s you point? A phobos cubesat would have to perform complex tasks with extremely limited mass, space, data, and power budgets. Combine that with the radiation environment and limited budget for testing, and there\u0027s no reason to expect it to do any better.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nicholander\u0022 data-cite=\u0022Nicholander\u0022\u003E\u003Cdiv\u003EI checked Wikipedia, and the only Phobos mission they ever worked on was Phobos-Grunt, and that was due to a launch vehicle failure, and we won\u0027t be doing ANYTHING with LVs, we\u0027ll be making the CubeSat.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe launch was entirely successful. The upper stage only failed because it was a modified version without it\u0027s own flight computer-the probe\u0027s own computer failed and doomed it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-13T19:46:17Z\u0022 title=\u002209/13/2014 07:46  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 13, 2014\u003C/time\u003E by Kryten\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-09-13T19:51:30Z","Content":"\n\u003Cp\u003EOkay, but on the Lavochkin Wikipedia page, it doesn\u0027t list Phobos 1 and 2 on the list of spacecraft they worked on, but it does mention it int there history. But the Soviet political and power system was completely different then what we have, and technology has advanced since then. Anyway, Phobos-Grunt was freaking sample return, so they had to make it so it not only lands on Phobos, but it then has to get ALL THE WAY BACK TO EARTH!!!!\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-13T20:01:40Z","Content":"\n\u003Cp\u003EThere are plenty of constraints that technology won\u0027t solve. Just how is this cubesat supposed to communicate, for example? You won\u0027t exactly get a large antennae on a cubesat bus.\u003C/p\u003E\n"},{"CreatedByName":"ProjectThoth","CreatedById":119189,"CreatedDateTime":"2014-09-13T20:30:29Z","Content":"\n\u003Cp\u003EIn response to some of your questions:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nicholander\u0022 data-cite=\u0022Nicholander\u0022\u003E\u003Cdiv\u003E What do you think about having the Lunar Orbiter orbiting over the Lunar poles, which will give us a clear view of the Lunar poles, which as of now the only pictures we have are just stitched together ones from equatorial orbits. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt really depends on what kind of orbit Astrobotic\u0027s first mission is in. Lacus Mortis, the target landing zone, sits at a healthy latitude of 45.0 degrees North. Using a bit of extrapolation (and some rough estimates, because I don\u0027t know where my protractor is), it looks like their target orbit is going to be about 65 degrees. That\u0027s good news and bad news. Good news: We\u0027ll be able to photograph most of the poles from that inclination. (or at least, closer than anyone has been before). Bad news: \u003Cem\u003EJebediah Kerman\u003C/em\u003E isn\u0027t going to last very long. See, there\u0027s these things called \u0022mascons\u0022 in the Moon - areas where the gravitational pull of the Moon is slightly stronger - and they can perturb the orbits of low-altitude satellites to the point of crashing into the surface. The simple solution is a reboost every once in a while, but we might run out of propellant a lot faster that way. So this is a pretty big challenge to surmount, but I think we can do it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E \u003Cspan style=\u0022color:#333333;\u0022\u003EI want to see more on that \u0022Spinx\u0022 spacecraft of yours. \u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIt\u0027s basically a revamped Apollo LM descent stage. Here\u0027s a whole quarterly report volume on the thing: \u003C/span\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0BzQZ3LhGXAoTVEtRakQ4dFdPSzg/edit?pli=1\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/file/d/0BzQZ3LhGXAoTVEtRakQ4dFdPSzg/edit?pli=1\u003C/a\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E. Table 4 is close to what the manned version of Sphinx will be, and Table 7 is what it will be with cargo - which is what will debut first.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI\u0027m seeing some concern about our Phobos lander project. Namely, in regards to communication - remember that Sphinx, as a Falcon Heavy upper stage, is able to carry about a half a metric tonne of payload to Mars orbit. Eagle eyed observers among you will note that the TMI capacity of FH is about ten metric tonnes, almost exactly the mass of just Sphinx alone. There\u0027s enough of a delta-v margin for Sphinx to complete the trans-Mars injection burn and park in a rendezvous orbit for Phobos. (The latter takes 1.41 km/s of delta-v, and we have about 5.4 km/s to work with). In fact, Sphinx alone could conduct the TMI burn and still make it to Phobos, with 1.8 km/s of delta-v to spare! That\u0027s a launch aboard a Falcon 9 right there, and not a Falcon Heavy.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EWhat I\u0027m trying to say here is that we absolutely have enough mass for a communications relay to either be bolted to Sphinx, or as a small spacecraft orbiting Phobos. So don\u0027t worry about that so much.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAnyway, tonight I\u0027m going to sketch up some plans for a Phobos lander and run it by y\u0027all. Hope you folks like it.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-09-13T21:43:24Z","Content":"\n\u003Cp\u003ELaunching a 10 ton payload just to get a cubesat or similar to phobos is probably out of our price range- it\u0027s more the domain of a \u0022Proper\u0022 space program. That\u0027s why we\u0027ve been focusing so much on economizing the D/V budget, to squeeze everything into a 3u that can go up on a normal commercial launch as ballast for much less than a proper launch.\u003C/p\u003E\u003Cp\u003EOne thing we might consider for a 3u\u0027s comunicatios consider is having a 3u that folds it\u0027s frame out into a 70cm antenna, or even a 130cm antenna\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-13T21:47:23Z\u0022 title=\u002209/13/2014 09:47  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 13, 2014\u003C/time\u003E by Rakaydos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-09-13T21:55:31Z","Content":"\n\u003Cp\u003EAlso, ProjectThoth, I forgot to mention how it lands on Phobos:\u003C/p\u003E\u003Cp\u003EThe Phobos Lander CubeSat will have no landing legs, but instead will slow down until it\u0027s \u0022Hovering\u0022 (I say that in quotation marks because it doesn\u0027t have it\u0027s engines on to keep it hovering, it just slows down until it isn\u0027t going down/falling, and then turns off it\u0027s engine(s))just above the surface (20-30 Cm), turn off it\u0027s engines, and then change it\u0027s attitude using RCS to point horizontally, and on the side of it that\u0027s pointing towards Phobos (While it\u0027s being horizontal) will have a \u0022Bumper\u0022. The bumper will cushion it\u0027s small fall towards Phobos, just to make sure nothing gets damaged. It may bounce a tiny bit, but it\u0027s negligible and it will land safely, and with out the need for heavy landing legs and the system required to deploy them.\u003C/p\u003E\n"},{"CreatedByName":"ProjectThoth","CreatedById":119189,"CreatedDateTime":"2014-09-14T02:24:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003ELaunching a 10 ton payload just to get a cubesat or similar to phobos is probably out of our price range- it\u0027s more the domain of a \u0022Proper\u0022 space program.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, it\u0027d be through Astrobotic, and not a one-off thing. It\u0027d be out of your price range if you did it just for one mission. Bear in mind that Sphinx is going to be used a \u003Cem\u003Elot\u003C/em\u003E for various missions aside from just the Phobos launch.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003EOne thing we might consider for a 3u\u0027s comunicatios consider is having a 3u that folds it\u0027s frame out into a 70cm antenna, or even a 130cm antenna\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003EIt\u0027s not the \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003Esize\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003E of the antenna that\u0027s gonna be the problem; it\u0027s the \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003Epower\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003E. CubeSats are tiny, and the amount of electricity you\u0027d need to broadcast all the way back to Earth is way more than they can produce (the inverse square law isn\u0027t your friend at all). Also, without a relay, you\u0027d go dark for about four hours at a time. The mass available in a Sphinx launch is enough for one of those, without a doubt.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nicholander\u0022 data-cite=\u0022Nicholander\u0022\u003E\u003Cdiv\u003E The Phobos Lander CubeSat will have no landing legs, but instead will slow down until it\u0027s \u0022Hovering\u0022 (I say that in quotation marks because it doesn\u0027t have it\u0027s engines on to keep it hovering, it just slows down until it isn\u0027t going down/falling, and then turns off it\u0027s engine(s))just above the surface (20-30 Cm), turn off it\u0027s engines, and then change it\u0027s attitude using RCS to point horizontally, and on the side of it that\u0027s pointing towards Phobos (While it\u0027s being horizontal) will have a \u0022Bumper\u0022. The bumper will cushion it\u0027s small fall towards Phobos, just to make sure nothing gets damaged. It may bounce a tiny bit, but it\u0027s negligible and it will land safely, and with out the need for heavy landing legs and the system required to deploy them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#3e3e3e;\u0022\u003EClever, but I\u0027d like to propose something else. A tether a winch, and a wardrobe - er, harpoon.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#3e3e3e;\u0022\u003EBasically, the lander would fire a harpoon at Phobos (probably a small rocket-powered thing) at an altitude of about 20 meters, and then the CubeSat would winch itself towards the surface. Simple, no crazy maneuvers, no bouncing (which scares me, seeing as you could escape from Phobos with a bicycle) and probably \u0022dumb\u0022 (as in simple) enough to work even without radio contact from Earth. Plus, a rocket-powered harpoon is rather Kerbal, don\u0027t ya think?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-09-14T03:22:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nicholander\u0022 data-cite=\u0022Nicholander\u0022\u003E\u003Cdiv\u003EAlso, ProjectThoth, I forgot to mention how it lands on Phobos:\u003Cp\u003EThe Phobos Lander CubeSat will have no landing legs, but instead will slow down until it\u0027s \u0022Hovering\u0022 (I say that in quotation marks because it doesn\u0027t have it\u0027s engines on to keep it hovering, it just slows down until it isn\u0027t going down/falling, and then turns off it\u0027s engine(s))just above the surface (20-30 Cm), turn off it\u0027s engines, and then change it\u0027s attitude using RCS to point horizontally, and on the side of it that\u0027s pointing towards Phobos (While it\u0027s being horizontal) will have a \u0022Bumper\u0022. The bumper will cushion it\u0027s small fall towards Phobos, just to make sure nothing gets damaged. It may bounce a tiny bit, but it\u0027s negligible and it will land safely, and with out the need for heavy landing legs and the system required to deploy them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s assuming we have enough TWR to have a dead stop above the surface, not guarenteed if we went for an Ion engine.\u003C/p\u003E\u003Cp\u003EAlternate techniques call for landing \u0022aircraft style\u0022 at phobos orbital velocity (of a whopping 8m/s tangental to the surface), and sledding to a stop.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-09-14T04:23:15Z","Content":"\n\u003Cp\u003EWell, how much do you think a little \u0022Bumper cushion\u0022 costs and is risky? And compare it to the sled and harpoon. The \u0022Bumper cushion\u0022 seems for more practical, cheaper, and safer.\u003C/p\u003E\n"},{"CreatedByName":"ProjectThoth","CreatedById":119189,"CreatedDateTime":"2014-09-14T04:33:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nicholander\u0022 data-cite=\u0022Nicholander\u0022\u003E\u003Cdiv\u003EWell, how much do you think a little \u0022Bumper cushion\u0022 costs and is risky? And compare it to the sled and harpoon. The \u0022Bumper cushion\u0022 seems for more practical, cheaper, and safer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d feel better if we had landing thrusters, at the very least. Like a short burst of RCS to shove ourselves into Phobos. I\u0027m more concerned with the bumper bouncing off into space than anything else.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-14T05:33:22Z","Content":"\n\u003Cp\u003EA full set of RCS thrusters would likely fill the entire mass budget, not taking into account anything else.\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2014-09-14T05:34:58Z","Content":"\n\u003Cp\u003EIf you Orbit phobos first and come to a dead stop within it\u0027s sphere of influence as far as i know it would be physically impossible for it to somehow gain momentum and bounce out of the SOI.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-14T05:49:33Z","Content":"\n\u003Cp\u003EThe SOI model doesn\u0027t work too well at the best of times; around a body with as irregular a shape and subjected to as high tidal forces as Phobos, it\u0027s pretty much useless.\u003C/p\u003E\n"},{"CreatedByName":"ProjectThoth","CreatedById":119189,"CreatedDateTime":"2014-09-14T05:57:55Z","Content":"\n\u003Cp\u003EAlright, I\u0027m feeling better about the bumper landing system. Have any of you done any studies in regards to how we\u0027d fit something like this into a CubeSat?\u003C/p\u003E\u003Cp\u003EEDIT: Didn\u0027t catch Kryten\u0027s comment - agreed on that. Feeling less better about the bumper now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-14T06:14:35Z\u0022 title=\u002209/14/2014 06:14  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 14, 2014\u003C/time\u003E by ProjectThoth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-09-14T06:37:36Z","Content":"\n\u003Cp\u003EIt\u0027s been awhile, but most of the phobos studies we\u0027ve worked on have focused on building ~1500 m/s of delta V into a 4.5 KG cubesat. With a LTO launch instead of GTO, we can shave about a third of that off, but that\u0027s still talking about an ion engine that may not have the TWR to do a controlled landing- Real life ion engines are REALLY weak.\u003C/p\u003E\n"},{"CreatedByName":"ProjectThoth","CreatedById":119189,"CreatedDateTime":"2014-09-14T07:30:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EIt\u0027s been awhile, but most of the phobos studies we\u0027ve worked on have focused on building ~1500 m/s of delta V into a 4.5 KG cubesat. With a LTO launch instead of GTO, we can shave about a third of that off, but that\u0027s still talking about an ion engine that may not have the TWR to do a controlled landing- Real life ion engines are REALLY weak.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy so much delta-v? At this point, you could use Sphinx for the low orbit - Phobos transfer. Stick to chemical for the landing, mostly because it\u0027s reliable and doesn\u0027t require so much energy (a CubeSat ion thruster has thrust in the micronewtons at the trade-off of a huge electrical draw).\u003C/p\u003E\u003Cp\u003EHere\u0027s what I suggest, overall: Stick to chemical, make it as \u0022dumb\u0022 (as in foolproof) as possible, and have a Mars-Phobos Lagrange 4 or 5 communications relay in your plans. Additionally, remember that you now have ~500 kilos of mass to work with for both the lander and relay sat, so there\u0027s now plenty of room for things like rocket harpoons and landing gear.\u003C/p\u003E\u003Cp\u003EI also advise, instead of simply talking about it, to start making diagrams and planning this out in as much detail as possible. Quarterly reports and volumes of them are your friend. This thread is about 120 pages long, and things are bound to get lost in the chaos. Assigning people to doing certain jobs (like two or three folks to review the landing system, two or three folks to study landing sites, and so on) is also a really good idea, and helps when it comes to organizing thoughts. This is also important for when the time comes to sell this idea to the rest of the KSP community/the world.\u003C/p\u003E\u003Cp\u003EAlso, just to give us a deadline, let\u0027s assume a launch date of late July, 2022 and an arrival of April 22, 2023. While that might seem like a long time to go, it\u0027s only about 2,853 days away and counting according to \u003Ca href=\u0022http://www.timeanddate.com/countdown/to?iso=20220708T00\u0026amp;p0=769\u0026amp;fg1=8fb32d\u0026amp;fg2=9acd79\u0026amp;msg=KSP\u002BPhobos\u002BLander\u002BLaunch\u0022 rel=\u0022external nofollow\u0022\u003Ethis clock\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EI think we\u0027ve got it in us to do something that, literally, nobody else has done before. The make-or-break factor is really organization and putting that first wobbly, semi-confident step forward into the unknown.\u003C/p\u003E\u003Cp\u003E(Sidenote: Unless we\u0027ve already got a name, I vote we christen the lander \u003Cem\u003EScott Manley\u003C/em\u003E).\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-09-14T14:26:02Z","Content":"\n\u003Cp\u003EBut remember, the \u0022Sphinx\u0022 is the size of the LEM descent stage, and thus has similar weight. So yes, it is possible for the CubeSat to have harpoons and landing gear if we manage to convince a LV provider to get us there in the first place. But anyway, even if we do get \u0022Sphinx\u0022 up an running, why do you need landing gear and harpoons? That weight could be taken up by scientific equipment, cameras, communication equipment, etc. So even if you can put fancy risky landing mechanisms, there\u0027s really no point when you got, safer, cheaper, and safer options.\u003C/p\u003E\u003Cp\u003EAnd the launch date? Yeah, that seems reasonable, did you use \u003Ca href=\u0022http://clowder.net/hop/railroad/sched.html\u0022 rel=\u0022external nofollow\u0022\u003Ethis \u0022Cosmic Train Schedule\u0022?\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor the name, we haven\u0027t decided it yet, but I really believe that we should name it KerbSat, like KerbSat-1, KerbSat-2, etc.\u003C/p\u003E\n"}]}