{"TopicId":77646,"ForumId":44,"TopicTitle":"KSP Community CubeSat","CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-07-14T22:43:38Z","PageNum":63,"Articles":[{"CreatedByName":"kanelives","CreatedById":77200,"CreatedDateTime":"2014-11-14T20:38:59Z","Content":"\n\u003Cp\u003EIf you guys ever did plan to land something, do you know if there are any biological contamination procedures you\u0027d need to follow? NASA goes through a lot of effort to make sure they don\u0027t inadvertently end up putting signs of life on other planets cause that would be bad and it also makes it hard to see if you detected yourself or something from the planet.\u003C/p\u003E\n"},{"CreatedByName":"deljr15","CreatedById":77485,"CreatedDateTime":"2014-11-15T02:30:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kanelives\u0022 data-cite=\u0022kanelives\u0022\u003E\u003Cdiv\u003EIf you guys ever did plan to land something, do you know if there are any biological contamination procedures you\u0027d need to follow? NASA goes through a lot of effort to make sure they don\u0027t inadvertently end up putting signs of life on other planets cause that would be bad and it also makes it hard to see if you detected yourself or something from the planet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight now we are focusing on LEO. \u003C/p\u003E\u003Cp\u003EOn the topic of contamination. I would bet any mission to outside of HEO will have some major space agency get involved requiring that. (gut shot on that - no real experiance)\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-11-15T13:01:16Z","Content":"\n\u003Cp\u003EAh, but we have the miracle of something called \u003Cem\u003Eletters.\u003C/em\u003E NASA can ignore an e-mail, but not a letter. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(edit) possibly.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-11-15T13:23:00Z","Content":"\n\u003Cp\u003EI don\u0027t think we are ready to send a letter/Email/notification/whatever to a space agency yet, we don\u0027t even have a full blueprint/design yet!\u003C/p\u003E\u003Cp\u003EI mean come on people, we have 46.5 days until the end of 2014, we gotta move it people! We won\u0027t get any where NEAR space if we continue at this sluggish pace of 5 or so posts a day, so we gotta speed that up, say 15 posts a day at minimum.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-11-15T15:45:09Z","Content":"\n\u003Cp\u003EWhew, let\u0027s say my laptop got rather... incapacitated. I\u0027m back and ready. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWe need to have a base design by the end of 2014, so getting done with the requirements for the bio experiment should be our number 1 priority. Is Luis still in contact with that professor? We\u0027ll need some professional help.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-11-17T02:05:34Z","Content":"\n\u003Cp\u003EGood to have you back astropapi1! Also, a diagram of our CubeSat design would help, especially for the visual thinkers here. (Including me!)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-17T02:09:42Z\u0022 title=\u002211/17/2014 02:09  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 17, 2014\u003C/time\u003E by Nicholander\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-17T02:41:52Z","Content":"\n\u003Cp\u003EI\u0027d be a bit cautious with diagrams for a moment. Consider everything as very-far-from-final.\u003C/p\u003E\u003Cp\u003EOne of the big questions is how much power we need, and if we need to do something weird to get it. I see four options on power consumption ranging from most power to least.\u003C/p\u003E\u003Cp\u003EKeep in mind, \u0022day\u0022 averages are given. Cut in half to get orbit averages.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E4 side pannels open 90Ã‚Â°. 5 panels total exposed to direct Sun light. 10W production. Rotation axis connects centers of front and rear faces.\u003Cbr\u003EAdvantages: Lots of power.\u003Cbr\u003EDrawbacks: Mechanical complexity.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E3 \u0022front\u0022 faces covered. 3 panels at 58% exposure. 3.5W production. Rotation axis connects opposite corners.\u003Cbr\u003EAdvantages: Best usage with fixed geometry.\u003Cbr\u003EDrawback: Trying to pack everything around a diagonal.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E4 side panels covered. 1 to 2 panels at 0% to 100% exposure. 2.5W production. Rotation axis connects centers of opposite faces and is perpendicular to Sun light.\u003Cbr\u003EAdvantages: Standard axis.\u003Cbr\u003EDrawbacks: Very poor cost efficiency and nightmare to control.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFront panel only. 1 pannel exposed to direct Sun light. 2W production. Rotation axis connects centers of front and rear faces.\u003Cbr\u003EAdvantages: Simple. Cost-efficient.\u003Cbr\u003EDrawbacks: 2W. That\u0027s 1W averaged over night/day, which barelly keeps us operational.\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIn a nutshell, this is also my argument for folding side pannels. But there are at least 3 radically different configurations here, so we need to decide on which one we\u0027re going with before we start producing art.\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-11-17T02:56:12Z","Content":"\n\u003Cp\u003EMaybe the problem isn\u0027t even getting power. I\u0027m probably totally wrong here, but couldn\u0027t a beefed up super battery provide for short-time communication (but still HD video aka lots of power)? And then it recharges as it \u0022sleeps\u0022 until the next communication.\u003C/p\u003E\u003Cp\u003EBefore we decide how much power we should get, we should decide how much power we\u0027d need in a perfect situation, in a very good but still realistic situation, in a pessimistic but realistic situation, and bare-minimum situation. Also this type of reasoning would allow for easily planning contingency plans in case things go wrong. For example having panels fold out is risky, but if they still work when folded (albeit lower wattage) to allow mission success (but no video \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E ) then that\u0027s better than having the whole mission fail.\u003C/p\u003E\u003Cp\u003EK^2, I see your ideas and your point. But we should definitely have (very early) sketches of how each of the ideas would work. I\u0027m also a visual kind of guy, Nicholander, too bad i can\u0027t draw for **** \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ETL;DR How much power would we need optimistically/pessimistically/bare-bones for the mission?\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2014-11-17T02:57:40Z","Content":"\n\u003Cp\u003EMy vote is for option 1 possibly with modifications. Option 1 gives us the most power with a fairly simple setup. It could also be modified to give us 3 panels instead of 5 at full exposure.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-17T04:08:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022henryrasia\u0022 data-cite=\u0022henryrasia\u0022\u003E\u003Cdiv\u003EMaybe the problem isn\u0027t even getting power. I\u0027m probably totally wrong here, but couldn\u0027t a beefed up super battery provide for short-time communication (but still HD video aka lots of power)? And then it recharges as it \u0022sleeps\u0022 until the next communication.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is never going to be a real sleep mode. CPU will have to be awake to listen to comms. That\u0027s 125mW. Amps on receiver can be comparable. I don\u0027t even know how much power we\u0027ll need for attitude control. Plus various losses, and potentially cooling power requirements. It\u0027s going to be hard fitting into 1W average as it is. And then we still need to be storing power for transmitter. I don\u0027t know how much power we really need for this, but 200W seems to be limit for most amateur frequencies. That points to a very long recharge time. And I don\u0027t know about you, but I\u0027d like to be able to at least have the juice to beam down a JPEG every time we talk to the sat.\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2014-11-17T04:38:00Z","Content":"\n\u003Cp\u003EJust to clarify we would only transmit during sunlight minutes so that we can guarantee a charge before we go back around the dark side right?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-17T04:41:21Z","Content":"\n\u003Cp\u003EI\u0027d rather have a safety cutoff that cuts transmission if voltage drops bellow certain level. But in the worst case scenario, the system should be self-restarting. Hopefully, even if it runs out of power, it can last 45 minutes without total loss.\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2014-11-17T04:46:21Z","Content":"\n\u003Cp\u003EWhat kind of battery cpacity would we be looking at with this anyway? I took a look at cubesat batteries a while back and I remember they weren\u0027t quite astounding. If we shut down because of a lack of power could we get a full charge back after just 45 minutes of full exposure or would we have to wait a while before another transmission?\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-11-17T04:56:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dharak1\u0022 data-cite=\u0022dharak1\u0022\u003E\u003Cdiv\u003EMy vote is for option 1 possibly with modifications. Option 1 gives us the most power with a fairly simple setup. It could also be modified to give us 3 panels instead of 5 at full exposure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree, because it is far more taxing on a battery/electronics to power up/down, best to give it lots of charge power and ignore the need for sleep mode. Otherwize, the battery and systems are more likely to fail, because turning on/off is when a circuit is most taxed.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-11-17T06:09:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E4 side pannels open 90Ã‚Â°. 5 panels total exposed to direct Sun light. 10W production. Rotation axis connects centers of front and rear faces.\u003Cbr\u003EAdvantages: Lots of power.\u003Cbr\u003EDrawbacks: Mechanical complexity.\u003Cbr\u003Eadds an extra failure mode, I\u0027d prefer to avoid if possible.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/li\u003E\u003Cli\u003E3 \u0022front\u0022 faces covered. 3 panels at 58% exposure. 3.5W production. Rotation axis connects opposite corners.\u003Cbr\u003EAdvantages: Best usage with fixed geometry.\u003Cbr\u003EDrawback: Trying to pack everything around a diagonal.\u003C/li\u003E\u003C/ol\u003E\u003C/div\u003E\u003C/blockquote\u003EWould the diagonal make the gravity variation across the moss itself worse/messier? If not, or if that\u0027s workable, I think this sounds good.\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-17T06:13:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dharak1\u0022 data-cite=\u0022dharak1\u0022\u003E\u003Cdiv\u003EWhat kind of battery cpacity would we be looking at with this anyway? I took a look at cubesat batteries a while back and I remember they weren\u0027t quite astounding. If we shut down because of a lack of power could we get a full charge back after just 45 minutes of full exposure or would we have to wait a while before another transmission?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m assuming standard LiPo is fine. These are 3.7V standard. CPU needs 5V, and there aren\u0027t good opportunities to step it up. Solar panels will bring something like 4V-5V, depending on temperature. So that means two banks in series (each bank can have 1 or more cells in parallel) that charge at roughly 2.5A with full illumination of 5 panels.\u003C/p\u003E\u003Cp\u003EThat gives us a total of a little over 900mAh of charge in 45 minutes. I would like to at least double capacity from that to 1,800mAh. That would allow for more than 3 minutes uninterrupted broadcast at full 200W, assuming we build transmitter to work with these 7.4V. It also means that 45 minutes would only half-charge the batteries. But even at half, it\u0027d be safe to send some transmissions.\u003C/p\u003E\u003Cp\u003EThe CPU drawing only 5V is a bit of an inconvenience, but I think I can split that 7.4V source into a 5V \u002B 2.4V using a Zener diode, and use the 2.4V for something non-essential, rather than waste them as heat. Everything else that draws considerable power can be designed to use these 7.4V specifically. Sensors, etc. shouldn\u0027t draw enough to worry about such details.\u003C/p\u003E\u003Cp\u003EOne last bit, I don\u0027t know if there is a good way to distribute power dynamically. It will be easier, and more reliable, if we simply have a charge cycle and work cycle. During charge cycle, each LiPo cell charges through its own constant current circuit using the 4V\u002B from the solar panels. Every other systems runs off the panels as well, effectively isolated from batteries. Once voltage on panels drops, it will switch to drawing power from batteries. That will isolate solar batteries. Part of the advantage here is that we\u0027ll have less heat loss in this mode.\u003C/p\u003E\u003Cp\u003ESince rear face will always be shade-facing, I propose using it as a radiator by painting it black and insulating it from the rest of the sat, except via a thermocouple. We can then use the later to control heat flow out of the craft. On the day side, we\u0027ll probably be wasting some power to actively push heat to the radiator panel, and on the night side, cut that flow down. This isn\u0027t something that most cubesats have to worry about, but it might be critical for a bio experiment. I\u0027ll do estimates on expected heat flows later.\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2014-11-17T07:25:58Z","Content":"\n\u003Cp\u003EIf we really need radiators would it be possible to have some kind of corrugated or finned panel in the shade behind the solar panels to get rid of heat? even just two taking up half of a panel each centered behind solar panels should be good.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-17T07:32:05Z","Content":"\n\u003Cp\u003EFinns are only good for air cooling. In vacuum, all you need is a rough, black surface. If we have solar panels fold out, yes, we can use back side as additional radiators, but that seems like unnecessary complexity at this point.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAFan\u0022 data-cite=\u0022NERVAFan\u0022\u003E\u003Cdiv\u003EWould the diagonal make the gravity variation across the moss itself worse/messier? If not, or if that\u0027s workable, I think this sounds good.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, missed your post there.\u003C/p\u003E\u003Cp\u003EGravity gradients will be exactly the same. The actual amount of space we can dedicate to the payload, however, gets smaller. And same goes for usable space in general, simply because it\u0027s going to be awkward to fit everything in the cube at these angles without throwing the system out of balance.\u003C/p\u003E\u003Cp\u003EIt\u0027s workable, but it\u0027s going to reduce amount of stuff we can do, and it still gives us only a little over 50% usage on our solar panels, which are going to be expensive.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-17T07:37:05Z\u0022 title=\u002211/17/2014 07:37  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 17, 2014\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lunniy Korabl","CreatedById":10897,"CreatedDateTime":"2014-11-17T08:13:56Z","Content":"\n\u003Cp\u003EMade a little patch and banner. Will update with a more accurate cubesat once we\u0027ve settled on an overall design.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/71BkKQj.png\u0022 alt=\u002271BkKQj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8KOYYsW.png\u0022 alt=\u00228KOYYsW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: Whoops, probably should have checked the forum sig specs first. For those who can\u0027t be bothered resizing, have a 120 pixel high version!\u003C/p\u003E\u003Cp\u003ERemember the image can be a link to this thread by wrapping [ url=http://forum.kerbalspaceprogram.com/threads/86010-KSP-Community-CubeSat/ ][ /url ] around the image code.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2ulitmR.png\u0022 alt=\u00222ulitmR.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-17T10:04:47Z\u0022 title=\u002211/17/2014 10:04  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 17, 2014\u003C/time\u003E by Lunniy Korabl\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-11-17T11:09:21Z","Content":"\n\u003Cp\u003EThis is awesome, Lunniy! Just what we needed!\u003C/p\u003E\u003Cp\u003ECan you make a version of the mission patch smaller for a forum avatar and with a MEMBER under it in yellow or something (for contrast)? Also, the OP looks kinda dry, K^2... But I don\u0027t know what kind of images could make it look good (other than the mission patch first thin in the post!). Maybe generic LEO/cubesat pictures? Merely illustrative if course \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, is no one any good at sketching? My only problem is getting perspective OK, but for example we need to make sure we\u0027re on the same page when it comes to cubesat layouts. For example is the cubesat spinning around a vertical pole or a pole parallel to both the Sun path and the horizon? What do we even mean by rotation axis? If the moss is in the diagonal we\u0027d have corners (not only the 8 cube corners) where we\u0027d have to get creative on what we put in. Also, wouldn\u0027t rotation control be harder this way?\u003C/p\u003E\u003Cp\u003EAnyways, sketches, we need to be on the same page. Any other layouts possible?\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2014-11-17T14:59:24Z","Content":"\n\u003Cp\u003ENice banners and patches!\u003C/p\u003E\u003Cp\u003EOne thing I feel I should toss out. Depending on how we go with the LiPo batteries, you need to be careful about how you set them up. If we just buy a single pack from something like hobbyking, that is fine. If we do something custom, that gets a little tricky. Here\u0027s why. LiPo\u0027s have this nasty habit when rigged in parallel of trying to charge each other. In any other battery, this is fine. But LiPos are REALLY good at it. Too good. If you have one lipo with something like 90% charge and another with 80% rigged in parellel, the 90% will dump power at something ridiculous like 15-20 amps into the 80%. For some reason that has never been well explained to me, it will basically overshoot and you\u0027ll end up with the 90% being something like 82%, while the 80% is at 88%. (this is a bit of an exaggeration, but I am illustrating the point). So now the charge flows in reverse, and so on. Now this does not necessarily mean anything bad, except for the fact that it will generate a LOAD of heat. The sort of heat that results in batteries bursting into flames or otherwise damaging themselves.\u003C/p\u003E\u003Cp\u003EThe simplest way to fix this is to toss in a couple of heavy duty diodes so that way power can only leave but not enter. This of course means that for the charging circuit, you will have to rig up things to be just a little bit fancier. Luckily one of my friends is a very excellent electrical engineer and has designed systems like this before. Once we know what we are doing with all the systems and needs, he can design the system and we can have a board made and tested within about a month of \u0022start\u0022 for him.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-11-17T15:06:23Z","Content":"\n\u003Cp\u003EYeah, I\u0027m aware of these things. I\u0027ve wired my own charger. It\u0027s honestly not too complicated, so long as you are aware of this property. My only concern is how expensive and/or hard to obtain are diodes that we can safely use in space. I don\u0027t know about ordinary diodes, but Zeners sound to me like they\u0027d be pretty rad-sensitive.\u003C/p\u003E\n"},{"CreatedByName":"Treldon","CreatedById":128860,"CreatedDateTime":"2014-11-17T15:33:57Z","Content":"\n\u003Cp\u003EHello guys!\u003C/p\u003E\u003Cp\u003EI really like your idea and dedication, and would like to join in with whatever help I can provide\u003C/p\u003E\u003Cp\u003E(Before someone asks, I am perfectly up to date with the mission parameters, I have read all 157 pages, not just skimming over them)\u003C/p\u003E\u003Cp\u003EHow exactly I can help I do not know yet - I have studied to be a mechatronic engineer, but due to personal and financial reasons I could not finish my studies. So I know a lot (moderately) about some things, and a little about lots of things...\u003C/p\u003E\u003Cp\u003EBut, if nothing else, I sure can read a lot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E, so I can help with researching additional studies and stuff\u003C/p\u003E\u003Cp\u003ENow that I think of it, I might be able to help with the ground based testing of the moss. I have a friend who is really into mosses (doing her PhD about them iirc) so she might be able to get a sample. Will have to ask\u003C/p\u003E\u003Cp\u003EAlso, besides the main mission of the LEO sat, we really should do some amateur rocket or balloon launches for publicity, especially if Squad should decide to support us (by allowing us to use trademarks, which I do realize might never happen)\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-11-17T19:51:30Z","Content":"\n\u003Cp\u003EHey Treldon, wow 147 pages o.O you\u0027ll definetely be a great addition to the team!\u003C/p\u003E\u003Cp\u003EAnd don\u0027t feel bad about not having a degree, some of us aren\u0027t even out of highschool yet! And that\u0027s not keeping us from working in a space program \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh, and before I forget: Astropapi, K^2, Mazon Del, and NERVAfan, let\u0027s put our signatures with the awesome banners Lunniy made for us in page 157 (like my sig)!\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-11-17T20:36:08Z","Content":"\n\u003Cp\u003EYou read ALL 158 pages?!? Now THAT\u0027S some serious dedication! Anyway, welcome Treldon! Also, K^2, remember to add the logo/patch Lunniy Korabl made on the previous page to the first post you made.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-17T21:33:04Z\u0022 title=\u002211/17/2014 09:33  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 17, 2014\u003C/time\u003E by Nicholander\u003C/strong\u003E\n\u003C/span\u003E\n"}]}