{"TopicId":77646,"ForumId":44,"TopicTitle":"KSP Community CubeSat","CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-07-14T22:43:38Z","PageNum":56,"Articles":[{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-12T19:06:15Z","Content":"\n\u003Cp\u003EHey, Sky_walker.\u003C/p\u003E\u003Cp\u003ESince you know so much about space experiments would you mind suggesting one that\u0027s relevant and feasible for a first mission? This one is actually just something for us to get the know-how of these things, that\u0027s how well get experience in working with them and that\u0027s why we\u0027re not just suggesting an experiment for the ISS, we want to actually carry out a space mission. And about the PR stunt, SQUAD and KSP will have nothing to do with this. We\u0027re just using this knowledgeable and enthusiastic community (compared to others) to bring an international team of hobbyists together and do something amazing. If we\u0027ll ever succeed or be meaningful to space exploration, I don\u0027t know, but we\u0027re sure going to do our best.\u003C/p\u003E\u003Cp\u003EI don\u0027t mind your tone as long as you\u0027re helpful, so are you going to help?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-12T19:08:49Z\u0022 title=\u002210/12/2014 07:08  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 12, 2014\u003C/time\u003E by henryrasia\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-10-12T20:09:05Z","Content":"\n\u003Cp\u003ESky_walker, you seem to have forgotten that it will spin to generate artificial sub-gravity.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-10-13T06:34:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EYou don\u0027t even have any idea of which aspect of moss you\u0027d like to study, \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure we do - growth in Moonlike (and/or Marslike) gravity as opposed to growth in Earth gravity.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Enot to mention anyone with education background in biology\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do.\u003C/p\u003E\u003Cp\u003EAnd Mazon Del was talking to a professor who works with moss.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E You rely on many very crucial components working in extreme environment with no experience working with any of them. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really don\u0027t think this is all that complex as cubesats go, as given the short lifetime most of the \u0027life support\u0027 is passive.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EI still have some qualms about the choice of moss specifically (we might want to use the most temperature-variation-tolerant small plant or alga we can find) but I think the general plan is good.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-10-13T10:10:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022henryrasia\u0022 data-cite=\u0022henryrasia\u0022\u003E\u003Cdiv\u003ESince you know so much about space experiments would you mind suggesting one that\u0027s relevant and feasible for a first mission?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETell me, why exactly would I suggest you what you want to do in your experiment?\u003C/p\u003E\u003Cp\u003EThink of it as a sort-of independent review. No reviewer will ever tell you what sort of project you\u0027re suppose to work on. That\u0027s not what reviews are for.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022henryrasia\u0022 data-cite=\u0022henryrasia\u0022\u003E\u003Cdiv\u003EAnd about the PR stunt, SQUAD and KSP will have nothing to do with this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou do realize that we are talking on a KSP forum, don\u0027t you?\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022henryrasia\u0022 data-cite=\u0022henryrasia\u0022\u003E\u003Cdiv\u003EThis one is actually just something for us to get the know-how of these things\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood, I see an objective here. We can start with that. Now please, explain me how growing moss in a cubesat is going to help you with any of your future planned missions? Or if that\u0027s not the objective of this moss experiment - then what is?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022henryrasia\u0022 data-cite=\u0022henryrasia\u0022\u003E\u003Cdiv\u003EWe\u0027re just using this knowledgeable and enthusiastic community (compared to others)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI assure you that compared to other communities trying to send cubesat - you know very little. Last time I checked - you didn\u0027t have even a slightest idea on how to communicate with your satellite, there was only some idea that one guy might, or might not, build some DIY receiver that might, or might not, work.\u003C/p\u003E\u003Cp\u003EAnd the fact that some of your team members got a high aversion to reading (yes Nicholander, I\u0027m looking at you too) isn\u0027t helping you guys with anything.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nicholander\u0022 data-cite=\u0022Nicholander\u0022\u003E\u003Cdiv\u003ESky_walker, you seem to have forgotten that it will spin to generate artificial sub-gravity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, I didn\u0027t.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003EI do.\u003Cp\u003EAnd Mazon Del was talking to a professor who works with moss.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood news, I suppose. Glad to be proven wrong.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003EI really don\u0027t think this is all that complex as cubesats go, as given the short lifetime most of the \u0027life support\u0027 is passive.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnderestimating complexity of what you\u0027re doing isn\u0027t a particularly good prognosis for a project.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003ESure we do - growth in Moonlike (and/or Marslike) gravity as opposed to growth in Earth gravity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo... is it moonlike or marslike?\u003C/p\u003E\u003Cp\u003EAnd similar experiments were already done on ISS (and I\u0027m quite sure identical one was done as well), only with by far more in-depth analysis than anything you propose and a plants that actually can benefit astronauts:\u003C/p\u003E\u003Cp\u003EHere: \u003Ca href=\u0022http://www.esa.int/spaceinimages/Images/2014/04/Gravi-2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.esa.int/spaceinimages/Images/2014/04/Gravi-2\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-13T10:16:40Z\u0022 title=\u002210/13/2014 10:16  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 13, 2014\u003C/time\u003E by Sky_walker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-13T14:31:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003ETell me, why exactly would I suggest you what you want to do in your experiment?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou just went fetch 2 experiments that prove ours useless (Columbia moss and ISS Gravi 2 seedlings), so we just keep suggesting and you keep disproving them in trial-and-error until some day we get it? How about you just tell us an experiment that \u003Cem\u003E\u003Cstrong\u003Eyou\u003C/strong\u003E\u003C/em\u003E would find interesting and novel and just be constructive? This is brainstorming, not even a mission plan is up for review, so yours is a little premature to say the least.\u003C/p\u003E\u003Cp\u003EYou want some objectives? Let\u0027s see a few that I thought went without saying:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAcquire the know-how to build a satellite that can:\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESurvive space launch conditions\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESurvive and be operational in LEO for a period of 3 weeks.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECreate functional logistics for a team of international members to contribute to the creation and operation of the mission.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBe able to construct a functional satellite out of off-the-shelf electronics without professional assistance.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECreate a global network (remember the international part?) that can track the satellite around it\u0027s orbit.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELet this network be mainly of amateur radio operators, again to acquire the know-how of orbital communication.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAcquire the know-how to operate a satellite in orbit with respect to instrumentation and the inevitable problems.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBe able to carry out a successful and fruitful mission to gain recognition to ease out the process of further missions.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENicholander, NERVAfan, astropapi1, can you list any more?\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-10-13T19:42:30Z","Content":"\n\u003Cp\u003EAnother objective I can think of: To study the effects of Lunar and Martian gravity on moss.\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-14T04:46:06Z","Content":"\n\u003Cp\u003EI did a very bad sketch:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/drawings/d/1Vyv-knZjtIIsBwNBIp6lS4198OBx4yRtoidhKEPYVVo/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/drawings/d/1Vyv-knZjtIIsBwNBIp6lS4198OBx4yRtoidhKEPYVVo/edit?usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd noticed there\u0027s a lot of dead space. Also there\u0027s a lot of moving parts and liabilities for the mission, we should really simplify them. That is a cross section, but there\u0027s no 3D so it could very well be completely unrepresentative of the real thing. Finally, no measurements, so everything may be wrong entirely. This is just to kick into gear the actual \u003Cem\u003Edesign\u003C/em\u003E process.\u003C/p\u003E\u003Cp\u003EEDIT: For example, I just made the experiments opossite to each other, symentrically, thus eliminating the need of a counterweight. We need these ideas flowing people!.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-14T04:53:14Z\u0022 title=\u002210/14/2014 04:53  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 14, 2014\u003C/time\u003E by henryrasia\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2014-10-14T05:46:36Z","Content":"\n\u003Cp\u003EThat design wouldn\u0027t work. The varying distances from the center of the rotation near the edges of the petri dish would cause massive gravitational differences. We aren\u0027t using a rasp pi either, K^2 posted the micro controller earlier and it had a rad hard version but I can\u0027t quite recall the model number. The magnetorquers would have to occupy at lest 3 sides so they would have 3 dimensional control. The ones you showed would only control one axis and have double torque on that axis. The cubesat probably won\u0027t have any moving parts unless they are passive I.E. solar panel arrays pulled out by centrifugal force. The way I imagined it was a petri dish beside a window on one half of the cubesat with the side against our electronics. That way the torque would leave the axis of rotation perpendicular to the sun and let light in for all 45 minutes of sunlight, and the specimen would be able to have its \u0022bottom\u0022 as though it was being pulled down by gravity. Something like the cylinder ship from Rendezvous with Rama with windows on one of the circular faces and the plants being grown on the rectangular faces. The electronics would take up the other circular face and that would fill the cubesat. Obviously much much smaller but a similar concept.\u003C/p\u003E\u003Cp\u003EEdit: That sounded really harsh. I didn\u0027t mean for it to sound like that. I lust think the drawings need more improvements and it\u0027s probably too early for them at this point. We don\u0027t know our components or how much space they\u0027ll take up.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-14T05:49:41Z\u0022 title=\u002210/14/2014 05:49  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 14, 2014\u003C/time\u003E by dharak1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-14T13:11:42Z","Content":"\n\u003Cp\u003EDharak1, that\u0027s why I created the google doc, so we can get everything discussed in the last 139 pages in one place. Do you remember in what page they said those things? Also, I found a company that sells cubesat-specific solar panels, some with magnetorquers embedded.\u003C/p\u003E\u003Cp\u003EHere\u0027s the doc: \u003Ca href=\u0022https://docs.google.com/document/d/1jR2B_M67cITTBtV_PDMoioVQp3bnCTR85ecQeVKmpWI/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/document/d/1jR2B_M67cITTBtV_PDMoioVQp3bnCTR85ecQeVKmpWI/edit?usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you\u0027d like to be able to have full edit powers PM me.\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-14T15:16:16Z","Content":"\n\u003Cp\u003EWell, I just added a lot of stuff in the doc, what do you guys think?\u003C/p\u003E\u003Cp\u003EAnd I found more info on cameras, written there under \u0022camera\u0022, sorry if it looks messy. Remember people, engineering is done by numbers, if you don\u0027t know the numbers, that\u0027s no excuse to not start an analysis, estimate, and if in emergency, guess, but ANALYSE WITH NUMBERS.\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2014-10-14T15:44:14Z","Content":"\n\u003Cp\u003EWhile I realize this is only open to universities, it does show some of the growing potential for CubeSat projects.\u003C/p\u003E\u003Cp\u003E \u003Ca href=\u0022http://www.universetoday.com/115274/tiny-satellites-could-hitchhike-to-europa-with-bigger-nasa-mission-concept/#more-115274\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.universetoday.com/115274/tiny-satellites-could-hitchhike-to-europa-with-bigger-nasa-mission-concept/#more-115274\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-10-14T19:35:27Z","Content":"\n\u003Cp\u003EI just noticed something, K^2 hasn\u0027t been online since October 11th. And hasn\u0027t posted since October 4th.\u003C/p\u003E\n"},{"CreatedByName":"MrZayas1","CreatedById":95654,"CreatedDateTime":"2014-10-15T00:47:09Z","Content":"\n\u003Cp\u003EProbably would not be able to build the cubesat in time but a new thread just popped up on the forums about a NASA launch in 2017 on the SLS for a solar sail probe to the moon to map for water near the poles of the moon. Maybe we could hitch a ride?? I mean, I am sure that a whole SLS launch will have some space left over, but since we aren\u0027t just dropping it into an orbit we will probably need an engine to land the probe on the moon to test the moss for gravitational effects. If I understand our goals correctly with this. Other than that maybe one of the future missions to mars we can hitch a ride onto also if we want to build the same cubesat for a Mars mission. Just a thought though.\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-15T02:41:36Z","Content":"\n\u003Cp\u003EMrZayas, we\u0027re just doing a simulated moon/mars gravity in LEO because an actual moon mission would be excessive for our scale. However, since 2017 is somewhat far off, we might take that opportunity for a moon mission. I did link a $3M NASA prize for an independent cubesat missio to the moon. That\u0027s quite an incentive. But for that, I\u0027m afraid, we\u0027d need to speed up this first missio as it\u0027s not seeming to be becoming real anytime soon...\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-10-15T19:30:27Z","Content":"\n\u003Cp\u003EAlso, the SLS mission could be delayed until November 2018.\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-15T20:10:11Z","Content":"\n\u003Cp\u003EMore time for us!\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-10-15T23:37:48Z","Content":"\n\u003Cp\u003EBut, maybe the conditions on launch are not good for a Trans-Lunar Injection.\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-16T03:05:40Z","Content":"\n\u003Cp\u003EWhatever! Let\u0027s focus on the cubesat for now shall we? I feel I\u0027m the only one doing anything concrete...\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-10-16T10:54:58Z","Content":"\n\u003Cp\u003ESorry, just saying that It could be delayed.\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2014-10-16T23:22:28Z","Content":"\n\u003Ca href=\u0022http://www.nasa.gov/mission_pages/station/research/news/seedling_growth_2/index.html#.VEBRYfldWYc\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/mission_pages/station/research/news/seedling_growth_2/index.html#.VEBRYfldWYc\u003C/a\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-10-17T07:10:10Z","Content":"\n\u003Cp\u003EHey guys, \u003C/p\u003E\u003Cp\u003EI remember ages ago we were talking about how most of us are from different parts of the world, and that we need people in different areas to keep the cubesat connected. So should we put people who are willing to help out in the google doc?\u003C/p\u003E\n"},{"CreatedByName":"henryrasia","CreatedById":45695,"CreatedDateTime":"2014-10-17T11:09:37Z","Content":"\n\u003Cp\u003EWe should definitely put anyone willing to help in the doc, but they need to be active and engaged, otherwise it~s just a waste of everything. I mean, this thread should have 2 pages of postings per day for a project like this! Right now we\u0027re getting 4 posts a day (give or take), and usually from the same people.\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-10-17T12:47:04Z","Content":"\n\u003Cp\u003EUnfortunately your correct. And like I\u0027ve said before, K^2 hasn\u0027t posted since October 4th, and that wasn\u0027t even in this thread. It also says he hasn\u0027t been online since October 11th.\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-10-18T04:34:54Z","Content":"\n\u003Cp\u003E:L well, what will the people who want to help out (myself and others) need to help? do we need a dish, and if so, what size? how do we get it connected?\u003C/p\u003E\n"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2014-10-18T13:32:53Z","Content":"\n\u003Cp\u003EDish size? I THINK a little less then 10 or 9 Cm in diameter.\u003C/p\u003E\n"}]}