{"TopicId":77773,"ForumId":51,"TopicTitle":"The STS Missions and the SEI","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-07-16T00:39:38Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-07-16T00:39:38Z","Content":"\n\u003Cp\u003EThis is for the sake of record keeping so I can track my shuttles and other roleplay information that may prove useful to me sometime in the future.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003ECURRENT PHASE: II\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-List of Shuttles (Chronological Order of Construction)-\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAscension (Partially Retired, Active)(3 missions)\u003C/p\u003E\u003Cp\u003EKaris (Heavily damaged on STS-16 return, undergoing repair)(1 mission)\u003C/p\u003E\u003Cp\u003EIsdale (Active)(2 missions)\u003C/p\u003E\u003Cp\u003EHorizon (Active)(3 missions)\u003C/p\u003E\u003Cp\u003EAuriga (Destroyed after Fire)(1 mission)\u003C/p\u003E\u003Cp\u003EDawn (Active)(1 mission)\u003C/p\u003E\u003Cp\u003EGarret (Under Construction)\u003C/p\u003E\u003Cp\u003EFreedom (Under Construction)\u003C/p\u003E\u003Cp\u003E On the tenth anniversary of the Munshot landings, President George B. Kersay announced to the nation a great goal of sending expeditions to Duna and returning to the Mun, this time using the \u0022Space Transportation System\u0022 as a major keystone of the plan. Prior to this, the STS was being strictly developed for military uses as a space bomber and a orbital cheese factory, but the announcement forced the Defense Department to cede control of the project to the National Astronautics Agency, having only performed ten \u0022test flights\u0022. And so began one of the greatest program(s) in Kerbal history. \u003C/p\u003E\u003Cp\u003E(SEI) = This mission is a part of President Kersay\u0027s plan to send Kerbals to Duna. (SL) = This mission has the spaceshuttle ferry scientists for independent research in space onboard a specially designed module. \u003C/p\u003E\u003Cp\u003E(SAT) = This mission deploys satellites \u003C/p\u003E\u003Cp\u003E(KST) = This mission services, deploys, or returns Kerman-class space telescopes. \u003C/p\u003E\u003Cp\u003E(DD) = This mission has a purpose that is military in nature. Any Kerbal that is unlucky enough to know too much is usually visited by a group of agents who simply have a \u0022friendly\u0022 talk that convinces them not to say anything.\u003C/p\u003E\u003Cp\u003E(SL) = This mission has the shuttle conduct research independent from any orbital facility or any existing satellite network\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/DJfON\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"}]}