{"TopicId":78013,"ForumId":34,"TopicTitle":"[0.90]NEAR: A Simpler Aerodynamics Model v1.3.1 12/16/14","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-07-17T22:18:07Z","PageNum":19,"Articles":[{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-10-11T03:54:53Z","Content":"\n\u003Cp\u003EHi there!, been using NEAR since... well, can\u0027t really remember, but I love it. Quick question: I downloaded 1.2.1 and tried a few designs and it doesn\u0027t matter what kind of design it is, I just don\u0027t seem to get enough pitch authority. I made an SR-71 look-a-like, a \u0022normal\u0022 mk1 based compound delta, an A-4, etc, to no avail, nothing has enough pitch authority unless I place my control surfaces as close to the CoM as possible (or at least that\u0027s what I could figure with my tests). I also made a Skylon thingy and if I disable pitch on the main wing, then I have no pitch authority at all.\u003C/p\u003E\u003Cp\u003ETL;DR (and probably clearer): I have to put my control surfaces close to the CoM or I don\u0027t get pitch authority (whether I use deltas, cannards, both, or conventional designs, pitch authority always comes from the control surfaces closer to the CoM)\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-11T04:27:19Z","Content":"\n\u003Cp\u003EWhat? That basically means that KSP\u0027s physics simulation is broken. Alright, let\u0027s find out what\u0027s up. Follow the steps here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-10-11T17:52:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EWhat? That basically means that KSP\u0027s physics simulation is broken. Alright, let\u0027s find out what\u0027s up. Follow the steps here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I left NEAR alone (and left real chute to load some of my already made designs which include the chutes), the problem still persists.\u003C/p\u003E\u003Cp\u003EHere\u0027s the output log: \u003Ca href=\u0022http://pastebin.com/8BWua9sv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/8BWua9sv\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI also ran a quick test to make my problem really clear. I\u0027ll leave the images as links as to avoid uselessly clogging the thread with huge images.\u003C/p\u003E\u003Cp\u003EFirst, I made a \u0022conventional\u0022 plane, main wing is forward, right at the COM. I disable pitch on the ailerons and leave it only to the stabilizer. Take off speed is about 200 m/s and I can\u0027t pitch any further than the image, the most violent turn I can get is about 2g. Image is about one second after take-off: \u003Ca href=\u0022http://i.imgur.com/iq0whLI.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/iq0whLI.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor the second part, I enabled pitch on the outmost control surfaces on the main wing and the stabilizer, take off speed is greatly reduced and pitch authority is better (still lacking, but allows for actual flying). Again, picture taken about one second after take-off, the difference is greatly noticeable: \u003Ca href=\u0022http://i.imgur.com/nBShV7U.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/nBShV7U.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnyways, I realized I\u0027m using MM 2.5.1 and NEAR comes bundled with 2.5.0, maybe that\u0027s the problem?\u003C/p\u003E\u003Cp\u003EAs per reproduction steps:\u003C/p\u003E\u003Cp\u003E1-Make a spaceplane using either a pure delta, compound delta, or any other delta based design without canards (sr-71, Avro Vulcan, HAL Tejas, the space shuttle, etc)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOR\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1-Make a spaceplane using any conventional (Main wing forward and stabilizers back) design and disable the pitch on the main wing\u0027s control surfaces\u003C/p\u003E\u003Cp\u003E2-Hit Launch\u003C/p\u003E\u003Cp\u003E3-Continue with normal take-off procedures\u003C/p\u003E\u003Cp\u003E4-Craft should be lacking in pitch authority\u003C/p\u003E\u003Cp\u003E5-Finish flight on any desired way\u003C/p\u003E\u003Cp\u003E6-Go back to spaceplane hangar\u003C/p\u003E\u003Cp\u003E7-Enable pitch on main wing control surfaces (for conventional designs)/move the delta wing way forward to get control surfaces closer to the CoM (On delta designs)\u003C/p\u003E\u003Cp\u003E8-Hit Launch\u003C/p\u003E\u003Cp\u003E9-Continue with normal take-off procedures\u003C/p\u003E\u003Cp\u003E10- Craft should have better pitch authority now\u003C/p\u003E\n"},{"CreatedByName":"Corovaneer","CreatedById":26202,"CreatedDateTime":"2014-10-11T18:28:45Z","Content":"\n\u003Cp\u003ETrying NEAR for the first time here. Getting unexpectedly grave results with very basic rocket - 1SRB\u002B1Liquid engine\u002BPayload. Disintegration of vehicle at about 300m/s speed while passing through lower atmosphere. Every destruction happens with a good deal of \u0022bug force\u0022 - one was strong enough to fling debris out of solar system in few seconds. Gonna try FAR now, see if there\u0027s difference.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-11T19:24:11Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@PDCWolf: \u003C/strong\u003EReproduced and confirmed behavior when both control surfaces on the tail and main wing are active. Could \u003Cem\u003Enot\u003C/em\u003E confirm that plane pitched better only with control surfaces closer to the CoM as you originally indicated. Confirmed that control effectiveness is related to distance from CoM as intended. This is not a bug, your planes are just too stable for the control authority they have. In particular, your CoP needs to be closer to the CoM. Shift the wing forward a bit.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Corovaneer: \u003C/strong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u003C/a\u003E \u0026lt;- follow the steps here. I will need full reproduction steps, since I don\u0027t experience that behavior.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-10-11T21:20:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@PDCWolf: \u003C/strong\u003EReproduced and confirmed behavior when both control surfaces on the tail and main wing are active. Could \u003Cem\u003Enot\u003C/em\u003E confirm that plane pitched better only with control surfaces closer to the CoM as you originally indicated. Confirmed that control effectiveness is related to distance from CoM as intended. This is not a bug, your planes are just too stable for the control authority they have. In particular, your CoP needs to be closer to the CoM. Shift the wing forward a bit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait a moment there, nothing should work better when closer to the CoM, roll aside and at least longitudinally, yaw and pitch work better the further away they are from the CoM (you know, go to a seesaw and try moving it closer to the center or further away blablabla) or at least that\u0027s what I have been taught. Unless I misinterpreted what you said.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-11T22:33:42Z","Content":"\n\u003Cp\u003EThat\u0027s what I mean. Your initial post said:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETL;DR (and probably clearer): I have to put my control surfaces close to the CoM or I don\u0027t get pitch authority (whether I use deltas, cannards, both, or conventional designs, pitch authority always comes from the control surfaces closer to the CoM)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is not the case. For your test case, the extra (small) control authority from the control surfaces at the ends of your swept wings was enough to make the plane controllable. Disabling the control surfaces on the tail and trying to fly using \u003Cstrong\u003Eonly\u003C/strong\u003E the control surfaces on the wings for pitch control showed worse control authority than using \u003Cstrong\u003Eonly\u003C/strong\u003E the control surfaces on the tail. Your test case did not prove what you were saying was happening, and my attempts to replicate that resulted in expected behavior.\u003C/p\u003E\u003Cp\u003EYour planes are just lacking in control authority. That\u0027s it. Make them less stable so the control authority you have is sufficient, or add more control authority.\u003C/p\u003E\n"},{"CreatedByName":"iFlyAllTheTime","CreatedById":111190,"CreatedDateTime":"2014-10-12T02:20:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iflyallthetime\u0022 data-cite=\u0022iflyallthetime\u0022\u003E\u003Cdiv\u003EThe TweakableEverything fix worked flawlessly! Thank you.\u003Cp\u003EAlthough, I love seeing boosters being ejected outward with a bang. Reminds me of the Shuttle SRBs:cool:\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m guessing the stock game remains unaffected by this rotational force because of the aero model?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AetherGoddess\u0022 data-cite=\u0022AetherGoddess\u0022\u003E\u003Cdiv\u003Eit is, but the FAR/NEAR drag model correctly models the behavior of the part when it\u0027s orientation changes, so the \u0022nose\u0022 of the ejected booster suffers pretty sever torque due to wind resistance, where as the stock model causes the ejected part to just rotate at something like 1 deg per second, slow enough for it to drift away before scything your engines. you can see this by taking a similar booster up above the atmosphere and ejecting it. it won\u0027t whip around like snake, it\u0027ll just drift away, turning gently.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, so this behavior exists for FAR users as well then?\u003C/p\u003E\u003Cp\u003EI wonder if there a way to edit a cfg file somewhere to edit this behavior.\u003C/p\u003E\u003Cp\u003EThanks for the reply.\u003C/p\u003E\n"},{"CreatedByName":"AetherGoddess","CreatedById":115971,"CreatedDateTime":"2014-10-12T02:42:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iflyallthetime\u0022 data-cite=\u0022iflyallthetime\u0022\u003E\u003Cdiv\u003EOh, so this behavior exists for FAR users as well then?\u003Cp\u003EI wonder if there a way to edit a cfg file somewhere to edit this behavior.\u003C/p\u003E\u003Cp\u003EThanks for the reply.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe behavior does appear in FAR, but again, it also appears in stock. stock doesn\u0027t model aerodynamics in any real way, so the rotational force that is applied has the same effect as it would in vacuume, a slow rotation that poses no real risk to the spacecraft. \u003C/p\u003E\u003Cp\u003EFAR does model aerodynamics, so a small change in the pitch angle has a huge effect on the stability of the ejected booster. \u003C/p\u003E\u003Cp\u003EIn short, FAR is correctly modeling the physics, and the stock decoupler rotational force bug puts the SRB into a configuration where it will rotate into the spacecraft, instead of away from it. This is why tweaking the force to zero corrects the issue, because if there is no force on the decoupler, then there is no rotation, and the part drops away as expected.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-12T02:45:30Z\u0022 title=\u002210/12/2014 02:45  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 12, 2014\u003C/time\u003E by AetherGoddess\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"iFlyAllTheTime","CreatedById":111190,"CreatedDateTime":"2014-10-12T05:21:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AetherGoddess\u0022 data-cite=\u0022AetherGoddess\u0022\u003E\u003Cdiv\u003EThe behavior does appear in FAR, but again, it also appears in stock. stock doesn\u0027t model aerodynamics in any real way, so the rotational force that is applied has the same effect as it would in vacuume, a slow rotation that poses no real risk to the spacecraft. FAR does model aerodynamics, so a small change in the pitch angle has a huge effect on the stability of the ejected booster. In short, FAR is correctly modeling the physics, and the stock decoupler rotational force bug puts the SRB into a configuration where it will rotate into the spacecraft, instead of away from it. This is why tweaking the force to zero corrects the issue, because if there is no force on the decoupler, then there is no rotation, and the part drops away as expected.\u003C/div\u003E\u003C/blockquote\u003EI understand.Does anyone know if 0.25 still has the rotation bug?\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-12T05:29:25Z","Content":"\n\u003Cp\u003EIt\u0027s still there. Unfortunately.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-10-12T16:05:13Z","Content":"\n\u003Cp\u003EHow do I force enable this on Win_x64? I know you don\u0027t support it. My game crashes about once a day due to 64 bit instability anyway. I don\u0027t care. Due to memory issues, I refuse to go back 32 bit, and I really do hate the base aero model. What do I need to decompile, edit, etc.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EAnd yes, I promise not to harass you about sh*t breaking. I know I\u0027m straining the game\u0027s stability and I accept whatever hardware wrecking bugs I bring upon myself.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-12T16:08:03Z\u0022 title=\u002210/12/2014 04:08  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 12, 2014\u003C/time\u003E by Captain Sierra\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ngianoplus","CreatedById":63039,"CreatedDateTime":"2014-10-12T16:55:48Z","Content":"\n\u003Cp\u003EDo you think Scott Manley will do a video about NEAR?\u003C/p\u003E\n"},{"CreatedByName":"AetherGoddess","CreatedById":115971,"CreatedDateTime":"2014-10-12T17:37:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EHow do I force enable this on Win_x64? I know you don\u0027t support it. My game crashes about once a day due to 64 bit instability anyway. I don\u0027t care. Due to memory issues, I refuse to go back 32 bit, and I really do hate the base aero model. What do I need to decompile, edit, etc.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EAnd yes, I promise not to harass you about sh*t breaking. I know I\u0027m straining the game\u0027s stability and I accept whatever hardware wrecking bugs I bring upon myself.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou have already exceeded the quota of support for Win x64 with this post. yes, you can get the source and turn off the disabling code, and then recompile it and use it. that task works as a sorting filter. if you can make that minor code change and compile it for yourself, then you are certainly knowledgeable enough to tell the difference between a crash caused by FAR and a crash caused by KSP_x64. if you can\u0027t, then it doesn\u0027t mean you are dumb, and it doesn\u0027t mean that you are somehow unworthy, it just means that we can\u0027t be sure that you have the necessary skills to run and troubleshoot an unstable version. you can think of it as a driving test: if you can download the zip and install it, then you can drive an automatic passenger car. if you want to drive a F-18, then you need to pass a higher bar. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ngianoplus\u0022 data-cite=\u0022ngianoplus\u0022\u003E\u003Cdiv\u003EDo you think Scott Manley will do a video about NEAR?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe did one on FAR. the entire script of the video on NEAR could be \u0022like FAR\u0026lt;annotation link\u0026gt; but simpler \u0026lt;outro\u0026gt;\u0022.\u003C/p\u003E\n"},{"CreatedByName":"octo","CreatedById":125760,"CreatedDateTime":"2014-10-13T15:10:15Z","Content":"\n\u003Cp\u003ELeaving orbit/atmosphere with rockets seems waaay too easy. Is there some mod i should have to counter balance this?\u003C/p\u003E\n"},{"CreatedByName":"FlexGunship","CreatedById":32705,"CreatedDateTime":"2014-10-13T15:28:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EHow do I force enable this on Win_x64? I know you don\u0027t support it. My game crashes about once a day due to 64 bit instability anyway. I don\u0027t care. Due to memory issues, I refuse to go back 32 bit, and I really do hate the base aero model. What do I need to decompile, edit, etc.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EAnd yes, I promise not to harass you about sh*t breaking. I know I\u0027m straining the game\u0027s stability and I accept whatever hardware wrecking bugs I bring upon myself.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is Ferram\u0027s code (from the source provided in GitHub):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E        public static bool IsWin64()\u003Cbr\u003E        {\u003Cbr\u003E            return (IntPtr.Size == 8) \u0026amp;\u0026amp; (Environment.OSVersion.Platform == PlatformID.Win32NT);\u003Cbr\u003E        }\u003Cbr\u003E\u003Cbr\u003E        public static bool IsAllCompatible()\u003Cbr\u003E        {\u003Cbr\u003E            return IsCompatible() \u0026amp;\u0026amp; IsUnityCompatible() \u0026amp;\u0026amp; !IsWin64();\u003Cbr\u003E        }\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHe\u0027s doing two things here:\u003C/p\u003E\u003Cp\u003EFirstly, generating a boolean return based on system pointer size (64-bit OSes use 64-bit pointers) and checking that the Windows version is post Win32NT (all systems after Win98 seem to carry this platform ID). If both of these are satisfied, the return is TRUE (and you\u0027re in a Windows x64 environment); this is presumably to prevent a false positive on 64-bit Linux systems.\u003C/p\u003E\u003Cp\u003ESecondly, he is performing a logical AND of all of his compatibility checks. One of which is \u0022!IsWin64()\u0022 or \u0022is this system not Windows x64\u0022. \u003C/p\u003E\u003Cp\u003EYou could simply remove that check and IsAllCompatible() would return TRUE even if IsWin64() returned TRUE. Remember that, if you do, you are not allowed to redistribute the mod per his license. \u003Cstrong\u003EIf you need to ask \u0022how do I do that\u0022 then you probably shouldn\u0027t be doing it and you should respect Ferram\u0027s wishes.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI could do it in a heartbeat... but I choose to adhere to Ferram\u0027s rule; it\u0027s his mod. I hope he changes his mind. I\u0027m using Win64 and KSP x64 and I sorely miss KJR and NEAR. A few bad eggs have ruined it for us all.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-13T15:30:44Z\u0022 title=\u002210/13/2014 03:30  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 13, 2014\u003C/time\u003E by FlexGunship\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"octo","CreatedById":125760,"CreatedDateTime":"2014-10-13T16:09:11Z","Content":"\n\u003Cp\u003EPlayed around with NEAR for a little, I like it. But getting into orbit with rockets just seems waaay to easy, like i\u0027m cheating really. Is there some mod I\u0027m supposed to have to counter balance this? I\u0027ve read browsed through the thread and noticed some people mention real solar system..\u003C/p\u003E\u003Cp\u003E(also accidental double post)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-13T19:17:59Z\u0022 title=\u002210/13/2014 07:17  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 13, 2014\u003C/time\u003E by octo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-10-13T16:18:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EThis is not the case. For your test case, the extra (small) control authority from the control surfaces at the ends of your swept wings was enough to make the plane controllable. Disabling the control surfaces on the tail and trying to fly using \u003Cstrong\u003Eonly\u003C/strong\u003E the control surfaces on the wings for pitch control showed worse control authority than using \u003Cstrong\u003Eonly\u003C/strong\u003E the control surfaces on the tail. Your test case did not prove what you were saying was happening, and my attempts to replicate that resulted in expected behavior.\u003Cp\u003EYour planes are just lacking in control authority. That\u0027s it. Make them less stable so the control authority you have is sufficient, or add more control authority.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, guess I\u0027ll have to play more with moving the CoM and CoP around until things work. Thanks for your time.\u003C/p\u003E\n"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2014-10-13T21:08:47Z","Content":"\n\u003Cp\u003ESo apparently I am just a bad pilot. Or at least I am guessing. I figured I would come cry here to see if some NEAR experts could point me in the right direction.\u003C/p\u003E\u003Cp\u003ENow I will say when using NEAR and planes (space or otherwise) I do quite well actually. Spaceplanes are the reason I decided to try NEAR.\u003C/p\u003E\u003Cp\u003EBut I have a horrible time with good old rockets.\u003C/p\u003E\u003Cp\u003EAs an example, I just restarted for .25 so I am early in my tech tree on career mode. I was building a simple Mun flyby rocket. from the top down it was basically:Parachute-small TAC LS can-Mk1 capsule- 2 antenna opposing for balance- stack decoupler- science Jr- 2 goo containers opposing for balance- fuel- LV909 engine- decoupler- fuel LT45 engine- and 4 boosters radially(set down to about 45% thrust to limit acceleration)- In between the boosters I had 4 fixed fins (haven\u0027t unlocked the ones that can move yet).\u003C/p\u003E\u003Cp\u003EWhen flying this rocket in stock, it tracks up like an arrow. Controllable into my gravity turn. Everything is good.\u003C/p\u003E\u003Cp\u003EWhen flying with NEAR it starts out ok. I usually try to gradually start my gravity turn earlier but that was not working out well. So I decided to just see about getting some altitude first. If I try and go hands off for the beginning (turn on sas and hit go) the rocket tracks well for the first couple thousand m, but then starts spinning. The spin if left unchecked will eventually knock the rocket out of control. However even trying to control it knocks me off vertical and then it is a constant fight to stay on track, in most cases failing horrible in a ball of fire.\u003C/p\u003E\u003Cp\u003ESo I love NEAR for planes but am an utter failure with rockets.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-13T21:15:15Z","Content":"\n\u003Cp\u003EWell, in that case you need to find what causes the spin. Either the fins are not straight, the boosters are not straight, or under thrust they flex enough to not be straight. It\u0027s probably the fins if it only started after adding NEAR, because they\u0027re suddenly a lot better at lifting than they used to be.\u003C/p\u003E\u003Cp\u003EOdds are you don\u0027t need as much thrust as you have. If you\u0027ve got a TWR \u0026gt; 2 when you start you\u0027re in for a bad time with NEAR or FAR. The key isn\u0027t to chase terminal velocity, the key is to go as fast as you can without losing control; going slower in the atmosphere reduces the chances of losing control.\u003C/p\u003E\n"},{"CreatedByName":"falken","CreatedById":17316,"CreatedDateTime":"2014-10-13T21:18:02Z","Content":"\n\u003Cp\u003EOkay, my shuttle is driving me mad. I\u0027ve gotten it to glide perfectly, and it behaves well in upper atmosphere on it\u0027s own, but it exhibits... strange behaviour around 40km up a little while after SRB sep. It starts to yaw in each direction slowly. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/207UiCb\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/207UiCbl.png\u0022 alt=\u0022207UiCbl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERunning latest NEAR, Mechjeb 2.4 (also the Sarbian plugins for KM Gimbal and NEAR), latest Klockheed Martian SSME engines, latest B9. \u003C/p\u003E\u003Cp\u003ETried various levels of torque from the cockpit\u0027s reaction wheels, different gimbal and trim from the engines, different vertical stabiliser settings. Without fail she just starts to sway around. \u003C/p\u003E\u003Cp\u003EPretty darn positive the issue lies with the KM engines, but I don\u0027t think there\u0027s any alternatives. Has anyone got any clues on what I\u0027m doing wrong here?\u003C/p\u003E\u003Cp\u003Ee: I might try putting some small, subtle aero surfaces on the external tank to see if that helps. But surely there shouldn\u0027t be enough atmosphere 40/50km up to cause this?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-13T21:26:15Z\u0022 title=\u002210/13/2014 09:26  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 13, 2014\u003C/time\u003E by falken\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2014-10-13T22:19:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EWell, in that case you need to find what causes the spin. Either the fins are not straight, the boosters are not straight, or under thrust they flex enough to not be straight. It\u0027s probably the fins if it only started after adding NEAR, because they\u0027re suddenly a lot better at lifting than they used to be.\u003Cp\u003EOdds are you don\u0027t need as much thrust as you have. If you\u0027ve got a TWR \u0026gt; 2 when you start you\u0027re in for a bad time with NEAR or FAR. The key isn\u0027t to chase terminal velocity, the key is to go as fast as you can without losing control; going slower in the atmosphere reduces the chances of losing control.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore likely the boosters. I also had not yet unlocked struts so I could see the boosters strain with the radial decouplers.\u003C/p\u003E\u003Cp\u003EI had toned down the thrust on the boosters to try and get about 1.2TWR. I do generally do better once I unlock more parts to enhance stability.\u003C/p\u003E\n"},{"CreatedByName":"falken","CreatedById":17316,"CreatedDateTime":"2014-10-13T22:30:09Z","Content":"\n\u003Cp\u003EWell, my issue lied with the KM engines. I just put on a set of LV-T45s that I modified to have 400 thrust each, and ran them with Sarbian\u0027s auto trim plugin. Shuttle went to orbit with no oscilations at all.\u003C/p\u003E\u003Cp\u003EAnyone know of a good SSME engine that uses traditional gimbal?\u003C/p\u003E\n"},{"CreatedByName":"Matrix Aran","CreatedById":59037,"CreatedDateTime":"2014-10-14T18:21:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022octo\u0022 data-cite=\u0022octo\u0022\u003E\u003Cdiv\u003EPlayed around with NEAR for a little, I like it. But getting into orbit with rockets just seems waaay to easy, like i\u0027m cheating really. Is there some mod I\u0027m supposed to have to counter balance this? I\u0027ve read browsed through the thread and noticed some people mention real solar system..\u003Cp\u003E(also accidental double post)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you check any of Ferram\u0027s posts you\u0027ll see he also makes a little mod call the Kerbal ISP Difficulty Scaler. Among its other handy uses, it can be used to rebalance the engines in the game to be comparable to stock performance, with NEAR installed. This is perhaps the easiest way to get a stock level of difficulty with NEAR installed.\u003C/p\u003E\u003Cp\u003EOf course, should this not be enough of a challenge you might want to try the Real Solar System mod. I personally recommend the 6.4 scale version of it as it works well with stock parts and doesn\u0027t need any other mods to give you a reasonable challenge closer to real life deltaV values.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-15T19:45:49Z","Content":"\n\u003Cp\u003EAlright, \u003Cstrong\u003Eversion 1.3\u003C/strong\u003E is out, with quite a few cargo bay and payload fairing tweaks. Should work a little bit smoother than it has been.\u003C/p\u003E\n"}]}