{"TopicId":78062,"ForumId":18,"TopicTitle":"I Just Had An Epiphany","CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2014-07-18T01:13:03Z","PageNum":1,"Articles":[{"CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2014-07-18T01:13:03Z","Content":"\n\u003Cp\u003ELots of stuff has happened to me over the last few weeks and i didnt have as much free time as normal. Today, i was just about to release a video into my little youtube channel. All that was left was adding music.\u003C/p\u003E\u003Cp\u003EThen my computer crashed. I lost all progress on my video.\u003C/p\u003E\u003Cp\u003EBased on past experiences, everytime i try to make videos, bad stuff happens. \u003C/p\u003E\u003Cp\u003EThen it hit me: What if i am just not meant to make videos? What if i am being stopped from making them for some strange reason? What if i am simply overreacting?\u003C/p\u003E\u003Cp\u003EMaybe i really am not meant to make youtube videos. That would seem likely; i\u0027m not exactly good at making them. Plus, i\u0027m stuck in a dilemma over wether or not i want to put in the effort to show my creativity to the world?\u003C/p\u003E\u003Cp\u003EAnyone had something like this happen to them?\u003C/p\u003E\n"},{"CreatedByName":"panfish5","CreatedById":74937,"CreatedDateTime":"2014-07-18T01:19:58Z","Content":"\n\u003Cp\u003EYou\u0027ve only made 2 videos so I think your just having a streak of badluck. It happens to everyone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-07-18T01:46:54Z","Content":"\n\u003Cp\u003EYeah. Witches and evil spirits are trying to stop you from posting a video of you playing KSP.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-07-18T01:49:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022quasarrgames\u0022 data-cite=\u0022quasarrgames\u0022\u003E\u003Cdiv\u003EThen my computer crashed. I lost all progress on my video.\u003Cp\u003EBased on past experiences, everytime i try to make videos, bad stuff happens. \u003C/p\u003E\u003Cp\u003EThen it hit me: What if i am just not meant to make videos? What if i am being stopped from making them for some strange reason? What if i am simply overreacting?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re overreacting. There is no cosmic force trying to stop you from publishing footage of a video game you like to play.\u003C/p\u003E\u003Cp\u003EReally, what you have to do is just learn from this and move on. When working on something like this, save often, so if your computer crashes you lose the last fifteen minutes, not four hours.\u003C/p\u003E\n"},{"CreatedByName":"95tiger59","CreatedById":92346,"CreatedDateTime":"2014-07-18T01:53:22Z","Content":"\n\u003Cp\u003Eremember one thing: make sure you are enjoying what your doing, if you don\u0027t enjoy what your doing then likely you won\u0027t have as quality content and viewers won\u0027t like it as much either so remember \u003Cspan style=\u0022font-size:18px;\u0022\u003EHAVE FUN\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2014-07-18T02:34:57Z","Content":"\n\u003Cp\u003EBackup everything before carrying out a process on it (like adding music or resampling)\u003C/p\u003E\u003Cp\u003EProper planning prevents painful poor performance. Or something.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-07-18T02:54:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022quasarrgames\u0022 data-cite=\u0022quasarrgames\u0022\u003E\u003Cdiv\u003EAnyone had something like this happen to them?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022We choose to make YouTube videos and do the other things not because they are easy but because they are hard.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-07-18T03:07:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022quasarrgames\u0022 data-cite=\u0022quasarrgames\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThen my computer crashed. I lost all progress on my video.\u003C/p\u003E\u003Cp\u003EBased on past experiences, everytime i try to make videos, bad stuff happens. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been making videos since I was in high school some 14-15 years ago. I\u0027ve lost many, many hours to video editor crashes, hard drive failures, losing USB drives and in one case, a house fire. Stuff happens, you just get better at backing stuff up as you get more experiences. SAVE OFTEN! Triple backup every completed video if you can. That is a horrible feeling to see all that work go POOF, but just remember you learned while making it so next time you\u0027ll do it better. Oh, and make videos only if you have fun doing so. Doing something for popularity just leads to disappointment, doing something because you enjoy it means you\u0027re happy no matter what.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E(I lost about an hour or more of video in a VE crash when doing the Kerbin Cup 3rd round just a few days ago. Still happens to me. At least I saved!)\u003C/p\u003E\n"},{"CreatedByName":"Blind Dead McJones","CreatedById":109600,"CreatedDateTime":"2014-07-18T03:13:52Z","Content":"\n\u003Cp\u003ELike Xacktar said, don\u0027t let this discourage you, just think of it as a lesson about saving*. Really, you should consider yourself lucky that you had this problem with a video you made as a hobby and could just make again without any real problems. It\u0027s not like you lost a school project or something, then you\u0027d be pretty screwed.\u003C/p\u003E\u003Cp\u003E*Most video programs, or at least all the ones I know, autosave periodically. Are you sure you lost everything? Either way, saving manually is still important.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2014-07-18T03:23:31Z","Content":"\n\u003Cp\u003EAs a KSP and other games YouTuber I can give you this advice.\u003C/p\u003E\u003Cp\u003EIf you are \u003Cstrong\u003Ehaving fun\u003C/strong\u003E making videos, then keep working through the issues, your personality and enjoyment of the game will come across - and it makes all the difference to most people.\u003C/p\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-07-18T04:36:02Z","Content":"\n\u003Cp\u003EYou will lose video / files / saves / hardware. That\u0027s a fact. You pick up the pieces and move on.\u003C/p\u003E\u003Cp\u003EI had a catastrophic hard drive failure between episode 4 and 5 of my current running series, saves missing an all the footage gone, it was frustrating and I was tempted to end all this youtube business right there. \u003C/p\u003E\u003Cp\u003EI\u0027m currently in episode 21, this sunday episode 22 is going to be released and I\u0027m 2 / 3 episodes shy of finishing the series. If you are having fun, don\u0027t let a little set back take you down.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Twb3RXDHALw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EP.S.: Where I can watch your episodes? Put a link in your sig dude!\u003C/p\u003E\n"},{"CreatedByName":"roosterr","CreatedById":61317,"CreatedDateTime":"2014-07-18T05:45:37Z","Content":"\n\u003Cp\u003EIf you are on Windows 7 or 8, get an external drive. The Backup and Recovery utility can take Virtual Machine (.VHD) snapshots at scheduled intervals. And it actually works very well (surprise). Future problem solved.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-07-18T07:03:26Z","Content":"\n\u003Cp\u003EI\u0027ve been using plain old Windows Movie Maker for creating the just of my videos but when I first got OBS, Movie Maker had problems loading video. It wouldn\u0027t save any clips if they where under around 13 seconds. So basically everything. I updated and that fixed the problem. If anyone has a better \u003Cem\u003Efree\u003C/em\u003E video editing program please point me to it!\u003C/p\u003E\u003Cp\u003EIf you like making videos, keep doing it. It\u0027s a tip for myself and it has brought me nothing bad in the long run *knocks on wood*.\u003C/p\u003E\u003Cp\u003EEDIT!!!!! .24 is out.\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-07-18T08:45:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022roosterr\u0022 data-cite=\u0022roosterr\u0022\u003E\u003Cdiv\u003EIf you are on Windows 7 or 8, get an external drive. The Backup and Recovery utility can take Virtual Machine (.VHD) snapshots at scheduled intervals. And it actually works very well (surprise). Future problem solved.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Windows backup utilities have been solid for a while now. Windows Defender is pretty good, too, though not really a good solution as your primary defense, since it\u0027s got a massive target painted on it for coming installed with Windows.\u003C/p\u003E\u003Cp\u003EIf only we can get Microsoft to make a half decent web browser. I\u0027m not sure we can ever trust the company responsible for IE 6 with that task, though.\u003C/p\u003E\n"}]}