{"TopicId":78131,"ForumId":39,"TopicTitle":"The Space Age - The Evil Events That Happened","CreatedByName":"Bearsh","CreatedById":107549,"CreatedDateTime":"2014-07-18T06:15:06Z","PageNum":1,"Articles":[{"CreatedByName":"Bearsh","CreatedById":107549,"CreatedDateTime":"2014-07-18T06:15:06Z","Content":"\n\u003Cp\u003EApproximately, 2000000 Years into kerbin\u0027s future... The planet kerbin was said to be destroyed, The sun... Reached it\u0027s final apex and the whole kerbin system was said to be destroyed... \u0022Said\u0022\u003C/p\u003E\u003Cp\u003ENot even a shard of realistic okay? So don\u0027t be coming here for realisticity, Your reading the fanworks lol.\u003C/p\u003E\u003Cp\u003EAlso this story is greatly inspired by the call of duty zombies storyline!\u003C/p\u003E\u003Cp\u003EThe only few parts of the planet kerbin that were left, Only shards of each planet survived, Each shards connected to kerbin, The home of the kerbal species... And the ancient kerbals before... They found something... Let me tell you how this all began.\u003C/p\u003E\u003Cp\u003EOnce the planet kerbin was at it\u0027s last few years...\u003C/p\u003E\u003Cp\u003EEvery kerbal knew it was close to the end... But it had to happen, For the events that would happen in the future, Would make it all meaningful, So they thought.\u003C/p\u003E\u003Cp\u003EThe climax that started this event was known only as \u0022Odysseus Event\u0022\u003C/p\u003E\u003Cp\u003EIn the year of 9090, A horrible ancient element was found, Mined, Scanned and expirimented on.\u003C/p\u003E\u003Cp\u003EOnly known as Element 204. A new element was added, As 204.\u003C/p\u003E\u003Cp\u003EA group of miners known only as group 36, Found this orb, A ancient orb that was meant to never be found.\u003C/p\u003E\u003Cp\u003EThe orb was found unpowered, locked... dead!\u003C/p\u003E\u003Cp\u003EOnce the orb was close to element 204, The orb powered up... And stole the souls of all the miners, and the project leader!\u003C/p\u003E\u003Cp\u003EThose souls powered it, Giving the ancient orb the power it needed to regain it\u0027s horrible grasp on the planet oncemore.\u003C/p\u003E\u003Cp\u003EThe recordings we\u0027re disintegrated, The Souls Stolen, Bodies Gone... Orb, Disappeared.\u003C/p\u003E\u003Cp\u003ENoone knew what happened, But the orb, Would ultimately destroy the world... And start a new cycle!\u003C/p\u003E\u003Cp\u003ENext parts soon!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-18T06:41:05Z\u0022 title=\u002207/18/2014 06:41  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 18, 2014\u003C/time\u003E by Bearsh\u003C/strong\u003E\n\u003C/span\u003E\n"}]}