{"TopicId":78230,"ForumId":16,"TopicTitle":"Easiest way to calculate how high a stage will get me?","CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2014-07-18T15:25:12Z","PageNum":1,"Articles":[{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2014-07-18T15:25:12Z","Content":"\n\u003Cp\u003ESo, I\u0027m curious, now that we have these \u0022Activate engine X at Y altitude at Z velocity\u0022 contracts, is there any easy way to figure out roughly what altitude and velocity I\u0027ll be travelling when a stage has finished? I use KER, so I already know the dV, TWR, ISP and Burn Time of each stage, but I can\u0027t quite figure out the math behind distance travelled and max velocity during the course of a stage. If I didn\u0027t have to deal with non-constant acceleration, and drag, and so on, this would be simpler, but I\u0027m not entirely sure how to figure it out- especially with the gravity-turn to consider (or maybe my sleep-deprived brain is missing something blindingly obvious).\u003C/p\u003E\u003Cp\u003EObviously I want to design my first stage to run out when I\u0027m at the target altitude and velocity, without wasting fuel, since the idea is to be as economical and efficient as possible, so does anyone have a way of figuring this out?\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003EAsh\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-07-18T15:30:07Z","Content":"\n\u003Cp\u003EYou can manually keep the acceleration more or less constant by throttling back as the rocket climbs., keeping 1 eye on the G meter beside the NavBall. Then you don\u0027t have to worry about that or even variable drag. Anyway, with roughly constant acceleration, you can figure out the time required to reach a certain altitude and speed.\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2014-07-18T20:02:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EYou can manually keep the acceleration more or less constant by throttling back as the rocket climbs., keeping 1 eye on the G meter beside the NavBall. Then you don\u0027t have to worry about that or even variable drag. Anyway, with roughly constant acceleration, you can figure out the time required to reach a certain altitude and speed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the quick reply;\u003C/p\u003E\u003Cp\u003ESo if I try to stay at around 2G constantly, I can just use d=Ã‚Â½atÃ‚Â²? Would I not need to take the gravity turn into account, though, since I\u0027m not going to be burning straight up after 10km?\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-07-18T20:15:22Z","Content":"\n\u003Cp\u003EYou would need to take the gravity turn into account, along with changing gravity. Acceleration due to gravity will fall as your rocket rises, so holding 2 G is increasing net acceleration.\u003C/p\u003E\n"},{"CreatedByName":"Vilheim","CreatedById":83096,"CreatedDateTime":"2014-07-18T20:25:41Z","Content":"\n\u003Cp\u003EYou know, funnily enough, I\u0027ve been trying to work that out.\u003C/p\u003E\u003Cp\u003EFor kicks, I decided to try and see if I could figure out the exact amount of fuel and limited thrust to just reach 5000 meters from the launch pad (the 2nd contract) So, with just a RT-10 Booster, a command pod, and beginning parachute, how can I reach exactly that height?\u003C/p\u003E\u003Cp\u003EI started working on it yesterday and though I\u0027ve made some progress, I don\u0027t have a solution yet. It is likely to involve a nonlinear differential equation though, so it could get messy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t think your going for something quite that specific though...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashflare\u0022 data-cite=\u0022Ashflare\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo if I try to stay at around 2G constantly, I can just use d=Ã‚Â½atÃ‚Â²? Would I not need to take the gravity turn into account, though, since I\u0027m not going to be burning straight up after 10km?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell in that case, you will probably need to parametrize and turn it into a 2 dimensional problem, and figure out your path length roughly. You can use distance from KSC to help. (leave a ship down there so you can reference your distance from it). Then, if your staying around 2G constantly, you can use that to calculate everything else\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-07-20T18:15:12Z","Content":"\n\u003Cp\u003EFor the most part, I\u0027m holding off on filling those contracts until I get enough science for aircraft. Then it\u0027s a simple matter of flying at the desired altitude and velocity, then hitting \u0022stage\u0022 or \u0022test\u0022 (as appropriate). Much easier (and CHEAPER) than trying to design a custom craft and/or mission profile to hit the altitude/velocity window with a rocket.\u003C/p\u003E\u003Cp\u003EThough I note a potential drawback to that strategy: is there a maximum number of active contracts? I have 8 at the moment, and the new offers seem to have stopped coming. (I may have to hit the airplane branch of the tech tree sooner rather than later...)\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-07-20T23:13:37Z","Content":"\n\u003Cp\u003EI think the most practical option would be to make ships with varying amounts of delta-V, fly them straight up at roughly optimal speed either manually or with MechJeb, and note down the figures of interest. Then just use that to make a lookup table, and interpolate if need be.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-07-21T06:49:15Z","Content":"\n\u003Cp\u003EI\u0027ve found it easier just to make a couple of standard test rigs using staged SRBs. One is a standard ascent profile other is beyond terminal velocity profile. They will stage regularly up to 30km and cost 2-3000 kerbucks. I\u0027ve found that doing a dedicated test on one of these rigs is far cheaper and easier than doing multiple tests in a single launch. The cost of failure and risk profile was too high to do anything but build and use reliable test platforms.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-07-21T07:10:58Z","Content":"\n\u003Cp\u003ETest platforms seems a good idea, especially aircraft-based ... I could see that working out well for flying missions for smaller parts.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-07-21T07:51:04Z","Content":"\n\u003Cp\u003EHmm. I also created a chart which shows the dV required to reach XX altitude on Kerbin in stock using TWR around 1.7 to 2.0. I might be able to dig that up and post it tomorrow if you are interested.\u003C/p\u003E\u003Cp\u003EIt\u0027s a terminal velocity launch profile, so you\u0027d have to pad the numbers if you needed a speed higher than that.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-07-21T12:59:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Master Tao\u0022 data-cite=\u0022Master Tao\u0022\u003E\u003Cdiv\u003EYou would need to take the gravity turn into account, along with changing gravity. Acceleration due to gravity will fall as your rocket rises, so holding 2 G is increasing net acceleration.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EG doesn\u0027t change enough that close to Kerbin to worry about. Also, if the goal of the mission is simply to test parts, there\u0027s no need to do a gravity turn unless you the contract calls for some really abnormal combination of speed and altitude. Just go straight up, do the test, and come straight down. Whatever survives the mission lands closer to KSC that way, so more money on recovered parts.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Srpadget\u0022 data-cite=\u0022Srpadget\u0022\u003E\u003Cdiv\u003EFor the most part, I\u0027m holding off on filling those contracts until I get enough science for aircraft. Then it\u0027s a simple matter of flying at the desired altitude and velocity, then hitting \u0022stage\u0022 or \u0022test\u0022 (as appropriate). Much easier (and CHEAPER) than trying to design a custom craft and/or mission profile to hit the altitude/velocity window with a rocket.\u003Cp\u003EThough I note a potential drawback to that strategy: is there a maximum number of active contracts? I have 8 at the moment, and the new offers seem to have stopped coming. (I may have to hit the airplane branch of the tech tree sooner rather than later...)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have no problem at all declining contracts I don\u0027t like. Just hit the red X button instead of the green check button. Once declined, the bad contract goes away and is replaced by 1 or more new contracts that have a chance of being better. This is especially true if a contract has been lingering unaccepted on the list while your technology and achievements have advanced. When 1st offered, the contract might have had a decent reward for your current financial and tech levels, but not now. So junk them. In fact, junk anything with ridiculous requirements. pathetic rewards, or that you just don\u0027t want to bother with. Also note that as you go along, the number of contracts on offer at once does increase. I\u0027ve had over a dozen at once so far.\u003C/p\u003E\u003Cp\u003EAnyway, what I find useful is to concentrate on the following types of contracts:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ELanded at Kerbin.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESplashed down at Kerbin.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIn flight with speed/altitude combos that are roughly within the range of a normal rocket ascent profile. Just do these as part of other missions without having to alter your flight much if at all.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESuborbital trajectories: Usually quite easy as part of normal business.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIn orbit: Ditto\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo, 1st you decline all contracts that don\u0027t fit into one of these boxes. Then you make a 2nd pass looking at the rewards. Ignore rep rewards as a decision criterion; rep doesn\u0027t pay the bills or unlock tech, and you amass it anyway just by not dying. What you\u0027re looking for mostly is high cash payouts because that\u0027s mostly what contracts are good for. Some give science but usually no more than about 2/3 of the price of a single node on the tier you\u0027re currently working on, usually only 1/2 that. To score big on science, you have to do like in previous versions of the game and do serious science-gathering missions to other planets. The underlying idea seems to be that your science missions cost money and your contract missions pay the bills for them. This is why cash contracts pay a lot more than the cost of the rocket needed to do them. At least they do if you keep declining those that don\u0027t, so you\u0027re always seeing new ones that fit your current status.\u003C/p\u003E\u003Cp\u003EBy now you should have a rough idea of what rockets cost with your available parts. Pick contracts that pay more than that. And if you see a decent science reward in there, take it, too. Junk the rest. This should give you a set of 2-4 contracts you can do without breaking a sweat and give you a very healthy profit. So go do them. When you get back, you\u0027ll have another batch of contracts to sort through. Repeat as necessary or until you get bored, then go do a Mun landing or something.\u003C/p\u003E\n"}]}