{"TopicId":7831,"ForumId":29,"TopicTitle":"Rotating parts?","CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-03-08T19:22:13Z","PageNum":1,"Articles":[{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-03-08T19:22:13Z","Content":"\n\u003Cp\u003EHi everyone, I was just playing around with a so-called UFO (those ships with lots of winglets that build speed when rotating), and was wondering if it would be possible to code a part so that it (or part of it, for attachment purposes) rotates about its own axis (the same way bearings work).\u003C/p\u003E\u003Cp\u003EIf so, would it be possible to attach others parts on the rotating part?\u003C/p\u003E\u003Cp\u003EThe purpose of my question is purely informative, as I have no coding ability whatsoever, but if someone wants to give it a try, I\\\u0027d really like to know about it!\u003C/p\u003E\n"},{"CreatedByName":"Yorik","CreatedById":3479,"CreatedDateTime":"2012-03-08T19:58:53Z","Content":"\n\u003Cp\u003EYou can use the landing leg part to simulate rotation on the press of a key if you put the hinge in the center. But it will stop moving once it rotated by the degrees specified in the config file, pressing the key again will rotate it back to it\\\u0027s original position. That\\\u0027s as far as you\\\u0027ll go without coding something yourself. The whole movement code is still a big mystery to me, can\\\u0027t make heads or tails out of it yet.\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-03-08T20:13:11Z","Content":"\n\u003Cp\u003EI didn\\\u0027t even think about using something similar to the landing legs, but I was indeed speaking about a continuous rotation, and not simply a set angle.\u003C/p\u003E\u003Cp\u003EIf we can however set an angular speed rather than an angle, it might just work.\u003C/p\u003E\u003Cp\u003EAs I said, though, I can\\\u0027t check that by myself, so I\\\u0027ll just wait for someone to try this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2012-03-08T20:23:06Z","Content":"\n\u003Cp\u003EAlso the default behavior doesn\\\u0027t let you attach anything to the secondary collider node that moves with the leg, only the main node which is in the \u0027anchor\u0027 or hinge, which you use to attach the leg to something else.\u003C/p\u003E\u003Cp\u003EIt will take a custom part for sure, and I am not sure whether someone can code a function that allows the VAB to recognize custom collider nodes to accept part connctions.\u003C/p\u003E\n"},{"CreatedByName":"Yorik","CreatedById":3479,"CreatedDateTime":"2012-03-08T20:47:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso the default behavior doesn\\\u0027t let you attach anything to the secondary collider node that moves with the leg, only the main node which is in the \u0027anchor\u0027 or hinge, which you use to attach the leg to something else.\u003C/p\u003E\u003Cp\u003EIt will take a custom part for sure, and I am not sure whether someone can code a function that allows the VAB to recognize custom collider nodes to accept part connctions.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs it possible to change the location/orientation of an attachment node with coding?\u003C/p\u003E\n"}]}