{"TopicId":78430,"ForumId":32,"TopicTitle":"Is perfectionism driving you crazy in 0.24?","CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-07-19T14:13:14Z","PageNum":1,"Articles":[{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-07-19T14:13:14Z","Content":"\n\u003Cp\u003EI haven\u0027t spent too long playing 0.24 so far, but as I prepare for my second launch (after completing the first four missions) I am worried about my sanity.\u003C/p\u003E\u003Cp\u003EI want to land every craft, even rockets, back at KSC. I want to pinch every penny on launch. I want to grab every contract available and do them all in one launch. I have spent 3 hours just designing my rocket for mission 2 to do 6 contracts (decoupler test, parachute test, SRB test, rescue, Kerbin orbit science, Mun landed science).\u003C/p\u003E\u003Cp\u003EAnyone else?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-19T18:19:39Z\u0022 title=\u002207/19/2014 06:19  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 19, 2014\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-07-19T14:39:22Z","Content":"\n\u003Cp\u003EPerfect is an enemy of good enough. \u003C/p\u003E\u003Cp\u003EOn the other hand its fun to make complex missions like landing on all of minmus biomes in one go. \u003C/p\u003E\u003Cp\u003EI found that most of the in flight test are best done by probes, as they are launched strait up they land back on pad and most only use 45 liter fuel.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-07-19T14:40:45Z","Content":"\n\u003Cp\u003EGood enough is the enemy of success.\u003C/p\u003E\u003Cp\u003EYes, I am actually making attempts now to build reasonably and land back at KSC.\u003C/p\u003E\n"},{"CreatedByName":"Rithsom","CreatedById":114646,"CreatedDateTime":"2014-07-19T14:45:29Z","Content":"\n\u003Cp\u003EI\u0027m always tempted to do this too, but I try really hard to stop myself. I want to make as much money as I can in my new career save (as much as it takes to completely fill the funds meter sometimes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E).\u003C/p\u003E\n"},{"CreatedByName":"Arran","CreatedById":64656,"CreatedDateTime":"2014-07-19T14:48:58Z","Content":"\n\u003Cp\u003EYes, allthough my perfectionism is also going hand in hand with estetics, it has to\u003C/p\u003E\u003Cp\u003EA : preform perfectly \u003C/p\u003E\u003Cp\u003EB : As simple as possible \u003C/p\u003E\u003Cp\u003EC : looks smooth / Real as possible\u003C/p\u003E\u003Cp\u003EThis high standard does mean alot of my designs even though perfectly good working, end up in the scrapbin.\u003C/p\u003E\u003Cp\u003EAnd thus means my program is progressing very slowly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-07-19T14:56:19Z","Content":"\n\u003Cp\u003EHere\u0027s a better strategy for the skilled player: just ignore the procedural contracts entirely. The contracts outside of the non-procedural ones are generous, and you can return to the space center mid-mission to get more of them (so if your first launch sends you out towards the Mun, Minmus, or the sun, you can get the relevant missions for them without having to finish your current flight). You could also opt to troll the procedural contracts and only pick out ones that your currently-in-flight mission can easily complete as-is.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-07-19T14:58:23Z","Content":"\n\u003Cp\u003EMy only rule is:\u003C/p\u003E\u003Cp\u003ENo more just-the-capsule-returns missions. Those are long gone. I land whatever orbital maneuvering system went up, as close as I can get to KSC.\u003C/p\u003E\u003Cp\u003EAnother thing I try to do is max the science/contracts I can do per launch. My first Mun mission brought 2 materials bays, 4 mystery goo canisters, an orbiter and a lander. Soon I\u0027ll put up stations and such, but as of yet I\u0027ve still got some contracts to wrap up.\u003C/p\u003E\n"},{"CreatedByName":"morph113","CreatedById":102656,"CreatedDateTime":"2014-07-19T15:01:39Z","Content":"\n\u003Cp\u003EWell in general yes I try to be as perfect as possible. I have started the new career mode a few times over to test stuff. What I can say is, that if you are progressing too fast you are missing out on a lot of easy early cash. Like there are missions for setting a new height record, first at 5000 meter, then 11k, then 22k, then 33k, then 56k.... and everytime the amount of money you get from it doubles. You pretty much do them one after another with the first science node and get good cash quick. Or you can instead just leave Kerbin atmosphere on your very first flight and miss out on all that money. It\u0027s up to you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TUFOM","CreatedById":83820,"CreatedDateTime":"2014-07-19T15:06:48Z","Content":"\n\u003Cp\u003EYap, kinda ocd action in 0.24 for me. not one kerbal can die, every contract requirement must be accomplished. Everything must be designed efficient as possible. etc. But I like it!\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-07-19T15:06:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003EGood enough is the enemy of success.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBad judgement is the enemy of success, not matter whether it manifests as perfectionism or as too low standards for \u0022good enough\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2014-07-19T15:10:19Z","Content":"\n\u003Cp\u003EHm, I usually only do 1 or 2 contracts at a time and find that the payouts are so large that I don\u0027t have to worry about money at all. I started playing really strategically at first, but ended up with 1.7 million Funds by the time I finished planted a flag on Mun and doing a Minmus flyby. I don\u0027t worry about where I\u0027m landing and in many cases just return the capsule. I found that the parts payback might be 10,000 Funds, but the mission is paying out 70,000, so I spend less time optimizing each mission and more time doing more missions. Kind of like what NASA has done in the past couple of decades -- cheaper missions with less testing, but more of them.\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2014-07-19T15:14:31Z","Content":"\n\u003Cp\u003EIt is not perfect, if you spend 3 hours on 5contracts and one launch, instead of doing 10 contracts in 5 launches, earning twice the funds in profits...\u003C/p\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-07-19T15:15:15Z","Content":"\n\u003Cp\u003EYep, instead of just returning the capsule, now I spam radial chutes all over the ship. Radial chutes are my best friend.\u003C/p\u003E\n"},{"CreatedByName":"Razor235","CreatedById":16436,"CreatedDateTime":"2014-07-19T15:16:56Z","Content":"\n\u003Cp\u003EMoney isn\u0027t really an object for me. Even after launching 3 consecutive Mun missions, two of which had no payout because they were to rescue Jeb, I still have a tidy 550,000 in the bank.\u003C/p\u003E\n"},{"CreatedByName":"adge","CreatedById":85309,"CreatedDateTime":"2014-07-19T15:27:39Z","Content":"\n\u003Cp\u003ESame as above: money is so easy to come by, I decided against trying to save every penny possible. I wouldn\u0027t find the constant planning and focus-shifting and returning everything enjoyable - but that\u0027s just my style. If you love the challenge, excellent!\u003C/p\u003E\u003Cp\u003EHowever, that being said, I do try and return more than just a capsule now. If my lander has some fuel left in the tank, I\u0027ll not jettison it and just capsule return, for example! But I\u0027m not actively looking to have enough fuel to return for the extra cash, just if it happens \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only perfectionism striking me is wanting to be a completionist and fulfill every single contract offered\u003C/p\u003E\n"},{"CreatedByName":"bmyers831","CreatedById":113233,"CreatedDateTime":"2014-07-19T15:29:41Z","Content":"\n\u003Cp\u003EYep, that\u0027s me. I started a new career for the contracts and found myself fussing over doing as many contracts in one flight as I was capable of and then doing a lot of reverting to get it right. I\u0027m going to have to set some standards for myself for non-perfection or I\u0027m going to burn myself out.\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-07-19T17:20:26Z","Content":"\n\u003Cp\u003ESome of the procedural ones give very weird requirements. I got one that was pure kerbal... needed to test a seperator in flight. whats so special about that you ask? it had a speed requirement of 480 to 700m/s. Still not all that intresting? the test also had to happen between 1km and 6km. the TWR to get going that fast that low is silly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I\u0027ve also had a few that required moveing very slowly at 20km\u002B I\u0027ve just ended up skiping some of the more outragious ones, not worth the headache although i did do the hyperspeed seperator test because more boosters is fun.\u003C/p\u003E\n"},{"CreatedByName":"LordCorwin","CreatedById":114256,"CreatedDateTime":"2014-07-19T17:28:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EI want to land every craft, even rockets, back at KSC. I want to pinch every penny on launch. I want to grab every contract available and do them all in one launch. I have spent 3 hours just designing my rocket for mission 2 to do 5 contracts (decoupler test, parachute test, SRB test, rescue, Kerbin orbit science, Mun landed science).\u003C/p\u003E\u003Cp\u003EAnyone else?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI haven\u0027t seen any mission regarding biomes and these places provide a lot of science. So I\u0027m trying to do as many contracts as possible to get funds in order to leave me enough cash to do the science missions I want.\u003C/p\u003E\u003Cp\u003EOf course this also involves to return as close to KSC as possible.\u003C/p\u003E\u003Cp\u003ELord\u003C/p\u003E\n"},{"CreatedByName":"nimbim","CreatedById":66497,"CreatedDateTime":"2014-07-19T17:35:05Z","Content":"\n\u003Cp\u003EI hand-picked the contracts with big rewards and have no trouble. There is no point (financially) in most test contracts, since you would need to combine a lot of them AND return most parts to KSC to make only a marginal profit.\u003C/p\u003E\n"},{"CreatedByName":"RidingTheFlow","CreatedById":111197,"CreatedDateTime":"2014-07-19T18:00:31Z","Content":"\n\u003Cp\u003EI don\u0027t bother about reusability at all. Doing exploration \u0026amp; rescue contracts left me swimming in cash very quickly with basic multistage designs.\u003C/p\u003E\u003Cp\u003EI think the most important bit is to use minimum amount of cheapest parts to do the job (e.g. don\u0027t build 2.5m ship if 1.25m tiny ship will work, use boosters for first stages - they very cheap, etc).\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-07-19T18:44:56Z","Content":"\n\u003Cp\u003EYou just have to realize that there are an infinite number of contracts, so there\u0027s no reason to try to do all of them. Wasting time on little ones with not much reward just takes away time that could be spent on more lucrative ones later.\u003C/p\u003E\u003Cp\u003ETry to just do the biggest contracts you have, especially with regard to reputation so that you can get access to even bigger ones sooner.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-07-19T18:53:26Z","Content":"\n\u003Cp\u003EI guess it\u0027s about picking the challenge.\u003C/p\u003E\u003Cp\u003EThe challenge I\u0027ve set myself isn\u0027t simply to \u0022play KSP\u0022. Yeah, I could launch one rocket and do one contract. That\u0027s probably all you need to do to keep your space program going.\u003C/p\u003E\u003Cp\u003EBut... that\u0027s not enough. If I have 5 contracts, well dagnamit, I\u0027m going to complete 5 contracts in one launch! If I launch a rocket, then I\u0027m damn well going to land it at KSC and not break anything on landing! \u003C/p\u003E\u003Cp\u003EIt\u0027s not about doing only what needs to be done. It\u0027s about... well... it\u0027s about the same thing that the \u0022single launch to unlock the whole tree\u0022 mission in my sig was about. It\u0027s about the challenge!\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-07-19T18:55:13Z","Content":"\n\u003Cp\u003EYep; p.\u003C/p\u003E\u003Cp\u003EThe max ive done is 4 contracts at once though. Ive yet ro lans directly Back at KSC yet. Waiting to unlock better parts to either make a resusable SSTO rocket or planw. Or maybe just a shuttle.\u003C/p\u003E\n"},{"CreatedByName":"No one","CreatedById":112131,"CreatedDateTime":"2014-07-19T18:55:36Z","Content":"\n\u003Cp\u003EPerfectionism is driving me crazy, but in a different way.\u003C/p\u003E\u003Cp\u003EI\u0027m attempting to do everything I do for as cheap as possible. I have over 3 million funds, but every launch which costs more than 50k makes me die a little on the inside.\u003C/p\u003E\u003Cp\u003EAlso, doing everything as cheap as possible has a downside: On my latest mission to Kerbolar orbit I opted for a light LFO rocket to return (48-7S) rather than an ion thruster because ion thrusters are too expensive. Now Neilzon is trapped until I send up a rescue probe, which will basically be a clone of what I used to send him up except with an ion thruster, making the mission cost almost twice as much as if I had just done it right to start with.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-07-19T19:38:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EI haven\u0027t spent too long playing 0.24 so far, but as I prepare for my second launch (after completing the first four missions) I am worried about my sanity.\u003Cp\u003EI want to land every craft, even rockets, back at KSC. I want to pinch every penny on launch. I want to grab every contract available and do them all in one launch. I have spent 3 hours just designing my rocket for mission 2 to do 6 contracts (decoupler test, parachute test, SRB test, rescue, Kerbin orbit science, Mun landed science).\u003C/p\u003E\u003Cp\u003EAnyone else?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot me, not even a little. I already tried to do as much as I could with each launch. I\u0027m also not obsessing about getting every Kredit back, there\u0027s no need, since I wasn\u0027t using obscenely large launchers to begin with. My stuff has always been pretty efficient.\u003C/p\u003E\n"}]}