{"TopicId":78653,"ForumId":32,"TopicTitle":"How is 64 bit working for you ?","CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2014-07-20T17:01:29Z","PageNum":1,"Articles":[{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2014-07-20T17:01:29Z","Content":"\n\u003Cp\u003E64 bit version of 0.24 is working great for me and the game run much smoother than ever before.\u003C/p\u003E\u003Cp\u003ESo how does 64 bit work for you?\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AngusJimiKeith","CreatedById":101138,"CreatedDateTime":"2014-07-20T17:07:59Z","Content":"\n\u003Cp\u003EI\u0027ve gone back to 32 bit for the time being, but I liked what I saw while running 64 bit. Once the various bugs (most importantly the decoupler bug, staging bug, and right click bug IMO) get sorted out, it\u0027ll be absolutely go-to for me. It runs smooth on highest graphics settings on my laptop, which I can\u0027t *quite* say for 32 bit (I had to knock the graphics down one notch on the switch back). Once I add my mods back (provided they\u0027re 64-bit compatible), I\u0027ll probably try again to see the difference then.\u003C/p\u003E\n"},{"CreatedByName":"Firedtm","CreatedById":61907,"CreatedDateTime":"2014-07-20T17:20:23Z","Content":"\n\u003Cp\u003Ehow do i get the 64 bit to run ?\u003C/p\u003E\n"},{"CreatedByName":"tygoo7","CreatedById":57345,"CreatedDateTime":"2014-07-20T17:21:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngusJimiKeith\u0022 data-cite=\u0022AngusJimiKeith\u0022\u003E\u003Cdiv\u003EI\u0027ve gone back to 32 bit for the time being, but I liked what I saw while running 64 bit. Once the various bugs (most importantly the decoupler bug, staging bug, and right click bug IMO) get sorted out, it\u0027ll be absolutely go-to for me. It runs smooth on highest graphics settings on my laptop, which I can\u0027t *quite* say for 32 bit (I had to knock the graphics down one notch on the switch back). Once I add my mods back (provided they\u0027re 64-bit compatible), I\u0027ll probably try again to see the difference then.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame here.\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-07-20T17:22:58Z","Content":"\n\u003Cp\u003E64 bit is working great for me, I love it.\u003C/p\u003E\n"},{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-07-20T17:23:06Z","Content":"\n\u003Cp\u003EAlmost flawless. Almost. It\u0027s been a bit of a chore to get everything sorted to my liking, but having more mods than I can count, gorgeous HD planet textures, clouds in the sky, dust storms on Duna, and a stunning starfield, has made it all worth it!\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-07-20T17:23:15Z","Content":"\n\u003Cp\u003EI won\u0027t say it is smoother or better. \u003C/p\u003E\u003Cp\u003EWith my current list of working mods, the memory footprint is just stupid. Without ATM my 16GB RAM capacity is smashed with almost 10GB of KSP when it is running. Which is just stupid, when I had the EXACT same number of mods running before with ATM in under 2.8GB of RAM. So KSP went from looking like a nicely formed Jello mold, to looking like a Taco Bell mudbutt spatter.\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2014-07-20T17:25:55Z","Content":"\n\u003Cp\u003EI haven\u0027t made it to the huge piece count rockets yet, so I\u0027m not really noticing much of a difference, but then again I have a high end machine and have been running at max settings in 32 bit mode. The only difference I\u0027ve noticed so far is that the Kerbal animations in the cockpit cameras are no longer smooth and animated. It\u0027s now more like a slideshow with insta-changes between facial positions and expressions.\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2014-07-20T17:56:01Z","Content":"\n\u003Cp\u003EI\u0027m going to play 32bit for now. I keep getting CTD when reverting or going to space center after a few flights.\u003C/p\u003E\n"},{"CreatedByName":"OwDoge","CreatedById":115764,"CreatedDateTime":"2014-07-20T18:42:16Z","Content":"\n\u003Cp\u003Ex64 was running in x32 bit for me, or had a memory ceiling, but one punch, three heel taps, and a pentagram later it was working just fine. I\u0027ve noticed some incompatibilities with the mods I would like to use, but overall I think I\u0027m crashing less than before (but not as less as .23 - .23.5)\u003C/p\u003E\n"},{"CreatedByName":"eurybaric","CreatedById":33541,"CreatedDateTime":"2014-07-20T18:50:21Z","Content":"\n\u003Cp\u003EStock, no mods, no crashes, kinda smoother but thats maybe just 0.24. I do have a weird thing with right clicking now that AngusJimiKeith mentioned it though. Also back to the slideshow kerbals in cockpit cameras. Hope these get fixed soon. But all in all, smooth \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Echeers!\u003C/p\u003E\n"},{"CreatedByName":"styckx","CreatedById":49519,"CreatedDateTime":"2014-07-20T18:55:28Z","Content":"\n\u003Cp\u003EI went back to Linux 64bit.. The Windows 64bit Unity client is obviously not ready for prime time yet.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-07-20T19:03:01Z","Content":"\n\u003Cp\u003EIt crashes a lot with just Mechjeb, DPAI, Note, KAC, and KER.\u003C/p\u003E\u003Cp\u003EAlso, lol at 50% RAM usage.\u003C/p\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2014-07-20T19:11:15Z","Content":"\n\u003Cp\u003EIm impressed on how great it runs than before, Im using almost the same amount of mods from 23.5 version and it used to lag much during launch, Now the lag is almost nothing now, It still lags sometimes but the most of lag only comes on SOI changes now.\u003C/p\u003E\u003Cp\u003EI finally can enjoy my game whitout lag issues or constant crashes.\u003C/p\u003E\n"},{"CreatedByName":"AlexanderB","CreatedById":17544,"CreatedDateTime":"2014-07-20T19:23:47Z","Content":"\n\u003Cp\u003EExcept for the slightly unresponsive staging, and the right-click issue, its going quite well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t know if its the staging bug mentioned before? My issue is that staging twice in short succession doesn\u0027t work, have to mash the button a couple of times to make it happen. Might even be a feature to prevent accidentally staging everything if you hold space too long or something. As a fix, I started putting the decoupler and the next engine together in 1 stage.\u003C/p\u003E\n"},{"CreatedByName":"ayana","CreatedById":105618,"CreatedDateTime":"2014-07-20T19:28:15Z","Content":"\n\u003Cp\u003ENot a single crash. I\u0027ve completed 50\u002B contracts and made 4 million in funds. There\u0027sn o good reason to go back to the 32-bit version as far as I\u0027m concerned. None of the bugs really get in my way.\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-07-20T19:30:13Z","Content":"\n\u003Cp\u003Ei dont mean to rant but THE RIGHT CLICCCCCK WONT WORK! I HAVE TO DO IT LIKE 390835 TIMES TO GET A FUEL TRANSFER.\u003C/p\u003E\u003Cp\u003Eother than that it\u0027s great.\u003C/p\u003E\n"},{"CreatedByName":"Kamuchi","CreatedById":110857,"CreatedDateTime":"2014-07-20T19:31:12Z","Content":"\n\u003Cp\u003EIt did require a little debugging with mods as we\u0060re all in update mode, but after starting a new career, I am speechless!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IkgQOoK.png\u0022 alt=\u0022IkgQOoK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oG9hV5I.png\u0022 alt=\u0022oG9hV5I.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ufwWwjj.png\u0022 alt=\u0022ufwWwjj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mimYmrH.png\u0022 alt=\u0022mimYmrH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OZZzDXm.png\u0022 alt=\u0022OZZzDXm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/J9Y0nlB.png\u0022 alt=\u0022J9Y0nlB.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JZmyYqv.png\u0022 alt=\u0022JZmyYqv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETrying my hand for the first time with recording as mission log instead of screenies and it looks 10 times better!\u003C/p\u003E\u003Cp\u003EThank you Squad for releasing the 64bit and modding community! xD\u003C/p\u003E\u003Cp\u003ETHIS is how I imagined my ksp to look when I first got it along time ago \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif\u0022 alt=\u0022:kiss:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-20T19:34:34Z\u0022 title=\u002207/20/2014 07:34  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 20, 2014\u003C/time\u003E by Kamuchi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dommcq","CreatedById":67926,"CreatedDateTime":"2014-07-20T19:32:07Z","Content":"\n\u003Cp\u003EReally nice so far.\u003C/p\u003E\u003Cp\u003EA bit of right click delay but nothing that\u0027s too annoying.\u003C/p\u003E\u003Cp\u003ELot\u0027s of mods and no issues apart from Mod Usage Plugin crashing - deleted all bits of it and no crashing.... hmm.\u003C/p\u003E\n"},{"CreatedByName":"Jade Falcon","CreatedById":114719,"CreatedDateTime":"2014-07-20T19:45:12Z","Content":"\n\u003Cp\u003EFor me it runs faster and looks better but it has a lot of glitches too. Weird graphic errors on loading screens (not an issue mind you), decouplers with no weight (thankfully fixed with a mod), staging not working upon first press of the spacebar, you have to give it a couple of seconds (annoying but I can tolerate it). Also seem to have a few CTD\u0027s too (maybe its mod incompatibility). Oh and yeah I know its daft but I would like my steam overlay to work, I can run the game through Steam and it logs my hours but my overlay doesn\u0027t work with 64bit for some insane reason. \u003C/p\u003E\u003Cp\u003ESo while its very nice to have 64bit and I appreciate it but personally I\u0027m not sure if I want to live with the issues or go back to 32bit.\u003C/p\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2014-07-20T19:52:17Z","Content":"\n\u003Cp\u003EI did the 64 bit hack in 23.5 and only crashes I got was when I added a mod. That was easily fixed by relaunching the game. In fact, I had fewer of the bugs that plagued others using the hack. But it looks like Karma caught up to me this time. Running half the mods I ran in 23.5 hack (all say updated to 24 64) and getting a lot more random crashes - selecting a part in VAB, scene switching, ship switching, upon loading a craft, sometimes in game loading. I\u0027m thinking there is a stray bit of code somewhere in a plugin causing a conflict as I\u0027m not running out of memory. But I\u0027m no coder, so that\u0027s just a guess.\u003C/p\u003E\u003Cp\u003EWith all that said, the 23.5 hack convinced me that 64 bit is the way to play KSP. So I\u0027ll be patient and play the 23.5 hack until the bugs get worked out.\u003C/p\u003E\u003Cp\u003EOS: Win 7 64 bit, i5-4670k, Raedon HD 7870, 16gb ram\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-20T20:12:00Z\u0022 title=\u002207/20/2014 08:12  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 20, 2014\u003C/time\u003E by Voidryder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-07-20T19:55:06Z","Content":"\n\u003Cp\u003EThe loading screen did actually, despite the widespread skepticism, seem to load a bit faster, although this may just be related to the 0.24 update.\u003C/p\u003E\u003Cp\u003EOtherwise I\u0027ve had a few minor bugs, e.g. trouble right-clicking parts in space, but overall it\u0027s about the same.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-20T19:56:22Z\u0022 title=\u002207/20/2014 07:56  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 20, 2014\u003C/time\u003E by parameciumkid\u003C/strong\u003E\n\u003Cbr\u003Etypo ^^;\n\u003C/span\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2014-07-20T19:55:20Z","Content":"\n\u003Cp\u003EI just ordered 8GB of extra RAM just so I could get the most out of this 64 bit! Will be keeping my eye on the various bugs and mods I love so much. Planning to go insane!\u003C/p\u003E\n"},{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2014-07-20T19:56:51Z","Content":"\n\u003Cp\u003EWorking perfectly fine for me (so far) - but then again, using Linux, and it was working just great on 0.23.5 for me as well.\u003C/p\u003E\u003Cp\u003E0.24 seems to be using quite a bit less RAM, and possibly a little less CPU, than 0.23.5 was with roughly the same mods (still waiting on all of them to catch up), but my 0.24 career isn\u0027t nearly as advanced yet so might be due to that.\u003C/p\u003E\u003Cp\u003ETo assist everybody (and specifically Squad), it would be helpful if people with issues post their OS as well (Windows, Mac, or Linux), since it seems that most current issues are specific to Windows at the moment.\u003C/p\u003E\n"},{"CreatedByName":"Deejay2000","CreatedById":73422,"CreatedDateTime":"2014-07-20T20:22:12Z","Content":"\n\u003Cp\u003EI was just playing on 32 bit this whole time and I didn\u0027t even know it...\u003C/p\u003E\u003Cp\u003EGoddamnit.\u003C/p\u003E\n"}]}