{"TopicId":78661,"ForumId":46,"TopicTitle":"Blocking other users","CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-07-20T17:26:19Z","PageNum":1,"Articles":[{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-07-20T17:26:19Z","Content":"\n\u003Cp\u003EI\u0027ve received an unwanted private message, is there any way to block that particular user from sending me private messages?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-07-20T17:54:59Z","Content":"\n\u003Cp\u003EGo to that member\u0027s profile page, and one of the options in the menu on the left is \u0022add to ignore list.\u0022 Members on your ignore list should not be able to send you PMs, and you will see a blank notice when running across that person\u0027s posts on forum pages.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-07-20T18:11:42Z","Content":"\n\u003Cp\u003EIs there any way to just prevent them from sending private messages? I don\u0027t necessarily want to hide their forums posts...\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-21T01:05:23Z","Content":"\n\u003Cp\u003EI think you can restrict private messages to your friends only, but that\u0027s a bit like using a hammer to swat a fly.\u003C/p\u003E\u003Cp\u003EIf the user won\u0027t stop messaging you after being asked not to (I\u0027m assuming you asked), maybe a mod should talk to them.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-07-21T06:59:32Z","Content":"\n\u003Cp\u003EStill not sure if there\u0027s a way to block only PMs, but when someone is on your ignore list, you still see that that person has made a post. The content is just hidden unless you click to view it.\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2014-07-21T08:11:34Z","Content":"\n\u003Cp\u003EPretty aggree with RIC, BL always been a poor solution, better to discuss and teach than just ignore for self convenience to prevent further more misunderstood and anger.\u003C/p\u003E\u003Cp\u003ENot very diplomatic but trying at best \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-07-21T20:34:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EIf the user won\u0027t stop messaging you after being asked not to (I\u0027m assuming you asked), maybe a mod should talk to them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. If it\u0027s a consistent pattern of harassment, you can always report the PM or PMs in question, and the report will show up in the same place as those for reported posts. It may also be helpful to provide a record of any correspondence leading up to that point (whether public or private), so that we have some context.\u003C/p\u003E\n"}]}