{"TopicId":78809,"ForumId":32,"TopicTitle":"How has the new career mode changed how you build?","CreatedByName":"corvustech","CreatedById":111036,"CreatedDateTime":"2014-07-21T14:06:58Z","PageNum":1,"Articles":[{"CreatedByName":"corvustech","CreatedById":111036,"CreatedDateTime":"2014-07-21T14:06:58Z","Content":"\n\u003Cp\u003ENow that Kerbin is no longer a socialist utopia with limitless resources and nothing to do with them but launch them to space, how have your career mode builds changed? \u003C/p\u003E\u003Cp\u003EI know that for me, my Mass Overload Acceleration Rectification (M.O.A.R.) Boosters approach of solving underpowered launches with hive like clusters of boosters is gone. Due to contracts I\u0027ve found myself building simpler or just plain weird designs, such as a booster with a pod on top.\u003C/p\u003E\u003Cp\u003EHow has it changed your builds?\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-07-21T14:12:51Z","Content":"\n\u003Cp\u003ENot much. I\u0027m still the aesthetic perfectionist, which usually means although my ships look good, they don\u0027t exactly match up in funds. Despite this, my V100,000 investment into a small space station around Kerbin is finally paying off, since it now recieves tons of traffic from vessels going back and forth, rescuing Kerbals and all that which racks up a huge profit to fund my various schemes. \u003C/p\u003E\u003Cp\u003EBeyond LKO, my funds get tighter. It took around 1/10th of my entire budget to launch my Munar mission with all these accessories and SLS parts, which means I pretty much scrapped my manned Munar program after several landings, because literally, it \u0022cost way too much\u0022.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-21T14:15:06Z\u0022 title=\u002207/21/2014 02:15  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 21, 2014\u003C/time\u003E by NASAFanboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-07-21T14:13:34Z","Content":"\n\u003Cp\u003EThose testing contracts are getting a bit annoying, they\u0027re making their way into almost all of my ships... I always add on a testing part to ships that get into orbit.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-07-21T14:14:14Z","Content":"\n\u003Cp\u003Emod delete. bugged edit post created new post.\u003C/p\u003E\n"},{"CreatedByName":"PixelClef","CreatedById":113846,"CreatedDateTime":"2014-07-21T14:15:12Z","Content":"\n\u003Cp\u003EI think the simplest contract build I\u0027ve made was for testing the BACC booster on the ground. Command pod on the bottom, oriented upward as usual. BACC booster on the top, oriented downward.\u003C/p\u003E\u003Cp\u003EOf course, Jeb wasn\u0027t even remotely concerned when I lit that candle, trying to push his capsule through the launch pad.\u003C/p\u003E\n"},{"CreatedByName":"tjsnh","CreatedById":108021,"CreatedDateTime":"2014-07-21T14:21:25Z","Content":"\n\u003Cp\u003EIt\u0027s changed my builds in that it seems to very strictly control WHAT I build (mun mission, probe to dres, etc) and I find myself adding in useless junk on to most of my missions now. For example, after the \u0022explore the Mun\u0022 mission you get the \u0022plant a flag on the Mun\u0022 mission ... my very first manned mun lander had non-functional and otherwise-dead-weight spaceplane landing wheels sticking off the side so it could be tested for a contract.\u003C/p\u003E\u003Cp\u003EOn the up side, \u0022test this prototype nuclear rocket engine!\u0022 _DID_ allow me to do the \u0022explore duna\u0022 contract way earlier than I expected to realistically be able to send a probe.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-07-21T14:25:42Z","Content":"\n\u003Cp\u003ENo more standardization! I usually use the same rocket designs for, well, everything, however due to expenses I have to build a new, custom rocket for everything I do. It\u0027s actually quite fun. I\u0027ve already forgotten the fun of building and testing new things, even when you think they\u0027ll explode on the launchpad.\u003C/p\u003E\n"},{"CreatedByName":"PlonioFludrasco","CreatedById":98915,"CreatedDateTime":"2014-07-21T14:29:40Z","Content":"\n\u003Cp\u003ENow I build two stage to orbit rockets, with less bosters (jeb is hating this) radially attached. Because the first stage separates very high, I have time to circularize with the 2nd stage and focus back on the 1st before it\u0027s unload. Deploy chutes, and I\u0027ve saved lot of Funds.\u003C/p\u003E\u003Cp\u003EI\u0027ve also built a 100% recoverable rocket to rescue Kerbals for contracts.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2014-07-21T14:34:49Z","Content":"\n\u003Cp\u003EYes. It\u0027s made my rockets poorly designed and generally stupid. I\u0027m not testing landing gear in orbit. Sorry. Back to a science career for me. The contracts just haven\u0027t lived up to the Hype Train for me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-07-21T14:38:36Z","Content":"\n\u003Cp\u003EWell, i try to build more cost efficient and much more mission orientated. However i still only launch \u0022real\u0022 rockets, meaning no asparagus monster setups and no payload without a nice fairing. \u003C/p\u003E\u003Cp\u003EI use the NEAR aerodynamics mod with procedural fairings, besides scansat and rasterpropmonitors as the only mods.\u003C/p\u003E\n"},{"CreatedByName":"Crusher8000","CreatedById":25151,"CreatedDateTime":"2014-07-21T14:41:27Z","Content":"\n\u003Cp\u003EI turned off rewinding so my rockets preferably have to be perfect from the start. I lost Jeb, Bob and 2 other Kermans because of failed designs but right now I have send a rocket to Duna, \u0022landed\u0022 on it too, without a problem. Also because a failed design sometimes means a big chunk of my budget is gone I have to be really careful I stick to the budget. The trip to Duna was very fruitful as I orbited Duna AND Ike and also landed on Duna and transmitted science to KSC during all of that. It was all to complete contracts so I have around 600 000 kerbs now. However my rocket to Duna was over a 100 000 so I can\u0027t do it like in the past and send 7 or so rockets to one planet the moment a window is open. Hell, when I started the mission I barely had any money left, if the Duna mission failed it probably would\u0027ve been game over. I would\u0027ve had enough fuel to go back in orbit but the rocket fell over when it landed. \u003C/p\u003E\u003Cp\u003EI can\u0027t build crazy big rockets anymore because I\u0027m too afraid it will blow up and I would lose all my money. Saftey has become a bigger issue because of it. I mostly have an action button that decouples the pod and opens the parachutes.\u003C/p\u003E\u003Cp\u003EAlso I tend to avoid the testing contracts because meeting up all parameters is really hard sometimes and I don\u0027t feel like wasting a couple of rockets to test one part.\u003C/p\u003E\n"},{"CreatedByName":"KandoKris","CreatedById":103873,"CreatedDateTime":"2014-07-21T14:57:31Z","Content":"\n\u003Cp\u003EIt\u0027s made me Slow right down and think basic needs to achieve those standard goals I have in KSP not testing engines at certain stages etc but setting up bases/stations , exploring Laythe etc etc \u003C/p\u003E\u003Cp\u003EStill in my first KSP year still and loving the tight budjets and need to keep things cheep. I even managed to make a sub 25k SSTO \u003C/p\u003E\u003Cp\u003EAll in all I\u0027m enjoying the new look at design and thought process\u003C/p\u003E\n"},{"CreatedByName":"ScopusAurelius","CreatedById":111937,"CreatedDateTime":"2014-07-21T15:05:07Z","Content":"\n\u003Cp\u003EI am heinously cheap now. It is half the fun for me, being a tightwad barn boss.\u003C/p\u003E\n"},{"CreatedByName":"Jade Falcon","CreatedById":114719,"CreatedDateTime":"2014-07-21T15:15:11Z","Content":"\n\u003Cp\u003ETo begin with I was really cheap with my rockets. Plus I also had to design some absolute pieces of junk to do some of the test contracts and yeah it was amusing but I wouldn\u0027t want to fly any of them again. Once I got to about 1.5 million funds I\u0027ve gone back to my preferred designs, aspharagus staging etc. While I could make a cheaper design I can\u0027t say I want to because I like my rockets to look a certain way. As long as I turn a profit I\u0027m happy.\u003C/p\u003E\n"},{"CreatedByName":"boa3532","CreatedById":57325,"CreatedDateTime":"2014-07-21T15:16:23Z","Content":"\n\u003Cp\u003EIt hasnt changed mine too much. I was playing on an 2008 i3 laptop with a generic low end graphics card, so my ships were low in parts count anyway. Recently upgraded to a much nicer machine, but kept the practice. I focus the ships around two or three contracts, note the total payoff for successful contracts and strive to keep costs below half of that, which is easier than I expected. That way I\u0027m not obsessing with trying to recover every dang part like so many on this board is trying to do. Plus easy extra money to do non paying missions.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork_werewolf","CreatedById":90749,"CreatedDateTime":"2014-07-21T15:19:32Z","Content":"\n\u003Cp\u003EI\u0027ve ended up making every top part a kind of shuttle. Wings, control surfaces and at least one jet/turbo jet engine. If my reentry is off a bit the jet and wings let me fly it back to KSC and land for a full 100%. They are usually sent up on a cluster of boosters because they are the best trust to cost ratio. Also I only use one stack separator if I can 6 struts are still cheaper than one extra stack separator. I have tried SSTO\u0027s but without air hogging they tend to not be worth the trouble. My shuttles can get to the Mun land and back with all science and a Kerbal for only 20k this way. I got over 2 mil in the bank now and a space station with a full orange tank on it. I just added a RTG module to the station too for nighttime power.\u003C/p\u003E\u003Cp\u003EIt has also made learn aircraft better and I\u0027m using engine nacelle now.\u003C/p\u003E\u003Cp\u003EReally loving the update. Maybe after completing the tree I will try without using \u0022recover to launch\u0022 but I\u0027m not using quick saves at the mo anyway.\u003C/p\u003E\n"},{"CreatedByName":"TNM","CreatedById":87785,"CreatedDateTime":"2014-07-21T15:23:15Z","Content":"\n\u003Cp\u003EI was happy that my relative conservative building style would be finally rewarded in 0.24....then i noticed that money is not really an issue. Left hoping for more in the future.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-07-21T15:26:20Z","Content":"\n\u003Cp\u003EAside from the fairly stupid test-vehicles that are great for specific contracts, mostly I\u0027m exploring new territory in 0.24 as far as designs. I\u0027m building things with smaller lifter stages (less overkill), and consolidating most of the expensive equipment into the return-portion of the ship. I\u0027m sometimes building recoverable mid-stages now, rather than just making them de-orbit to deletion.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-07-21T15:26:20Z","Content":"\n\u003Cp\u003ENo real changes to speak of as far as stock is concerned, aside from using SRBs more often. I started using 2.5m parts as soon as they were available. Funding is pretty generous so I can generally build what I want, when I want. About the only thing I recover is pods, just like before. I find that if you start using the bigger parts earlier funding has more of an impact (still not much at all for an experienced player); my Duna expedition cost some 200K out of the 900K I had available and I\u0027m already building big for the Minmus trip.\u003C/p\u003E\n"},{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2014-07-21T15:29:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EBeyond LKO, my funds get tighter. It took around 1/10th of my entire budget to launch my Munar mission with all these accessories and SLS parts, which means I pretty much scrapped my manned Munar program after several landings, because literally, it \u0022cost way too much\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like NASA when they ended the Apollo program. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell, now I build asparagus staged rockets because I don\u0027t have the time or the money to make realistic rockets. The only mod I have is RemoteTech, so probes aren\u0027t overpowered, and for the comms networks. (And Engineer Redux, but that\u0027s just for the info readouts.)\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-07-21T15:44:05Z","Content":"\n\u003Cp\u003EMore it reinforced an trend, core stage with SRB to help, they are cheap, cheaper than fuel for an ssto.\u003C/p\u003E\u003Cp\u003EMun landers, put all the expensive stuff on the core you return\u003C/p\u003E\u003Cp\u003EWill start looking into planes again for light payload and kerbals\u003C/p\u003E\n"},{"CreatedByName":"Strangelove444","CreatedById":93919,"CreatedDateTime":"2014-07-21T15:51:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TNM\u0022 data-cite=\u0022TNM\u0022\u003E\u003Cdiv\u003EI was happy that my relative conservative building style would be finally rewarded in 0.24....then i noticed that money is not really an issue. Left hoping for more in the future.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a solution for this - don\u0027t do the testing contracts. I completely ignore testing random parts in random configurations and only work with the other types - combined with a healthy collection of (difficult) mods, it makes the game much more... interesting. If I do get close to running out, setting up a kethane base and importing it back to Kerbin (for example) is much more fun than triggering a booster between 21000 and 34000 meters.\u003C/p\u003E\n"},{"CreatedByName":"Random Account","CreatedById":74152,"CreatedDateTime":"2014-07-21T16:26:22Z","Content":"\n\u003Cp\u003EVirtually all of my launcher vehicles are made up of mostly SRBs now. I also used planes for atmospheric part testing, but I recently switched to putting a re-usable probe with the part to be tested on top of a SRB, since it\u0027s not as boring and can do most non-orbit part tests. My interstellar probes are much more efficient now, with improvements like replacing atomic motors with much lighter 48-7S engines.\u003C/p\u003E\n"},{"CreatedByName":"TNM","CreatedById":87785,"CreatedDateTime":"2014-07-21T16:35:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Strangelove444\u0022 data-cite=\u0022Strangelove444\u0022\u003E\u003Cdiv\u003EI have a solution for this - don\u0027t do the testing contracts. I completely ignore testing random parts in random configurations and only work with the other types - combined with a healthy collection of (difficult) mods, it makes the game much more... interesting. If I do get close to running out, setting up a kethane base and importing it back to Kerbin (for example) is much more fun than triggering a booster between 21000 and 34000 meters.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESound like a good idea als long as i\u0027m running stock. I\u0027m waiting for all mods (i use) to be updated and i suppose some clever guys will do great stuff with contracts, maybe even a \u0022revamp\u0022 of contracts itself. I\u0027m excited for that, but first i will test stock for a while to get a feel again for...Squads implementations (mods really change alot if you let them, its a good thing).\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-07-21T17:32:29Z","Content":"\n\u003Cp\u003EIt\u0027s a lot more practical now.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/suhOo8n.png\u0022 alt=\u0022suhOo8n.png\u0022\u003E\u003C/p\u003E\n"}]}