{"TopicId":78804,"ForumId":16,"TopicTitle":"Parts testing contracts - error?","CreatedByName":"DavidHunter","CreatedById":102608,"CreatedDateTime":"2014-07-21T13:22:31Z","PageNum":1,"Articles":[{"CreatedByName":"DavidHunter","CreatedById":102608,"CreatedDateTime":"2014-07-21T13:22:31Z","Content":"\n\u003Cp\u003ESo, had the \u0027test the LV-T45\u0027 contract.\u003C/p\u003E\u003Cp\u003EConditions were quite clear. I met them - as evidenced by the green ticks in below screenshot (see top-right corner).\u003C/p\u003E\u003Cp\u003EOnce you leave the 24,100-26,500m ASL range, it unticks that, as if you never achieved it. When you land and go through the post-flight reports, you get the normal parts recovery and science messages, but the bank balance doesn\u0027t go up.\u003C/p\u003E\u003Cp\u003ESo how the hell are you ever meant to actually achieve these goals?!\u003C/p\u003E\u003Cp\u003EI\u0027m thinking about taking that manufacturer to kourt. They\u0027ve sent my space program bankrupt. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/4446393/LVT45test.png\u0022 alt=\u0022LVT45test.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m also having the same issue with other parts that have similar requirements.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T09:51:00Z\u0022 title=\u002207/22/2014 09:51  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by DavidHunter\u003C/strong\u003E\n\u003Cbr\u003EFixed angry face emoticon; changed court to kourt to reflect it being on Kerbin; added sentence about post-flight reports; later changed from unanswered to answered.\n\u003C/span\u003E\n"},{"CreatedByName":"Zwer.ch","CreatedById":88958,"CreatedDateTime":"2014-07-21T13:39:03Z","Content":"\n\u003Cp\u003ESome test require to activate the part by staging, others require them to run the \u0022run test\u0022 action in the part\u0027s context menu.\u003C/p\u003E\u003Cp\u003ECheck for the contracts notes (the light blue plus sign) inflight, or in the mission control.\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-07-21T19:07:47Z","Content":"\n\u003Cp\u003EWhat you have to do is have the LV-T45 ready to be staged and when all the conditions are met, THEN hit that space bar. Think of the \u0022green tics\u0022 as prerequisites to the test. Yeah, this caused my career to go down the drain too, until I finally figured it out.\u003C/p\u003E\n"},{"CreatedByName":"DavidHunter","CreatedById":102608,"CreatedDateTime":"2014-07-22T00:09:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpacedCowboy\u0022 data-cite=\u0022SpacedCowboy\u0022\u003E\u003Cdiv\u003EWhat you have to do is have the LV-T45 ready to be staged and when all the conditions are met, THEN hit that space bar. Think of the \u0022green tics\u0022 as prerequisites to the test. Yeah, this caused my career to go down the drain too, until I finally figured it out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhhhh ok. Right, that makes sense now lol\u003C/p\u003E\u003Cp\u003EThanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CumpyLustard","CreatedById":92466,"CreatedDateTime":"2014-07-22T00:28:14Z","Content":"\n\u003Cp\u003EAlso, I\u0027m not positive, but you should be able to shut down the engine and restart it to complete the contract. If not that, you might be able to re-order the engine in your staging and then activate it again (I was trying earlier and I\u0027m not sure which option worked). Of course, this might be difficult to do as your velocity will probably quickly decrease, but you might be able to pull it off.\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-07-22T00:57:03Z","Content":"\n\u003Cp\u003EThe liquid engine contracts I\u0027ve seen have also been completable by right clicking the engine and selecting \u0022Run Test\u0022 when the conditions are met. You don\u0027t need to wait for the conditions for the button to show up, and it definitely doesn\u0027t show up for all contracts.\u003C/p\u003E\n"},{"CreatedByName":"DavidHunter","CreatedById":102608,"CreatedDateTime":"2014-07-22T09:49:48Z","Content":"\n\u003Cp\u003EThanks guys. I just saw the light blue \u002BNote in the contracts thing in the VAB, in which they note that the part must be activated through staging (not through an action group, for instance). I had missed that. Similarly, the \u0027run test\u0027 requirement that LaytheAerospace noted is also detailed in that blue note section in the VAB.\u003C/p\u003E\u003Cp\u003EThanks all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}