{"TopicId":78806,"ForumId":16,"TopicTitle":"Cant grab parts","CreatedByName":"Ghostexx7","CreatedById":112679,"CreatedDateTime":"2014-07-21T13:36:19Z","PageNum":1,"Articles":[{"CreatedByName":"Ghostexx7","CreatedById":112679,"CreatedDateTime":"2014-07-21T13:36:19Z","Content":"\n\u003Cp\u003EI have a problem, i cant get fuel stations, or asteroids, or debris, or something else that doesnt have a atmosphere (or something to orbit)\u003C/p\u003E\u003Cp\u003Ei dont know how to catch it....\u003C/p\u003E\u003Cp\u003Eand when Intersection 1 is close to Target Position 1, the Inter. 1 arrow goes crazy doing something like zigzaging, making everything harder\u003C/p\u003E\u003Cp\u003Ei really want a asteroid... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"StuntMax","CreatedById":109305,"CreatedDateTime":"2014-07-21T14:49:12Z","Content":"\n\u003Cp\u003EFind one of the countless rendez vous tutorials....\u003C/p\u003E\u003Cp\u003ELong story short: tinker with maneuver nodes until you get a decent intersection (separation 3 km or less), it doesn\u0027t matter if the markers flicker or jump around. \u003C/p\u003E\u003Cp\u003EAs soon as you get close to the kerbal/debris/asteroid, switch the navball to target mode (click on the speed box on the top of the navball), and burn retrograde to kill relative speed. \u003C/p\u003E\u003Cp\u003EThen turn towards your target and with a gentle burn drift towards it at some 7-8 m/s.... your goal is to push the green prograde marker straight over the target marker (purple) and keep it there while you get closer. \u003C/p\u003E\u003Cp\u003EOnce you learn how to move around the prograde marker, RVing becomes trivial. \u003C/p\u003E\u003Cp\u003EThrow a piece of debris in kerbin orbit to pratice before testing your skill with asteroids...\u003C/p\u003E\n"},{"CreatedByName":"Ghostexx7","CreatedById":112679,"CreatedDateTime":"2014-07-22T14:33:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StuntMax\u0022 data-cite=\u0022StuntMax\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThrow a piece of debris in kerbin orbit to pratice before testing your skill with asteroids...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehad to read that before\u003C/p\u003E\u003Cp\u003Er.i.p Sigster kerman got killed by asteroid crush\u003C/p\u003E\n"},{"CreatedByName":"Stephanie the Viking","CreatedById":100645,"CreatedDateTime":"2014-07-22T15:40:45Z","Content":"\n\u003Cp\u003EPart 1: Shift the orbit angle of the seeking craft and the orbit of the target object onto the same plane. Do this at an Ascending or Descending node. The orbits do not have to be aligned in any way before doing this because KSP makes all orbits occur around the dead centre of the planet / moon and so they will always cross over at some point by default.\u003C/p\u003E\u003Cp\u003EPart 2: Once the planes are aligned, reduce / increase the orbit of the seeking craft so that it touches the orbit of the other craft at some point.\u003C/p\u003E\u003Cp\u003EPart 3: Observe the intersect points, and increase or decrease the orbit of the seeking craft __at the point you created where the orbits touch__ so that on each successive orbit, the intersects get closer or further apart. Continue orbiting until both craft are due to hit the same intersect point at the same time. The ideal distance between the two craft you are looking for at that point will be 5km or less. Hovering over the intersect will tell you the separation. If you can manage less than 2km, so much the better.\u003C/p\u003E\u003Cp\u003EPart 4: Wait for the moment to occur where both ships are at the same place at the same time, but one craft will still be moving faster than the other. When both crafts actually meet at the intersect and are within a short distance of each other, change the orbit of the seeking craft until both orbits are identical, or as near as you can manage. This will ensure that even though one craft may still be a fraction faster or slower, higher or lower, they will no longer suddenly fly away from each other at high speed.\u003C/p\u003E\u003Cp\u003EPart 5: Click on the speed readout until it says \u0027target\u0027. This shows you the difference in speed between the two objects. If this value is greater than zero, it means you are moving together __or apart__ . Using very small thruster amounts, or RCS if you managed to get the ships quite close, move the seeking ship towards the target. Do not try and do this at speed or you will ruin the orbit and overshoot the target. Getting closer at 10m/s or 20m/s is more than sufficient. Remember that if you are moving towards the target, even slowly, this is a success.\u003C/p\u003E\u003Cp\u003EEnsure while doing this that you are always flying towards the pink circular target marker (green and pink markers are close), but face the ship in the opposite direction in advance so that you can quickly reduce speed where necessary. Thoughtful designers often place small backwards-facing engines on their larger craft so that they can slow down without turning all the way around, or alternatively just use RCS and strafe towards the target, either will do. Eventually both targets will be within a very short distance, moving in the same direction at the same speed. Congratulations, you\u0027ve made a successful rendez-vous.\u003C/p\u003E\u003Cp\u003EHint: Observe the centre of gravity (COG) when constructing ships, so that you place the RCS thrusters equidistant from that point. If one set of RCS thrusters is further away from the COG than the other, RCS strafe will not work properly because it will be unbalanced and the ship will turn instead of strafing. Making sure that the RCS is balanced for the lander, and then the lander \u002B final stage, and then the lander \u002B final stage \u002B previous stage etc. will ensure that the ship will always be balanced and move as instructed regardless of how many stages remain or how big or strangely-shaped it is.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T15:58:15Z\u0022 title=\u002207/22/2014 03:58  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by Stephanie the Viking\u003C/strong\u003E\n\u003C/span\u003E\n"}]}