{"TopicId":78947,"ForumId":55,"TopicTitle":"Ideas for expanding procedural contracts","CreatedByName":"Kerano","CreatedById":107460,"CreatedDateTime":"2014-07-22T05:02:07Z","PageNum":1,"Articles":[{"CreatedByName":"Kerano","CreatedById":107460,"CreatedDateTime":"2014-07-22T05:02:07Z","Content":"\n\u003Cp\u003EI originally made this post a couple of weeks before the release of 0.24, but it was hidden away inside another thread so I figured I\u0027d start a separate thread for it here. The difference in format compared to the actual contracts is due to the fact that this was written before I\u0027d seen the update.\u003C/p\u003E\u003Cp\u003EWithout further ado, here are my suggestions for expanding procedural contracts (particularly in the endgame):\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1.\u003C/strong\u003E \u0022Bigwig Kerman, the head of [contractor], urgently needs to get from [location] to [location] on Kerbin, but his regular pilot has fallen ill with kerpendicitis. Fly out to pick him up, and take him to his required destination.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2.\u003C/strong\u003E \u0022The [spacecraft] orbiting [planet/moon] has suffered a technical fault which has rendered it unable to [generate electrical power/ignite its boosters]. Fixing the fault will require a replacement part to be transported from Kerbin. Send a crew to dock with the station and install the replacement part.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3.\u003C/strong\u003E \u0022The CEO of [contractor] wishes to inspect the [spacecraft] facility on [planet/moon]. Pick him up from [location] and transport him safely to the facility.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E4.\u003C/strong\u003E \u0022Recent probing has uncovered a valuable source of [unobtainium] on [planet/moon] near [location]. Establish a manned base of operations in this area, including at minimum the following [parts].\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E5.\u003C/strong\u003E \u0022Two of the retiring executives at [contractor] wish to start a rally championship on [planet/moon] near [location]. Design two different man-powered rovers and land them safely together at the location.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E6.\u003C/strong\u003E \u0022Sensors have detected seismic activity on [planet/moon] near [location]. Send a crew to investigate and return samples.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E7.\u003C/strong\u003E \u0022The manager of [contractor] requires [number] tonnes of fuel to be added to the [spacecraft] orbiting [planet/moon] for nefarious purposes. Transport and dock the specified amount of extra fuel to the space station.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E8.\u003C/strong\u003E \u0022The [spacecraft] probe orbiting [planet/moon] has malfunctioned and requires a manual reset. Send a Kerbal to rendezvous with the probe and EVA to fix the problem by making contact with [part].\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E9.\u003C/strong\u003E \u0022The megalomaniacal director of [contractor] requires a tower [number] meters high to be built near [location] on [planet/moon]. Design and land an appropriate tower at the given location. The central pod must be at least [number] meters above ground level when the tower comes to rest.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E10.\u003C/strong\u003E \u0022A shipment of supplies needs to be transported from the [spacecraft 1] on [planet/moon 1] to the [spacecraft 2] on [planet/moon 2]. [Contractor] requires your services to oversee the operation.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E11.\u003C/strong\u003E \u0022The president of [contractor] is on holiday and wishes to take an aerial tour of Laythe. Pick her up from the [spacecraft] orbiting Laythe, descend into Laythe\u0027s atmosphere, land, and return to the [spacecraft] in orbit to complete this mission.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E12.\u003C/strong\u003E \u0022An experiment on the [spacecraft] orbiting [planet/moon] has gone horribly wrong, generating extremely hazardous waste. [Contractor] is convinced that the only way to save Kerbalkind from impending doom is to eject the barely contained waste into the sun. Design a craft with a detachable [container] capable of docking with the [spacecraft] to collect the waste, then undock and achieve an orbit intersecting Kerbol. Choose to eject the [container] on this collision course, or allow the entire craft to be incinerated by the star.\u0022 \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E13.\u003C/strong\u003E \u0022Dubya Kerman, the president of [contractor], wishes to set a new record for the longest golfing drive. Pick him up from [location], transport him to the surface of Minmus to take his shot, and return him to Kerbin.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E14.\u003C/strong\u003E \u0022The head honcho at [contractor] is planning a spectacular fireworks display as an engagement surprise for her partner. Design a craft capable of staging at least [number] impressive aerial explosions while the central pod remains intact. Trigger the explosive stages in the air above [location], and land the central pod safely.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E15.\u003C/strong\u003E \u0022The bosses at [contractor] have decided to reward their employees with a company outing to [planet/moon]. Design a craft capable of transporting [number] Kerbals to the destination, and returning them safely to Kerbin.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E16.\u003C/strong\u003E \u0022Important figureheads from [contractors] have arranged to hold a secret meeting on the dark side of the Mun. Pick them up from [locations] and transport them to their destination.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E17.\u003C/strong\u003E \u0022The chief officer at [contractor], an avid golfer with notoriously bad aim, wants for once in his life to score the ultimate hole in one. Pick him up from [location] and take him to the north pole of Moho.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E18.\u003C/strong\u003E \u0022A daredevil manager at [contractor] is determined to ride an asteroid down through Kerbin\u0027s atmosphere for his next stunt. Design a craft to take the thrill seeker to an asteroid, nudge it into a path intersecting Kerbin, and ride the asteroid down to an altitude of [number] km. Detach the craft from the asteroid below this altitude, and land safely.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E19.\u003C/strong\u003E \u0022An executive at [contractor] wants to take her family on a skiing holiday. Design a craft which can take [number] Kerbals to a snowy peak above an altitude of [number] km on Kerbin, and land them safely on the mountain.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E20.\u003C/strong\u003E \u0022Someone has eaten all the snacks aboard the [spacecraft] orbiting [planet/moon], making the resident Kerbonauts grumpy. Send a craft from Kerbin to dock with the station and resupply it with delicious treats.\u0022\u003C/p\u003E\u003Cp\u003EFeel free to add to the list. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENote 1:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E[spacecraft] = replaced by the name of one of your active ships\u003C/p\u003E\u003Cp\u003E[location] = coordinate, biome, or flag/checkpoint (see note 2)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENote 2:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EInstead of giving coordinates/biomes for these missions, rebranded flags - perhaps labelled \u0022checkpoints\u0022 - might work well as mission location indicators.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENote 3:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ENo spacecraft would need to be added to the game, it\u0027d just use the ones you had in place already.\u003C/span\u003E \u003Cspan style=\u0022color:#333333;\u0022\u003EI\u0027m assuming that in the endgame you\u0027ll probably have at least one spacecraft in orbit around most planets/moons, and one landed spacecraft on most as well. Thus \u003C/span\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Ethese missions would trigger using your existing spacecraft - only in the locations where the conditions were met. If you didn\u0027t have any spacecraft in locations which met the preconditions for a particular contract, you wouldn\u0027t be assigned that contract.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T05:07:43Z\u0022 title=\u002207/22/2014 05:07  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by Kerano\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-07-22T21:40:00Z","Content":"\n\u003Cp\u003EA lot of these are pretty interesting, and pleasantly more complex than the contracts are now, and would be a good addition to the final game. Hopefully, modders will get a handle on modding contracts quickly and we\u0027ll see some of these in the game sooner rather than later.\u003C/p\u003E\u003Cp\u003EI would especially like to see asteroid contracts that require you to move asteroids of a certain size into orbits with given AP/PE/Inclination parameters.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llanthas\u0022 data-cite=\u0022llanthas\u0022\u003E\u003Cdiv\u003Eyes. a \u0022bigger picture\u0022 chain of contracts would introduce plot into the game. I think this is a great idea. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the \u0022Explore [Celestial Body]\u0022 missions do a good job of this already. Though it could be expanded substantially if they added mechanics that made bases matter, like [sUGGESTED FEATURE REDACTED], [sUGGESTED FEATURE REDACTED], and [sUGGESTED FEATURE REDACTED].\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T22:26:18Z\u0022 title=\u002207/22/2014 10:26  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by vexx32\u003C/strong\u003E\n\u003C/span\u003E\n"}]}