{"TopicId":78993,"ForumId":29,"TopicTitle":"Changing the EVA Kerbal model","CreatedByName":"superscout","CreatedById":9027,"CreatedDateTime":"2014-07-22T14:34:49Z","PageNum":1,"Articles":[{"CreatedByName":"superscout","CreatedById":9027,"CreatedDateTime":"2014-07-22T14:34:49Z","Content":"\n\u003Cp\u003EI\u0027ve been messing around with lightly modifying KSP for awhile without any goal or purpose. After starting to use unity myself and learning blender, I thought that changing the model used for EVA Kerbals would be a simple but very interesting modification to make to KSP.\u003C/p\u003E\u003Cp\u003ESo does anyone know where one would make that change? I\u0027ve seen people change the textures of the suits and faces, but haven\u0027t seen anyone change the actual model. I imagine it must not be too difficult, mostly just creating a new unity rag doll object, and then telling KSP/Unity to look at the new object instead of the standard one.\u003C/p\u003E\u003Cp\u003EIf anyone could share any information regarding getting KSP/Unity to look in a different location for the EVA Kerbal model, that would be extremely appreciated!\u003C/p\u003E\n"},{"CreatedByName":"Scarsz","CreatedById":113000,"CreatedDateTime":"2014-08-21T19:14:53Z","Content":"\n\u003Cp\u003EI have seen some threads talking about the same thing as you and most of the replys are people saying it is either \u0027impossible\u0027 or \u0027too hard\u0027. However they also said that about multiplayer and n-body but they are both now mods. The only plugin I could find that forces KSP to load a different asset is this: \u003Ca href=\u0022https://bitbucket.org/xEvilReeperx/ksp_navballtexturechanger/src/dc236d49c3a91a0002cb1ba3af381a78012a1da4/NavBallTextureExport/NBTexExport.cs?at=master\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://bitbucket.org/xEvilReeperx/ksp_navballtexturechanger/src/dc236d49c3a91a0002cb1ba3af381a78012a1da4/NavBallTextureExport/NBTexExport.cs?at=master\u003C/a\u003E though I am not sure how helpful this will be, seeing as it is a texture.\u003C/p\u003E\u003Cp\u003EI wish I could help but I am not a plugin maker. I can, however bit of help regarding the model itself. The kerbal model most likely is embedded somewhere in the .asset files. To replace it without redoing the animations you\u0027ll need to find out exactly how it is rigged. The only way I can think of doing this is digging the model out of the .asset files. Alternatively you could use a brand new rig and redo all the animations but that could quite a lot of work. If you want any help modeling or texturing just PM me. Good luck!\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-08-21T21:08:26Z","Content":"\n\u003Cp\u003ETexture Replacer already replaces the textures of various parts of the kerbal set-of-meshes. With that you can get the names of most meshes involved.\u003C/p\u003E\u003Cp\u003ESince I need humans, not kerbals, for various projects I\u0027m quite invested in this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Po0ka","CreatedById":100192,"CreatedDateTime":"2014-08-22T19:38:37Z","Content":"\n\u003Cp\u003ENo need to modify the base model on load, you could just swap the model to a human in runtime, would just need the same animation names and job\u0027s done i would guess xD\u003C/p\u003E\n"},{"CreatedByName":"Scarsz","CreatedById":113000,"CreatedDateTime":"2014-08-28T14:34:22Z","Content":"\n\u003Cp\u003ELooks like superscout isn\u0027t going to be making this mod up any time soon. Any programmers want to pick this up?\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-01T12:25:04Z","Content":"\n\u003Cp\u003EI\u0027m actually doing something like this at the moment, and I may have found a way to change the models at runtime.\u003C/p\u003E\u003Cp\u003EFor now it\u0027s very basic, and I don\u0027t think this could be used to load a human model yet.\u003C/p\u003E\u003Cp\u003EStill, one can mess around with the SkinnedMeshRenderer of a GameObject, and change the SharedMesh and SharedMaterial.\u003C/p\u003E\u003Cp\u003EI\u0027m actually having a lot of problems with those:\u003C/p\u003E\u003Cp\u003EThe thing is, I don\u0027t know how to access a model from an asset, so, when I want to use a particular in-game model, I have to load the scene where the model come from (for instance the VAB), make a copy of what I need, then use this copy elsewhere.\u003C/p\u003E\u003Cp\u003EI can\u0027t just use props (drillers, screwdrivers, etc...) without this shenanigan.\u003C/p\u003E\u003Cp\u003EAnd, when I try to load a model from a file (a .dae or a .mu), I get a GameObject containing only MeshRenderers.\u003C/p\u003E\u003Cp\u003EThose meshes can\u0027t be used to change a SharedMesh property, so I wonder if anyone knows how to load (or how to model a correct mesh) for this purpose.\u003C/p\u003E\u003Cp\u003EEdit: (kind of proof of concept, click it to view the others) \u003Ca href=\u0022http://imgur.com/a/6aRiL#0\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/DAQp5b7.jpg\u0022 alt=\u0022DAQp5b7.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-01T14:30:53Z\u0022 title=\u002209/01/2014 02:30  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 1, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scarsz","CreatedById":113000,"CreatedDateTime":"2014-09-01T17:11:54Z","Content":"\n\u003Cp\u003EWow, nice! This shows that it is possible. Do you think put up a dl? I think I have a cheaty way to bypass the animations.\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-02T14:27:13Z","Content":"\n\u003Cp\u003EEventually, what I\u0027m working on will become a mod, but it will take some time.\u003C/p\u003E\u003Cp\u003EI can still share some snippets, since I need help from people who actually know how animated meshes works in Unity.\u003C/p\u003E\u003Cp\u003EHere is a basic (and naive) example that modify the Kerbal from the main menu.\u003C/p\u003E\u003Cp\u003EThe source code from Toolbar (and his easter egg) has been very useful, and the main difference is this time I actually changed some meshes in the scene.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eusing System;\u003Cbr\u003Eusing System.Collections.Generic;\u003Cbr\u003Eusing System.Linq;\u003Cbr\u003Eusing System.Text;\u003Cbr\u003Eusing UnityEngine;\u003Cbr\u003E\u003Cbr\u003E//For this example, we will modify the Main Menu Kerbal, but this is possible in any other scene in the game.\u003Cbr\u003E\u003Cbr\u003Enamespace KSPMMModifyDemo\u003Cbr\u003E{\u003Cbr\u003E    //This will be loaded at the main menu\u003Cbr\u003E    [KSPAddon(KSPAddon.Startup.MainMenu,true)]\u003Cbr\u003E    public class MessWithMMKerb : MonoBehaviour\u003Cbr\u003E    {\u003Cbr\u003E        //The kerbal from the Main Menu\u003Cbr\u003E        GameObject MMKerb = null;\u003Cbr\u003E\u003Cbr\u003E        //Will be called at start\u003Cbr\u003E        public void Awake()\u003Cbr\u003E        {\u003Cbr\u003E            MMKerb = getGOByName(\u0022kbEVA@idle\u0022);\u003Cbr\u003E            MessWithKerb(MMKerb);\u003Cbr\u003E        }\u003Cbr\u003E\u003Cbr\u003E        //return a GameObject from the scene by his name\u003Cbr\u003E        private GameObject getGOByName(string sName)\u003Cbr\u003E        {\u003Cbr\u003E            //A naive (but working) way is to go trough all our loaded GameObjects, and find the one we want\u003Cbr\u003E            foreach (GameObject go in Resources.FindObjectsOfTypeAll(typeof(GameObject)))\u003Cbr\u003E            {\u003Cbr\u003E                if (go.name == sName)\u003Cbr\u003E                {\u003Cbr\u003E                    return go;\u003Cbr\u003E                }\u003Cbr\u003E            }\u003Cbr\u003E            return null;\u003Cbr\u003E        }\u003Cbr\u003E\u003Cbr\u003E        //actually modify the skinnedMeshRenderers\u003Cbr\u003E        private void MessWithKerb(GameObject kb)\u003Cbr\u003E        {\u003Cbr\u003E            //this will be a very simple example, let\u0027s just replace the Kerbal\u0027s helmet mesh by the one from the visor\u003Cbr\u003E            SkinnedMeshRenderer smrHelmet = null;\u003Cbr\u003E            SkinnedMeshRenderer smrVisor = null;\u003Cbr\u003E\u003Cbr\u003E            foreach (SkinnedMeshRenderer smr in kb.GetComponentsInChildren(typeof(SkinnedMeshRenderer)))\u003Cbr\u003E            {\u003Cbr\u003E                if (smr.name == \u0022helmet\u0022)\u003Cbr\u003E                {\u003Cbr\u003E                    smrHelmet = smr;\u003Cbr\u003E                }\u003Cbr\u003E                if (smr.name == \u0022visor\u0022)\u003Cbr\u003E                {\u003Cbr\u003E                    smrVisor = smr; \u003Cbr\u003E                }\u003Cbr\u003E            }\u003Cbr\u003E            if ((smrHelmet != null) \u0026amp;\u0026amp; (smrVisor != null))\u003Cbr\u003E            {\u003Cbr\u003E                smrHelmet.sharedMesh = smrVisor.sharedMesh;//Replace the mesh\u003Cbr\u003E                smrHelmet.sharedMaterial = smrVisor.sharedMaterial;//Replace the material\u003Cbr\u003E                smrVisor.enabled = false;//disable the visor\u003Cbr\u003E            }\u003Cbr\u003E        }\u003Cbr\u003E    }\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThat will show something like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fgeF0NV.jpg\u0022 alt=\u0022fgeF0NV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStill, I can\u0027t find some animated models to test this in-game. This is so frustrating: Anyone knows of a tutorial for a beginner in modelling that would allow me to create a basic animated stick figure?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/N005yFn.jpg\u0022 rel=\u0022external nofollow\u0022\u003EAlso, I found how to spawn objects from assets now.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scarsz","CreatedById":113000,"CreatedDateTime":"2014-09-02T16:06:23Z","Content":"\n\u003Cp\u003EAwesome yet again! If you use blender there are lots of rigged models on blendswap. In fact I found this: \u003Ca href=\u0022http://www.blendswap.com/blends/view/73994\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.blendswap.com/blends/view/73994\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELooks pretty good for testing.\u003C/p\u003E\u003Cp\u003EAlso a quick animation tutorial.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://cgi.tutsplus.com/tutorials/create-an-animation-walk-cycle-in-blender-using-rigify--cg-17812\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://cgi.tutsplus.com/tutorials/create-an-animation-walk-cycle-in-blender-using-rigify--cg-17812\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-02T20:00:14Z","Content":"\n\u003Cp\u003EThanks, I will make some tests with the astronaut, and I also found a Minion from Despicable Me, that could be fun.\u003C/p\u003E\u003Cp\u003EI also found \u003Ca href=\u0022http://docs.unity3d.com/ScriptReference/Mesh-bindposes.html\u0022 rel=\u0022external nofollow\u0022\u003Ethis page\u003C/a\u003E, wich let me think it\u0027s possible to copy an armature and keyframes from an existing animation, or at least create new ones in-game for a static mesh.\u003C/p\u003E\u003Cp\u003EWell, that\u0027s enough things to test tonight (who need sleep anyway?). The sad part is, changing the EVA models is only one of the things I want my mod to do, and it\u0027s been days since I made actual progress on the remaining code...\u003C/p\u003E\u003Cp\u003ECoding is one hell of a drug...\u003C/p\u003E\u003Cp\u003EEdit: Okay, It\u0027s driving me crazy. I tried everything I thought of starting with a static mesh, with no success. Whatever I try, all I get is \u0022\u003Cem\u003ESkinnedMeshRenderer requires a mesh with skinning or blendshape information.\u003C/em\u003E\u0022 all over my log file.\u003C/p\u003E\u003Cp\u003EI have a lot of things to learn about animation (I\u0027m starting from scratch), obviously.\u003C/p\u003E\u003Cp\u003EI will continue my mod and get back to it later. For info, I want to make a small mod to spawn NPCs around the KSC. I can already spawn a bunch of Kerbals and make them move, but it will be nice to actually change their models, and not only their textures.\u003C/p\u003E\u003Cp\u003ENext thing I have to try is to load an already animated model. That means I have to create one...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-03T00:08:53Z\u0022 title=\u002209/03/2014 12:08  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 3, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-03T11:51:02Z","Content":"\n\u003Cp\u003EI don\u0027t like to \u0022up\u0022 my posts, but this thread only had 10 views since I edited my last one.\u003C/p\u003E\u003Cp\u003EAlso, I thought I\u0027d found a way to load objects from assets. I was wrong: I can clone objects from the main scene and the main menu at almost anytime, but I can\u0027t access objects from VAB/SPH. They are loaded from a different asset, and are destroyed once the game is loaded.\u003C/p\u003E\u003Cp\u003EAs I said earlier, I can make a clone of these objects once an editor is open, and use those clones later in-game. But didn\u0027t found anything to instantiate them otherwise.\u003C/p\u003E\u003Cp\u003EThere are lots of props that could be useful here: pencils, drillers, hammer, wrench, etc... Also some Kerbals employees (that\u0027s the thing I really want to mess with).\u003C/p\u003E\n"},{"CreatedByName":"Scarsz","CreatedById":113000,"CreatedDateTime":"2014-09-12T20:32:54Z","Content":"\n\u003Cp\u003EIf I was you I would make a add-on development thread. More people view them than plugin development threads so I expect more people will be able to help you. Hope that coding is going well.\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-14T13:10:37Z","Content":"\n\u003Cp\u003EI don\u0027t really want to start a thread in the plugin section yet, since I have no working code to share: I still didn\u0027t managed to create a skinnedMeshRenderer, or to import one.\u003C/p\u003E\u003Cp\u003EBut I really want to make my plugin, even if it will be completely useless. So I guess I will create a thread in the plugin development section just to ask for help...\u003C/p\u003E\u003Cp\u003ELately I was only trying to spawn new Kerbals. So my actual plugin can clone some, then it summons the Kraken as soon as the scene change a bit.\u003C/p\u003E\u003Cp\u003ENot exactly the plugin I want to release...\u003C/p\u003E\u003Cp\u003ESaddest part being that those two points (spawning Kerbals and changing their meshes) will be a very small part of my plugin, the biggest parts will probably be the spawning logic, the pathfinding and the AI.\u003C/p\u003E\u003Cp\u003EStill, maybe with the help of someone who knows how to import a skinned mesh, the most interesting part can be done. I need to make some new snippets of code, some screenshots, and I will make this thread.\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-15T13:55:52Z","Content":"\n\u003Cp\u003ESorry, double post again, but with some news., I finally found a way to import SkinnedMeshRenderers and Bones.\u003C/p\u003E\u003Cp\u003EThe process was actually the same as before, with the internal meshes, but I needed some correct models to load.\u003C/p\u003E\u003Cp\u003EI found a trick, since I still don\u0027t know how to model : convert a Half-Life mdl file to fbx, then convert this fbx to MU using PartTools.\u003C/p\u003E\u003Cp\u003EThere is a known problem with Unity and the way it load materials from fbx, so they have to be reset manually, like in TextureReplacer, or fixed during the conversion.\u003C/p\u003E\u003Cp\u003EThe problem I have now is the animation, not working. I also have to learn how to convert an animated part properly.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/t1X5D#0\u0022 rel=\u0022external nofollow\u0022\u003ESome screenshots.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit: a small snippet of code:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EGameObject goModel = GameDatabase.Instance.GetModel(\u0022GSL/TestHumanoid\u0022);//My file is named \u0022TestHumanoid.mu\u0022\u003Cbr\u003EgoModel.transform.position = MMKerb.transform.position \u002B new Vector3(-0.5f, 1, 0);//Spawn the model close to the Main menu Kerbal\u003Cbr\u003EgoModel.transform.rotation = MMKerb.transform.rotation;\u003Cbr\u003EgoModel.SetActive(true);\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOnce the model is loaded, it contains a SkinnedMeshRenderer, some bones, and an Animation module if possible.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-15T14:32:49Z\u0022 title=\u002209/15/2014 02:32  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 15, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-09-15T15:30:07Z","Content":"\n\u003Cp\u003Eawesome progress..\u003C/p\u003E\u003Cp\u003EI\u0027m eager to reproduce this as an alien sickness for kerbals in NCI - suddenly he grows tentacles..\u003C/p\u003E\u003Cp\u003Elol\u003C/p\u003E\u003Cp\u003EYou seem to have experimented a lot with the EVA animations..\u003C/p\u003E\u003Cp\u003EDid you by any chance stumble over a way to trigger the walk animation while in space?\u003C/p\u003E\u003Cp\u003EI\u0027ve made working magboots but the animation needs to be called by script somehow..\u003C/p\u003E\u003Cp\u003Esorry for offtopic - but maybe you found that out in the experimenting process..\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-15T16:28:56Z","Content":"\n\u003Cp\u003EI didn\u0027t tried to set the animation without scripts yet. But maybe you can try to force the EVA\u0027s vessel to consider itself landed:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Evessel.situation = Vessel.Situations.LANDED;\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBy the way, since we\u0027re off-topic, how did you managed to spawn vessels with your plugin? Kerbals in EVA are single-part vessels, so I could use something like this. For now everytime I spawn Kerbals, it summon the Kraken.\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-09-15T16:47:51Z","Content":"\n\u003Cp\u003EI\u0027ll try the landed - but I\u0027m pretty sure, this will also summon the kraken..\u003C/p\u003E\u003Cp\u003EI did that with LCARS vessels and it\u0027s unstable to have something landed while it\u0027s not..\u003C/p\u003E\u003Cp\u003Espawn:\u003C/p\u003E\u003Cp\u003EI learned how to do it from some code from KAS..\u003C/p\u003E\u003Cp\u003Eit seems, the parts on the back of kerbals are also one part vessels - after some experimenting, I had it working..\u003C/p\u003E\u003Cp\u003EKerbals - in LCARS, I have a transporter system - to spawn EVAKerbal out of a vessel is simple..\u003C/p\u003E\u003Cp\u003Enever tried to spawn out of thin air though..\u003C/p\u003E\u003Cp\u003EElaborate, where from and with what functions did you try to sapwn?\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-15T17:14:03Z","Content":"\n\u003Cp\u003ELong story short: I tried creating vessels from thin air, create some from Protovessels, loading some from confignodes... The only working thing was to clone a kerbal already in EVA.\u003C/p\u003E\u003Cp\u003EI didn\u0027t tought of spawning kerbals from a vessel... I guess I could make a Spawn Point using an invisible pod, with no collider, then spawn Kerbals from there...\u003C/p\u003E\u003Cp\u003EFor your magboots, if you can\u0027t change the status to landed, maybe there\u0027s a way to consider the ship as the reference body? I don\u0027t know if it\u0027s possible to create a celestialBody from a vessel...\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-09-16T02:37:43Z","Content":"\n\u003Cp\u003EI see, my spawn code uses valid \u0022Parts\u0022 and requires a part cfg - since we don\u0027t have that for KerbalEVA, it could become a problem in the details once more..\u003C/p\u003E\u003Cp\u003EI\u0027d like to give you advise on what to try further with your project - but, honestly, I have no clue where you plan to go. - why do you want to spawn kerbals, how many, where?\u003C/p\u003E\u003Cp\u003EI can\u0027t seem to find the post now, but didn\u0027t I read something about planning an AI ? - similiar plans at NCI for an AI for shooting satelites and hostile ships that come after you.. \u003C/p\u003E\u003Cp\u003Ebut what your plans are, no clue - so if you care to elaborate in more detail, I\u0027ll do my best to make valid suggestions as far as my knowledge goes..\u003C/p\u003E\u003Cp\u003EIf you prefere to keep a low profile for now, I (or most likely no one else) will be able to suggest anything more.. at least for the best way to spawn..\u003C/p\u003E\u003Cp\u003Eit depends on the planned use.. :-)\u003C/p\u003E\u003Cp\u003EMagboots: lol, I guess not..\u003C/p\u003E\u003Cp\u003Ethat wouldn\u0027t be practical anyways, since I need force perpendicular to the ground you are standing on and not centered to the CoM of the \u0022Celestial-Ship-Body\u0022\u003C/p\u003E\u003Cp\u003EHowever - that part works anyways.. it\u0027s just while I move them around, the Kerbals hang there in space coma - I\u0027d like to call the walk animation while I push the button..\u003C/p\u003E\u003Cp\u003Eit\u0027s no big deal though, just a quite tricky, totally undocumented and extremly well hidden thing - in other words - default KSP API work.. :-D\u003C/p\u003E\u003Cp\u003Ebut enough of the magboots - back on topic..\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-16T13:18:36Z","Content":"\n\u003Cp\u003EThe plan for my plugin is to spawn some NPCs around the KSC; tourists, crew, technicians, scientists, and eventually make this compatible with KerbTown. Since I already know how to change the skin of a Kerbal in EVA, and control it, I thought the easiest way to do so was to spawn some around...\u003C/p\u003E\u003Cp\u003EAs for the AI, it will be more like a Finite State Machine, I don\u0027t plan it to be too complex: Tourists will watch your ship take off (the distance will vary depending on their courage), and technicians will recover debris in their range. Scientists may eventually provide sciences points from watching the launch (not sure about this one: gaining science is easy enough) and crew will be Kerbals from the CrewRoster, ready to get aboard a ship.\u003C/p\u003E\u003Cp\u003EFor the number of spawned Kerbs, it will depend on the framerate (Kerbals are Polygons-heavy). Ideally, there will be between 50 and 100 Kerbals around the center.\u003C/p\u003E\u003Cp\u003EChanging the models for a low-poly one could have been nice in this case...\u003C/p\u003E\u003Cp\u003ESo, yeah, this will be a useless plugin, only meant to get some life around the KSC (in fact \u0022Get Some Life\u0022 should be the name).\u003C/p\u003E\u003Cp\u003EFor your animation problem, i don\u0027t really get it, I thought you had it working when setting the animation manually?\u003C/p\u003E\u003Cp\u003ESomething like this:\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E_eva.animation.CrossFade(\u0022wkC_forward\u0022); //_eva is a KerbalEVA\u003C/pre\u003E\u003Cp\u003E should do the trick, the problem being you\u0027ll have to check every update if the animation changed.\u003C/p\u003E\u003Cp\u003ETo get back to the original subject: no progress made. I tried several way to convert mdl files, but I can\u0027t get the Animation module to load in Unity, so my newly imported meshes won\u0027t move a bit...\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-09-16T14:30:10Z","Content":"\n\u003Cp\u003Eomg - that sounds horrifyingly aweseom..\u003C/p\u003E\u003Cp\u003EAn other mod I won\u0027t be able to install because of framerate.. - I mean, one of those I would love to install hahah\u003C/p\u003E\u003Cp\u003Emy PC has a crappy graphix card u no.. lol\u003C/p\u003E\u003Cp\u003EWell, to your problem - I\u0027d try it that way - since you can change crew capacity on the fly, I say a setting will spawn an invisible vessel (inside a building mesh or so) with exactly the amount of kerbals in it as the setting calls for.\u003C/p\u003E\u003Cp\u003EThen you use something like my transporter code to position them on scene start at the calculated locations you intend to provide..\u003C/p\u003E\u003Cp\u003EAfter that, the vessel will just sit there and be \u0022hidden\u0022\u003C/p\u003E\u003Cp\u003EThe hard part will be the locations - the spawning is copy paste from my code..\u003C/p\u003E\u003Cp\u003E(just a dirty outdated version - but the transport is stable)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/philotical/StarTrekImpulseDrive/blob/master/Beta6/LCARS_TransporterSystem.01.cs#L791-L811\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/philotical/StarTrekImpulseDrive/blob/master/Beta6/LCARS_TransporterSystem.01.cs#L791-L811\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethat\u0027s it - it\u0027s even more than you need, it ads stuff to the kerbalEVA.\u003C/p\u003E\u003Cp\u003EHTH\u003C/p\u003E\u003Cp\u003Ethe spawnEVA-function has one downside - it switches vessel to that kerbal - I guess you need to find a way to stop that if you want to loop through 200 of them..\u003C/p\u003E\u003Cp\u003EOr better - try to do it while in space center - then the vessel change does probbably not happen \u003C/p\u003E\u003Cp\u003EBut let me ask an other stupid question..\u003C/p\u003E\u003Cp\u003EThere is a class named \u0022GroundCrew\u0022 or so - I assume those kerbals are less load intensive - wouldn\u0027t it be a good idea to hoock in there?\u003C/p\u003E\u003Cp\u003EAbout magboots - I got the code that holds the kerbal in place, rotated to the ship wall he\u0027s standing on and he can move around by appling forces to invisible game objects..\u003C/p\u003E\u003Cp\u003Ethen I went on to other projects for now - next on my to-do list is the animations - all I have so far is a list of clip names but I have no clue how to use them..\u003C/p\u003E\u003Cp\u003Eyour snippet might allready help a lot, thank\u0027s - I will consult it when I get back to the boots in a few days..\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-16T15:36:18Z","Content":"\n\u003Cp\u003EThanks. I think I better not spawn too much EVAs, it might be a problem...\u003C/p\u003E\u003Cp\u003EI\u0027m trying to get at least models from the ground crew, but I don\u0027t think they\u0027ll handle physics if I just instantiate some(edit: plus, I don\u0027t know how to instantiate them outside the VAB/SPH scenes). Ground crew could be fun, but it will be funnier if you can mess with him.\u003C/p\u003E\u003Cp\u003EI finally found how to import animations. I think I will go this way:\u003C/p\u003E\u003Cp\u003E-The ground crew will be made from custom objects, so it will not mess with any of my savegame informations and be destroyed every time a scene change. I\u0027ll have to find a way to make those objects as light as possible.\u003C/p\u003E\u003Cp\u003E-the selectable kerbonauts will be spawned from an invisible vessel near a door of the Crew Facility. If the CrewRoster is empty, no Kerbal is spawned. I\u0027ll have to add a custom behaviour to those EVAs.\u003C/p\u003E\u003Cp\u003EYou should take a look at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/93653-0-24-2-EVA-Follower-v1-01-13-Sept-2014?highlight=eva\u002Bfollower\u0022 rel=\u0022external nofollow\u0022\u003EEVAFollowers\u003C/a\u003E sources for the animations.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-16T15:42:18Z\u0022 title=\u002209/16/2014 03:42  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 16, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Joshwoo70","CreatedById":111345,"CreatedDateTime":"2014-09-17T06:54:32Z","Content":"\n\u003Cp\u003EI also do not like to up it. But will this become a mod? Anybody want to take up a challange?\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-09-18T18:32:25Z","Content":"\n\u003Cp\u003EWell, now I\u0027ve managed to load animated objects, I can\u0027t figure the best way to switch the model at runtime:\u003C/p\u003E\u003Cp\u003E-instantiate the model, make the Kerbal\u0027s model invisible, then change the position and the status of the imported model every update (probably the dirtiest but easiest solution)\u003C/p\u003E\u003Cp\u003E-create a new part from the imported model, then add the \u0022kerbalEVA\u0022 module to it (didnt\u0027 tried that yet).\u003C/p\u003E\u003Cp\u003E-keep as much informations as possible from the original kerbalEVA, then mess with SkinnedMeshRenderers and animation...\u003C/p\u003E\u003Cp\u003EAnd probably other tricks I didn\u0027t think of.\u003C/p\u003E\u003Cp\u003EA challenge indeed, and I don\u0027t think I could come up with the best solution. But eventually I can make a quick tutorial on how to convert an animated mdl file to mu and load it, if it can help someone to make some tests. Could it help?\u003C/p\u003E\n"},{"CreatedByName":"MSD","CreatedById":59320,"CreatedDateTime":"2014-09-18T19:24:23Z","Content":"\n\u003Cp\u003EI like some more life around kerbin.. Please tell me if you found a way of loading crew outside of the VAB. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}