{"TopicId":79127,"ForumId":55,"TopicTitle":"Another Idea for Contracts","CreatedByName":"Skipmeister92","CreatedById":116449,"CreatedDateTime":"2014-07-23T05:11:07Z","PageNum":1,"Articles":[{"CreatedByName":"Skipmeister92","CreatedById":116449,"CreatedDateTime":"2014-07-23T05:11:07Z","Content":"\n\u003Cp\u003EContracts are obviously still a work in progress and I expect a lot of fun content from current and future iterations of them. Here is one way in which I think contracts could add more fun and more challenge to those who were seeking it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EContract Idea:\u003C/strong\u003E Place (x) number of (satellite/s) into orbit at (x) meters above the surface of (Planet/moon). Satellite/s must consist of (part A), (part \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E, (part C).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EContract Idea:\u003C/strong\u003E Place (Craft A) in orbit at (x) meters above the surface of (Planet/moon) with parts (A), (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E, ©. Launch (Craft \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E with parts (D), (E), (F) and dock it with (Craft A). \u003Cem\u003EFuture missions could send up (Craft C) to dock with (Craft A/B) and so on.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis is just a simple format with which contracts and mission could allow for the construction of infrastructure in space or on other planets. I think the parts should have a very loose set of restriction so players only have to follow a basic set of guidelines and can maintain their personal identity in how they construct their vessels.\u003C/p\u003E\u003Cp\u003EIncentives could be offered upon completion of the contract besides those already offered. For example, upon completing a spacestation/satellite network you are given an amount money/science per unit of time. Maintenance of the stations and satellites could also be an option and required to maintain the station/satellite income/science.\u003C/p\u003E\u003Cp\u003EJust some thoughts as I battle through the already fun .24 missions\u003C/p\u003E\n"}]}