{"TopicId":79410,"ForumId":16,"TopicTitle":"Adjusting and Disappearing Intercepts","CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-07-24T23:56:20Z","PageNum":1,"Articles":[{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-07-24T23:56:20Z","Content":"\n\u003Cp\u003EI am trying to get to Kerbin (a pass by Eve scattered my orbit a bit and I\u0027m trying to reacquire the encounter). I have a closest approach. I then try and refine it using a maneuver. In some directions, more delta-V will reduce the separation until a reach a point where the intercept abruptly disappears. One would expect it would decrease until you reach the point of maximum improvement, and then increase again. Instead it just decreases and then disappears.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-07-25T01:46:04Z","Content":"\n\u003Cp\u003EJust as a guess, if the orbits move too far apart you\u0027ll lose the markers. Assuming I\u0027m right, you were getting closer to being at the same point at the same time, but the orbits were getting further apart.\u003C/p\u003E\n"},{"CreatedByName":"Spica","CreatedById":65153,"CreatedDateTime":"2014-07-25T01:53:12Z","Content":"\n\u003Cp\u003EI remember this recently happened to me when I was trying to go to eve, the closest approach got smaller and smaller, until I would have gotten an encounter. However, no encounter was displayed. My advice is to quicksave, then just warp, you should get an encounter at the point where the closest approach disappeared. The only problem is that you will have no control over what kind of encounter it is. If that doesn\u0027t work, just load your quicksave. Other than that, I have no Idea what is wrong.\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-07-26T01:18:56Z","Content":"\n\u003Cp\u003EOrbits should be getting closer together if the intercept distance is getting smaller.\u003C/p\u003E\u003Cp\u003EI\u0027ve been in a position where I waited until later in the orbit to try and make it close, and it cost me delta-V I couldn\u0027t afford.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-07-26T01:45:07Z","Content":"\n\u003Cp\u003EThe second option is to drop a second node about 90 degrees before intercept and adjust the plane ... you should be able to get something to show up for minimal projected delta-v that way. The only real problem is, I have a feeling that the second node won\u0027t work too well if you then adjust the first, but it should give you some idea.\u003C/p\u003E\n"}]}