{"TopicId":79431,"ForumId":55,"TopicTitle":"Planet Information should be learned, not known","CreatedByName":"Lukapaka","CreatedById":116648,"CreatedDateTime":"2014-07-25T03:13:40Z","PageNum":1,"Articles":[{"CreatedByName":"Lukapaka","CreatedById":116648,"CreatedDateTime":"2014-07-25T03:13:40Z","Content":"\n\u003Cp\u003EIt boggled my mind a bit that the Kerbans have so much information on the other planets in their solar system, despite never having done any proper research on any of these planets!\u003C/p\u003E\u003Cp\u003EI think it would be fantastic if at the start of a Science mode game the only information you had on foreign moons and planets was their existence and their orbits. Things like local gravity, atmosphere, etc. would only be unlocked after contact is made, or certain experiments are run! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-25T03:59:35Z","Content":"\n\u003Cp\u003EGravity should be known to a certai ndegree, as it can be estimated by the size and type of the planet, which all can be concluded from observations on the ground\u003C/p\u003E\u003Cp\u003EBut I agree that there should be a lot of details (exact composition of atmosphere, hydrosphere and geosphee, as well as possible Resources and maybe Biomes), that should only be unlockable via satellites and specific instruments (which brings me to the fact that KSP definitely is lacking cameras as means to obtain research)\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2014-07-25T04:14:40Z","Content":"\n\u003Cp\u003EI think they mentioned before that there was going to be planet discovery at some point...we\u0027d have to use an observatory to spot planets and what-not before we can logically attempt to send rockets their way. Not sure if that\u0027s still planned or not, but I\u0027d hope so.\u003C/p\u003E\u003Cp\u003ETo accompany this, there was a suggestion once that I \u003Cem\u003Ereally\u003C/em\u003E liked that involved an in-game encyclopedia. At the start of a fresh, new game in KSP, this encyclopedia would just have some pretty detailed information and ground-level pictures of Kerbin on a page, some vague information about the sun on its own page along with some blurry pictures and the same with the mun. Minmus would probably have its own page as well, though you might need the observatory for that one. Some of the larger outer planets might be in there as well, with even less detailed pictures than kerbol and mun\u0027s pages \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen, as you upgrade your observatory, launch orbital telescopes, send out probes and finally kerbonauts to each of these celestial bodies, you\u0027d gradually fill in the pages of the encyclopedia and get much more and more clear images from each to show your progress. Then, doing various manned experiments would solidify the information on each page.\u003C/p\u003E\u003Cp\u003EI always thought that was a brilliant idea for tracking our in-game progression. Very compelling and there\u0027d be \u003Cem\u003Elots\u003C/em\u003E of room for kerbal silliness(like an entry reading \u0022we think Mun is made of cheese...we really need to get up there and find out!), especially in the earlier stages, before you\u0027ve sent kerbonauts everywhere and learned everything there is to know about the kerbol system \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-07-25T04:20:53Z","Content":"\n\u003Cp\u003EThe problem is that this is (to an extent) where an obvious gameplay choice differs from real life. Certainly, some things might be only to order of magnitude, but the mass of anything with a moon would be known. Atmosphere can be usefully estimated by spectroscopy and occultations. (Occultations also give diameters of anything too small to be resolved into a disk)\u003C/p\u003E\n"},{"CreatedByName":"Seshins","CreatedById":71258,"CreatedDateTime":"2014-07-25T06:32:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beeman\u0022 data-cite=\u0022Beeman\u0022\u003E\u003Cdiv\u003EI think they mentioned before that there was going to be planet discovery at some point...we\u0027d have to use an observatory to spot planets and what-not before we can logically attempt to send rockets their way. Not sure if that\u0027s still planned or not, but I\u0027d hope so.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis has to be the single feature that i have wanted the most since hearing about KSP - The ability to discover and learn some basics about the planets from Kerbin, then build rockets and fly them to the planets. (and maybe have simple cave systems to explore - and meteor showers)\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-25T09:01:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EGravity should be known to a certai ndegree, as it can be estimated by the size and type of the planet, which all can be concluded from observations on the ground\u003Cp\u003EBut I agree that there should be a lot of details (exact composition of atmosphere, hydrosphere and geosphee, as well as possible Resources and maybe Biomes), that should only be unlockable via satellites and specific instruments (which brings me to the fact that KSP definitely is lacking cameras as means to obtain research)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep. Agreed.\u003C/p\u003E\u003Cp\u003EIt\u0027d be great if you could collect all the information and then see it on the map view when selecting a planet.\u003C/p\u003E\u003Cp\u003EAnd in general - having science that affects player and/or his knowledge about planets.\u003C/p\u003E\u003Cp\u003ENot just a blue points that you gather here and there for your research tree.\u003C/p\u003E\u003Cp\u003EAs someone put it in other topic: Make science a meaningful gameplay mechanic.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-25T10:00:36Z","Content":"\n\u003Cp\u003EI wholeheartedly agree with this suggestion. The planets should just be colored balls in map mode at the start, with the map getting more refined and more informative as more observations are done. I think it should stay map-like with lat and long lines, too; save the pretty textures for when the player actually gets a ship there as that will heighten the sense of awe and accomplishment.\u003C/p\u003E\u003Cp\u003EMaybe tie the available data to the type of exploration:\u003C/p\u003E\u003Cp\u003EGround-based telescope - Free at start\u003C/p\u003E\u003Cp\u003EKerbin orbital telescope\u003C/p\u003E\u003Cp\u003EScience probe\u003C/p\u003E\u003Cp\u003EScience lander/rover\u003C/p\u003E\u003Cp\u003EManned flyby\u003C/p\u003E\u003Cp\u003EManned surface exploration\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-07-25T15:10:13Z","Content":"\n\u003Cp\u003EOh, is it time for another one of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/83813-A-New-Aproach-To-Science\u0022 rel=\u0022external nofollow\u0022\u003Ethese\u003C/a\u003E, again?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EGravity should be known to a certai ndegree, as it can be estimated by the size and type of the planet, which all can be concluded from observations on the ground\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmbralRaptor\u0022 data-cite=\u0022UmbralRaptor\u0022\u003E\u003Cdiv\u003EThe problem is that this is (to an extent) where an obvious gameplay choice differs from real life. Certainly, some things might be only to order of magnitude, but the mass of anything with a moon would be known. Atmosphere can be usefully estimated by spectroscopy and occultations. (Occultations also give diameters of anything too small to be resolved into a disk)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBasically, what they said. We knew gobs about the planets\u0027 orbits long before man-made objects ever got near them. There\u0027s no reason to hide this info from the players. It\u0027s not good game play.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EBut I agree that there should be a lot of details (exact composition of atmosphere, hydrosphere and geosphee, as well as possible Resources and maybe Biomes), that should only be unlockable via satellites and specific instruments (which brings me to the fact that KSP definitely is lacking cameras as means to obtain research)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would adore for atmospheric/hydrospheric/geologic composition of the planets to actually matter. Though the only reason I can think of for the it to matter what chemicals are present would be in the context of [REQUESTED FEATURE REDACTED], so I\u0027m not getting my hopes up.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beeman\u0022 data-cite=\u0022Beeman\u0022\u003E\u003Cdiv\u003EI think they mentioned before that there was going to be planet discovery at some point...we\u0027d have to use an observatory to spot planets and what-not before we can logically attempt to send rockets their way. Not sure if that\u0027s still planned or not, but I\u0027d hope so.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, they were discussing this about the same time as they initially announced [FEATURE REDACTED], and hasn\u0027t been mentioned since. I wouldn\u0027t get your hopes up.\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2014-07-25T15:17:12Z","Content":"\n\u003Cp\u003EMaybe ,but first there would have to be more info avaliable per-planet in the Tracking Station Screen, and possibly resources/mining. What I mean is this:\u003C/p\u003E\u003Cp\u003EAt first, you will only know all the info avaliable (ex. Orbit height and eccentricity around the sun) for Kerbin. The Mun and Minmus will be there as well, but with less information (aka Planet size/composition, gravity, etc.) As you get science points to upgrade the Tracking Station (say, a 1-6* upgrade function), you could detect more info about a certain planet at once and fine-tune the detected orbit. If you want a more detailed description, let me know. I need to sleep \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-07-25T15:47:29Z","Content":"\n\u003Cp\u003EI like that learning part, even if it\u0027s in terms of just being more precise. It also strikes me odd that an asteroid is perfectly known the moment you click \u0027track\u0027. It should take some time, and better equipment (telescopes \u0026amp; sensors in space, HELL YEAH!). You are right one can get very precise atmosphere composition data from spectroscopy, but everything \u0027down under\u0027 is guesswork still.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-07-25T17:03:53Z","Content":"\n\u003Cp\u003EFWIW, I would support only \u0022low resolution\u0022 textures being visible until you visit planets, and atmospheric density to remain mostly unknown until you visit.\u003C/p\u003E\u003Cp\u003EThey didn\u0027t know much about the atmosphere of mars before going - some measurements suggested a vacuum - which is in fact not too far off. Duna\u0027s atmosphere is positively soupy compared to Mars. I for one would like to see a planet in the Kerbol system with such a thin atmosphere - one that you won\u0027t know is there until you visit.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EI would adore for atmospheric/hydrospheric/geologic composition of the planets to actually matter. Though the only reason I can think of for the it to matter what chemicals are present would be in the context of [REQUESTED FEATURE REDACTED], so I\u0027m not getting my hopes up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I assume you are referring to in situ resource utilization, which at the moment is limited to electric charge, and oxygen on laythe (athough using closed intakes to store intake air as a resource is faaaarrrrrr..... from practical).\u003C/p\u003E\u003Cp\u003EWith a more realistic atmospheric model, that would matter. Atmospheric pressure and atmospheric denisty are not the same thing. You\u0027d have a much higher stall speed flying through 1 atm of helium than 1 atm of CO2, for example.\u003C/p\u003E\u003Cp\u003EAs far as flying on earth, where the gas composition is more or less the same, you still need to consider denisty altitude (\u003Ca href=\u0022https://en.wikipedia.org/wiki/Density_altitude\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Density_altitude\u003C/a\u003E) changes with temperature. Stall speed is higher on a hot day than a cold day (all else being equal, of course).\u003C/p\u003E\u003Cp\u003EAtmospheric composition could be tied into atmospheric pressure and temperature, when determining the atmospheric \u0022thickness\u0022 - but given the incredibly bad atmospheric model we have now, I doubt such a sophisticated simulation will be implemented.\u003C/p\u003E\u003Cp\u003EThe other reason it could matter, is if we have balloons, or some sort of simulation of pressure relating to if a kerbal survives or not if a cabin/space suit is punctured.\u003C/p\u003E\u003Cp\u003E- of which, only the ballooons may be feasible - they may not lift nearly as much in Jools (presumably) helium and H2 atmosphere, nor in Dunas (presumably CO2 but low density) atmophere - but for Eve\u0027s (presumably) CO2 atmosphere, even at 1 atm they\u0027d provide more lifting force than 1atm on kerbins (presumably) mostly N2 atmosphere\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-07-25T17:23:15Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59042-Painting-the-map!\u0022 rel=\u0022external nofollow\u0022\u003EI agree with the OP.\u003C/a\u003E\n"},{"CreatedByName":"Stratoroc","CreatedById":73987,"CreatedDateTime":"2014-07-25T23:02:51Z","Content":"\n\u003Cp\u003EI think properties such as size, orbit, surface gravity, atmosphere properties, should be always known because they are important for planning missions. What science can be used for is to unlock trivial-yet-amusing information about the planets/moons. For example, discover that minmus is sadly not a giant snack.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-07-26T06:48:12Z","Content":"\n\u003Cp\u003E\u0022I think properties such as size, orbit, surface gravity, atmosphere properties, should be always known because they are important for planning missions.\u0022\u003C/p\u003E\u003Cp\u003EHence a gameplay reason to send tiny scout probes first, like RL with the mariner probes to mars.\u003C/p\u003E\u003Cp\u003EBut then people will just look on the wiki for the info anyway\u003C/p\u003E\n"},{"CreatedByName":"chaos_forge","CreatedById":64960,"CreatedDateTime":"2014-07-26T10:17:49Z","Content":"\n\u003Cp\u003EIf a rover/lander testing facility is ever added (another often requested feature), the discovery mechanic could be integrated with it for more accurate simulations\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-07-26T15:00:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E\u0022I think properties such as size, orbit, surface gravity, atmosphere properties, should be always known because they are important for planning missions.\u0022\u003Cp\u003EHence a gameplay reason to send tiny scout probes first, like RL with the mariner probes to mars.\u003C/p\u003E\u003Cp\u003EBut then people will just look on the wiki for the info anyway\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESize, orbit, and surface gravity will all be known (easily to a high enough degree to actually plan a mission) just from interactions with the rest of the solar system. As far as sending a tiny probe first, that\u0027s the most un-Kerbal thing I\u0027ve ever heard; It\u0027s terrible to see people actually writing such stuff on these forums. Send a Kerbal and figure things out for yourself.\u003C/p\u003E\n"},{"CreatedByName":"chaos_forge","CreatedById":64960,"CreatedDateTime":"2014-07-26T16:34:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAs far as sending a tiny probe first, that\u0027s the most un-Kerbal thing I\u0027ve ever heard; It\u0027s terrible to see people actually writing such stuff on these forums. Send a Kerbal and figure things out for yourself.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a single player (mostly) sandbox game. there is no wrong way to play.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-26T16:38:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ESize, orbit, and surface gravity will all be known (easily to a high enough degree to actually plan a mission) just from interactions with the rest of the solar system. As far as sending a tiny probe first, that\u0027s the most un-Kerbal thing I\u0027ve ever heard; It\u0027s terrible to see people actually writing such stuff on these forums. Send a Kerbal and figure things out for yourself.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt actually can make things more kerbal. You could be a bit cautious and send a probe to gather data to increase subsequent chances of mission success. Or you can go full-kerbal and send a crew to a planet about which virtually nothing is known.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-07-27T07:03:05Z","Content":"\n\u003Cp\u003EFWIW, IRL small moons may not be visible either until you get a close look, I\u0027m thinking of gilly and pol here.\u003C/p\u003E\u003Cp\u003Ealready, there is some \u0022kerbalness\u0022 to going without getting a close look with a probe, and that is that you don\u0027t really know what the surface terrain is like- its hard to get a good idea of how uneven it is just by zooming in on the planet.\u003C/p\u003E\u003Cp\u003EA tall unstable lander may work for the flats of minmus, and you might thing the dark maria in the Munar craters will be similar... but then you get there and find... no, its not, its really uneven - in most places, and likely you\u0027d actually visit the mun first, not Minmus, but the point is there that you don\u0027t quite know what you are facing.\u003C/p\u003E\u003Cp\u003EAlready, unless you use various plugins, there are a lot of unknowns - you don\u0027t really know what your terminal velocity will be when you pop chutes, or what altitude your chutes will open - again, the wiki helps. Its easy to have a doomed Duna mission if you are relying on chutes to slow down, and your landing site is too high - I don\u0027t think the game displayes scale height in the map mode.\u003C/p\u003E\u003Cp\u003EThis just extends the unknowns so you can ge yourself into even more trouble - but as I said, there is the wiki, and of course, past experience, and the novelty would only be there for the first visit or two\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2014-07-27T07:42:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmbralRaptor\u0022 data-cite=\u0022UmbralRaptor\u0022\u003E\u003Cdiv\u003ECertainly, some things might be only to order of magnitude, but the mass of anything with a moon would be known. Atmosphere can be usefully estimated by spectroscopy and occultations. (Occultations also give diameters of anything too small to be resolved into a disk)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThese types of information would be known by us...humans of Earth. Not necessarily to the kerbals. I mean, they develop rocket parts capable of sending their people to other celestial bodies \u003Cem\u003Ebefore\u003C/em\u003E they build things like jet engines. Who\u0027s to say they\u0027ve got the means to run all of that science on their celestial bodies. Maybe the kerbals honestly thought mun is made of cheese or something and decided to send a rocket up there to get some for snacks...only to find out that there\u0027s no cheese up there at all.\u003C/p\u003E\u003Cp\u003EIt\u0027s like you said, it\u0027s obviously a gameplay choice...and as the \u003Cem\u003Edevelopers\u003C/em\u003E have said, gameplay \u003Cem\u003Ealways\u003C/em\u003E wins over realism. Planet discovery has always been a good idea to layer onto career progression, though it should be something you have the option to toggle on or off when you make a new game, like science or funding. But that\u0027s a topic for another discussion...or many, as seems to be the trend \u0027round here \u0026gt;.\u0026gt;\u003C/p\u003E\n"}]}