{"TopicId":79586,"ForumId":55,"TopicTitle":"Aerospace Overhaul(And rocket stuff too!)","CreatedByName":"Zaeo","CreatedById":52597,"CreatedDateTime":"2014-07-26T05:56:01Z","PageNum":1,"Articles":[{"CreatedByName":"Zaeo","CreatedById":52597,"CreatedDateTime":"2014-07-26T05:56:01Z","Content":"\n\u003Cp\u003EFirst order of business, the purpose of these suggestions are to incorporate an increased immersitivity to KSP.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERefurb Hangar\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe Refurb hangar will be a box zone inside of a now opened up Spaceplane assembly station. This zone, When the spaceplane center of mass enteres, will shut down the engines, stop the vessel, and open up a context menu. The aircraft will have to be moving slower than 20 m/s for the context menu to appear , just to make sure you don\u0027t try and stop a speeding craft too quickly, potentially causing \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Efun explosions\u003C/span\u003E a terrible accident\u003C/p\u003E\u003Cp\u003EThis menu will utilize the animated kerbal doing random things, and will have the option to refuel the vessel, Repair it to its stock blueprint state,. reset the science experiment parts and get it back on its merry way, free to expkore.\u003C/p\u003E\u003Cp\u003EFor Non space plane crafts, the recovery button will now give you two options, Recover and return(The method we have now) and Recover and Refurbish, which will rebuild the rocket blueprint that it is based off of for a re-launch. Its more for Quick relaunching, less clicking involved.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EPart Assembly Station\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt is what it sounds like. Parts are now finite in number and need to be restocked. This requires an additional building in the KSC, or one of the research complex building to be separated out for access. I thought about adding another building, the Warehouse, to show your stocked parts, but that seemed a little bit too much work, when all you need to do is have a small text option on a part \u0022 [buy] 001 l\u0026lt;l\u0026gt;l We have 000 in stock\u0022 added at the bottom of the part purchase box.\u003C/p\u003E\u003Cp\u003EThe Parts Assembly Station will have the standard assembly UI, the tabs and the parts list, with a few modifications. The icons would be replaced with Rectangular boxes, Exactly how contracts are, with the part icon replacing the contract logo. The name of the part will replace the contract name, obviously. As mentioned above, [buy] 001 l\u0026lt;l\u0026gt;l We have 000 in stock will be aligned to the bottom right hand side of the box, with the Buy button being a dark green.\u003C/p\u003E\u003Cp\u003EYou can still construct the Blueprint of the vehicle, but cannot launch until you have the required number of parts used in the creation of the vehicle. Attempting to launch a vehicle will open up a dialogue box stating you do not have the required parts, and give you a choice to cancel out the menu, or to quick-visit the PAC screen. This is more of a gameplay element rather than a bit of extra to do things. If you don\u0027t like being told to buy parts, buy in bulk for preparation for launches. \u003C/p\u003E\u003Cp\u003EAdding into this would be time sensitive part sales. This encourages people to buy parts while they are on sale, launching a vehicle at a potentially huge decrease in cost. Sale parts will be highlighted green, similar to how experimental parts are are in the build menu, it being blue*obviously*. (Small side suggestion, make contract sensitive parts ALWAYS blue, it is frustrating at times to find a contract part, and overly redundant to look up the name in the contract bar.)\u003C/p\u003E\u003Cp\u003EThe Sale parts will also be visible in the build screen in the VAB and SPH, to alert players that the part is on sale easily. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe exact UI elements involved in it is obviously your say, Squad, but If this is implemented, even partially, I\u0027ll be a very happy camper, and I\u0027m sure I won\u0027t be the only one at that campground.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-26T07:43:13Z","Content":"\n\u003Cp\u003EFirst idea - great. I\u0027d love to see that in game. No more hassle with building tankers, you got a proper bay to retire your plane after flight - sounds like a great plan.\u003C/p\u003E\u003Cp\u003EAs for the second one - IMHO too much hassle implementing it to what it\u0027s worth. I don\u0027t see anything beneficial to the gameplay that it\u0027d add minus saving some funds - but funds aren\u0027t a problem, quite contrary: we swim in them, so... no thanks, I\u0027ll pass.\u003C/p\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-07-29T10:02:01Z","Content":"\n\u003Cp\u003EHaving a quick-relaunch building would be quite nice, although I don\u0027t think it\u0027ll work for space tankers (mainly because what I haul into space is way to heavy for a plane). As with your warehouse I\u0027m not quite sure if that is useful. OK, returning parts would have a little repair fee before being filed for next use, but honestly that\u0027s about what\u0027s already implemented by the game. So more of a nice-to-have-seen feature than a real gameplay element.\u003C/p\u003E\n"}]}