{"TopicId":79724,"ForumId":55,"TopicTitle":"Show me target location at X","CreatedByName":"TrooperCooper","CreatedById":110599,"CreatedDateTime":"2014-07-27T14:50:21Z","PageNum":1,"Articles":[{"CreatedByName":"TrooperCooper","CreatedById":110599,"CreatedDateTime":"2014-07-27T14:50:21Z","Content":"\n\u003Cp\u003EFor a better situational awarness and improved planning options, it would be nice to see a targets location at any given time of my planned orbits. At the moment, we do get a \u0022closest approach\u0022 indicator. But even when its bugs would be fixed (at the moment it for example doesnt always show the true closest approach), easier planning would be made possible by showing a targets location relative to the players planned location at any given time.\u003C/p\u003E\u003Cp\u003ESome paintshop-edited pics to show what I mean, in case my loosy english fails...\u003C/p\u003E\u003Cp\u003EFirst pic shows me trying to get an approach on Eve from out of the Kerbins orbit. First maneuver node has been placed and that displays the new planned orbit with the dotted line. For whatever reason I do not get an approach right away. Nor do I get a \u0022closest approach\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/p7UuBCZ.jpg\u0022 alt=\u0022p7UuBCZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext I click on my planned path in the vicinity of the intended approach to bring up the context menu, where at the moment I can just use the \u0022Add maneuver\u0022 button.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XzoCUgC.jpg\u0022 alt=\u0022XzoCUgC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the feature that I suggest here, within that context menu we would get another button, which says \u0022relative target location\u0022 or something like that.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GSPpFZ7.jpg\u0022 alt=\u0022GSPpFZ7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EClicking said button would then display me the detailed relative locations at the selected moment in my planned flight path.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qDUY1Xu.jpg\u0022 alt=\u0022qDUY1Xu.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother possible way to implement this would be to display the information simply when the player mouse-overs his orbit plan at any given time.\u003C/p\u003E\u003Cp\u003EThis would allow me to easier plan approaches and generally more complex intercept maneuvers etc. Might even be modable, but I have no idea about that...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-27T15:23:22Z\u0022 title=\u002207/27/2014 03:23  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 27, 2014\u003C/time\u003E by TrooperCooper\u003C/strong\u003E\n\u003C/span\u003E\n"}]}