{"TopicId":79750,"ForumId":20,"TopicTitle":"KASA logo","CreatedByName":"styckx","CreatedById":49519,"CreatedDateTime":"2014-07-27T19:23:10Z","PageNum":1,"Articles":[{"CreatedByName":"styckx","CreatedById":49519,"CreatedDateTime":"2014-07-27T19:23:10Z","Content":"\n\u003Cp\u003EDidn\u0027t know where else to put this.. If wrong just move it.\u003C/p\u003E\u003Cp\u003EI\u0027m just getting into repainting textures and I wanted a logo to slap on things to give what I\u0027m painting some life.. So I figured \u0022KASA\u0022 and also figured everyone else probably already did this 1000 times.. But I only found two and they were very small and didn\u0027t have enough of the \u0022Kerbal\u0022 spin to it. \u003C/p\u003E\u003Cp\u003ESo I made my own from scratch. Free for all to use.. Just give credit if used. \u003C/p\u003E\u003Cp\u003ELink to transparent PNG in case the image host kills the picture below: \u003Ca href=\u0022http://www./download/efkf90i0zxyxhw0/KASA.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/efkf90i0zxyxhw0/KASA.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s14.postimg.org/dslgl49bz/KASA.png\u0022 alt=\u0022KASA.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-07-28T00:54:54Z","Content":"\n\u003Cp\u003ELooks interesting, and I quite like the homage to the NASA \u0022meatball\u0022 logo.\u003C/p\u003E\u003Cp\u003EHowever, I feel that the addition of the crashing rocket makes the design a bit too busy / distracting, and the full-color explosion at the end of the flight path is a definite no-no in logo design - logos should generally use as few solid colors as possible (avoid gradients / photorealistic effects).\u003C/p\u003E\n"},{"CreatedByName":"styckx","CreatedById":49519,"CreatedDateTime":"2014-07-28T01:39:34Z","Content":"\n\u003Cp\u003EI kindly disagree about it being too busy. All personal opinions of course. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But do agree with your full color explosion part. I did correct that.. Thanks kindly for the feedback.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s29.postimg.org/xumepipp3/kasalogo.png\u0022 alt=\u0022kasalogo.png\u0022\u003E\u003C/p\u003E\n"}]}