{"TopicId":79788,"ForumId":34,"TopicTitle":"[0.90.0] Fine Print vSTOCK\u0026#039;D - BETA RELEASE!!! (December 15)","CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2014-07-28T02:02:30Z","PageNum":38,"Articles":[{"CreatedByName":"Dante Montana","CreatedById":120824,"CreatedDateTime":"2014-09-16T21:03:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sodcavardos\u0022 data-cite=\u0022Sodcavardos\u0022\u003E\u003Cdiv\u003EHi there. The High attitude survey mission of your mod is so good for me to gain some easy credits, and I like it so much. Even though, It has a problem with the mission Icon, that after I finished the mission, it still appears there, on the map. The system still works fine, but the Icon annoying me a lots.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs it possible that you have seen the preview icons from another/next offered mission?\u003C/p\u003E\n"},{"CreatedByName":"stanbeard","CreatedById":122473,"CreatedDateTime":"2014-09-17T21:25:54Z","Content":"\n\u003Cp\u003EHiya,\u003C/p\u003E\u003Cp\u003EI\u0027ve got a problem where whenever I quit and return to my saves (all of them) all my current contracts disappear! This doesn\u0027t appear to happen without FinePrint installed. Any ideas for what I can do about it? I have tried creating a brand new save, accepting a (stock) contract, then quitting and restarting and the contract is gone.\u003C/p\u003E\u003Cp\u003EMany thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-17T21:31:42Z\u0022 title=\u002209/17/2014 09:31  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 17, 2014\u003C/time\u003E by stanbeard\u003C/strong\u003E\n\u003Cbr\u003EAdding detail\n\u003C/span\u003E\n"},{"CreatedByName":"StarkRG","CreatedById":95420,"CreatedDateTime":"2014-09-17T22:59:34Z","Content":"\n\u003Cp\u003EI\u0027ve got a suggestion for an alternative name for the \u0022kelio-\u0022 prefix, that is \u0022kebo-\u0022 (pronounced KEE-bo). I like this a bit better than \u0022kelio-\u0022, I love that the mod\u0027s config files allows me to change this for myself, but I figured I\u0027d tell other people about my idea.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-09-18T00:34:07Z","Content":"\n\u003Cp\u003EPersonally I use the in-game name for Sun and say \u0022Sunar\u0022 as soon-ar (I also say Munar for Mun stuff, pronounced moon-ar)\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2014-09-18T13:14:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stanbeard\u0022 data-cite=\u0022stanbeard\u0022\u003E\u003Cdiv\u003EHiya,\u003Cp\u003EI\u0027ve got a problem where whenever I quit and return to my saves (all of them) all my current contracts disappear! This doesn\u0027t appear to happen without FinePrint installed. Any ideas for what I can do about it? I have tried creating a brand new save, accepting a (stock) contract, then quitting and restarting and the contract is gone.\u003C/p\u003E\u003Cp\u003EMany thanks!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like it\u0027s doing the patch reset every time. Check a few things:\u003C/p\u003E\u003Cp\u003ECheck that when this happens, you see a patch reset in your debug log. Just hit alt F12 after you load up your game and look for any orange text with the words Fine Print in it.\u003C/p\u003E\u003Cp\u003ECheck to make sure that for whatever reason your Fine Print configuration file is not read only. When the patch reset happens, it modifies the configuration file. If it can\u0027t do that, it\u0027ll keep happening.\u003C/p\u003E\u003Cp\u003ECheck that no mods are modifying your save data in odd ways.\u003C/p\u003E\u003Cp\u003ECheck that you are running the latest version of Fine Print.\u003C/p\u003E\n"},{"CreatedByName":"SplitJugular","CreatedById":108592,"CreatedDateTime":"2014-09-19T16:02:34Z","Content":"\n\u003Cp\u003EHow do i activate the kethane contracts in the .cfg file,\u003C/p\u003E\u003Cp\u003Ei changed maximum exsitant to 2 on ISRU, but allowable resource just says kerbonite?\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2014-09-20T00:19:42Z","Content":"\n\u003Cp\u003EYou\u0027re going to want to go through Kethane\u0027s part definitions and figure out what the resource is called (probably Kethane), change any mention of Karbonite in the configuration file to the name of the resource. Then you want to go through each part and make a list of parts for Kethane to put in the tech unlocks section. This will control when the mission appears (if you research any of the technology there, it\u0027ll unlock ISRU missions).\u003C/p\u003E\u003Cp\u003EWhen I say \u0022part name\u0022, you\u0027re actually looking for what it is referred to in the code, not what you read in game. You\u0027ll see two names in the part configuration file one says \u0022name =\u0022 and one says \u0022title =\u0022, you want the name.\u003C/p\u003E\n"},{"CreatedByName":"gnivler","CreatedById":116639,"CreatedDateTime":"2014-09-20T15:01:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EtrimPitch = 0.024\u003Cp\u003EThis line is in your save, on an asteroid. I assume you tapped you trim key on accident, which causes the vessel to constantly exert a force, you have to kill your trim with I think shift X. The trimmed vessel is probably the one you undocked. If you leave it trimmed, it will spin slowly on it\u0027s own.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you!! I had a landed mobile base that had trim set for reasons unknown, key mashing maybe. I would have never thought of this (reset trim is alt-X by default on Windows)\u003C/p\u003E\u003Cp\u003EAwesome mod Arsonide, thanks for making it for us all!\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2014-09-20T16:01:04Z","Content":"\n\u003Cp\u003EGuys I want to apologize in advance, compatibility with 0.25 is probably not going to be very fast. I started making Fine Print after 0.24 came out, so I have never modded through a patch before. Please be patient after 0.25 comes out, while I go through everything and make sure it\u0027s working properly.\u003C/p\u003E\u003Cp\u003ESince not all of the changes are announced yet, some of them might require balance changes, and I\u0027ll need to play a bit to figure out where those are necessary. I\u0027d asked for experimental access, as I know some of the more popular mods get a head start on this sort of thing, but didn\u0027t get a response, so it may be a bit before I get properly integrated after the patch comes out.\u003C/p\u003E\n"},{"CreatedByName":"jjpenguins66","CreatedById":122756,"CreatedDateTime":"2014-09-21T00:37:10Z","Content":"\n\u003Cp\u003EI have a quick question, but I wanted to thank you for the mod first. It really adds a lot to the game.\u003C/p\u003E\u003Cp\u003EI see some posts where you have added support for other mods. Could you add support for ModularMultiWheels7 by TouhouTorpedo? The wheels are great but don\u0027t register on the rover missions. I think you will need the Module names for the wheels and I would be glad to collect them for you after I clear it with TT if you need them. \u003C/p\u003E\u003Cp\u003EPlease advise at your convenience.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Jaxx","CreatedById":95312,"CreatedDateTime":"2014-09-21T00:56:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EGuys I want to apologize in advance, compatibility with 0.25 is probably not going to be very fast. I started making Fine Print after 0.24 came out, so I have never modded through a patch before. Please be patient after 0.25 comes out, while I go through everything and make sure it\u0027s working properly.\u003Cp\u003ESince not all of the changes are announced yet, some of them might require balance changes, and I\u0027ll need to play a bit to figure out where those are necessary. I\u0027d asked for experimental access, as I know some of the more popular mods get a head start on this sort of thing, but didn\u0027t get a response, so it may be a bit before I get properly integrated after the patch comes out.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EModded players have learned that the actual and functional release date for playable next versions is at least month apart. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Take your time.\u003C/p\u003E\n"},{"CreatedByName":"Hitokiri","CreatedById":85627,"CreatedDateTime":"2014-09-21T12:19:06Z","Content":"\n\u003Cp\u003EIs there any plan for Mission to man stations? I know, I can do it without contract, but hey, budget is tight, right, so some credits for actually delivering Kerbals to station would be fine...\u003C/p\u003E\u003Cp\u003EOh, and this is really, really great mod. In fact I played .24.2 in vanilla carrier and it didn\u0027t really please me much, but with Fine Prints this is completely different, better, play.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-09-21T14:45:18Z","Content":"\n\u003Cp\u003EI\u0027ve been having a conflict between your mod and a slight change I make to my persistence file to remove science, and I was wondering if you could tell me how I could edit the file so I get what I want, but don\u0027t conflict with your mod.\u003C/p\u003E\u003Cp\u003EI periodically change my persistence file to remove science gains from contracts. I think the game has far too much science in it already and giving us more for contracts is a bit ridiculous. So, I change the line \u003Cstrong\u003E\u0022values = ...\u0022\u003C/strong\u003E in the file for each contract to set the science value (the 6th number in that line) to 0. This works fine in the default contracts, and seemed to work fine with FinePrint before. Now, though, it causes the contracts to be deleted. In particular, it\u0027s happening to the default Explore Duna and Explore Ike contracts. I keep accepting them, deleting those values, reloading the save, and they\u0027re gone again but are again being offered to take.\u003C/p\u003E\u003Cp\u003EI\u0027ve got the setting to delete contracts turned off in your mod. At least, I think I do. The PatchReset is false in the config.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2014-09-21T15:23:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EGuys I want to apologize in advance, compatibility with 0.25 is probably not going to be very fast. I started making Fine Print after 0.24 came out, so I have never modded through a patch before. Please be patient after 0.25 comes out, while I go through everything and make sure it\u0027s working properly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo rush man. Fine Print is awesome, and awesome things take time. (Besides, I play pure stock for a while every time a new release is made, so I can get a good feel for the changes).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EI think the game has far too much science in it already and giving us more for contracts is a bit ridiculous.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the game does give way too much science. The Kerbin SOI alone has something like... 11k in it, and the tree only costs like 10k-ish to complete.\u003C/p\u003E\u003Cp\u003EI did a full-stock playthrough and I had about 40k after landing once on every body that should have a surface.. That\u0027s 50k total right there, and I bypassed things like low Jool atmosphere or getting splashed on Laythe or Eve. And I don\u0027t think I hit even a third of the Mun biomes.\u003C/p\u003E\u003Cp\u003EI read in another thread that the total science available is around 75k.\u003C/p\u003E\u003Cp\u003EI\u0027d love it if Fine Print could also reconfigure stock science returns as well (parts testing is especially obnoxious in this respect...press tab on the launchpad for 220 science! \u0026gt;.\u0026lt;)..not sure how feasible that would be though.\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-09-23T08:36:15Z","Content":"\n\u003Cp\u003EFirstly excellent mod, greater variety of contracts is much needed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EISRU: Disabled by default, this contract type must be manually enabled in the configuration file, and asks you to extract resources like Karbonite or Kethane from other planets, and deliver them to specific locations.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas wondering how to activate Kethane ISRU missions? Had a look at the cfg file and I assume to activate them you simply increase the incidents number from 0 to something else but all the rest of it is talking about Karbonite. Don\u0027t have Karbonite installed, do have Kethane however.\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2014-09-24T22:00:52Z","Content":"\n\u003Cp\u003EYes, you\u0027ll need to reconfigure the resource name and the tech unlock entries to refer to Kethane and Kethane parts. I don\u0027t use Kethane ever since the Modstatistics debacle, so I don\u0027t know what these are. They are in your part definitions though.\u003C/p\u003E\n"},{"CreatedByName":"ap0r","CreatedById":100383,"CreatedDateTime":"2014-09-25T00:25:37Z","Content":"\n\u003Cp\u003ECongratulations on this awesome work! Should be stock IMHO \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2014-09-25T13:57:18Z","Content":"\n\u003Cp\u003EWhat mean\u0027s \u0022neutralize controls\u0022 in the fine print contract about Orbital station?\u003C/p\u003E\u003Cp\u003EDoes it mean flight controls or switching off all energy on board?\u003C/p\u003E\u003Cp\u003EI am not sure how to satisfy this part of the contract, can someone help\u003C/p\u003E\u003Cp\u003EThank\u0027s\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-09-25T14:19:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gilflo\u0022 data-cite=\u0022gilflo\u0022\u003E\u003Cdiv\u003EWhat mean\u0027s \u0022neutralize controls\u0022 in the fine print contract about Orbital station?\u003Cp\u003EDoes it mean flight controls or switching off all energy on board?\u003C/p\u003E\u003Cp\u003EI am not sure how to satisfy this part of the contract, can someone help\u003C/p\u003E\u003Cp\u003EThank\u0027s\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECut throttle, turn off SAS and RCS, cancel trim and don\u0027t move the craft.\u003C/p\u003E\n"},{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2014-09-25T15:26:05Z","Content":"\n\u003Cp\u003EOK thank\u0027s for that\u003C/p\u003E\n"},{"CreatedByName":"Jaxx","CreatedById":95312,"CreatedDateTime":"2014-09-25T18:39:16Z","Content":"\n\u003Cp\u003EI got about a bazillion output logs together to see if your mod has anything to do with it, since contracts are invoked basically every time: \u003Ca href=\u0022https://www.dropbox.com/sh/zi9cwmfxz8yx360/AACy_NpnpoIT_D5PcuDT4kAya?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EPlease review this whole folder and see if anything can\u0027t be figured out\u003C/a\u003E. I uninstalled and reinstalled various mods to try and get some variety. Whoops wrong dropbox link.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-25T19:04:21Z\u0022 title=\u002209/25/2014 07:04  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 25, 2014\u003C/time\u003E by Jaxx\u003C/strong\u003E\n\u003Cbr\u003Ewrong link\n\u003C/span\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-09-26T16:35:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EYes, you\u0027ll need to reconfigure the resource name and the tech unlock entries to refer to Kethane and Kethane parts. I don\u0027t use Kethane ever since the Modstatistics debacle, so I don\u0027t know what these are. They are in your part definitions though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, I\u0027m working on this. If you have no objections I will post up the modified config file for other to use once I\u0027ve confirmed it works!\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-09-26T16:41:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EYes, you\u0027ll need to reconfigure the resource name and the tech unlock entries to refer to Kethane and Kethane parts. I don\u0027t use Kethane ever since the Modstatistics debacle, so I don\u0027t know what these are. They are in your part definitions though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKarbonite is basically a full replacement at this point. ORSX should be fully released, not just testing, and supported by ScanSat and Interstellar soon. Extraplanetary Launchpads integration is an unknown beyond the little patch. It\u0027ll be nice to see these fully supported by Fine Print.\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-09-26T21:07:51Z","Content":"\n\u003Cp\u003EHighly specific question: how does fine print determine that there is a science lab on a station/base? Does it look for the specific part or for the part-module? OKS/MKS is adding modules in the fashion of the current lineup of modules with science lab functionality so you don\u0027t have to mix in the horrible stock part with the nice OKS/MKS parts. Would those science lab parts be recognized by fineprint for missions asking you to make stations/bases with a lab?\u003C/p\u003E\n"},{"CreatedByName":"Eleven","CreatedById":60502,"CreatedDateTime":"2014-09-26T21:52:51Z","Content":"\n\u003Cp\u003EI would love a way to force types of contracts. I just finished up some Eve contracts, and was given some for the Jool system. I know there are plenty of other Jool system contracts but I\u0027m just not getting them. (I like to bundle a bunch for the same system and get them all completed on the same mission). I just keep cancelling and hoping they pop up but I would love to be able to target that system in some manner \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Not that it\u0027s a Fine Print issue, just generally wishing...)\u003C/p\u003E\u003Cp\u003EJust wanted to show this, it\u0027s possible to decline enough to line up an entire list of Duna contracts, would be great to do the same for Jool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WmBuDaF.png\u0022 alt=\u0022WmBuDaF.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-26T23:03:43Z\u0022 title=\u002209/26/2014 11:03  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 26, 2014\u003C/time\u003E by Eleven\u003C/strong\u003E\n\u003C/span\u003E\n"}]}