{"TopicId":80049,"ForumId":55,"TopicTitle":"CAD Function/Tool Ideas","CreatedByName":"Steve_Mcn","CreatedById":117177,"CreatedDateTime":"2014-07-30T00:15:22Z","PageNum":1,"Articles":[{"CreatedByName":"Steve_Mcn","CreatedById":117177,"CreatedDateTime":"2014-07-30T00:15:22Z","Content":"\n\u003Cp\u003EFirst of all, I want to applause the hard work done by all the masterminds behind this awesome project. You got under your hand an addictive game and that\u0027s a good thing... I think \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003ELet say I had this idea because I work in CAD (Computer Assisted Drawing) environment every day. With this kind of program, you\u0027re often call to work with BIG assembly of multiple parts and when you\u0027re trying to click on THE part and it\u0027s stuck under a dozen of others, you need a special tool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E. The program I use have 2 different type of right-click option. The first one, when you just click on the part, choose the top first part or the bigger one. It\u0027s ok with 80% of the need. The other 20% you just let your mouse over around where your parts is and three dot appear beside your cursor(...). This mean IT\u0027S the time to right-click! By doing a right-click when ... appear, a pick-drop list appear. In this menu, all the part in a certain array can be select. Then you chose the right one for your need.\u003C/p\u003E\u003Cp\u003EI\u0027m talking about this CAD function because often, in the assembly hangar, I need to choose the little part beside the partern\u0022ed\u0022 parts and that make all the assembly to be restarted. Any kind of precision click could be great in that case but since it\u0027s already existing in CAD program and it\u0027s working well, I suggest that one!\u003C/p\u003E\u003Cp\u003EAlso, a UNDO and a REDO function could remove a lot of frustrating moment.\u003C/p\u003E\u003Cp\u003ELike said earlier your doing a really good job and I hope your keep doing good for many years again!\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-30T00:57:35Z","Content":"\n\u003Cp\u003ECtrl-Z and Ctrl-Y work for Undo and Redo respectively, though it can be a little wonky at times.\u003C/p\u003E\u003Cp\u003EI share your frustration about trying to click a small part like a strut or fuel line and accidentally hitting the parent part instead, anything that can reduce that would be an improvement. Your idea sounds like a good one, not sure how difficult it is to incorporate pro-level CAD features in a video game from a small developer, though.\u003C/p\u003E\n"}]}