{"TopicId":80164,"ForumId":32,"TopicTitle":"A new Kraken species?","CreatedByName":"corvustech","CreatedById":111036,"CreatedDateTime":"2014-07-30T19:40:48Z","PageNum":1,"Articles":[{"CreatedByName":"corvustech","CreatedById":111036,"CreatedDateTime":"2014-07-30T19:40:48Z","Content":"\n\u003Cp\u003EI haven\u0027t read about or seen this happen before, so I think it may be a direct result of the weirdtastic builds that I find myself doing since contracts came out. \u003C/p\u003E\u003Cp\u003EI had to test a Mainsail at 95k up, so I strapped.an adapter on a probe and added a few more tests. The result: first stage boosters, second stage skipper, third stage mainsail. After dropping the boosters I kicked on the skipper, and the rest of the ship stopped. I mean STOPPED. The engine tore through the rest of the ship. It looked like a can being crushed against a clear ceiling and exploded.\u003C/p\u003E\u003Cp\u003ENew species, Or new flavor of an old one? All of my parts were the same size except the probe core at the very top.\u003C/p\u003E\u003Cp\u003ENote: same ship worked fine with no alterations on next attempt.\u003C/p\u003E\n"},{"CreatedByName":"WWEdeadman","CreatedById":105591,"CreatedDateTime":"2014-07-30T19:58:46Z","Content":"\n\u003Cp\u003EUhhh.... what? I am having trouble imagining that scenario. But the Kraken does strike in many different ways.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-07-30T20:48:15Z","Content":"\n\u003Cp\u003EYes, I\u0027ve seen this happen before, at launch actually. I once had the command pod stay fixed in position, above the launchpad, while the rest of the ship launched through it and blew apart. The pod didn\u0027t even fall under gravity, or anything. I think it\u0027s related to the phantom-acceleration thing with command pods/cores. It\u0027s similar in that it seems to retain a specific velocity or acceleration, regardless of what the rest of the ship is doing, and it tears the ship apart. It\u0027s been going on since 0.23.5.\u003C/p\u003E\n"},{"CreatedByName":"Poryy","CreatedById":81075,"CreatedDateTime":"2014-07-30T22:07:03Z","Content":"\n\u003Cp\u003EI hereaby name it the Inertia Kraken!\u003C/p\u003E\n"},{"CreatedByName":"Doge","CreatedById":115372,"CreatedDateTime":"2014-07-30T22:08:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Poryy\u0022 data-cite=\u0022Poryy\u0022\u003E\u003Cdiv\u003EI hereaby name it the Inertia Kraken!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood choice!\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-07-30T22:22:01Z","Content":"\n\u003Cp\u003EA new age of darkness has begun!\u003C/p\u003E\n"},{"CreatedByName":"Holyvision","CreatedById":100532,"CreatedDateTime":"2014-07-30T22:24:07Z","Content":"\n\u003Cp\u003EI believe this has something to do with decouplers, when there is more mass towards the top of the vessel than at the bottom. I too have had this happen, but I only notice it when I intentionally have a much larger engine (eg, mainsail) on the upper stage vs the lower ones. \u003C/p\u003E\u003Cp\u003EMaybe it\u0027s just a fluke.\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-07-30T22:37:11Z","Content":"\n\u003Cp\u003ENever experienced this.\u003C/p\u003E\u003Cp\u003EHowever, since 0.24, I recently had a variant Hell Kraken which was initiated by hitting a Kerbal which had been frozen during EVA after being ejected from a command seat with another Kerbal. This happened on Minmus. The stuck Kerbal went skidding like it should have, but suddenly disappeared without any smoke, if I remember correctly. The Kraken struck when I tried to switch that Kerbal. It was unusual because the altitude indicator did not have any numbers at all, while they cycle (infamously to 666666 at some points.) Another Kraken I found was when a Kerbal on EVA got stuck in the struts that reinforced part of my ship, causing the Kerbal to be flung kilometers behind the ship in Ike orbit. I failed to re-insert Jebediah into orbit (periapsis was underground due to high terrain on Ike) and Jeb went permanently dead for some reason, forcing me to manually respawn him.\u003C/p\u003E\n"}]}