{"TopicId":80209,"ForumId":16,"TopicTitle":"How to use a ready made craft in career","CreatedByName":"sam1133","CreatedById":107853,"CreatedDateTime":"2014-07-31T03:58:43Z","PageNum":1,"Articles":[{"CreatedByName":"sam1133","CreatedById":107853,"CreatedDateTime":"2014-07-31T03:58:43Z","Content":"\n\u003Cp\u003Ehi, well exactly that really...have several mods loaded with ready made craft.....atm, i need a landing craft, and i know i have one in the ships VAB directory, how can i use that craft in my career mode...as i am very poor at designing landing craft\u003C/p\u003E\u003Cp\u003Ethanx\u003C/p\u003E\u003Cp\u003Esam\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2014-07-31T04:06:29Z","Content":"\n\u003Cp\u003EYou can copy the ships directly from the mod folder/ships folder and them drop them into the ships file of the career you\u0027re running-be warned that it\u0027s likely that some parts will be locked and thus render the entire craft unselectable.\u003C/p\u003E\u003Cp\u003EOn the topic of landers, don\u0027t give up building them! If you\u0027re afraid of running out of fuel, add more-it\u0027s unlikely you\u0027ll have too little thrust on the Mun or Minmus.\u003C/p\u003E\u003Cp\u003EHope this helps,\u003C/p\u003E\u003Cp\u003ELazro\u003C/p\u003E\n"},{"CreatedByName":"sam1133","CreatedById":107853,"CreatedDateTime":"2014-07-31T06:02:11Z","Content":"\n\u003Cp\u003Ethanx Lazero, but how do i use the said modded craft in career mode, where do i put the file please...i dont understand where to putthe file so the craft shows up for me in my career.\u003C/p\u003E\u003Cp\u003Ethanx\u003C/p\u003E\u003Cp\u003Esam\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-07-31T07:05:40Z","Content":"\n\u003Cp\u003EGo to the Saves folder. In there, there will be another folder with the same name as your game save. Inside that will be a folder named \u0022ships\u0022 (or \u0022craft\u0022 or something; can\u0027t remember for certain). Inside that will be two folders: VAB and SPH. Put the .craft file in whichever of those is appropriate (SPH for planes, VAB for rockets). When you go to the appropriate building, the ship will be in the \u0022load ship\u0022 list.\u003C/p\u003E\n"},{"CreatedByName":"sam1133","CreatedById":107853,"CreatedDateTime":"2014-07-31T10:04:51Z","Content":"\n\u003Cp\u003Ewow thank you...brilliant...thanx\u003C/p\u003E\n"}]}