{"TopicId":80384,"ForumId":18,"TopicTitle":"Server Purchase","CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2014-08-01T11:20:16Z","PageNum":1,"Articles":[{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2014-08-01T11:20:16Z","Content":"\n\u003Cp\u003ESo I am looking at purchasing my first server for several uses. The uses I intend it for are:\u003C/p\u003E\u003Cp\u003E- Game servers; Mainly minecraft, tekkit and the likes\u003C/p\u003E\u003Cp\u003E- Web server; and\u003C/p\u003E\u003Cp\u003E- a FTP server for around home\u003C/p\u003E\u003Cp\u003EThe game and web servers would be publically accessible, and the website would be for the game servers. These are the specs I currently have for the server (NOTE these are not exact product specs, just rough guidelines):\u003C/p\u003E\u003Cp\u003E- 1x Intel Xenon 8 core 10 Thread 2.6Ghz Processor\u003C/p\u003E\u003Cp\u003E- 32GB RAM 1600Mhz ECC\u003C/p\u003E\u003Cp\u003E- Windows Server 2008 Standard Ed\u003C/p\u003E\u003Cp\u003E- 2TB Raw-Storage - 4x 500GB HDDs in a RAID 6\u003C/p\u003E\u003Cp\u003E- 2 1GbE NICs linked into a single 2GbE link\u003C/p\u003E\u003Cp\u003E- Daily tape backup of game server data and web server databases.\u003C/p\u003E\u003Cp\u003EI can\u0027t remember how much this sort of thing costed, I vaguely remember it being around AUD$15K. So anybody with experience in servers: Is this a good configuration? Is it worth making the plunge into buying the server? Also note I want something as powerful as this so I can easily expand my game servers before needing to upgrade. I\u0027m considering bringing up my RAM to 64 or 128GB so I can allocate a fair amount to the game servers. Cheers, all you server-savvy people!\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-01T14:18:18Z","Content":"\n\u003Cp\u003EIt sounds like overkill in some respects, and missing in some others. For most services, serving a small number of users is not all that demanding.\u003C/p\u003E\u003Cp\u003ESince you\u0027re running games, I\u0027d say that\u0027s not \u0022business critical\u0022. Ie it\u0027s not going to cost you loads of money if the server is down for a bit or there\u0027s some minor data corruption. With that in mind, I\u0027d suggest:\u003C/p\u003E\u003Cp\u003EAn internet connection with a fast \u003Cem\u003Eupload\u003C/em\u003E speed. ADSL is generally terrible. Home cable/fibre/\u0022superfast\u0022 services are better, but you might need a costly business service for truly good upload speeds.\u003C/p\u003E\u003Cp\u003EA good router. I like Draytek, they\u0027re capable and not dumbed down.\u003C/p\u003E\u003Cp\u003EA UPS. Keep the system safe from power surges and brief outages.\u003C/p\u003E\u003Cp\u003EA \u0022standard\u0022 processor and accompanying motherboard, something like a Core i5 would be just fine.\u003C/p\u003E\u003Cp\u003E8 or 16 GB of RAM should be plenty, but make sure you\u0027ve got some spare slots for upgrading if you need it.\u003C/p\u003E\u003Cp\u003EUnless you need Windows Server for a specific service or want to learn how to use it, a Linux distribution for the OS. Ubuntu LTS, Debian, or CentOS should be good picks.\u003C/p\u003E\u003Cp\u003EMore disk space. You can never have too much really. Consider a hybrid drive for faster performance, or have a solid-state drive and a regular hard drive and use caching software. If availability is not a major concern, don\u0027t bother with the RAID. Do though use volume management - LVM on Linux, dynamic disks on Windows - so you can easily add more disk space in future.\u003C/p\u003E\u003Cp\u003EThe motherboard\u0027s onboard ethernet will be fine.\u003C/p\u003E\u003Cp\u003EA pair of external hard drives for backup, will be cheaper than tape. Keep one attached, one away in a different building, and swap them over every week or so.\u003C/p\u003E\u003Cp\u003EEDIT: Since you\u0027re concerned about upgradability, consider making your \u0022main\u0022 OS a virtual machine host, and run your actual services in virtual machines. That way if your load increases beyond what your current system can take, it\u0027s relatively easy to transfer one or all of the virtual machines to new hardware, or even a commercial hosting service.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-01T14:22:53Z\u0022 title=\u002208/01/2014 02:22  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 1, 2014\u003C/time\u003E by cantab\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2014-08-02T04:38:22Z","Content":"\n\u003Cp\u003ECheers for the input cantab. I plan for it to take more than a few users though. Im planning for 100\u002B users, and having slots for 100\u002B users as well. I didn\u0027t specify the router, because I know how much of a pain upload can be if its not fast. That is exactly why Im going to grab an upstream service once I have the server setup. Anyways, thanks for the input.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-08-02T09:09:45Z","Content":"\n\u003Cp\u003E100\u002B concurrent players in a Forge modded environment on a 2.6 GHz CPU... yeah, good luck with that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E You might, maybe, potentially pull it off with MCPC\u002B/Cauldron, but then you\u0027re faced with curating individual mods for compatibility and every update of any involved party may break things.\u003C/p\u003E\u003Cp\u003EAlthough it\u0027ll be fixed in 1.8, Minecraft\u0027s engine right now is still inefficient and singlethreaded. And 1.8 is a fair ways off; I\u0027m expecting Forge to update around the end of 2014 or so, and then you\u0027ll be waiting another 2-3 months for the majority of mods to port. 1.8 is a \u003Cem\u003Egiant\u003C/em\u003E update. So basically, whatever you buy now will probably end up running 1.7.x for another 9 months or so at minimum.\u003C/p\u003E\u003Cp\u003EAs such, go for more clock speed. If necessary, make do with less threads; 1.7.x isn\u0027t going to use them anyway, and neither is a webserver unless you\u0027re getting multiple concurrent visitors per second. For which you\u0027d need a userbase considerably larger than just 100. Of course, having the threads for when you do switch to 1.8.x will be great, but you probably want something that works well in the interim.\u003C/p\u003E\n"},{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2014-08-05T00:13:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E100\u002B concurrent players in a Forge modded environment on a 2.6 GHz CPU... yeah, good luck with that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E You might, maybe, potentially pull it off with MCPC\u002B/Cauldron, but then you\u0027re faced with curating individual mods for compatibility and every update of any involved party may break things.\u003Cp\u003EAlthough it\u0027ll be fixed in 1.8, Minecraft\u0027s engine right now is still inefficient and singlethreaded. And 1.8 is a fair ways off; I\u0027m expecting Forge to update around the end of 2014 or so, and then you\u0027ll be waiting another 2-3 months for the majority of mods to port. 1.8 is a \u003Cem\u003Egiant\u003C/em\u003E update. So basically, whatever you buy now will probably end up running 1.7.x for another 9 months or so at minimum.\u003C/p\u003E\u003Cp\u003EAs such, go for more clock speed. If necessary, make do with less threads; 1.7.x isn\u0027t going to use them anyway, and neither is a webserver unless you\u0027re getting multiple concurrent visitors per second. For which you\u0027d need a userbase considerably larger than just 100. Of course, having the threads for when you do switch to 1.8.x will be great, but you probably want something that works well in the interim.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts a xenon. Do you not know how powerful xenons are? Slots aren\u0027t majorly CPU intensive. Its more about the RAM and upload speed that depends on how many slots can be had on the server.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-05T01:09:00Z","Content":"\n\u003Cp\u003EXeon. Just the one n.\u003C/p\u003E\u003Cp\u003EWith Intel\u0027s current line-up you are unfortunately forced to choose between more cores and faster ones. Compare for instance the Xeon E5-2697 with the i7-4790K: \u003Ca href=\u0022http://www.cpubenchmark.net/compare.php?cmp\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003Ehttp://www.cpubenchmark.net/compare.php?cmp\u003C/a\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003E[]=2009\u0026amp;cmp[]=2275\u003C/a\u003E . If you\u0027re running lots of services and/or heavily multithreaded services the xeon wins, but with a single-threaded process - which according to Streetwind includes the current Minecraft server - the core i7 blows the vastly more expensive xeon away.\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2014-08-05T02:23:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAn internet connection with a fast \u003Cem\u003Eupload\u003C/em\u003E speed. ADSL is generally terrible. Home cable/fibre/\u0022superfast\u0022 services are better, but you might need a costly business service for truly good upload speeds.\u003C/p\u003E\u003Cp\u003EA good router. I like Draytek, they\u0027re capable and not dumbed down.\u003C/p\u003E\u003Cp\u003EA UPS. Keep the system safe from power surges and brief outages.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESolid advice, and the first point cannot be stressed enough.\u003C/p\u003E\u003Cp\u003EAlso, take the hour required to wire up a standard plug board to attach to a port on the UPS, and place your router and switches on the UPS supply. You\u0027ll be glad you did.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E8 or 16 GB of RAM should be plenty, but make sure you\u0027ve got some spare slots for upgrading if you need it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo be perfectly honest, I\u0027d put a minimum of 32GB in a server these days.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EUnless you need Windows Server for a specific service or want to learn how to use it, a Linux distribution for the OS. Ubuntu LTS, Debian, or CentOS should be good picks.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. And from a learning-to-server POV, I certainly found learning Linux a far more pleasant experience. Simply put, when I\u0027m googling to figure out why i\u0027m having problems with $service, the signal-to-noise level tends to be higher on the Linux side of things.\u003C/p\u003E\u003Cp\u003EI\u0027m going to assume that if you\u0027re dropping $15k on a server, you don\u0027t care about the cost of a licence for the server, and any CAL\u0027s that might be required, but you also don\u0027t run into that on the Linux side.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EA pair of external hard drives for backup, will be cheaper than tape. Keep one attached, one away in a different building, and swap them over every week or so.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s about the minimum I\u0027d recommend rotating the media, but otherwise I agree wholeheartedly on using hard disks over tape.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEDIT: Since you\u0027re concerned about upgradability, consider making your \u0022main\u0022 OS a virtual machine host, and run your actual services in virtual machines. That way if your load increases beyond what your current system can take, it\u0027s relatively easy to transfer one or all of the virtual machines to new hardware, or even a commercial hosting service.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it doesn\u0027t absolutely, positively have to run on the metal, make it a VM.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-08-05T12:54:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ToTheMun\u0022 data-cite=\u0022ToTheMun\u0022\u003E\u003Cdiv\u003EIts a xenon. Do you not know how powerful xenons are? Slots aren\u0027t majorly CPU intensive. Its more about the RAM and upload speed that depends on how many slots can be had on the server.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you know that both Ferrari and Lamborghini used to be tractor manufacturers? Someone in my extended family owns a Ferrari tractor. I drove it. Let me assure you, it is not in any way, shape or form \u0022fast\u0022 or \u0022sporty\u0022. As such, you would be well served to not blindly follow a brand or manufacturer just because you have an image in your head about how it \u003Cem\u003Eshould be\u003C/em\u003E. Especially since that image was probably put there largely by word of mouth and/or advertising and marketing spin.\u003C/p\u003E\u003Cp\u003EAs someone with a decade of experience as a systems integrator and administrator, I can confirm that yes, Intel builds good CPUs that clock for clock are faster than AMD CPUs. But I also understand how the hardware works, and more importantly, I understand how the \u003Cem\u003Esoftware\u003C/em\u003E works. A Xeon CPU doesn\u0027t magically handwave away the barrier of single-threaded program logic. It may use only 6 clock cycles for \u0026lt;arbitrary operation x\u0026gt; instead of the 7 that an Opteron would, but 2.6 billion cycles per second are still 2.6 billion cycles per second, and they can only calculate so much.\u003C/p\u003E\u003Cp\u003EI\u0027ve hosted multiple Minecraft servers before picking up KSP. It is true that slots and concurrent players aren\u0027t automatically CPU intensive. But do you know what is? Loaded chunks are CPU intensive, and constantly loading and unloading them is even more so (and let\u0027s not even talk about generating new terrain). You have three guesses as to what 100 players are going to be doing on your map, and the first two don\u0027t count. Now add mods, which can vastly increase the performance required to load or keep loaded each chunk. Alternate Terrain Generation using two thirds of the world height on average instead of vanilla\u0027s one third on average? Boom, your block processing load per chunk just doubled. Automated mining machines autonomously digging into the world and keeping themselves loaded can easily make each single player feel like two, if not more. Items streaming through pipes and in and out of inventories want to be calculated. Almost every mod-added block is a tile entity, which generate many dozen times more load than a generic block of dirt. Every single alternate dimension added will build an entirely new world from scratch that needs to be loaded and ticked alongside the main world, still in the same single thread, even if they aren\u0027t particularly load-heavy on their own. And then there are alternate dimensions which are absolute performance hogs on top of the fact of being a separate world (hello Twilight Forest). Then you have Thaumcraft ticking its nodes worldwide (in all concurrent dimensions!) and converting biomes at runtime, extra dungeon addons make sure there\u0027s mob-filled hidden caverns and rooms everywhere, players leaving mob grinders and automated farms chunkloaded and running even when they sign off... need I go on? Oh right, I haven\u0027t mentioned that vanilla bug where server performance on large maps degrades over time due to chunk unload errors that get magnified by mod use, have I?\u003C/p\u003E\u003Cp\u003EAs mentioned before, using Cauldron will afford you breathing room, since it fixes said bug, and multithreads dimension handling. You might get acceptable performance if you set world borders and ban automated mining in the overworld, and other such shenanigans. But a pure 1.7.x Forge environment with the usual suite of popular mods and 100 concurrent players will \u003Cem\u003Emurder\u003C/em\u003E a 2.6 GHz CPU core. Guaranteed. Manufacturer is irrelevant.\u003C/p\u003E\u003Cp\u003ESince you are into Minecraft multiplayer, you have probably heard of the ForgeCraft servers and watched one or more of the various streamers and youtubers active there. These things run on pretty beefy hardware, and towards the end of a map\u0027s lifecycle, they\u0027re sometimes getting performance issues with as little as 10 concurrent players.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-05T12:57:11Z\u0022 title=\u002208/05/2014 12:57  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 5, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2014-08-05T22:31:41Z","Content":"\n\u003Cp\u003EYou know I\u0027m not just having a minecraft server right? I\u0027m using windows server to run IIS and an AD network and also an FTP server. So that\u0027s why I have multiple cores over the higher Ghz. I might either increase Ghz mark or lower the slots available. And I will not be running VMs with this server either. And I know that xeons don\u0027t just magically do anything. I know that they don\u0027t magically do anything, but I do know that they are good for their multicore performance. Which is what I want. Perhaps I should scale the xeon down to a lesser cost one and get another server and use an AMD 5.0Ghz processor on that one and use that as the minecraft one. Maybe I could do that instead. The cost would be less as well, and I would be achieving good performance for the minecraft server, wouldn\u0027t I?\u003C/p\u003E\n"}]}