{"TopicId":80426,"ForumId":20,"TopicTitle":"Realistic(ish) Stock(ish) Playmodes","CreatedByName":"Xephirious","CreatedById":77577,"CreatedDateTime":"2014-08-01T18:55:34Z","PageNum":1,"Articles":[{"CreatedByName":"Xephirious","CreatedById":77577,"CreatedDateTime":"2014-08-01T18:55:34Z","Content":"\n\u003Cp\u003EHey all! Just curious what constraints and/or mods you guys are using to simulate a more realistic space program. Here are mine:\u003C/p\u003E\u003Cp\u003EKerbal Engineer so I can actually calculate stuff\u003C/p\u003E\u003Cp\u003EKW rocketry but ONLY the fairings - no procedural because that\u0027s not very realistic\u003C/p\u003E\u003Cp\u003EScanSat to map planets\u003C/p\u003E\u003Cp\u003ENo f9 use except for correcting glitches\u003C/p\u003E\u003Cp\u003EPermadeath\u003C/p\u003E\u003Cp\u003ENo reverts\u003C/p\u003E\u003Cp\u003ENow for game play rules:\u003C/p\u003E\u003Cp\u003EProbe flybys/orbits before mapping missions\u003C/p\u003E\u003Cp\u003EAlways map a planet\u003C/p\u003E\u003Cp\u003EProbe landers before Kerbaled landers\u003C/p\u003E\u003Cp\u003EEverything fits in a fairing\u003C/p\u003E\u003Cp\u003ELanders are equiped with radar mapping parts (like Curiosity)\u003C/p\u003E\u003Cp\u003EAlways have contingencies (including action buttons) for mission failure and/or Kerbal recovery\u003C/p\u003E\u003Cp\u003ENo nuclear engine firing inside Kerbin Atmosphere and no ditching nukes on Kerbin\u003C/p\u003E\u003Cp\u003EUnlimited debris\u003C/p\u003E\u003Cp\u003ENo excessive mission durations (i.e. 10 years for a single kerbal in a 1man pod)\u003C/p\u003E\u003Cp\u003ERealistic rocket profiles (no square stacks, asparagus staging, Skyscraper rockets or mid rocket boosters)\u003C/p\u003E\u003Cp\u003EOrbital Construction a la constellation for epic missions\u003C/p\u003E\u003Cp\u003ENo Lithobreaking\u003C/p\u003E\u003Cp\u003ENo monster contraptions flying perpendicular to the atmosphere with exposed fuel tanks etc. (try to use something that approximates a heat shield) \u003C/p\u003E\u003Cp\u003EI know this isn\u0027t super hardcore but I\u0027m not ready for TAC life support and FAR just yet. This is about as strict as I can go and still have fun with my current skill level.\u003C/p\u003E\u003Cp\u003EI\u0027m considering adding Remote Tech (if that works in .24?)\u003C/p\u003E\u003Cp\u003EHow about you guys? Did I miss something you think I should add?\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-08-01T19:09:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xephirious\u0022 data-cite=\u0022Xephirious\u0022\u003E\u003Cdiv\u003EHey all! Just curious what constraints and/or mods you guys are using to simulate a more realistic space program.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERealism Overhaul.\u003C/p\u003E\n"},{"CreatedByName":"SkyRex94","CreatedById":114868,"CreatedDateTime":"2014-08-01T19:38:54Z","Content":"\n\u003Cp\u003EYou really should do a Aerodynamic Overhaul Mod. I used FAR, now i\u0027m using NEAR , realistic Aerodynamics but not as complicated as FAR and no High dynamic pressure, you should try it. \u003C/p\u003E\u003Cp\u003EAnd that : \u0022Realistic rocket profiles (no square stacks, asparagus staging, Skyscraper rockets or mid rocket boosters)\u0022 becomes neccesary than, because you can\u0027t get anything else into Orbit without spinning your Rocket out of control.\u003C/p\u003E\n"},{"CreatedByName":"Taquarinha","CreatedById":47685,"CreatedDateTime":"2014-08-01T20:00:42Z","Content":"\n\u003Cp\u003EProcedural Fayrings are not unrealistic since fayrings can be designed mission especific.\u003C/p\u003E\n"},{"CreatedByName":"Xephirious","CreatedById":77577,"CreatedDateTime":"2014-08-01T21:08:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ERealism Overhaul.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you give me a short synopsis so I don\u0027t have to install it to test? How extensive is this mod?\u003C/p\u003E\u003Cp\u003E\u0022Procedural Fayrings are not unrealistic since fayrings can be designed mission specific.\u0022\u003C/p\u003E\u003Cp\u003EYeah but a giant round blob on top of a rocket is not. Even mission specific fairings have overall design limitations.\u003C/p\u003E\n"},{"CreatedByName":"WololoW","CreatedById":114478,"CreatedDateTime":"2014-08-01T21:53:03Z","Content":"\n\u003Cp\u003ECheck out \u003Ca href=\u0022https://docs.google.com/spreadsheets/d/12x9Jri1md6D-Ih0ijV_UuQGITgdCyadYBdfXblfwK-g/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Emy modlist\u003C/a\u003E, as I feel it caters to a Stock(ish) playstyle\u003C/p\u003E\n"}]}