{"TopicId":80481,"ForumId":16,"TopicTitle":"How often do you get new Kerbals in the astronaut complex?","CreatedByName":"SmarterThanMe","CreatedById":58706,"CreatedDateTime":"2014-08-02T09:14:25Z","PageNum":1,"Articles":[{"CreatedByName":"SmarterThanMe","CreatedById":58706,"CreatedDateTime":"2014-08-02T09:14:25Z","Content":"\n\u003Cp\u003EJust wondering. It\u0027s time someone else got a go other than Jeb, Bob and Bill.\u003C/p\u003E\n"},{"CreatedByName":"qazsedcft","CreatedById":114699,"CreatedDateTime":"2014-08-02T09:21:11Z","Content":"\n\u003Cp\u003EUntil the Kerbal skills are more than just placeholders I\u0027m not going to bother.\u003C/p\u003E\n"},{"CreatedByName":"JebNeedsHelp","CreatedById":117002,"CreatedDateTime":"2014-08-02T09:43:33Z","Content":"\n\u003Cp\u003EA lot. I\u0027ve colonized a lot of the system. Almost 100 Kerbals each on the Mun and Minmus, 23 on Eve and 10 on Gilly, 24 on Duna and 20 on Ike, 8 on Moho, 25 on Dres, and 10 on Eeloo. Plus one poor Kerbal on Bop - I\u0027m still working on landing the little guys on Jool\u0027s moons. And yeah, until I get a lot better at the game, they\u0027re all one-way trips.\u003C/p\u003E\u003Cp\u003EI have a lot of fun seeing all the different names that get generated.\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2014-08-02T10:02:24Z","Content":"\n\u003Cp\u003EMy Jeb, Bob and Bill are all off world on missions at the moment so there\u0027s plenty of opportunities for the newer guys to fly.\u003C/p\u003E\n"},{"CreatedByName":"SmarterThanMe","CreatedById":58706,"CreatedDateTime":"2014-08-02T11:19:52Z","Content":"\n\u003Cp\u003EI\u0027ve gone 7 Kerbin days without new guys turning up... Is this a bug?\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-08-02T11:42:04Z","Content":"\n\u003Cp\u003Ewhat do you mean turning up? you have to hire them from the astronaut complex. or rescue them from space.\u003C/p\u003E\n"},{"CreatedByName":"SmarterThanMe","CreatedById":58706,"CreatedDateTime":"2014-08-02T11:50:23Z","Content":"\n\u003Cp\u003EThere are no Kerbals available for hire in the Astronaut Complex.\u003C/p\u003E\n"},{"CreatedByName":"SmarterThanMe","CreatedById":58706,"CreatedDateTime":"2014-08-02T12:10:13Z","Content":"\n\u003Cp\u003EAlso, tried to create a new kerbal through Ship Manifest.. Got this error:\u003C/p\u003E\u003Cp\u003E[Error]: [Applicants List Error]: Cannot Hire Geofwell Kerman as he is not an applicant\u003C/p\u003E\u003Cp\u003E...I doubt that the problem is there, though.\u003C/p\u003E\n"},{"CreatedByName":"GoatRider","CreatedById":103681,"CreatedDateTime":"2014-08-02T13:02:11Z","Content":"\n\u003Cp\u003EThey will also be auto-hired if all your current kerbals are occupied. Launch Jeb, Bill, and Bob, and then try to launch another- it will be occupied by a new hire.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-08-04T13:34:02Z","Content":"\n\u003Cp\u003EI don\u0027t know the exact interval, but whenever I fast-forward by a few Kerbin-weeks to get to a new launch window, or interplanetary course correction, etc, I can usually check and find an entirely new list of recruits in the astronaut complex. You\u0027re free to hire as few or as many as you want there.\u003C/p\u003E\n"},{"CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2014-09-03T21:36:47Z","Content":"\n\u003Cp\u003EI\u0027m also having this issue. I\u0027ve gone about two Kerbin weeks without any new applicants. I\u0027m a little picky about not hiring stupid astronauts (I use EL) and so I don\u0027t really want to just chance it by clicking the \u0027Fill\u0027 crew button. Same as SmarterThanMe I am using Ship Manifest and can\u0027t create astronauts with that either. Can anyone recommend a fix so that I can start my colonization mission finally?\u003C/p\u003E\u003Cp\u003EEDIT: My current workaround: a python script that randomly generates Kerbals and lets me select which ones I want to hire and then outputs the appropriate persistence section. Crude, but functional.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-04T00:03:50Z\u0022 title=\u002209/04/2014 12:03  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 4, 2014\u003C/time\u003E by Booots\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tsotha","CreatedById":120361,"CreatedDateTime":"2014-09-04T22:52:14Z","Content":"\n\u003Cp\u003EI don\u0027t think I\u0027ve hired one yet. Seems like about one in ten contracts are rescue missions, and those guys go onto your roster.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-09-05T13:22:25Z","Content":"\n\u003Cp\u003ESame here; I haven\u0027t actually hired anybody since starting the new career save and I\u0027m pretty much holding the guys I\u0027ve rescued in reserve for permanent flag planting duties.\u003C/p\u003E\u003Cp\u003EIf nobody\u0027s showing up in your Astronaut Complex, that does sound like a bug. I might have to visit the astronaut complex myself next chance I get to see if the same thing\u0027s happening to me or not.\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2014-09-05T13:33:46Z","Content":"\n\u003Cp\u003EI\u0027ve got plenty of them from space around Kerbin.\u003C/p\u003E\u003Cp\u003EIf your Astronaut Complex is not operational that might be a mod problem. Once I\u0027ve filled ~30 spaces dome within minutes. They appear in packs of eight. I suppose you should have empty \u0022free crew\u0022 window.\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-09-05T14:21:26Z","Content":"\n\u003Cp\u003EI can hire all Kerbals available, exit the astronaut complex, go right back in and it\u0027s repopulated. I don\u0027t use much for mods though (KAS, alarm clock, nav ball\u002B, KER, root select, rcs aid) so maybe that\u0027s the problem.\u003C/p\u003E\n"}]}