{"TopicId":80519,"ForumId":55,"TopicTitle":"Random failures of experimental parts","CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-02T19:28:36Z","PageNum":1,"Articles":[{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-02T19:28:36Z","Content":"\n\u003Cp\u003EYep, I\u0027m aware of our \u0022do not suggest\u0022 list. And I think the devs are right when they say \u0022we don\u0027t want you to fail a mission because of RNG, KSP is not a casino\u0022.\u003C/p\u003E\u003Cp\u003EWhat I\u0027m going to suggest here is something else.\u003C/p\u003E\u003Cp\u003ESince 0.24 we have contracts. Some of them are like \u0022test part X in situation Y\u0022. Some of these tests involve \u0022blue\u0022 parts that aren\u0027t unlocked by the tech tree yet and are (I believe) supposed to be sort of work in progress rather than just parts of another color. And these tests sometimes are, well, boring. Bring part X to situation Y, press space bar, done. You usually already know the result even before taking a contract, and this is IMHO completely wrong. Because what is the point? Why we call it \u0022test\u0022?\u003C/p\u003E\u003Cp\u003ELet\u0027s make these \u0022blue\u0022 parts to do random and weird things. Like, for example, a decoupler at the launch pad does KABOOM and the whole ship is gone by the wind. Or \u0022Mainsail\u0022 suddenly casts \u0022x10 thrust, x50 fuel consumption, full throttle and stop responding\u0022 on itself. Or something else.\u003C/p\u003E\u003Cp\u003EPros:\u003C/p\u003E\u003Cp\u003E1. It \u003Cstrong\u003Edoes not\u003C/strong\u003E fail missions randomly (unless you are Kerbal enough to use a highly experimental heavily duct-taped something-that-looks-like-an-engine in your first manned Mun landing).\u003C/p\u003E\u003Cp\u003E1.5. It explicitly separates \u0022test\u0022 missions from \u0022science\u0022 ones. I. e. more different gameplays for your money.\u003C/p\u003E\u003Cp\u003E2. It is realistic, fun and not hard to play with. All at the same time.\u003C/p\u003E\u003Cp\u003E3. It isn\u0027t (probably) too hard to implement.\u003C/p\u003E\u003Cp\u003E4. More KABOOM! For SCIENCE and FUNDS!\u003C/p\u003E\u003Cp\u003ECons:\u003C/p\u003E\u003Cp\u003EI don\u0027t see any.\u003C/p\u003E\n"},{"CreatedByName":"JokingHinge","CreatedById":109457,"CreatedDateTime":"2014-08-02T19:37:24Z","Content":"\n\u003Cp\u003EIf this is added, there should be a warning stating it might fail at any time.\u003C/p\u003E\n"},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-02T19:46:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JokingHinge\u0022 data-cite=\u0022JokingHinge\u0022\u003E\u003Cdiv\u003EIf this is added, there should be a warning stating it might fail at any time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe it\u0027s exactly the thing the word \u0022experimental\u0022 stands for. Especially when we\u0027re talking about rocket engines or explosive-driven decouplers.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-08-02T22:55:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fairytalefox\u0022 data-cite=\u0022fairytalefox\u0022\u003E\u003Cdiv\u003ELike, for example, a decoupler at the launch pad does KABOOM and the whole ship is gone by the wind. Or \u0022Mainsail\u0022 suddenly casts \u0022x10 thrust, x50 fuel consumption, full throttle and stop responding\u0022 on itself.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, because that won\u0027t be annoying at all. This is why Squad is against random failures - they want everyones experience to be the same. If one person presses Space at X altitude and Y speed, the exact same thing should happen to someone else who presses Space at X altitude and Y speed. Having this just randomly fail results in one of two things - A, ragequit because the thing that failed is integral to your design and you\u0027ve spent the past 2 weeks getting to this stage or B, revert to launch. Neither of these increases enjoyment of the game by any means.\u003C/p\u003E\u003Cp\u003EAlso, what you are suggesting is exactly the kind of thing that is both against Squads wishes and on the WNTS list - random failures. It doesn\u0027t matter if the parts are well-proven or experimental, a random failure is a random failure.\u003C/p\u003E\n"},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-02T23:37:51Z","Content":"\n\u003Cp\u003EContracts are random.\u003C/p\u003E\u003Cp\u003EAsteroids are random.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EThis is why Squad is against random failures - they want everyones experience to be the same.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo no, they don\u0027t.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EHaving this just randomly fail results in one of two things - A, ragequit because the thing that failed is integral to your design and you\u0027ve spent the past 2 weeks getting to this stage or B, revert to launch.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you do any of these contracts? Because all and every of them run in exactly the same way: transport part X to situation Y; do the test; terminate flight. I don\u0027t understand what ragequit you\u0027re talking about. And making a part that is technically inaccessible (and will become really inaccessible after the test completion) \u0022integral to your design\u0022 doesn\u0027t sound like a wise decision, too.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-08-03T00:03:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fairytalefox\u0022 data-cite=\u0022fairytalefox\u0022\u003E\u003Cdiv\u003EContracts are random.\u003Cp\u003EAsteroids are random.\u003C/p\u003E\u003Cp\u003ESo no, they don\u0027t.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, the specifics are different, but everyone knows that if you have an asteroid of X tons travelling at Y speed at Z height above kerbin, you need to always apply the same amount of dV to it to capture it. Parts do not and should not differ in any way across players. That is what\u0027s meant by \u0027everyones experience is the same\u0027, not that \u0027everyone gets exactly the same contracts and asteroids\u0027. Yes, you might get a contract that says \u0027test part A at between 24000m and 24025m and 450 and 455m/s\u0027 and no-one else might ever get that same contract, but the point is that if they do, the results of it will be the same as yours. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fairytalefox\u0022 data-cite=\u0022fairytalefox\u0022\u003E\u003Cdiv\u003EI don\u0027t understand what ragequit you\u0027re talking about. And making a part that is technically inaccessible (and will become really inaccessible after the test completion) \u0022integral to your design\u0022 doesn\u0027t sound like a wise decision, too.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Test Stack Decoupler landed on Tylo\u0022. A part that, no matter which way you slice it, is going to be pretty integral to your mission to test it. Even if it\u0027s not and it\u0027s just on a spare node somewhere, if a part has some random failure of any kind (explosions, stuck throttle etc), you\u0027ve still spent all that time getting there only to have it ruined by something that you didn\u0027t even need to bring in the first place. It\u0027s either needed in your design, in which case your weeks of planning go out the window because it catastrophically fails, or it\u0027s not needed in your design and it messes up your weeks of planning by catastrophically failing anyway. I don\u0027t know about you but bringing the Kerbodyne 4x1 cluster out to Eeloo just tacked on the side on a spare node somewhere and then having it stuck at 100% throttle and using up my return fuel would be just the tiniest bit annoying. Why even bother carting it all the way out here if it (as a extraneous part) is just going to ruin the entire mission? I could just as easily done the exact same but without carrying all that unnecessary weight and trying to fit it on the craft in a reasonable way. It\u0027s either that or I depend on it for my return journey and it explodes.\u003C/p\u003E\u003Cp\u003EEDIT: Also, as I said, \u0022it doesn\u0027t matter if the parts are well-proven or experimental, a random failure is a random failure\u0022 and random failures are on the WNTS list.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-03T00:09:22Z\u0022 title=\u002208/03/2014 12:09  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 3, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-03T07:21:50Z","Content":"\n\u003Cp\u003EI see some misunderstanding here.\u003C/p\u003E\u003Cp\u003EIn my personal expirience all the missions are either \u0022test\u0022 or \u0022routine\u0022. There never was one mission to have both tasks. Just because \u0022flying 700 to 800 m/s 1000 to 1500 meters above Mun\u0022 is suicidal AND completely meaningless unless you have to stage darn Rockomax BACC SRB somewhere around there. So your whole mission is dedicated to one task. So you physically can\u0027t fail anything other than this particular test.\u003C/p\u003E\u003Cp\u003ENow, all conditions are met, you run test, and that\u0027s all. It does not matter (in terms of success or failure) what exactly happens next because the test has been ran, so the contract is completed. This was a triumph, huge success. Yes, that part in testing does something strange. Or does as usual. Or does nothing. But who really cares? Not you.\u003C/p\u003E\u003Cp\u003EI\u0027ll write down my key points again:\u003C/p\u003E\u003Cp\u003E* Only \u0022blue\u0022 parts. I. e. irregular parts outside of unlocked nodes of the tech tree. Typically unusable in regular designs at your current game progress.\u003C/p\u003E\u003Cp\u003E* Only when they are \u0022tested\u0022. Staged, or you click \u0022test\u0022 button in their UI, or whatever is written in the contract.\u003C/p\u003E\u003Cp\u003E* The contract is completed even if the part failed. It\u0027s completely consistent because the contract was \u0022test it\u0022, not \u0022do not fail it\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EI don\u0027t know about you but bringing the Kerbodyne 4x1 cluster out to Eeloo just tacked on the side on a spare node somewhere and then having it stuck at 100% throttle and using up my return fuel would be just the tiniest bit annoying.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, this would be a problem. Why not to decouple this funny little toy before running it? You don\u0027t need it onboard anyway. And if you are completely non-Kerbal type of mind (like myself), why not to put your main ship on the return course before runnibg the cluster, just in case?\u003C/p\u003E\u003Cp\u003EOn the second thought, you have the point. May be one\u0027s particular approach to such missions does matter, too. I don\u0027t know. In my case, it does not, but, well, people aren\u0027t the same.\u003C/p\u003E\u003Cp\u003EBut \u0022a random failure is a random failure\u0022 is not a valid reason anyway. Random failure of a mission definitely isn\u0027t an option (gosh I hate with all my heart and mind those little funny miracles at SoI transitions), but a small firework at the end of the work, in my humble opinion, is.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-08-03T08:00:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fairytalefox\u0022 data-cite=\u0022fairytalefox\u0022\u003E\u003Cdiv\u003EContracts are random.\u003Cp\u003EAsteroids are random.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s different. First of they\u0027re not random, they\u0027re procedurally generated meaning they spawn according to a ruleset. You won\u0027t get Duna missions until you go to the Mun/Minmus, the payoff is based on distance and other variables, etc. Second it would completely remove crazy contraptions like this: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://media.pcgamer.com/files/2014/07/KSP1-610x343.jpg\u0022 alt=\u0022KSP1-610x343.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-03T08:41:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptRobau\u0022 data-cite=\u0022CaptRobau\u0022\u003E\u003Cdiv\u003ESecond it would completely remove crazy contraptions like this: \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow can this be removed? You have a chance to lose your contraption, that\u0027s all. Minus ~10k funds, not a big deal. Oh, it\u0027s piloted...\u003C/p\u003E\u003Cp\u003EBTW, nice craft \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-03T10:01:21Z","Content":"\n\u003Cp\u003EHere\u0027s what will happen if your test mission randomly explodes:\u003C/p\u003E\u003Cp\u003EMost of the people will sigh in annoyance, and than revert and do it again.\u003C/p\u003E\u003Cp\u003EThe rest, who doesn\u0027t like revert, will sigh in even MORe annoyence, since the game just randomly blew up a bunch of funds, and maybe even a Kerbal, and relaunch the test.\u003C/p\u003E\u003Cp\u003EThat\u0027s it. It\u0027ll be annoying, nothing else.\u003C/p\u003E\u003Cp\u003EHow exactly is that an improvement?\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-08-03T12:24:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fairytalefox\u0022 data-cite=\u0022fairytalefox\u0022\u003E\u003Cdiv\u003EHow can this be removed? You have a chance to lose your contraption, that\u0027s all. Minus ~10k funds, not a big deal. Oh, it\u0027s piloted...\u003Cp\u003EBTW, nice craft \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause people are building this to do a lot of test runs in a single mission. If you have parts that won\u0027t work as you expect them to on such an unstable design, then the chances of such an outlandish working safely are almost zero. Thus people will stop building them. As everyone else has said, random annoyances add absolutely nothing to the game, but frustration.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-08-03T20:26:40Z","Content":"\n\u003Cp\u003EHi. Thanks for the reports guys. A couple of us decided to let this one run because while random failures are on WNTS, this \u003Cem\u003Eis\u003C/em\u003E something of a novel suggestion.\u003C/p\u003E\u003Cp\u003EPersonally, I think the tech tree could be tweaked to put one of the probe parts in a really low node. That would give you a way of testing some of the more highly-explosive parts (like engines) without risking kerbals. I don\u0027t know whether making a decoupler explode with the force of a small nuke would be that enjoyable, but certainly having it not do what it\u0027s supposed to do in some way would be in line with the fact that it\u0027s a test. Perhaps this instability would only apply to part tests for parts you don\u0027t yet have access to in the tech tree, and a successful test could move that part down a few nodes or just unlock it for you? Perhaps the chance of failure could be related to how many science points you currently need to get the part.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-08-03T21:11:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EThat\u0027s it. It\u0027ll be annoying, nothing else.\u003Cp\u003EHow exactly is that an improvement?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would rather be annoyed than bored. And that\u0027s what these test missions are for me currently.\u003C/p\u003E\u003Cp\u003EThe fact of the matter is that, if your mission is to take something somewhere and test it, you don\u0027t make it a critical part of your vessel. Test an experimental jet engine, you don\u0027t make it the primary engine on your plane. Testing a decoupler, you don\u0027t make it detach crucial stuff.\u003C/p\u003E\u003Cp\u003EAnd I don\u0027t think he\u0027s suggesting that a \u0027failed\u0027 part even fails the contract. You went there, tested it, and it didn\u0027t go as planned. What is the POINT of testing something if you know what the result is going to be?\u003C/p\u003E\n"},{"CreatedByName":"Zilentification","CreatedById":117937,"CreatedDateTime":"2014-08-04T04:09:56Z","Content":"\n\u003Cp\u003EStargate525 has it right when he points out that you don\u0027t make a test mission component part of you vessel. You just shove it on at the end. Decouplers that Decouple nothing, Engines without fuel etc. I think a much easier solution to prevent this is for the mission to encourage use of the component. Instead of a mission reading \u0022Go the Mun and test X.\u0022 A mission could tell you to \u0022Use X to get to the Mun.\u0022\u003C/p\u003E\u003Cp\u003EI dislike the idea of part failure though. The problem is that this game doesn\u0027t give you a lot of troubleshooting options in relation to problems. Just imagine a scenario like this, while in orbit your ship starts rotating. Well, its easy to see whats causing the problem, you just switch to Third person view. A RCS engine is stuck on, so what do you do? You turn it off, or stop fuel flow and the issue is resolved. There is just no challenge to solve the problem. \u003C/p\u003E\u003Cp\u003EIts interesting to note that I consider 3rd person one of the major hurdles that would need to be overcome. If your stuck in First person it could actually be a challenge to find what\u0027s wrong and solve it.\u003C/p\u003E\u003Cp\u003EThe trick is to make a failure fun, and with the current stock KSS I don\u0027t think that\u0027s possible. I believe part damage is currently planned (along with the capability to repair parts) and maybe then this could be looked at again.\u003C/p\u003E\n"},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-04T06:00:29Z","Content":"\n\u003Cp\u003EThank you guys for support \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ethis instability would only apply to part tests for parts you don\u0027t yet have access to in the tech tree\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E^ this. And yes, low-tech probe core would be a great help. We don\u0027t want to lose our fellow Jeb (anymore).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd I don\u0027t think he\u0027s suggesting that a \u0027failed\u0027 part even fails the contract.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E^ and this. I definitely do not want to fail more contracts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EActually I think it would be good to have a rate of failure (for \u0022failable\u0022 parts) extremely high, like 95%. So part\u0027s behavior stays kind of predictable, just slightly different \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E In single-task missions it changes nothing, in multitask ones, well, you have to adjust your mission plan a bit in order to isolate a part in testing from it\u0027s mother ship. Just another engineering task.\u003C/p\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-08-04T11:13:07Z","Content":"\n\u003Cp\u003EI personally like the idea of random failures for testing components. I just don\u0027t think they should be like exploding the whole ship (unless you\u0027re testing a tank), because that\u0027s ridiculous - you only have so much TNT in a decoupler, the only things that could possibly happen are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Efailed ejection (TNT doesn\u0027t blow)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Efailed ejection (TNT is too weak to separate the stages)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eejection with force being applied in a different angle, rotating your ship and such\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESame with engines. You should always be able to kill the fuel line, this is not an integral part of the engine itself. Engine not working, OK. Engine not responding to toggle, OK. Engine with not responding thrust vector, thrust slider, different thrust, ... perfectly reasonable. Even boosters can\u0027t really explode, reason being material density, thermoconductivity and reaction activation energy (sorry, guys, my job\u0027s talking here). Breaking apart, non-symmetrical burn profile, different thrust profile - now these are real life problems.\u003C/p\u003E\u003Cp\u003EI think this would add a really nice component to the game. Take my like for the general suggestion.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-08-04T12:29:50Z","Content":"\n\u003Cp\u003Ethis would make it exciting when people use contracts only for early access to later tier parts\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-08-04T13:11:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022M3tal_Warrior\u0022 data-cite=\u0022M3tal_Warrior\u0022\u003E\u003Cdiv\u003ESame with engines. You should always be able to kill the fuel line, this is not an integral part of the engine itself. Engine not working, OK. Engine not responding to toggle, OK. Engine with not responding thrust vector, thrust slider, different thrust, ... perfectly reasonable. Even boosters can\u0027t really explode, reason being material density, thermoconductivity and reaction activation energy (sorry, guys, my job\u0027s talking here). Breaking apart, non-symmetrical burn profile, different thrust profile - now these are real life problems.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like this. Reasonable issues, but not overt failure in most cases.\u003C/p\u003E\u003Cp\u003EThe one problem I see with this is that at the current game dev stage, these issues can be mistaken for bugs.\u003C/p\u003E\n"},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-04T13:21:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022M3tal_Warrior\u0022 data-cite=\u0022M3tal_Warrior\u0022\u003E\u003Cdiv\u003EI personally like the idea of random failures for testing components. I just don\u0027t think they should be like exploding the whole ship (unless you\u0027re testing a tank), because that\u0027s ridiculous - you only have so much TNT in a decoupler, the only things that could possibly happen are:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Efailed ejection (TNT doesn\u0027t blow) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Efailed ejection (TNT is too weak to separate the stages) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eejection with force being applied in a different angle, rotating your ship and such \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESame with engines. You should always be able to kill the fuel line, this is not an integral part of the engine itself. Engine not working, OK. Engine not responding to toggle, OK. Engine with not responding thrust vector, thrust slider, different thrust, ... perfectly reasonable. Even boosters can\u0027t really explode, reason being material density, thermoconductivity and reaction activation energy (sorry, guys, my job\u0027s talking here). Breaking apart, non-symmetrical burn profile, different thrust profile - now these are real life problems.\u003C/p\u003E\u003Cp\u003EI think this would add a really nice component to the game. Take my like for the general suggestion.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you.\u003C/p\u003E\u003Cp\u003EDecouplers. What about such scenario: \u0022let\u0027s put 20 pounds of TNT in this little guy as the spec suggests... or what does this little \u0027g\u0027 mean, may be grams? Nah, pounds are way better\u0022... and two days later: \u0022well, now it\u0027s scientifically proven that pounds aren\u0027t \u003Cstrong\u003Ealways\u003C/strong\u003E better\u0022. In my opinion, it\u0027s pretty Kerbal way to gain knowledge \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EThe one problem I see with this is that at the current game dev stage, these issues can be mistaken for bugs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat about changing these parts color from blue to red? And BIG letters somewhere in the contract: \u0022This part isn\u0027t tested yet, it might be dangerous to use it!\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-04T13:27:38Z\u0022 title=\u002208/04/2014 01:27  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 4, 2014\u003C/time\u003E by fairytalefox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-08-04T13:23:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EThe one problem I see with this is that at the current game dev stage, these issues can be mistaken for bugs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is not a problem of the game but of communication. It can be solved easily, by just telling guys in the contract statement.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fairytalefox\u0022 data-cite=\u0022fairytalefox\u0022\u003E\u003Cdiv\u003E\u0022let\u0027s put 20 pounds of TNT in this little guy as the spec suggests... or what does this little \u0027g\u0027 mean, may be grams? /snip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is actually a reasonable way (in the Kerbal universe, that is). This is why one does these nice ground tests first. Afterwards one knows how much TNT is to be used (about, with higher altitudes you need less). \u003C/p\u003E\u003Cp\u003EWould fit perfectly in my proposed system, I think.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-04T13:29:58Z\u0022 title=\u002208/04/2014 01:29  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 4, 2014\u003C/time\u003E by M3tal_Warrior\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-08-04T13:41:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fairytalefox\u0022 data-cite=\u0022fairytalefox\u0022\u003E\u003Cdiv\u003EWhat about changing these parts color from blue to red? And BIG letters somewhere in the contract: \u0022This part isn\u0027t tested yet, it might be dangerous to use it!\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022M3tal_Warrior\u0022 data-cite=\u0022M3tal_Warrior\u0022\u003E\u003Cdiv\u003EThis is not a problem of the game but of communication. It can be solved easily, by just telling guys in the contract statement.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s adorable you think people read.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2014-08-04T13:46:32Z","Content":"\n\u003Cp\u003EKeep in mind that just because a part fails, the test \u003Cem\u003Edoesn\u0027t\u003C/em\u003EÃ¢â‚¬â€The contract is \u003Cem\u003Etesting\u003C/em\u003E the part, and it didn\u0027t work. I\u0027m sure everyone agrees on this but it\u0027s good to get it out of the way.\u003C/p\u003E\u003Cp\u003ESecond of all, I think there\u0027s a fairly simple solution to what is described above that would meet all criteria, and also defeat the current wave (at least that how \u003Cstrong\u003EI\u003C/strong\u003E am doing it) of unmanned probes that, with brutal efficiency, test 2 parts on the launch platform, 5 parts on the way up, 3 on the way down, and another two when splashed down. I know that HarvesteR loves those contraptions and for the first three times they\u0027re fun, but it gets old quickly.\u003C/p\u003E\u003Cp\u003EThis thread, and a recent bunch of contracts that had me lift a LFB KR1X2 into orbit (before staging it) and use \u003Cem\u003Ethat\u003C/em\u003E to get a KR2L into Munar orbit made me think... Things can be made a little bit more challenging if you require a Kerbal to \u003Cem\u003Einspect\u003C/em\u003E it (during an EVA). In some cases there might be an additional requirement to inspection (\u0022in orbit\u0022) and maybe in some cases a second \u0022run test\u0022 gets unlocked after an inspection.\u003C/p\u003E\u003Cp\u003EMaybe the inspection reveals a \u0022part failed\u0022 result which unlocks a new contract to repair/redo the test (eva: \u0022reset part\u0022)\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-08-04T13:55:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EThis thread, and a recent bunch of contracts that had me lift a LFB KR1X2 into orbit (before staging it) and use \u003Cem\u003Ethat\u003C/em\u003E to get a KR2L into Munar orbit made me think... Things can be made a little bit more challenging if you require a Kerbal to \u003Cem\u003Einspect\u003C/em\u003E it (during an EVA). In some cases there might be an additional requirement to inspection (\u0022in orbit\u0022) and maybe in some cases a second \u0022run test\u0022 gets unlocked after an inspection.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan\u0027t be done in flight. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-04T14:01:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EIt\u0027s adorable you think people read.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople do discover somehow what to do in order to complete the contract. By reading it, or by looking into crystal ball, or by eating shrooms endemic to Kerbin, I don\u0027t know exactly. Anyway, lacking some essential skill and thus failing your mission is a legit part of the gameplay.\u003C/p\u003E\n"},{"CreatedByName":"fairytalefox","CreatedById":115320,"CreatedDateTime":"2014-08-04T14:08:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003ECan\u0027t be done in flight. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Run test\u0022 can.\u003C/p\u003E\u003Cp\u003EEDIT. I mean, you can\u0027t run engine while EVA but you can make Kerbal do \u0022run test\u0022. It\u0027s not exactly the same but sort of.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-04T14:11:09Z\u0022 title=\u002208/04/2014 02:11  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 4, 2014\u003C/time\u003E by fairytalefox\u003C/strong\u003E\n\u003C/span\u003E\n"}]}