{"TopicId":80535,"ForumId":51,"TopicTitle":"Ad Lunam - Final Update 2015-05-31","CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-08-02T21:32:00Z","PageNum":4,"Articles":[{"CreatedByName":"ElJugador","CreatedById":18783,"CreatedDateTime":"2014-12-17T19:48:47Z","Content":"\n\u003Cp\u003EI\u0027ve seen that, too. It\u0027s a (SPOILERS BELOW!)\u003C/p\u003E\u003Cp\u003EKraken-something class ship that can hold 90something Kerbals.\u003C/p\u003E\u003Cp\u003E(SPOILER END)\u003C/p\u003E\u003Cp\u003EAnyhow, are you going to do something special for this next update?? After all, it is .90.0. 90 is 65 more than 25.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T19:53:04Z\u0022 title=\u002212/17/2014 07:53  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by ElJugador\u003C/strong\u003E\n\u003Cbr\u003Eprotecting spoilers\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-12-17T22:13:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ElJugador\u0022 data-cite=\u0022ElJugador\u0022\u003E\u003Cdiv\u003EAnyhow, are you going to do something special for this next update?? After all, it is .90.0. 90 is 65 more than 25.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve got something in mind, but the update dropped about a week too early. Given the issues with \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Estruts and\u003C/span\u003E fuel lines I\u0027m going to go ahead a finish what I\u0027ve got started in 0.90 instead of 0.25, as I don\u0027t want to have to do it 3 times. (Even with a particularly ugly RSS/KSCSwitcher bug that doesn\u0027t provide itself an obvious fix. Yet we\u0027ll get to that when I get to it, and the RSS team might get to it first anyway. They know their code better than I do. May even be my own fault, though I didn\u0027t change the code so much as make it stand-alone.) \u003C/p\u003E\u003Cp\u003EWhat I won\u0027t get to are the 0.90 features, at least until I\u0027m done with what I had planned to do in 0.25. Then we\u0027ll have some fun. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T22:21:25Z\u0022 title=\u002212/17/2014 10:21  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-12-22T00:36:08Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EAd Lunam - Departures\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 76, day 403 - Surface of the MÃƒÂ¼n\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141209_ksp0421_hawk.jpg\u0022 alt=\u002220141209_ksp0421_hawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnny jetted to the top of the Arch and wobble-walked over to where Herhat was standing. Herhat was leaning over the edge cautiously, looking down at their landing site several hundred below. \u0022Hey, Herhat. Nice view from up here huh?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah! He leaned back carefully and pointed behind them to the smaller crater. \u0022There\u0027s flat space over in the middle of that crater, which lends itself to being a good place to build a base. And the pass over here\u0022 he pointed to the East \u0022would give us easier access to the large East Crater. This could be the best spot on the MÃƒÂ¼n.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well, that\u0027s something for you ing-gah-neers to dream up. I just fly. Speaking of which, it\u0027s time we get going.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Awww. Already?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Don\u0027t worry dude, we\u0027ll be back here soon enough. But if we wait any longer we\u0027ll miss our window. If Enlan has to orbit again it would make it impossible for a daytime reentry at KSC. And I don\u0027t particularly want to land in the desert.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141209_ksp0423_hawk.jpg\u0022 alt=\u002220141209_ksp0423_hawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnny and Herhat floated down to their lander, took a few extra surface sample souvenirs to give to their friends back home, then locked up the hatch for the ascent. Anny was just getting the engine primed when the Hawk\u0027s command module crept over the horizon and into radio range. \u003C/p\u003E\u003Cp\u003E\u0022You two ready to come home yet?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Never!\u0022 Anny looked back to make sure Herhat was strapped in. He seemed to have relaxed after the landing, so Anny decided not to mention how difficult the ascent would be with them sitting this close to the Arch. \u0022Herhat seems to think we should start a base down here, but we\u0027d run out of snacks before we got very far. Anything you want us to grab at the MÃƒÂ¼n store before we launch? Some dusty cheese perhaps?\u0022\u003C/p\u003E\u003Cp\u003E\u0022No, we\u0027re good here. See you in a few.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141209_ksp0429_hawk.jpg\u0022 alt=\u002220141209_ksp0429_hawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ascent was more difficult than planned. First, there was the giant Arch to avoid. Then, just to the west are two very tall crater rims, preventing launching upwards and turning directly to the horizon. The Arch was avoided by leaning to the south. The first crater rim was missed by a scant dozen meters, and the second by only a couple hundred. The Grand Arch might be an attractive site for a base, but the retrograde ascent left much to be desired. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141209_ksp0436_hawk.jpg\u0022 alt=\u002220141209_ksp0436_hawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rendezvous occurred just at the edge of sunset, and Anny was glad the engineers on Kerbin decided to include a spotlight on the lander. Just a minute later and they would have been docking in the pitch black nothingness. They transferred all their rocks and samples over to the command module, moved the monoprop too, and set about returning home.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141209_ksp0442_hawk.jpg\u0022 alt=\u002220141209_ksp0442_hawk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYet another successful MÃƒÂ¼n landing.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EYear 76, day 403 - Gene\u0027s Office, Cape Kerbin\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003E\u0022Heck of a show your boys put on today Gene.\u0022 Following Anny, Herhat and Enlan\u0027s departure from the MÃƒÂ¼n, Gene, Wernher, Senator Robert Kerman and one of his aides had retreated to Gene\u0027s office. \u0022And that old wreck they found? Mighty fine sight. Should drum up some reeeal support from those crazy archeologist and history types.\u0022\u003C/p\u003E\u003Cp\u003E\u0022The day\u0027s not over yet, Senator. Still have to get them safely back to Kerbin. And then it\u0027s right back to the hustle. Hawk 2 should be ready in a little under two MÃƒÂ¼nths time.\u0022 That would give them ideal lighting at the next set of coordinates. As ideal as could be asked so close to the south pole.\u003C/p\u003E\u003Cp\u003E\u0022About that. Gene, I was talking with Von Kerman here about our plans. This Hawk rocket is mighty impressive. Looks like it could lift a whole mountain out of a pile of gunk without breaking a sweat. Perfect for the Duna mission.\u0022\u003C/p\u003E\u003Cp\u003EGene glanced back and forth quickly between Wernher and the Senator. \u0022What Duna mission?\u0022\u003C/p\u003E\u003Cp\u003E\u0022The one Wernher has all cooked up. Seeing as we\u0027ve been to the MÃƒÂ¼n now, and seeing how these rebels are taking aim at the Red Planet, we thought it best to accelerate the Osprey program. Get it ready to go so it\u0027s ready when we go.\u0022\u003C/p\u003E\u003Cp\u003EWernher nodded, then pushed his glasses back up. \u0022We think we\u0027ve devised a configuration that will allow the Osprey to be launched by three Hawks. We can assemble all the pieces at the Falconaerie, which will itself be launched atop a fourth Hawk. Planning to build four more of these somewhat ironically makes them all less expensive....\u0022\u003C/p\u003E\u003Cp\u003EGene interrupted. \u0022Why would we divert a Hawk we have ready for the next MÃƒÂ¼n landing for some ship that isn\u0027t under construction yet?\u0022 Gene pointed at Wernher \u0022And what\u0027s this talk of the Falconaerie? I haven\u0027t even approved that yet!\u0022\u003C/p\u003E\u003Cp\u003E\u0022We\u0027ve already started training the crews for the Falconaerie. It\u0027s construction is inevitable....\u0022\u003C/p\u003E\u003Cp\u003E\u0022If we\u0027ve got the money for it!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Boys,\u0022 the Senator put his hands up and stopped both of them. \u0022Look, I\u0027m sure you can get the logistics all wrankled out. All I can say is, if you set to work on this Osprey first, and put the MÃƒÂ¼n nonsense aside until next year sometime, then we\u0027ll gladly cover the costs. Both for the Osprey and your little Falcon pet project. We don\u0027t want a bunch of ungrateful lawless rebels beating us to Duna, now do we?\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EMunlit Silence Science Module Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 76 day 414 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0207_munlitscience.jpg\u0022 alt=\u002220141129_ksp0207_munlitscience.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne last major piece to add to the Munlit Silence before the crew arrives: The science module. The science payload for the first Gauss Program mission consists of three landers and a small satellite. The satellite itself forms the armature for the three landers, and will likely be deorbited once the landings are complete.\u003C/p\u003E\u003Cp\u003EThe landers will be remotely operated by crews aboard the Munlit Silence as it passes through the Jool system, avoiding the sizable delays due to network propagation and speed-of-light communication limitations. All three landers are intended for Laythe, and will target three different locations on the planet. Locations that will have to be chosen once the Munlit Silence is close enough to the moon to make observations of its surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0219_munlitscience.jpg\u0022 alt=\u002220141129_ksp0219_munlitscience.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELaunching and rendezvousing with craft in an inclined orbit has become second nature by this point, and this launch was no exception. Once rendezvoused with the Munlit Silence, the upper stage of the science package was jettisoned, and the payload moved in on RCS alone. Now, all we need is a crew. (And a communications satellite... more on that in a bit.)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EYear 76 day 417 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003EIt wasn\u0027t a big crowd, but it was an important one. Every active kerbonaut and every member of the grounds and engineering crews that weren\u0027t busy had gathered at the flag behind the Astronaut Complex. Milzer looked around those gathered, the crew of the Munlit Silence in the center, Jeb, Bill and Bob to the left, and all those Milzer would be taking with him to Duna flanking the lot of them. He stepped forward and spoke as loud as he could.\u003C/p\u003E\u003Cp\u003E\u0022Thanks for coming. Today we\u0027re here to send our friends off for Jool. To say goodbye for what may be the longest journey of their lives. Jebediah has told us that in days of old, the commander of a mission would plant a flag before they left, and reclaim it once they had safely returned to Kerbin. Today we renew the old in more ways than one.\u0022\u003C/p\u003E\u003Cp\u003EShepgee walked forward and drove a flag into the well-tended turf. An unfamiliar flag unfurled and revealed itself to the assembly. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141212_ksp0518_flagception.jpg\u0022 alt=\u002220141212_ksp0518_flagception.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMilzer continued. \u0022There was once an organization dedicated only to the discovery of the unknown. A society of heroes that flew no flags but its own, honored no kings, and was tasked with the unimpeded exploration of our planet. Kerbals from all lands were welcome to join in their goal, and together they uncovered the many mysteries of Kerbin. This was not their flag.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Later, with all corners of our tiny planet found and mapped, this company of heroes turned their eyes upwards and took to the stars. Many wonders and mysteries awaited, but their greatest challenge would be here on Kerbin. Interference from the government following The War and the Unification led to their eventual demise. And yet this was not their flag.\u0022\u003C/p\u003E\u003Cp\u003E\u0022We may launch from the beaches of the Free States, the sands and steppes of the Commonwealth, or from the mountains and badlands of the League of Eight. Yet we are not an extension of those nations. We are those who explore, we are those who uncover what is hidden. And this is our flag.\u0022 \u003C/p\u003E\u003Cp\u003E\u0022For this we have both Haloly and Jebediah to thank. Jebediah, who provided a flag from the old heroes society. Haloly, who updated it to show the endless recursion of time. From this day forward we fly only this flag.\u0022 \u003Cspan style=\u0022color:#FFFFFF;\u0022\u003E[Flagception]\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u0022Yet let\u0027s not forget why we\u0027re here. Before us is the brave crew of the Munlit Silence, the first expedition of the Gauss Program. Tomorrow they leave on the longest trip we\u0027ve yet attempted, on a ship as yet untested. These are our new heroes and our new explorers. So let\u0027s bid them a fond farewell, and send them off with a party they\u0027ll never forget!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141212_ksp0521_flagception.jpg\u0022 alt=\u002220141212_ksp0521_flagception.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe crew gathered for a series of mission photos, and the press office (still in their hazmat suits) selected the above. Presenting the crew of Munlit Silence for the Gauss 1 mission to Jool, from left to right: Hudrim, Laning, Dean, Neilny, Lodbles, Shepgee, Shepdas, Haloly, Sheptrey, Sigsey, Podzon, and Loald Kerman.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EHydra Shuttle Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 76 day 418 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003EShepgee checked his carry-on bag one last time. He tended to travel light, but it would be hard to turn back if he forgot something this time. Clothes? Check. Six years worth of toothbrushes? Check. Ear plugs for when Haloly would start on one of his long-winded and oft-repeated tales of bravado and impossible odds? Check. Special Agent Kirrim novels? Check. Even a new one that had yet to be published, smuggled to him by Ian Kerman himself in true spy fashion.\u003C/p\u003E\u003Cp\u003EHe wondered for a moment what Haloly himself was packing, then decided he didn\u0027t want to know. Probably lots of stinky cheese. He zipped up the bag, slung it over his shoulder, and made his way to the tunnel. Milzer and Meldo were waiting for him.\u003C/p\u003E\u003Cp\u003E\u0022M\u0026amp;M, old buddies! Seems we can never be in the same place for very long, doesn\u0027t it?\u0022\u003C/p\u003E\u003Cp\u003E\u0022No, Shep. Guess not.\u0022 Milzer shook Shepgee\u0027s hand and patted him on the shoulder, Meldo gave him his characteristic wave.\u003C/p\u003E\u003Cp\u003E\u0022I\u0027m leaving the two of you in charge around here until we get back, ok? Or until Gene and Wernher show up. If something happens...\u0022\u003C/p\u003E\u003Cp\u003EMeldo interrupted. \u0022Nothing is going to happen, Shep. We\u0027ll all be fine.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I wish I was as confident, Meldo. Anyway, if something happens, tell everyone to go for the Coalition lands. They were building a spaceport too, and I\u0027m sure they\u0027d welcome a group of highly trained and experienced space kerbals with open arms. Probably even let you fly if you ask nicely.\u0022 Easier to do now that the Coalition had joined the League in their rebellion. The Unified Government was quickly becoming a misnomer. \u0022Say hi to Duna for me, ok? First time we\u0027ll go someplace new and I won\u0027t be along for the ride.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Of course dude. Don\u0027t get too close to the jolly green giant. I hear he has bad breath.\u0022\u003C/p\u003E\u003Cp\u003EMilzer and Meldo walked with Shepgee to the end of the tunnel, where a cart was waiting to take him the rest of the way to the Hydra. The Hydra Shuttle was no small thing, and was waiting quietly on the launchpad, condensation glistening in the predawn air. Shepgee tossed his bag on the cart and turned back to say his final goodbyes. Then he was off.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0224_hydra.jpg\u0022 alt=\u002220141129_ksp0224_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EShepgee rode the elevator to the top of the tower [missing, as I was still playing on the Mac at this point and didn\u0027t have the RAM for such frivolities as FASA launch clamps], walking alone to the open hatch where the last of the grounds crews were waiting. There was only a single entry point for the Hydra, the primary crew access hatch. From there one had to climb into their cabin and into their seat. Nothing too difficult for an acrobatic species such as the kerbals.\u003C/p\u003E\u003Cp\u003EShepgee stowed his bag in the beside-head compartment, sat down into his chair and strapped in for the ascent. There were only twelve of them going up, less than a third of the Hydra\u0027s capacity, so each of them had their own row and window seat. Shepgee glanced back to find Loald asleep. He couldn\u0027t blame him, having to wake up at Oh-dark-thirty just to prepare for the launch. \u0022The ship sets the time,\u0022 Milzer had said, \u0022not us. Were it up to me we\u0027d all be launching from the equator into zero degree orbits. Maybe then we\u0027d get some sleep.\u0022\u003C/p\u003E\u003Cp\u003EHe barely noticed the launch. The Hydra was designed for regular passenger transport to space, and Jebediah and his crews had built in a slick suspension system to lessen the shock of liftoff. Even the roar of the mighty Alnair Launch Vehicle was deadened by insulation. Really a top-notch craft, this Hydra. Shepgee could hardly believe it had been siting in a junk yard for twenty years or more. Just more proof of how much they\u0027d lost.\u003C/p\u003E\u003Cp\u003ESomewhere over the lake the six Tantares boosters separated from the ALV core and the dull roar became an empty quietness. Shepgee was watching the sunlight creep over the mountains, painting their tops with the blessed light of Kerbol. It was the last time he\u0027d see such a sight for more than half a decade.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0233_hydra.jpg\u0022 alt=\u002220141129_ksp0233_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd before he knew it, they were in orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0240_hydra.jpg\u0022 alt=\u002220141129_ksp0240_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Hydra launch had been timed perfectly, as they didn\u0027t want to leave the crews in orbit for a long time waiting to catch up to their target. Loald had managed to sleep through the entire ascent, awaking only when the Hydra fired its thrusters to match speeds with the Munlit Silence. So far the trip had been automated, but this last step would require the hands of a kerbal: docking. Shepgee made his way down from his seat to the crew compartment, glancing out of the window to catch a view of the Munlit Silence. Somehow it seemed smaller than the Hydra.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0245_hydra.jpg\u0022 alt=\u002220141129_ksp0245_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe strapped into the pilot\u0027s seat and brought the RCS system online. Lots of shiny doodads and slick flat screens lit up, each with a different camera view. Shepgee would have preferred a window and a targeting sight to all this technowizardry, but figured Jeb knew best when it came to advanced controls. This was a considerable step up from Jeb\u0027s usual quality, such a series of old ropes tied to a pulley at the bottom of the capsule that usually opened the parachute but occasionally only opened the hatch. Shepgee oriented the Hydra to align with a docking port on one of the Munlit Silence\u0027s arms. Nothing to do now but wait until the Hydra had drifted into position.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0247_hydra.jpg\u0022 alt=\u002220141129_ksp0247_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Hydra had been designed to dock directly with a specially-aligned set of three docking ports. Such an arrangement would allow the shuttle\u0027s 24 passengers to disembark much faster. No such triple-docking ring existed on the Munlit Silence, so Shepgee chose one of the three ports at random to control from. He fired up the incredibly bright spotlights, cancelled his lateral motion, and pushed the Hydra forward with a quick jet of RCS. A soft welcoming chime sounded to indicate his distance from the target. He couldn\u0027t help but think he was flying technology hundreds of years more advanced than the simple lander he had used to touch down on the MÃƒÂ¼n.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0256_hydra.jpg\u0022 alt=\u002220141129_ksp0256_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA soft bump and they were docked up with the Munlit Silence: Their home for the next six years. That was when Shepgee decided the Hydra really was the larger of the two craft. A shame they couldn\u0027t take it to Jool instead.\u003C/p\u003E\u003Cp\u003EThey spent the next several orbits getting the crew and all their possessions transferred into the Silence. Once they were sure they had everything, Shepgee remotely piloted the Hydra into a station keeping orbit a safe distance away. It would remain there until they were certain the Silence was ship-shape, after which it would transition into a higher orbit for later recovery.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141129_ksp0264_hydra.jpg\u0022 alt=\u002220141129_ksp0264_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETransfers done, Shepgee moved to his cabin. With such limited space on board the Silence they were each arranged three to a cabin. He had the good fortune of sharing his with Haloly and Neilny, which didn\u0027t present many opportunities for peace and quiet on the long trip. He settled into his chair, pulled the new Agent Kirrim novel from his bag, and wondered how Blofeld Kerman and his minions would try to destroy Kerbin this time.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003ETowed-Antenna Array Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 1 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003EI thought I was done with the launches for the Munlit Silence, then I started thinking about the mechanics of a space vessel that is always rotating. The intent for ships like the Silence is to rotate the entire vessel about the Z-axis, creating a scant amount of centrifugal \u0022artificial gravity\u0022. This reduces complexity by not needing to keep the rotational part attached to the static part of the ship through the use of a collar or bearings, and removes the obvious issue of getting between the two parts. It also reduces physical stress on the entire body. The one downside comes from things that need to stay pointed in a specific direction, such as antennas or solar arrays. I resolved the power issue by using only OX-STAT panels or a small amount of RTGs, but I needed another solution for the communications issue. \u003C/p\u003E\u003Cp\u003ESubmarines and other seafaring vessels make use of something called a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Towed_array_sonar\u0022 rel=\u0022external nofollow\u0022\u003ETowed Sonar Array\u003C/a\u003E. This allows the sonar to be distant enough from the main vessel that noise pollution from said vessel is easier to cancel out. I decided a similar solution would work for my centrifugal ships. Minus the kilometers-long tow cable, of course.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141213_ksp0536_taa.jpg\u0022 alt=\u002220141213_ksp0536_taa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Towed Antenna Array was launched atop an LV-01 Anaximander, the oldest and most-used launch vehicle in my arsenal. Designed to be autonomous, the TAA features its own Reaction Control System, has two long-range Communicatron 88-88 dishes, and four omnidirectional C-16s for relay with the Silence. An integrated RTG allows for operation anywhere, though with its low power it prevents continuous high-bandwidth communications. So no streaming from KerbTube and no online MÃƒÂ¼nCraft for Shepgee and Co. while out at Jool.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141213_ksp0539_taa.jpg\u0022 alt=\u002220141213_ksp0539_taa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot by accident, the drive section of the Munlit Silence features a Jr.-sized Docking Port nestled up between the NTRs. Not the most comfortable place to dock, and probably a bit warm during burns, but it\u0027ll suffice for something simple like the antenna array. While in transit, the array will undock and distance itself from the ship anyway, so the close-confines of the Silence\u0027s backend aren\u0027t much of a concern. Still a bit unnerving.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141213_ksp0542_taa.jpg\u0022 alt=\u002220141213_ksp0542_taa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd now, finally, the Munlit Silence is all kitted-out and ready to go.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EFalconaerie Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 4 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003EMeanwhile, back on the other side of Kerbin, Gene and Wernher were getting ready to launch their first real space station. Yet another Hawk, this time with a large and bulky payload that will never go beyond Low-Kerbin Orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0550_falconaerie.jpg\u0022 alt=\u002220141214_ksp0550_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ascent was easy despite the station\u0027s length. The single Hawk was more than enough to place it into a station orbit, and there wasn\u0027t much in the way of excess wobbling. Struts really help in that department.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0555_falconaerie.jpg\u0022 alt=\u002220141214_ksp0555_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDesigned specifically as a home for the small 2-kerbal Falcon craft (thus the name), the Falconaerie features four Jr.-sized docking ports, accommodations for eight kerbals, a detachable lab, and two regular-sized docking ports on each end of that station. Expansion nodes in the middle will allow the inclusion of a large solar array once those are unlocked in the 19th\u0027s tech tree. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0557_falconaerie.jpg\u0022 alt=\u002220141214_ksp0557_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut what\u0027s a station without a crew?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EFalcon 3 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 10 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003EDudry and Lanlock were selected as the first crew for the Falconaerie. Dudry, as he was to be the commander for the upcoming Duna mission, which would be assembled at the Falconaerie. Lanlock, because rookies need to fly too. Yet another perfect launch for what is fast becoming one of my favorite small US-styled crafts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0565_falcon3.jpg\u0022 alt=\u002220141214_ksp0565_falcon3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEvery now and then KSP is nice and a rendezvous occurs on the daylight side. (No, really, I\u0027d like to think I planned all these encounters, but I usually just take what\u0027s given.) Dudry is pretty much an old-hat at docking by now, so he took over from the IVA and brought them in to one of the ports on the back of the station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0573_falcon3.jpg\u0022 alt=\u002220141214_ksp0573_falcon3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe one downside of using Jr.-sized docking ports is crews have to EVA over to the station. I\u0027d change it if I thought they minded, but they generally seem to enjoy EVA. And weightlessness. And being stranded in space.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0577_falcon3.jpg\u0022 alt=\u002220141214_ksp0577_falcon3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EFalcon 4 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 12 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ETwo days later and the next Falcon was ready for the next crew. This time Geneble and Enlan took the honors. Enlan because his Hawk 2 landing was scrapped, leading to his transfer to the Osprey, Geneble because rookies need to fly too. Yet another daytime launch, yet another beautiful ascent. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0581_falcon4.jpg\u0022 alt=\u002220141214_ksp0581_falcon4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis time the rendezvous occurred on the night side, with docking taking place just at sunrise. The station suddenly jumped out of the shadows, backlit by the sun and its rays refracting through Kerbin\u0027s atmosphere. That gave me quite a shock, as I hadn\u0027t thought I was as close to the station as I actually was. Near-disaster averted.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0588_falcon4.jpg\u0022 alt=\u002220141214_ksp0588_falcon4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese two got to dock at the front of that station, completing the docking and the EVA with no issues at all. That left the station as below, looking like some sort of giant space-hammer, ready to strike at its foes and pound the forthcoming Osprey into shape. Or something like that.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0594_falcon4.jpg\u0022 alt=\u002220141214_ksp0594_falcon4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EMunlit Silence / Gauss 1 Departure Burn\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 35 - Low Kerbin Orbit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003EShepgee and Haloly were both in the central core of the Silence for its burn for Jool. Haloly was busy checking the orbital calculations one last time, Shepgee was keeping the ship aligned on their departure vector. They were burning from a high enough orbit that they would be able to complete the departure burn in one go without intercepting Kerbin\u0027s atmosphere, and the Silence had more than enough muscle to complete it in a short enough time.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0595_munlit.jpg\u0022 alt=\u002220141214_ksp0595_munlit.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EShepgee watched the MÃƒÂ¼n drift past the cabin window as he was aligning the ship for the burn. He contemplated the beauty of the scene, their vessel floating in the silent void around Kerbin, lit by the soft light of the MÃƒÂ¼n. \u0022Do you think we\u0027ll find anything as interesting and beautiful as our own MÃƒÂ¼n when we\u0027re out at Jool?\u0022\u003C/p\u003E\u003Cp\u003EHaloly, engrossed in verifying his calculations, answered without looking up. \u0022If we do, it better have cheese. I\u0027m still disappointed about the MÃƒÂ¼n\u0027s distinct lack of cheese.\u0022\u003C/p\u003E\u003Cp\u003EThe navigation system blared at him. Not the soft, reassuring notes of the Hydra, but instead a harsh, cheaply-built buzzer. He looked over to Haloly, who gave him a confident nod, watched as the last seconds ticked down, then gently pushed the throttle forward. The ship started to creak as the four Nuclear-Thermal Rockets came online, producing nearly a half-G of acceleration. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0596_munlit.jpg\u0022 alt=\u002220141214_ksp0596_munlit.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Glad we didn\u0027t try this with the ship rotating!\u0022 Haloly shook his head and acted like he hadn\u0027t heard him. The vibrations and noise in the cabin were bad, but not that bad. If the ship could survive twelve more minutes of it, then they\u0027d be well on their way for Jool.\u003C/p\u003E\u003Cp\u003E\u0022We\u0027re going to have one small course correction, somewhere out beyond the asteroid belt.\u0022\u003C/p\u003E\u003Cp\u003E\u0022How bad?\u0022 \u003C/p\u003E\u003Cp\u003E\u0022Ehhnnn.\u0022 Haloly shrugged. \u0022I\u0027ve seen worse. The burn Thabit made to align with Moho was in the same ballpark. Nothing we can\u0027t handle.\u0022 Haloly took the opportunity to unstrap and walk over to Shepgee. Twelve minutes of half-G was the most they\u0027d feel for several years. The best the rotation of the Silence could achieve was a little over a tenth of a G. Enough to make things fall, not enough to be completely comfortable. Haloly handed his notepad to Shepgee. \u0022We\u0027ve even got enough delta-V to complete a capture at Jool, possibly Laythe.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Enough to make it home afterwards?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Assuming we leave the landers and the rest of the science package in the Jool System, yes. I may have over-engineered our drive section a little bit.\u0022\u003C/p\u003E\u003Cp\u003ETheir burn lasted through the night, the main engines cutting out just as they escaped into the daylight. Haloly made some quick calculations and decided he was happy with it. \u0022Time to get this thing spinning. You want to do the honors?\u0022\u003C/p\u003E\u003Cp\u003EShepgee shook his head. \u0022Nope. This whole thing was your idea. Have at it.\u0022 He unstrapped and floated over to the ladders for the starboard side of the ship. \u0022I\u0027ll make sure everyone is still strapped in and ready.\u0022 Shepgee had barely finished climbing up the ladder before Haloly fired the rotational RCS thrusters. Up suddenly became down. He dropped into the starboard common room, finding four kerbals trying to stand in the weird rotation. Neilny seemed to be having a particular amount of fun, bounding about like a superkerb. Shepgee smiled, climbed back up into the connecting tube, and went into his cabin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141221_ksp_munlit.gif\u0022 alt=\u002220141221_ksp_munlit.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe spent some time there, watching Kerbin and the MÃƒÂ¼n slink away in the spinning darkness. He thought how simple and serene Kerbin looked as it twisted away. None of the wars or squabbles or fights were apparent from up here. He thought of something Lem had told him once. How kerbals were not naturally violent, and had instead brought violence back with them from the heavens as a form of penance for their sin of leaving Kerbin. \u003C/p\u003E\u003Cp\u003EAnd yet of all Shepgee had seen in space, none of it had been violent. Silence, beauty, harmony, and the simple yet cold laws of physics were available in abundance. Space was peaceful to him, the emptiness of the void a reminder that even nothingness can be beautiful. If the violence found in the hearts of kerbals was something they brought from space, Shepgee had seen nothing of it. \u003C/p\u003E\u003Cp\u003EYet There was a certain loneliness to the sight of Kerbin slinking away. Every kerbal he had ever known was down there, on that small dot receding into the inky black darkness. All except the twelve of them, bound for the distant reaches of Jool. If something went wrong, there was nothing any of the several billion kerbals below could do to help. If there was some violent entity out amongst the dust and the void, they would have to face it alone. They were at the mercy of physics and its cold, harsh judgments now, slipping silently through the nothingness that filled everything. \u003C/p\u003E\u003Cp\u003EHe was glad to be among friends. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141214_ksp0653_munlit.jpg\u0022 alt=\u002220141214_ksp0653_munlit.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EEnd Kerbal Space Program \u0022Alpha\u0022 0.25\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:19:09Z\u0022 title=\u002206/21/2015 10:19  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-12-22T00:43:38Z","Content":"\n\u003Cp\u003EBonus photo: An old-school \u0022All Helmets\u0022 meeting from when I was setting up the flag planting scene on an install without Texture Replacer.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141213_ksp0506_allhelmets.jpg\u0022 alt=\u002220141213_ksp0506_allhelmets.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:19:26Z\u0022 title=\u002206/21/2015 10:19  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2014-12-23T02:14:14Z","Content":"\n\u003Cp\u003EHave you officially been able to get your save file working with .90 yet?\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-12-23T03:29:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003EHave you officially been able to get your save file working with .90 yet?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis save? For the most part, yes. I still have two ships with fuel lines that I probably won\u0027t fix, one of them the Munlit Silence, the other the Hydra. The Hydra will be coming in to land soon, and the Silence can manage. It\u0027ll probably see an update to its drive section once it makes it back around to Kerbin anyway. \u003C/p\u003E\u003Cp\u003EStill having issues with the \u0022Can\u0027t click on the Tracking Station when using Real Solar System\u0022 thing, but that seems to be a known issue now. (It feels like the hitbox for the tracking station and other afflicted buildings aren\u0027t being moved along with the rest of the KSC PQSCity.) So I\u0027ll have to fight around that for a bit, or I might just make a quick plugin that sends me to the Tracking Station if I hit a certain key (\u0027m\u0027 comes to mind). Otherwise my other mods all either recompiled well, or have been updated to fix the new things (unlockables!) or lack of old things (SPH!) in 0.90. (Oh, and the Timewarp Rotation Fix, which I need to figure out how the new SAS/RSAS stuff works before that\u0027ll get fixed. Unless its maintainer reemerges and fixes it first.)\u003C/p\u003E\u003Cp\u003EMy old \u0022Unity\u0022 (0.18.3 Demo up through Null Cycles) save? Not a chance. It at least loads now (after I delete all the kerbals - that\u0027s been the case since 0.24), and seems to have a few other bugs. And about 3,000 fuel lines. So, yeah. Not really upset over that anyway, since I just keep it around as a museum.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-23T03:35:55Z\u0022 title=\u002212/23/2014 03:35  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 23, 2014\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-12-23T07:24:03Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EÃ¢â„¢ÂªJingle Jeb, Jingle JebÃ¢â„¢Âª\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/20141223_ksp0271_jinglejeb.jpg\u0022 alt=\u002220141223_ksp0271_jinglejeb.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EComing soon... ...ish... Maybe even tomorrow! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-12-24T08:52:10Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EA Kerbal Holiday: An Inter-Release Interlude\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EDeruki remembered. It was many years ago and he was still a very young kerbal, but he remembered. He had been in the far north of the Desert Continent with the rest of his class on an extended field trip. They stopped to relax one afternoon when a loud roar engulfed them. Frightened and scared most huddled and hid, but only Deruki watched as a mighty beast leapt over the hills and into the sky atop a column of fire. \u003C/p\u003E\u003Cp\u003EHis teacher, Sensei Bo, had told him what the fire was, how it carried many kerbal into the void beyond the sky. Deruki was hooked at once. Yet that was the last such sight he had seen, for rockets never launched from the Forgotten Islands, so southern and so remote. \u003C/p\u003E\u003Cp\u003ESo it was to his great surprise when he awoke late one night to the sound of that roar of the remembered beast. He rushed to the window, threw on some clothes, and sprinted out into the cold night. There, atop a magical launchpad on the edge of town, stood a mighty seven-legged beast, dimly lit in the cool evening light. Around it danced his Sensei Bo, hair and clothes burned, hopping about and screaming \u0022It worked! It worked! Ha ha! It worked!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0325_fuji.jpg\u0022 alt=\u002220141224_ksp0325_fuji.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen Deruki asked him where he had found the beast, Sensei Bo started waving around a thick book, smoke trails spiraling off into the night air from its still smoldering pages. \u0022It came in the post! Mail-order rocket parts! Who knew?! Ha ha!\u0022 Quite mad, that sensei of his. \u003C/p\u003E\u003Cp\u003EThey climbed to the top of the mighty beast, where a small door opened and Jeysef, the local repairkerb emerged. Sensei Bo handed them both helmets, led them inside, and helped them strap in. \u0022If anything breaks, Jaysef will fix it. Here!\u0022 he tossed the catalog on Deruki\u0027s lap. \u0022In case you need to order something. They deliver! Ha ha!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Wait! What do I do?\u0022\u003C/p\u003E\u003Cp\u003E\u0022You go up aways, go sideways aways, and then don\u0027t come down. Easy!\u0022 He slammed the hatch shut only to open it again a few moments later. \u0022I almost forgot! Play this when you reach space! And good luck!\u0022 \u003C/p\u003E\u003Cp\u003EDeruki looked at the tape. \u0027Holiday Mix Vol 1\u0027. He slipped it inside his suit just as the beast roared to life and shot off into the night. Deruki was scared as they climbed as he could hear part of the mighty beast falling off and disappearing into the night. He tried to ask Jeysef, but could hear nothing over the roar.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0331_fuji.jpg\u0022 alt=\u002220141224_ksp0331_fuji.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd then everything went quiet. The burned book his sensei had given him started to float upwards. Deruki unstrapped and did the same. Sweet, blissful freefall. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0334_fuji.jpg\u0022 alt=\u002220141224_ksp0334_fuji.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeysef turned to him and said \u0022We carry a special room behind us. A \u0027Space Dojo\u0027 your crazy teacher called it.\u0022 So he spun their little craft around, docked up and they both went inside. Inside, where it was all deocrated with various snacks floting about. Inside, where a radio and a tape player awaited. Deruki jabbed the tape in and pressed \u0022play\u0022.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EISC-A2-01 Launch - Southern Space Center\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0336_a2.jpg\u0022 alt=\u002220141224_ksp0336_a2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELodrigh and Newwin were awaiting liftoff in one the ISC\u0027s new Yarbrough-A2 crew shuttles when they first heard the music. A well known holiday tune about Spiders on Duna. Newwin listened for a few minutes then keyed the microphone. \u0022Hey uh, ground, are you getting this music too?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Affirmative, A2. We\u0027ve located the source. Rogue broadcast from a ship in a 45Ã‚Â° orbit. Incidentally, flight has just altered your mission profile. You are instructed to locate the source of the transm...\u0022 The ground controller went silent as the music switched to a voice message. \u003C/p\u003E\u003Cp\u003E\u0022Dojo Ichi and Sensei Bo invite you to a holiday party in the skies! Ha ha! No RSVP required, just drop in any old time! Bring your favorite snacks and join in on the fun!\u0022 The music returned shortly after, some unknown kerbal singing a catchy tune about an octopus holding eight candles. \u003C/p\u003E\u003Cp\u003ENewwin looked at Lodrigh and raised an eyebrow. \u0022Is this guy for real?\u0022 Lodrigh laughed. \u003C/p\u003E\u003Cp\u003E\u0022Ground, A2 actual. Request permission to attend a, uh, \u0027Holiday party in the skies?\u0027, over.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Permission granted, A2. Flight advises caution, as usual.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Somehow I don\u0027t think this is what we had in mind when we built a new space center.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0345_a2.jpg\u0022 alt=\u002220141224_ksp0345_a2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EDeruki wasn\u0027t sure at first what he was hearing, and then Jeysef handed him the radio. \u0022It\u0027s your ship, little one.\u0022 Deruki listened for a minute at the static, then heard the voice again.\u003C/p\u003E\u003Cp\u003E\u0022ISC-A2-01 calling unknown vessel. We are 20 meters above and behind you and moving in to dock.\u0022 The line went silent and Deruki was about to answer when they continued. \u0022This is the party, right?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0354_a2.jpg\u0022 alt=\u002220141224_ksp0354_a2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA few minutes later and Newwin and Lodrigh were aboard. \u0022Hey, we brought snacks! Delicacies form the Southern Coalition!\u0022 They looked around for a bit, took in the surroundings, then Newwin looked right at Deruki. \u0022Where\u0027s the tree, dude?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Tree?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah! Can\u0027t have a party without a tree! Hey, you\u0027ve got a catalog, right? Let\u0027s order one!\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003ETree Launch - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EGene and Carl were already talking about the broadcast when Wernher came running into his office. \u0022Did you see the order that just came in? For that very big tree-like thing with the green and the red and the...\u0022 and Wernher was out of breath.\u003C/p\u003E\u003Cp\u003E\u0022Wernher, come on in why don\u0027t you.\u0022 Gene motioned towards an open chair. \u0022Of course we did. Kind of hard to miss it. Carl here has some ideas.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0295_tree.jpg\u0022 alt=\u002220141224_ksp0295_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAn impossibly short time later they had a craft on the pad all fueled up and ready to go. It had taken one of the largest rockets they\u0027d yet built, with a peculiar set of accessory boosters. They had to ignore little things like air resistance and proper fairings, but hey - this was a high-priority job! The tree rose gently at first, lights and cables tinkling and clinking in the wind. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0305_tree.jpg\u0022 alt=\u002220141224_ksp0305_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey watched as the tree and its thousand lights flew off and to the NorthEast, only turning away once it had disappeared from sight. \u0022You know Wernher, it\u0027s amazing what a few hundred struts can do.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0315_tree.jpg\u0022 alt=\u002220141224_ksp0315_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u0022Hey! Look! The tree\u0027s here!\u0022 Lodrigh and Newwin both seemed to be the happiest kerbals in the world to Deruki, always grinning from ear to missing ear. Newwin darted across their small \u0022Space Dojo\u0022 and made his way back into their A2. \u0022I\u0027ll go out and sign for it, bring it over to you guys. See you in a bit!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0361_tree.jpg\u0022 alt=\u002220141224_ksp0361_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENewwin came bounding back in just as soon as Deruki had docked the Fuji and the Dojo up with the tree. \u0022Hey! Why don\u0027t we invite some more friends! Hand me the radio there, I know some folks!\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003ETantares Launch - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0371_tantares.jpg\u0022 alt=\u002220141224_ksp0371_tantares.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Tell me why we\u0027re doing this again?\u0022 Milzer really wasn\u0027t in the best of moods, and it had taken all the energy Meldo could muster to force him onto the Tantares.\u003C/p\u003E\u003Cp\u003E\u0022Because you need to get out of that control room! That beast of a starship will build itself and doesn\u0027t need you lording over every detail. Besides, I know these dudes. They\u0027re cool!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hmm.\u0022 \u003C/p\u003E\u003Cp\u003EMilzer\u0027s mood improved the instant they saw the station. \u0022Wow! Look at all the lights!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0393_tantares.jpg\u0022 alt=\u002220141224_ksp0393_tantares.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey wandered through the makeshift station\u0027s hub and down into the Space Dojo, introducing themselves, sharing snacks, drinking a bit much. The tiny space station was getting a bit crowded by then. Then somebody else saw the catalog. \u0022Say, why don\u0027t we order one of those new super-jumbo rooms?\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EParty Room Launch - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u0022They want a what now?\u0022 Wernher was clearly confused, flipping through his copy of the catalog quickly to find the large parts the order was referencing. \u0022I don\u0027t hink I have heard of such a part.\u0022\u003C/p\u003E\u003Cp\u003E\u0022That new Mark-3 with the 16 seats, right? Except kitted out for a party. Extra snacks even. I tell ya, Wernher, with the last two days worth of sales we might just break even.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ah! Here it is!\u0022 He put the catalog down and started reading from it intently. \u0022Except the insides are filled with blackness. Nothing at all. What a strange place for a party.\u0022 He shrugged. \u0022Oh well, it\u0027s what they want, ja?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0399_partyroom.jpg\u0022 alt=\u002220141224_ksp0399_partyroom.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u0022Hey, those guys really are fast!\u0022 Milzer was half hanging out of the orbital module of their Tantares, watching the lights play on the new Party Module as it docked up. \u0022We oughtta have them build some of our stuff!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0406_partyroom.jpg\u0022 alt=\u002220141224_ksp0406_partyroom.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeldo pulled him pack inside and closed the hatch. \u0022Hey, why don\u0027t we invite those two dudes that landed at Shepgee\u0027s Arch?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oooh. And Jeb, too! Or is he too old for parties like this?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Pfft. Jeb\u0027s never too old!\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EFalcon Launch - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0416_falcon.jpg\u0022 alt=\u002220141224_ksp0416_falcon.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnny slammed the throttle forward and hit the ignition. A holiday party in the sky? What could be better? He smiled over at Herhat, who already looked like he\u0027d had a bit too much eggnog. \u0022Hey! I thought you inggahneer types could slam that stuff down? Isn\u0027t there some scale for solving problems based on it?\u0022\u003C/p\u003E\u003Cp\u003EHerhat just shook his head, holding his hands over the front of his helmet, turning increasing more green. \u0022I\u0027m fine\u0022 he tried to say.\u003C/p\u003E\u003Cp\u003E\u0022Yeah, sure ya are. How about you let me do the flying though, \u0027k?\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0454_tantares.jpg\u0022 alt=\u002220141224_ksp0454_tantares.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe station was really rocking now, with a good eight kerbals on board. Then suddenly everyone heard another ship dock. All eyes watched the hatch expectantly, waiting for Jeb or one of the B\u0027s to come bounding down the docking tube. Instead they were greeted by the gaping wide mouth of Haloly.\u003C/p\u003E\u003Cp\u003E\u0022Cheeeeeeeese!!!\u0022\u003C/p\u003E\u003Cp\u003EMilzer and Meldo were in shock, doubly so when Shepgee came smiling in after him. All he could do was shrug. \u0022He heard there was cheese. Turned the ship right around, said Jool can wait. Nothing I could really do to stop him.\u0022 He made the rounds, introducing himself to the new faces, the strange faces, and all the odd spacecraft docked outside. \u003C/p\u003E\u003Cp\u003E\u0022Say, where\u0027s Jeb?\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u0022Bob, for the last time, just leave it! Bill is waiting in the ship already!\u0022\u003C/p\u003E\u003Cp\u003E\u0022But I want to take a picture of everybody! Post it to KerbBook!\u0022 Bob was throwing things all over the place. Books, papers, clothes, you name it, all to find his phone. After a few minutes of searching something started to ring in his fightsuit pocket. \u0022Yeah?\u0022\u003C/p\u003E\u003Cp\u003E\u0022It\u0027s Jeb. You phone is in your hand. Now lets go!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0467_jebcraft.jpg\u0022 alt=\u002220141224_ksp0467_jebcraft.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBob was asleep already by the time they made orbit, phone floating casually out of his hand. Bill was about to hide it inside of the control panel when he caught sight of the station. \u0022Whoa. Jeb, you gotta come up here and see this.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0480_tree.jpg\u0022 alt=\u002220141224_ksp0480_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022See! It\u0027s just like I told Bob! Only one spot left!\u0022 He shook his head and slipped back down to his seat. \u0022Ok, bring us in Bill. I\u0027ll grab the snacks and gifts.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0488_tree.jpg\u0022 alt=\u002220141224_ksp0488_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Ho! Ho! Ho!\u0022 Jeb came barreling down into the party room with a bag of gifts slung over his shoulder. He made the rounds, apologized for being so late, and then handed out gifts at random to everyone. Some got spare batteries, others an extra LV-909. When he came to Deruki he grinned, winked, and gave him two packages. \u003C/p\u003E\u003Cp\u003E\u0022Why two?\u0022 \u003C/p\u003E\u003Cp\u003E\u0022One for you, one for your Sensei. Tell Bobbo I said hi.\u0022 Jeb started to turn away, but stopped. \u0022Oh, and don\u0027t lose the catalog!\u0022\u003C/p\u003E\u003Cp\u003EHe yanked the fake white beard off his chin, tossed it into a cabinet marked \u0022geckos,\u0022 and jumped upwards for the hatch. \u0022Ok boys, time to light the star!\u0022 That made everyone smile. Everyone except Bill and Bob, who both groaned in unison.\u003C/p\u003E\u003Cp\u003E\u0022Why us?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah, why not let three others go, Jeb?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Bah! C\u0027mon, ya old fogies! Suit up! No Kerbal tree is complete without the Kerbal Trinity atop it!\u0022\u003C/p\u003E\u003Cp\u003EBob made his way first, working cautiously through the girders and struts. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0495_tree.jpg\u0022 alt=\u002220141224_ksp0495_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill followed soon after, playing about with the lights and the fluff.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0503_tree.jpg\u0022 alt=\u002220141224_ksp0503_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb jetted forward, fearless and brave, and let nothing get in his way. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0529_tree.jpg\u0022 alt=\u002220141224_ksp0529_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThey each took their seats at the top of the tree. Jeb fly in front of Bill and gave him a mocking wave. \u0022Bill, you almost look like you\u0027re enjoying this.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Just get in your seat, showoff, so they can take the picture and let us go home.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0538_tree.jpg\u0022 alt=\u002220141224_ksp0538_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Wait, somebody is taking pictures of us? Who?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Not somebody Bob, but someThing. Didn\u0027t you know this was a party for the Kraken? All those nicely wrapped presents under the tree, just waiting to be torn into?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Really?\u0022 Bob\u0027s eyes grew wide. For a moment he was certain he saw something inky and black in the dark sky. \u003C/p\u003E\u003Cp\u003E\u0022Relax Bob, Jeb\u0027s pulling your leg. Right Jeb?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0543_tree.jpg\u0022 alt=\u002220141224_ksp0543_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Right?\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/holiday/20141224_ksp0557_tree.jpg\u0022 alt=\u002220141224_ksp0557_tree.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb turned to the two and said with a smile, \u0022Wouldn\u0027t it be cool if...\u0022\u003C/p\u003E\u003Cp\u003E\u0022NO!\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EDeruki awoke in his room, back safe and sound in his quiet Forgotten Islands. It was a happy dream, one that was fading quickly. That almost made him sad, until something in his room caught his eye. A book, lightly singed, with bright bright letters on the cover. \u003C/p\u003E\u003Cp\u003EA voice once strong seemed to whisper and fade off into the morning air. \u0022And don\u0027t lose the catalog!\u0022 Deruki smiled and grinned, his mind filling with grand ideas.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EMerry Christmas! Happy Holidays! Jumping Jebmas! Festivus Whateverus! I wish you all a happy and safe holiday, whatever you observe (even if you only observe the reduction in traffic and the bit of extra silence), and hope you\u0027ve enjoyed this strange and silly little story. Thanks for reading along this far, and I\u0027ll see you next year!\u003C/p\u003E\u003Cp\u003E(PS - Is anyone interested in the craft file of the tree?)\u003C/p\u003E\u003Cp\u003E(PPS - I\u0027ll probably proof-read this again in the morning. Sometimes English fails me after long days of C and makefiles.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-24T08:54:47Z\u0022 title=\u002212/24/2014 08:54  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 24, 2014\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2014-12-25T19:30:09Z","Content":"\n\u003Cp\u003ESo uhhh... was that canon? Also, new tantares parts, yeaaaaaahhhhh.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-12-25T19:42:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003ESo uhhh... was that canon?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHo, ho, no. Nope. Not really. Maybe. Sorta. Ok, no. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Besides - that\u0027s an 800 part tree I\u0027d rather not have in my main save. It\u0027s hard enough to keep KSP from randomly deleting craft, no need to almost double the file size to give the kraken more inspiration.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-02T01:49:32Z\u0022 title=\u002201/02/2015 01:49  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 2, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Railgunner2160","CreatedById":67181,"CreatedDateTime":"2014-12-28T11:09:34Z","Content":"\n\u003Cp\u003EHow is the alternating fairing color done?? Is it part of PF??\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-12-28T19:25:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Railgunner2160\u0022 data-cite=\u0022Railgunner2160\u0022\u003E\u003Cdiv\u003EHow is the alternating fairing color done?? Is it part of PF??\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s PF, sort of. I added a dark-grey fairing part and texture, then I set the fairing base to either 6 or 8 nodes. Then I place each fairing piece individually, alternating colors as I work around the craft.\u003C/p\u003E\n"},{"CreatedByName":"Railgunner2160","CreatedById":67181,"CreatedDateTime":"2014-12-29T04:01:23Z","Content":"\n\u003Cp\u003EAhh, thanks for explaining!!!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T11:21:19Z\u0022 title=\u002212/29/2014 11:21  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by Railgunner2160\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-01-02T01:45:47Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EKerbal Space Program 0.90.0\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EAd Lunam - Some Assembly Required\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 47 - Lake Fortunate Research Facility\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003EMilzer and Meldo had been at it for days. Every design they tried for launching Haloly\u0027s big new ship had ultimately proved impossible. Parts were either too wide for the fairings they had, or too heavy for the available launch vehicles. And there was the issue of the fuel tank for the ship\u0027s drive section.\u003C/p\u003E\u003Cp\u003E\u0022Look, Meldo, even if we had these Kerbodyne lifters we still can\u0027t get these components to orbit. They\u0027re just too big to be feasible. And we can\u0027t afford to build some exotic orbital construction yard.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ok, so what about these new guys out of the ISC? SpaceY? They\u0027ve got some heavy-lifters that should be able to handle the larger pieces.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Have we ever heard back from them?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well, they sent us a catalog. Here.\u0022 Meldo slid a thick, blue, slick-printed book across the table to Milzer. \u0022Big parts, high power engines. Really expensive, though.\u0022 Milzer started flipping through the catalog.\u003C/p\u003E\u003Cp\u003E\u0022Yeah, that\u0027s the problem here. Funds. Roots. The Silence wasn\u0027t exactly cheap, and sure, we\u0027ve got a bit put away, but nowhere near enough to cover...\u0022 he tossed the catalog back across the table, \u0022this.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ok, so let\u0027s take on a bunch of contracts.\u0022 Meldo jumped up and walked over to the contract pile, grabbing the first several off of the top. \u0022Here\u0027s one that offers more than a hundred-thousand advance for building a station around Moho.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Moho? How would we even do that in the year we have before we leave?\u0022\u003C/p\u003E\u003Cp\u003E\u0022We don\u0027t have to. The contract doesn\u0027t expire for another 49 years. We\u0027ll probably be long dead before anybody ever comes to collect on it!\u0022\u003C/p\u003E\u003Cp\u003E\u0022I don\u0027t know, M.\u0022 Milzer glanced through the papers Meldo had handed him. \u0022Some of these we could do now. Return science data from Minums? Monier 2 should be able to do that. Science data from the MÃƒÂ¼n? We could launch another probe.\u0022 He kept flipping through the pages. \u0022I see what you mean, though. Enough advances on these and we can finance this thing. Here\u0027s another one that\u0027s good for 40 years: Build a station in an inclined Solar orbit.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hey.\u0022 Meldo held up a strange contract that had already been stamped as \u0027accepted.\u0027 Who agreed to plant a flag on Eve?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Somebody really optimistic. Probably Haloly.\u0022 Milzer thought for a while. \u0022Ok, give me an exact cost for this Duna expedition and I\u0027ll see about finding the funds.\u0022\u003C/p\u003E\u003Cp\u003E\u0022And the Kerbodyne tanks?\u0022\u003C/p\u003E\u003Cp\u003EMilzer smiled. \u0022A little bird told me Gene has a present for us.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EBeta Get Ready\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAnd we\u0027re back, and this time in KSP 0.90.0. The transition to Beta hasn\u0027t been without small headaches, but all in all has gone well. The biggest problem I ran into was with KSCSwitcher in RSS, which now has a work-around that almost works... only crashes occasionally. (The code that repaints the terrain has a pretty big memory leak that I\u0027ve not tried to track down.) As a result the first batch of things I did in the new release were all from the traditional Kerbal Space Center, and thus part of the 19th KSA.\u003C/p\u003E\u003Cp\u003ERegarding the dual saves: I\u0027ve merged both persistence files together, adding up Funds and Science and copying all the ships from the 19th to the main save. Both had unlocked most of the same tech nodes (and mostly everything up to the top tiers), and I\u0027m at the point where every craft I launch will need to be copied over. So I decided to just save myself the headache and play from the same save again. This means contracts and funds are now shared, as well as tech tree unlocks, but oh well. I\u0027m assuming from here on out the two programs have the same tech-level, though parts restrictions are still in place. \u003C/p\u003E\u003Cp\u003EI\u0027ve lost a few satellites to failed / nerfed reaction wheels, one of them being the Towed Antenna Array for the Munlit Silence. I also decided to leave the fuel lines broken, and those two issues will be resolved in-story. Costs of using overly-advanced tech, if you will. Nothing can be done about the Silence now anyway, and upgrades for will have to wait until it\u0027s back home... in six years. It\u0027s a bit like using DangIt!, just with the stock game causing things to break instead.\u003C/p\u003E\u003Cp\u003ECrew assignments weren\u0027t too far off from what I had guessed or had written them into, so I\u0027m going to leave everyone where they are. Pretty much what you\u0027d expect from random chance. Some statistics: Of the 29 crew members of the 18th (old) program, 12 saw a change in employment, most of those being raw recruits that were unassigned anyway. Notables were Milzer and Neilny, who are both now scientists. (At least Shepgee and Haloly stayed the same.) Meanwhile, of the 10 crew members of the 19th (new) program, 8 saw a change. Notably: Anny is now a BadS scientist and no longer a BadS pilot, Herhat is no longer a very timid Ing-gah-neer and has become a very timid Pilot (irony). Dudry has become an Engineer. Other changes are noted above in the second post.\u003C/p\u003E\u003Cp\u003EI\u0027ve reinstalled a bunch of mods I was using in the past: DMagic Science, SCANsat, a few other smaller ones; basically everything except the mods that require Module Manager. I\u0027m also experimenting with Space-Y, as will be covered below, and some other detail and flair mods, many of which you won\u0027t see for another couple of updates. \u003C/p\u003E\u003Cp\u003EMeanwhile, most of \u003Cem\u003Ethis\u003C/em\u003E update is dedicated to assembling the ships for the two large Duna missions, so let\u0027s just dive right in.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EFalconaerie Solar Array Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 49 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Custom A2\u003C/p\u003E\u003Cp\u003EHeight: 36.4m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 80.4t\u003C/p\u003E\u003Cp\u003ECost: 71,069 Roots\u003C/p\u003E\u003Cp\u003EThe final major components planned for the Falconaerie are two large solar array armatures. These were needed before work could proceed on constructing the Osprey to ensure crews would have enough power to complete the fitting-out of the craft. Wrestling a giant tuning fork into orbit isn\u0027t always an easy thing, so I gave it a bit larger of a launch vehicle than it really needed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0570_falconaerie.jpg\u0022 alt=\u002220141224_ksp0570_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ERendezvousing with the Falconaerie was incredibly easy, considering all the other weird orbits I\u0027ve launched into lately. The launch was well timed and the payload was on-station just a short while later, ready for one of the crews to take remote control of its builder-bot and finish the installation. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0575_falconaerie.jpg\u0022 alt=\u002220141224_ksp0575_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhich of course started at sunset. Half of KSP happens in the dark, usually the interesting half. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0578_falconaerie.jpg\u0022 alt=\u002220141224_ksp0578_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDarkness doesn\u0027t make for interesting screenshots though, so I skipped around until sunrise. Here\u0027s the construction bot moving the first of the arrays in for installation on the central core of the station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0581_falconaerie.jpg\u0022 alt=\u002220141224_ksp0581_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA quick trip out to grab the other arm and the bot was back. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0584_falconaerie.jpg\u0022 alt=\u002220141224_ksp0584_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce the last of the solar arrays were installed the bot was parked and the arrays were extended. Now we\u0027re in business! Meanwhile the orbital stage that brought our giant tuning fork was deorbited, and recovered somewhere off the coast of KSC.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0589_falconaerie.jpg\u0022 alt=\u002220141224_ksp0589_falconaerie.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EOsprey Core Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 63 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Hawk\u003C/p\u003E\u003Cp\u003EHeight: 51.7m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 350.8t\u003C/p\u003E\u003Cp\u003ECost: 217,743 Roots\u003C/p\u003E\u003Cp\u003EThis was originally intended to be two launches, with the Core Stage and the Lab Module launched independently. Once I looked at the payload mass it only made sense to double them up and launch them atop a Hawk. And unlike some later launches it didn\u0027t look all that peculiar. (Sometimes I wish I had FAR to keep me honest.... I should probably be careful what I wish for.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0641_osprey.jpg\u0022 alt=\u002220141224_ksp0641_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA perfectly routine launch, following an ascent profile similar to the Hawk 1 mission to the MÃƒÂ¼n. The Osprey is to be the main expedition vehicle for the 19th KSA\u0027s similarly-named Duna mission. It has a long-duration crew capacity of 5, with an absolute capacity of 11, with room for 2 more riding uncomfortably in the lab and 3 more in the lander. The lab itself is intended to be a permanent installation at Duna, and will be left behind with the lander when the crew returns to Kerbin, so it\u0027s not advised to use them for crew transport.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0651_osprey.jpg\u0022 alt=\u002220141224_ksp0651_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother quick rendezvous. The orbital stage was jettisoned and deorbited once the craft was within the \u0022no-wake\u0022 zone of the station. Or would it be a \u0022no-splash\u0022 zone in space? Meanwhile the Osprey aligned itself for docking. One of the crews would complete the final docking remotely.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0664_osprey.jpg\u0022 alt=\u002220141224_ksp0664_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDocking these two modules to the Falconaerie was a simple two step process. Initially I brought it in directly, docking to the laboratory end of the station from one end of the Osprey. That allowed the crews to conduct supply transfers and get things \u0022situated.\u0022 Or possibly I just forgot. Forgot that such an arrangement wouldn\u0027t allow me to dock the mission payload to the Osprey, so I undocked it, spun it around, and docked to the station using one of the Osprey Lab module\u0027s radial docking ports. Less shuffling on future launches that way.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0678_osprey.jpg\u0022 alt=\u002220141224_ksp0678_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EDuna Heavy Lander Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 78 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Ptolemy\u003C/p\u003E\u003Cp\u003EHeight: 36.6m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 157.0t\u003C/p\u003E\u003Cp\u003ECost: 96,928 Roots\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0679_osprey.jpg\u0022 alt=\u002220141224_ksp0679_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you\u0027re going to Duna you might as well land there. The lander being carted along by the Osprey mission is a modest-sized, three-kerbal lander, fully reusable assuming you repack the chutes. Also along for the ride is the solar array harness for the Duna Lab module. It fit the mass requirements of this launch vehicle better than later with the rest of the solar array.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0694_osprey.jpg\u0022 alt=\u002220141224_ksp0694_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMost of this flight occurred in the dark, with the rendezvous just after sunrise. The lander will stay sealed up until the entire package is delivered to Duna, so it gets docked to the closed-off end of the Osprey Lab module where the Science Jr blocks the otherwise unimpeded flow of crew-accessible modules. The power harness was docked between the two, where it will remain indefinitely.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0696_osprey.jpg\u0022 alt=\u002220141224_ksp0696_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETwo more pieces to go!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EOsprey Drive Section Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 92 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Hawk\u003C/p\u003E\u003Cp\u003EHeight: 44.8m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 367.4t\u003C/p\u003E\u003Cp\u003ECost: 205,303 Roots\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0707_osprey.jpg\u0022 alt=\u002220141224_ksp0707_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe drive section of the Osprey is rather modest, and exactly enough to get the entire package to Duna and return the crew safely back to Kerbin. This is no Jool tug here, and would probably be better suited for in-system work than this interplanetary business. For now it\u0027s just another heavy payload launched atop a Hawk. Gene and Wernher would have preferred this to be the Hawk 3 mission to the far side of the MÃƒÂ¼n, but when the tab is being picked up by the government you don\u0027t have much room for complaint.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0712_osprey.jpg\u0022 alt=\u002220141224_ksp0712_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launch again went perfectly according to plan (dang it!, I miss DangIt!), the first stage and fairing dropping away without issue and the orbital stage carrying the heavy drive to orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0713_osprey.jpg\u0022 alt=\u002220141224_ksp0713_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe orbital stage tagged along with the drive section the entire way to the station, and was used to refuel the Heavy Lander and the waiting Falcons. Once spent it was backed away using RCS and deorbited. It was later recovered after completing a powered landing somewhere west of KSC.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0720_osprey.jpg\u0022 alt=\u002220141224_ksp0720_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne more piece!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EOsprey Lab Solar Array Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 101 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Custom A3\u003C/p\u003E\u003Cp\u003EHeight: 39.6m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 88.6t\u003C/p\u003E\u003Cp\u003ECost: 87,644 Roots\u003C/p\u003E\u003Cp\u003EThe final component of the Osprey Duna Mission is the Solar Array for the Osprey Lab module. Unlike the solar arrays for the Falconaerie, these would need to remain stowed away until the Lab is in the Duna system. As such they required a slightly heavier construction.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0096_osprey.jpg\u0022 alt=\u002220141226_ksp0096_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat also means an assembly bot needs to be sent along for the ride to the red planet. And since it\u0027s being dragged the whole way to Duna I wanted to use a smaller bot. Initial rendezvous was, of course, right at nightfall. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0102_osprey.jpg\u0022 alt=\u002220141226_ksp0102_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere we are, following installation of the first solar armature, and off to grab the second from the harness. (Which was busy drifting away.) The bot returned a few minutes later with the second armature. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0111_osprey.jpg\u0022 alt=\u002220141226_ksp0111_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the armatures packed for their trip to Duna, the construction bot moved back to the standard Clampotron Jr port I put at the end of all of my nuclear tugs. One of these days something will explode in there and ruin an otherwise good ship.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0117_osprey.jpg\u0022 alt=\u002220141226_ksp0117_osprey.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENothing left now but to send up the crews. And wait more than a year for the transfer window. What to do for the next year.... Hmm.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 103 - Gene\u0027s Office, Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003E\u0022Fantastic job getting Big Bird together for us, Gene. Fine work done on a fine timeline.\u0022 Gene had the Senator on speakerphone so Wernher and Carl could listen in. \u0022Sorry I couldn\u0027t be there in person to watch the final two launches.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Thanks. I expect we\u0027ll have two more crew rotations to the Falconaerie before the ship is fully fitted-out.\u0022 Gene looked up at Wernher and continued. \u0022And of course we\u0027ll get back to work on the MÃƒÂ¼n Program. We still have the Hawk 2 payload siting in a dark corner of the VAB, and we expect to take delivery on two more launch vehicles from Kerbodyne in the next couple mÃƒÂ¼nths.\u0022\u003C/p\u003E\u003Cp\u003E\u0022About that.\u0022 The line went quiet for a moment, only the regular background static still audible. \u0022Gene, we\u0027ve got another project we\u0027d like your boys to work on. Something that needs to take precedence over the MÃƒÂ¼n Program. An odd little thing the military has been working on and needs some help with, whether they know it or not.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Senator, quite frankly we\u0027re a civilian outfit here. We have neither the security measures nor the desire to work with military payloads.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You\u0027d do well to remember who pays the bills, son.\u0022 They could hear someone clacking away on a typewriter in the background now. \u0022Gene, we need you to put aside this MÃƒÂ¼n nonsense for the sake of the people of Kerbin. It\u0027s not something we can afford with half the planet in open rebellion.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yet we can afford a Duna mission?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Can\u0027t afford not to! Look, Gene, if you don\u0027t want your crews handling military payloads, so be it. They can provide their own people. But I\u0027m having the orders drawn up now to transfer this project to you and the KSA. We need you, Gene. Major Danbus Kerman will fill you in on the details when he arrives. You should listen to what he says.\u0022 At that, the Senator hung up.\u003C/p\u003E\u003Cp\u003EGene shook his head. \u0022I don\u0027t like this.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Gene, the military getting involved is never a good sign, even though it can make for a lucrative deal.\u0022 Carl started pacing at the far end of the office. \u0022I don\u0027t like this either.\u0022\u003C/p\u003E\u003Cp\u003EWernher spoke up. \u0022Hmm. It is not absolutely a bad thing. My first exposure to rocketry was with the military during The War. That was where the K2 and later the Bumper came from, if you remember. And from that has sprung the Hawk and many other mighty birds.\u0022 \u003C/p\u003E\u003Cp\u003E\u0022Oh, we remember Wernher. That was a long time ago, too. A long, long, long time ago. And you were quite a different kerbal.\u0022 Gene let his eyes drift to something outside, lost deep in thought. \u0022Wernher?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yes?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Go ahead and prep the Hawk 2. But do it quietly. I\u0027ll find a crew for it, some kerbals we can trust. We need to see whatever it is our handlers want to keep hidden. For now we\u0027ll play along with this new project, whatever it is.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EMonier 4 MÃƒÂ¼n Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 102 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Anaximander\u003C/p\u003E\u003Cp\u003EHeight: 18.1m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 14.3t\u003C/p\u003E\u003Cp\u003ECost: 22,965.0 Roots\u003C/p\u003E\u003Cp\u003EMeanwhile, M\u0026amp;M were up to no good with the rest of the rebels. Conducting science missions, revealing the secrets of the universe, all those other contentious and rebellious things.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0126_monier4.jpg\u0022 alt=\u002220141226_ksp0126_monier4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EToday\u0027s launch was just a quick shot to complete a few outstanding contracts at the MÃƒÂ¼n, one being the rather basic \u0022Explore the MÃƒÂ¼n\u0022. Some time back something deleted all of my contracts (probably me), so I still had some of those early and simple ones sitting around only partially completed. This mission netted over 100,000 Roots just by entering MÃƒÂ¼n orbit. Cha-ching!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0133_monier4.jpg\u0022 alt=\u002220141226_ksp0133_monier4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMonier 4 is just a tiny little probe, and capable of being launched atop an equally tiny Anaximander. It\u0027ll stay in a highly eccentric MÃƒÂ¼nar orbit to milk any of those \u0022Science Data from MÃƒÂ¼n\u0022 missions that crop up in the future. The gift that keeps on giving!\u003C/p\u003E\u003Cp\u003EA short while later the engineering teams knocked out a few more old contracts using a static test fire stand at the launchpad. One of which involved firing off a structural pylon while landed. More roots!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0140_static.jpg\u0022 alt=\u002220141226_ksp0140_static.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKraken\u0027s Harvest Core Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 104 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Psycho Heavy\u003C/p\u003E\u003Cp\u003EHeight: 48.9m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 446.5t\u003C/p\u003E\u003Cp\u003ECost: 310,547 Roots\u003C/p\u003E\u003Cp\u003EAnd now we\u0027re down to the big launches. The really big launches. The ones where the fairings (or lack there of) make me cringe. And where the launchpad itself weeps and moans. And explodes for no reason at all. Physics loads, launchpad explodes. Makes sense.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0145_kh.jpg\u0022 alt=\u002220141226_ksp0145_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECalling bug, I reverted, time and time again. And eventually decided to move the spacecraft upwards by a half dozen meters. Because that should obviously fix everything, right? Reminds me of the old launch tower that used to clip into ships....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0148_kh.jpg\u0022 alt=\u002220141226_ksp0148_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway....\u003C/p\u003E\u003Cp\u003EThe core of the Kraken\u0027s Harvest was a considerably larger module before I trimmed back the arms. Even then I couldn\u0027t fit it cleanly into a fairing. (Not that I didn\u0027t try. And in my mind those girders would be retracted until the ship reaches orbit, so it really does fit.) If I build another ship like this I\u0027m probably going to \u0022find a better way\u0022 to assemble it in orbit. Perhaps KAS? Who knows. Kerbal structural engineering is a discipline that lives in its own weird, twisted universe. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0157_kh.jpg\u0022 alt=\u002220141226_ksp0157_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe main stages for most of the Kraken\u0027s Harvest launches are SpaceY 5-meter parts. Nothing smaller could put these giants into orbit. This was a simple launch, and all I needed to do was get to orbit. Any orbit. I had timed this first launch deliberately - I didn\u0027t want to repeat the issues that crept into the Munlit Silence\u0027s construction where launches were increasingly at night. So for the Kraken\u0027s Harvest all of the launch windows would fall in the daytime. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0160_kh.jpg\u0022 alt=\u002220141226_ksp0160_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI made a small mistake on the orbital stage of the first few launches and used a Rockomax engine instead of the SpaceY F1 that I had planned for. Oops. Not sure how that occurred, probably by using the wrong subassembly, but it was corrected once I discovered it. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKraken\u0027s Harvest Drive Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 119 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Psycho Heavy\u003C/p\u003E\u003Cp\u003EHeight: 64.8m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 1189.9t\u003C/p\u003E\u003Cp\u003ECost: 534,402 Roots\u003C/p\u003E\u003Cp\u003EAnd so with the core stage safely in orbit we turn back to the drive section. I\u0027m stubborn. Launching the drive section fully fueled would save me from an onslaught of refueling launches. Unfortunately it is also frickin\u0027 massive. I\u0027ll need to check my older launch records, but I think this might be the single heaviest thing I\u0027ve ever launched legitimately. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0165_kh.jpg\u0022 alt=\u002220141226_ksp0165_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd it certainly felt massive. Just watching the fuel burn away at insane and previously unheard of rates gave me an appreciation for just how big this thing was.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0176_kh.jpg\u0022 alt=\u002220141226_ksp0176_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe SRBs and the two stages of the Psycho Heavy launch vehicle were more than enough to get the drive to orbit. Incidentally, the Kerbodyne tanks were recovered from the first stage of the Hawk launched by Gene with the Osprey Core. So while the Osprey Core was continuing skyward, the Hawk\u0027s first stage was descending into the arms of the rebels.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0166-0_kh.jpg\u0022 alt=\u002220141226_ksp0166-0_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA covert operation, filling the void spaces in the tanks with inflatable bags to keep them from sinking, some parachutes, and a bit of excess fuel to allow it to land on the flame. It was also tough getting the League\u0027s navy in the right place at the right time. (With its proximity to Jebediah\u0027s Junkyard, it\u0027s likely he had a hand in the recovery too.) Luckily the spent stage didn\u0027t explode after it was jettisoned. Salvage rights. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0166-10_kh.jpg\u0022 alt=\u002220141226_ksp0166-10_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe upper parts of the tank suffered some damage when the stage fell over into the water, but thankfully not to any of the parts the kerbals at Lake Fortunate need. Now that I think about it, perhaps this is where they got those Rockomax engines for the upper stages....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0166-16_kh.jpg\u0022 alt=\u002220141226_ksp0166-16_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOperationally, the drive stage is fairly useless without the core stage. It\u0027s severely lacking in attitude authority, relying on the reaction wheels in the core during normal flight. So instead of docking with the core, the core docked with it. It was tumbling slightly, making for a difficult docking. Nothing quite as bad as Interstellar though.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0202_kh.jpg\u0022 alt=\u002220141226_ksp0202_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the easy parts done we move on to the really nerve-wranglingly-painful parts of this construction project: Arms with 4 docking ports each. Enjoy this brief Zen-like moment of silence and beauty before we wander off into that insanity. Breathe in. Breathe out. Relax.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0204_kh.jpg\u0022 alt=\u002220141226_ksp0204_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKraken\u0027s Harvest Arms A-B Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 126 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Psycho Heavy\u003C/p\u003E\u003Cp\u003EHeight: 55.7m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 446.9t\u003C/p\u003E\u003Cp\u003ECost: 301,559 Roots\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0211_kh.jpg\u0022 alt=\u002220141226_ksp0211_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis was the first of the three large arm module launches. This fairing is a big joke, but eh. Only so much you can do. Future craft of this style will probably use interchangeable Habitation units, being constructed instead as more of a skeleton ship. But I\u0027ll talk about that in a few IRL months should we make it that far. These arms are light enough that the first stage of the Psycho Heavy takes them most of the way to orbit. Here we are just past 32km where the fairings auto-eject (or, where I slap the space bar).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0217_kh.jpg\u0022 alt=\u002220141226_ksp0217_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt this point it\u0027s not even worth mentioning the rendezvous. Yep, it happened. Yep, I\u0027ve done this about 1000 times now. Yep, it was in the dark. Docking the arms to the core was both easy and difficult. Easy, because I added ample RCS ports to them. Difficult, because they had to be lined up 100% perfectly. Here\u0027s the construction tug for Arms A-B extracting Arm A from the cradle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0243_kh.jpg\u0022 alt=\u002220141226_ksp0243_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe small docking port on the top of the armature is there to act as a keying device. It will be pulled into place by the opposite small port on the superstructure of the core stage, making sure the arm is locked in at 0 degrees. Worked like a charm. Yes, \u0022Dr. Al the Kiddie\u0027s Pal\u0022, I do still remember my introductory Mechanical Engineering almost two decades later. Can I get some extra credit? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0248_kh.jpg\u0022 alt=\u002220141226_ksp0248_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the construction bot coming back with the second arm. These construction bots were designed for two-use only, so it\u0027ll stay docked up here until the other four arms are installed. I could have reused the same one, but I wasn\u0027t sure how much reshuffling I might need to do on the arms.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0260_kh.jpg\u0022 alt=\u002220141226_ksp0260_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOk, so maybe that wasn\u0027t so tough. Yet. Progress so far:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0262_kh.jpg\u0022 alt=\u002220141226_ksp0262_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKraken\u0027s Harvest Arms C-D Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 128 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Psycho Heavy\u003C/p\u003E\u003Cp\u003EHeight: 55.7m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 446.9t\u003C/p\u003E\u003Cp\u003ECost: 301,559 Roots\u003C/p\u003E\u003Cp\u003EAnother day, another heavy launch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141226_ksp0265_kh.jpg\u0022 alt=\u002220141226_ksp0265_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first two arms docked up well enough, so I decided to send up the C\u0026amp;D units without any changes. \u003C/p\u003E\u003Cp\u003EThis is where the issues started, namely that some of the arms would \u0022lock in\u0022 at weird angles thanks to the locking key. (Ok, so maybe it wasn\u0027t the perfect solution I thought it was). The arm would dock to the key and an adjacent arm, instead of to the core of the ship, resulting in a slight angle. Also at issue was the occasional odd docking where the key wouldn\u0027t hit squarely. It\u0027s not obvious from this picture, but I spent most of the dwell time wrestling to get Arm C installed. Eventually I just saved it and came back the next IRL day.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0286_kh.jpg\u0022 alt=\u002220141227_ksp0286_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn retrospect I suspect these issues were caused because I was installing the arms radially around from the first, instead of staggered. Had I installed, say, A, C, and E first, they would have locked in place as desired. Later installation of B, D, and F would dock primarily with their neighbors, creating the desired continuous ring with minimal warpage on the arms themselves. Hindsight is 20/20 they say. Here\u0027s Arm D coming in for docking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0290_kh.jpg\u0022 alt=\u002220141227_ksp0290_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe progress after Arm D:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0292_kh.jpg\u0022 alt=\u002220141227_ksp0292_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKraken\u0027s Harvest Arms E-F Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 141 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Psycho Heavy\u003C/p\u003E\u003Cp\u003EHeight: 55.7m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 446.9t\u003C/p\u003E\u003Cp\u003ECost: 301,559 Roots\u003C/p\u003E\u003Cp\u003EAnother day, another heavy launch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0297_kh.jpg\u0022 alt=\u002220141227_ksp0297_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is where things started to get really hairy, though I was able to pound most of the arms into alignment. Here\u0027s Arm E coming in for installation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0314_kh.jpg\u0022 alt=\u002220141227_ksp0314_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow you may be wondering what tools I\u0027m using to do all of this, so here\u0027s a screenshot with the HUD still visible. My primary tool is actually the Stock Navball. I use the DPAI to get the alignment right, but once we\u0027re headed towards the target port, I use the directional and the target prograde markers to make sure I\u0027m drifting in the right direction. That\u0027s how I learned to dock, and it\u0027s the main reason I prefer DPAI over the docking plugin that puts the markers on the navball. (Sorry about the downsampling on this one, I know it makes the text hard to read. I play at 2048x1152 most of the time, even when I\u0027m playing on the Mac.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0316_kh.jpg\u0022 alt=\u002220141227_ksp0316_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd here\u0027s the last piece of the puzzle, Arm F. Feel free to return to that place of Zen, all the wrangling and wrestling complete. Breathe in. Breathe out. Relax. Good.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0333_kh.jpg\u0022 alt=\u002220141227_ksp0333_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith everything in place, the universe gave the ship a quick shake (4x Physics Warp FTW!) and all the Clampotrons worked their magic and docked up. Even if they weren\u0027t correctly aligned.\u003C/p\u003E\u003Cp\u003EHabitation ring complete:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0338_kh.jpg\u0022 alt=\u002220141227_ksp0338_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EKraken\u0027s Harvest Lab Module Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 150 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Cantemir\u003C/p\u003E\u003Cp\u003EHeight: 31.8m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 123.1t\u003C/p\u003E\u003Cp\u003ECost: 120,503 Roots\u003C/p\u003E\u003Cp\u003EAnother day, another heavy launch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0509_kh.jpg\u0022 alt=\u002220141227_ksp0509_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot quite as heavy this time though, as the Lab Module was lofted to the heavens by an older Cantemir launch vehicle. I\u0027m wondering how these will look once OrionKerman finishes recreating and splitting up his HGR pack. Or if they\u0027ll even exist.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0513_kh.jpg\u0022 alt=\u002220141227_ksp0513_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe lab module is another semi-permanent station, and will be left behind in the Duna system along with the landers. Power for it is provided by RTGs, so no solar arrays are necessary. It features a hitchhiker can for long-duration inhabitation by two members of the science team, and is a fully autonomous facility. As such it moved in to dock with the \u0022shoving platform\u0022 at the front of the Kraken\u0027s Harvest. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0525_kh.jpg\u0022 alt=\u002220141227_ksp0525_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the lab on final approach.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141227_ksp0531_kh.jpg\u0022 alt=\u002220141227_ksp0531_kh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd with that, the as-originally-intended Long-Duration Rotational Spaceship LDRS-02 \u0022Kraken\u0027s Harvest\u0022 is complete. Now to send up the rest of the mission payload and consumables.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EDuna Dusters and Resupply Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 153 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: ALV-SuperHeavy\u003C/p\u003E\u003Cp\u003EHeight: 46.6m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 251.7t\u003C/p\u003E\u003Cp\u003ECost: 194,871 Roots\u003C/p\u003E\u003Cp\u003EAnother day, another you get the idea. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0589_dusters.jpg\u0022 alt=\u002220141228_ksp0589_dusters.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt took me a while to settle on a design for the Duna landers. I had originally wanted to send along 4, 2-kerbals landers, but just couldn\u0027t make the math work. These landers needed to be able to make it to and from the surface totally on flames (in case repacking the chutes doesn\u0027t work for some reason), and also need to have enough range to reach Ike from a 100km orbit around Duna. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0596_dusters.jpg\u0022 alt=\u002220141228_ksp0596_dusters.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Dusters can do all of that and a bit more. I had originally built them using the Tantares capsule, until I realized the crews wouldn\u0027t have any room for their EVA suits. Something that\u0027s kind of needed on Duna and Ike. So I rebuilt them to be 100% stock. Also along for the ride was some excess fuel, to top off the KH\u0027s depleted reserves. The fuel tanker docked up along the ring while the Dusters docked ahead of the lab. Meanwhile the three construction bots had all stacked up on the same port.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0617_dusters.jpg\u0022 alt=\u002220141228_ksp0617_dusters.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003ETowed Antenna Array Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 157 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Anaximander\u003C/p\u003E\u003Cp\u003EHeight: 19.3m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 15.6t\u003C/p\u003E\u003Cp\u003ECost: 23,799 Roots\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0631_taa.jpg\u0022 alt=\u002220141228_ksp0631_taa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E0.90.0 necessitated a change to the Towed Antenna Array, as the probe core its using no longer features any reaction wheels. Hmm. Small change to add the now-tiny SAS unit to the stack, and to clean up a bit using the new clipping tools. Like before, this antenna array was shoved up the backside of the drive section to a place where the Sun literally was not shining (only Kerbin). Inadvertently extending the two 88-88 antennas would make for a rather uncomfortable nuclear accident.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0657_taa.jpg\u0022 alt=\u002220141228_ksp0657_taa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo now we\u0027ve got all the hardware up there. What about the crews?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EHydra 1 Return\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 157 - Low Kerbin Orbit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELast bit of business for today is to bring the Hydra back to Lake Fortunate so we can process it and get it prepped for crew transfer... in another year or so. It\u0027s not been half a year since we launched the Munlit Silence, so naturally that means we get to land in the dark. Yay.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0661_hydra.jpg\u0022 alt=\u002220141228_ksp0661_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EKeeping the Hydra facing retrograde for the reentry involves both parachutes and a slow, steady burn. It\u0027s just a tad bit unbalanced for flight. Naturally this happened at night, so... dark pictures. I\u0027ll admit I tried this landing three times, the first time coming down across the lake, the second time coming down somewhere well short (inside a new crater on one of those nice backdrop mountains). Third time\u0027s a charm, right?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0690_hydra.jpg\u0022 alt=\u002220141228_ksp0690_hydra.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot exactly. Brought it down (safely) in the lake just beyond the space center. A little bit of water shouldn\u0027t hurt, right? Either way, it allowed me to recover several-tens-of-thousands worth of Roots and call this reusable crew shuttle \u0022Reusable.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 158 - Lake Fortunate Vehicle Assembly Building\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003EMilzer, Meldo, Jeb and a few of the other grounds crew were all gathered around the Hydra Shuttle, which was busy dripping slightly-acidic lake water all over the floor of the VAB. Jeb had his head shoved inside one of the shuttle\u0027s LV-909s when M\u0026amp;M started prodding him for a damage report. \u003C/p\u003E\u003Cp\u003E\u0022Gotta admit I\u0027m a bit disappointed you put my baby down in the drink, but I don\u0027t think there\u0027s any damage I can\u0027t fix. Just need to drain it out and hope this lake crud hasn\u0027t eaten through anything important.\u0022 \u003C/p\u003E\u003Cp\u003E\u0022So you\u0027ll have it ready next year when we need it?\u0022\u003C/p\u003E\u003Cp\u003EJeb slid down off of the engine, a deluge of lake sludge following him to the floor. \u0022Sure! Besides, I\u0027ve got two more of the things just sitting around collecting rust back at the junkyard. And I\u0027ll want to have it in top shape for the next launch anyway since I\u0027m coming with you.\u0022\u003C/p\u003E\u003Cp\u003EMilzer put his hand up. \u0022Wait. Who said anything about you coming with us?\u0022\u003C/p\u003E\u003Cp\u003E\u0022C\u0027mon, Mildew. I know you and Melba here are short on crews, even to the point of inviting those crazy rookies from the islands. I even heard you were inviting a couple kerbals from the old CCHR, right?\u0022 Jeb grabbed a wrench and opened another valve, causing slimy water to start spilling out of the RCS ports. \u0022Besides, last crew I saw off to Duna never came back. I\u0027d kinda like to know what happened.\u0022\u003C/p\u003E\u003Cp\u003EMeldo elbowed Milzer. \u0022M, if Jeb comes then so will Bill and Bob. We could use an extra Engineer. And, Bob, too. I guess.\u0022\u003C/p\u003E\u003Cp\u003EMilzer thought about it. \u0022Ok, sure. We\u0027ve got a year still, and the ship seats 96 at full capacity, so there\u0027s more than enough room for Jeb and the Bs and plenty of time to pack supplies for them. And a few extra false teeth.\u0022 Jeb smiled, laughed, smiled some more, slapped Milzer on the back, then went back to draining the lake water out of the Hydra.\u003C/p\u003E\u003Cp\u003EMilzer turned back to Meldo, motioning him to the exit, trying to avoid the rapidly growing puddle of dark green sludge gathering on the VAB floor. \u0022Ok, so we\u0027ve got a year until the Duna transfer window? What do we do until then?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Contracts, dude! Contracts!\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EHere\u0027s a quick grab of the VAB-stats for the Kraken\u0027s Harvest. KSP seems to disagree with KER about how much mass we\u0027re talking about, but everything else checks out. I suspect KER is incorrectly subtracting mass from some of the \u0022physics-less\u0022 parts, or that KSP is incorrectly adding said mass. It\u0027s my understanding that not all of those parts are massless and instead add a generic mass at the CoM of the vessel, though I\u0027m not sure how the game would decide which are which. \u003C/p\u003E\u003Cp\u003EThese numbers are for the full Duna / Diophantus mission stack, and the Ã¢Ë†â€ v goes up considerably once the landers and lab are ditched.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141230_ksp0722_khstats.jpg\u0022 alt=\u002220141230_ksp0722_khstats.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext Time: We see just how long it takes for a 256t ship to burn for Duna using only 8 LV-Ns. Maybe.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:22:08Z\u0022 title=\u002206/21/2015 10:22  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2015-01-02T09:22:56Z","Content":"\n\u003Cp\u003EYou are a madman \u003Cem\u003Eand\u003C/em\u003E an inspiration. I love your designs, right down to the little details.\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2015-01-02T22:46:14Z","Content":"\n\u003Cp\u003ESo the rebels are going to beat the government to Duna?\u003C/p\u003E\u003Cp\u003EOr the other way around?\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-01-03T01:39:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commander Zoom\u0022 data-cite=\u0022Commander Zoom\u0022\u003E\u003Cdiv\u003EYou are a madman \u003Cem\u003Eand\u003C/em\u003E an inspiration. I love your designs, right down to the little details.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! I\u0027m amazed at some of the finer points folks pick up on (from both text and screenshots), and always happy to have an audience. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meve12\u0022 data-cite=\u0022meve12\u0022\u003E\u003Cdiv\u003ESo the rebels are going to beat the government to Duna?\u003Cp\u003EOr the other way around?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure yet. While there are some loose story elements that are kinda set in stone, something like who exactly gets to Duna first really comes down to the vagaries of the KSP engine and the cold equations of simple physics. I know who\u0027s going to /burn/ for Duna first, but actually get there first? We\u0027ll see. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-01-03T18:18:15Z","Content":"\n\u003Cp\u003EThis moment of Reflection brought to you by Shepgee Kerman and a Beta release of Texture Replacer, featuring built-in \u0022real\u0022 reflections. The Munlit Silence has now passed beyond the orbit of Duna, making it the furthest out any of my Kerbals have ventured since the Jool Jester mission in March of 2014. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0212_rot.gif\u0022 alt=\u002220150103_ksp0212_rot.gif\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:22:45Z\u0022 title=\u002206/21/2015 10:22  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deltervees","CreatedById":133567,"CreatedDateTime":"2015-01-03T19:28:30Z","Content":"\n\u003Cp\u003EWhat mod did you use to get Lake Fortunate and can I please have the config for it?\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-01-03T20:33:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deltervees\u0022 data-cite=\u0022Deltervees\u0022\u003E\u003Cdiv\u003EWhat mod did you use to get Lake Fortunate and can I please have the config for it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECertainly! I\u0027m using RealSolarSystem to swap launch sites, as detailed in this post: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/89277-Ad-Lunam-Updated-2015-01-01?p=1599899\u0026amp;viewfull=1#post1599899\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/89277-Ad-Lunam-Updated-2015-01-01?p=1599899\u0026amp;viewfull=1#post1599899\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EThe launchsite config is located in this file: \u003Ca href=\u0022http://0div0.org/files/LaunchSites.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://0div0.org/files/LaunchSites.cfg\u003C/a\u003E Just drop that into the RealSolarSystem folder, make the other config changes as detailed in the post I linked to, and it will mostly work. RSS is having some issues with moving launchsites in 0.90.0, so you will want to check the forum thread for it. For starters: LaunchSites are not retained across game loads, and must be reselected every time you open the save. Also, there\u0027s a nasty memory leak somewhere, perhaps from my config or perhaps from RSS, that causes the game to crash after 10 or 20 trips to/from the space center. Not sure what\u0027s up there. Disclaimer: If my config changes cause RSS to be (more) unstable, ask me first before you go and bother the RSS team, as it\u0027s likely something I\u0027ve broken and may have already fixed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-03T20:41:14Z\u0022 title=\u002201/03/2015 08:41  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 3, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-01-22T07:41:24Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EAd Lunam - WildFire\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDojo Ichi / Orenji-1 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 45 - Forgotten Islands Space-O-Plex\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EForgotten Space Program\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Cantemir\u003C/p\u003E\u003Cp\u003EHeight: 28.4\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 119.2\u003C/p\u003E\u003Cp\u003ECost: 192,371\u003C/p\u003E\u003Cp\u003EWhile the Kerbal Space Agency and the \u0022Rebels\u0022 were busy building their ships for Duna, a couple new contenders taking their first steps into the void. Word had leaked out that yes, indeed there were kerbals in space, and yes, access to that mystical land beyond the sky was open to everyone. Everyone with willpower and deep pockets, that is. \u003C/p\u003E\u003Cp\u003EFor the Forgotten Islanders, the idea had come to Deruki in a dream: They could buy rocket parts from the suppliers in other countries and have them shipped to them. It was an idea his Sensei Bo had run with at once, and in no time at all Bo\u0027s Dojo had been turned into a makeshift spacecenter; the factory where he assembled his world-famous \u0022WaddleKerb\u0022 tape decks converted to a vehicle assembly building. Deruki\u0027s already mad Sensei Bo had gone completely space crazy. \u003C/p\u003E\u003Cp\u003EGetting the rocket parts was a bit tricker. They called every supplier they could find: Rockomax. C7. Kerlington. Kerbodyne. All had responded the same: \u0022There were no such things as rockets and spaceships.\u0022 \u0022There had never been a space programme.\u0022 \u0022No kerbals had ever ventured beyond the sky.\u0022 \u0022Please hold for the next available operator.\u0022 Yet Deruki and his Sensei Bo knew better. Bo himself had once danced around The MÃƒÂ¼n, long ago in the years before he moved to the far south. So when they finally found suppliers who admitted to selling rockets and, yes, were willing to ship, Bo and Deruki were quite ready. The Orenji-01 was assembled in record time. (Easy to set records when you\u0027re building your first rocket, no?) \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141221_ksp0066_orenji-1.jpg\u0022 alt=\u002220141221_ksp0066_orenji-1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDeruki and his co-pilot Jeysef had spent countless hours training in the arcade, and were both equally qualified to face Xur and the Ko-Dan Armada. That is to say: they knew nothing of flying real spaceships. When Deruki had asked his Sensei for advice, Bo\u0027s instructions were even more cryptic: \u0022Go up aways, go sideways aways, and don\u0027t come down. Ha ha!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141221_ksp0096_orenji-1.jpg\u0022 alt=\u002220141221_ksp0096_orenji-1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat advice had worked like a charm. The capsule for Deruki and Jeysef\u0027s ride into orbit was one of the new Tantares Fujis, little more than a frisbee with a lid on it, though it included a large ball like thing which the two would live in for several days while in orbit - the Dojo Ichi. They would later be joined by two other kerbonauts from the far side of the planet, crew Sensei Bo had invited himself. Deruki spent countless hours just floating outside, watching and waiting for their guests\u0027 arrival.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141221_ksp0105_orenji-1.jpg\u0022 alt=\u002220141221_ksp0105_orenji-1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EISC-A2-01 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 47 - Southern Space Center\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESpace Program of the ISC\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Custom A2\u003C/p\u003E\u003Cp\u003EHeight: 29.5\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 64.8\u003C/p\u003E\u003Cp\u003ECost: 45,567\u003C/p\u003E\u003Cp\u003EMeanwhile, the Independent Southern Coalition (ISC) had finished building their own space center, yet another copy of KSC. Construction of the Southern Space Center began at roughly the same time as Lake Fortunate, but pressure from the Unified Government had forced them to proceed slowly and eventually terminate the project. None of that mattered now that the ISC had left the Unified Government and was in open rebellion, so they quickly finished construction and set about preparing for their first launch. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141221_ksp0122_A2.jpg\u0022 alt=\u002220141221_ksp0122_A2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe A2 was a relatively new capsule from Yarbrough Aerospace, and still in development. Intended for use as an automated crew transfer vehicle, the A2 would allow the ISC to ferry crews to a station they were planning for Low-Kerbin Orbit. This first launch was to be a simple test flight, at least until an offer from Sensei Bo changed their minds. Perhaps they would like to join up to build a station together? Who could say no to Bo?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141221_ksp0130_A2.jpg\u0022 alt=\u002220141221_ksp0130_A2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELodrigh and Newwin served as the first crew for the A2 Flight Test, and got to put the little craft through its paces, including a rendezvous with the Dojo in its 45 degree inclination orbit. Newwin wasn\u0027t quite sure what to make of all the shiny buttons on the middle console, and spent most of the first orbit just staring at them blankly. Had he been paying more attention the \u0022rendezvous\u0022 wouldn\u0027t have almost resulted in the A2 crashing into the Dojo Ichi. (A few tense moments there.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0600_A2.jpg\u0022 alt=\u002220141224_ksp0600_A2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENear-accident averted, the two ships docked up and set about conducting the first friendly collaboration in Kerbin orbit in many decades. Both crews reentered safely and landed near their respective space centers after a few MÃƒÂ¼nths. The \u0022Space Dojo\u0022 was left in orbit, hopefully to serve as the first component in a new space station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141224_ksp0619_reentry.jpg\u0022 alt=\u002220141224_ksp0619_reentry.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EThabit 3 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 158 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Zagoskin\u003C/p\u003E\u003Cp\u003EHeight: 20.6m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 49t\u003C/p\u003E\u003Cp\u003ECost: 55,911\u003C/p\u003E\u003Cp\u003EThe Planetary Sciences division of our \u0022Rebel\u0022 space agency had been without a working probe for quite some time, so when an RPWS and Gravity Wave experiment contract appeared for Kerbin they jumped at the task. (I rather prefer these long-duration science contracts of DMagic\u0027s to the stock one-shot-and-you\u0027re-done science system.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0698_thabit3.jpg\u0022 alt=\u002220141228_ksp0698_thabit3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThabit 3 was a relatively simple probe, though the cost of launching it ($55k) ate into a large chunk of what the contract provided. Once on-station it was able to take initial high and low orbit RPWS and other scans, and started sending back data to the science teams on Kerbin. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0705_thabit3.jpg\u0022 alt=\u002220141228_ksp0705_thabit3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EMonier 5 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 162 - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Zagoskin\u003C/p\u003E\u003Cp\u003EHeight: 27.1m\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 55.3t\u003C/p\u003E\u003Cp\u003ECost: 58,911\u003C/p\u003E\u003Cp\u003EA similar RPWS contract soon followed for Minmus, so a second copy of the Thabit 3 was manufactured. Named Monier 5, it was assigned to the moon-sciences subteam of Planetary Sciences. (Because Minmus, as a moon, \u003Ca href=\u0022https://www.youtube.com/watch?v=DcP0beJ95oY\u0022 rel=\u0022external nofollow\u0022\u003Eis neither a planet nor a star\u003C/a\u003E.) This one required a transstage to reach Minmus, eating another 3,000 Roots from the contract. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0708_monier5.jpg\u0022 alt=\u002220141228_ksp0708_monier5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Monier 5 was able to complete the initial RPWS contracts after entering into a highly elliptical Minmus polar orbit. Soon after it began sending back regular data packets, and should complete its primary mission in 140 days. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20141228_ksp0719_monier5.jpg\u0022 alt=\u002220141228_ksp0719_monier5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EIt was around here that I encountered my first major bug of 0.90.0, though in retrospect I suppose it might also be the bug that killed my old \u002219th\u0022 save file. I had used the SpaceY heavy launcher parts for the Kraken\u0027s Harvest, and I had considered using parts of it for the next mission, so I had left the mod installed. Except then a new \u0022Mostly Stock\u0022 fervor caught hold of me, and I decided to start cutting out as many mods as possible. The Kraken\u0027s Harvest was in orbit, and I don\u0027t really see myself launching another craft like that soon, so SpaceY was one of the mods I deleted.\u003C/p\u003E\u003Cp\u003EAnd then I went back to work for three days, went through the gunfire, fireworks and revelry of New Year\u0027s Eve, and didn\u0027t come back to KSP until 2015. So on a groggy New Year\u0027s afternoon as I crawled out of whatever counted as a bed the previous night, I fired up KSP and discovered the save was borked. It would load, but then it would NRE itself to death and the UI would lock up. First thought was that I\u0027d screwed up the crew histories, as I\u0027d spent some time on the Saturday after Christmas rebuilding the experience sheets of my crews from my records. So I spent some time digging through previous versions of the save on Dropbox to find one from before I started that change. No improvement. \u003C/p\u003E\u003Cp\u003ESo I started cutting. \u003C/p\u003E\u003Cp\u003ETwo hours later I found the culprit. In the 2 weeks or so that I had SpaceY installed, a contract had spawned using SpaceY as the agent. Now, I\u0027m not honestly sure if NecroBones added the agents config or if I did, as I went on an agent-adding spree once I learned you could filter parts by Manufacturer in the VAB. That\u0027s not the issue though - this contract, added by the system, ignored by me, no longer had an entity assigned to it. That caused KSP to freak out, and in such a way that it wouldn\u0027t even properly log why it was freaking out. \u003C/p\u003E\u003Cp\u003EYay. \u003C/p\u003E\u003Cp\u003EThat\u0027s a problem. I can live without the parts filtering, especially since I can assign custom filters, so I\u0027m now flat out deleting any agents configs I find in the mods I install. I also scrubbed the save file of any other offending agents. I often remove parts mods when I\u0027m not using them - that\u0027s the primary reason I hold to my 100% stock rule for permanent ships - so having the save die from a missing Agent is... annoying, to say the least. Oddly this doesn\u0027t seem to affect the contracts the DMagic plugin adds. I\u0027m now wondering if this is a Squad or a FinePrint bug, and how long it\u0027s been around.\u003C/p\u003E\u003Cp\u003EIn related news, I took this opportunity to swap out the Tantares/ALV fuel tank on the Munlit Silence for a Rockomax BigOrangeTank using a text editor (vim). Beale was in the middle of reworking those ALV parts, and it violates my own 100% stock rule for permanent ships anyway. Plus, it might be several IRL Months before I get back to the Silence or before it returns to Kerbin, and I wouldn\u0027t want to keep using an old version of Tantares for that long. \u003C/p\u003E\u003Cp\u003ENow back to our regularly irregular launches....\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EProject ORTHO - Eagle-1 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day 71 - Cape Kerbal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E19th\u003C/span\u003E Kerbal Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: S/EFT-1\u003C/p\u003E\u003Cp\u003EOrbiter: ORTHO-1 \u0022Wanderer\u0022\u003C/p\u003E\u003Cp\u003EHeight: 37.8\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 509.8\u003C/p\u003E\u003Cp\u003ECost: 282,679\u003C/p\u003E\u003Cp\u003E\u0022You know Gene, there is some irony in the fact that we built the Falconaerie to host Falcons, and yet today we send an Eagle. Perhaps we should rename it something simple. Such as Aerie.\u0022 \u003C/p\u003E\u003Cp\u003E\u0022Wernher, you\u0027re positively a bottomless well of creativity when it comes to naming things.\u0022 Gene spun around from his station to glare at his chief designer, who had spent the last half hour hovering over his shoulder. Today Wernher was little more than a spectator.\u003C/p\u003E\u003Cp\u003E\u0022Thank y...\u0022\u003C/p\u003E\u003Cp\u003E\u0022That wasn\u0027t a compliment. Anyway, this launch has me nervous.\u0022\u003C/p\u003E\u003Cp\u003E\u0022All launches make you nervous my friend. What is the worst that can happen?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well for starters the crew could throttle up to 100% at liftoff and blast backwards into the VAB. We happen to be sitting right next door. I\u0027d also be a bit more comfortable if the only kerbal that seems to know anything about this bird wasn\u0027t the one who is actually flying it.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0000_eagle1.jpg\u0022 alt=\u002220150101_ksp0000_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEagle was the code name Wernher had chosen for the Project ORTHO launches, and today was the first launch of this recently transferred operation. Project ORTHO - the military jargon-ism for Orbital Retrieval and Transport of Heavy Objects - was until now a top-secret program run by Major Danbus Kerman. The same kerbal who was piloting it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0006_eagle1.jpg\u0022 alt=\u002220150101_ksp0006_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was a program that fell in Gene\u0027s lap from out of nowhere. The design of the craft was well and truly alien from everything else they had flown to date, and all to serve a singular purpose - snatching satellites from orbit. When Gene asked exactly which satellites, he was always met with the same response. \u0022Sorry Sir, that\u0027s classified.\u0022 The ship was reconfigured as a crew transport when the military realized there was a particular dearth of satellites to nab, with some allowances for transporting things to and from orbit. To date only one orbiter had been constructed - Wanderer - though Danbus had hinted two more were on order. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0013_eagle1.jpg\u0022 alt=\u002220150101_ksp0013_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor today\u0027s flight Major Danbus was the logical choice as pilot, being the only kerbal with any experience on the strange craft. Gene would have preferred to send it up with just a crew of two to shake out any bugs, but Danbus insisted it had already been flown and was certified as safe for flying eight. Gene asked how many flights. \u0022Sorry Sir, that\u0027s classified.\u0022 Even the names of the military\u0027s kerbonauts were kept secret. All except for the rather curious case of Major Danbus. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0040_eagle1.jpg\u0022 alt=\u002220150101_ksp0040_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe single most dangerous part of the ascent was the SRB jettison. Time it incorrectly and the craft would tumble out of control from the uneven thrust. Jettison too early and the SRBs would pierce the large tank of rocket fuel they were riding on. Jettison at the wrong pitch, and they could easily wipe out the wings of the orbiter. Everything went according to plan and Wanderer pressed onwards to space.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0045_eagle1.jpg\u0022 alt=\u002220150101_ksp0045_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe main engines of the orbiter were progressively throttled back as the fuel in the external fuel tank was burned through. Once fully depleted, nearly 8 minutes later, Wanderer decoupled and backed away from the tank with a simple push from the RCS.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0094_eagle1.jpg\u0022 alt=\u002220150101_ksp0094_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EToday\u0027s mission was a routine crew ferry operation to The Falconaerie. Four new crew up, four old crew down. Along for the ride was another of Gene\u0027s pilots, Nelfen, who was instructed to watch and record everything Danbus did. Also along for the ride was a docking adapter, which was to be installed at the habitation end of the Falconaerie. No longer would crews need to EVA to enter the station. Without a robotic arm, the orbiter had to undock from the adapter, pull away and reorient, and then come back to dock the slightly-tumbling adapter to the dorsal docking port.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0146_eagle1.jpg\u0022 alt=\u002220150101_ksp0146_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDocking with the station was a slow process, in large part due to the presence of the Osprey Duna ship. It also didn\u0027t help that initial rendezvous was right at sunset. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0172_eagle1.jpg\u0022 alt=\u002220150101_ksp0172_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWanderer spent a couple days at the station, with Danbus and Nelfen performing a series of spacecraft health checks for Gene and the other ground controllers. That also gave the other crews time to complete their transfer and conduct a few other experiments.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0192_eagle1.jpg\u0022 alt=\u002220150101_ksp0192_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith all tasks completed and the crews swapped out, the Wanderer pushed away from the Falconaerie and began its long descent back to KSC.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0232_eagle1.jpg\u0022 alt=\u002220150101_ksp0232_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EInitial testing of these Shuttles showed a tendency at reentry to overshoot their targets, moreso than is usual with my spaceplanes. And yet coming in too shallow was a good way to be introduced to the K2 mountain range. With all that in mind, and the nimble yet brick-like nature of the orbiter, I designed my landing program to overshoot KSC, turn, and land at 270Ã‚Â°. As is only right and proper with such things. \u0022Flying around a giant imaginary cylinder,\u0022 as it was described in one of the flight manuals.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0244_eagle1.jpg\u0022 alt=\u002220150101_ksp0244_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESadly, 2300m/s at such a shallow angle is not enough to cause the new wing parts to glow. So we\u0027ll just have to admire the plasmatic air instead. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0256_eagle1.jpg\u0022 alt=\u002220150101_ksp0256_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs advertised, Wanderer flew well overhead of KSC. Staying airborne in a glider the size of the Shuttle requires a combination of steep dives and slow turns to keep the airspeed up. Dives in excess of 30Ã‚Â° are not unheard of, though the usual descent profile is closer to 20Ã‚Â°. Even in stock aerodynamics a craft such as this will happily stall and fall out of the sky or go into an unrecoverable flat spin. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0266_eagle1.jpg\u0022 alt=\u002220150101_ksp0266_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EComing in to land at less than 70m/s is also a good way to have the craft pitch up violently and flip end over end due to aerodynamics that I failed at in college. So landing requires a bit of a final suicide drop to gain airspeed followed by the pitch up and touchdown. In other words - it flies like the real thing. Which is good, as I can draw from a much older and much more practiced skillset for landing it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0274_eagle1.jpg\u0022 alt=\u002220150101_ksp0274_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd this trip on one of the most complicated 100% stock vessels I\u0027ve ever spent 18 months building has a happy ending. First crew of the Wanderer, from left to right: Lanlock, Geneble, Enlan, Danbus, Nelfen, and Dudry Kerman.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150101_ksp0286_eagle1.jpg\u0022 alt=\u002220150101_ksp0286_eagle1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EArchimedes 5 Launch\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYear 77 day - Lake Fortunate\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ERebel \u002218th\u0022\u003C/span\u003E Space Agency\u003C/p\u003E\u003Cp\u003ELaunch Vehicle: Anuchin\u003C/p\u003E\u003Cp\u003EHeight: 32.7\u003C/p\u003E\u003Cp\u003ELiftoff Mass: 115.6\u003C/p\u003E\u003Cp\u003ECost: 95,223\u003C/p\u003E\u003Cp\u003ETime to go back to the MÃƒÂ¼n! Gersted and Billy-Bobford were assinged to the Archimedes 5, a simple 2-kerbal mission to the MÃƒÂ¼n using a Duster. Taking a bunch of unblooded raw recruits to Duna is probably a bad idea, so Milzer and Meldo created this simple training program. It also serves as a fight test for the new Dusters. It\u0027s be a shame to fly all the way out to Duna only to find they don\u0027t do something right.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0288_arch5.jpg\u0022 alt=\u002220150103_ksp0288_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s not as complete, capable, nor as Apollo-like as the first 4 Archimedes launches, but it\u0027s going to The MÃƒÂ¼n so it gets to bear the name. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0300_arch5.jpg\u0022 alt=\u002220150103_ksp0300_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESmall, cheap, and agile, the Dusters make for a good general purpose lander. Not quite the \u0022Toyota Corolla\u0022 of KSP as they seat 2, so perhaps these are instead the Camrys. The landing site for this mission wasn\u0027t anything specific, just a simple \u0022choose a spot and land.\u0022 With that kind of flexibility they didn\u0027t even bother with their inclination, and put the Archimedes into a highly inclined MÃƒÂ¼nar orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0317_arch5.jpg\u0022 alt=\u002220150103_ksp0317_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe transstage was used to complete the deorbit burn and was jettisoned a short distance above the regolith. Surprisingly most of it survived impact.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0322_arch5.jpg\u0022 alt=\u002220150103_ksp0322_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd down! Archimedes 5 has landed!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0329_arch5.jpg\u0022 alt=\u002220150103_ksp0329_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGersted and Billy-Bobford made their way out into the dust to do the usual MÃƒÂ¼n-landing stuff. Gersted was in a bit more of a hurry than Billy-Bobford, and even planted the flag before they were both out of the lander. Billy-Bobford wasn\u0027t too bothered though, and kept grinning through the whole thing. I can only imagine his internal monologue going something like: \u0022Heya, slow down bucko! What\u0027s the rush?\u0022 But in space, no one can hear you complain.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0335_arch5.jpg\u0022 alt=\u002220150103_ksp0335_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere were still a few outstanding contracts for the MÃƒÂ¼n, such as plant a flag, so this mission managed to net a little bit of cash to work with, too. Score! Here\u0027s the crew photo for the mission, Gersted on the left and Billy-Bobford on the right. Or is it the other way around?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0337_arch5.jpg\u0022 alt=\u002220150103_ksp0337_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd of course they made their way over to the debris of the transstage to take a look. This thing was remarkably well preserved for the distance it fell. The slight tumble caused by the decoupling meant the stage landed on the decoupler itself, which seems to have absorbed most of the impact. Too bad I can\u0027t recycle this!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0338_arch5.jpg\u0022 alt=\u002220150103_ksp0338_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll good things must come to an end, and shortly afterwards our two new kerbal recruits climbed back aboard and burned for the void. Again, not being too picky with orbits here, so they just burned prograde and made for the first transfer window back to Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0343_arch5.jpg\u0022 alt=\u002220150103_ksp0343_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe idea of docking the Archimedes 5 up with the Kraken\u0027s Harvest was explored, but ultimately scrapped due to a severe lack of fuel. Instead they targeted a landing site just north of Lake Fortunate.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0350_arch5.jpg\u0022 alt=\u002220150103_ksp0350_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd adjusted the trajectory to bring them down in the lake instead. Or maybe I just forgot to account for the aerodynamic flight capabilities of the craft. No worries, crew recovered safely! Two new Level-1 Kerbonauts ready for the mission to Duna!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0357_arch5.jpg\u0022 alt=\u002220150103_ksp0357_arch5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis update is running a bit long already, the rest of this week is busy, this weekend is packed, and I\u0027m still a bit run-down from fighting a winter bug and some insomnia. So let\u0027s split this update in two and call it here (maybe I\u0027ll get some sleep?). Next time we\u0027ll run one more of these training missions, do a few other things, get the crews up to their respective Duna ships, and then \u003Cem\u003Emaybe\u003C/em\u003E \u003Cem\u003E\u003Cstrong\u003EMAYBE\u003C/strong\u003E\u003C/em\u003E we\u0027ll make the burn for Duna. Maybe.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cstrong\u003EBonus Content\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe \u00221970s Rockwell Delivery Van,\u0022 otherwise known as the \u0022Space Shuttle\u0022 is available on KerbalX: \u003Ca href=\u0022http://www.kerbalx.com/crafts/687\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalx.com/crafts/687 \u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWith some more info over on reddit where I first shared it: \u003Ca href=\u0022http://www.reddit.com/2qn2h7/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reddit.com/2qn2h7/ \u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd of course a bit more over in our Google\u002B Community (assuming you can find it with the terrible search G\u002B uses). More photos (same as those shared on reddit) are available at imgur: \u003Ca href=\u0022http://imgur.com/a/XCJvs#LOghdaF\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/XCJvs#LOghdaF \u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd an updated \u0022current\u0022 craft file from my website that allows for a crew of 8 and has a bit more polish applied (boosters don\u0027t have parachutes in this version though): \u003Ca href=\u0022http://0div0.org/files/Eagle-Crew.craft\u0022 rel=\u0022external nofollow\u0022\u003EEagle-Crew.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWindows 8 hates me, or at least hates that I play KSP, and wants me to go back to OS-X. If I could afford the money and the space for one of those new 5k iMacs I might oblige it (though I\u0027d rather just keep the money and have the free space instead).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/20150101_bluesod.jpg\u0022 alt=\u002220150101_bluesod.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd finally, the Kraken\u0027s Harvest keeps living up to its name. So far it has clipped the launchpad three times, all while in orbit. The little cloud of smoke next to the engines? That\u0027s not from Kerbin\u0027s atmosphere. Yippee. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/adlunam/20150103_ksp0826_kraken.jpg\u0022 alt=\u002220150103_ksp0826_kraken.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUntil next time, sleep well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-21T22:24:16Z\u0022 title=\u002206/21/2015 10:24  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2015-01-22T08:13:50Z","Content":"\n\u003Cp\u003EOh god, not the hitting the space center from orbit bug, that one split a whole station in half for me. Just another reason to keep quicksaves and reloads on.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-01-22T16:16:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003EOh god, not the hitting the space center from orbit bug, that one split a whole station in half for me. Just another reason to keep quicksaves and reloads on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlmost seems to be an epidemic in 0.90. The \u0022randomly exploding launchpad\u0022 is also a good reason to keep quicksaves and reverts turned on.\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2015-01-23T00:14:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022 data-cite=\u0022Cydonian Monk\u0022\u003E\u003Cdiv\u003EAlmost seems to be an epidemic in 0.90. The \u0022randomly exploding launchpad\u0022 is also a good reason to keep quicksaves and reverts turned on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was able to keep that one down by putting my ships on very highly mounted launch stability enhancers, which helps prevent it, but looks kinda ugly.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-01-23T07:12:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003EI was able to keep that one down by putting my ships on very highly mounted launch stability enhancers, which helps prevent it, but looks kinda ugly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAye. That tends to be the only fix I\u0027ve found to the few craft that are persistent about it. Or at least shifting up by a meter or so.\u003C/p\u003E\n"}]}