{"TopicId":80915,"ForumId":16,"TopicTitle":"Where\u0026#039;d my mods go!?","CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2014-08-06T13:28:42Z","PageNum":1,"Articles":[{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2014-08-06T13:28:42Z","Content":"\n\u003Cp\u003EBeen playing KSP on an old laptop that was pretty far under min spec. 2 fps, 1 second in game takes 10 secs realtime, etc, etc...\u003C/p\u003E\u003Cp\u003EGot a new machine to deal with OpenGL issues, and to be honest getting good frame rates for KSP was my biggest dream of this machine. \u003C/p\u003E\u003Cp\u003EI grabbed the old install from the old machine, put the entire KSP_win folder on a flash drive, dropped it into the program files of the new machine. (Old machine XP, new Win 7x64).\u003C/p\u003E\u003Cp\u003EThe game runs like a dream. The saves are there, the parts for the mods are there, but no functionality. \u003C/p\u003E\u003Cp\u003EI installed the x64 version of KSP, but it\u0027s having issues (load screen bar doesnt progress, but the jokes change), so I\u0027m going to back to my old install of the x32 23.0 version I was running. \u003C/p\u003E\u003Cp\u003EGame runs like a champ, parts are there, mods functionality is not. For example, I can place the mechjeb2 part on a new ship, but I get no windows in either the VAB or pad. \u003C/p\u003E\u003Cp\u003ESo it\u0027s a two part question.\u003C/p\u003E\u003Cp\u003EOne) How do I get my old save game to work with the new machine? Lots of ships, farthest I\u0027ve \u0022made it\u0022 so far in KSP (rovers on most bodies, 2 interplanetary mother ships in orbit around kerbin, with a 3rd docked to the space station with a fuel tender also docked, beginnings of a moon base, etc). While that may not be far for some, when trying to orbit around 200 tons of payload takes about 1 hour of realtime, and another hour of docking (Hence mechjeb), this is serious progress. Keeping the old version is kinda preferred, as the new version may break or obsolete some of my old designs. \u003C/p\u003E\u003Cp\u003E2) What issues with x64 should I know about? (Ie, wheres the x64 halp! thread?)\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-08-06T13:58:07Z","Content":"\n\u003Cp\u003E64 bits means 0.24.x . Mechjeb with part means older mods. Solution: Update your Mods to 0.24 compatible.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-08-06T16:43:01Z","Content":"\n\u003Cp\u003EYeah, like Sirine said. You need to make sure the mod versions you are using are compatible with the KSP version you are using. For most mods, it can be difficult to determine which mod versions are compatible with older versions of KSP because the version numbers don\u0027t match up.\u003C/p\u003E\u003Cp\u003EYour best bet is to download the newest KSP, and the latest version of all your mods. You can copy your save games over into the new install.\u003C/p\u003E\u003Cp\u003EI couldn\u0027t tell you why copying over your entire old KSP install broke your mods. Maybe you copied the files into an incompatible location on your new computer. Make sure you keep KSP away from places like the desktop, or \u0022my documents.\u0022\u003C/p\u003E\u003Cp\u003Ex64 specific issues can be found here:\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86817-0-24-2-x64-%2864-bit%29-for-Windows-List-of-bugs-and-issues-possible-fixes\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/86817-0-24-2-x64-%2864-bit%29-for-Windows-List-of-bugs-and-issues-possible-fixes\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"}]}