{"TopicId":81121,"ForumId":16,"TopicTitle":"Here\u0026#039;s a tip for when stuff stops working","CreatedByName":"ansaman","CreatedById":78227,"CreatedDateTime":"2014-08-08T05:45:43Z","PageNum":1,"Articles":[{"CreatedByName":"ansaman","CreatedById":78227,"CreatedDateTime":"2014-08-08T05:45:43Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027times new roman\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#0000ff;\u0022\u003E\u003Cstrong\u003ETonight, I was going to wrap up a very long mission and when I advanced the throttle, nothing happened. If I could not get off Bop, I would have to transmit the science rather than recover it and lose a boatload of science. I had plenty of fuel and electrical power. The old \u0022try turning it off and on again\u0022 worked. I exited to the tracking station and then went back to the probe and Bop and it worked. I believe doing that re-initializes stuff in the program and I have found if something stops working this will help a lot. \u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-08-09T12:59:09Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003ESometimes, the same bug occurs when wanting to read the Too Hot thermometer for logging and transmitting the results. The same solution works for that as well.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-09T16:15:06Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003ETurning it off and on again works for a lot of issues. If reload from the tracking center doesn\u0027t fix it, sometimes a restart of the game itself does.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-08-09T16:54:17Z","Content":"\n\u003Cp\u003EMy big wtf bug is when staging completely gets stuck. The space bar just doesn\u0027t function. And I have no fix for it. The only way is to restart the game. By far THE most annoying bug in my game.\u003C/p\u003E\u003Cp\u003EPs: Why\u0027s everyones text blue?\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-08-09T17:18:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EMy big wtf bug is when staging completely gets stuck. The space bar just doesn\u0027t function. And I have no fix for it. The only way is to restart the game. By far THE most annoying bug in my game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, most annoying bug currently in the game. I\u0027ve lost count of how many launches I\u0027ve scrubbed because the stages just stop separating. No damage, plenty of power. Just no separation on staging.\u003C/p\u003E\u003Cp\u003ELuckily, I fly mostly SSTOs and only launch station components on rockets. So this doesn\u0027t bite me \u003Cem\u003Ethat\u003C/em\u003E often. Now that my spacedocks are installed at both Kerbin and Laythe, I haven\u0027t launched a rocket in weeks.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-08-09T21:29:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EPs: Why\u0027s everyones text blue?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo annoy the poster that started annoying the rest of us with blue.\u003C/p\u003E\u003Cp\u003EYou can also post in white, but then, it would be invisible unless you had a different color background.\u003C/p\u003E\u003Cp\u003EIf staging, orienting your ship, or engines are not working, check that you are not in time acceleration and that you have battery power.\u003C/p\u003E\n"},{"CreatedByName":"ansaman","CreatedById":78227,"CreatedDateTime":"2014-08-09T21:44:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003EIf staging, orienting your ship, or engines are not working, check that you are not in time acceleration and that you have battery power.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is also the question of focus. If you are using MechJeb and one of those windows is the active window, other functions will not work until you left click the main screen to give it focus.\u003C/p\u003E\u003Cp\u003ESince blue text is so annoying, I won\u0027t use it anymore.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-08-10T02:25:47Z","Content":"\n\u003Cp\u003ENa I don\u0027t know what it is. When the bug occurs ( Something causes it, but idk what ). The only thing that works is restarting. Power? Check. Time warp? None and yes I click the main screen after messing with MJ. \u003C/p\u003E\u003Cp\u003EIt\u0027s only a big problem with ascents where you have to fire engines and a decoupler.\u003C/p\u003E\n"},{"CreatedByName":"Jett_Quasar","CreatedById":117851,"CreatedDateTime":"2014-08-10T02:31:33Z","Content":"\n\u003Cp\u003EYour throttle won\u0027t work if your mouse pointer is hovering over your staging icons (left hand side). I\u0027m not sure if it affects anything else like controls, but if your throttle isn\u0027t working check where your pointer is.\u003C/p\u003E\u003Cp\u003EJR\u003C/p\u003E\n"}]}