{"TopicId":81351,"ForumId":16,"TopicTitle":"Docking in space","CreatedByName":"CuAnnan","CreatedById":81022,"CreatedDateTime":"2014-08-10T21:15:03Z","PageNum":1,"Articles":[{"CreatedByName":"CuAnnan","CreatedById":81022,"CreatedDateTime":"2014-08-10T21:15:03Z","Content":"\n\u003Cp\u003ESo I\u0027m trying to build a segmented space station in the latest vanilla through steam.\u003C/p\u003E\u003Cp\u003EThe targetting reticules and distances all seem to only refer to the cupola module that sits atop my main station and I can\u0027t seem to change it.\u003C/p\u003E\u003Cp\u003EI\u0027ve set the target for the clamp-o-tron docking port and I\u0027m controlling my second segment from its docking port.\u003C/p\u003E\u003Cp\u003EIs there some other step I need to undertake to ensure that things are the way they should be?\u003C/p\u003E\u003Cp\u003EAnd is there any way to have the navball\u0027s horizon be relative to the docking point as opposed to the body around which you are orbitting? which is about as useful as a baseball bat at a tennis match.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-10T21:40:51Z","Content":"\n\u003Cp\u003EIf you select \u0022control from here\u0022 the navball orientation should match the docking port\u0027s orientation. Do check the port isn\u0027t backwards, a common problem with the Sr ports.\u003C/p\u003E\u003Cp\u003EThe target direction indicator can be a bit off and the distance tends to ignore that selection altogether, so you may have to use visuals as well as the instruments.\u003C/p\u003E\u003Cp\u003EThe horizon on the navball is always going to be that of the orbited body, that\u0027s kind of the point. V toggles between camera modes, \u0022chase\u0022 makes the camera orientation match the controlling part, and can be useful for docking (and driving and atmospheric flying for that matter).\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-08-10T21:44:51Z","Content":"\n\u003Cp\u003EA couple of tips:\u003C/p\u003E\u003Cp\u003E1. Set your different craft\u0027s orientation to the Normal \u002B or Normal - orientation. This is at 180 (South) degrees or 0/360 degrees (North) if your orbit is a prograde orbit with 0 degrees of inclination. As you move around the planet, the craft will spin about its longitudinal axis, but the docking port will stay in the same orientation. This allows you to take much longer to dock than normal.\u003C/p\u003E\u003Cp\u003E2. Watch Scott Manley. Seriously he is the best of us.\u003C/p\u003E\u003Cp\u003ETo answer your questions, everything sounds good. The distance on the navball is the linear distance from your point of control to the docking port. As far as the horizon is concerned, I\u0027m not sure that I know what you are referring to. Placing your navball in target mode (by clicking on the box where your speed is) may help.\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-08-10T22:08:12Z","Content":"\n\u003Cp\u003EOnce you have a target vector and pro/retrograde marker, you\u0027re all set to dock, at literally any possible distance where a target vector will appear. \u003C/p\u003E\u003Cp\u003EAt that point, the first step is to slow down to a speed manageable by RCS. 0-50m/s is ideal if you have at least 4 RCS pods. After that, the key is to just use your RCS controls to move your grade marker onto the target, and then use the RCS to move towards the target while keeping those two markers lined up. \u003C/p\u003E\u003Cp\u003EAs you approach your target, you\u0027ll likely have to maneuver around to orient the two craft properly. Be sure when you make these alignment adjustments to turn off RCS, as otherwise that will throw off your velocity and you\u0027ll have to expend more fuel to correct it. If you take a slower approach, however, it is possible to keep RCS on and use it to align the two crafts.\u003C/p\u003E\u003Cp\u003EOnce you can verify that your two ports are aligned properly, all it is is a matter of matching the grade and target vectors again and moving towards the target.\u003C/p\u003E\u003Cp\u003EThat is the best and most efficient method for docking, short of literally timing your burns and craft orientation in such a way that you dock automatically at your closest approach. (IE, hitting a 1cm target on a moving train while riding a horse that\u0027s trying to buck you off. OH and your blind folded and have no arms)\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-08-10T22:58:28Z","Content":"\n\u003Cp\u003EGo mods:\u003C/p\u003E\u003Cp\u003ENavyFish\u0027s docking alignment window is probably best known.\u003C/p\u003E\u003Cp\u003EThe NavNallDockingAlignmentIndicator is a more minimalist tool derived from it.\u003C/p\u003E\u003Cp\u003ERMP\u0027s docking mode will give you a TV view from your ship\u0027s controlling docking port.\u003C/p\u003E\u003Cp\u003EMJ\u0027s custom window editor will let you display all the docking figures you can dream of, if you can cope with raw numbers.\u003C/p\u003E\u003Cp\u003EThese four, I know, correct for the target port, not just the target ship\u0027s Centre of Mass. There are several other mods which also give improved docking information/views.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-08-11T15:36:55Z","Content":"\n\u003Cp\u003EAll the above is good advice, but also: practice, practice, practice. Once you get the hang of it you can do it purely by eyeball.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-08-11T15:45:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EOnce you get the hang of it you can do it purely by eyeball.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr purely by navball!\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-08-11T17:41:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zarakon\u0022 data-cite=\u0022zarakon\u0022\u003E\u003Cdiv\u003EOr purely by navball!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepending on where you have the docking port, the navball may lead you astray. We\u0027ve been through that not too long ago:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86086-docking-woes-navball-parallax-error\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/86086-docking-woes-navball-parallax-error\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESecond page details why the navball can be wrong. The only solution is visual control or some of the docking indicator mods. Some of them are linked on the first page of that thread.\u003C/p\u003E\n"},{"CreatedByName":"Mesons","CreatedById":76697,"CreatedDateTime":"2014-08-11T18:20:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003EAs you approach your target\u0027 date=\u0027 you\u0027ll likely have to maneuver around to orient the two craft properly. [b\u0027]Be sure when you make these alignment adjustments to turn off RCS, as otherwise that will throw off your velocity and you\u0027ll have to expend more fuel to correct it. If you take a slower approach, however, it is possible to keep RCS on and use it to align the two crafts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETry placing your RCS ports symmetrically about your CoM (where it will be when docking), with each one in a pair the same distance away from the CoM and opposite each other. This should eliminate any unwanted rotations and any change in speed from using RCS for rotation only, and it should make translation not cause any rotation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-11T18:20:56Z\u0022 title=\u002208/11/2014 06:20  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 11, 2014\u003C/time\u003E by Mesons\u003C/strong\u003E\n\u003Cbr\u003EClarification\n\u003C/span\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-08-12T04:44:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mesons\u0022 data-cite=\u0022Mesons\u0022\u003E\u003Cdiv\u003ETry placing your RCS ports symmetrically about your CoM (where it will be when docking), with each one in a pair the same distance away from the CoM and opposite each other. This should eliminate any unwanted rotations and any change in speed from using RCS for rotation only, and it should make translation not cause any rotation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat wasn\u0027t what I was talking about. I was talking about using torque to move your craft around so that it\u0027s aligned with the target. If you keep RCS on while doing this at relatively higher speeds, it\u0027ll throw you off into a direction you didn\u0027t want, regardless of whether your RCS are placed perfectly or not.\u003C/p\u003E\n"},{"CreatedByName":"Mesons","CreatedById":76697,"CreatedDateTime":"2014-08-12T05:28:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003EThat wasn\u0027t what I was talking about. I was talking about using torque to move your craft around so that it\u0027s aligned with the target. If you keep RCS on while doing this at relatively higher speeds\u0027 date=\u0027 it\u0027ll throw you off into a direction you didn\u0027t want, regardless of whether your RCS are placed perfectly or not.[/quote\u0027]\u003Cp\u003EThis shouldn\u0027t happen unless you are translating. If you have an equal number of RCS ports firing in opposite directions, you won\u0027t have a net force, so your velocity will not change. If your velocity does in fact change, there is a bug and you should report it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"qazsedcft","CreatedById":114699,"CreatedDateTime":"2014-08-12T06:21:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003EThat wasn\u0027t what I was talking about. I was talking about using torque to move your craft around so that it\u0027s aligned with the target. If you keep RCS on while doing this at relatively higher speeds\u0027 date=\u0027 it\u0027ll throw you off into a direction you didn\u0027t want, regardless of whether your RCS are placed perfectly or not.[/quote\u0027]\u003Cp\u003EThat can also be corrected with RCS. Hit CAPS lock as you get closer (\u0026lt;20m) and fine tune your approach.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"}]}