{"TopicId":81435,"ForumId":38,"TopicTitle":"Naval Battle Club","CreatedByName":"astecarmyman","CreatedById":65422,"CreatedDateTime":"2014-08-11T17:47:57Z","PageNum":155,"Articles":[{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-25T15:57:21Z","Content":"\n\u003Cp\u003E2gud4me\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-25T19:19:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EPanzer, do you have any good expert tips for making space battleships? And making missiles. Thanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll i can say is that everything relies on the core layout. If your core is weak, it does not matter if you place 10 layers of armor on it, itll still die. The first rule i use for anything that has to take hits, is that the central spine must be made of girders. Ive had the best results with alternating XL long girder and then the shorter stubby girder, since it gives extra flexibility, and doesnt add much in terms of parts, but seems to hold out to enemy fire more reliably then just XLs one after the other. An alternative building style ive used on a few occasions is 2 girder spines running along the sides of the ship, to which structural panels are attached. This is somewhat weaker, but it gives you much more real estate inside teh ship to work with, and arguably looks cool (almost all ships that have 100% internal weapons i make use this style), and isnt that bad on part counts either.\u003C/p\u003E\u003Cp\u003EAs for what you do after, it is best to attach some structural panels from which the rest of the hull is created atop those. The inner layer (or only layer in my case as every one of my armored ships has single layer armor) should then come off of these structural panels and wrap around teh ship. You can leave small gaps (as nothing will get thru them anyways) if you want to further cut mass and part count, but keep these gaps no bigger then a oscar-B or there is a good chance that a skilled player can actually get a low velocity rcs missile through them. As for how you make the armor layers, shape is up to you, i myself like hexagonal shaped vessels for some reason, with the up and down being flat, and this style has worked decently for me when it comes to armor protection, but then again, ive also seen many other designs that work very well as well. Drek style hulls are actually quite similar to my designs, although i tend to cut alot out of them to save on parts (those stubby 650 ibeams are better armor, but kill part count so you rarely if ever see those on my craft aside from fuel tank supports.\u003C/p\u003E\u003Cp\u003ENow for the fuel, the number one rule i have is to never ever directly attach fuel to your skeleton. Fuel can really be attached anywhere, but most of my ships (and other people\u0027s ships such as dreks) have 650 ibeams attached to spine, atop which fuel sits. This works well, as the 650s are smaller and harder to hit, and the fuel tanks if hit will go down anyways, so its pointless to really armor them. Other solutions involve placing fuel externally, using many smaller tanks, but this involves part count spam, something i stay away from. This has 2 benefits, it lets you shift mass as needed to maintain stability after taking hits, and it makes your ship more redundant, with a single shot unable to actually do any real damage. Ive also experimented with unarmored fuel, which has worked well against enemies that do not have multiple shots and can at best take down some of the tanks, this also lets me focus on heavier armor for weapons and engines.\u003C/p\u003E\u003Cp\u003ENow as for engines, ive generally given up adding excessive armor over them, a well aimed shot with either a high velocity phasing round, or just having a missile fly into the rear will do damage to the engines period. That said, ive found a angled plate at the back good at deflecting weaker crap, and it doesnt even cost many parts (take a look at my SK-CRV-I ive uploaded into the craft repository to look at what ive found to work well for engine protection, that craft is crap as its broken, but the rear armor shows you very well what i use for engine protection, and its worked well for me sofar).\u003C/p\u003E\u003Cp\u003EAnyways, for more detailed tips, download some of my ships like the SK-CRV-III, or SK-CRV-I from my company page (link in signature image), and take a look at the spine and armor layout. I have nothing against you using the ideas i have in it, or even copying my hull layout if you really like.\u003C/p\u003E\u003Cp\u003EA few more tips for survival:\u003C/p\u003E\u003Cp\u003EAvoid part clipping unless its absolutely necessary, this means clipping a fuel tank, engine, whatever, while not necessarily bad, is always weaker then no clipping.\u003C/p\u003E\u003Cp\u003ENever use anything below 80 impact tolerance for the spine, if you want flexibility, use more smaller parts, otherwise, stick to XL girders as they seem to be the best.\u003C/p\u003E\u003Cp\u003EKeep missiles and fuel tanks away from the spine, these, especially weapons, can be knocked off their handpoints and fly into the ship, causing damage to the core, or even cutting the ship in half.\u003C/p\u003E\u003Cp\u003EHave some redundancy, never should you rely on a single engine, single fuel tank, ect, as well aimed fire can easily take down that critical component.\u003C/p\u003E\u003Cp\u003ENow as for weapons:\u003C/p\u003E\u003Cp\u003EThere are 2 main factors in determining missile lethality, mass, and impact tolerance. In general, the heavier the missile, even its impact is slightly less then the target, the more likely it is to overload joints (and hence split ships apart). Now as for impact tolerance, this mostly affects how likely the missile is to desintegrate on contact with enemy warship. In geenral, the higher the impact and mas,s the more lethal anything is. Still, i prefer precision and aim compared to pure force, this lets me bring more ordinance, missiles tend to be simpler, and if i aim well, i can still take a ship out of the game by either taking out its engines, or disarming it. While in the past i used to think otherwise, you dont exactly need to split every ship to get a kill, if it cant more, or cant shoot, it is for all intents and purposes useless in a battle.\u003C/p\u003E\u003Cp\u003EAnyways, on to some specifics, i tend to use 4 types of weapons in 90% of cases:\u003C/p\u003E\u003Cp\u003EThe basic unguided Ibeam\u002B2 sepatrons. These come in two varieties, either a short ibeam, with a higher velocity but way less punch, or a long one with 2 seps, you just need to shoot these from farther out to get good velocity. The short ibeam is best against fighters, and what id call medium armor (mk2 fuselages, ect), it will not with any reliability damage capitals, but you can always try to shoot at guns or engines. The longer one is semi effective vs capitals, but still, you need numbers of them to do much. Overall, these are my anti-fighter weapons, very low part count, very simple (4 parst with decoupler), can be stacked atop each other if you want more shots in a smaller space, ect.\u003C/p\u003E\u003Cp\u003EKDrones, which are my advanced guided RCS missiles. They are the best against fighters, as they are so accurate that i can with fairly high reliability hit a missile sized target at ~100-200m/s, this means an engine, weapon, whatever, will easily get hit. They vary in firepower, from teh S that is very weak, and just a RCS tank as its warhead, to the H which has a XL girder as the impactor, although it uses vernors and is highish on parts. Overall, i like to have at least 4-8 of them on a craft, with anti-fighter ships having as many as 20 or more. \u003C/p\u003E\u003Cp\u003ERT-5 torps, well, nothing fancy, just a RT-5 and a girder clipped inside, stackeable, not too large, and deadlier/lower part count then ibeams. A little heavy, but still effective if you know where to hit the enemy.\u003C/p\u003E\u003Cp\u003ETripedoes, my last and best weapon, some are for fun, some are extremely competitive (1 shot splitting dreks with high reliability), but they all share an impactor made of wheels and girders. All in all, the S is rather weak, but it comes in at such velocity that it tends to go right thru armor, and does major internal damage, while the M is comparable to a popper-H zekes uses, and teh H or S/H is just overkill against everything. These warheads are a little high on parts, and complex. As for the generalist M, i find a impactor made of 3 medium wheels (grey ones), and a stack of clipped girders does alot fo damage, the wheels act as high impact, destroying whatever the warhead hits, and the girders tend to explode sending shrapnel though the ship (clipping is bad for armor, extremely good for weapons).\u003C/p\u003E\u003Cp\u003EAlso, a final word:\u003C/p\u003E\u003Cp\u003EAccept the fact that there will ALWAYS be weapons out there capable of doing catastrophic damage such as splitting a ship out there, and there is nothing you can do to counter them. My philosophy when it comes to armor, is to maximize protection with as few parts as possible, but at the same time making it difficult to do much to with weaker weapons such as ibeams and lightweight RT-5 \u002B small panel warheads, but again, dedicated competitive weapons will split my craft with ease. Luck is also a major factor in everything, that is why i recommend bringing multiple shots every time, unless you like to quickload alot, do not expect very many 1 shot kills.\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-25T19:33:52Z","Content":"\n\u003Cp\u003EThank you very much for that extremely detailed insight, the 2 girder core is especially interesting, and I plan on making a carrier with that setup, as for tirepedos, I have seen them and made them, two, infact, an Osiris Missile (2 rugged vehicular wheels, terrier and FL-T200) and Osiris Torpedo (same as Osiris Missile but with a flea instead of tank\u002BTerrier) they both have more than just that, including probe core, reaction wheels and battery. Again, thank you alot.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-25T22:09:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EThank you very much for that extremely detailed insight, the 2 girder core is especially interesting, and I plan on making a carrier with that setup, as for tirepedos, I have seen them and made them, two, infact, an Osiris Missile (2 rugged vehicular wheels, terrier and FL-T200) and Osiris Torpedo (same as Osiris Missile but with a flea instead of tank\u002BTerrier) they both have more than just that, including probe core, reaction wheels and battery. Again, thank you alot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe dual girder core isnt actually an original idea, ive seen ships predating my own designs (although i didnt actually get that idea from anyone, just evolved that way) that share the idea.\u003C/p\u003E\u003Cp\u003EThe skeleton more oir less resembles a H shape, with girders spaced out like this:\u003C/p\u003E\u003Cp\u003E__________________________\u003C/p\u003E\u003Cp\u003E.........................|...............\u003C/p\u003E\u003Cp\u003E.........................|...............\u003C/p\u003E\u003Cp\u003E.........................|...............\u003C/p\u003E\u003Cp\u003E__________________________\u003C/p\u003E\u003Cp\u003EDots are empty space, with lines being girders, this is a top or side view (depending on it you want wide but short, or tall but not wide).\u003C/p\u003E\u003Cp\u003EThs one weakness here is that middle bar connecting everything but that just requires a dual layer outer shell around that spot. I like this scheme as it has alot of room inside it, the rear is for engines/fuel, and the entire front is weapons, fighter hangar, whatever you want it to be actually.\u003C/p\u003E\u003Cp\u003EAlso, i might try a carrier using this style, more parts then current designs, but itd also allow me to tank fire, something no AKS carrier to date has been able to do with any reliability. Thx for giving me another idea for a ship.\u003C/p\u003E\u003Cp\u003ENow, to build more ships and wipe all factions hostile to AKS out of existence, alpha site on the mun will be destroyed! Just need a bloody VTOL as ramming bunkers with scout drones isnt exactly very effective.\u003C/p\u003E\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-08-25T22:23:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EThe dual girder core isnt actually an original idea, ive seen ships predating my own designs (although i didnt actually get that idea from anyone, just evolved that way) that share the idea.\u003Cp\u003EThe skeleton more oir less resembles a H shape, with girders spaced out like this:\u003C/p\u003E\u003Cp\u003E__________________________\u003C/p\u003E\u003Cp\u003E.........................|...............\u003C/p\u003E\u003Cp\u003E.........................|...............\u003C/p\u003E\u003Cp\u003E.........................|...............\u003C/p\u003E\u003Cp\u003E__________________________\u003C/p\u003E\u003Cp\u003EDots are empty space, with lines being girders, this is a top or side view (depending on it you want wide but short, or tall but not wide).\u003C/p\u003E\u003Cp\u003EThs one weakness here is that middle bar connecting everything but that just requires a dual layer outer shell around that spot. I like this scheme as it has alot of room inside it, the rear is for engines/fuel, and the entire front is weapons, fighter hangar, whatever you want it to be actually.\u003C/p\u003E\u003Cp\u003EAlso, i might try a carrier using this style, more parts then current designs, but itd also allow me to tank fire, something no AKS carrier to date has been able to do with any reliability. Thx for giving me another idea for a ship.\u003C/p\u003E\u003Cp\u003ENow, to build more ships and wipe all factions hostile to AKS out of existence, alpha site on the mun will be destroyed! Just need a bloody VTOL as ramming bunkers with scout drones isnt exactly very effective.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe have a 141 ton super ship(I forgot the logo on the side).\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-25T22:44:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alphasus\u0022 data-cite=\u0022Alphasus\u0022\u003E\u003Cdiv\u003EWe have a 141 ton super ship(I forgot the logo on the side).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhereas i only have small crap......\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oD6Ng1U.png\u0022 alt=\u0022oD6Ng1U.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis one is 60 tons, not exactly very heavy, and short range, but it carries 12 long ibeams, and 16 KDrone guided missiles. Its 300 parts total, with teh hull being a bit under 150, guess having 28 weapons oin one ships does that to you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, i know the picture is utter crap, i dont know how to make those epic renders other people make.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-25T22:47:20Z\u0022 title=\u002208/25/2015 10:47  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2015-08-25T23:07:58Z","Content":"\n\u003Cp\u003EYou\u0027re calling 140 super.\u003C/p\u003E\u003Cp\u003E*scoffles snobbilly*\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/l53CCtk.png\u0022 alt=\u0022l53CCtk.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-25T23:29:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spartwo\u0022 data-cite=\u0022Spartwo\u0022\u003E\u003Cdiv\u003EYou\u0027re calling 140 super.\u003Cp\u003E*scoffles snobbilly*\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/l53CCtk.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/l53CCtk.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUd better be using the welding mod, i have no effin clue HOW anyone can have that many bloody parts in one spot?\u003C/p\u003E\u003Cp\u003EThat looks comparable to Zeke\u0027s whale ship, or whatever it was, the 1600 part monster!\u003C/p\u003E\u003Cp\u003EBtw, whats the part count? I think id be able to bring 10 capital ships for one of those if we matched part to part.\u003C/p\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-08-25T23:31:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spartwo\u0022 data-cite=\u0022Spartwo\u0022\u003E\u003Cdiv\u003EYou\u0027re calling 140 super.\u003Cp\u003E*scoffles snobbilly*\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/l53CCtk.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/l53CCtk.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027s the tonnage on that? Does it beat my 500 tonner?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003E*grins softly*\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2sv4TkO.png\u0022 alt=\u00222sv4TkO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s under 500 tonnes in this pic due to lack of armament in the cargo bays.\u003C/p\u003E\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-08-25T23:33:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexanderTeaH\u0022 data-cite=\u0022AlexanderTeaH\u0022\u003E\u003Cdiv\u003EWhat\u0027s the tonnage on that? Does it beat my 500 tonner?\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003E*grins softly*\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/2sv4TkO.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/2sv4TkO.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s under 500 tonnes in this pic due to lack of armament in the cargo bays.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd yet one hit from most missiles, and it dies(no armor).\u003C/p\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-08-25T23:35:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alphasus\u0022 data-cite=\u0022Alphasus\u0022\u003E\u003Cdiv\u003EAnd yet one hit from most missiles, and it dies(no armor).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s designed with looks in mind. I might slap on some armor when I get the time.\u003C/p\u003E\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-08-25T23:39:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexanderTeaH\u0022 data-cite=\u0022AlexanderTeaH\u0022\u003E\u003Cdiv\u003EIt\u0027s designed with looks in mind. I might slap on some armor when I get the time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen it would be a 700 ton 800 part monster.\u003C/p\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-08-25T23:42:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alphasus\u0022 data-cite=\u0022Alphasus\u0022\u003E\u003Cdiv\u003EThen it would be a 700 ton 800 part monster.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s already an 800 part monster with its armament. But hey, Unity 5, eh? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2015-08-25T23:42:55Z","Content":"\n\u003Cp\u003EMore than a thousand tons and 1800 parts.\u003C/p\u003E\u003Cp\u003EZekes\u0027s Wales is small by comparison.\u003C/p\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-08-25T23:44:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spartwo\u0022 data-cite=\u0022Spartwo\u0022\u003E\u003Cdiv\u003EMore than a thousand tons and 1800 parts.\u003Cp\u003EZekes\u0027s Wales is small by comparison.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBattlecruiser Mk II underway.\u003C/p\u003E\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-08-25T23:44:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexanderTeaH\u0022 data-cite=\u0022AlexanderTeaH\u0022\u003E\u003Cdiv\u003EIt\u0027s already an 800 part monster with its armament. But hey, Unity 5, eh? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, I can probably run it on its own now, but with U5 i will do better.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-26T04:57:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alphasus\u0022 data-cite=\u0022Alphasus\u0022\u003E\u003Cdiv\u003ETrue, I can probably run it on its own now, but with U5 i will do better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SQUAD\u0022 data-cite=\u0022SQUAD\u0022\u003E\u003Cdiv\u003EÃ¢â‚¬Å“ Our own code hasnÃ¢â‚¬â„¢t changed to support multithreaded physics simulation, so how exactly it will handle KSP objects like multi-rigidbody vessels, is not something we can see in detail.Ã¢â‚¬Â -Felipe (HarvesteR)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis part of the last uopdate has me less hopeful then initially, the whole issue is the multithreading of physics calcs, if it isnt multithreaded, there may be benefits that improve the game performance, but the root problem with excessive part counst is still just as much of an issue.\u003C/p\u003E\u003Cp\u003EGuess ill have to stick to barebones builds still, annoying as it is, i cant afford to get my hopes up, especially after hearing this.\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-26T08:21:44Z","Content":"\n\u003Cp\u003EI have a tip for you all to get inspired, this works for me, at least. Listen to video game music, I\u0027m listening to the music during the second part of the Dark Mind fight from Kirby Amazing Mirror, and it\u0027s fast paced, jazzy, kind of, it makes me want to make a high-speed scouting drone. I can imagine listening to Ghetsis\u0027s theme from Pokemon B/W/B2/W2 would make you want to make a BigS, scary intimidating ship, and Lysandre\u0027s theme from Pokemon X/Y would make you want to make some kind of destroyer. Try it.\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-26T09:09:05Z","Content":"\n\u003Cp\u003EUsing Panzers advice, I have put together a test carrier, fittingly named \u0022Test Carrier Please Ignore\u0022 it would never work, having no struts, but it\u0027s a start.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/eU32J\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-08-26T09:59:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EUsing Panzers advice, I have put together a test carrier, fittingly named \u0022Test Carrier Please Ignore\u0022 it would never work, having no struts, but it\u0027s a start.\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/eU32J\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/eU32J\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice! Although I so very much prefer to use the airplane fuselage and wing parts for building carriers, because it\u0027s a lot easier to make them and gives you more creative freedom! At the end of the day, it\u0027s not a frontline ship, and if you armor it effectively, regardless of that, you\u0027ll not only have an insane part count, but you\u0027ll barely be able to transport the fighters it\u0027s made for.\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-26T10:26:23Z","Content":"\n\u003Cp\u003EIt\u0027s not meant to be used, just to test how I can build using it, thanks anyway.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-08-26T13:22:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spartwo\u0022 data-cite=\u0022Spartwo\u0022\u003E\u003Cdiv\u003EMore than a thousand tons and 1800 parts.\u003Cp\u003EZekes\u0027s Wales is small by comparison.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENASA called. They want their supercomputer back.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-26T18:29:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EUsing Panzers advice, I have put together a test carrier, fittingly named \u0022Test Carrier Please Ignore\u0022 it would never work, having no struts, but it\u0027s a start.\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/eU32J\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/eU32J\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats the base design i use for carriers, but they are either way smaller, or have wings for the actual hull. The whole idea is to cut down on the whole \u0022split in half with a single hit\u0022 issue many vessels that arent built using a girder frame have. Also, be aware, if you have that many structural panels, you are going to need struts like nothing else. Most of my craft are much lighter, and hence a few struts here and there if needed, but struts actually dont seem to improve armor too much, and badly placed, they can make it too stiff for its own good and make it easier to split or kill in a ramming attack.\u003C/p\u003E\u003Cp\u003EMy favorite method to make carriers is with a H frame and then the usual elongated hexagon front out of wings all my vessels seem to share (3/6 way symmetry = advanced, and 5 way symmetry is just unique so ive started using that a few times too). This design will take damage, but it is unlikely to be taken out completely, and the actual armor plate goes over the engines only. Carriers are never designed to be shot at (assault carrier yes, but ive yet to make one of those at a low part count and not MK2 armored), so the whole super armor is pointless anyways. Then again, if you consider that carriers shouldnt get hit anyways, using MK3 parts is always a good idea, very low part count, lots of fuel, and most of all they look decent as they are if you build in the right shape.\u003C/p\u003E\u003Cp\u003EAlso, im working on two new ships, a very minimalistic SK-CRV-Ig4 (even less protection, but a hull of ONLY 146 bloody parts including weapons hardpoints that arent all even used, i dont know how you can get a much better bang for your part count), and a new Sk-CRV-IIg4 to go alongside it. The class-I uses my usual hull and mounting points for weapons, whereas the class-II uses the H-frame style and has all weapons forward firing (worse armor, easier to knock out with good aim, but looks cooler imo and isnt exactly a easy kill either). Both have 2 layers of armor, wings and then the structural panels as usual. The only real downside to these craft is the fuel mounts, half teh tanks have no fuel lines, and all of them are attached to teh outer hull, making them very suceptible to being damaged even if the round doesnt penetrate fully. But im very happy with their part counts.\u003C/p\u003E\u003Cp\u003EYou cant beat a 210 part ship with armed with 6 long Ibeams, and 4 Tripedoes (210 parts makes many bombers look bad). That or the 6 ibeams, 8 Drone-Ss, and 8 KDrone-Ms for 256 parts. And its near immune to anything without a 80m/s impactor, is extremely resilient to short or stubby ibeam weapons, and can take quite a beating from long ibeams too. Ive even hit it with RT-5 weapons to no major effect, but multiple hits with them will take it out reliably.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EI think i just figured out teh trick to armoring stuff and keeping the core alive against near anything but direct hits to it with competitive weapons! Now presenting my new ship that has yet to be taken out by ibeams or RT-5 torps. testing was done with a sahip that mounted 12 of the ibeam weapons, and 2 RT-5s.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BEnPhWM.png\u0022 alt=\u0022BEnPhWM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethe absolute maximum ive managed to do to this thing with conventional weapons (Ibeam\u002B4 sepatrons, and RT-5 \u002B structural panel\u002Bdecoupler) is knock off some armor around the sides, take out some fuel, or knock out 2 of the engines! It like anything else dies to accurate Popper-Hs, Tripedoes, ect, but hell, if a drek can be killed by it fairly reliably, i consider it a competitive weapon and thus i dont care if it kills me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, and consider reliably defending against these weapons pointless.\u003C/p\u003E\u003Cp\u003Ethe armor takes advantage of 4th generation tech, with actually less parts (albeit slightly more mass then older models). Im very happy with the results now, B-Corp will burn as soon as these things are deployed by AKS.\u003C/p\u003E\u003Cp\u003EOhh, and the entire hull is exactly 137 parts, including in excess of 10 parts that you could remove and have no issues at all with performance. It features universal weapons systems, allowing one to have either 4 0.6m missiles, or one 1.2m one in every one of 4 bays on the top/bottom. if you only want 1.2m weapons, that is 16 parts that can get chucked right off the bat. Replacing teh forward firing 6 shot ibeam cannons with a double 1.2m RT-5 cannon will cut parst down by 4 more. In heavy weapons configuration, and with docking ports, lights, and other arguable useless junk removed, you have ONLY 111 parts (with supplementary wing armor removed that drops to 79 parts, allowing you to field entire battlefleets!). This means that part to part, i can field like 4 of these for a drek, and they are 45 tons heavy without weapons with ~2500 dV with 15 tons of weapons aboard. Probably my best ship (provided no fatal flaws are discovered with further testing).\u003C/p\u003E\u003Cp\u003Ei guess trying to make something that i can field in massive quantities in one area created the best ship ive ever made. Now, lets see if a 3 vs 2 battle can be pulled off with all ships loaded at once (and removed some of the guns).\u003C/p\u003E\u003Cp\u003EActually i forgot to add RCS, so add 6 parts to these values.....still, nothing compared to most craft.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003ESome more testing, and i certify this more or less super resilient to ibeams of all varieties at almost all ranges and velocties (ive only had some effective damage to it at ~1km with a single long ibeam\u002B2 seps, it seems if you go too fast the ibeams desintegrate on contact or just pass through not interacting, or do minor is any serious damage, and too slow, and you wont do jack to it either). It has taken some critical damage from RT-5s at extremely high velocity, but as with the ibeams, nothing that would actually cut it in half or the like.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lQ4tt8m.png\u0022 alt=\u0022lQ4tt8m.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe older but still great SK-CRV-Ig3 opening fire at my prototype vessel with ibeam weapons.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/49Iw7aG.png\u0022 alt=\u002249Iw7aG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENope, took massive damage, lost one engine, some weapons, armor, ect, still bloody alive and could easily ruin someone\u0027s day! I was firing at it from the side that would be considered weakest btw, so at other angles it can easily outperform this sort of damage levels (no kerbals were killed in ths test, Jeb was evacuated from the ship before the shooting gallery occured!).\u003C/p\u003E\u003Cp\u003ENot bad at all for a 258 part ship, packing 6 medium railguns (what ive started calling ibeams, sounds more badass and the ibeams do kinda look like rails), 8 KDrone-S, and 8 KDrone-M guided missiles, properly deployed and with good aim, this thing is borderline guaranteed to wipe out an entire garrison of fighters, as well as their carriers and support ships (its got over 20 shots, each one can wipe out a fighter or do nice solid damage to weakly armored craft).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-27T03:31:18Z\u0022 title=\u002208/27/2015 03:31  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 27, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-08-27T10:57:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003E-snip-\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EImpressive!\u003C/p\u003E\n"},{"CreatedByName":"ScriptKitt3h","CreatedById":82780,"CreatedDateTime":"2015-08-27T18:06:26Z","Content":"\n\u003Cp\u003E\u003Cem\u003EI\u0027m baaaack!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y59IMNQ.png\u0022 alt=\u0022Y59IMNQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI got new ships to field, too. They\u0027re just not ready for the spotlight yet.\u003C/p\u003E\n"}]}