{"TopicId":81531,"ForumId":56,"TopicTitle":"Ayuda con contratos.","CreatedByName":"Hector5","CreatedById":118687,"CreatedDateTime":"2014-08-12T17:39:08Z","PageNum":1,"Articles":[{"CreatedByName":"Hector5","CreatedById":118687,"CreatedDateTime":"2014-08-12T17:39:08Z","Content":"\n\u003Cp\u003EBuenas, soy nuevo en el foro y en el juego, escribo mi primer post para ver si alguine puede echarme una mano, estoy atascado con algunos contratos que me dan en el modo carrera y no entiendo el por que. En varios me pasa lo mismo, por ejemplo en el contrato \u0022rockmax BAAC solid fuel booster in flight over kerbin\u0022 tienes que cumplir algunas condiciones de vuelo (altitud, velocidad, etc) y desacoplar el mÃƒÂ³dulo principal y abrir paracaÃƒÂ­das mientras se cumplen esas condiciones ( o eso me parece, Ã‚Â¿no?), solo consigo que se de la altitud adecuada y la velocidad durante unos segundos que es cuando desacoplo el mÃƒÂ³dulo y abro el parecaÃƒÂ­das, pero en seguida baja la velocidad o la altura y no me da por buena la realizaciÃƒÂ³n del contrato. Ã‚Â¿A que se debe? Ã‚Â¿debo mantener la altura y velocidad durante un tiempo determinado?. Bueno como ven no tengo mucha idea...estoy empezando con el juego. Bueno, ya que estamos, si alguien me pudiese explicar como realizar los contratos en lo que unas de las condiciones es \u0022splashed down\u0022, que se supone que es amerizar, yo dejo caer el modulo principal sobre el agua con los paracaÃƒÂ­das y me sale como que he cumplido las condiciones del contrato, pero no me lo da por realizado. Bueno muchas gracias y a ver si algun alma caritativa me echa un cable, que la verdad es que cuesta encontrar documentaciÃƒÂ³n/informaciÃƒÂ³n en castellano sobre el modo carrera.\u003C/p\u003E\u003Cp\u003ESaludos.\u003C/p\u003E\n"},{"CreatedByName":"Desmadrado","CreatedById":118813,"CreatedDateTime":"2014-08-13T08:57:37Z","Content":"\n\u003Cp\u003EHola Hector5, yo soy nuevo en el foro pero llevo jugando un tiempo largo al Kerbal, lo primero esque el rockmax BAAC es un motor solido, uno que es un propulsor blanco alargado (si no me equivoco) y tienes que activarlo cuando se den todas las condiciones del contrato. Simplemente cuando veas que se han ticado todas en verde es el momento que actives la pieza que te dicen. Cuando te dicen splashed down se refiere a que estes metido en el agua, simplemente con que lleves el cohete al agua y dentro de ella veas que el tick verde del contrato se te ha activado tu activas la pieza que te diga. \u003C/p\u003E\u003Cp\u003ECuando vayas a hacer un contrato fijate en que pieza te dicen que pruebes, rockmax(propulsor), parachute(paracaidas),desacoupler(desacoplador),etc... te lo preparas y miras cuando cumples lo del contrato y activas esa la pieza.\u003C/p\u003E\u003Cp\u003EOtra cosa mÃƒÂ¡s, procura salvar la mayor cantidad de piezas que puedas(no siempre podrÃƒÂ¡s) porque asÃƒÂ­ te devolverÃƒÂ¡ el dinero de ellas.\u003C/p\u003E\n"},{"CreatedByName":"sardaukar11","CreatedById":78648,"CreatedDateTime":"2014-08-13T15:55:01Z","Content":"\n\u003Cp\u003Eesos contratos que piden en vuelo a cierta altura y velocidad aveces no rinden en relacion dificultad/beneficios.\u003C/p\u003E\u003Cp\u003Ees aveces mas rentable cumplir el deir a tal o cual lado, aunque requiere mas inversion\u003C/p\u003E\u003Cp\u003Epodes probar si queres el mod Fineprint, aÃƒÂ±ade 6 tipos extra de contratos muy interesantes, desde sobrevolar ciertos puntos especificos del planeta para investigarlos, a armar bases en planetas, pasando por poner satelites en orbitas especificas, o una estacion orbital\u003C/p\u003E\u003Cp\u003Eicluso te pide capturar asteroides y llevarlos a orbitas de kerbin o deflectarlos de la influencia de kerbin para que no impacten \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Etambien pide aveces contratos de explorar la superficie de algun lugar via rover, con puntos por los que pasar, es un muy buen mod por lo que parece\u003C/p\u003E\n"},{"CreatedByName":"Hector5","CreatedById":118687,"CreatedDateTime":"2014-08-13T18:48:25Z","Content":"\n\u003Cp\u003EMuchas gracias \u0022Desmadrado\u0022, me ha servido mucho lo que me comentas, por fin he podido realizarlos. En el de splashed down he sufrido hasta que me he dado cuenta que el motor a probar reventaba al contacto con el agua, con ponerle mÃƒÂ¡s paracaÃƒÂ­das se arregla. Y gracias sardaukar11 por la info, antes de meterme en mods para traer satÃƒÂ©lites voy a intentar llegar a la luna xD, pero tomo nota.\u003C/p\u003E\n"},{"CreatedByName":"Desmadrado","CreatedById":118813,"CreatedDateTime":"2014-08-14T07:53:14Z","Content":"\n\u003Cp\u003ENo soy de usar mods, me gusta el estilo \u0022vanilla\u0022, y haciendo solamente contratos y contratos me he levantado 1 millÃƒÂ³n de (como se llama la moneda de kerbin?)...digamos dolares \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E, cuando hago contratos calculo cuanto me gasto, minimizo lo que voy a necesitar para cada misiÃƒÂ³n y procuro hacer varios contratos de golpe si se puede. Y el arbÃƒÂ³l de ciencia lo estoy haciendo solamente con contratos, apenas cojo muestras o analizo, ya lo hice en el anterior \u0022carrera espacial\u0022.\u003C/p\u003E\n"},{"CreatedByName":"sardaukar11","CreatedById":78648,"CreatedDateTime":"2014-08-14T14:32:37Z","Content":"\n\u003Cp\u003Eyo antes no queria usar mods, pero hay algunos que agregan cosas que el juego no tiene o considero necesita\u003C/p\u003E\u003Cp\u003Epor ejemplo el engineer redux, te da la medicion del deltaV de la nave, no me parece serio que el juego me diga necesitas tantos m/s para una maniobra, preo no me diga cuandos m/s tengo \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003Ey el de los contratos, la verdad que aunque aun es una muestra, y esta en desarrollo, son pocos y poco variados los del juego por ahora, este mod, fineprint, le da mas variedad a la cosa y te da un motivo para hacer un satelite, y un reto poniendote orbitas con ciertas complicaiones\u003C/p\u003E\u003Cp\u003Eo capturar un asteroide, si, es lindo hacerlo solo, pero en el modo carrera por ahora no te sirve de nada hacerlo por gusto, almenos te dan un surtido\u003C/p\u003E\u003Cp\u003Eigual para gustos colores dice el dicho \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Epero si podes un dia probalo, tiene mi sello de garantia! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sardaukar11","CreatedById":78648,"CreatedDateTime":"2014-08-14T14:33:57Z","Content":"\n\u003Cp\u003Eyo con los contratos normales voy por 800.000 \u0022fondos\u0022 (suena horrible en espaÃƒÂ±ol)\u003C/p\u003E\u003Cp\u003Ey todavia no acepte la mision de ir a duna o ike, quiero desbloquear los SR docking ports, no pude jugar mucho hasta ahora\u003C/p\u003E\n"},{"CreatedByName":"LTRoxas","CreatedById":108159,"CreatedDateTime":"2014-08-17T11:48:31Z","Content":"\n\u003Cp\u003EOtro mod que en mi opiniÃƒÂ³n es esencial es el Kerbal Alarm Clock. Que te diga cual es el mejor momento para hacer viajes a otros planetas gastando el menor combustible es importantÃƒÂ­simo para economizar en el modo carrera. Y para reutilizar el 100% de mis naves uso el mod Space plane plus. Parece que para la 0.25 estÃƒÂ¡n trabajando en nuevas piezas tipo Mk3 con oxidante y tambiÃƒÂ©n bahÃƒÂ­as de carga. Mientras no salga la 0.25 usarÃƒÂ© en la 0.24 el mod. Por cierto el mod de mas contratos era necesario, al final te cansas de los mismos contratos.\u003C/p\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-08-17T13:57:45Z","Content":"\n\u003Cp\u003EHola,\u003C/p\u003E\u003Cp\u003Epara eso LTRoxas puedes usar el MechJeb que pode hacer el mismo y mejor y no solo el tiempos de viajes.\u003C/p\u003E\n"},{"CreatedByName":"LTRoxas","CreatedById":108159,"CreatedDateTime":"2014-08-17T17:35:18Z","Content":"\n\u003Cp\u003EYa, pero tengo oÃƒÂ­do que ese mod conduce las naves automÃƒÂ¡ticamente y a mi me gusta usarlas por mi mismo. (no se si sera una opciÃƒÂ³n activar o desactivar el piloto automÃƒÂ¡tico)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-17T19:55:01Z\u0022 title=\u002208/17/2014 07:55  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 17, 2014\u003C/time\u003E by LTRoxas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-08-21T03:22:45Z","Content":"\n\u003Cp\u003EHombre no necesitas de usar el piloto automÃƒÂ¡tico, mejor no necesitas de usar todo, solo debes usar las funciones de Delta V y las funciones de calculo, tambiÃƒÂ©n puedes crear las rotas y no necesitas de grandes cÃƒÂ¡lculos, despuÃƒÂ©s se lo tienes el piloto (ON) o no tu decides.\u003C/p\u003E\u003Cp\u003ESaludos\u003C/p\u003E\n"},{"CreatedByName":"Desmadrado","CreatedById":118813,"CreatedDateTime":"2014-08-21T11:49:06Z","Content":"\n\u003Cp\u003EAlgÃƒÂºn dÃƒÂ­a lo probarÃƒÂ©, cuando me acabe el ÃƒÂ¡rbol de tecnologÃƒÂ­a, que asÃƒÂ­ sabre para que vale cada cosa, lo ÃƒÂºnico malo es que yo tengo Kerbal por Steam y se me actualiza solo, claro si tengo un mod ya me sale con: Esta versiÃƒÂ³n es incompatible con estas extensiones, tengo que mirar alguna forma de que no se me actualice solo. Pero gracias de todos modos.\u003C/p\u003E\n"},{"CreatedByName":"HECHICERO100","CreatedById":42275,"CreatedDateTime":"2014-08-27T01:55:42Z","Content":"\n\u003Cp\u003EHola estoy atascado con el contrato de tes del descoupler T18-A no entiendo porque no me lo habilita me dice en las notas que debo probarlo en kerbin y el otro landed o sea aterrizado me quedan en verde pero el contrato sigue sin cumplirse, a quien le pasa lo mismo?\u003C/p\u003E\n"},{"CreatedByName":"sardaukar11","CreatedById":78648,"CreatedDateTime":"2014-08-27T02:25:46Z","Content":"\n\u003Cp\u003Esi te dice landed, proba poner una capsula y el decoupler abajo, solo eso, y apreta espacio a ver si lo cumple, si con todo en verde y haciendo eso no funciona, podrÃƒÂ­a estar buggeado, aunque me suena raro la chance esta\u003C/p\u003E\u003Cp\u003Euna captura del contrato para verlo bien y de la nave cuando esta todo en verde ayudarÃƒÂ­a al diagnostico!\u003C/p\u003E\n"},{"CreatedByName":"Desmadrado","CreatedById":118813,"CreatedDateTime":"2014-08-27T10:17:40Z","Content":"\n\u003Cp\u003ERecordad que cuando se trata de algÃƒÂºn propulsor, desacoplador o algo parecido SIEMPRE tienes que activarlo con el espacio, no vale hacerlo con el botÃƒÂ³n derecho y clicando. Salvo los que ponga en su apartado [\u002BNote] que te ponga RUN TEST, en esos tienes que hacerlos con el botÃƒÂ³n derecho encima de la pieza y te saldrÃƒÂ¡ la opciÃƒÂ³n, activala cuando cumples los requisitos.\u003C/p\u003E\n"},{"CreatedByName":"HECHICERO100","CreatedById":42275,"CreatedDateTime":"2014-08-27T12:16:34Z","Content":"\n\u003Cp\u003EOk lo intentarÃƒÂ© pero no se bien como colocar una captura en este foro, intentarÃƒÂ© hacerlo como dices sardaukar11, luego te cuento, gracias\u003C/p\u003E\n"},{"CreatedByName":"sardaukar11","CreatedById":78648,"CreatedDateTime":"2014-08-27T13:23:59Z","Content":"\n\u003Cp\u003Ecaptura la imagen con f1 o f12, no recuerdo cual era, y luego subela a imgur o algun servicio similar, luego click en insert image y ahi pegas el link de la imagen que subiste\u003C/p\u003E\u003Cp\u003Epero primero prueba lo de apretar espacio que on eso por ahi se resuelve \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"HECHICERO100","CreatedById":42275,"CreatedDateTime":"2014-08-30T16:35:17Z","Content":"\n\u003Cp\u003EBueno ahora se como hacerlo es que estaba confundiendo las piezas hay dos que son parecidas el Separador en LÃƒÂ­nea TR 18 A y yo estaba haciendo un contrato que era de otro separador llamado TT 18-A que es el estabilizador de lanzamiento como muestra en esta imagen. cuidado que le puede pasar a cualquiera fijarse bien las piezas que os piden antes de aceptar un contrato\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8wE04TW.jpg?1\u0022 alt=\u00228wE04TW.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-30T17:15:24Z\u0022 title=\u002208/30/2014 05:15  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 30, 2014\u003C/time\u003E by HECHICERO100\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HECHICERO100","CreatedById":42275,"CreatedDateTime":"2014-08-30T22:49:34Z","Content":"\n\u003Cp\u003EAlguien hizo este contrato?? Pues me esta volviendo loco: \u003Cimg src=\u0022http://i.imgur.com/pyT0afv.png\u0022 alt=\u0022pyT0afv.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Desmadrado","CreatedById":118813,"CreatedDateTime":"2014-09-01T08:54:31Z","Content":"\n\u003Cp\u003EYo lo hice y creo que fue que lo hice mientras subÃƒÂ­a al punto mÃƒÂ¡s alto, antes de empezar a orbitar se me activo todo y me funciono, pero nunca orbitÃƒÂ© alrededor de Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"HECHICERO100","CreatedById":42275,"CreatedDateTime":"2014-09-01T16:13:22Z","Content":"\n\u003Cp\u003EPues a mi no no hay forma de completarlo mmm:mad:\u003C/p\u003E\n"}]}