{"TopicId":81557,"ForumId":20,"TopicTitle":"GameData folder sharing","CreatedByName":"Subasean","CreatedById":115468,"CreatedDateTime":"2014-08-12T22:41:27Z","PageNum":1,"Articles":[{"CreatedByName":"Subasean","CreatedById":115468,"CreatedDateTime":"2014-08-12T22:41:27Z","Content":"\n\u003Cp\u003EToday I got a request to share my GameData folder for my Youtube series, and while I would love to help my viewer get a somewhat stable build, I\u0027m pretty sure that counts as a violation of many of my mods\u0027 authors\u0027 licenses, since it would essentially be like me issuing \u0022SubaSean\u0027s One-Stop RAM-Puddle Mod Pack!\u0022 \u003C/p\u003E\u003Cp\u003EI\u0027ll share .craft packs, no problem, but I don\u0027t want to go redistributing other peoples\u0027 works, especially because I\u0027m just an idiot with a FRAPS install and a Google account, and the people making my mods are true content creators. I\u0027m fairly new to the Internets Vidya Makin\u0027 world, so I want to make sure I\u0027m crystal clear.\u003C/p\u003E\u003Cp\u003EIs that pretty much the long and short of it?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-08-12T22:54:48Z","Content":"\n\u003Cp\u003ENot sure what you\u0027re asking. As long as you abide by all your mods\u0027 licenses, you\u0027re good.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-08-12T23:05:13Z","Content":"\n\u003Cp\u003EWhy not just share a text list of the mods your using rather than the mods themselves? Let them go find and install them on their own. You can even share the links. That\u0027s generally a good idea even if you are using a permissive licensed mod because of updates.\u003C/p\u003E\n"},{"CreatedByName":"Subasean","CreatedById":115468,"CreatedDateTime":"2014-08-12T23:10:22Z","Content":"\n\u003Cp\u003EI have the list published. It seems they\u0027re having some issues getting everything to play nicely. I added a bit to my list explaining some of the steps I\u0027ve had to take to make it stable, (Where I\u0027ve skipped experimental x64 builds, for example)\u003C/p\u003E\u003Cp\u003EMost mod licenses are pretty permissive, I just don\u0027t want to step on anyone\u0027s toes, while also being helpful, but I\u0027ve got over 2.24G of mods in that folder, so I\u0027m not surprised there are some conflicts.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-08-12T23:16:14Z","Content":"\n\u003Cp\u003EForgive me being frank here, but you just can\u0027t help everyone. You say you\u0027ve provided a list, and helpful instructions. Now it\u0027s everyone else\u0027s turn. It\u0027s just not possible to get everyone up to the same speed.\u003C/p\u003E\n"},{"CreatedByName":"Subasean","CreatedById":115468,"CreatedDateTime":"2014-08-12T23:19:57Z","Content":"\n\u003Cp\u003EThat\u0027s fair. That\u0027s what made me a little uneasy about the request, and especially since they\u0027re not technically \u0022my\u0022 files to share, I settled on giving a little of what I\u0027ve learned keeping x64 together with popsicle sticks and tape.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-08-12T23:27:34Z","Content":"\n\u003Cp\u003EYeah, modpacking is both (a) really not necessary for KSP, and (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E leads to all sorts of support issues. Your best bet IMO is to direct them to the support forum...\u003C/p\u003E\n"},{"CreatedByName":"Subasean","CreatedById":115468,"CreatedDateTime":"2014-08-12T23:37:04Z","Content":"\n\u003Cp\u003EOff topic, but I wanted to say: Blizzy, your ambient light mod is one of my all-time favorites. Simple, but oh-so useful. I\u0027m NOT using it for my current series, since I\u0027m trying to be all NASA-y and realistic, I\u0027ve left it up to myself to make sure my ports are lit, and landing sites are correctly chosen for day-side landings. \u003C/p\u003E\u003Cp\u003EWith that said, if a moderator would like to shut down this thread, be my guest.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-08-13T01:25:58Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003E\u003Cstrong\u003E[MOD - Thread locked as per OP\u0027s request.]\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}