{"TopicId":81570,"ForumId":36,"TopicTitle":"SM_Utility 1.2 Rockolight and Rockopanel adaptors NOW available","CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-13T00:47:59Z","PageNum":2,"Articles":[{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-08-19T18:18:42Z","Content":"\n\u003Cp\u003ELooks like your node attach are wrongly oriented.\u003C/p\u003E\u003Cp\u003EFor example, your crazy funny BeamAxleAlpha have\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Enode_attach = 0.0, 0.0, 0.219179, 0.0, 0.0, \u003Cstrong\u003E1.0\u003C/strong\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewhich point on \u002Bz\u003C/p\u003E\u003Cp\u003Ewhereas this node attach should be oriented on -z (-1 for the last value).\u003C/p\u003E\u003Cp\u003EMore parts suffer the same issue.\u003C/p\u003E\n"},{"CreatedByName":"Darren9","CreatedById":58062,"CreatedDateTime":"2014-08-20T07:06:38Z","Content":"\n\u003Cp\u003ESorry to spam videos from other threads but that axle satisfied my off-road desires in KSP like no other, I had to put it here as well. Thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/c5LgY4679Jk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-20T19:18:07Z","Content":"\n\u003Cp\u003EGreat video loved it, dont worry about the spam:) , As i mentioned i drive offroad in RL and it\u0027s the closest i can get to how my real world truck behaves, although i dont have the body roll:P \u003C/p\u003E\u003Cp\u003EI\u0027m thinking of stiffening the axle a bit to stabilise the body a bit more and maybe a touch more damping, what d you think?\u003C/p\u003E\u003Cp\u003EThanks for pointing that out Justin , i\u0027m going through all of the parts and many others to rectify these issues, a good reason for letting these out right there, i wouldn\u0027t bother as I\u0027m happy to spin them round but i\u0027m probably in the minority and I do like happy customers, cheers chaps\u003C/p\u003E\n"},{"CreatedByName":"MightyDarkStar","CreatedById":115126,"CreatedDateTime":"2014-08-20T19:38:46Z","Content":"\n\u003Cp\u003EAwesome! Looks cool.\u003C/p\u003E\n"},{"CreatedByName":"Darren9","CreatedById":58062,"CreatedDateTime":"2014-08-21T07:35:56Z","Content":"\n\u003Cp\u003EYeah, the caravan turned out a bit top heavy and suffered for it but it\u0027s amusing to see it bounce and roll around. Those IR springs are quite dependent on the mass and CoM of the vehicle though, set them up for your cabs and bodies is probably the best idea. There is one other thing though, I noticed you\u0027ve done some stuff with Lo-Fi, could you steal his smooth steering for these wheels? For me it\u0027s much better than the stock on/off, especially if your going slowly.\u003C/p\u003E\n"},{"CreatedByName":"Ringkeeper","CreatedById":88438,"CreatedDateTime":"2014-08-21T07:59:50Z","Content":"\n\u003Cp\u003Euuuhhh i already love the rockomax lights but now with solar panel? Awsome. Time to exchange parts on spacestation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow a rockomax with panels AND lights and it would be heaven \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Or like ObsessedWithKSP suggested.\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-21T15:15:50Z","Content":"\n\u003Cp\u003EMaybe bump the solar panel cone piece into the node with solar panels instead? I ended up getting it before deployable solar panels. which felt wrong. The lights piece is perfect for asteroid grabbers.\u003C/p\u003E\u003Cp\u003EStill haven\u0027t got to the beam axle - looking forward to a lorry axle for heavy haulage.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-21T16:09:27Z","Content":"\n\u003Cp\u003EHi good suggestions all, I like the combining idea and can see a requirement for it , AS you suggest the location in the tree is probably wrong , I\u0027ve never played any game long enough before breaking it to fully try out the tech tree, I\u0027ll change that , although wont moving it now cause you an issue , if you have any active flights with that part on? I know this is all alpha but i still don\u0027t want to trash anyone\u0027s game over something so simple..\u003C/p\u003E\u003Cp\u003EI am working on another set of axles wich will complement the beam axle, which can then assume it\u0027s place up front and the new axle will be for rear use, it works fine as front too, although the only place in heavy vehicles you find axles of this design is in the rear position. Piccies and stuff later\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-08-21T16:35:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darren9\u0022 data-cite=\u0022Darren9\u0022\u003E\u003Cdiv\u003EThere is one other thing though, I noticed you\u0027ve done some stuff with Lo-Fi, could you steal his smooth steering for these wheels? For me it\u0027s much better than the stock on/off, especially if your going slowly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll build you a dedicated plugin you can distribute with your mod, Spanner. All I need to do is rename the modules so they don\u0027t clash with mine, compile, and job\u0027s done \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-21T17:16:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpannerMonkey(smce)\u0022 data-cite=\u0022SpannerMonkey(smce)\u0022\u003E\u003Cdiv\u003EAS you suggest the location in the tree is probably wrong , I\u0027ve never played any game long enough before breaking it to fully try out the tech tree, I\u0027ll change that , although wont moving it now cause you an issue , if you have any active flights with that part on? I know this is all alpha but i still don\u0027t want to trash anyone\u0027s game over something so simple..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t used it yet - even if it moves on the tree, it\u0027ll not remove parts from active flights. It\u0027s an alpha mod, we know the risks!\u003C/p\u003E\u003Cp\u003EMight I suggest something else for those two adapter pieces? There are ways to have multiple variants of the same part - these could be variants of the original piece. See Firespitter, B12 Aerotech etc. Furthermore, variants can be restricted by unlocking other nodes - e.g. Procedural Parts require certain nodes unlocked to use larger sizes of parts you already have. Finally, it\u0027s two less items in the part catalogue to scroll through.\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-22T13:28:36Z","Content":"\n\u003Cp\u003EOne tiny request, could you increase the TweakScale options for the beam axle? There\u0027s a massive gap between Large and Medium. I was trying to use them on the new KSOS lorry (instead of the chassis and currently broken for me wheels), which is in between the two sizes, though closer to medium.\u003C/p\u003E\u003Cp\u003EI\u0027d like to see more options for powering axles - Infinite dice and others have made various moves to separate motor from axle. This means the axle could run off a resource called Torque, and a separate engine module generates Torque using electricity, LiquidFuel and IntakeAir, a nuclear reactor or whatever. You could even have driveshafts which \u0027cross-feed\u0027 the Torque.\u003C/p\u003E\u003Cp\u003EI\u0027ve been messing with various cart mods this morning (including the old UAZ and military truck - they work well!), and they\u0027re all over the map in terms of how they do things. It actually used to be simpler when everyone used Cart.dll, back in 0.15 days! Perhaps the various rover modders could get their heads together and share resources, a little like how prop engines have defaulted to Firespitter?\u003C/p\u003E\u003Cp\u003EEdit: I\u0027ve had a look at how the KSOS wheels work, and they\u0027re actually Firespitter electric wheels powered by a generator in the main vehicle body - never mind Torque, electric charge is a handy enough substitute. The beam axle works the same way ultimately, so all we need is some cool 4x4 cabs with generators and proper throaty engine noises :-)\u003C/p\u003E\u003Cp\u003EEdit: I\u0027m tweaking the TweakScale setup - currently the beam axle uses the rotatron scaling profile; note the massive gap between Medium and Large:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ESCALETYPE\u003Cbr\u003E{\u003Cbr\u003E    name = IR_RoboticRotatron\u003Cbr\u003E    freeScale = false\u003Cbr\u003E    scaleFactors = 0.25, 0.5, 1.25\u003Cbr\u003E    scaleNames = Small, Medium, Large\u003Cbr\u003E    defaultScale = 1.25\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI replaced it with this and pointed the axles at it, with extra masses to cover 5, not 3, options (I note setting freeScale to True makes this redundant!):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ESCALETYPE\u003Cbr\u003E{\u003Cbr\u003E    name = IR_RoboticAxles\u003Cbr\u003E    freeScale = true\u003Cbr\u003E    scaleFactors = 0.25, 0.5, 7.5, 1, 1.25\u003Cbr\u003E    scaleNames = Tiny, Small, Medium, Large, XL\u003Cbr\u003E    defaultScale = 1.25\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe result looks well: \u003Ca href=\u0022http://steamcommunity.com/id/colmoni/screenshot/25088485465242678\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/id/colmoni/screenshot/25088485465242678\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECurrently trying to slow them down a little and tone down the steering at speed. (torqueCurve and steeringCurve settings respectively I think?)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-22T18:24:16Z\u0022 title=\u002208/22/2014 06:24  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 22, 2014\u003C/time\u003E by colmo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-22T17:45:02Z","Content":"\n\u003Cp\u003EHiya , adding the tweakscale compatibility , was a test run, as i\u0027ve had some major troubles in the past with teakscale upsetting things, It\u0027s still early days ,I based the tweakscale calibration on a similar scale to the standard IR parts(Infernal Robotics) although there\u0027s probably a more open ended setup I could use.\u003C/p\u003E\u003Cp\u003E For cool power though the best alternative at present is the Auxiliary power unit I\u0027ve made and supplied to lofi for the KerbalFoundries repulsors, check it out in his thread , it\u0027s very cool if I say so myself. \u003C/p\u003E\u003Cp\u003EI\u0027m still trying to keep things as simple as possible , I\u0027m not a great fan of over dependance and complexity, as it tends to introduce a ceiling to the level of users taking up a certain mod. I am however looking for suitable options for sounds and power development, In the meantime there will be the addition of an APU to provide non hacky power generation, it\u0027s never a problem in dev as I created the unigens ages ago , slap one of those on and it generates whatever resource I need, but I know it wouldn\u0027t be popular because of it\u0027s hacky perpetual motion type function..\u003C/p\u003E\u003Cp\u003ERe. the aforementioned smooth steering, All the wheels I use myself including the versions of released editions have smoothSteering , anti roll and ackerman control courtesy of of lofi and as soon as the KerbalFoundries plugin is out of alpha it\u0027ll be a dependancy of all my wheels, it\u0027s a complete reworking of how the steering system works and transforms wheels into something so much better.\u003C/p\u003E\u003Cp\u003E@lo-fi thanks for the offer but I\u0027m quite happy waiting for the release of the main plugin, but of course I wouldn\u0027t say no to a custom job, it would force me to understand exactly how it works and get into plugins myself, I never promote things I cant fix ( lofi, I\u0027m sure you\u0027ll appreciate the reasons for that)\u003C/p\u003E\u003Cp\u003EI\u0027ve still not got this machine fully setup to produce mods, still missing a few of my favourite toys , which Is why I\u0027ve not pushed the updated parts through to test, hopefully should get it all sorted this weekend and can start pushing stuff out again.\u003C/p\u003E\u003Cp\u003EThanks for all the comments pm\u0027s and input, all helps to make it what the customer wants, cheers guys,\u003C/p\u003E\u003Cp\u003ESpanner\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-22T21:21:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpannerMonkey(smce)\u0022 data-cite=\u0022SpannerMonkey(smce)\u0022\u003E\u003Cdiv\u003EHiya , adding the tweakscale compatibility , was a test run, as i\u0027ve had some major troubles in the past with teakscale upsetting things, It\u0027s still early days ,I based the tweakscale calibration on a similar scale to the standard IR parts(Infernal Robotics) although there\u0027s probably a more open ended setup I could use.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProbably just the standard surface attached parameters, as used for standard wheels. I just used it on Rollkage wheels, and they work very well.\u003C/p\u003E\u003Cp\u003EI look forward to new toys. Ages ago, I used Damned Robotics parts to create a torsion bar suspension for a helicopter which could survive a 100 meter drop; the way you\u0027ve done the beam axle is similar - it could be applied to e.g. a trailing axle to give a little more suspension for jumps.\u003C/p\u003E\u003Cp\u003EI was wondering if you could create a damper that attached like a strut, but can compress and rebound? It would allow the beginnings of real suspension geometry.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-22T22:37:07Z","Content":"\n\u003Cp\u003EThanks for the time you\u0027ve spent tweaking I\u0027ll certainly add that edit to the cfg of the next update , the large jump in sizes bugged me quite a bit also. cheers.\u003C/p\u003E\u003Cp\u003ERe the damper, the only thing the damper would do currently is to be eye candy, unless combined with the smoothsteer plugin as that allows damping and rebound adjustment, note however that all the actual movement and suspension is confined to the wheel collider and not the visible dampers. , I\u0027ve added a damper to many other wheel units but in this instance i wanted simple, as damper placement would, due to the way the axle works require some form of subframe to connect it to the center bracket, the snag here is to stop things colliding I\u0027d have to reduce the axle travel, I can add a damper equipped set in the next update though as a test. The new item will include a damper as it\u0027s still in revision.\u003C/p\u003E\u003Cp\u003EA trailing axle is a great idea I\u0027ll see what can be done.\u003C/p\u003E\u003Cp\u003EEdit piccies of new part in action\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6WchJ6d.png\u0022 alt=\u00226WchJ6d.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-23T00:17:29Z\u0022 title=\u002208/23/2014 12:17  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 23, 2014\u003C/time\u003E by SpannerMonkey(smce)\u003C/strong\u003E\n\u003Cbr\u003Eadded pi of new part\n\u003C/span\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-23T01:05:07Z","Content":"\n\u003Cp\u003EI just added this to the Rollkage parts.cfg, it should work fine for yours too. It avoids editing a config elsewhere in the GameData folder - the snippet I enclosed above was in the IR TweakScale configuration.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = TweakScale\u003Cbr\u003E\ttype = surface\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-23T01:29:56Z","Content":"\n\u003Cp\u003EYeah cheers I got that:P the little snippet you posted is actually my favoured option also because , the plugin that this lot will become dependant on doesn\u0027t play nice with tweakscale and unusual wheel arrangements.\u003C/p\u003E\u003Cp\u003EHave had some thoughts on electricity generation thanks to another project i help out with from time to time.\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-23T10:23:26Z","Content":"\n\u003Cp\u003EIt would be nice to have a big, noisy, vibrating V8 engine part which can fairly chug through the fuel but also generate power. I was trying to mod the KSOS configs into the Rollkage RTG, but I couldn\u0027t get it to produce power, though everything else worked.\u003C/p\u003E\u003Cp\u003EThe downside of using electricity is that the throttle becomes fairly meaningless. To rectify this, we could vastly increase the consumption of the wheels, or reduce the output of the engine, such that the limiting factor is not the wheel top speed, but the rate at which the engine can produce electricity. The wheels would be limited in speed by constant electrical starvation. It may play havoc with control, lights and other things that rely on electricity though. It would mean pressing the W key would be equivalent to letting go of the clutch :-)\u003C/p\u003E\u003Cp\u003E(I\u0027ve just realised this is pretty much how ion engines work.)\u003C/p\u003E\u003Cp\u003EI know Infinite dice has been working on proper combustion engines with his ICE mod, I must check it out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-23T11:23:11Z\u0022 title=\u002208/23/2014 11:23  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 23, 2014\u003C/time\u003E by colmo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-23T11:43:53Z","Content":"\n\u003Cp\u003EThe i intention for power supply is to have the engine directly tied to demand so increasing demand will increasing engine speed as engine drives alternator to maintain battery level, its already been proven as a concept just got to make dieselv8 version now .\u003C/p\u003E\u003Cp\u003ELoads of horrible issues with trailing axles , 4 versions all barely satisfactory , further construction and testing continues, \u003C/p\u003E\u003Cp\u003EI\u0027ve seen the ICE stuff but not looked in to how it actually works as yet.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-08-23T11:59:50Z","Content":"\n\u003Cp\u003EDiesel electric? Suits you, sir \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have a work in progress plugin that may actually make trailing axles possible, though it still needs a huge amount of work. Damn that rotational symmetry!\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-25T14:08:25Z","Content":"\n\u003Cp\u003EHi all, there was supposed to be an update this weekend, it\u0027s actually ready to go except for one minor detail, I\u0027ve now equipped most of the wheels with the smoothSteer and anti roll provided by KerbalFoundries, due to certain technical issues and to avoid any future conflicts a plugin is being compiled to accompany this addon, the core of the plugin has been in tests for a lot longer than 24.2 was, so very few issues are still present.\u003C/p\u003E\u003Cp\u003EAs for whats due in this update , 4 new sets of wheels, comprising a twin wheel cantilever axle , and 2 types of twin and single wheel trailing axle , also included but very much a POC is a height adjustable rear landing gear unit.\u003C/p\u003E\u003Cp\u003EI\u0027ve added tweakscale capability to most parts and although it scales well some issues have presented themselves, for some reason only affecting the trailing axles, knock out the IR element if scaled up from standard size. It will scale down fine, but up locks the suspension and removes the height adjustment on both the landing gear poc, and the twin wheel heavy duty type, the normal suspension equipped versions are not affected as they do not feature an IR element.\u003C/p\u003E\u003Cp\u003EFollowing constructive criticism I\u0027ve redone the small rover chassis to remove the mesh error, and a few other details here and the like node locations etc.\u003C/p\u003E\u003Cp\u003EPreview gallery below\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/wKapM\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-25T14:38:38Z\u0022 title=\u002208/25/2014 02:38  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 25, 2014\u003C/time\u003E by SpannerMonkey(smce)\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-26T08:14:26Z","Content":"\n\u003Cp\u003ENice work. I was actually thinking of a short course truck style trailing axle but this is more useful on most rovers...and bikes?!\u003C/p\u003E\u003Cp\u003EI\u0027ve been wondering if wheels and axles could be separate parts (though that introduces orientation issues) - it does allow building a vehicle with different axle types but mixing, matching and tweakscaling wheels independently of them. I even pictured using KAS to physically change to a spare wheel!\u003C/p\u003E\u003Cp\u003EJust a thought, keeping it simple works too, especially in the early stages.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-26T13:56:39Z","Content":"\n\u003Cp\u003EHi, I\u0027ve been asked before if its possible to do the separate axle and wheel thing, and the only snag is that linking the two parts together may still not give the suspension effect that\u0027s present in a one part piece. There are ways to do it but some of them lead to weird things like, driving around on axles without wheels, anyone following the path of wheel dev will rapidly realise that its what you cant see in wheels that\u0027s important not the visible parts. However, I think it\u0027s be possible to achieve some passable results with the trailing type axle and beam axle , as the suspension movement in the wheel for those is miniscule, 99% of the suspension comes from the IR joint at the base, I could definitely have a bash at a Proof of Concept( henceforth to be known as POC)\u003C/p\u003E\u003Cp\u003EThe only way I\u0027ve managed to get a bike to work with any sense( been riding for more years than most of you lot have been alive) is to create a pod with a really strong ASAS fitted so that it\u0027s natural inclination is to keep itself upright, that said much fun can be had in trying to make it all work \u003C/p\u003E\u003Cp\u003EAs for a short course type trailing axle that\u0027s probably doable and is hitting right at my offroad obsessions nicely, spent many years building scale competition rock crawlers and sand racers , for people with lotsa cash, so I already have a million sketches of how it can be done. I\u0027m thinking 4 link fully floating would be ideal for deranged behaviors, although it would definitely be a challenge to set up and be a larger part than even the beam axle, as there would be a need for a subframe affair that would carry the link ends and the shock mountings\u003C/p\u003E\u003Cp\u003ESorry if my replies come sometimes delayed, having a tough time physically at present, so if anyone knows where i can get a cloned replacement for this worn out body that I\u0027ve got to put up with let me know.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003ESpanner\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-08-26T17:18:05Z","Content":"\n\u003Cp\u003ERest up, we can wait! I\u0027ve dabbled with RC rock crawlers but you\u0027re a pro, so I won\u0027t ask granny, or you, to suck eggs.\u003C/p\u003E\u003Cp\u003EI\u0027m still dreaming of my strut-dampers, where a stretchy/compressible strut actually performs like a spring-loaded, oil-filled shock absorber - I\u0027ll have a play with strut setting to see if they can be made less rigid. Back in the day, we wondered if the pistons of IR (then DR) could be adapted for the job.\u003C/p\u003E\u003Cp\u003EI might have a bash at modelling some chassis C-rails. Would be a useful but simple intro to modelling.\u003C/p\u003E\n"},{"CreatedByName":"123nick","CreatedById":27488,"CreatedDateTime":"2014-08-26T18:04:56Z","Content":"\n\u003Cp\u003Ehey what are those octogonal base-like parts? the ones in the second,third,and forth picture?\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-08-26T20:42:27Z","Content":"\n\u003Cp\u003EI\u0027ll check out if it would be possible to make a shock out of an IR ram, i think it\u0027s doable because no matter what the actual IR part does the differences between them are minimal,..... a quick look reveals it is possible , now how best to exploit the potential.\u003C/p\u003E\u003Cp\u003EThe octagonal base parts are from a really old mod called Marvelous Magnetic modules, it was an early swipe at interactive iva\u0027s, i\u0027ve had them for so long perhaps since 0.18ish, of course refitted iva\u0027s and constantly upgraded for each edition , one of the many obsolete mods i still have use for. If i can track down the author maybe I can make them available again.\u003C/p\u003E\n"}]}