{"TopicId":81586,"ForumId":44,"TopicTitle":"Anyone interested in mechanical stuff, like building engines?","CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2014-08-13T07:35:33Z","PageNum":1,"Articles":[{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2014-08-13T07:35:33Z","Content":"\n\u003Cp\u003EKSP and it\u0027s community has it\u0027s focus on space, but are there people here who are interested in doing other stuff as well? The platform has some great things to offer. Some people like to build robots, that\u0027s already a bit more technical. But what about a car engine or a turbine? Any gearheads over here?\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-08-13T13:09:47Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ilynT_i4XBc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E this is semi relevant. its not at all my work, but fits your thread i think.\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-08-13T13:32:29Z","Content":"\n\u003Cp\u003EI have an idea for building a rocket capable of Earth orbit for only a few thousand dollars. You could use weather balloons to get it a high altitude, then use a rocket with 3 stages to reach orbit. 3d printing makes this possible for the ametuer, as now nearly perfect construction is available to anyone with some money and internet access. Would take some doing obviously as there would be extensive 3d modeling, testing, and programming before success, but with a smartphone as a probe core, success is possible.\u003C/p\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-08-13T16:39:27Z","Content":"\n\u003Cp\u003EI like tinkering with mechanical things, yes... but I haven\u0027t advanced much further than \u0027take it apart, clean the pieces, put it back together again\u0027 sort of level...\u003C/p\u003E\u003Cp\u003EThere is a thread about where people have been making their own KSP \u0027controllers\u0027 - huge multi-multi-buttoned and multi-joysticked contraptions which wouldn\u0027t look out of place in an actual cockpit! They have been messing about with Arduinos and all sorts of other interesting things...\u003C/p\u003E\u003Cp\u003EAnd to be really honest, you may get more of a response in the Space Lounge sub-forum, if you mean non-KSP stuff \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2014-08-13T17:01:35Z","Content":"\n\u003Cp\u003EI only tinker with plants, pollen and some minor genetic stuff.\u003C/p\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-08-13T17:09:25Z","Content":"\n\u003Cp\u003EI prefer the \u0022theoretical\u0022 design process, i.e. doing calculations and testing with computer simulations. I\u0027m too scared to tinker with parts and possibly screw something up. I would like to work for SpaceX or Aerojet Rocketdyne as a career.\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-08-13T19:38:15Z","Content":"\n\u003Cp\u003EOh and I\u0027m half done welding together a prototype mobile restaurant. Should be finished next year if anyone wants to own a restaurant. The prototype is 12 x 8 foot and has seating for about 10 adults. It\u0027s solar powered and even has a tv and speaker system.\u003C/p\u003E\n"},{"CreatedByName":"Yakuzi","CreatedById":85181,"CreatedDateTime":"2014-08-13T20:19:25Z","Content":"\n\u003Cp\u003EDoes genetic engineering count? Also, I have been working on flagella which have a really small molecular engine component.\u003C/p\u003E\n"},{"CreatedByName":"Odielthen","CreatedById":102840,"CreatedDateTime":"2014-08-13T21:49:02Z","Content":"\n\u003Cp\u003EI\u0027m not entirely sure if you are talking about in game or out of game, but I am going to comment on the former. \u003C/p\u003E\u003Cp\u003EI would love to have the ability to design not just the rocket, but also the components from which the rocket is made. I could imagine spending a great deal of time designing the ideal booster to be used in my MOAR BOOSTER rocket. It would then explode because reasons, and all will be well in the Universe. Except for Jeb. He has to walk home.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-08-13T22:09:18Z","Content":"\n\u003Cp\u003ETo the science labs with you!\u003C/p\u003E\u003Cp\u003EAlso, I was learning how to fly model aircraft a while before electrics became any good. I can strip an MVVS .49 down to components and back again if you like. Best fitted with a prop between 10x5 and 10x7. Give it an Enya-brand glowplug, because those things like to run hot and high-revs. It\u0027ll kick the stuffing out of a cheap plug in no time.\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2014-08-14T00:37:54Z","Content":"\n\u003Cp\u003EHI,\u003C/p\u003E\u003Cp\u003EWhat does plants have to do with mechanical engines?! I like biophysics too, especially the micro kind off of old rocks I have yet to grow plants from their spores ! And ya one could probly make an engine in KSP that runs off of plant food !! I would buy it ! Could I design it; dunno but I did catch that vid of that engine...neat!\u003C/p\u003E\u003Cp\u003ECmdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"mardlamock","CreatedById":38972,"CreatedDateTime":"2014-08-14T02:35:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022timsfitz\u0022 data-cite=\u0022timsfitz\u0022\u003E\u003Cdiv\u003EI have an idea for building a rocket capable of Earth orbit for only a few thousand dollars. You could use weather balloons to get it a high altitude, then use a rocket with 3 stages to reach orbit. 3d printing makes this possible for the ametuer, as now nearly perfect construction is available to anyone with some money and internet access. Would take some doing obviously as there would be extensive 3d modeling, testing, and programming before success, but with a smartphone as a probe core, success is possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGoing up to 30km may mean that you can use less dv due to less drag, but you are still going to need at the very least 8km.s of dv to get into LEO, a rocket that size would not be in any way lifted by a balloon, and if you do manage to get it in the air the fast winds will probably destroy it.\u003C/p\u003E\n"},{"CreatedByName":"mardlamock","CreatedById":38972,"CreatedDateTime":"2014-08-14T02:38:08Z","Content":"\n\u003Cp\u003EIm building a dead reckoning arduino based system for a scratch built rocket that will go to about 3km in height and 320m/s. The engine is basically ready, it is a uses a pvc pipe as the combustion chamber, a concrete de laval nozzle and r candy as fuel, generates about 800 newtons for 1.25 seconds. The airframe i also pvc, though it is 10cm in diameter but much less thick. Its a fun little project, its making me learn a ton of math and physics (more physics now).\u003C/p\u003E\n"}]}