{"TopicId":81639,"ForumId":44,"TopicTitle":"NASA Television Coverage Set for Russian Spacewalk","CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-08-13T20:52:29Z","PageNum":1,"Articles":[{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-08-13T20:52:29Z","Content":"\n\u003Cp\u003EOk, I\u0027m subscribed to the NASA mailing list and I received this (note: the title of this thread was the subject of the mail, the following is a copy/paste of the mail).\u003C/p\u003E\u003Cp\u003ETwo Russian cosmonauts aboard the International Space Station will venture outside the orbiting outpost Monday, Aug. 18, for a six-and-a-half-hour spacewalk -- the 181st in support of space station assembly and maintenance. NASA TV coverage will begin at 9:30 a.m.\u003C/p\u003E\u003Cp\u003EExpedition 40 Flight Engineers Alexander Skvortsov and Oleg Artemyev of the Russian Federal Space Agency will exit the Pirs docking compartment airlock about 10 a.m. EDT to deploy a small Peruvian science satellite, and install and retrieve science experiments on the exterior of Russian station modules. This will be the second spacewalk for both cosmonauts.\u003C/p\u003E\u003Cp\u003ESkvortsov will be designated as extravehicular (EV) crew member 1 and will wear the Orlan suit bearing red stripes. Artemyev will be designated as extravehicular EV-2 and will wear a suit with blue stripes.\u003C/p\u003E\u003Cp\u003EFor NASA TV streaming video, schedule and downlink information, visit:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/nasatv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/nasatv\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor more information about the International Space Station and its crew, visit:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/station\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/station\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E-end-\u003C/p\u003E\u003Cp\u003EI don\u0027t even understand how an astronaut can do a spacewalk for 6 and a half hour o_O\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-08-13T22:05:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022goldenpeach\u0022 data-cite=\u0022goldenpeach\u0022\u003E\u003Cdiv\u003EI don\u0027t even understand how an astronaut can do a spacewalk for 6 and a half hour o_O\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery, very slowly.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-08-13T22:20:14Z","Content":"\n\u003Cp\u003ESomeone\u0027s going to pee their diapers. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-08-13T22:48:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EVery, very slowly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know, I wasn\u0027t impressed by the time taken but that the fact that astronauts can endure a 6 hour and a half space walk.\u003C/p\u003E\u003Cp\u003EThink of it, you may be tired at the end of the day after a long day at work. \u003C/p\u003E\u003Cp\u003ENow imagine if you were in outer space, forced to be extremely concentrated, with a 120KG suit on you.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-08-14T06:46:44Z","Content":"\n\u003Cp\u003EAn EVA isn\u0027t just \u0022put on a suit and go outside\u0022. It takes days of technical preparation, writing and learning the procedures, preparing the equipment. Then it takes several hours to don and check the suit as well as prebreathing.\u003C/p\u003E\u003Cp\u003EThis is why EVAs are typically 5 to 7 hours long, to maximise the actual activity outside, but also because it\u0027s damn dangerous and you have to check every move. And yes, it\u0027s exhausting too. Nobody said that being an astronaut was easy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe record for the longest EVA is 8 hours 56 minutes, held by Susan Helms in 2007.\u003C/p\u003E\n"}]}