{"TopicId":81921,"ForumId":32,"TopicTitle":"Why are transfers from solar orbit so inefficient?","CreatedByName":"Marclev","CreatedById":108506,"CreatedDateTime":"2014-08-17T00:49:49Z","PageNum":1,"Articles":[{"CreatedByName":"Marclev","CreatedById":108506,"CreatedDateTime":"2014-08-17T00:49:49Z","Content":"\n\u003Cp\u003EUp until very recently, the way I\u0027ve always transferred to other planets has been to first get into solar orbit, and then drag a manoeuvre node around until I get an intercept.\u003C/p\u003E\u003Cp\u003EVery recently however,I\u0027ve been experimenting with a continuous burn from LKO to get an intercept orbit. \u003C/p\u003E\u003Cp\u003EI\u0027m not even in a transfer window, but even so, the new approach is very noticeably more efficient than the previous one.\u003C/p\u003E\u003Cp\u003EAnybody know why?\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-08-17T01:07:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Marclev\u0022 data-cite=\u0022Marclev\u0022\u003E\u003Cdiv\u003EUp until very recently, the way I\u0027ve always transferred to other planets has been to first get into solar orbit, and then drag a manoeuvre node around until I get an intercept.\u003Cp\u003EVery recently however,I\u0027ve been experimenting with a continuous burn from LKO to get an intercept orbit. \u003C/p\u003E\u003Cp\u003EI\u0027m not even in a transfer window, but even so, the new approach is very noticeably more efficient than the previous one.\u003C/p\u003E\u003Cp\u003EAnybody know why?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOberth effect. The deeper you are in a gravity well, the more efficient a chemical rocket is.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Oberth_effect\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Oberth_effect\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2014-08-17T01:07:17Z","Content":"\n\u003Cp\u003EThat\u0027s quite simple - when you\u0027re in Kerbin orbit, you can leverage the Oberth effect.\u003C/p\u003E\u003Cp\u003EIn layman\u0027s terms, the faster you\u0027re going at Kerbin orbit, the less time gravity gets to steal from you, so you end up going farther with the same acceleration/delta-v.\u003C/p\u003E\u003Cp\u003EOtherwise when you just barely exit the SOI, Kerbin spent that whole time stealing velocity from you. If you go burning out faster, it takes fewer seconds (hours~), which is fewer seconds that gravity can act on you.\u003C/p\u003E\u003Cp\u003ENote that you will have to burn a bit more in orbit than outside of Kerbin\u0027s SOI (it\u0027s like 950-ish to go to Duna from outside the SOI, vs. about 1055 inside)..but you have to cross that distance \u003Cem\u003Eanyways\u003C/em\u003E so might as well pour on the speed and leverage that Oberth effect.\u003C/p\u003E\n"},{"CreatedByName":"No one","CreatedById":112131,"CreatedDateTime":"2014-08-17T01:42:19Z","Content":"\n\u003Cp\u003EYou keep more of the velocity you had while you were orbiting Kerbin.\u003C/p\u003E\u003Cp\u003EIn case it sounds weird, imagine the following scenario:\u003C/p\u003E\u003Cp\u003EKerbin is orbiting the sun at K m/s.\u003C/p\u003E\u003Cp\u003EYou\u0027re orbiting Kerbin at O m/s.\u003C/p\u003E\u003Cp\u003EYou\u0027re carrying a magical bomb thing which will accelerate you really really fast to a speed at which you escape Kerbin\u0027s SOI in a fraction of a second and the losses due to gravity are negligible. Let\u0027s say the bomb gives you X m/s of delta-v, where X is some really big number.\u003C/p\u003E\u003Cp\u003EYou also have normal rockets which can accelerate you from your orbit to escape velocity, but only just enough to escape. Let\u0027s say they give you R m/s.\u003C/p\u003E\u003Cp\u003EYou have two choices:\u003C/p\u003E\u003Cp\u003EDetonate bomb and escape then fire rockets\u003C/p\u003E\u003Cp\u003EFire rockets and escape then detonate bomb.\u003C/p\u003E\u003Cp\u003EIf you detonate the bomb and escape then fire the rockets you are going at (Approximately, you\u0027ll still lose a tiny bit due to gravity) K\u002BO\u002BX\u002BR m/s. (To start with you\u0027re going at K\u002BO m/s relative to the sun, then the bomb gives you X m/s, then the rockets give you R m/s)\u003C/p\u003E\u003Cp\u003EIf you fire the rockets and escape then detonate the bomb you are going at K\u002BX m/s.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-17T03:03:29Z","Content":"\n\u003Cp\u003EThe Oberth effect. You get more change in the energy of an orbit from a given amount of delta-V when you\u0027re traveling faster. This reduces the amount of delta-V required for a transfer.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-08-17T03:19:47Z","Content":"\n\u003Cp\u003EDamn. I\u0027ve been doing it wrong this whole time. Whoops. Lol.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-08-17T11:56:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EDamn. I\u0027ve been doing it wrong this whole time. Whoops. Lol.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, not necessarily \u0022wrong\u0022, just less efficient. The benefit of doing it the way you\u0027ve been doing it, is that it\u0027s easier to do without any tools for calculating transfer windows and the like. However, it is of course less optimal in terms of fuel expenditure, and probably also in terms of elapsed flight time.\u003C/p\u003E\u003Cp\u003EGranted, if you use a transfer window, and still do your burns from a solar orbit, then yeah, you\u0027re just wasting fuel. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2014-08-17T12:53:50Z","Content":"\n\u003Cp\u003EGravity is acceleration. Soo, the more time you take to escape the gravity well, the more speed you will lose to gravity. \u003C/p\u003E\u003Cp\u003EBy doing your whole burn at the lowest point you are making your exit a lot faster and so there\u0027s less time spent with that gravity pulling you back. \u003C/p\u003E\u003Cp\u003ESame reason why landing with one big ol burn just before impact is more efficient than slowing to a stop halfway, it\u0027s all about spending the least time having gravity accelerate you.\u003C/p\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-08-17T13:31:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Marclev\u0022 data-cite=\u0022Marclev\u0022\u003E\u003Cdiv\u003EUp until very recently, the way I\u0027ve always transferred to other planets has been to first get into solar orbit, and then drag a manoeuvre node around until I get an intercept.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, phew. I thought I was the only one who used to do this...\u003C/p\u003E\n"},{"CreatedByName":"Illumia-Star","CreatedById":114973,"CreatedDateTime":"2014-08-17T13:39:56Z","Content":"\n\u003Cp\u003EIf efficiency isn\u0027t a problem, maybe you have tonnes of fuel (Bad planning maybe?), would it be more efficient to go straight from a solar orbit or to go straight from the SOI of the planet? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2014-08-17T17:40:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Illumia-Star\u0022 data-cite=\u0022Illumia-Star\u0022\u003E\u003Cdiv\u003EIf efficiency isn\u0027t a problem, maybe you have tonnes of fuel (Bad planning maybe?), would it be more efficient to go straight from a solar orbit or to go straight from the SOI of the planet? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf fuel wasn\u0027t an issue why would you care about efficiency? Either way it would still be more efficient to go from LKO as explained above (in terms of fuel consumption at least).\u003C/p\u003E\u003Cp\u003EIf you mean which would be quicker, probably a LKO transfer anyway I imagine? As you can burn directly rather than having to get outside the SOI first.\u003C/p\u003E\n"},{"CreatedByName":"Lukaszenko","CreatedById":95776,"CreatedDateTime":"2014-08-21T09:29:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Illumia-Star\u0022 data-cite=\u0022Illumia-Star\u0022\u003E\u003Cdiv\u003EIf efficiency isn\u0027t a problem, maybe you have tonnes of fuel (Bad planning maybe?), would it be more efficient to go straight from a solar orbit or to go straight from the SOI of the planet? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEither way, going from solar orbit is inefficient. \u003C/p\u003E\u003Cp\u003EWhether efficiency is a problem or not, does not change the efficiency. It just changes how much you care. Perhaps you should reword your question? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGoing from solar orbit does take less planning however. Game time and efficiency might be worse, but it might make better use of your real world time.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-21T10:35:41Z","Content":"\n\u003Cp\u003EI used this method (get out of SOI, then find an intercept from Solar orbit and burn there, also perform all inclination burns in solar orbit) in my early days of playing KSP. It worked (as long as I took enough fuel with me), it was easy, it did not require any external tools. I see no shame in using that method if you don\u0027t care whether you\u0027re efficient.\u003C/p\u003E\u003Cp\u003EI don\u0027t use this method anymore. Instead, I perform ballistic transfers using alexmoon\u0027s planner. It requires an external tool and learning a few tricks how to deal with inaccuracies caused by long burns deep down in gravity well but in general I am more happy with it. Also my rockets don\u0027t need to be as big.\u003C/p\u003E\n"},{"CreatedByName":"Odielthen","CreatedById":102840,"CreatedDateTime":"2014-08-21T15:55:04Z","Content":"\n\u003Cp\u003EI\u0027ve learned a lot from this thread! I\u0027m going to have to try to get much closer to my target from LKO. Right now I just pick a target and go, and hopefully I have enough dv to get there!\u003C/p\u003E\n"},{"CreatedByName":"kanvil","CreatedById":113555,"CreatedDateTime":"2014-08-21T20:15:12Z","Content":"\n\u003Cp\u003EHere\u0027s another way to think about the Oberth Effect. Getting to a higher orbit or an escape trajectory is about getting your energy high enough to climb up the walls of the gravity well. However, rockets operate by changing your velocity. So the goal is to get the most change in energy from the smallest change in velocity, and that happens when you\u0027re moving as fast as possible. The fastest part of your trajectory is when you\u0027re deepest into the gravity well, so that\u0027s where you should make your velocity change in order to get the most change in energy.\u003C/p\u003E\u003Cp\u003EAnother thing I just realized is that when you want to go from a highly elliptical, inclined orbit (such as just after aerocapture) to a circular orbit for rendezvous, it\u0027s best to circularize first, then change your inclination. This is because both the ascending and descending nodes are going to be close in for a highly elliptical orbit and so the velocity will be very fast, making plane changes expensive. By circularizing first, you push the nodes further out, making the plane change less expensive.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-08-21T21:01:39Z","Content":"\n\u003Cp\u003EIt\u0027s not just the Oberth effect; usually concomitant with this method is not caring about *when* you do your transfers. But since both the origin and destination bodies are \u003Cem\u003Eorbiting\u003C/em\u003E, not stationary, then you need to consider their relative alignment.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2014-08-21T21:41:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EIt\u0027s not just the Oberth effect; usually concomitant with this method is not caring about *when* you do your transfers. But since both the origin and destination bodies are \u003Cem\u003Eorbiting\u003C/em\u003E, not stationary, then you need to consider their relative alignment.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, if you transfer into a very gentle solar orbit, and you don\u0027t have any time limit, you can just wait for a window so you don\u0027t have to make corrections and a second pass.\u003C/p\u003E\u003Cp\u003EYou\u0027d still have to pass on any starting Oberth savings, of course.\u003C/p\u003E\n"}]}