{"TopicId":81977,"ForumId":16,"TopicTitle":"Space craft suddenly shaking itself apart???","CreatedByName":"StarStreak2109","CreatedById":118557,"CreatedDateTime":"2014-08-17T18:17:17Z","PageNum":1,"Articles":[{"CreatedByName":"StarStreak2109","CreatedById":118557,"CreatedDateTime":"2014-08-17T18:17:17Z","Content":"\n\u003Cp\u003EDear all,\u003C/p\u003E\u003Cp\u003EI had a weird encounter with the \u0027Kraken\u0027 today. I was using a space crane type vessel to deposit a rover on Mun\u0027s surface. All went well until I was about 100 m above the surface. Suddenly the ship start wobbling like crazy, which became ever more violent. At last, the ship tore itself and the rover to pieces.\u003C/p\u003E\u003Cp\u003EI am at a loss what caused this, since I could not repeat this.\u003C/p\u003E\u003Cp\u003EAnyone got any clues what the potential causes for behaviour like this could be?\u003C/p\u003E\u003Cp\u003EBest regards,\u003C/p\u003E\u003Cp\u003ESebastian\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2014-08-17T18:25:53Z","Content":"\n\u003Cp\u003EHum, maybe you had SAS units active in both the crane and the rover and they were linked by small/normal docking ports ? Those connections are \u003Cem\u003Every\u003C/em\u003E flexible and if you have SAS active in both parts, they might disagree enough to make the ship wobble to destruction if you make a strong enough shake ...\u003C/p\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2014-08-17T18:44:59Z","Content":"\n\u003Cp\u003EModerator beacon, moderator beacon. This thread needs to be moved!\u003C/p\u003E\u003Cp\u003EYou said it yourself, it was caused by the kraken.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-08-17T18:50:39Z","Content":"\n\u003Cp\u003EAre you using any mods? And what was the rover composed of? If it only had physics-insignificant parts on it, that could well be part of why.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-08-17T19:21:08Z","Content":"\n\u003Cp\u003EFirst is large ships, preferable fragile ones of multiple docked parts with reaction wheels spread over might get the shake.\u003C/p\u003E\u003Cp\u003EMechjeb tend to make this problem larger as it send multiple command each second.\u003C/p\u003E\u003Cp\u003EClipping is a common reason, this might include clipping without activating part clipping. \u003C/p\u003E\u003Cp\u003ESome part mods have problems\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-08-18T14:07:19Z","Content":"\n\u003Cp\u003ESometimes miniscule part clipping (parts that don\u0027t appear to be clipped at all, and were placed normally) can cause this kraken to appear. Sometimes you can tell which parts are causing the shaking (like if it\u0027s an outboard engine section, so the flex is easier to see), and just moving that part a few millimeters in the VAB and relaunching, it\u0027ll be fine.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-18T14:16:16Z","Content":"\n\u003Cp\u003EIf you use MechJeb\u0027s SmartASS to keep pointed retrograde during descent bad things happen when you get close to zeroing out your velocity near the surface. I know this from painful experience.\u003C/p\u003E\n"},{"CreatedByName":"Fireheart318","CreatedById":159932,"CreatedDateTime":"2016-04-20T19:23:37Z","Content":"\n\u003Cp\u003E\nI was building a (flying) canoe in 1.1 and it had what is best described as unexplained epilepsy. It just started shaking and shaking and shaking until it blew up. I solved the problem with struts.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-04-20T22:32:57Z","Content":"\n\u003Cp\u003E\nThis thread is almost two years old, so a similar problem is unlikely to arise from the same cause. \n\u003C/p\u003E\n"}]}