{"TopicId":82035,"ForumId":46,"TopicTitle":"How long does thread approval take?","CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2014-08-18T11:12:56Z","PageNum":1,"Articles":[{"CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2014-08-18T11:12:56Z","Content":"\n\u003Cp\u003EI uploaded 3 new craft i made to the exhance forum about 3 hours ago and the posts still have not appeared, how long does it actually take? \u003C/p\u003E\u003Cp\u003EI have been checking every 10 or 15 minutes because i forgot to specify that it was a stock craft and not modded and i want to fix that before i go to bed....\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-08-18T11:40:46Z","Content":"\n\u003Cp\u003EHi.\u003C/p\u003E\u003Cp\u003EThere is no regular approval period. Posts appear on a basis of \u0022when one of the moderators gets a chance to look at the mod queue.\u0022 By the looks of it, your Spacecraft Exchange post \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/76858-The-Stock-Craft-Repository-%28v0-24%29?p=1357986\u0026amp;viewfull=1#post1357986\u0022 rel=\u0022external nofollow\u0022\u003Eis now up\u003C/a\u003E, so evidently someone got to it before I did.\u003C/p\u003E\u003Cp\u003EHope that helps.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-08-18T11:42:04Z","Content":"\n\u003Cp\u003EThere is no specific rule stating a time for moderated posts to be approved (or rejected). The moderation team acts on them collectively, so the first moderator who has time to check, will process those posts.\u003C/p\u003E\u003Cp\u003EIn the specific case, you may note that one post you made was approved to reside in the correct section (Stock Craft Repository v.0.24), another post you made wasn\u0027t approved, because identical to the first and posted in a wrong section. It takes some time to check, evaluate if posts are correct, move them where they belong (like this one). But certainly you waited that much just because nobody had time to check for a few hours. A good advice for newcomers to this forum should be, don\u0027t expect all your posts to be approved, and not to be approved in a short time.\u003C/p\u003E\n"}]}