{"TopicId":8205,"ForumId":16,"TopicTitle":"Editing persistent.sfs for fun, profit and lag reduction","CreatedByName":"Unistrut","CreatedById":2229,"CreatedDateTime":"2012-03-16T06:20:01Z","PageNum":1,"Articles":[{"CreatedByName":"Unistrut","CreatedById":2229,"CreatedDateTime":"2012-03-16T06:20:01Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EAfter flailing about trying to edit persistent.sfs and generally making a mess of things I figured I\u0027d write a quick how-to guide so that others might learn from my mistakes. We\u0027ll cover how to edit it without wrecking it, changing crew names, resurrecting dead crew, clearing bugged parts, clearing orbital junk and naming the stuff in orbit.\u003C/p\u003E\u003Cp\u003EFirst off, get yourself a text editor that won\u0027t screw up your persistent.sfs file. DO NOT USE WORDPAD. It will change all the EOL characters from Unix to Windows and KSP won\u0027t be able to load it. I used a free program called \u0027Notepad \u002B\u002B\u0027.\u003C/p\u003E\u003Cp\u003EIf you\u0027ve already loaded it into wordpad and wrecked it, then you need to get Notepad\u002B\u002B and load your persistent.sfs file and then go to Edit -\u0026gt;; EOL Conversion and select \u0027Unix\u0027. Save, and things should be fixed.\u003C/p\u003E\u003Cp\u003EI haven\u0027t tried it yet, but you probably shouldn\u0027t edit persistent.sfs while KSP is running.\u003C/p\u003E\u003Cp\u003EFirst off - renaming crew. Once you\u0027ve got your persistent.sfs loaded into your text editor of choice the first thing you\u0027ll probably notice are your crew. Each one has a name, some stats and a state. Changing a name simply requires typing a new one after \u0027Name = \u0027. Keep in mind that Jeb, Bob and Bill get their orange jumpsuits because of their name. If you change Bob Kerman and Bill Kerman to say, Douglas Turbo and Vincent Carducci, then they\u0027ll be put into New Guy Silver.\u003C/p\u003E\u003Cp\u003ENow, if you\u0027ve been playing the game properly, you\u0027ve probably killed a few of them. Resurrection is as simple as changing their state from 3 (dead) to 0 (alive). State 1 is used for Kerbalnauts in orbit and I haven\u0027t figured out what state 2 is yet. You should also change the ToD (Time of Death) to 0.\u003C/p\u003E\u003Cp\u003EBelow the crew are a series of entries marked \u0027VESSEL\u0027. These are all your various spacecraft and random orbital detritus. If you are deleting a VESSEL entry you need to make sure that you get everything from \u0027VESSEL {\u0027 down to the closing \u0027}\u0027, which will be the line above the next VESSEL entry.\u003C/p\u003E\u003Cp\u003EClearing bugged parts. Several folks have been complaining about excessive lag that is only cured by deleting your persistent.sfs file. You may have also noticed parts on the tracking screen that appear to have landed, but don\u0027t get cleared away. There\u0027s a cure for this. Load up your persistent.sfs and search for \u0027NaN\u0027. Basically that means that whatever value that is is bugged and causing problems. So if you find a bunch of debris that has \u0027NaN\u0027 for it\u0027s various data values then you should delete it.\u003C/p\u003E\u003Cp\u003EClearing orbital debris. Much like the above, but you need to be a little more careful about what you\u0027re deleting. The first entry in each VESSEL is it\u0027s name. Most of it will be things like \u0027Porkchop Express Debris\u0027. These are the various rocket parts that you\u0027ve left in orbit. After the name, there will be a series of PART entries that let you know what each piece of debris is made of. Unfortunately, everything separated from your rocket is labeled as \u0027Debris\u0027, so if you\u0027ve been launching satellites you\u0027ll need to be careful to differentiate between \u0027Debris\u0027 that is random boosters and fuel tanks and \u0027Debris\u0027 that is actually your Eye of Kerberus spy satellite. You can usually get a good idea of what\u0027s what by checking the various part entries. Once you\u0027ve found those two dozen pieces of fairing you left in orbit you can simply delete their entire VESSEL entry to get rid of them. It\u0027s not keeping it real, but it\u0027s certainly easier than trying to match orbits with each of them and de-orbit them manually and maybe you just want to have fun with rockets instead of having to play Planetes: The Game.\u003C/p\u003E\u003Cp\u003ENow, speaking of the Eye of Kerberus, you carefully launched your satellite into a nice polar orbit and tracking keeps referring to it as \u0027Porkchop Express Debris\u0027. By simply changing the \u0027name = \u0027 entry under VESSEL you can give your satellites proper names. Do Not Change the \u0027name = \u0027 entries under parts, that tells the game what the vessel is made of, not what it should be called on the tracking screen.\u003C/p\u003E\u003Cp\u003EFor further study:\u003C/p\u003E\u003Cp\u003EWhat is crew state 2? What is ToD?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-30T09:08:35Z\u0022 title=\u002209/30/2012 09:08  AM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 30, 2012\u003C/time\u003E by Unistrut\u003C/strong\u003E\n\u003Cbr\u003EFixing /\u0026#039;\n\u003C/span\u003E\n"},{"CreatedByName":"SteevyT","CreatedById":6183,"CreatedDateTime":"2012-03-16T06:23:56Z","Content":"\n\u003Cp\u003EYou can modify the .sfs file while in the VAB or space center with no problems (or at least you could in .14), I haven\\\u0027t tried while looking at a ship or in the tracking station yet though.\u003C/p\u003E\n"},{"CreatedByName":"BillWiskins","CreatedById":12285,"CreatedDateTime":"2012-03-16T11:13:37Z","Content":"\n\u003Cp\u003ECould state \\\u00272\\\u0027 refer to Kerbals who are in a ship that has landed? I know I\\\u0027ve seen it mentioned that the game differentiates for vessels.\u003C/p\u003E\n"},{"CreatedByName":"Xivios","CreatedById":3685,"CreatedDateTime":"2012-03-17T04:07:20Z","Content":"\n\u003Cp\u003EI think ToD is Time of Death. I\\\u0027ve seen it filled out in recently deceased crewmembers, but it\\\u0027s usually a 0-0 for surviving crew.\u003C/p\u003E\n"},{"CreatedByName":"Unistrut","CreatedById":2229,"CreatedDateTime":"2012-03-20T00:42:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BillWiskins\u0022 data-cite=\u0022BillWiskins\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECould state \u00272\u0027 refer to Kerbals who are in a ship that has landed? I know I\u0027ve seen it mentioned that the game differentiates for vessels.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, I finally had some time to play and state 2 is not for Kerbalnauts who are in a splashed vessel. Next stop: the mun!\u003C/p\u003E\u003Cp\u003EEdit: Okay. State 2 does not stand for \u0027trapped on the moon due to a botched landing\u0027. As persistent.sfs does not seem to realize that they are probably doomed and merely records their vessel as LANDED, it probably doesn\u0027t stand for a kerbalnaut in a landed vessel either.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-25T19:42:09Z\u0022 title=\u002208/25/2012 07:42  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 25, 2012\u003C/time\u003E by Unistrut\u003C/strong\u003E\n\u003Cbr\u003Efixing /\u0026#039;\n\u003C/span\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2012-03-20T16:55:44Z","Content":"\n\u003Cp\u003EWe know that Jeb and the Bs get recycled if they die or end a mission;\u003C/p\u003E\u003Cp\u003ECould 2 be a special \u0027oops Jeb died\u0027 flag or something so they can be flagged for recycling? Or perhaps a state of \\\u0027cooldown\\\u0027 on them where they won\\\u0027t be used.\u003C/p\u003E\n"},{"CreatedByName":"Gojira","CreatedById":10884,"CreatedDateTime":"2012-03-20T18:05:20Z","Content":"\n\u003Cp\u003Ewhat I do for NaN errors:\u003C/p\u003E\u003Cp\u003Esearch for \u0027NaN\u0027 detect caps\u003C/p\u003E\u003Cp\u003Ein the replace with field i put 1\u003C/p\u003E\u003Cp\u003Eclick replace all\u003C/p\u003E\u003Cp\u003Edone.\u003C/p\u003E\u003Cp\u003ENaN gone.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-03-23T12:15:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unistrut\u0022 data-cite=\u0022Unistrut\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOkay, I finally had some time to play and state 2 is not for Kerbalnauts who are in a splashed vessel. Next stop: the mun!\u003C/p\u003E\u003Cp\u003EEdit: Okay. State 2 does not stand for \u0027trapped on the moon due to a botched landing\u0027. As persistent.sfs does not seem to realize that they are probably doomed and merely records their vessel as LANDED, it probably doesn\\\u0027t stand for a kerbalnaut in a landed vessel either.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETry sub orbital. \u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-03-27T06:13:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unistrut\u0022 data-cite=\u0022Unistrut\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEye of Kerberus spy satellite\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EThis made me LOL.\u003Cp\u003EOh yeah, gold nugget of a post, too. Extra-large thanks!\u003C/p\u003E\u003Cp\u003EBy the way, I\\\u0027ve somehow gotten away with editing persistent.sfs in WordPad all this time. I didn\\\u0027t know about the Unix EOL thing until now. But I\\\u0027ve only made a few deletions. So I wonder if it\\\u0027s EOL characters that are typed into WordPad that don\\\u0027t work properly?\u003C/p\u003E\u003Cp\u003EI also edited a .craft file once. It was hard, but the only way to build the ship a certain way. The hack worked! But the ship design failed in its own right.\u003C/p\u003E\n"},{"CreatedByName":"BillWiskins","CreatedById":12285,"CreatedDateTime":"2012-03-28T00:01:30Z","Content":"\n\u003Cp\u003EI just opened a .craft in Notepad. Love the warning: \\\u0027do not edit this file by hand. There are no cheating opportunities here. Go away.\\\u0027\u003C/p\u003E\u003Cp\u003EWhat did you achieve in particular by editing the .craft file?\u003C/p\u003E\n"},{"CreatedByName":"Unistrut","CreatedById":2229,"CreatedDateTime":"2012-03-29T02:27:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBy the way, I\\\u0027ve somehow gotten away with editing persistent.sfs in WordPad all this time. I didn\\\u0027t know about the Unix EOL thing until now. But I\\\u0027ve only made a few deletions. So I wonder if it\\\u0027s EOL characters that are typed into WordPad that don\\\u0027t work properly?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\\\u0027t think I had added any EOLs to my file, but who knows, hitting \u0027Return\u0027 is an instinctive enough action that I may have done it without noticing. Are there different versions of Wordpad?\u003C/p\u003E\u003Cp\u003ESorry I haven\\\u0027t been doing much further research, things have been busy around work and home for the last two weeks. Glad to hear this post has been helpful!\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-03-29T16:59:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BillWiskins\u0022 data-cite=\u0022BillWiskins\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI just opened a .craft in Notepad. Love the warning: \\\u0027do not edit this file by hand. There are no cheating opportunities here. Go away.\\\u0027\u003C/p\u003E\u003Cp\u003EWhat did you achieve in particular by editing the .craft file?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\\\u0027s been a while, so I don\\\u0027t quite recall anymore. The gist of it was to reattach the bottom fuel tank and engine of the center stack. There were six stacks connected directly to the side of the top center tank. I wanted fuel hoses to feed the center stack from the longer radial ones. The only way to connect them was to disconnect the center stack in the middle, look up from the floor to connect the hoses, then reconnect the center stack. \u003C/p\u003E\u003Cp\u003EUnfortunately, there is no way to make that last connection. So I put it on the bottom of one engine, and then hacked the X-Y-Z location, connection, and linkage to put it in the right place. \u003C/p\u003E\u003Cp\u003ETo figure out the Z coordinate, I first found the length of a fuel tank and then added that figure to the Z coordinate of the one I wanted to attach to. Somehow I did the math wrong on the first attempt; the poor thing had two overlapping fuel tanks and would immediately explode on the launch pad. Once I fixed the overlap, the thing actually did fly. But it sucked in more mundane ways. I\\\u0027ll see if I can find the .craft file.\u003C/p\u003E\n"},{"CreatedByName":"vlasticz","CreatedById":18972,"CreatedDateTime":"2012-03-29T18:26:48Z","Content":"\n\u003Cp\u003EHi guys,\u003C/p\u003E\u003Cp\u003Ehave anyone figured out what\\\u0027s with kerbalnauts\\\u0027 bravery? It seems not working yet ... I\\\u0027ve tried to put in values ranging from almost zero to 9999999 and my Bruce Dickinson \\m/. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E seems to be the same coward (sorry real Bruce) all the time.\u003C/p\u003E\u003Cp\u003EAny findings or suggestions ?\u003C/p\u003E\n"},{"CreatedByName":"Ntmoore19","CreatedById":646,"CreatedDateTime":"2012-03-29T18:42:24Z","Content":"\n\u003Cp\u003EYou can also recover individual ships that you accidentally ended, provided you have any backups or previous versions of your Persistent file that has the specific Vessel saved in it. \u003C/p\u003E\u003Cp\u003EAll you need to do is open the backup or previous version (Found by right clicking \u0026gt; Restore Previous Versions on Win7) and finding your Vessel using Ctrl\u002BF. Each vessel is saved in the form of text after the word VESSEL, followed by it\\\u0027s name. Search the backup for the Vessel you are trying to recover. \u003C/p\u003E\u003Cp\u003EWhen you find this Vessel, copy it from the first \u003Cem\u003EV\u003C/em\u003E in the word \u003Cem\u003EVESSEL\u003C/em\u003E all the way to the last \u003Cem\u003E}\u003C/em\u003E before the next \u003Cem\u003EVESSEL.\u003C/em\u003E Then simply paste it in your current persistent file like you saw it in the backup and voila! Good as new. \u003C/p\u003E\u003Cp\u003EYou could also use this method to share specific vessels already in-orbit with other players!\u003C/p\u003E\n"},{"CreatedByName":"Unistrut","CreatedById":2229,"CreatedDateTime":"2012-04-03T05:53:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vlasticz\u0022 data-cite=\u0022vlasticz\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAny findings or suggestions ?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe that in order to induce Jeb-Like bravery you need to set badS to \u0027true\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-04-06T08:29:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unistrut\u0022 data-cite=\u0022Unistrut\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI didn\\\u0027t think I had added any EOLs to my file, but who knows, hitting \u0027Return\u0027 is an instinctive enough action that I may have done it without noticing. Are there different versions of Wordpad?\u003C/p\u003E\u003Cp\u003ESorry I haven\\\u0027t been doing much further research, things have been busy around work and home for the last two weeks. Glad to hear this post has been helpful!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell now it doesn\\\u0027t work anymore. All I did was change the name of a ship, and now the sky is completely clean. :\\\u0027( It\\\u0027s happened twice in a row. I did not type the enter key, but it broke down anyway. So maybe it is the Unix EOL thing, like you said. Fortunately, I can still restore a backup copy of persistent.sfs, if I have one.\u003C/p\u003E\n"},{"CreatedByName":"Spearka","CreatedById":12271,"CreatedDateTime":"2012-04-08T14:19:50Z","Content":"\n\u003Cp\u003EToD is which crew are going to be in the pod, an example is Bill, Jeb and Bob, they all have the same ToD and neither of them can be in a seperate pod, they are always in the same pod\u003C/p\u003E\n"},{"CreatedByName":"Kodiak","CreatedById":22663,"CreatedDateTime":"2012-04-23T07:36:17Z","Content":"\n\u003Cp\u003ECan you RESET you Persistent file??? That\\\u0027s what I like to know!\u003C/p\u003E\u003Cp\u003EIs that possible? To start with a clean one?\u003C/p\u003E\u003Cp\u003EMy best regards, Kodiak.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2012-04-23T07:39:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kodiak\u0022 data-cite=\u0022Kodiak\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECan you RESET you Persistent file??? That\\\u0027s what I like to know!\u003C/p\u003E\u003Cp\u003EIs that possible? To start with a clean one?\u003C/p\u003E\u003Cp\u003EMy best regards, Kodiak.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou just delete the persistent file, and the game will generate a clean one on next start.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-05-01T05:47:59Z","Content":"\n\u003Cp\u003ESo I\\\u0027ve decided to mod some parts and make a friction-less orbiter. (See \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=10170.msg176023#msg176023\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E for why I would want to.) I\\\u0027m using Tosh\\\u0027s cart mod, and R4mon\\\u0027s MechJeb and Muon scanner, otherwise only stock parts: half fuel tanks, LFE3s, struts, hoses, parachutes. I don\\\u0027t know why, but the thing seems to have more friction than normal, and is difficult to control if airspeed is greater than terminal velocity. \u003C/p\u003E\u003Cp\u003EHas anyone made a frictionless craft for atmospheric orbital use? Any suggestions?\u003C/p\u003E\n"},{"CreatedByName":"The_Duck","CreatedById":1156,"CreatedDateTime":"2012-05-01T05:52:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHas anyone made a frictionless craft for atmospheric orbital use? Any suggestions?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\\\u0027ve done this, in a much earlier version of KSP, but I don\\\u0027t think the drag physics has changed. I just set all the drag values in all the relevant part.cfg files to 0.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-05-01T06:05:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Duck\u0022 data-cite=\u0022The_Duck\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\\\u0027ve done this, in a much earlier version of KSP, but I don\\\u0027t think the drag physics has changed. I just set all the drag values in all the relevant part.cfg files to 0.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\\\u0027s what I did. I made copies of the parts first, and made these changes:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Emaximum_drag = 0\u003Cbr\u003Eminimum_drag = 0\u003Cbr\u003EangularDrag = 0\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E...but for some reason, the thing seems to have more drag now than the stock parts. Could it have something to do with the mod parts?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-05-01T09:37:13Z","Content":"\n\u003Cp\u003ECheck to make sure that when you make copies of the part, you not only put it in a new folder (obviously), but you also (not so obviously) change the name of the part (in its cfg file) to something different. For example, the normal liquid engine is just called liquidEngine. This is defined not by the folder name (although the folder is named that to avoid needless confusion) but by the name value in the cfg file.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-05-02T17:28:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECheck to make sure that when you make copies of the part, you not only put it in a new folder (obviously), but you also (not so obviously) change the name of the part (in its cfg file) to something different. For example, the normal liquid engine is just called liquidEngine. This is defined not by the folder name (although the folder is named that to avoid needless confusion) but by the name value in the cfg file.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think this was one of my problems; I had forgotten to change the name on one of the parts. The other problems were likely related to the late hour at which I had done the changes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E After starting over with fresh copies of the parts, everything works properly now, and I have a detector in 24km orbit. \u003C/p\u003E\u003Cp\u003EThe detector doesn\\\u0027t like the name change, though. The new part appears in the VAB greyed out, with a note that it is not supported. I figure this is because the name is referenced in the mumech.dll somewhere. Not wanting to mess with that, I just altered the main part.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-05-02T20:49:20Z","Content":"\n\u003Cp\u003EAh. Change the \u003Cstrong\u003Ename\u003C/strong\u003E, and \u003Cem\u003Enot\u003C/em\u003E the \u003Cstrong\u003Emodule\u003C/strong\u003E. The module type is what the game uses to determine whether the part is compatible. That is the \\\u0027part type\\\u0027. If it isn\\\u0027t a known type, you can\\\u0027t use it. Make sure that value stays the same as the original part. For example, with the liquid engine, you want to change this line:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Ename = liquidEngine\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ebut NOT this one:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Emodule = LiquidEngine\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}