{"TopicId":82104,"ForumId":55,"TopicTitle":"Is Squad Planning Full Recovery Ability?","CreatedByName":"Sasuga","CreatedById":119064,"CreatedDateTime":"2014-08-19T03:21:24Z","PageNum":1,"Articles":[{"CreatedByName":"Sasuga","CreatedById":119064,"CreatedDateTime":"2014-08-19T03:21:24Z","Content":"\n\u003Cp\u003EI picked up KSP when I saw it finally had Career Mode (Actually, the name \u0022Career Mode\u0022 didn\u0027t catch my eye, but seeing other people play it and how it worked did.)\u003C/p\u003E\u003Cp\u003ESince there\u0027s a resource of money, and with contracts being the only way to get money (and thus a finite resource), I of course was doing everything I could think of to save money.\u003C/p\u003E\u003Cp\u003EThe first thing I did was to strap parachutes onto my stages, so they would drift down to the planet and be collected up to be reused later. After all, our real world space programs used to do that.\u003C/p\u003E\u003Cp\u003EHowever, I was sad when I got back to planet and found that all the little bits that had safely landed on the planet were gone!?\u003C/p\u003E\u003Cp\u003ESo, I tried several other things, and then watched a video by a very popular KSP YouTuber, and saw how I could recollect pieces if they had probes or cockpits, and then only if I kept the camera (more or less) focused on them (the range is the real issue) until they reached the ground.\u003C/p\u003E\u003Cp\u003ESo, I\u0027m sad.\u003C/p\u003E\u003Cp\u003E=-=-=-=\u003C/p\u003E\u003Cp\u003ESo, my question, as the title asks: Does Squad plan on making full recovery possible (without attaching probes or command modules to everything)?\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-08-19T03:28:53Z","Content":"\n\u003Cp\u003ENo idea and they\u0027re not liable to tell us until and if it\u0027s been released in an update. Anyway, why would you want that? You already get so much cash from contracts that funding is meaningless past a certain point; having everything be recoverable either means the game has to be balanced around that (which messes up disposable play styles) or it makes funds even more useless (a case of \u0022why the hell is this in the game anyway?\u0022).\u003C/p\u003E\n"},{"CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-08-19T12:31:23Z","Content":"\n\u003Cp\u003EThere have been several discussions about this. Someone made a mod to do exactly what you expect KSP to do and it\u0027s called \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86691-0-24-2-DebRefund-v1-0-12\u0022 rel=\u0022external nofollow\u0022\u003EDebrefund\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAnd in a way you did not intend, there is already full recoverability in the game. The refund percentage for the runway is 100%.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-08-19T13:09:53Z","Content":"\n\u003Cp\u003EShort answer: we have no indication if it\u0027s officially planned.\u003C/p\u003E\u003Cp\u003EAddendum: in my opinion, they\u0027d be somewhat crazy not to, even if they don\u0027t do physics sim all the way to the ground.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-19T13:25:50Z","Content":"\n\u003Cp\u003EI was paranoid about not losing stuff in Career at first, too. Of course I know the game well so I did not try to mount parachutes on my spent stages, instead I relied on cheap disposable SRBs in early stages and moved on to SSTO designs as soon as possible. I ended up with lots of money, more than I ever need and every contract just adds up to that. On the downside, my space program did not resemble any real world evolution of space programs.\u003C/p\u003E\u003Cp\u003EPersonally I hope future tweaks to the system will clear the gap between SSTOs and classical staged rockets. At present, SSTOs are just way too beneficial.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-19T16:41:34Z","Content":"\n\u003Cp\u003EActually you\u0027re wrong in the asumption that Funds are a finite resource.\u003C/p\u003E\u003Cp\u003EConctracts are indeed (currently) the only way to get them, but contracts are not finite. And thus, funds are not finite\u003C/p\u003E\n"},{"CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2014-08-19T17:43:44Z","Content":"\n\u003Cp\u003EConsidering how easily obtained funds are, I don\u0027t really think that it\u0027s vital to meticulously recover every spent part.\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t be surprised if the plan was to keep recovery as it is at the moment. It\u0027s already ridiculously easy to have rockets go SSTO, meaning recoverability can be shamelessly abused.\u003C/p\u003E\u003Cp\u003EI suppose it just depends upon your playing style. I tend to set up satellites and spam the \u0022science data from space around...\u0022 contracts, which in itself is a function that can be exploited.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-08-19T20:37:44Z","Content":"\n\u003Cp\u003EWord of caution -- don\u0027t mistake the way really anything is for the way it will always be. Funds are still quite a new thing, especially, and they\u0027ve only done a cursory balance pass for the feature. It would not surprise me to see them rebalance them fifty times in the future, if not more. If it\u0027s going to be a key point of balance for the game, they \u003Cem\u003Ear\u003C/em\u003E going to rebalance it. A lot, in all likelihood.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork_werewolf","CreatedById":90749,"CreatedDateTime":"2014-08-19T21:02:34Z","Content":"\n\u003Cp\u003EFirstly I will say an important point. \u003C/p\u003E\u003Cp\u003EThere is NO LIMIT to the number of contracts. There is NO limit on the funds you can accumulate.\u003C/p\u003E\u003Cp\u003EEach contract can (and often will) come up multiple times. Sending data from around Kerbin is a common one and will net you 30k EACH time you complete it even when the data has 0 science value. That\u0027s right ZERO science points.\u003C/p\u003E\u003Cp\u003EThe funds in the game for an experienced player can be far too high. People talk of having 4-20 million in the bank. I personally modded the game so each part cost 8 times its original cost. It\u0027s been an interesting game so far, Jeb keeps sending sponsored messages from orbit to fund my program and one launchpad disaster cost me 500,000.\u003C/p\u003E\u003Cp\u003ERecoverable parts are a long and complex matter but the simple answer is that they either cause stupidly simple simulations or complex ones, no reason ever to not just strap parachute or no cost benefit to doing it, no reason to ever use an SSTO or no change to the game. The present setup is the best game mechanic I can think of even if it\u0027s not the best real world simulation. As always we are bless to be able to mod our games to be played any way we like.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2014-08-19T21:33:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EPersonally I hope future tweaks to the system will clear the gap between SSTOs and classical staged rockets. At present, SSTOs are just way too beneficial.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, one thing they could do to help with that is actually impose a recovery cost maximum of less than 100%.\u003C/p\u003E\u003Cp\u003EIf the maximum was say, 80% on the runway or launchpad, then any spaceplane or rocket SSTO landing there would have a \u0027refurbishment\u0027 cost. If a player elected instead to re-fuel the craft with a fuel tanker, THAT would eventually have to be \u0027refurbished\u0027.\u003C/p\u003E\u003Cp\u003EAlternatively fuel could be made into a much larger portion of the cost of a craft, although that takes it even further from reality than it is now (but who knows? maybe fuel is scarcer on Kerbin -- maybe they lack the large fossil hydrocarbon reserves of Earth, and have to synthesize all of their fuel slowly from renewable sources and power with a costly and inefficient process or somesuch).\u003C/p\u003E\n"}]}