{"TopicId":82208,"ForumId":16,"TopicTitle":"Odd center of lift position","CreatedByName":"Scuka","CreatedById":119124,"CreatedDateTime":"2014-08-20T15:07:22Z","PageNum":1,"Articles":[{"CreatedByName":"Scuka","CreatedById":119124,"CreatedDateTime":"2014-08-20T15:07:22Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i59.tinypic.com/25sxto6.jpg\u0022 alt=\u002225sxto6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, as you can see on the image, it\u0027s a pretty basic rocket. It\u0027s perfectly symetrical, all fuel tanks are 100% full and all engines are set to 100% thrust. yet the center of lift is shifted to the side, causing the rocket to have a tendency to tip to the side.\u003C/p\u003E\u003Cp\u003EPlacing some winglets on the rocket fixes it.\u003C/p\u003E\u003Cp\u003EBut I don\u0027t understand why it\u0027s shifted without the winglets and how are winglets putting it back into the center? None of my other similarly designed rockets have that problem.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-21T07:49:52Z\u0022 title=\u002208/21/2014 07:49  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 21, 2014\u003C/time\u003E by Scuka\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Belphegor","CreatedById":118918,"CreatedDateTime":"2014-08-20T15:20:46Z","Content":"\n\u003Cp\u003Ei think center of lift only shows aerodynamic lift. (wings) (edit. this is probably wrong)\u003C/p\u003E\u003Cp\u003Emaybe it\u0027s off center because you have more drag on one side of your rocket than the other.. your struts on the lower stage are not symetrical and you misplaced a fuel line(?) on the tank nearest to the center of lift. but i don\u0027t know if struts and fuel lines have a drag value\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-20T15:26:43Z\u0022 title=\u002208/20/2014 03:26  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 20, 2014\u003C/time\u003E by Belphegor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-08-20T15:29:27Z","Content":"\n\u003Cp\u003EThe CoL isn\u0027t shifted to the side, there is no center of lift at all. If there were, you would see an arrow like with CoT. Lift is only created by lifting surfaces of which you have none on this craft.\u003C/p\u003E\u003Cp\u003EYour rocket is tipping to the side because your missing fuel lines and the tanks are draining unevenly.\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2014-08-20T17:17:23Z","Content":"\n\u003Cp\u003EFrom the picture it looks like the Center of Thrust is centered.\u003C/p\u003E\u003Cp\u003EWhich engines are you using: LV-T45 or LV-T30?\u003C/p\u003E\u003Cp\u003EThey look similar but the middle one of your engines should be a LV-T45 because it has Gimbaling.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Gimbaled_thrust\u0022 rel=\u0022external nofollow\u0022\u003EGimbaling\u003C/a\u003E is a property of an engine that allows it to change the direction of thrust in order to make course corrections.\u003C/p\u003E\u003Cp\u003EWithout it the Remote Guidance Unit probably has not enough torque to keep the rocket flying in a straight line.\u003C/p\u003E\u003Cp\u003EThe winglets offer another way of steering the rocket in atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"AlexanderB","CreatedById":17544,"CreatedDateTime":"2014-08-20T17:31:24Z","Content":"\n\u003Cp\u003EIf the marker is stuck to the floor like that, theres no wings/winglets to calculate lift from.\u003C/p\u003E\u003Cp\u003EThe leaning problem is (as noticed before) due to fuel imbalance..\u003C/p\u003E\n"},{"CreatedByName":"Scuka","CreatedById":119124,"CreatedDateTime":"2014-08-21T07:49:39Z","Content":"\n\u003Cp\u003EYeah, it was the fuel imbalance. For some reason, I was absolutely certain that I connected the fuel lines correctly when I was trying it out. I was wrong, though xD\u003C/p\u003E\n"}]}