{"TopicId":82247,"ForumId":16,"TopicTitle":"Impossible to build or bug?","CreatedByName":"Agricola","CreatedById":61290,"CreatedDateTime":"2014-08-20T21:12:30Z","PageNum":1,"Articles":[{"CreatedByName":"Agricola","CreatedById":61290,"CreatedDateTime":"2014-08-20T21:12:30Z","Content":"\n\u003Cp\u003EI have been trying to build a couple of features which require a template part to place two docking rings on main section, however when I select this template I only get one green construction ball, is this a bug or just a stupid bad bit of coding which only allows one join to be active. See screen shot below, notice the selected parts with just a single green ball, can not even stick docking ports to side of tank. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/23962585504024938/F0019548ACF6A37E045B03A2851374E17F070F5D/\u0022 alt=\u0022F0019548ACF6A37E045B03A2851374E17F070F5D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-20T21:30:56Z\u0022 title=\u002208/20/2014 09:30  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 20, 2014\u003C/time\u003E by Agricola\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mesons","CreatedById":76697,"CreatedDateTime":"2014-08-20T21:19:13Z","Content":"\n\u003Cp\u003EMore information would be helpful, like the steps you used to build the sub-assembly, but I suspect you are suffering from the part hierarchy coding. Every time you add a new part, it becomes a \u0022child\u0022 of the part you stuck it onto, which is the \u0022parent\u0022 part of that child. In this way, every part has a parent except the root part, which is always the first part you place. When you drop a collection of parts into a sub-assembly, the part you grabbed (with all its children attached) is made the root part of the assembly. Where that part was attached to its parent will be the only place you can attach the assembly.\u003C/p\u003E\u003Cp\u003EYou\u0027ll need to build your sub-assembly in such a way that you pluck it off the craft to save it from the same point at which it will be attaching. If this isn\u0027t the problem you\u0027re experiencing, post more details and perhaps file a \u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/\u0022 rel=\u0022external nofollow\u0022\u003Ebug report\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2014-08-20T21:20:29Z","Content":"\n\u003Cp\u003EA subassembly can only have one green ball, so I guess you\u0027ll need to duplicate one of the parts\u003C/p\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2014-08-20T21:28:33Z","Content":"\n\u003Cp\u003EThe building system in KSP works like a tree: there is one \u0022root\u0022 part that all other parts are sequentially attached to. When building normally, this is usually the command pod (you can check which part is the root part by grabbing it, the whole craft will move intact if you grab the root). A limitation of KSP\u0027s part-tree system is that you can\u0027t have branches re-connecting back to the tree to form connected loops.\u003C/p\u003E\u003Cp\u003ESubassemblies work in the same way, when you grab an assembly and save it, the part you grab becomes the root part of that assembly. You will only have an active attachment point on the root part of a subassembly. This means that it is impossible to connect branch-to-branch, which seems to be what you are trying to do.\u003C/p\u003E\n"},{"CreatedByName":"Agricola","CreatedById":61290,"CreatedDateTime":"2014-08-20T21:29:06Z","Content":"\n\u003Cp\u003EOK thanks hierarchy makes sense then, so I was wasting my time then, back to the drawing board and try to work out how to do this. It would be a nice future request to have all points available in a sub assembly active.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-20T21:42:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Agricola\u0022 data-cite=\u0022Agricola\u0022\u003E\u003Cdiv\u003EOK thanks hierarchy makes sense then, so I was wasting my time then, back to the drawing board and try to work out how to do this. It would be a nice future request to have all points available in a sub assembly active.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suggest you get the mod \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43208-0-24-Jul18-SelectRoot-Set-a-new-root-part-0-24-new-UI\u0022 rel=\u0022external nofollow\u0022\u003ESelect Root\u003C/a\u003E. This will allow you to change the root of a craft after you already built it.\u003C/p\u003E\u003Cp\u003EWith this function added, you can build your subassambly like normal, and when it\u0027s time to save, you switch the root (the new root being the part you attatch to the rocket. In this case, the docking port), and save.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t want to use the mod, just rebuild this subassambly, it\u0027s not to complex. In this case, the first part you place would be the docking port\u003C/p\u003E\n"}]}