{"TopicId":82243,"ForumId":44,"TopicTitle":"How do lone planets get captured?","CreatedByName":"Idrryl","CreatedById":115209,"CreatedDateTime":"2014-08-20T20:28:47Z","PageNum":1,"Articles":[{"CreatedByName":"Idrryl","CreatedById":115209,"CreatedDateTime":"2014-08-20T20:28:47Z","Content":"\n\u003Cp\u003ESo yeah, how do they get captured? It\u0027s not like they can aerobrake near the star. And having an escape velocity from a whole solar system, it\u0027s speed must be massive.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-08-20T20:34:07Z","Content":"\n\u003Cp\u003EThey usually don\u0027t. But if they do, it\u0027s in the exact opposite way in which they are flung out of their parent system in the first place: gravitational interaction with a star and the things orbiting the star.\u003C/p\u003E\u003Cp\u003ETheir escape velocity from their parent system might be big, but that doesn\u0027t mean that they still have all that velocity after drifting for a few million years through interstellar space.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-21T16:48:32Z\u0022 title=\u002208/21/2014 04:48  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 21, 2014\u003C/time\u003E by Dkmdlb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-08-21T16:47:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idrryl\u0022 data-cite=\u0022Idrryl\u0022\u003E\u003Cdiv\u003EIt\u0027s not like they can aerobrake near the star\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere \u003Cem\u003Eis\u003C/em\u003E a principle called Radiation Pressure, it\u0027s based off of the fact that light has \u003Cem\u003Emass-energy\u003C/em\u003E, and thus may transfer force. You could think of the principle as being analogous to aerobreaking...\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-08-21T16:48:08Z","Content":"\n\u003Cp\u003EIf the star is young enough, they might \u0022aerobrake\u0022 by interacting with protoplanetary disk.\u003C/p\u003E\u003Cp\u003EIf the planet gets very close to the star, tidal effects might slow it down, or not, I\u0027m too lazy to properly think this through.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-08-21T17:22:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Idobox\u0022 data-cite=\u0022Idobox\u0022\u003E\u003Cdiv\u003EIf the star is young enough, they might \u0022aerobrake\u0022 by interacting with protoplanetary disk.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre protoplanetary disks dense enough?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-08-21T17:29:31Z","Content":"\n\u003Cp\u003EFor a planet, yes, they are. Also, KSP\u0027s gravity simulation is very primitive. Actual n-body systems can, though somewhat convoluted gravitational interaction, actually cause an object to end up in orbit around a body. \u003C/p\u003E\u003Cp\u003EAn object moving from infinity (or \u0022far away) towards the Sun will have at least the escape velocity at any point of it\u0027s trajectory, so it can\u0027t be that it\u0027s going \u0022slow enough\u0022 to suddenly get captured. However, gravitational influence of other planets, as well as other objects can slow it down. This can happen in a manner similar to gravity assist, but working in reverse, or in other, subtler ways that patched conics can\u0027t account for.\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2014-08-21T17:49:45Z","Content":"\n\u003Cp\u003EAlso, it depends on injection angle. Even assuming a capture star of exactly the same mass and no loss of speed, a planet can still be captured by another star if it cuts across the system in the right fashion. Viz. gravity is a lot more coplicated than KSP gives it credit for.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2014-08-21T18:04:38Z","Content":"\n\u003Cp\u003EA lot of star systems have more than one, some as many as three stars. Planets passing through these systems might be handed off between stars until a capture is completed.\u003C/p\u003E\u003Cp\u003EAdditionally, some star systems may have large Jupiter-esque planets that can loop a passing planet back in for a second or third pass of the star, lowering its speed below escape velocities.\u003C/p\u003E\u003Cp\u003EFinally, most (all?) planets are born from the protoplanetary disk. Planets that escape probably rarely get captured by a new system.\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-08-22T00:19:57Z","Content":"\n\u003Cp\u003EThey also may kick out a nearby planet. When the forces cancel each other out the rogue planet will have a new family and the other planet will be forcibly flung out of the system.\u003C/p\u003E\n"},{"CreatedByName":"Krosulhah","CreatedById":83946,"CreatedDateTime":"2014-08-22T00:20:51Z","Content":"\n\u003Cp\u003EWith a net.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ESorreh..... That\u0027s all i\u0027ve got to add to this one... \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E \u003C/span\u003E\u003C/p\u003E\n"}]}