{"TopicId":82476,"ForumId":16,"TopicTitle":"coming in to fast!!!","CreatedByName":"Truxton Corp.","CreatedById":119205,"CreatedDateTime":"2014-08-22T15:09:29Z","PageNum":1,"Articles":[{"CreatedByName":"Truxton Corp.","CreatedById":119205,"CreatedDateTime":"2014-08-22T15:09:29Z","Content":"\n\u003Cp\u003EI desperately need help everyone, every rocket I build to go to the mun either crashes on the muns surface or passes the mun by seemingly INCHES!!!! is there anything I can do to prevent this?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-22T16:39:11Z","Content":"\n\u003Cp\u003EYou need to have some fuel left in your rocket. When the rocket passes by the Mun, turn it against its direction of flight and turn on your engines. That should slow it down. Once you\u0027re slow enough, Mun will start to attract the rocket by its gravity. Then you need to use the engine to slow down your fall and put the rocket gently on the surface.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-08-22T16:54:59Z","Content":"\n\u003Cp\u003ESet your munar PE to about 8-10km, burn retrograde to circularize your orbit... you should now have a velocity of ~550 m/s, instead of whatever you were coming in at.\u003C/p\u003E\u003Cp\u003ENext, burn retrograde some more when you feel like it (you\u0027re in a stable orbit after all, you can wait), until you see your trajectory intersecting where you want to land (somewhere flat!)\u003C/p\u003E\u003Cp\u003ENext, put a maneuver node before where your trajectory intersects the terrain, and pull the retrograde marker all the way back.\u003C/p\u003E\u003Cp\u003ELook at your burn time estimation (I often have to give a momentary burst of throttle to get it to display right for some reason...), take whatever time it says the burn will take and start burning when you have 2/3 to 1/2 of that time until you reach your maneuver node.\u003C/p\u003E\u003Cp\u003ESuppose it reads 1 minute... start burning 30-40 seconds before you reach that node.\u003C/p\u003E\u003Cp\u003EThis should put you nearly stopped over your landing area with a bit of altitude, now just come straight down like its a 3d version of that old moonlander arcade/Dos game.\u003C/p\u003E\u003Cp\u003EAll this supposes, of course, that you\u0027ve built a rocket with enough dV to do this.\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2014-08-22T16:58:48Z","Content":"\n\u003Cp\u003EGet Mechjeb. Delve into it\u0027s configuration and you\u0027ll find, under surface, two indicators which aren\u0027t shown by default: time for impact and, more importantly, \u0022Suicide burn\u0022. Load them up in the surface window or any other window of your choosing. You can also get Kerbal Engineer Redux - in its surface tab, you\u0027ll find the inclination of the terrain below (once you\u0027re low enough).\u003C/p\u003E\u003Cp\u003ESo, here\u0027s what you need to do:\u003C/p\u003E\u003Cp\u003EGet your Pe low. 10-15 km will do. You may also lower your Ap. When your orbit is roughly near the place you want to land, create a maneuver node and pull the retrograde until you\u0027re falling vertically. What this will do is to kill your horizontal velocity, or at least, most of it. This not only lets your pinpoint your landing, it also saves fuel.\u003C/p\u003E\u003Cp\u003EKeep Mechjeb or KER\u0027s surface window on sight. You\u0027ll have \u0022time to impact\u0022 (important), \u0022horizontal speed\u0022 and \u0022vertical speed\u0022. Needlessly to say, horizontal speed is the speed you\u0027re moving across the ground below while vertical speed is the speed you\u0027re falling, or climbing.\u003C/p\u003E\u003Cp\u003EYou should kill your horizontal velocity so you don\u0027t tumble when you land. To do so, switch your navball to surface, point towards the retrograde vector and burn until your H/S is below 2 m/s.\u003C/p\u003E\u003Cp\u003ENow Mechjeb\u0027s \u0022suicide burn\u0022 indicator becomes useful. This indicator will tell you how much time you have left to burn full throttle upwards so you hit the ground at 0 m/s. It\u0027s only accurate if your horizontal speed is zero. If it\u0027s negative, you\u0027ll crash and your only chance is to augment your throttle with RCS.\u003C/p\u003E\u003Cp\u003ESince it takes time for the throttle to go from zero to full, you should wait until the suicide burn is around 5 seconds, and fire full throttle while you\u0027re aiming straight into the sky (at the center of your navball). Once your vertical velocity is below 10 m/s, or less if you feel like, cut your throttle and continue falling. Your V/S and your suicide burn indicators will increase, you can rinse and repeat. Typically, you can land fine with speeds below 10 m/s unless you\u0027re landing on your engines. Some rover wheels can resist speeds of 50 m/s (the tires will break) but you will probably rebound.\u003C/p\u003E\u003Cp\u003EJust in case, once you\u0027re about to land retract any solar panel and activate your RCS. If you aren\u0027t landing on a perfectly flat surface, your ship will likely tumble to a side. Use your RCS to keep it centered. Don\u0027t use the camera view to check in which direction you need to rotate (ie, press the WASDQE keys), use your navball.\u003C/p\u003E\u003Cp\u003EYou should also train your landings at Minmus rather than the Mun. It takes more DV to reach it, but landings are far easier due the lower gravity and the easier terrain.\u003C/p\u003E\u003Cp\u003EOh, and about mechjeb, Neil Amstrong and Buzz Aldrin didn\u0027t descend by floating a camera nearby and eyeballing their speed.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-22T17:01:47Z","Content":"\n\u003Cp\u003EOn second thought, I really wonder how can someone \u0022pass the mun by seemingly INCHES\u0022 and not figure out how to land on it. I smell fish.\u003C/p\u003E\u003Cp\u003EEspecially if he already \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60125-MSP-Modded-And-Stock-Military-Planes-NOW-HIRING%21?p=1360525#post1360525\u0022 rel=\u0022external nofollow\u0022\u003Edesigned a fighter jet named Hellhound with auto pilot capabilities\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-08-22T17:06:37Z","Content":"\n\u003Cp\u003EWhile you\u0027re doing your braking burn over Mun prior to landing, make sure your speedometer is set for Surface mode and keep an eye on your vertical ascent/descent meter. If you start descending, pitch yourself up towards the vertical - not too much; as a rule you don\u0027t want to start \u003Cem\u003Eascending\u003C/em\u003E at a rate much more than 5 m/s. Make sure you\u0027re burning retrograde. Lower to 2/3 throttle as your speed goes below 100 m/s, then again as you slow past 30 m/s or so. Once you\u0027re roughly vertical, go IVA and find your radar altimeter. You\u0027re generally okay to freefall until that starts twitching - but keep your speed low (no more than 50 m/s). Once it starts twitching, you\u0027ll have an idea of the location of the deck. At that point it\u0027s just keeping speed under control; you don\u0027t want it greater than 12 m/s if you want to survive landing, and generally 5 m/s or less assures that nothing will break.\u003C/p\u003E\u003Cp\u003EThose are just general guidelines; for a better walkthrough, I\u0027d need to see your lander.\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2014-08-22T17:34:36Z","Content":"\n\u003Cp\u003EI came across a handy little tip on one of the threads here, I can\u0027t remember who posted so apologies to that person\u003C/p\u003E\u003Cp\u003Eplace a maneuver node at the point where your trajectory meets the moons surface and drag the retro handle until the speed reaches zero, that will give you a burn time for doing suicide burns.\u003C/p\u003E\u003Cp\u003EThankfully it\u0027s a little on the forgiving side so you should never crash into the surface.\u003C/p\u003E\u003Cp\u003EI hope my explanation is clear, it\u0027s sort of difficult to explain.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-08-22T19:17:57Z","Content":"\n\u003Cp\u003EI\u0027m not sure landing is even the question here, but the whole process of flying to Mun, or anywhere else.\u003C/p\u003E\u003Cp\u003ESo, OP - how are you going to Mun at the moment? Hohmann transfer from LKO or what? Where do you have the problem - getting an intercept (presumably not), orbital insertion (probably) or landing?\u003C/p\u003E\n"},{"CreatedByName":"Truxton Corp.","CreatedById":119205,"CreatedDateTime":"2014-08-23T17:30:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EOn second thought, I really wonder how can someone \u0022pass the mun by seemingly INCHES\u0022 and not figure out how to land on it. I smell fish.\u003Cp\u003EEspecially if he already \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60125-MSP-Modded-And-Stock-Military-Planes-NOW-HIRING%21?p=1360525#post1360525\u0022 rel=\u0022external nofollow\u0022\u003Edesigned a fighter jet named Hellhound with auto pilot capabilities\u003C/a\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell that my friend is aided by the laser mod which allows you to add auto pilot capabilities to ANYTHING...is does not work to well with rockets though...best with space planes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand second...sometimes my timing is off and i burn all my fuel trying to adjust my trojectory towards the mun (I would rather have a direct tragectory towards the mun than me bashing my ship at high speeds on the side of the mun:D)\u003C/p\u003E\u003Cp\u003Eand thanks guys your tips and assistance is really helpful, ill upload the pic of the capsule landing safely on the mun here!\u003C/p\u003E\u003Cp\u003EPecan...part of this problem MIGHT just be getting an orbital insertion...do you think you could help me with that to?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-23T18:01:12Z\u0022 title=\u002208/23/2014 06:01  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 23, 2014\u003C/time\u003E by Truxton Corp.\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Truxton Corp.","CreatedById":119205,"CreatedDateTime":"2014-08-23T23:30:09Z","Content":"\n\u003Cimg src=\u0022http://i.imgur.com/lm7AheI.png\u0022 alt=\u0022lm7AheI.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/govoqNi.png\u0022 alt=\u0022govoqNi.png\u0022\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-24T01:09:22Z\u0022 title=\u002208/24/2014 01:09  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 24, 2014\u003C/time\u003E by Truxton Corp.\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-08-24T14:07:48Z","Content":"\n\u003Cp\u003EHow to get to Mun from LKO:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ESwitch to map mode (M), click on Mun and \u0027set as target\u0027\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECreate and execute a manoeuvre node at the next AN/DN burning normal/anti-normal (pink icons) to match planes with Mun (makes the new AN/DN difference 0 degrees or, if perfect, \u0027NaN\u0027 which is computerese for \u0027Not a Number\u0027)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECreate but do not yet execute a manoeuvre node anywhere on your orbit burning prograde (green icon) to raise your apoapsis to Mun orbital height (should be around 940m/s deltaV).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDrag this manoeuvre node around your orbit until it gives you an intercept with Mun.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPoint to the manoeuvre node on the navball and start the burn half the burn-time before you reach it (eg; if KSP says it\u0027ll take 1 minute, start the burn at T:-30s)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETimewarp until just before you transition to Mun\u0027s SOI then wait at normal time until you have switched\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMake a small burn (shouldn\u0027t be more than about 50m/s deltaV) to set your periapsis at the height and orbital inclination you want (8km is good)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECreate a manoeuvre node at your periapsis, burning retrograde, to circularise the orbit at that height (should be roughly 230m/s deltaV)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBurn as indicated, starting at the appropriate time before you reach the node\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOnce circularised separate your lander, pick your landing site and go for it!\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhich of these gives you the problem? (See Chapter 5 of my tutorial for a couple of designs that are suitable for Minmus and Mun landings and return if you need ideas).\u003C/p\u003E\n"}]}