{"TopicId":82657,"ForumId":25,"TopicTitle":"Neil Armstrong Rover Race","CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-08-23T23:12:52Z","PageNum":1,"Articles":[{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-08-23T23:12:52Z","Content":"\n\u003Cp\u003EThe armstrong race is designed to test your rover design against each other. The race consists of 7 crossing lines marked out with flags on the mun. The course has a minimum length of ~24 km, ~12 km per half lap. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/kTzUm\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat you need:\u003C/p\u003E\u003Cp\u003EThe race track is provided here: \u003Ca href=\u0022http://www./download/s95p6ue2y9p5faw/KSP\u002BArmstrong\u002BRace.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/s95p6ue2y9p5faw/KSP\u002BArmstrong\u002BRace.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJust install it in your KSP folder, it will put in the Armstrong Race savegame and the flags. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERules\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERun the Course, Present Your Times, Present Rover Mass:\u003C/strong\u003E Start from the center start-finish line through 1 through 3 back through the start-finish line, through 4 through 6 and back to the start-finish. Record and present your time to finish each half lap and the total summed time of both. So that should be three times presented, one of which being the sum of the other two, all times in seconds. You can do just one half lap and present the time for just that, but to be considered competitive for total time you need to finish the whole track. You can also present your rover\u0027s mass to compete for lightest-fastest rover, your time will be multiplied by the mass of your landed rover (not include launch/landing vehicle mass) to determine who has got the fasted rover by mass. Rover mass should be in tons down to second decimal point.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENo Flying, You Know What I Mean! :\u003C/strong\u003E You can\u0027t use thrusters or anything that uses fuel. Your rover needs to push against the ground to move. The principle of this race is to test rover designs against each other in public so as to provide a public knowledge in how to make better rovers and how they perform in KSP. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMod Away, But Why? :\u003C/strong\u003E You can use mods but explain why you used those mods. How does it improve rover performance? \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFly it, Land it:\u003C/strong\u003E All rovers must be land-able, sure you can hyper-edit your rover there for testing but your rover should be able to be launched from Kerbin and land on the Mun.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPresent and Share:\u003C/strong\u003E You need to post your rover design, either here or linked here to it on The Spacecraft Exchange (I don\u0027t know, I\u0027ll let a moderator chime in on how that is done), your rover design does not need to include the launch vehicle, unless someone raises the challenge that your rover could not have been landed on the Mun, then you need to provide the rover with launch vehicle to prove it can be landed. If it can\u0027t be landed no place on the score board for you! \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENo Lying:\u003C/strong\u003E If others can\u0027t get your rover design to achieve anything near the time you claim, and you can\u0027t provide definitive evidence of your claimed times you will be stricken from the score board. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESCORE BOARD\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E Time Categories \u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBest Total Time:\u003C/strong\u003E Kasuha\u0027s \u0022Armstrong Rover Racer\u0022 942 s , RuBisCO\u0027s \u0022Spider\u0022 950 s\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBest Easy Half Lap Time:\u003C/strong\u003E Kasuha\u0027s \u0022Armstrong Rover Racer\u0022 490 s , RuBisCO\u0027s \u0022Spider\u0022 488 s \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBest Hard Half Lap Time:\u003C/strong\u003E Kasuha\u0027s \u0022Armstrong Rover Racer\u0022 452 s, RuBisCO\u0027s \u0022Spider\u0022 462 s \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E Time X Mass of Rover Ratio Categories \u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBest Total Ratio:\u003C/strong\u003E RuBisCO\u0027s \u0022Spider\u0022 3752.5 s*t, Kasuha\u0027s \u0022Armstrong Rover Racer\u0022 4597 s*t\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBest Easy Half Lap Ratio:\u003C/strong\u003E RuBisCO\u0027s \u0022Spider\u0022 1927.6 s*t, Kasuha\u0027s \u0022Armstrong Rover Racer\u0022 2391.2 s*t \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBest Hard Half Lap Ratio:\u003C/strong\u003E RuBisCO\u0027s \u0022Spider\u0022 1824.9 s*t, Kasuha\u0027s \u0022Armstrong Rover Racer\u0022 2205.8 s*t \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FFFFFF;\u0022\u003E\u003Cspan\u003EThere are some easter eggs hidden by me in those savegames, can you find them?\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-25T02:30:58Z\u0022 title=\u002208/25/2014 02:30  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 25, 2014\u003C/time\u003E by RuBisCO\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-08-24T01:38:54Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/49216-0-24-2-Persistent-Trails-record-share-and-replay-track-data!-%28Aug-1-V1-1%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/49216-0-24-2-Persistent-Trails-record-share-and-replay-track-data!-%28Aug-1-V1-1%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERecommend to use this mod.\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-08-24T01:54:04Z","Content":"\n\u003Cp\u003ESure, but I don\u0027t want anyone staying on a fixed track, they can go where ever as long as they make it through those 8 checkpoints (in order). I\u0027ll try it but I don\u0027t want anyone to think they have to follow my path. I see nothing wrong with challengers showing the exact path they took though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-24T01:58:41Z\u0022 title=\u002208/24/2014 01:58  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 24, 2014\u003C/time\u003E by RuBisCO\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"goduranus","CreatedById":112154,"CreatedDateTime":"2014-08-24T02:09:26Z","Content":"\n\u003Cp\u003ECan ground rollers enter as well?\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-08-24T02:39:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022goduranus\u0022 data-cite=\u0022goduranus\u0022\u003E\u003Cdiv\u003ECan ground rollers enter as well?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes as long as thrust is coming from something pushing against the ground.\u003C/p\u003E\n"},{"CreatedByName":"Darren9","CreatedById":58062,"CreatedDateTime":"2014-08-24T10:20:50Z","Content":"\n\u003Cp\u003EI used the RollKage Kerbichelin Extreme wheels because it\u0027s virtually impossible to crash with them, and also fitted Infernal Robotics hinges with spring of 0.5 as trailing axle suspension because it\u0027s also virtually impossible to crash with it, and Tweakscale/Procedural Parts just to make it look nice. The result was I finished the first half lap before then crashing at gate 4. Started at 5:00 and finished at 14:05 for 9 minutes 5 seconds and the buggy weighs 0.515T without the two Kerbals. Should be easy to beat with grippier tires.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/3rWSyoIuc_Q?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-24T15:10:29Z","Content":"\n\u003Cp\u003EThanks for the challenge. I decided to try it stock, mass of the rover is 4.88 t without a Kerbal. I could have made it lighter if I used cubic octagonal struts instead of girders but for some reason I decided against it.\u003C/p\u003E\u003Cp\u003EStart time 11:35, first lap time 19:45, final time 27:17 so first lap took 8:10, second lap 7:32, total 15:42\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/vmaLi\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-08-24T16:44:01Z","Content":"\n\u003Cp\u003Eyeah cubic strut vehicles tend to implode without a Kerbal in the chair. (ref: Manley\u0027s Munar KAS Rover which did precisely that)\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-08-24T20:19:16Z","Content":"\n\u003Cp\u003EWOW those times are awesome, I thought I would blow everyone away with my little spider and SQUIDED wheels but dam, I\u0027m slow! \u003C/p\u003E\u003Cp\u003EDarren9 if you could post all 3 times and the design, as well as the design from you Kasuha, then I think I could put you guys up on the score board.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-24T21:07:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RuBisCO\u0022 data-cite=\u0022RuBisCO\u0022\u003E\u003Cdiv\u003EDarren9 if you could post all 3 times and the design, as well as the design from you Kasuha, then I think I could put you guys up on the score board.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh I did not notice you need a craft file. My rover is nothing special, not really good for anything but the race.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.sendspace.com/file/oldsjj\u0022 rel=\u0022external nofollow\u0022\u003EHere it is\u003C/a\u003E. Note it is a subassembly so it belongs to Subassemblies folder.\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-08-24T21:41:48Z","Content":"\n\u003Cp\u003EMy Spider here is stripped down to just SQUIED Wheels and MechJeb as modded parts. With the inner wheels set to 50 and the outwheels set to 10 squid factor it managed to do the whole course in 15:50 (950 s), EHL was 8:08 (488 s) and HHL was 7:42 (462 s). It can withstand very hard falls with no permanent damage, but those wheels will pop! When that happens I hit the breaks, stop, get out, fix the wheels, thankfully all the wheels can be fixed from the door. The best run time I\u0027m presenting is when I managed not to pop the wheels (and not had to jump out and fix them). It weighs 3.95 t so that is 3752.5 s*t total, EHL: 1927.6 s*t, HHL: 1824.9 s*t\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/59ggxnksfuzn3od/Spider\u002B%28basic%29.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/59ggxnksfuzn3od/Spider\u002B%28basic%29.zip\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EMy scorpion was not intended for racing but rather as a fuel shuttle for the Mun and Minmus as well as a crane, but it turns out to be the fastest thing I got at least on a straight run, it turns like a shopping cart missing a wheel though so you got to be gentle on the turns, real gentle. \u003Cstrong\u003EI got 14:51 (891 s) total, 7:37 (457 s) for the EHL and 7:14 (434 s) for the HHL.\u003C/strong\u003E It has NearFutureSpacecraft mod for the command pod, KW for the tanks, KSPX and RLA_Stockalike for the little tanks and engine mounts and little SAS, AIES for the engines, MagicSmokeIndustries for the retractable suspension (for reduced profile to fit in aeroshell) as well as optional crane, KAS for carrying cargo and doing what ever else, Mechjeb for stability control and setting it to run at max speed (set rover speed to 100 m/s even though it never gets much above 40 m/s) Bill-Jeb 9000 for beautified mechjeb parts, some HullCameraVDS cameras for the forward and back view, and of course SQUIDED wheels. I locked the center wheels and set them to 50 Squiding, the outwheels were set to 10. It can\u0027t stand hard falls so I needed to slow down at the edge of the crater to prevent it flying down or out and falling hundred of meters away at smashing speeds. The tanks were empty so I could not use RCS or the engines (that would be cheating) but those could cushion suicidal falls in theory. Weighing in at 12.14 tons empty it could not and never would compete for time*mass ratio. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/nau3e99lsbvnzpv/Scorpion\u002B%28Retractable\u002BSuspension%29.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/nau3e99lsbvnzpv/Scorpion\u002B%28Retractable\u002BSuspension%29.zip\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2014-08-26T03:40:36Z","Content":"\n\u003Cp\u003EThe Flee is a tiny rover designed as a probe rover. Remove a camera and adjust the panels and it has space for an antenna and one science instrument, that is it! You need AIES mod, camera mod and SQUIDS. With only the inside wheels charged its a fast runner for its size, doing 10-15 m/s, do not recommend going much faster or the wheels will explode, literally. Weighing only 470 kg it is the smallest-fastest rover I got. Total Time: 2234 s, HHL: 1088, EHL: 1146, Time*Mass Total: 1050.0 s*t, EHL: 538.6 s*t, HHL: 511.4 s*t\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/joacps34ajg2ch3/Flee\u002B%28basic%29.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/joacps34ajg2ch3/Flee\u002B%28basic%29.zip\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-26T03:44:19Z\u0022 title=\u002208/26/2014 03:44  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 26, 2014\u003C/time\u003E by RuBisCO\u003C/strong\u003E\n\u003C/span\u003E\n"}]}