{"TopicId":82685,"ForumId":21,"TopicTitle":"QUADRUPED MK5 - Large all-terrain four-legged walking robot","CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-08-24T04:18:25Z","PageNum":1,"Articles":[{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-08-24T04:18:25Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/4XcX90KaLbU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003ERequired mods:\u003C/strong\u003E\u003Cbr\u003E\u003Cbr\u003EInfernal Robotics\u003Cbr\u003ETweakScale\u003Cbr\u003EMechJeb\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EAlso required:\u003C/strong\u003E\u003Cbr\u003E\u003Cbr\u003EAutoHotkey - get it here: \u003Ca href=\u0022http://www.autohotkey.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.autohotkey.com/\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003ECraft file \u002B script:\u003C/strong\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://www.dropbox.com/s/o9lx83ek0qh0ogx/QUADRUPED%20MK5.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/o9lx83ek0qh0ogx/QUADRUPED%20MK5.craft?dl=0\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://www.dropbox.com/s/d6tpeym32vjrihl/%21WALKER%20-%20QUADRUPED%20MK5.ahk?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/d6tpeym32vjrihl/%21WALKER%20-%20QUADRUPED%20MK5.ahk?dl=0\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EHow to use:\u003C/strong\u003E\u003Cbr\u003E\u003Cbr\u003E-install all required mods and utilities\u003Cbr\u003E\u003Cbr\u003E-place craft file in you SPH folder\u003Cbr\u003E\u003Cbr\u003E-place the script file in any convenient location. I keep mine in the main KSP directory\u003Cbr\u003E\u003Cbr\u003E-start up KSP and load the \u0022QUADRUPED MK5\u0022 craft\u003Cbr\u003E\u003Cbr\u003E-switch back to windows and activate the script by right-clicking and selecting \u0022open with autohotkey\u0022\u003Cbr\u003E\u003Cbr\u003E-go back to ksp and launch the craft\u003Cbr\u003E\u003Cbr\u003E-once you are on the runway right click the probe core behind the crew compartment and select \u0022control from here\u0022\u003Cbr\u003E\u003Cbr\u003E-open the mechjeb panel and select the \u0022attitude adjustment\u0022 panel. select the \u0022use stock SAS\u0022 option\u003Cbr\u003E\u003Cbr\u003E-open the \u0022smart A.S.S.\u0022 panel and activate the \u0022RAD\u002B\u0022 button. this will make mechjeb use the craft\u0027s torque to keep the probe core pointing directly up at all times.\u003Cbr\u003E\u003Cbr\u003E-open the IR control panel and change the servo speeds for groups FL/FR/RL/RR. set the speed to \u00226\u0022\u003Cbr\u003E\u003Cbr\u003E-activate action group \u00220\u0022 to center the legs\u003Cbr\u003E\u003Cbr\u003E-craft is now fully operational and ready for use!\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EControls:\u003C/strong\u003E\u003Cbr\u003E\u003Cbr\u003E\u0022/\u0022 - activates the slow walking gait that moves one leg at a time\u003Cbr\u003E\u003Cbr\u003E\u0022\\\u0022 - activates the medium speed walking gait that moves two legs at a time. \u003Cbr\u003E\u003Cbr\u003E\u0022j\u0022 and \u0022l\u0022 - steering\u003Cbr\u003E\u003Cbr\u003E\u0022i\u0022 and \u0022k\u0022 - leans the craft forward and backward for regulating speed and climbing hills. use \u0022i\u0022 to lean forward a little to begin walking forward, and when climbing up. use \u0022k\u0022 to lean back to slow down and while climbing down hills. use action group \u00229\u0022 to quickly center these servos (don\u0027t forget to turn it off, or else you will just pace in one spot)\u003Cbr\u003E\u003Cbr\u003E\u0022;\u0022 and \u0022 \u0027 \u0022 - these rotate the crew cabin around to give the pilot a better view\u003Cbr\u003E\u003Cbr\u003E\u0022h\u0022 and \u0022n\u0022 - these tilt the crew cabin up and down to give the pilot a better view\u003Cbr\u003E\u003Cbr\u003Eaction group \u00220\u0022 - centers the leg servos automatically. must be activated at all times, except when crouching the vehicle down for embarking/disembarking\u003Cbr\u003E\u003Cbr\u003Eaction group \u00229\u0022 - centers the fore/aft balancing servos, so that its neither leaning forward or backward. this useful for moving from a steep slope area to a relatively flat area. don\u0027t just keep this on constantly, activate it until craft is balanced, then right away deactivate.\u003Cbr\u003E\u003Cbr\u003Eaction groups \u00221\u0022-\u00228\u0022 - these are not actually action groups, but IR hotkeys. these work the legs individually. these are not used during regular operation because the script does all the work pressing all the buttons at the right time. the only time these are use manually is during startup to make sure the servos are centering automatically, and when crouching down to embark/disembark.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-24T19:48:48Z\u0022 title=\u002208/24/2014 07:48  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 24, 2014\u003C/time\u003E by Parallax\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MeticulousMitch","CreatedById":34869,"CreatedDateTime":"2014-08-24T04:57:10Z","Content":"\n\u003Cp\u003EI think you\u0027ve just one-upped Boston Dynamics and created the freakiest-looking robot ever. And that music... D:\u003C/p\u003E\n"},{"CreatedByName":"VR_Dev","CreatedById":92196,"CreatedDateTime":"2014-08-24T19:11:12Z","Content":"\n\u003Cp\u003EMan I have even more respect for these things now. I\u0027m all done with the gundam, it\u0027s just tuning the IR for walking. Tweak one thing, test it out, does that work better or worse? Who knows? Repeat\u003C/p\u003E\u003Cp\u003EThis stuff must be incredibly difficult to fine tune\u003C/p\u003E\n"},{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-08-24T20:25:28Z","Content":"\n\u003Cp\u003EThis one wasn\u0027t too bad, took about two afternoons to get it working. I recorded the build, maybe later i\u0027ll put together a timelapse video.\u003C/p\u003E\n"}]}