{"TopicId":82696,"ForumId":16,"TopicTitle":"Am I designing myself into a dead end?","CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-08-24T07:58:59Z","PageNum":1,"Articles":[{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-08-24T07:58:59Z","Content":"\n\u003Cp\u003EI need help in building something. First, what am I trying to do? I\u0027m trying to build a big space station. I don\u0027t want it to be all wobbly when I try and reposition it so I don\u0027t want it to be one long tube (or even a simple cross of long tubes). (And which also helps with the problem of not being able to click on stuff near ends since they are so small when the whole ship is in picture). So I figured I would stack tubes next to each other. \u003C/p\u003E\u003Cp\u003EI orbited this...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gYruhi9.png\u0022 alt=\u0022gYruhi9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow I need to use the side facing docking ports to attach to the next tube (a fuel module). (Using two attachment points for rigidity). I figured I could stick matching clamp-o-trons on the ports, and then put the fuel tank on the Clamp-o-trons. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SCyPMM5.png\u0022 alt=\u0022SCyPMM5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut apparently this doesn\u0027t work. The fuel tank won\u0027t attach!\u003C/p\u003E\u003Cp\u003EAny help?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-04T00:03:18Z\u0022 title=\u002209/04/2014 12:03  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 4, 2014\u003C/time\u003E by davidpsummers\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"M4ck","CreatedById":74138,"CreatedDateTime":"2014-08-24T08:27:37Z","Content":"\n\u003Cp\u003EIt is pretty much impossible to do what you want here. With Editor Extensions and SelectRoot you can do some interesting things like placing stuff radially when it is not possible by default, changing the root part to allow unusual symmetry and placement, but the vessel structure in KSP follows a tree-like system. No loops are allowed, each part has its parent.\u003C/p\u003E\u003Cp\u003EYou would have to do something like create a new vessel starting with the orange tank, then add two docking ports on the same vertical line(say 90*). Then place something like a tank on one port, use selectroot on that part and grab the port connected to it. The orange tank and two ports should come off, leaving the assembly with an attach node on the port. Now save it to subassemblies, open your station and select this subassembly. Place it on one of your ports, and fine tune the position of the other port so it matches the position of the port on the core.\u003C/p\u003E\u003Cp\u003ENow everything left to do is go in reverse - pick stuff up by the port, save a subassembly, create a new vessel of just one part, place the subassembly on it and selectroot the fuel tank. Now get rid of the useless part and build like usual.\u003C/p\u003E\u003Cp\u003EIf you want, I can take screenshots of the process and post them here as well.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-24T09:00:19Z","Content":"\n\u003Cp\u003E(Standard) docking port allows radial attachment so it is possible to put another tank on it as long as you rotate it appropriately (it will go through the port on standard rotation but pressing Q twice will turn it around).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/xjBkTri.jpg\u0022 alt=\u0022xjBkTri.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EHowever, what M4ck wrote is correct - you will only be able to expand it as a tree, you cannot make two tubes attached to each other via docking ports on multiple places this way.\u003C/p\u003E\u003Cp\u003EThere are other options, though. These involve placing docking ports just facing each other and letting them stick together as soon as you put the craft on launchpad. In that case, it is better to rely on axial mounting, i.e. using mount points rather than surface mounts. HubMax connector is your great friend there after you learn how to rotate them correctly to stick to the rest of the design. You must also take care that the missing connections are only between docking ports, otherwise the design will break apart.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/VDSKZ6v.jpg\u0022 alt=\u0022VDSKZ6v.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EFor everything else there are struts.\u003C/p\u003E\n"},{"CreatedByName":"M4ck","CreatedById":74138,"CreatedDateTime":"2014-08-24T10:04:06Z","Content":"\n\u003Cp\u003EWell, it is possible to attach tanks radially to docking ports, but this method only allow you to attach by the center of the tank, AFAIK.\u003C/p\u003E\u003Cp\u003EAnd for docking ports on ends of a longer module - I also like to do things the way you showed here, putting two short tanks or similar parts on ends and then radially attaching ports to them, but it will be much more difficult to find a good placement for such unconventional station core. So either rebuild the core, including a docking section similar to shown by Kashua, or eyeball the placement and check if they connect properly, before going to space with them.\u003C/p\u003E\n"},{"CreatedByName":"Jimbimbibble","CreatedById":77859,"CreatedDateTime":"2014-08-24T14:44:34Z","Content":"\n\u003Cp\u003EYou could get Kerbal Attachment System. It allows you to place/remove certain parts on EVA, one of which is a strut. You can dock it all together, then place struts between the docked parts.\u003C/p\u003E\n"},{"CreatedByName":"M4ck","CreatedById":74138,"CreatedDateTime":"2014-08-24T15:47:45Z","Content":"\n\u003Cp\u003EOr combine KAS with Quantum Struts(if you want a more stock-like look, use the strut gun part from it) - it is more rigid than the KAS strut, less visually invasive and uses one part instead of two for a working connection - pretty important on massive vessels. Problem is, it is a bit more difficult to place correctly when on EVA.\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-08-25T18:38:36Z","Content":"\n\u003Cp\u003EThanks guys.\u003C/p\u003E\u003Cp\u003EI could just build the second module with two free ports and attach it in orbit, but I don\u0027t have much confidence that I could get them the exact same distance apart on the second module as on the first. (The is why I wanted to use the first one as a \u0022template\u0022 to build the second.) I guess a second question is, if the vessel has to be a tree, would both docking ports couple when I attached them in orbit?\u003C/p\u003E\n"},{"CreatedByName":"ArcFurnace","CreatedById":109240,"CreatedDateTime":"2014-08-25T19:30:45Z","Content":"\n\u003Cp\u003EAs far as I know, multiple docking ports work just fine, so long as everything is lined up properly. I\u0027ve heard of things like using quadcouplers with docking ports on them for extra rigidity/ensuring correct rotation.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-25T21:06:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ArcFurnace\u0022 data-cite=\u0022ArcFurnace\u0022\u003E\u003Cdiv\u003EAs far as I know, multiple docking ports work just fine, so long as everything is lined up properly. I\u0027ve heard of things like using quadcouplers with docking ports on them for extra rigidity/ensuring correct rotation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn docking multiple ports at once, only one connection is \u0022primary\u0022 and serves as a connection within the ship\u0027s tree (yes, docking merges two ships to one). Engines can draw fuel through primary connection. This connection also usually puts docking ports in exactly opposing positions. Usually, but not always.\u003C/p\u003E\u003Cp\u003EOther connections are \u0022secondary\u0022 and act as if there was a strut installed. Engines can\u0027t draw fuel through them regardless of the port\u0027s crossfeed setting and they often don\u0027t fit as perfectly as the primary connection. \u003C/p\u003E\u003Cp\u003EThe mechanical strength is the same in both types, though.\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-08-29T02:23:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIn docking multiple ports at once, only one connection is \u0022primary\u0022 and serves as a connection within the ship\u0027s tree (yes, docking merges two ships to one). Engines can draw fuel through primary connection. This connection also usually puts docking ports in exactly opposing positions. Usually, but not always.\u003Cp\u003EOther connections are \u0022secondary\u0022 and act as if there was a strut installed. Engines can\u0027t draw fuel through them regardless of the port\u0027s crossfeed setting and they often don\u0027t fit as perfectly as the primary connection. \u003C/p\u003E\u003Cp\u003EThe mechanical strength is the same in both types, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, I tried the two port docking (with the same module flipped around so I didn\u0027t have to worry about spacing). It worked (not as tricky as I feared). But, as you can see, the second port didn\u0027t line up exactly....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IQwP8nL.png\u0022 alt=\u0022IQwP8nL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m dubious about my chances of doing better if I undock and try again. After all, the ports each other together the last meter or so, so it will be hard to be exact. Is the second port properly docked, in regard to the strength of the coupling, in this case?\u003C/p\u003E\n"},{"CreatedByName":"kalor","CreatedById":89282,"CreatedDateTime":"2014-08-29T02:43:36Z","Content":"\n\u003Cp\u003EI would say right click the node. if it says \u0022decouple node\u0022 you should be good!\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-08-29T02:47:02Z","Content":"\n\u003Cp\u003EYou might need this. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43208-0-24-Jul18-SelectRoot-Set-a-new-root-part-0-24-new-UI\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/43208-0-24-Jul18-SelectRoot-Set-a-new-root-part-0-24-new-UI\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo you can build everything at VAB, and later launch them 1 by 1.\u003C/p\u003E\n"},{"CreatedByName":"elloopa","CreatedById":112863,"CreatedDateTime":"2014-08-29T02:48:45Z","Content":"\n\u003Cp\u003EThat will cause issues with the more modules you have, especially if it has an actual engine on it. Worst part is, the tiny-est offset can cause uncontrollable rolling under power. My experience with modular ships (or other modular things meant to move) has given me two good solutions with radial modules:\u003C/p\u003E\u003Cp\u003E1: Have segments on the central module to allow stack docking to be parallel, this may not be terribly pretty, but it gets the job done symmetrical radial modules.\u003C/p\u003E\u003Cp\u003E2: The only other successful I\u0027ve had with this is to build a shipyard (it can be a big tube with docking ports up and down it, but a skeletal sci-fi type shipyard is good if your worried about separated modules drifting away). If you dock the modules with it and go to KSC and back, everything will be lined up pitch and yaw wise. For a station though, make the shipyard mobile so you can tone down the lag when you\u0027re done.\u003C/p\u003E\u003Cp\u003EBest I got for you.\u003C/p\u003E\n"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2014-09-04T00:02:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022elloopa\u0022 data-cite=\u0022elloopa\u0022\u003E\u003Cdiv\u003EThat will cause issues with the more modules you have, especially if it has an actual engine on it. Worst part is, the tiny-est offset can cause uncontrollable rolling under power. My experience with modular ships (or other modular things meant to move) has given me two good solutions with radial modules:\u003Cp\u003E1: Have segments on the central module to allow stack docking to be parallel, this may not be terribly pretty, but it gets the job done symmetrical radial modules.\u003C/p\u003E\u003Cp\u003E2: The only other successful I\u0027ve had with this is to build a shipyard (it can be a big tube with docking ports up and down it, but a skeletal sci-fi type shipyard is good if your worried about separated modules drifting away). If you dock the modules with it and go to KSC and back, everything will be lined up pitch and yaw wise. For a station though, make the shipyard mobile so you can tone down the lag when you\u0027re done.\u003C/p\u003E\u003Cp\u003EBest I got for you.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI worried some about this. In the end I decided if I ever need to move the station I can decouple the modules and move them separately more easily than I can make sure there aren\u0027t tiny offsets on couplings.\u003C/p\u003E\n"},{"CreatedByName":"psyper","CreatedById":90641,"CreatedDateTime":"2014-09-04T11:38:26Z","Content":"\n\u003Cp\u003EI would try this differently. I\u0027ve created ships in the past where they have tanks attached radially and then have sr docking ports at the end of them - this will then allow you to stack them on top of each other.\u003C/p\u003E\u003Cp\u003EIn your example in the first picture if you half the size of the lab stack and then place two orange tanks radially on each side using girders and struts to balance them out when launching and then add sr docking ports at the top and bottom. You can then launch two identical sections and then fit them together in orbit.\u003C/p\u003E\n"}]}