{"TopicId":82725,"ForumId":55,"TopicTitle":"COSMIC Radiation","CreatedByName":"Evilappleawsd","CreatedById":119652,"CreatedDateTime":"2014-08-24T14:32:09Z","PageNum":1,"Articles":[{"CreatedByName":"Evilappleawsd","CreatedById":119652,"CreatedDateTime":"2014-08-24T14:32:09Z","Content":"\n\u003Cp\u003ESo, i think allot of people have been suggesting this already, but i think we should have cosmic radiation to make the game have a real feel too it and to make it more fun and challenging, basically like a random timer which when hits 0, a supernova takes place, and you have to avoid the alpha, beta, and gamma particles heading in you general direction, if hit with the radiation you lose communications with the earth temporarily, and it weakens the infrastructure of the space craft, in this case i would also recommend a update where you can buy and assign different space suits the crew, with different properties such as radiation resistance, RCS fuel and e.t.c \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-24T16:20:03Z","Content":"\n\u003Cp\u003EThere is no random factor in this game. So no random timer either.\u003C/p\u003E\u003Cp\u003EThe devs want every difference in behavior to be the result of different player input.\u003C/p\u003E\n"},{"CreatedByName":"Evilappleawsd","CreatedById":119652,"CreatedDateTime":"2014-08-24T16:21:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EThere is no random factor in this game. So no random timer either.\u003Cp\u003EThe devs want every difference in behavior to be the result of different player input.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, like I mean it just randomly happens lol...\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2014-08-24T16:57:09Z","Content":"\n\u003Cp\u003EDevs said there will be nothing that is random at all in the game. They want all failures to be something a player does.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-24T17:12:59Z","Content":"\n\u003Cp\u003EIt\u0027s not like there are any dangerous supernovae around Earth as well. Solar flares are dangerous and exposure to normal levels of cosmic radiation is dangerous too but there were no dangerous events from outside our solar system for the whole cosmic era.\u003C/p\u003E\n"},{"CreatedByName":"Overjay","CreatedById":104131,"CreatedDateTime":"2014-08-24T18:02:11Z","Content":"\n\u003Cp\u003EWell, Interstellar mod provides some radiation levels in space. However, it affects only producing of waste heat by your ship. \u003C/p\u003E\u003Cp\u003EBut yeah, I like this idea!\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-08-24T18:46:36Z","Content":"\n\u003Cp\u003EA flare is not a nova, but it\u0027s a good idea.\u003C/p\u003E\u003Cp\u003EActually, cosmic radiation need not be random. It could simply be continuous, and vary a little based on location. Below Van Allen belts, it\u0027s minor. Above them, you\u0027d want more shielding. In a KSP with life support, this would simply be a requirement for missions of duration above X days, or in unprotected regions. It would make acceptable habitats more massive, is all. No need for anything random, just scale the nominal shielding masses to reflect some worst case of a flare (habitat thick enough for normal operations, with an X% mass increase for the \u0022storm shelter\u0022 included).\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-24T20:07:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Evilappleawsd\u0022 data-cite=\u0022Evilappleawsd\u0022\u003E\u003Cdiv\u003ENo, like I mean it just randomly happens lol...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat part of \u0027there is no random factor in this game\u0027 was unclear?\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-08-24T21:12:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Evilappleawsd\u0022 data-cite=\u0022Evilappleawsd\u0022\u003E\u003Cdiv\u003ESo, i think allot of people have been suggesting this already,\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, no they haven\u0027t.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E but i think we should have cosmic radiation to make the game have a real feel too it and to make it more fun and challenging,\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EHowso? I can\u0027t see how worrying about slow radiation death of your kerbals encourages \u0027fun,\u0027 especially when there\u0027s nothing in the game to prevent or mitigate it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ebasically like a random timer which when hits 0, a supernova takes place, and you have to avoid the alpha, beta, and gamma particles heading in you general direction,\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou realize that \u0027avoiding\u0027 a solar flare (I assume that\u0027s what you mean, as avoiding a supernova is akin to standing on an erupting volcano and dodging the lava) is next to impossible, right? These things are thousands of miles wide, and travel incredibly fast. By the time you see it, unless you\u0027ve got several thousand km/s of dV lying around coupled with a strong engine, you aren\u0027t able to dodge it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E if hit with the radiation you lose communications with the earth temporarily, and it weakens the infrastructure of the space craft,\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003ELose communication temporarily? Why is that even a problem? We currently have antennae that can transmit THROUGH THE SUN. A bit of radiation shouldn\u0027t harm them. As for weakening infrastructure... unrealistic, and ships are wobbly enough as it is.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ein this case i would also recommend a update where you can buy and assign different space suits the crew, with different properties such as radiation resistance, RCS fuel and e.t.c \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA separate suggestion, really, but one I\u0027d actually be in favor of; swapping a suit out for one that\u0027s better at space EVAs, but the kerbal can\u0027t walk in it. Or a planetary explorer one with no rcs, but lets them walk faster.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-08-24T21:14:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EWhat part of \u0027there is no random factor in this game\u0027 was unclear?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECosmic radiation can be \u0022random\u0022 and still be essentially isotropic and is a legitimate factor. Solar radiation is not isotropic, and the game already tracks the sun location, so it would be easy to abstract once some, even simple life support is in. Different mission regimes would require heavier habitation modules (either built-in shielding, or a \u0022storm cellar\u0022). It could be another way to force manned flight to be heavier for longer missions (life support in general would do this).\u003C/p\u003E\u003Cp\u003EI get the point about them not wanting \u0022random\u0022 stuff, even if I think they miss good gameplay options as a result. Note that in the case of things like flares, nominal craft can be assumed to be survivable vs that in low orbit, certainly, and any later requirements for life support can simply subsume any costs (mass) for shielding.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-24T21:39:48Z","Content":"\n\u003Cp\u003EReentry damage, life support, radiation hazards, solar flares, all these features have just one effect on the game: you need to carry more mass wherever you\u0027re going. \u003C/p\u003E\u003Cp\u003EReentry damage? You need to carry reentry shields.\u003C/p\u003E\u003Cp\u003ELife support? You need to carry food/water and tanks for waste.\u003C/p\u003E\u003Cp\u003ERadiation hazads, solar flares? You need to carry some radiation shielding.\u003C/p\u003E\u003Cp\u003EI don\u0027t see any extra thrill in need to carefully calculate how much of this extra mass do I need to pack for each particular trip or that I need to calculate trip itinerary precisely in advance and must stick to it without mistakes to prevent my Kerbals dying. I\u0027m perfectly happy with guessing how much fuel will I use and these extra steps are not any more interesting than that. They only make the ship bigger exponentially, as for each piece of hardware I need to bring there and back I need sufficient fuel to send it there and back.\u003C/p\u003E\u003Cp\u003EPersonally I have no problems pretending that Kerbals have all technology shielded sufficiently against reentry heat and radiation hazards, and have plenty of life support supplies in their pods and EVA suits.\u003C/p\u003E\u003Cp\u003EParticularly to random radiation hazards - if such situation occurs, what can you do? Either you just lost crew of all ships you had en route to somewhere, or you just at some random time suddenly need to do something with each of your 50 ships in free space so they\u0027re \u0022protected\u0022, and then again when the alarm ends to put them back to their \u0022production\u0022 state. That\u0027s not my idea of fun, especially if it was to happen several times during my ship\u0027s trip to Eeloo.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-08-25T01:48:05Z","Content":"\n\u003Cp\u003EThat\u0027s why I suggest just the normal background of cosmic rays and solar protons.\u003C/p\u003E\u003Cp\u003EBringing more mass IS interesting. It means that you would have to construct ships in space. Launching insane, un-aerodynamic glop from the ground to the distant solar system is not nearly as interesting as having to construct a serious interplanetary craft in orbit. Mass, more mass, for missions creates the need for LKO stations, and complex systems of spacefaring other than make a ship half a klick wide with girders and stuff all over to get your sky crane lander to the other side of the system. Meh. \u003C/p\u003E\u003Cp\u003ESo it\u0027s interesting, and creates reasons to do stuff. It\u0027s like satellites, they \u003Cem\u003Eshould\u003C/em\u003E be useful. Ditto stations. For a career game, you want challenges and problems to solve. If people don\u0027t want that, they can play sandbox.\u003C/p\u003E\n"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2014-08-25T02:00:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EFor a career game, you want challenges and problems to solve. If people don\u0027t want that, they can play sandbox.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow does sandbox mode make anyone exempt from being forced to carry additional mass?\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-08-25T04:20:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tery215\u0022 data-cite=\u0022Tery215\u0022\u003E\u003Cdiv\u003EHow does sandbox mode make anyone exempt from being forced to carry additional mass?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re right, it doesn\u0027t.\u003C/p\u003E\u003Cp\u003EThey could have those as difficulty settings, I suppose. Turn it on in a career, and make it easy for just messing around. Again, I\u0027m not for this in particular, just the choice of lightweight crew compartments for some uses, and significantly heavier ones for longer duration journeys. Really long duration flights would likely be assembled in orbit.\u003C/p\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-08-25T06:57:08Z","Content":"\n\u003Cp\u003EIs a nice idea but... don\u0027t you guys think we have enough stuff to worried !?!?!??!?! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-25T13:45:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EThat\u0027s why I suggest just the normal background of cosmic rays and solar protons.\u003Cp\u003EBringing more mass IS interesting. It means that you would have to construct ships in space. Launching insane, un-aerodynamic glop from the ground to the distant solar system is not nearly as interesting as having to construct a serious interplanetary craft in orbit. Mass, more mass, for missions creates the need for LKO stations, and complex systems of spacefaring other than make a ship half a klick wide with girders and stuff all over to get your sky crane lander to the other side of the system. Meh. \u003C/p\u003E\u003Cp\u003ESo it\u0027s interesting, and creates reasons to do stuff. It\u0027s like satellites, they \u003Cem\u003Eshould\u003C/em\u003E be useful. Ditto stations. For a career game, you want challenges and problems to solve. If people don\u0027t want that, they can play sandbox.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo it\u0027s not, it\u0027s tedious.\u003C/p\u003E\u003Cp\u003EBut if you really want, just mod it in. TAC life support and Deadly Reentry both force you to carry extra stuf around.\u003C/p\u003E\u003Cp\u003EKnock yourself out. Just don\u0027t force the rest of us to do the same thing (which would be the result if it were stock)\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-08-25T14:27:09Z","Content":"\n\u003Cp\u003EDoing the same stuff over and over is tedious. Building a station \u0022just because\u0022 is fun, but you can do that in sandbox. Other than a contract, there is no reason to build a station in a career game. No reason to assemble anything in orbit. A more realistic reentry is likely a given, we are at version 0.24 out of a nominal 1.0, and the atmosphere is explicitly a placeholder, right? Once that is fixed, even a little, many ships that work now won\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-25T14:41:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EOther than a contract, there is no reason to build a station in a career game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIMO there is - especially in career. The cheapest way to get things to orbit is via a jet-powered SSTO. But you can only lift so much using them so if you\u0027re preparing large interplanetary ship, you need orbital construction/refueling. A station is ideal construction base as you can keep the crew and all fuels in it. With it you can e.g. lift parts without fuel and fill them up in orbit.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-25T14:45:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EDoing the same stuff over and over is tedious. Building a station \u0022just because\u0022 is fun, but you can do that in sandbox. Other than a contract, there is no reason to build a station in a career game. No reason to assemble anything in orbit. A more realistic reentry is likely a given, we are at version 0.24 out of a nominal 1.0, and the atmosphere is explicitly a placeholder, right? Once that is fixed, even a little, many ships that work now won\u0027t.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, we are not at .24 out of nominal 1.0. Those numbers are version numbers, not decimals.\u003C/p\u003E\u003Cp\u003EThe number before the dot is the release version (0 in our case, since the game isn\u0027t done yet), and the number after the dot is the version number. So .24 means the game is not yet released, and version 24. If they deceided the game was done tomorow, we\u0027d go from .24 to 1.0.\u003C/p\u003E\u003Cp\u003EIn fact, Squad has already said the game is nearing feature complete\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-25T15:58:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003ENo, we are not at .24 out of nominal 1.0. Those numbers are version numbers, not decimals.\u003Cp\u003EThe number before the dot is the release version (0 in our case, since the game isn\u0027t done yet), and the number after the dot is the version number. So .24 means the game is not yet released, and version 24. If they deceided the game was done tomorow, we\u0027d go from .24 to 1.0.\u003C/p\u003E\u003Cp\u003EIn fact, Squad has already said the game is nearing feature complete\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey should make the next version 0.99 just to mess with people. Then the next release would be 0.100. Trolololol!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThere are reasons I am not consulted about version numbers.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-08-25T18:29:35Z","Content":"\n\u003Cp\u003EYeah, switching from whatever dot-version to 1.0 is the norm. None the less, we are still where they are talking in terms of sub-1.0 version releases, and everything I have read on here suggests that the atmosphere is a placeholder---or am I wrong, and the soup is it, and aerodynamics for spacecraft will never matter on Kerbin?\u003C/p\u003E\u003Cp\u003ECosmic and solar radiation are in fact a principal reason for mines to be useful, should anyone ever want to see stock use of resources. Shielding is expensive to lift from planet side, but less expensive to lift from the moon (erm, Mun) or Minmus. What you\u0027d really want from those worlds in terms of mining would be fuel, and regolith for shielding. The O\u0027Neil colony ideas all have a few meters of regolith shielding, as do modern ideas for lunar bases (both from the radiation and micrometeorite standpoints). Some people like to \u0022decorate\u0022 things to look cool/ralistic, I\u0027d simply prefer them to need to be that way \u0026lt;shrug\u0026gt;. It\u0027s like taking hitchhiker modules to make the craft more realistic. Others like their ships to be a tardis, I guess.\u003C/p\u003E\u003Cp\u003EYes, mods will take care of all this, but as I have just started playing, and version changes break mods/saves/careers in many cases, I\u0027m sticking to vanilla for a while (though I\u0027ll be modding mine within a month, I imagine, as I get bored). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-08-26T09:45:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EReentry damage, life support, radiation hazards, solar flares, all these features have just one effect on the game: you need to carry more mass wherever you\u0027re going. \u003Cp\u003EReentry damage? You need to carry reentry shields.\u003C/p\u003E\u003Cp\u003ELife support? You need to carry food/water and tanks for waste.\u003C/p\u003E\u003Cp\u003ERadiation hazads, solar flares? You need to carry some radiation shielding.\u003C/p\u003E\u003Cp\u003EI don\u0027t see any extra thrill in need to carefully calculate how much of this extra mass do I need to pack for each particular trip or that I need to calculate trip itinerary precisely in advance and must stick to it without mistakes to prevent my Kerbals dying. I\u0027m perfectly happy with guessing how much fuel will I use and these extra steps are not any more interesting than that. They only make the ship bigger exponentially, as for each piece of hardware I need to bring there and back I need sufficient fuel to send it there and back.\u003C/p\u003E\u003Cp\u003EPersonally I have no problems pretending that Kerbals have all technology shielded sufficiently against reentry heat and radiation hazards, and have plenty of life support supplies in their pods and EVA suits.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELife support, perhaps. I used to think I\u0027d play with it all the time, but I\u0027ve experimented with mods, and find it\u0027s just annoying, especially without nice read-outs that tell me how long my life support is going to last for (for me, I\u0027d still like to see it as an option for those who want it).\u003C/p\u003E\u003Cp\u003EDeadly reentry isn\u0027t just a case of slapping on a heat shield and then business as usual. It adds a load of cool design and piloting challenges. You need to minimise G-forces on reentry, make sure all of your parts are adequately shielded, and your spacecraft is going to be stable enough in the atmosphere, because if you start to tumble, you\u0027re toast. You can\u0027t just scream in straight towards the ground at orbital speed and expect to survive it like you can often get away with in stock.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-26T10:23:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EDeadly reentry isn\u0027t just a case of slapping on a heat shield and then business as usual. It adds a load of cool design and piloting challenges. You need to minimise G-forces on reentry, make sure all of your parts are adequately shielded, and your spacecraft is going to be stable enough in the atmosphere, because if you start to tumble, you\u0027re toast. You can\u0027t just scream in straight towards the ground at orbital speed and expect to survive it like you can often get away with in stock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll of that can be achieved with better aerodynamic model, even without heat damage.\u003C/p\u003E\u003Cp\u003EIn stock aerodynamics, reentry is just light shining on the ship - but in fact, each part individually is being decelerated by drag at the rate proportional to its drag coefficient (mass falls out of the equation) so if the ship is not made out of parts with vastly different drag coefficient, there are no forces applied on joints between parts. \u003C/p\u003E\u003Cp\u003EIn reality, drag only slows down parts which \u0022catch the wind\u0022 and all remaining parts are pushed towards them by their inertia. That\u0027s what makes things break. And that\u0027s what would make things break in KSP too if it had a decent drag model.\u003C/p\u003E\u003Cp\u003EPersonally I believe KSP needs better aerodynamics model much more than deadly reentry.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-08-26T10:48:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EAll of that can be achieved with better aerodynamic model, even without heat damage.\u003Cp\u003EIn stock aerodynamics, reentry is just light shining on the ship - but in fact, each part individually is being decelerated by drag at the rate proportional to its drag coefficient (mass falls out of the equation) so if the ship is not made out of parts with vastly different drag coefficient, there are no forces applied on joints between parts. \u003C/p\u003E\u003Cp\u003EIn reality, drag only slows down parts which \u0022catch the wind\u0022 and all remaining parts are pushed towards them by their inertia. That\u0027s what makes things break. And that\u0027s what would make things break in KSP too if it had a decent drag model.\u003C/p\u003E\u003Cp\u003EPersonally I believe KSP needs better aerodynamics model much more than deadly reentry.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo do I, but whoever said KSP only needed \u003Cem\u003Eone\u003C/em\u003E thing?\u003C/p\u003E\u003Cp\u003EAll I pointed out was that deadly reentry is about more than simply adding more mass to your ship.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-26T10:51:34Z","Content":"\n\u003Cp\u003EReentry heat should be part of an improved aero model IMO, it is an aerodynamic effect.\u003C/p\u003E\n"}]}