{"TopicId":82787,"ForumId":55,"TopicTitle":"Wall of feedback. I hope this is constructive.","CreatedByName":"deadalnix","CreatedById":119486,"CreatedDateTime":"2014-08-25T06:43:05Z","PageNum":1,"Articles":[{"CreatedByName":"deadalnix","CreatedById":119486,"CreatedDateTime":"2014-08-25T06:43:05Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EI\u0027ve been playing KSP quite a lot lately, and it\u0027s time to give some feedback. Hopefully, the game is awesome, and I hope I can provide something constructive. It gonne ba a big rant with a lot of critics, but ultimately, I\u0027m here and playing ! You\u0027ve done a great work, and consider these what\u0027s missing to make it aweome.\u003C/p\u003E\u003Cp\u003EFirst of all, the game is unusable on other layout than QWERTY. This is a problem as it means that the first encounter with the game for someone that is not in a QWERTY using country goes as follow:\u003C/p\u003E\u003Cp\u003E1/ WTF nothing is working.\u003C/p\u003E\u003Cp\u003E2/ OK I have to reconfigure all the controls.\u003C/p\u003E\u003Cp\u003E3/ OK I have no idea what X Y and Z stand for, so let\u0027s see what I should map them to when I need them in game.\u003C/p\u003E\u003Cp\u003E4/ Repeat every time you understand what a new control is useful for.\u003C/p\u003E\u003Cp\u003EThis is horrible user experience. But there is more, many control are not configurable and/or buggy.\u003C/p\u003E\u003Cp\u003E - You usually double click on something to put the focus on it. But sometime, you get locked on Kerbin for whatever reason (it happens a lot when having a target). The only way I found out of this is to cycle through every space object using tab until I reach my vessel back.\u003C/p\u003E\u003Cp\u003E - There is a clickable button to go IVA, but none to get out of it. That mean newcomer will get locked into IVA (it happened to me several time until I got the shortcut).\u003C/p\u003E\u003Cp\u003E - Sometime, click into the UI also result on click in game. For instance, when you build vessels, closing dialog like load will result quite often into a click on your ship, selectioning random part you have to replace the correct way.\u003C/p\u003E\u003Cp\u003E - Many control are never mentioned anywhere, like using SHIFT to orient precisely pieces when building ships.\u003C/p\u003E\u003Cp\u003EOn a side note, there is no way to get to the control in game, which means stopping the game, getting to the setting, and loading back every time you don\u0027t know what a control is.\u003C/p\u003E\u003Cp\u003EThe game have many usability issues:\u003C/p\u003E\u003Cp\u003E - It is super easy to erase saved ships by giving them the same name. The game should warn, like all editor do.\u003C/p\u003E\u003Cp\u003E - It is not possible (or haven\u0027t found how) to save part of ship as reusable component. It means redo rovers, landers and other part of ship every time. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E - Maneuver node sometime change themselves into a circle wth 2 icon on the bottom and one red cross on the top right. I have no idea whet it is useful for, ho to get back to the regular one or anything. The UI is not explained in game, and icon to small to understand what they stand for.\u003C/p\u003E\u003Cp\u003E - The caps lock key is used as default for some controls. It doesn\u0027t work the intended way on my mac.\u003C/p\u003E\u003Cp\u003EGenerally the game doesn\u0027t feel trustworthy. There is a lot of bugs, some of them not that problematic (except that it make the player feel like anything can go very wrong any time) but other quite annoying. The primary offender is obviously the game physic, as it is a key component of the game. I\u0027m a develloper and have worked with physic engines in the past, so maybe I can provide some feedback here.\u003C/p\u003E\u003Cp\u003EThe first big offender is physicless parts. Many ship parts are physicless which create some very bizarre situations. Part of ship made of too much physicless parts will spontaneously explode for instance. It is easy to a priori conglomerate physic object into biggers. Joints are the difficulty. You could easily decide that physicless parts are now jointless parts, give each of them a inertia matrix and center of mass, and combine them at ship building step. An aggregate of various jointless parts is now only one object as far as the physic engine is concerned. No more wobbly self exploding thing, and better user experience with no more CPU cycles used.\u003C/p\u003E\u003Cp\u003EThe second is the time warp. The physic engine simply goes mad with it. It look like you do the time warp by skipping step in the physic simulation. That is bad as result of the physic now depends on the time warp. I\u0027ve been able to go through planets, or experience all kind of wobbly behavior with time wrap. Space travel mean the nuber in the physic engine can get absurdly big. This mean the engine must ensure it can before skipping steps. You visibly tried to limit the problem by imposing limit on the time wrap depending on various situation, but ultimately, if you go that road, you will end upwith more and more patching around, and you will face an endless stream of issue with that.\u003C/p\u003E\u003Cp\u003EFirst of all, let\u0027s consider a craft in orbit, not accelerating. It is fairly \u0022easy\u0022 to compute it position at any time, granted you its original position, speed vector and rotation vector. Good, you can skip as much as you want. Now that craft can be in a trajectory where periapsis in atmosphere, or in the planet itself. When you warp time, you can through the planet. The physic engine must not skip step accross the periapsis in that situation. Or it become possible to go through planets. When the engine find it self in this kind of situations, it should backtrack and compute more steps for that specific objects (and eventually switch the wrap off or reduce it). It has to be noted that the physic engine do not need to backtrack all objects, simply the one concerned.\u003C/p\u003E\u003Cp\u003EThe second big side effect is quite obviously joint resolution. When you skip steps, the parts of the ship diverge more betwhen each joint resolution, and at the end, you see very bizare behaviors. It is fair to assume that this only matter in atmosphere and which very high acceleraion outside atmosphere. In which case, the game already limit at 4x the warp time, so it seems reasonable to compute physic with the same step size and render only 1/4 of the frames.\u003C/p\u003E\u003Cp\u003EHaving an engine with repeatable result is quite important for testing, but also could provide features like replays (and ultimately, that is the best form of bug report or test case you can have for the dev).\u003C/p\u003E\u003Cp\u003EThe whole things is right now patched around to limit the problem. That is fixing the symptoms, and it doesn\u0027t end up well (more and more workaround various limitations, which themselves cause other bug and so on). Especially since KSP is made for people to create their own thing and be creative, so you won\u0027t be able to plan ahead (or you\u0027ll destroy what makes this game awesome). You need a rock solid fundation.\u003C/p\u003E\u003Cp\u003ESo you can ge rid of the 2.5km limit, and finally not make my kerbal disapear in the void (robably one of the most infuriating thing that can happen in the game) !\u003C/p\u003E\u003Cp\u003EUltimately, it is nice to add new features, but the more you add, the harder it becomes to fix the basics. So please, don\u0027t burry yourself in technical debt. I\u0027ve seen so many awesome project stagnate and eventually die because of this. Please, plase, keep that in mind, I want to play this game for a long time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI see you have some very nice videos on your youtube channel. But none in game. That is kind of sad. Some video on key events, like landing on the moon/Dune/Eve, or the first time in space deserve their own video \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E You have them, use them ! They have addictive effect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launcher on mac do not work (I installed the thing with the dmg). I cannot launch the game with it, the button is gray and non clikable. I can still launch the game directly. I\u0027ll miss updates.\u003C/p\u003E\u003Cp\u003EIt is unclear to me what the reputation is useful for. If it is useful for something, then what ??? If it isn\u0027t, then why ???\u003C/p\u003E\u003Cp\u003EFinally, I\u0027d like to see more capabilities to build bases, adn why not, launch spaceship from there (well i\u0027m dreaming here, that must be a ton of work to do that). Kerbin also feel kind of empty. I\u0027d love to see cities and make the new when I crash in one of them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The same emptyness felling is everywhere. When one recover landed ships for instance. It should probably cost some money to do so (so landing in some predefined spot is now of interest !), take time and trigger some animation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (Once again, I\u0027m probably dreaming considering the amount of work involved).\u003C/p\u003E\u003Cp\u003EKeep the good work guys ! Thank you for the game !\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-25T08:52:38Z\u0022 title=\u002208/25/2014 08:52  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 25, 2014\u003C/time\u003E by diomedea\u003C/strong\u003E\n\u003Cbr\u003Edeleted snippet about thing on the WNTS list\n\u003C/span\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-08-25T09:02:57Z","Content":"\n\u003Cp\u003ELet me say, such big wall-of-text posts are not easy to go through. Most users would not read it all. But, as it is filled with interesting things, it could be worth doing. Could be better if the different ideas were made apart, structuring the text and using some formatting options.\u003C/p\u003E\u003Cp\u003EI like to start responding about the reputation thing. It is needed with the contract system introduced with version 0.24, the more reputation, the more and best contracts are made available to the player.\u003C/p\u003E\u003Cp\u003EBut, this is a new concept still to be completely developed, future KSP versions will add something more about how reputation is managed.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-25T09:35:56Z","Content":"\n\u003Cp\u003EMost of those points are valid but also long known. Common excuse is that the game is in beta and devs are concentrating more on adding content they plan for the final release than on polishing. Still, the quality of the game is increasing steadily over time.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E- Many control are never mentioned anywhere, like using SHIFT to orient precisely pieces when building ships.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Controls\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Controls\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E- It is not possible (or haven\u0027t found how) to save part of ship as reusable component. It means redo rovers, landers and other part of ship every time. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is subassemblies tab in parts list. There is a drop zone at the bottom of the tab. Build a subassembly attached to something, tear it off and drop there to create a new subassembly.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E- Maneuver node sometime change themselves into a circle wth 2 icon on the bottom and one red cross on the top right. I have no idea whet it is useful for, ho to get back to the regular one or anything. The UI is not explained in game, and icon to small to understand what they stand for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can delete the maneuver in that mode or you can add/subtract orbits to the maneuver (using the two circular buttons). You can switch the mode using right-click.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe first big offender is physicless parts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is kind of hack. The game uses Unity PhysX engine and with large part count, framerates went down. Making parts physicsless introduces weird behavior sometimes but makes the game way better playable. And it is not too hard to work around problems caused by it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe second is the time warp. The physic engine simply goes mad with it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrange things happen with physics timewarp (2x to 4x) but there are no physics with higher warp levels. Physics warp needs to be used carefully, it was added as convenience for parts of the game that take time and cannot be sped up without physics, such as reentry.\u003C/p\u003E\u003Cp\u003EGoing through planets is possible with non-physics time warp if your step is large enough that the ship appears on one side of the planet in one frame, and on the other side of the planet in the other frame. Again, hopefully this will get polished with time.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt is unclear to me what the reputation is useful for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as I know it affects quality of contracts offered to you.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EUltimately, it is nice to add new features, but the more you add, the harder it becomes to fix the basics.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EFinally, I\u0027d like to see more capabilities to build bases, adn why not, launch spaceship from there (well i\u0027m dreaming here, that must be a ton of work to do that). Kerbin also feel kind of empty. I\u0027d love to see cities and make the new when I crash in one of them The same emptyness felling is everywhere. When one recover landed ships for instance. It should probably cost some money to do so (so landing in some predefined spot is now of interest !), take time and trigger some animation (Once again, I\u0027m probably dreaming considering the amount of work involved).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you would like \u003Cem\u003Eless \u003C/em\u003Eor \u003Cem\u003Emore \u003C/em\u003Enew features to be added?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-25T10:08:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022deadalnix\u0022 data-cite=\u0022deadalnix\u0022\u003E\u003Cdiv\u003EYou usually double click on something to put the focus on it. But sometime, you get locked on Kerbin for whatever reason (it happens a lot when having a target). The only way I found out of this is to cycle through every space object using tab until I reach my vessel back.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBackspace in map mode will reset focus to the active vessel. It\u0027s documented in the controls page linked above.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-08-25T18:59:50Z","Content":"\n\u003Cp\u003EAll of these are valid points, whether or not there\u0027s a fix for them. If there is a fix, then you shouldn\u0027t be having the problems in the first place.\u003C/p\u003E\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2014-08-26T08:22:36Z","Content":"\n\u003Cp\u003EThe mentioned points about the ui are quite true. The issue with detaching parts after klicking a button in the vab is something I would like to see fixed, too. The thing about the maneuver node is something that can be fixed by left-klicking empty space, but i agree it is a little confusing at first and may need some explaination or maybe a small back button.\u003C/p\u003E\u003Cp\u003EThere are still some things that need polish, but i have been around long enough to notice that the devs are rly working hard here and have improved or fixed a ton of issues. \u003C/p\u003E\u003Cp\u003EThe time warp problem is in my opinion a lot more complicated than it appears first and i do agree that physics timewarp is a thing that is maimly used for landing on a body with atmosphere ore aerobraking and skiping the waiting part. I am not sure if it is a good idea to concentrate resources here to make it work in situation in which it isn\u0027t needed that much, considering the amount of work that it would require.\u003C/p\u003E\u003Cp\u003ESmaller issues with the non physics timewarp are something I encounter a lot more often. There are things like soi-changes resulting in quite big course changes, warping through planets or encounters with moons that aren\u0027t displayed at all. But again, considering the severe isues that have already been fixed, like ships exploding (unleash the kraken \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E), I am optimistic that those get fixed aswell over time\u003C/p\u003E\n"},{"CreatedByName":"deadalnix","CreatedById":119486,"CreatedDateTime":"2014-08-28T04:09:51Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EFirst thank you for thoses who mention workaround, or functionalities I missed. That is great they are there and I\u0027m gonna use them !\u003C/p\u003E\u003Cp\u003EThings like backspace in map mode are a real relief !\u003C/p\u003E\u003Cp\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/83982-Kasuha\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EKasuha\u003C/strong\u003E\u003C/a\u003E \u0026gt; there is physic at higher warp time. It is simply a different physic engine. Checking if you aren\u0027t going through atmosphere or planet themselves while warped seems completely reasonable. Also thank for the other points.\u003C/p\u003E\u003Cp\u003EI obviously want more features added and all the bugs fixed ! I want a whole galaxy, million of launchpads on billions of planets for intergalactic commuters. I want to land on Jool, and test my airplanes on Eve. I want it all ! I also think that the more you add stuff and the harder it is for core issues to get fixed. I\u0027m full of contradictions. I guess that makes me human.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-08-28T04:18:13Z","Content":"\n\u003Cp\u003EWell, generally speaking, the simulation at high time warp isn\u0027t really a \u003Cem\u003Ephysical\u003C/em\u003E simulation. That is, no forces are simulated. Trajectories are determined from mathematical equations, which are then used as rails of a kind. Things move, but there are no forces calculated. There are checks for things like atmo and planetary collisions, but beyond that there isn\u0027t much in the way of physics going on at high warp. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-08-28T09:21:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EThere are checks for things like atmo and planetary collisions, but beyond that there isn\u0027t much in the way of physics going on at high warp. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENevertheless at high timewarp the game\u0027s auto timewarp-factor-reduction-on-close-approach often fails so that a ship will ignore atmosphere and/or planetary surface. That\u0027s really just not right.\u003C/p\u003E\u003Cp\u003EA long time ago the auto timewarp reduction was to conservative/to careful (but failed rarely if ever), since that was changed it is to liberal and often fails.\u003C/p\u003E\n"},{"CreatedByName":"deadalnix","CreatedById":119486,"CreatedDateTime":"2014-08-29T22:07:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EWell, generally speaking, the simulation at high time warp isn\u0027t really a \u003Cem\u003Ephysical\u003C/em\u003E simulation. That is, no forces are simulated. Trajectories are determined from mathematical equations, which are then used as rails of a kind. Things move, but there are no forces calculated. There are checks for things like atmo and planetary collisions, but beyond that there isn\u0027t much in the way of physics going on at high warp. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is indeed the sane thing to do. Still you can compute ahead of time the intersection point between atmosphere and the rail, and invalidate whatever physic computation make you pass over it and step down the simulation step. Continuous collision detection is a well studied problem and not hard to do when your system is composed of one moving body with 0 force applied and an immobile collision sphere. This is pretty much the simplest case possible.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-29T22:49:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022deadalnix\u0022 data-cite=\u0022deadalnix\u0022\u003E\u003Cdiv\u003EThat is indeed the sane thing to do. Still you can compute ahead of time the intersection point between atmosphere and the rail, and invalidate whatever physic computation make you pass over it and step down the simulation step. Continuous collision detection is a well studied problem and not hard to do when your system is composed of one moving body with 0 force applied and an immobile collision sphere. This is pretty much the simplest case possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe force of gravity is applied.\u003C/p\u003E\n"},{"CreatedByName":"Trainzack","CreatedById":100807,"CreatedDateTime":"2014-08-30T03:28:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThe force of gravity is applied.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is factored into the rails, so i\u0027m pretty sure it does not count as a force in this case.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-30T10:35:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trainzack\u0022 data-cite=\u0022Trainzack\u0022\u003E\u003Cdiv\u003EThat is factored into the rails, so i\u0027m pretty sure it does not count as a force in this case.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe rails aren\u0027t valid when considering the effect of the atmosphere on the trajectory. The simulation effectively has to recalculate the rail trajectory taking drag forces into account, if it ignores the effect of gravity the calculation will be wrong.\u003C/p\u003E\n"}]}