{"TopicId":82839,"ForumId":29,"TopicTitle":"seeking equations for calculating maximum energy/fuel usage for part","CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2014-08-25T17:53:08Z","PageNum":1,"Articles":[{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2014-08-25T17:53:08Z","Content":"\n\u003Cp\u003EI am attempting to calculate, given fuel mass, ratio, atmospheric curve and anything else that may be a factor, what the maximum fuel consumption p/sec of an engine would be. I have looked around the forum and used my best google fu, but all I could come up with is calculators for getting into space and docking and such, nothing for use in building a part from scratch.\u003C/p\u003E\u003Cp\u003EDoes anyone know where I could find these equations?\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2014-08-25T18:04:38Z","Content":"\n\u003Cp\u003EUmm, fuel consumption is a flat rate calculation. According to the wiki it is ISP = ThrustInNewtons / FuelPerSec\u003C/p\u003E\u003Cp\u003ESo, for a mainsail in vacuum which has an ISP of 320 and a max thrust of 1500, at max throttle that would be 4.6875 units of fuel per second.\u003C/p\u003E\u003Cp\u003EThe issue would be what is your current ISP as you ascend? The Mainsail starts at ISP of 270 at sea level on Kerbin I believe. I\u0027m not sure on the math to adjust for the changing ISP as you climb.\u003C/p\u003E\u003Cp\u003E(Numbers from memory, but pretty sure the equation is right.)\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n"},{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2014-08-25T18:24:12Z","Content":"\n\u003Cp\u003EThank you for the reply. \u003C/p\u003E\u003Cp\u003ESo THRUST/ISP=FPS\u003C/p\u003E\u003Cp\u003EI suppose I am asking the wrong question then which would explain why I haven\u0027t been able to find anything. I need a way to calculate ISP. Right now I am just adjusting my part and my new resource and reloading the db over and over again to try and figure out how to make the part more balanced. Getting tired of doing that (and being I have four other engines to do this with) I want to figure out a way to calculate it. Especially atmospheric curve.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003EEDIT:\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E And \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Specific_impulse\u0022 rel=\u0022external nofollow\u0022\u003Efound\u003C/a\u003E. Thank you for your help. You pointed me in the right direction.\u003C/p\u003E\u003Cp\u003EWell, no that doesn\u0027t get me what I need... so close.\u003C/p\u003E\u003Cp\u003ETo figure out the ISP, you need the Fuel Consumption, which I need to know how to calculate given the information within the cfg files. All I have is the MaxThrust, Propellant Ratio, the atmosphereCurve and the propellant density.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-25T18:39:46Z\u0022 title=\u002208/25/2014 06:39  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 25, 2014\u003C/time\u003E by TheAlmightyOS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-08-25T20:29:09Z","Content":"\n\u003Cp\u003Ethrust / ISP / 9.82 (KSP uses that as g0, not 9.80665...) = fuel consumption in tons/sec (requestedmass)\u003C/p\u003E\u003Cp\u003Ethat is apportioned as follows:\u003C/p\u003E\u003Cp\u003Ecompute the mass ratio of the propellents as:\u003C/p\u003E\u003Cp\u003Etotalmass = propellant_1.density * propellant_1.ratio \u002B propellant_2.density * propellant_2.mass \u002B....\u003C/p\u003E\u003Cp\u003Ethen find multiplier as requestedmass / totalmass\u003C/p\u003E\u003Cp\u003Ethen for each propellant remove multiplier * propellant.ratio / (sum_of_all_ratios) units\u003C/p\u003E\u003Cp\u003EThe key step you\u0027re missing is the conversion between fuel flow (in tons/sec) and propellant units, and to convert you need to look at the resources\u0027 densities and at the ratios in the ModuleEngine.PROPELLANT nodes.\u003C/p\u003E\n"},{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2014-08-25T21:01:25Z","Content":"\n\u003Cp\u003EThank you for the information. I am afraid I am still no closer to figuring this out despite both of you giving me very good information.\u003C/p\u003E\u003Cp\u003EI think I am trying to edit too many things at once: the engine, generator and the resource are all being tweaked at the same time. The only constant is the max-thrust I want to achieve for this particular engine: 1000\u003C/p\u003E\u003Cp\u003EIt is compounded by the fact that the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Plasma_(physics)#Ranges_of_parameters\u0022 rel=\u0022external nofollow\u0022\u003Eresource I am trying to use\u003C/a\u003E varies wildly in density depending on how it is produced. I do not know what it should be and have been experimenting. So I am trying different densities and at the same time messing with the ratio on the engine and the generator. I want to plug it all into an excel sheet but I think even that won\u0027t help. I need to just settle on a mass for the resource then edit the engine and generator around that. \u003C/p\u003E\u003Cp\u003EThanks for all the info. It will come in handy once I figure out my resource.\u003C/p\u003E\n"}]}