{"TopicId":83122,"ForumId":55,"TopicTitle":"Remap default save menu key combination","CreatedByName":"CuAnnan","CreatedById":81022,"CreatedDateTime":"2014-08-27T23:54:44Z","PageNum":1,"Articles":[{"CreatedByName":"CuAnnan","CreatedById":81022,"CreatedDateTime":"2014-08-27T23:54:44Z","Content":"\n\u003Cp\u003EAlt F5 brings up the save menu\u003C/p\u003E\u003Cp\u003EAlt F4 shuts the game down\u003C/p\u003E\u003Cp\u003EThat\u0027s a catastrophic mistake to make. And it\u0027s one I keep doing. Because the keys are right beside each other and I have arthritic hands.\u003C/p\u003E\u003Cp\u003EPlease consider changing to Ctrl-S or some such because we seem to be currently incapable of changing it and I\u0027m getting very very frustrated with accidentally closing the game when I mean to set up a save point.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-08-28T00:15:21Z","Content":"\n\u003Cp\u003EWhile we\u0027re on save niggles:\u003C/p\u003E\u003Cp\u003EFrom the start screen, I can load a persistent save, but not a quicksave. From the space centre, I can load a quicksave, but not a persistent save. Why?\u003C/p\u003E\u003Cp\u003EFor challenges and such I\u0027m routinely setting up quicksave points at key moments so that I can do repeated practice runs. Having to go via the Space Centre to load these at the start of the game is a pain. I also routinely switch between Career and Sandbox depending on whether I\u0027m designing \u0022for real\u0022 or just throwing something together for fun or as a request for someone else.\u003C/p\u003E\u003Cp\u003EIt would be very nice to be able to flick between the assorted saves from any point in the game.\u003C/p\u003E\u003Cp\u003ESwapping craft between saves without having to go out to the file menu would also be handy, BTW. This would also be good for uncluttering your VAB/SPH load menus; have one \u0022all ships\u0022 menu, plus another \u0022this save only\u0022 menu.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-28T12:05:49Z","Content":"\n\u003Cp\u003EI think that anything that has a keyboard control should be remappable. If only for laptop users and those with non-qwerty keyboards. Alt-F5 is the worst example, on most laptops there\u0027s no gap between F4 and F5 so the rage-inducing accidental quit is more of a problem.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-28T12:27:25Z","Content":"\n\u003Cp\u003EIt might help if the save functionality was on F5 (no modifiers) and the dialog opened with default \u0027quicksave.sfs\u0027 preset in the name field.\u003C/p\u003E\n"},{"CreatedByName":"Mesons","CreatedById":76697,"CreatedDateTime":"2014-08-29T00:17:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CuAnnan\u0022 data-cite=\u0022CuAnnan\u0022\u003E\u003Cdiv\u003EAlt F5 brings up the save menu\u003Cp\u003EAlt F4 shuts the game down\u003C/p\u003E\u003Cp\u003EThat\u0027s a catastrophic mistake to make. And it\u0027s one I keep doing. Because the keys are right beside each other and I have arthritic hands.\u003C/p\u003E\u003Cp\u003EPlease consider changing to Ctrl-S or some such because we seem to be currently incapable of changing it and I\u0027m getting very very frustrated with accidentally closing the game when I mean to set up a save point.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suggest doing what Linux users already have to do--remap your modifier key. In your settings.cfg file, search for (or scroll down until you see) MODIFIER_KEY. Change the following line:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Ebefore:\u003C/strong\u003E primary = LeftAlt\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eafter:\u003C/strong\u003E primary = RightShift\u003C/p\u003E\u003Cp\u003E...and use RightShift as your modifier key. It will take getting used to using in, e.g. in VAB to clone parts, making named quicksaves, but it\u0027s probably worth it to stave off that frustration. As a bonus, if you just make secondary = RightShift you can retain LeftAlt behavior as before and just remember to use RightShift\u002BF5 to avoid rage-inducing accidental key presses.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-29T00:18:36Z\u0022 title=\u002208/29/2014 12:18  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 29, 2014\u003C/time\u003E by Mesons\u003C/strong\u003E\n\u003Cbr\u003Eforgot this wasn\u0026#039;t Redmine\n\u003C/span\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-30T10:03:35Z","Content":"\n\u003Cp\u003EThey should probably just enable the save game button in ESC menu everywhere\u003C/p\u003E\n"}]}