{"TopicId":83214,"ForumId":69,"TopicTitle":"The Linux Thread!","CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-04-18T21:29:24Z","PageNum":3,"Articles":[{"CreatedByName":"skeevy","CreatedById":110477,"CreatedDateTime":"2014-10-06T16:43:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EHmmm, they still work but they go to the now-closed original Linux thread.\u003Cp\u003EOr at least they worked for me just now, does anyone else have trouble with them?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI get an insufficient permissions warning. Perhaps the old threads have permissions set in a way the only certain users or moderators can access them.\u003C/p\u003E\u003Cp\u003EI can tell ya that I\u0027ve had issues with many, many links all around the KSP forums with the same errors as those. It has happened to me on Linux (Debian Sid \u0026amp; Mint 17) with Opera, Chrome, and Firefox; on Windows (8/8.1 x64) with Opera, Chrome, and Firefox; and on Android with the native Android browser, Chrome, and Opera; I\u0027ve tried almost all of them being logged in and logged out of my account.\u003C/p\u003E\u003Cp\u003EEDIT: Took a screenshot of what I\u0027m talking about\u003C/p\u003E\u003Cp\u003EThis one is clicking the link in this line of post 5\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ELocked to a resolution/fullscreen mode and unable to change? \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/45526-problems-in-Ubuntu-with-game-launch?p=586904\u0026amp;viewfull=1#post586904\u0022 rel=\u0022external nofollow\u0022\u003E\u0026lt;\u003Cstrong\u003EClick here\u003C/strong\u003E\u0026gt;\u003C/a\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E for finding the Unity prefs file.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh5.googleusercontent.com/-rHYvPzxpVCo/VDLHSlLNqMI/AAAAAAAABl4/QL2oM3i85fI/w1541-h867-no/Screenshot%2B-%2B10062014%2B-%2B11%3A44%3A23%2BAM.png\u0022 alt=\u0022Screenshot%2B-%2B10062014%2B-%2B11%3A44%3A23%2BAM.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-06T16:48:21Z\u0022 title=\u002210/06/2014 04:48  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 6, 2014\u003C/time\u003E by skeevy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-10-07T16:07:27Z","Content":"\n\u003Cp\u003EOh I see why now, the link you gave goes to an old thread that was archived :/\u003C/p\u003E\u003Cp\u003EThe old Linux thread should not be in the archives though, I\u0027ll see about making the archives readable.\u003C/p\u003E\n"},{"CreatedByName":"MisterFister","CreatedById":85686,"CreatedDateTime":"2014-10-09T09:41:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EYou can install the latest stable AMD proprietary driver in Ubuntu 14.04 by first converting the .run file into a .deb with this command:\u003Cp\u003E Code:\u003C/p\u003E\u003Cp\u003E sudo sh amd-driver-installer-catalyst-13.12-linux-x86.x86_64.run --buildpkg Ubuntu/trusty\u003C/p\u003E\u003Cp\u003E Then install the .deb with the following:\u003C/p\u003E\u003Cp\u003E Code:\u003C/p\u003E\u003Cp\u003E sudo dpkg -i fglrx*.deb\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHello. I\u0027m new to Linux, attempting to run Xubuntu in a Win7 OracleVM. The VM portal doesn\u0027t seem to be giving me issues at this time.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure how to use the above-quoted information. I\u0027ve downloaded the .run file in question from AMD.com, and it seems appropriate to my 3x RadeonHD 4895 cards. I\u0027m currently dealing with a 640x480 peephole desktop on a 1900x1280 display, and there are buttons below my field of view that I can tab to and activate, but I cannot read them. I\u0027ve stumbled upon the command line environment, but the \u0022--buildpkg\u0022 argument seems to be rejected. In running the file from the desktop, I can get past the sudo permission challenge, but either of the two install options throws a \u0022vcdk is missing\u0022 error.\u003C/p\u003E\u003Cp\u003EI feel like this is a simple problem, but I\u0027m a Linux virgin. Can someone please help me?\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-10-09T12:18:22Z","Content":"\n\u003Cp\u003EMight be worth trying the driver from the ubuntu repos:\u003C/p\u003E\u003Cp\u003EFrom a terminal:\u003C/p\u003E\u003Cp\u003Esudo nano /etc/apt/sources.list -\u0026gt; uncomment the \u0027restricted\u0027 repos.\u003C/p\u003E\u003Cp\u003Esudo apt-get update\u003C/p\u003E\u003Cp\u003Esudo apt-get install fglrx\u003C/p\u003E\u003Cp\u003EOr do it from \u0027ubuntu software centre\u0027 silly GUI \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2014-10-09T13:05:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MisterFister\u0022 data-cite=\u0022MisterFister\u0022\u003E\u003Cdiv\u003EHello. I\u0027m new to Linux, attempting to run Xubuntu in a Win7 OracleVM. The VM portal doesn\u0027t seem to be giving me issues at this time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not so sure you can use native hardware drivers (esp. graphics) while running inside a VM. Haven\u0027t used OracleVM (Used to be VMWare) for a long time (usually use VirtualBox now), but at least in VB you use the VB drivers which come with the VirtualBox install.\u003C/p\u003E\u003Cp\u003EStill, performance for gaming may not be especially great while running inside a VM...\u003C/p\u003E\n"},{"CreatedByName":"skeevy","CreatedById":110477,"CreatedDateTime":"2014-10-09T13:42:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MisterFister\u0022 data-cite=\u0022MisterFister\u0022\u003E\u003Cdiv\u003EHello. I\u0027m new to Linux, attempting to run Xubuntu in a Win7 OracleVM. The VM portal doesn\u0027t seem to be giving me issues at this time.\u003Cp\u003EI\u0027m not sure how to use the above-quoted information. I\u0027ve downloaded the .run file in question from AMD.com, and it seems appropriate to my 3x RadeonHD 4895 cards. I\u0027m currently dealing with a 640x480 peephole desktop on a 1900x1280 display, and there are buttons below my field of view that I can tab to and activate, but I cannot read them. I\u0027ve stumbled upon the command line environment, but the \u0022--buildpkg\u0022 argument seems to be rejected. In running the file from the desktop, I can get past the sudo permission challenge, but either of the two install options throws a \u0022vcdk is missing\u0022 error.\u003C/p\u003E\u003Cp\u003EI feel like this is a simple problem, but I\u0027m a Linux virgin. Can someone please help me?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, I\u0027d like to say that I don\u0027t recommend going the VM route unless you have a 6 core or better PC with 10\u002BGB of ram. You\u0027ll have a crappy experience otherwise. With two OS\u0027s \u002B KSP at the same time, you\u0027re gonna want to run Windows on the first two cores you have with 4GB ram, Linux on the two after that with the rest of the RAM, and KSP on the two CPU cores after that. Even with that setup, you won\u0027t come anywhere near the performance of my 2008 Vista special. \u003C/p\u003E\u003Cp\u003EAnyways...3D acceleration with VM\u0027s suck. You\u0027re gonna want to go to AMD\u0027s website and get the latest 14.9 drivers for Windows...for Linux...the driver doesn\u0027t matter because it\u0027s a VM and uses the VM\u0027s driver to take Linux\u0027s GPU commands and parse them over to Windows for rendering and whatnot. In other words, simple graphics, videos, and stuff like that will work, but with games, it can be hit and miss. You really need to know your system and how to configure it to use every advantage that you have.\u003C/p\u003E\u003Cp\u003EAnd that command does work for building drivers...been using it since I\u0027ve had an AMD GPU. Also, the driver linked in the OP is literally a year old, see below for a link to the latest AMD Linux stable driver and the one I play KSP with.\u003C/p\u003E\u003Cp\u003EAnother thing...update the Linux kernel. The highest that Ubuntu 14.04/Mint 17 can use with AMD proprietary drivers is the 3.15 kernel \u003Ca href=\u0022http://kernel.ubuntu.com/~kernel-ppa/mainline/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. I have install instructions a page or two back in this thread. Even if you go the VM route, update the kernel. It might help; it helped on my Linux box to update from the 3.13 kernel that comes stock with 14.04.\u003C/p\u003E\u003Cp\u003E@sal_vager\u003C/p\u003E\u003Cp\u003ECan you update the AMD drivers in the OP to link to the latest 14.9 Stable driver. It has better performance compared to 13.10 and is designed for Ubuntu 14.04 LTS \u0026amp; Mint 17, either OS is one I\u0027d hope our Linux noobs will pick to use. And thanks for looking into regular users having read-only access to the archives.\u003C/p\u003E\u003Cp\u003ELinux Stable Driver Page -- \u003Ca href=\u0022http://support.amd.com/en-us/download/desktop?os=Linux\u002Bx86\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://support.amd.com/en-us/download/desktop?os=Linux\u002Bx86\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDirect Link to 14.9 -- \u003Ca href=\u0022http://www2.ati.com/drivers/linux/amd-catalyst-14-9-linux-x86-x86-64.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www2.ati.com/drivers/linux/amd-catalyst-14-9-linux-x86-x86-64.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd those Windows punks now have a 14.9.1 Beta driver....where\u0027s my 14.9.1 Beta Linux driver \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T13:45:34Z\u0022 title=\u002210/09/2014 01:45  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by skeevy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2014-10-09T13:56:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MisterFister\u0022 data-cite=\u0022MisterFister\u0022\u003E\u003Cdiv\u003EHello. I\u0027m new to Linux, attempting to run Xubuntu in a Win7 OracleVM. The VM portal doesn\u0027t seem to be giving me issues at this time.\u003Cp\u003EI\u0027m not sure how to use the above-quoted information. I\u0027ve downloaded the .run file in question from AMD.com, and it seems appropriate to my 3x RadeonHD 4895 cards. I\u0027m currently dealing with a 640x480 peephole desktop on a 1900x1280 display, and there are buttons below my field of view that I can tab to and activate, but I cannot read them. I\u0027ve stumbled upon the command line environment, but the \u0022--buildpkg\u0022 argument seems to be rejected. In running the file from the desktop, I can get past the sudo permission challenge, but either of the two install options throws a \u0022vcdk is missing\u0022 error.\u003C/p\u003E\u003Cp\u003EI feel like this is a simple problem, but I\u0027m a Linux virgin. Can someone please help me?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince you are using a virtual machine, you will very probably need graphics drivers for the virtual (emulated) graphics card, not for your real GPUs, just as Micha said.\u003C/p\u003E\u003Cp\u003EAlso, on most Linux distributions the (strongly!) recommended way to get software is through the official repositories (if the software you are looking for is available there, of course). The main advantage is, that the systems Update Manager will take care of, well, updates for every piece of software coming from the official repos. The way steve_v wrote will work, but there is a GUI setting available for this as well, that might also help you with your graphics issues:\u003C/p\u003E\u003Cp\u003ESomewhere in your System settings menu you should find an entry labelled \u0022Software Sources\u0022 or \u0022Software \u0026amp; Updates\u0022 or something similar (I don\u0027t have Xubuntu 14.04 or 14.10 installed anywhere, so I can\u0027t tell you the exact location). In that window there should be a tab called \u0022Additional Drivers\u0022 (at least on Ubuntu 14.04). This will list all detected hardware for which proprietary drivers are available.\u003C/p\u003E\n"},{"CreatedByName":"skeevy","CreatedById":110477,"CreatedDateTime":"2014-10-09T14:14:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022soulsource\u0022 data-cite=\u0022soulsource\u0022\u003E\u003Cdiv\u003EAlso, on most Linux distributions the (strongly!) recommended way to get software is through the official repositories (if the software you are looking for is available there, of course). The main advantage is, that the systems Update Manager will take care of, well, updates for every piece of software coming from the official repos.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with that, except with graphics drivers....especially AMD ones. We don\u0027t have a PPA for new drivers like Nvidia cards have. If you have AMD on Linux and you\u0027re not running Arch, install them from AMD directly. A lot of distros are just now getting around to using the 14.4 oldstable drivers or 14.6 beta, 14.04 Ubuntu currently uses the 13.10 drivers from a year ago. If you think a year old driver is worth using over the current stable driver, then by all means, use the Update Manager...\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-10-09T17:21:53Z","Content":"\n\u003Cp\u003EOh man, I tried to get KSP to work in Virtualbox, but no go, the provided gfx driver just can\u0027t do it.\u003C/p\u003E\u003Cp\u003ESupposedly it\u0027s possible to make it use your gfx card directly but the only examples I\u0027ve seen only support dx7.\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-10-09T19:26:54Z","Content":"\n\u003Cp\u003EI don\u0027t think it\u0027s been mentionned before on this thread, so just FYI: Intel\u0027s deactivated some virtualization functions with certain CPUs (the \u0022k\u0022 series : \u003Ca href=\u0022https://en.wikipedia.org/wiki/X86_virtualization#I.2FO_MMU_virtualization_.28AMD-Vi_and_VT-d.29\u0022 rel=\u0022external nofollow\u0022\u003Ewiki link\u003C/a\u003E). If you\u0027ve got one of these you\u0027re doomed to use emulated hardware. If you don\u0027t you should be able to access any peripherical (so just some tweaks to do in the VM configuration). Though, for gaming purpose, I would recommend a dual-boot instead.\u003C/p\u003E\n"},{"CreatedByName":"firegeek83","CreatedById":41843,"CreatedDateTime":"2014-10-09T23:26:32Z","Content":"\n\u003Cp\u003EBeen going over the thread and I\u0027m still stuck at the moment. I\u0027m using Linux Mint 17 XFCE (x32) and extracted KSP .25_linux to my home folder (zip file from store). Whenever I try to run the KSPx86/Launcherx86, I just receive a message for selecting the appropriate app to use. Now, I\u0027ve used Linux for quite some time now but not with games. I attempted to execute with Wine, but received a Mono error. \u003C/p\u003E\u003Cp\u003EIt appears I\u0027m missing something and am wondering if anyone here can assist me in this. My laptop can run KSP just fine when I boot to Win7 so the hardware shouldn\u0027t be an issue (AMD driver). I\u0027m looking to ultimately remove Windows, but not until I know I can run KSP on the other side.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-10-10T04:58:31Z","Content":"\n\u003Cp\u003EJust guessing here, but is your executable actually marked as executable? try (from a terminal, in the KSP directory) chmod \u002Bx ./KSP.x86, then ./KSP.x86\u003C/p\u003E\u003Cp\u003EIgnore the launcher \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, check that KSP.x86 is actually something that _can_ be executed - ldd ./KSP.x86 should output a bunch of libraries, if it just says \u0027not a dynamic executable\u0027 there\u0027s probably something wrong with your download...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T05:05:26Z\u0022 title=\u002210/10/2014 05:05  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003Cbr\u003EOops, you\u0026#039;re running 32 bit.\n\u003C/span\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-10-10T05:09:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E14.04 Ubuntu currently uses the 13.10 drivers from a year ago.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDespite being fairly old, according to the AMD site that\u0027s actually the correct driver version for RadeonHD 4xxx cards. For some unfathomable reason AMD dropped support in the later drivers.\u003C/p\u003E\u003Cp\u003EOf course, not having an AMD card myself I may be reading it wrong.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T05:25:54Z\u0022 title=\u002210/10/2014 05:25  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003Cbr\u003EAdd disclamer: not all knowing.\n\u003C/span\u003E\n"},{"CreatedByName":"skeevy","CreatedById":110477,"CreatedDateTime":"2014-10-10T14:47:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022firegeek83\u0022 data-cite=\u0022firegeek83\u0022\u003E\u003Cdiv\u003EBeen going over the thread and I\u0027m still stuck at the moment. I\u0027m using Linux Mint 17 XFCE (x32) and extracted KSP .25_linux to my home folder (zip file from store). Whenever I try to run the KSPx86/Launcherx86, I just receive a message for selecting the appropriate app to use. Now, I\u0027ve used Linux for quite some time now but not with games. I attempted to execute with Wine, but received a Mono error. \u003Cp\u003EIt appears I\u0027m missing something and am wondering if anyone here can assist me in this. My laptop can run KSP just fine when I boot to Win7 so the hardware shouldn\u0027t be an issue (AMD driver). I\u0027m looking to ultimately remove Windows, but not until I know I can run KSP on the other side.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee \u003Cstrong\u003Esteve_v\u003C/strong\u003E\u0027s post above. It\u0027s what I was gonna say. One thing I\u0027ll add is that if you can, use Mint 17 x64. Even if you don\u0027t have more than 4gb of ram, x64 is still a bit faster than x32 Linux in my experiences. Anecdotal, but on my old system with the only difference being Ubuntu 9.10 x32 and x64, 64 would consistently get a few more frames per second doing x264 encodes. Haven\u0027t bothered with 32 bit Linux ever since. XFCE and LXDE use the least amount of resources making them a bit better for gaming.\u003C/p\u003E\u003Cp\u003ESince I have Steam KSP, I don\u0027t know if the KSP Store has a checksum of the zips. If they do, check to make sure the download didn\u0027t become corrupted.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022steve_v\u0022 data-cite=\u0022steve_v\u0022\u003E\u003Cdiv\u003EDespite being fairly old, according to the AMD site that\u0027s actually the correct driver version for RadeonHD 4xxx cards. For some unfathomable reason AMD dropped support in the later drivers.\u003Cp\u003EOf course, not having an AMD card myself I may be reading it wrong.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDidn\u0027t realize we were discussing a card that old (looked it up). Just use the open source drivers. They work good enough for new cards and recommended for legacy cards. If you have a 7000 or higher, especially the new R series cards, use the proprietary drivers directly from AMD.com. If it\u0027s in between, try both.\u003C/p\u003E\u003Cp\u003EIf possible, update to a new card. The low end of the AMD R series run in the 80-150 USD range. \u003Ca href=\u0022http://www.newegg.com/Product/Product.aspx?Item=N82E16814127762\u0026amp;nm_mc=KNC-GoogleAdwords-PC\u0026amp;cm_mmc=KNC-GoogleAdwords-PC-_-pla-_-Desktop\u002BGraphics\u002BCards-_-N82E16814127762\u0026amp;gclid=Cj0KEQjwh96hBRCnsefbvZrKrpcBEiQAF7oMdITr6AVkLcT0Mebu1GPzl8MGuB6hg95LVaFe3TnnKTsaAsT-8P8HAQ\u0022 rel=\u0022external nofollow\u0022\u003EThis is the card that I have\u003C/a\u003E and I\u0027m happy with it. For $130, it allows me to play almost any game with near max settings in 1080p (not using a lot of AA). I\u0027m hoping that AMD\u0027s Carrizo APU that\u0027ll come out next year will be crossfire compatible with my GPU. Sucks that the current APU\u0027s only crossfire up to the R7 250 cards...I have a 260x...\u003C/p\u003E\n"},{"CreatedByName":"toril","CreatedById":57196,"CreatedDateTime":"2014-10-10T17:16:52Z","Content":"\n\u003Cp\u003Ehas anyone found the offsets for .25 yet I am getting a core dump/segfault when i go over 3.5 gigs or so\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-10-10T17:20:27Z","Content":"\n\u003Cp\u003EApparently we don\u0027t need them any more toril, the more recent versions of Unity fixed that issue \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"toril","CreatedById":57196,"CreatedDateTime":"2014-10-10T17:56:25Z","Content":"\n\u003Cp\u003Efor some people maybe i still seem to have the problem. Also needed them to work correctly with .24 even though it was supposedly fixed then as well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T18:04:26Z\u0022 title=\u002210/10/2014 06:04  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by toril\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"skeevy","CreatedById":110477,"CreatedDateTime":"2014-10-10T18:41:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toril\u0022 data-cite=\u0022toril\u0022\u003E\u003Cdiv\u003Efor some people maybe i still seem to have the problem. Also needed them to work correctly with .24 even though it was supposedly fixed then as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELinux version and kernel revision? \u003C/p\u003E\u003Cp\u003E I can confirm x86_64 KSP working with over 4GB ram used on Mint 17 x64 XFCE, 14.9 AMD GPU drivers, 3.15.10 Ubuntu Utopic kernel.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.zimagez.com/zimage/screenshot-10102014-013824pm.php\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://www.zimagez.com/miniature/screenshot-10102014-013824pm.php\u0022 alt=\u0022screenshot-10102014-013824pm.php\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"toril","CreatedById":57196,"CreatedDateTime":"2014-10-10T23:13:01Z","Content":"\n\u003Cp\u003Econverting mission controller textures to png fixed the problem now i have to wonder why it was only crashing about 50-60% of the time during load and why other mods truecolor and tga files weren\u0027t crashing \u003C/p\u003E\u003Cp\u003Eaddendum apparently i just got lucky with 5 loads in a row no crashing still crashes on mission controller textures odd\u003C/p\u003E\u003Cp\u003Erunning ubuntu 14.04 lts kernel revision is 3.13.0-37-generic\u003C/p\u003E\u003Cp\u003Elots of mods so wasn\u0027t going to ask for support just figured that the offsets may fix this as they did in .24\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T23:22:17Z\u0022 title=\u002210/10/2014 11:22  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by toril\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"POGtastic","CreatedById":125408,"CreatedDateTime":"2014-10-11T02:17:24Z","Content":"\n\u003Cp\u003EHi guys!\u003C/p\u003E\u003Cp\u003EI\u0027m having some difficulties with the planet rendering. This started happening after the Economic Boom Update. I\u0027ve tried reinstalling the game in Steam, running it outside Steam, starting a new game, and even trying it in other modes.\u003C/p\u003E\u003Cp\u003EHere\u0027s what the KSC looks like. Note the translucent planet around it; you can see the stars through it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/QTu1k1F.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/QTu1k1F.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe same problem occurs during flight as well. Note that I\u0027m looking through Kerbin and seeing Kerbol on the other side.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/JKDXjvk.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/JKDXjvk.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EReentry shows a white globe in the center of Kerbin:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/b2LhN8O.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/b2LhN8O.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs I go further into Kerbin\u0027s atmosphere, it changes to a strange blue globe in the center:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/xaPMuUI.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/xaPMuUI.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFinally, looking at the ground, it almost looks like water. It even has some waves.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/cLrVquX.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/cLrVquX.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EComputer specs:\u003C/p\u003E\u003Cp\u003EOS: Lubuntu 14.04\u003C/p\u003E\u003Cp\u003EProcessor: Intel i3 Sandy Bridge\u003C/p\u003E\u003Cp\u003EGraphics Card: GeForce GTX 560 Ti\u003C/p\u003E\u003Cp\u003EDriver: NVidia Binary Driver version 331.38\u003C/p\u003E\u003Cp\u003EThanks in advance!\u003C/p\u003E\n"},{"CreatedByName":"skeevy","CreatedById":110477,"CreatedDateTime":"2014-10-11T06:33:42Z","Content":"\n\u003Cp\u003E@POGtastic. Dunno. Imgur is overcapacity so the pics won\u0027t load.\u003C/p\u003E\u003Cp\u003ETo AMD GPU users, I can confirm working AA with 0.25 on Mint 17, 14.9 Driver, and an R7 260x\u003C/p\u003E\u003Cp\u003EGot it by opening amdcccle as root\u003C/p\u003E\u003Cp\u003Esetting AA to enhance application\u003C/p\u003E\u003Cp\u003Emode to msaa\u003C/p\u003E\u003Cp\u003Ealso using amdcccle override for x16 AF\u003C/p\u003E\u003Cp\u003Edidn\u0027t get a drop in fps...or the fps plugin is wrong (always says 25 fps...)\u003C/p\u003E\u003Cp\u003Ehaven\u0027t tried override on the AA and edge detect or anything over enhance with x4 AA set in game.\u003C/p\u003E\u003Cp\u003Eonly posting this because I had horrible results or none at all when using any form or combination of AA in previous KSP releases...it might be the GPU driver since I never did any testing with 0.24/0.23 with the latest driver release. I\u0027ll fire up 0.24 tomorrow and find out if it\u0027s KSP being fixed or AMD fixing the driver...\u003C/p\u003E\u003Cp\u003Eit\u0027s late...didn\u0027t plan on staying up so long but I had to try all the mods that updated today, saw some jaggies on a wing, thought why not try AA again, and no more jaggies.\u003C/p\u003E\n"},{"CreatedByName":"lukeoftheaura","CreatedById":124144,"CreatedDateTime":"2014-10-11T07:45:27Z","Content":"\n\u003Cp\u003EI get no gliches with:\u003C/p\u003E\u003Cp\u003Eubuntu 14.04 (with xubuntu-desktop)\u003C/p\u003E\u003Cp\u003Eintel core 2 quad\u003C/p\u003E\u003Cp\u003E4GB ram\u003C/p\u003E\u003Cp\u003Eand a Geforce 9600 GT graphics card.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-10-11T08:51:09Z","Content":"\n\u003Cp\u003E@ POGtastic: Any errors in your logs?\u003C/p\u003E\u003Cp\u003EIf you\u0027re sure your download is ok, check permissions in your KSP directory: \u0027find ./ ! -user [username]\u0027 (replace\u0027[username]\u0027 as appropriate)\u003C/p\u003E\u003Cp\u003ETry updating your GPU drivers; Nvidia 343.22 work just fine for me (Debian Sid). \u003Ca href=\u0022http://smxi.org/\u0022 rel=\u0022external nofollow\u0022\u003ESmxi\u003C/a\u003E may be of intrest here, esp. if you want to try the betas.\u003C/p\u003E\u003Cp\u003EAA works fine too, when set to \u0027override\u0027 with nvidia-settings.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-10-11T08:57:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022skeevy\u0022 data-cite=\u0022skeevy\u0022\u003E\u003Cdiv\u003Euse Mint 17 x64.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would agree on this one, there\u0027s pretty much no reason not to run x64 (x32 binaries will still run just fine), unless perhaps you\u0027re running with \u0026lt;2Gb RAM.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-11T09:32:28Z\u0022 title=\u002210/11/2014 09:32  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 11, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003Cbr\u003EReplying to solved problems.\n\u003C/span\u003E\n"},{"CreatedByName":"skeevy","CreatedById":110477,"CreatedDateTime":"2014-10-11T14:56:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022steve_v\u0022 data-cite=\u0022steve_v\u0022\u003E\u003Cdiv\u003E@ POGtastic: Any errors in your logs?\u003Cp\u003EIf you\u0027re sure your download is ok, check permissions in your KSP directory: \u0027find ./ ! -user [username]\u0027 (replace\u0027[username]\u0027 as appropriate)\u003C/p\u003E\u003Cp\u003ETry updating your GPU drivers; Nvidia 343.22 work just fine for me (Debian Sid). \u003Ca href=\u0022http://smxi.org/\u0022 rel=\u0022external nofollow\u0022\u003ESmxi\u003C/a\u003E may be of intrest here, esp. if you want to try the betas.\u003C/p\u003E\u003Cp\u003EAA works fine too, when set to \u0027override\u0027 with nvidia-settings.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESMXI...on Arch or Debian, hell yeah, but for Ubuntu...\u003Ca href=\u0022https://launchpad.net/~xorg-edgers/\u002Barchive/ubuntu/ppa\u0022 rel=\u0022external nofollow\u0022\u003Exorg-edgers ppa\u003C/a\u003E, at least for the Nvidia \u0026amp; Intel GPU drivers and some updated X goodness. I use it for the updated X components. The FGLRX (AMD) drivers there are old and not worth using.\u003C/p\u003E\u003Cp\u003EIf I knew a better source for AMD drivers I\u0027d post it, but, straight from AMD is the best I\u0027ve found (not counting Arch Linux...maybe Gentoo/Funtoo) and relatively easy to do (plenty of posts on the subject, a basic guide on the first page here, and I\u0027ll help if asked).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022steve_v\u0022 data-cite=\u0022steve_v\u0022\u003E\u003Cdiv\u003EI would agree on this one, there\u0027s pretty much no reason not to run x64 (x32 binaries will still run just fine), unless perhaps you\u0027re running with \u0026lt;2Gb RAM.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn my anecdotal evidence post, my system then was an Athlon x64 dual core wtih 2gb of ram. It came with Windows XP (giggity), but I quickly removed that dual booted with Win2k and Ubuntu. On a sidenote, I wish Microsoft would release a version of Windows 9 with the Win2k interface -- plain, crappy, extremely lightweight, optimized for point and click operations, and no enhanced UI like Aero or Luna, though they could take some ideas from XFCE\u0027s Window Manager Tweaks.\u003C/p\u003E\u003Cp\u003EFor those that don\u0027t know, 64 bit linux installs have the advantage of being able to use more CPU instruction sets over 32 bit linuxes...not counting those i686 x32 linux distros...which can bring improved performance, though 64bit can use more ram than the same stuff in 32bit. Steve_V is correct with that less than 2gb ram statement, though, even then, it\u0027s still worth a shot to try x64...and get moar ram...you won\u0027t do much in the way of KSP, or anything really, with under 2GB of ram regardless of CPU architecture.\u003C/p\u003E\n"}]}