{"TopicId":83271,"ForumId":44,"TopicTitle":"What would Earth be like if Theia hadn\u0026#039;t hit it?","CreatedByName":"Megalodon 720","CreatedById":108146,"CreatedDateTime":"2014-08-29T12:33:35Z","PageNum":1,"Articles":[{"CreatedByName":"Megalodon 720","CreatedById":108146,"CreatedDateTime":"2014-08-29T12:33:35Z","Content":"\n\u003Cp\u003EThe most common theory for how the moon formed states that when the earth was young a Mars-sized planet collided with it, the cores of the two planets merged and the rest of Theia was destroyed and thrown into orbit. The debris then coalesced into one or two moons. \u003C/p\u003E\u003Cp\u003EThe moon today stabilizes the Earths rotation on it\u0027s axis so what would it be like if Theia had never existed and therefore never collided with it?\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-08-29T13:16:16Z","Content":"\n\u003Cp\u003ETheia would have eventually hit us sometime. But let\u0027s ignore this. accelerate Theia to relativistic velocities in the other direction.\u003C/p\u003E\u003Cp\u003EI also prefer to call pre-Theia Earth \u0022Terra\u0022, because Earth is what we call a big chunk of rocket that has a moon and a big iron core. Terra would have never stabilized it\u0027s axis with a moon, and without an extra-hot, extra-large iron core, plate techtonics would never have formed. The earth would also be about 80% it\u0027s current size,so you\u0027d may about 80% what you do on Earth. (unless I\u0027m mistaken and the square-cube law breaks me.)\u003C/p\u003E\u003Cp\u003ELife might still develop, but evolution; especially onto land; would be slower due to a lack of tides, but they would have to deal with 4 hour days, extreme winds, and massive climate changes. This might actually make evolution faster.\u003C/p\u003E\u003Cp\u003ESmall, but dense and heavy animals may roam the surface, but the winds would be too much for animals much larger than wolf-like species to keep from flying.\u003C/p\u003E\u003Cp\u003EIntentional flight would be impossible, as the winds again provide a problem. Birds or bats would be tossed around too much to glide.\u003C/p\u003E\u003Cp\u003EA lack of a hot core could mean a lack of greenhouse gasses, because they are released by volcanoes. This would make the overall climate of terra colder.\u003C/p\u003E\u003Cp\u003EIt\u0027s also likely that there was much more water on Terra than Earth, so there might not be a lot of land anyway.\u003C/p\u003E\u003Cp\u003EIf we image somehow Theia is actually put in a stable orbit, perhaps at Terra\u0027s L3, Theia would share a similar fate as Mars. Theia would have water, but then dry up. Due to it\u0027s proximity to the sun, it would actually be warm enough for water to be liquid. It would also be hot enough to evaporate into the atmosphere.\u003C/p\u003E\u003Cp\u003EHere, Theia, Terra, and Mars share similar fates. Without a lot of gravity and without a magnetic field, they can\u0027t keep their atmospheres. Mars and Theia would be the solar system\u0027s rocky twins.\u003C/p\u003E\u003Cp\u003EVenus would be the biggest rocky planet now. It does not have a magnetic field, but it does have lots of gravity and a much thicker atmosphere to begin with. It still gets to be a hot barren wasteland.\u003C/p\u003E\u003Cp\u003EIn the end, by the time we reach 4.5 billion years, We likely get a solar system with three small dead rocks and one large boiled rock. Maybe Europa or Enceladus will still get life. They\u0027ll be able to keep life for much longer.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-08-29T15:03:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003ETheia would have eventually hit us sometime. But let\u0027s ignore this. accelerate Theia to relativistic velocities in the other direction.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell... thats one way to deal with it... another would be to presume that Earth and Theia formed as one, farther than separately followed by a collision.\u003C/p\u003E\u003Cp\u003Eor... double planet! that would be so cool.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI also prefer to call pre-Theia Earth \u0022Terra\u0022, because Earth is what we call a big chunk of rocket that has a moon and a big iron core. Terra would have never stabilized it\u0027s axis with a moon, and without an extra-hot, extra-large iron core, plate techtonics would never have formed. The earth would also be about 80% it\u0027s current size,so you\u0027d may about 80% what you do on Earth. (unless I\u0027m mistaken and the square-cube law breaks me.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E#1) If Theia was roughly 10% the mass of Earth (assuming mars mass), and the moon is just 1%, it seems Earth would have 90% of its mass, and thus 96% its radius...\u003C/p\u003E\u003Cp\u003E#2) Earth already would have had a hot core, Theia would add some KE to it to warm it up, but that whole liquifaction and disrupting of the crust and hot debris into space probably made earth lose more heat than it gained from the KE impact. As its mass was only 10% of Earths, its core adding to ours was not needed, but sure, it helps (the core is mainly kept warm by radioactive decay, mainly)\u003C/p\u003E\u003Cp\u003E#3) Unless a crust fracturing event is needed, plate techtonics would likely have already happened (noting that Mars has none, and Venus apparently had cataclysmic surface turnovers, maybe this would be needed)*\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ELife might still develop, but evolution; especially onto land; would be slower due to a lack of tides, but they would have to deal with 4 hour days, extreme winds, and massive climate changes. This might actually make evolution faster.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see how that would affect the rate of evolution. If anything, its mainly changes in selection pressure that drive evolution(not counting genetic drift). Of course, a change in one species can put a selection pressure on another.\u003C/p\u003E\u003Cp\u003EThat said, tides would start selecting for a creature that may transition to land, but the overall rate of evolution wouldn\u0027t be affected much I think (especially since out of nearly 4 billion years of life, tetrapods only evolved 400 million years ago). I think arthropods still would have colonized land about as fast... the fish may have taken longer, if the arthropods had more time... maybe they would have evolved apatations that would prevent the new tetrapods from outcompeting them...\u003C/p\u003E\u003Cp\u003EMaybe without tides, we\u0027d be a \u0022bug planet\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESmall, but dense and heavy animals may roam the surface, but the winds would be too much for animals much larger than wolf-like species to keep from flying.Intentional flight would be impossible, as the winds again provide a problem. Birds or bats would be tossed around too much to glide.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso the quote above... where do you get these extreme winds from?\u003C/p\u003E\u003Cp\u003EThe lack of a moon would result in more axial wandering, so climate changes would be less stable... but as a whole, the globe should be more or less the same, with the variation being more regional.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EA lack of a hot core could mean a lack of greenhouse gasses, because they are released by volcanoes. This would make the overall climate of terra colder.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see no reason the core wouldn\u0027t still be hot. Techtonics also plays a role in CO2 capture. Venus had plenty of greenhouse gas outgassing without a large moon.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt\u0027s also likely that there was much more water on Terra than Earth, so there might not be a lot of land anyway.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe LHB may have blown away the initial water anyway, and maybe this wouldn\u0027t have made a difference. The water we have now likely came after the LHB.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf we image somehow Theia is actually put in a stable orbit, perhaps at Terra\u0027s L3, Theia would share a similar fate as Mars. Theia would have water, but then dry up. Due to it\u0027s proximity to the sun, it would actually be warm enough for water to be liquid. It would also be hot enough to evaporate into the atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea, atmospheric escape of most volatiles, only the heavy stuff (like CO2) would remain... and even then, not much.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHere, Theia, Terra, and Mars share similar fates. Without a lot of gravity and without a magnetic field, they can\u0027t keep their atmospheres. Mars and Theia would be the solar system\u0027s rocky twins.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEarth likely would still have a magnetic field, it would have plenty of gravity.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EVenus would be the biggest rocky planet now. It does not have a magnetic field, but it does have lots of gravity and a much thicker atmosphere to begin with. It still gets to be a hot barren wasteland.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVenus is .8 Earth masses, without Theia\u0027s .1 Earth masses, Earth/Terra would be 0.9 Earth masses. Earth would still be bigger.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIn the end, by the time we reach 4.5 billion years, We likely get a solar system with three small dead rocks and one large boiled rock. Maybe Europa or Enceladus will still get life. They\u0027ll be able to keep life for much longer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think Earth would still have life, it would not be \u0022small\u0022, but bigger than your \u0022large boiled one\u0022 (Venus).\u003C/p\u003E\u003Cp\u003EWhat is this \u0022still get life\u0022 for Europa and Enceladus... that implies they have life now, which is of course, an open question (I\u0027m betting on No, but I would love to be wrong).\u003C/p\u003E\u003Cp\u003E*\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe principal difference between the two planets is the lack of evidence for plate tectonics on Venus, possibly because its crust is too strong to subduct without water to make it less viscous. This results in reduced heat loss from the planet, preventing it from cooling and providing a likely explanation for its lack of an internally generated magnetic field.[40] Instead, Venus may lose its internal heat in periodic major resurfacing events\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2014-08-31T09:03:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EI also prefer to call pre-Theia Earth \u0022Terra\u0022, because Earth is what we call a big chunk of rocket that has a moon and a big iron core. Terra would have never stabilized it\u0027s axis with a moon, and without an extra-hot, extra-large iron core, plate techtonics would never have formed. The earth would also be about 80% it\u0027s current size,so you\u0027d may about 80% what you do on Earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnother possibility is that all the mass of Terra and Theia coalesced into Earth in a less violent way. So that the Earth would be larger.\u003C/p\u003E\n"},{"CreatedByName":"Jfjsharkattack","CreatedById":230633,"CreatedDateTime":"2024-01-30T19:02:07Z","Content":"\n\u003Cp\u003E\nDepends, If Theia just stayed out of the way, earth would be smaller, weaker magnetic field, less gravity, less water, but over all it would be fine while Theia would turn into a barren rock like the Moon and Mars Mashed together.\n\u003C/p\u003E\n\u003Cp\u003E\nIf Theia ended up orbiting Earth, It would probably be a binary system and be unstable, BUT it might work out and the back and forth large objects might generate enough tidal force to make both of the objects habitable. Or Theias core still freezes and its magnetic field ends and its atmosphere and water are blasted away. Still It would be interesting to have such a large object in the sky.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2024-02-19T00:09:03Z","Content":"\n\u003Cp\u003E\nQuality necro.\n\u003C/p\u003E\n\u003Cp\u003E\n9 years - but a worthy topic.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/91917-kerikbalm/?do=hovercard\u0022 data-mentionid=\u002291917\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/91917-kerikbalm/\u0022 rel=\u0022\u0022\u003E@KerikBalm\u003C/a\u003E is the only participant I recognize.  Nostalgia much?\n\u003C/p\u003E\n"}]}