{"TopicId":83313,"ForumId":70,"TopicTitle":"Ship Vanishes","CreatedByName":"seadart","CreatedById":119961,"CreatedDateTime":"2014-08-29T21:26:23Z","PageNum":1,"Articles":[{"CreatedByName":"seadart","CreatedById":119961,"CreatedDateTime":"2014-08-29T21:26:23Z","Content":"\n\u003Cp\u003EI have built several ships, assembled in orbit, using three Rockomax Jumbo64 tanks joined by Clamp-o-tron docking ports and powered with LV-N Atomic Motors. I use these ships for manned travel to other planets. At least I want to. Although they seem to work ok for a while, at some point I switch to them and the game will seem to load slowly. The interface will display, but the ship graphic will never load with the screen staying black. I switch to the map view and the screen remains black. Occasionally, the ship (I believe it is one or more Rockomax tanks) will spontaneously explode instead. If I head back to the main KSP screen, the space center will not load but the screen will remain black. At this point I need to exit the game for it to load properly. \u003C/p\u003E\u003Cp\u003E Even if I reload the game, and reload a previous quicksave, the ship will not load and the save game seems to be corrupted. The previously selected ship could vanish from the roster and the crew listed as missing. Once all ships which were equipped with the Rockomax Jumbo64 tank vanished. Sometimes this happens as soon as I leave Kerbin orbit, other times it will last as long as to reach Jool. Usually, when the screen remains black, the altimeter remains blank, the delta-V indicator and node times read NA, as do other MechJeb windows. Once MechJeb indicated my altitude was about 5 Gigameters with an orbital period of over 5 years which seems to indicate it was teleported from Jool orbit to interstellar space. Please help me figure out how to resolve this since it prevents me from going further than Minmus.\u003C/p\u003E\u003Cp\u003E I am running the following Mods:\u003C/p\u003E\u003Cp\u003E Chatterer v0.5.9.4x86\u003C/p\u003E\u003Cp\u003E Environmental Visual Enhancements with BoulderCo Citylights and Clouds v7.3\u003C/p\u003E\u003Cp\u003E Kerbal Alarm Clock v2.7.7.0\u003C/p\u003E\u003Cp\u003E MechJeb2 v2.3.1.0 (just upgraded from v2.2.1.0)\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2014-08-29T21:48:15Z","Content":"\n\u003Cp\u003EPlease read and follow the instructions in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support\u0022 rel=\u0022external nofollow\u0022\u003Ethis sticky thread\u003C/a\u003E, paying special attention to the troubleshooting and log sections.\u003C/p\u003E\u003Cp\u003EYou won\u0027t be able to get support otherwise.\u003C/p\u003E\n"},{"CreatedByName":"Tilion","CreatedById":37391,"CreatedDateTime":"2014-08-30T16:07:08Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EWe might not be able to get support\u003C/strong\u003E - I\u0027m not sure if I\u0027m even asking for help (my pc is barely running KSP with the modicum of mods I have installed so I know things will go wrong now \u0026amp; again), but I thought I should at least try to document such weirdness seeing as it just happened to me too. Though I didn\u0027t get pictures of everything the few below should give some idea of the situation... I\u0027d be interested to know if anyone else has had similar issues and any way round them, of course.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003EThe Blankety-Blankness: a disappearing ship in KSP that takes the rest of the universe with it...\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWell, I\u0027m just coming in for a Munar circularisation burn when all a sudden, my craft is flung who knows where, all Buck Rodgers like... The views are blank, nothing visible in any camera mode, IVA (externally blank - the internals were there with similarly wonky readouts), EVA (though thankfully my sacrificial offering managed to cling to the non-existent hatch and haul himself back into the safety of the invisi-pod) or on the now-blank map. Also the navball is conspicuous by its blankness. According to the info window I\u0027m now on a Kerbol escape trajectory... I knew I was pushing my trusty ol\u0027 laptop to the limit mod-wise but it seems I\u0027ve lost an entire career now as yup, you guessed it - KSC is blank too. Restarted it a few times but that entire career (from any worthwhile point) is kaput, just loads up BLANK from quicksaves, regular saves or the main persistence save.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/FDB97\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I know there\u0027s a few out-of-date mods listed on the JSGME picture, but they\u0027re not enabled - everything I\u0027ve got active is up to date to the best of my knowledge and was working fine for several hours even though I\u0027m stuck running 32-bit with 3gb memory allocated. There were no error files as the game didn\u0027t crash and only the scene stuff was missing (couldn\u0027t check KSC\u0027s scenes as there wasn\u0027t anywhere to click to go to tracking/vab/sph etc.), buttons were present throughout and functional (albeit providing no / nonsensical info) so I could still exit out to the menus.\u003C/p\u003E\u003Cp\u003ESo, any ideas folks? Help seadart \u0026amp; I or at least, commiserate!\u003C/p\u003E\n"},{"CreatedByName":"Heimdall5008","CreatedById":114990,"CreatedDateTime":"2014-08-30T16:27:26Z","Content":"\n\u003Cp\u003EThis sounds and looks exactly as the problem I reported yesterday.\u003C/p\u003E\u003Cp\u003EI have no idea how to reproduce this error, but a workaround (for me at least) seems to be to rename the last quicksave before this black screen to persistent and then the error will possibly no longer occur. (For reproduction I tried it 5 times. Two times I got the error again, 1 time I got this error on a different craft and 2 times there was no error.)\u003C/p\u003E\n"},{"CreatedByName":"Tilion","CreatedById":37391,"CreatedDateTime":"2014-08-30T16:49:42Z","Content":"\n\u003Cp\u003EYep Heimdall, this is the same thing alright, with a few variations perhaps. Don\u0027t know why I didn\u0027t see your earlier post, but it just didn\u0027t \u0027twig\u0027 for me as being the same issue (but then I\u0027ve been particularly derpy on the forums today).\u003C/p\u003E\u003Cp\u003EAs I said at the start of my post I\u0027m not even really looking for official support on this - it\u0027s just \u0027one of those things\u0027, thankfully I wasn\u0027t desperately far into that particular playthrough so I didn\u0027t lose anything too amazing... I\u0027d likely feel rather aggrieved otherwise. I\u0027ll take another crack at the save files, renaming an old one as you suggest. The adage is to save often, backup those saves frequently and don\u0027t overstress your system I suppose. That said, I\u0027m loving KSP as much as ever and will put up with errant oddities like this while likely still stretching things to the memory limit with a plethora of mods...\u003C/p\u003E\n"},{"CreatedByName":"Heimdall5008","CreatedById":114990,"CreatedDateTime":"2014-08-30T18:09:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tilion\u0022 data-cite=\u0022Tilion\u0022\u003E\u003Cdiv\u003EAs I said at the start of my post I\u0027m not even really looking for official support on this - it\u0027s just \u0027one of those things\u0027\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESecond this, I could help me with a save game modification, but I think this issue should be solved, whoever causes this. If it is game itself, Kerbal Alarm Clock or MechJeb. I\u0027m just trying to reproduce this error on a new install without any mods and with a new save game. Also I try to reproduce the bug reliable with the current save game.\u003C/p\u003E\u003Cp\u003EAs far as I understood you, your craft was near to a SOI change? Both affected crafts on my save had a similar flight condition.\u003C/p\u003E\u003Cp\u003EDid the black screen appear instantly after a view change (from tracking station to vehicle view or from map mode to vehicle view)?\u003C/p\u003E\n"},{"CreatedByName":"Tilion","CreatedById":37391,"CreatedDateTime":"2014-08-30T18:35:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Heimdall5008\u0022 data-cite=\u0022Heimdall5008\u0022\u003E\u003Cdiv\u003EAs far as I understood you, your craft was near to a SOI change? Both affected crafts on my save had a similar flight condition.\u003Cp\u003EDid the black screen appear instantly after a view change (from tracking station to vehicle view or from map mode to vehicle view)?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d changed SOI a couple of minutes back and warped towards my next node, IIRC, yes - I\u0027d just switched back from map mode when I got \u0027blanked\u0027.\u003C/p\u003E\n"},{"CreatedByName":"seadart","CreatedById":119961,"CreatedDateTime":"2014-09-02T01:14:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tilion\u0022 data-cite=\u0022Tilion\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EWe might not be able to get support\u003C/strong\u003E - I\u0027m not sure if I\u0027m even asking for help (my pc is barely running KSP with the modicum of mods I have installed so I know things will go wrong now \u0026amp; again), but I thought I should at least try to document such weirdness seeing as it just happened to me too. Though I didn\u0027t get pictures of everything the few below should give some idea of the situation... I\u0027d be interested to know if anyone else has had similar issues and any way round them, of course.\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003EThe Blankety-Blankness: a disappearing ship in KSP that takes the rest of the universe with it...\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWell, I\u0027m just coming in for a Munar circularisation burn when all a sudden, my craft is flung who knows where, all Buck Rodgers like... The views are blank, nothing visible in any camera mode, IVA (externally blank - the internals were there with similarly wonky readouts), EVA (though thankfully my sacrificial offering managed to cling to the non-existent hatch and haul himself back into the safety of the invisi-pod) or on the now-blank map. Also the navball is conspicuous by its blankness. According to the info window I\u0027m now on a Kerbol escape trajectory... I knew I was pushing my trusty ol\u0027 laptop to the limit mod-wise but it seems I\u0027ve lost an entire career now as yup, you guessed it - KSC is blank too. Restarted it a few times but that entire career (from any worthwhile point) is kaput, just loads up BLANK from quicksaves, regular saves or the main persistence save.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/FDB97\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/FDB97\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYes, I know there\u0027s a few out-of-date mods listed on the JSGME picture, but they\u0027re not enabled - everything I\u0027ve got active is up to date to the best of my knowledge and was working fine for several hours even though I\u0027m stuck running 32-bit with 3gb memory allocated. There were no error files as the game didn\u0027t crash and only the scene stuff was missing (couldn\u0027t check KSC\u0027s scenes as there wasn\u0027t anywhere to click to go to tracking/vab/sph etc.), buttons were present throughout and functional (albeit providing no / nonsensical info) so I could still exit out to the menus.\u003C/p\u003E\u003Cp\u003ESo, any ideas folks? Help seadart \u0026amp; I or at least, commiserate!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for posting this. This looks very similar to what I\u0027m seeing. For me this only seems to happen on my interplanetary ships which are basically those large orange fuel tanks connected by docking rings and powered by atomic engines (sorry about the general names, but I can\u0027t remember them right now). I don\u0027t know if you are using a similar design or if this happens regardless of the parts you use.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-09-02T10:51:34Z","Content":"\n\u003Cp\u003EPlease read the sticky threads. You may be able to identify the (combination of) mods that cause this yourself, or at the very least we need log files to help you.\u003C/p\u003E\n"},{"CreatedByName":"Perry210174","CreatedById":120354,"CreatedDateTime":"2014-09-04T20:49:17Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003Ethe same happens to me.\u003C/p\u003E\u003Cp\u003EIt begun, after I installed Kerbal Alarm Clock. It seems to happen more often, when ships are in great distance; behind Duna on way to Dres, Jool or Eeloo. \u003C/p\u003E\u003Cp\u003EI had it at different savegames.\u003C/p\u003E\u003Cp\u003ESometimes KSP deletes these ships after restart and reload the savegame.\u003C/p\u003E\u003Cp\u003EBut before I used Kerbal Alarm Clock, I never left ships alone. I always let them the active vessel, until it reached its destination.\u003C/p\u003E\u003Cp\u003EI uploaded my log file: \u003Ca href=\u0022http://home.arcor.de/luecke_online/ksp/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://home.arcor.de/luecke_online/ksp/output_log.txt\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ESorry about my bad english.\u003C/p\u003E\n"},{"CreatedByName":"Heimdall5008","CreatedById":114990,"CreatedDateTime":"2014-09-05T19:35:56Z","Content":"\n\u003Cp\u003EAs far as I can say, the only mod that everybody here used was Kerbal Alarm Clock.\u003C/p\u003E\u003Cp\u003ESo for me this looks like the error orginiates from KAC or the main game. It would be great if someone could recreate this error with a new save game on a vanilla install. I was able to recreate it on a vanilla install but with the old save game. Although there are no ships left that were already in space when KAC was installed and I cannot find anything related to KAC in the persistent file, I cannot rule out the possibility that the mod somehow caused this problem.\u003C/p\u003E\u003Cp\u003EThe common denominator from this thread (and others with similar problems) seem to be:\u003C/p\u003E\u003Cp\u003E- KAC installed\u003C/p\u003E\u003Cp\u003E- ship in deep space (most likely near a SOI change)\u003C/p\u003E\u003Cp\u003E- switched to this craft from tracking station or another craft seconds before the black screen strikes\u003C/p\u003E\u003Cp\u003EI like also to comment that this (or any other major problems) all occured on this save game. It is my save game which I played longest, that had the most missions, the most bodies visited and the most ships (with the highest part counts).\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-05T21:11:56Z","Content":"\n\u003Cp\u003EGuessing, without logs, is neither all that useful, *nor* polite to baldly accuse a mod of wrongdoing.\u003C/p\u003E\u003Cp\u003EThe sticky \u003Cem\u003Eexists for a reason\u003C/em\u003E. Please follow it.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-09-11T10:45:05Z","Content":"\n\u003Cp\u003EI just had the same problem ...\u003C/p\u003E\u003Cp\u003EI visited the space center in order to switch to my Duna probe and, instead of getting the probe,\u003C/p\u003E\u003Cp\u003Eeverything was black (even when looking at map view) and Kerbal Engineer Redux showed NaNs instead of values.\u003C/p\u003E\u003Cp\u003EAfter returning to the space center, all of my ships and stations were gone, with only my planted flags remaining\u003C/p\u003E\u003Cp\u003E(I then tried to stop the KSP process in the hope of preventing the problems of creeping into the save file, but it was too late ... all spaceships/-stations are gone and also 3 Kerbonauts which manned a ship enroute to Mun (no, it wasnÃ‚Â´t Jeb, Bill and Bob))\u003C/p\u003E\u003Cp\u003EIn contrast to others I donÃ‚Â´t use Kerbal Alarm Clock\u003C/p\u003E\u003Cp\u003EMy mods:\u003C/p\u003E\u003Cp\u003EFAR\u003C/p\u003E\u003Cp\u003EProcedural Fairings\u003C/p\u003E\u003Cp\u003ERaster Prop Monitor\u003C/p\u003E\u003Cp\u003EKAS (Kerbal Attachment System)\u003C/p\u003E\u003Cp\u003EDeadly Reentry\u003C/p\u003E\u003Cp\u003ETAC Lifesupport\u003C/p\u003E\u003Cp\u003EAntenna Range\u003C/p\u003E\u003Cp\u003EEnvironmental Visual Enhancements\u003C/p\u003E\u003Cp\u003EKerbal Engineer Redux\u003C/p\u003E\u003Cp\u003EFinal Frontier\u003C/p\u003E\u003Cp\u003EI might add that for the probe to which I switched, it wasnÃ‚Â´t my active vessel, when it changed spheres of influence (from Kerbin to Kerbol).\u003C/p\u003E\u003Cp\u003ESo this hypothetically may be a source for errors for mods that use the SOI (the only mod that gets into my mind for which this may be the case IMHO is Antenna Range) \u003C/p\u003E\u003Cp\u003EUnfortunately I only have the output log of 2 starts after the incident which can be found here: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://en.file-upload.net/download-9512053/output_log---Kopie.txt.html\u0022 rel=\u0022external nofollow\u0022\u003Eoutput_log---Kopie.txt\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ebut maybe the version numbers of mods as well as other regular infos contained therein may be helpful\u003C/p\u003E\u003Cp\u003EAddendum:\u003C/p\u003E\u003Cp\u003EThe 3 lost Kerbals now,for some strange reasons, have reappeared (wheareas they had vanished during the first restart of KSP ... when I looked at the Astronauts Roster) ... maybe KSP did some cleaning up between the 1st and 2nd restart after the incident)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-11T11:03:06Z\u0022 title=\u002209/11/2014 11:03  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 11, 2014\u003C/time\u003E by Godot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Broax","CreatedById":109333,"CreatedDateTime":"2014-09-11T13:45:50Z","Content":"\n\u003Cp\u003EI was gonna make a new thread but this looks just pretty similar to my problem so I\u0027ll post here instead...\u003C/p\u003E\u003Cp\u003ESo, from time to time I get a similar problem. Sadly it happens with the more complex ships where I\u0027m more involved. Yesterday I tried my first Duna mission and built a huge ship for that mission. Launch was a horrible as the ship started to wobble until it broke (too tall, too slim and too heavy on the top is my guess). Anyway, I managed to launch the ship and everything was going roughly OK but then I needed to quickload on of my quicksaves and then it all happened again. This issue happen to me a couple of times before and it was when jumping to some previous quicksave. \u003C/p\u003E\u003Cp\u003EHere\u0027s the before pic:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bVklTm8.png?1\u0022 alt=\u0022bVklTm8.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd here\u0027s the after pic:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pz7Hzf6.png?1\u0022 alt=\u0022pz7Hzf6.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see this is rather sad and frustrating as it seems to happen every time I try to make something more complex and entertaining. So far I seem to be locked to basic Mun and Minmus launches as anything more difficult results in bugs and crashes... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, as you can see graphics are near the lowest settings as this computer is quite old but I also got this error on a much more powerful PC. \u003C/p\u003E\u003Cp\u003EHere\u0027s my current mod list: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MKSzIYg.jpg\u0022 alt=\u0022MKSzIYg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the save file \u0026amp; ship file (wetransfer): \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://we.tl/kLiPs5BbjZ\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://we.tl/kLiPs5BbjZ\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd here\u0027s the output log (wetransfer):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://we.tl/fCsGj8AbLs\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://we.tl/fCsGj8AbLs\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m currently playing the version 24.2/64bit Steam version of the game. My computer is an old Toshiba Satellite L500 laptop with:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOS: \u003C/strong\u003EWindows 7 Home Premium 64Bit\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERAM: \u003C/strong\u003E4Gb \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECPU:\u003C/strong\u003E Intel 2Ghz Core 2 Duo CPU \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EGPU: \u003C/strong\u003EATI Mobilty Radeon HD 4550 GPU (500Mb of VRAM)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHDD:\u003C/strong\u003E 8Gb free (250Gb total)\u003C/p\u003E\u003Cp\u003EMy guess is that this is somehow related to the 64Bit version of the game. Since this occurs in a somewhat random fashion it\u0027s hard for me to reproduce it but I\u0027m gonna make a fresh install, with as little mods as possible and try it again on the 32Bit version.\u003C/p\u003E\u003Cp\u003EAnyway, any help would be just great as this bug is super annoying and it\u0027s killing the game for me... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I can\u0027t do anything that seems fun or the game crashes in some horrible way. I don\u0027t have much time to play games and it\u0027s so frustrating when I try to play KSP (pretty much the only thing I\u0027ve been playing) these things keep happening to me... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve made this as clear as possible but if you have any questions I\u0027ll try to answer them to the best of my ability just to get this fixed.\u003C/p\u003E\u003Cp\u003ECheers! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-11T13:51:05Z\u0022 title=\u002209/11/2014 01:51  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 11, 2014\u003C/time\u003E by Broax\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Polstar","CreatedById":89598,"CreatedDateTime":"2014-10-09T21:02:48Z","Content":"\n\u003Cp\u003EI have been having this issue for a while now. I initially thought it was when jumping to a ship via Kerbal Alarm Clock, specially from the space center screen. It can also happen via the tracking station or even the map by right clicking on the ship and selecting it. \u003C/p\u003E\u003Cp\u003EIssue : Intermittent issue when swapping ships, the ship loads, the screen goes black with the exception of the altimeter and nav ball. On exiting to Space center again a black screen though the overlay appears and sounds can be heard in the background. Game has to be fully exited and re-loaded for space center to appear. The ship that was being swapped to no longer appears in the game and crew (if any) are missing. This can be any ship both large and small, with or without a kerbal on board. Usually when in space between planets. A work around of saving the game before swapping ships, then after the bug return to space center and load save game, quit game fully and reload. Ship still available. This crash may happen several times before ship loads normally.\u003C/p\u003E\u003Cp\u003EMods Installed : Mechjeb 2.3.1.0-338 ; Kerbal Alarm Clock 3.0.0.4\u003C/p\u003E\u003Cp\u003EGame Version : 0.25.0.642 x32 Windows\u003C/p\u003E\u003Cp\u003ESystem \u003Ca href=\u0022https://www.dropbox.com/s/1ee8h35t6hpzjwb/DxDiag.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EDxDiag\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/26w66hbzt3yf95t/Jool%20Explorer%20II.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EShip Craft File \u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/xpoja4d5uwgidod/persistent.sfs?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EPersistent File\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/y182y5ab1rtjgw0/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EOutput Log\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"roguelycan","CreatedById":64979,"CreatedDateTime":"2014-10-18T21:07:04Z","Content":"\n\u003Cp\u003EI had 2 ships that were having this issue, one to Jool and one to Dres, both within a year of an SOI change to both planets. If I quit immediately after and reloaded the game I got the ships back but still would have the same issue every time I tried UNTIL I removed Kerbal Alarm Clock, and only KAC, and I can now switch to both ships without an issue.\u003C/p\u003E\u003Cp\u003EEdit: BTW I was using the KAC 3.0 beta version\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-18T21:12:40Z\u0022 title=\u002210/18/2014 09:12  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 18, 2014\u003C/time\u003E by roguelycan\u003C/strong\u003E\n\u003C/span\u003E\n"}]}