{"TopicId":83329,"ForumId":44,"TopicTitle":"Broken solder joints","CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2014-08-29T23:00:24Z","PageNum":1,"Articles":[{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2014-08-29T23:00:24Z","Content":"\n\u003Cp\u003ESo for the last month and a half, the audio jack on my laptop has constantly broken its solder joints. I\u0027ve disassembled my laptop at least three times and re-soldered the joints to the board. About two weeks after doing this, the joints break again. What am I doing wrong here?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-08-29T23:18:59Z","Content":"\n\u003Cp\u003EProbably nothing: the original connection could be through hole, dip soldered or fastened in another hard to reproduce way. Solder on its own is not very resilient. One way to divert forces is to use hot glue to fixate the part and take the load as much as possible. Not a neat pretty fix, but easy and typically reliable. If done right, you should not see anything when the laptop is assembled.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-08-29T23:22:56Z","Content":"\n\u003Cp\u003EIt may not be your soldering but how much stress is being put on your audio jack or the cable going to it.\u003C/p\u003E\u003Cp\u003EIs the cable getting pulled on or is your laptop getting knocked around with the audio cable inserted into the jack?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-08-29T23:32:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EIt may not be your soldering but how much stress is being put on your audio jack or the cable going to it.\u003Cp\u003EIs the cable getting pulled on or is your laptop getting knocked around with the audio cable inserted into the jack?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is bound to happen, some laptops have a quick detaching power cable for a reason \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kermunist","CreatedById":63745,"CreatedDateTime":"2014-08-29T23:35:51Z","Content":"\n\u003Cp\u003EAs has been said, solder isn\u0027t very strong, and it might still break even if you\u0027re doing it right. That said, here\u0027s some tips on making a strong solder joint:\u003C/p\u003E\u003Cp\u003EMake sure the solder wets both parts well. It should run all over the contacts. If you only put a little solder on, it should run around and coat the contacts, not sit in a ball where you put it. If this isn\u0027t happening:\u003C/p\u003E\u003Cp\u003E- make sure both contacts are heated through (can be hard with big blocks of metal in plugs)\u003C/p\u003E\u003Cp\u003E- try cleaning the contacts first or \u003C/p\u003E\u003Cp\u003E- try using a small amount of flux to get things going. Clean any excess flux off afterwards.\u003C/p\u003E\u003Cp\u003EA harder solder would be better, but might be difficult to get hold of and need a hotter soldering iron.\u003C/p\u003E\u003Cp\u003EUnlike soldering a normal component, use loads of solder. Build up a big blob that completely covers both contacts and joins them together.\u003C/p\u003E\u003Cp\u003EThe solder joint should be shiny and bright when it\u0027s done. No stringy bits or points where you took the iron away from. If it goes dull then either:\u003C/p\u003E\u003Cp\u003E- you took a long time to make the joint or\u003C/p\u003E\u003Cp\u003E- you moved the component as the solder was cooling\u003C/p\u003E\u003Cp\u003EBut as I say, even if you do all this right, it still might not be that strong. The hot glue idea\u0027s a good one, I might use epoxy resin (because I don\u0027t have hot glue).\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-08-29T23:50:02Z","Content":"\n\u003Cp\u003EYou can also use bus wire to repair/reenforce damaged or broken solder connections.\u003C/p\u003E\u003Cp\u003EIf gluing the audio port is not an option look into some kind of cable management item that could allow you to Velcro the audio cable to your lap top in a way that it will take the strain off the port as well as a good fitting and padded lap top case.\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-08-30T00:40:09Z","Content":"\n\u003Cp\u003EThe problem isn\u0027t with the joints. The problem is most likely due to the jack moving.\u003C/p\u003E\u003Cp\u003EI\u0027ve been in the soldering industry for 17\u002B years. Some alloys are more brittle than others, and will be more prone to fracture.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-30T00:42:41Z\u0022 title=\u002208/30/2014 12:42  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 30, 2014\u003C/time\u003E by EdFred\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-08-30T06:59:43Z","Content":"\n\u003Cp\u003Eare you using old skool lead solder or the lead free stuff that manufacturers use. you might be creating a brittle alloy. the solution to this is to completely remove the part, clean the pads with some solder wick (do likewise for the part), flux and re solder.\u003C/p\u003E\u003Cp\u003Eflux is your friend. every soldering tutorial ive seen says you should be liberal with the flux. i find that they are right. flux helps remove oxidization and will ensure a solid joint.\u003C/p\u003E\u003Cp\u003Eis your iron clean? tip should be kept shinny. the best way to clean is is to add a bit of solder and remove the excess with a wet sponge. never shut it down without doing this and your tip will pretty much last forever. fail to do it once, and you will forever have a nasty tip. oxidized tip means oxidized joint and poor heat transfer.\u003C/p\u003E\u003Cp\u003Eif its a surface mount part then that is a whole other level of hell. i wouldn\u0027t even touch it without a hot air rework station. some solderers would say you can do it with any professional iron (not a radioshack fire starter, something with temperature control), but i have a reflow station and like to use the right tool for the job.\u003C/p\u003E\n"}]}