{"TopicId":83424,"ForumId":16,"TopicTitle":"What differences will I notice between .23.5 and .24.2 besides the contracts and $$$?","CreatedByName":"JebNeedsHelp","CreatedById":117002,"CreatedDateTime":"2014-08-31T02:11:40Z","PageNum":1,"Articles":[{"CreatedByName":"JebNeedsHelp","CreatedById":117002,"CreatedDateTime":"2014-08-31T02:11:40Z","Content":"\n\u003Cp\u003EI\u0027ve been holding off on upgrading because I\u0027m still not really very good at the game. Does the update make things easier, harder, or both? Anything specific I should watch out for?\u003C/p\u003E\u003Cp\u003EThanks in advance!\u003C/p\u003E\u003Cp\u003EJNH\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-31T15:03:46Z\u0022 title=\u002208/31/2014 03:03  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 31, 2014\u003C/time\u003E by JebNeedsHelp\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-31T02:24:52Z","Content":"\n\u003Cp\u003EWell the .23.5-style career has been preserved as \u0022Science\u0022 mode.\u003C/p\u003E\u003Cp\u003EI believe .24 changed a few part figures, mainly buffs for things like the Mainsail.\u003C/p\u003E\u003Cp\u003EThe biggest impact apart from career mechanics is probably mod compatibility. Most mods will be developed for .24 now, but there might be some that aren\u0027t compatible.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-08-31T02:32:43Z","Content":"\n\u003Cp\u003EMore easier than harder. While money is potentially an issue, it\u0027s quite possible to never run into limits with it. Contracts in career mode also give more opportunities to acquire science, making the tech tree easier to complete. Science and sandbox modes have no changes (beyond the general ones, see below) from 0.23.5.\u003C/p\u003E\u003Cp\u003EThe general changes to the game as a rule make things easier. Aside from the LFB, all of the engine changes were buffs, so your favorite design(s) will perform bit better. The new O-10 and Vernor can only provide more options. The tech tree itself has seen minor reorganization. Most of the nodes requiring 2 prerequisites now only needing 1, and total science requirement to unlock slightly lowered.\u003C/p\u003E\u003Cp\u003EBest of all, it\u0027s now possible to get roll control with gimbaling engines!\u003C/p\u003E\n"},{"CreatedByName":"Zylark","CreatedById":101018,"CreatedDateTime":"2014-08-31T02:36:02Z","Content":"\n\u003Cp\u003EWell, keeping a profit can be a bit of a challenge, and the various contracts can be a nice distraction from your grand plan of conquering the known universe. Having budgetary constraints doesn\u0027t make things easier per-se, but it doesn\u0027t really make things harder either. It does make going through a career more interesting on the other hand.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-08-31T02:39:42Z","Content":"\n\u003Cp\u003EAs above: there\u0027s no good reason not to jump straight to 24.2.\u003C/p\u003E\u003Cp\u003EAccidentally detonating a few dozen rockets on the launchpad doesn\u0027t mean that you\u0027re bad at KSP, it just means that you\u0027re experiencing the traditional entertainments of an early-stage Kerbonaut. Enjoy it while it lasts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"General Rarity","CreatedById":67829,"CreatedDateTime":"2014-08-31T05:12:27Z","Content":"\n\u003Cp\u003EWhat everyone seems to forget about is the SAS balance in .24... the 2.5m reaction wheel now weighs more and has 30 torque while it used to have 20 and weighed as much as the 1.25m reaction wheels. The old ASAS (yellow stripes and whiteish) reaction wheel now weighs less and has more torque than the old SAS (brownish) reaction wheel, but costs more. A much needed balance was finally made. Correct me if i\u0027m wrong... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-08-31T07:50:50Z","Content":"\n\u003Cp\u003ESAS makes a bit more sense now, and\u003C/p\u003E\u003Cp\u003E***gimballed engines can contribute to rotation***\u003C/p\u003E\u003Cp\u003Enot just yaw and pitch as in previous versions.\u003C/p\u003E\u003Cp\u003EAlso some significant improvements in the deeper guts of the fizzics engine.\u003C/p\u003E\u003Cp\u003ESOI transitions at higher timewarp tend to generate less error, \u003C/p\u003E\u003Cp\u003EA general anti-Kraken spray has been used on almost all actions and components, \u003C/p\u003E\u003Cp\u003Eetc...\u003C/p\u003E\u003Cp\u003EThe rest is really just small tweaks, plus the whole contact thingy.\u003C/p\u003E\n"},{"CreatedByName":"JebNeedsHelp","CreatedById":117002,"CreatedDateTime":"2014-08-31T15:05:12Z","Content":"\n\u003Cp\u003EThanks, everyone. Gives me an idea of what to expect.\u003C/p\u003E\n"}]}