{"TopicId":83515,"ForumId":16,"TopicTitle":"Space Plane air intakes not taking in full amount","CreatedByName":"acchilde","CreatedById":120114,"CreatedDateTime":"2014-09-01T05:07:51Z","PageNum":1,"Articles":[{"CreatedByName":"acchilde","CreatedById":120114,"CreatedDateTime":"2014-09-01T05:07:51Z","Content":"\n\u003Cp\u003EWhy don\u0027t my air intakes take in their full amount? They seem to only intake 1/2 of their max.\u003C/p\u003E\u003Cp\u003EFor example, in the picture below, you can see that I have 4 air intakes. According to my side panel, I should be getting an intake of 4.8, but I\u0027m only getting roughly 1/4 of that. \u003C/p\u003E\u003Cp\u003ECan anyone explain why air intakes do this?\u003C/p\u003E\u003Cp\u003E(It seems to do this on all air intakes, including stock)\u003C/p\u003E\u003Cp\u003EAlso, Putting the air intakes on the bottom doesn\u0027t help.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8kPemvk.jpg\u0022 alt=\u00228kPemvk.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/DZPXDrg.jpg\u0022 alt=\u0022DZPXDrg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-01T06:52:39Z\u0022 title=\u002209/01/2014 06:52  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 1, 2014\u003C/time\u003E by acchilde\u003C/strong\u003E\n\u003Cbr\u003EMore Information\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-09-01T05:22:58Z","Content":"\n\u003Cp\u003EIt\u0027s because they are not directly into the air flow. Because you have a positive AoA (Angle of Attack) and your intakes are on the top of your aircraft it is being blocked by the air frame. If you put them on the bottom they would be able to take in more air.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-09-01T05:23:31Z","Content":"\n\u003Cp\u003EThe intake air gauge measures air stored at a given point in a single frame, rather than the amount taken in. I would suggest right clicking on the intakes and/or engines for additional info.\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003EIt\u0027s because they are not directly into the air flow. Because you have a positive AoA (Angle of Attack) and your intakes are on the top of your aircraft it is being blocked by the air frame. If you put them on the bottom they would be able to take in more air.\u003C/div\u003E\u003C/blockquote\u003EI\u0027m pretty sure that you can\u0027t block intakes with stock aerodynamics, and I don\u0027t see any FAR instrumentation.\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-01T05:28:46Z","Content":"\n\u003Cp\u003EAgreed with both of the above. Realistic aero means that placement and angle of attack affect intake function; stock aero means that realism hides under the table weeping.\u003C/p\u003E\u003Cp\u003EAnd, as usual: give FAR/NEAR a try. Aircraft are much more fun when they fly instead of swim.\u003C/p\u003E\n"},{"CreatedByName":"acchilde","CreatedById":120114,"CreatedDateTime":"2014-09-01T05:31:11Z","Content":"\n\u003Cp\u003EPutting them on the bottom didn\u0027t work either. Here\u0027s a more detailed screenshot.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8kPemvk.jpg\u0022 alt=\u00228kPemvk.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"acchilde","CreatedById":120114,"CreatedDateTime":"2014-09-01T05:37:06Z","Content":"\n\u003Cp\u003EPutting them on the bottom didn\u0027t help. And I right-clicked the part to show you that it doesn\u0027t intake its full potential.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8kPemvk.jpg\u0022 alt=\u00228kPemvk.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2014-09-01T06:07:52Z","Content":"\n\u003Cp\u003ETwo reasons:\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EYou\u0027re not moving through the air. Air intakes collect more air the faster you\u0027re moving. You\u0027ll note that your \u0022flying\u0022 screenshot has your air intakes 33% full, while your \u0022parked\u0022 screenshot has them 24% full.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou\u0027re using the air. Air intakes have very small \u0022storage\u0022 of IntakeAir; it\u0027s supposed to be used immediately, after all.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll also add the guess that these \u0022Structural Intakes\u0022 are intended for high-altitude, high-speed flight, and you\u0027re therefore not using them where and how they\u0027re most effective. Anyways, it\u0027s not a problem unless your engines are running out of air - which they don\u0027t seem to be.\u003C/p\u003E\n"},{"CreatedByName":"acchilde","CreatedById":120114,"CreatedDateTime":"2014-09-01T06:11:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DeMatt\u0022 data-cite=\u0022DeMatt\u0022\u003E\u003Cdiv\u003ETwo reasons:\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EYou\u0027re not moving through the air. Air intakes collect more air the faster you\u0027re moving. You\u0027ll note that your \u0022flying\u0022 screenshot has your air intakes 33% full, while your \u0022parked\u0022 screenshot has them 24% full. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou\u0027re using the air. Air intakes have very small \u0022storage\u0022 of IntakeAir; it\u0027s supposed to be used immediately, after all. \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen why does the game even tell you the maximum amount that it can intake if it will never get that high? I just tried flying really fast and low (over mach 1, almost mach 2) and it still never got over 50% intake.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-01T06:45:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022acchilde\u0022 data-cite=\u0022acchilde\u0022\u003E\u003Cdiv\u003EThen why does the game even tell you the maximum amount that it can intake if it will never get that high? I just tried flying really fast and low (over mach 1, almost mach 2) and it still never got over 50% intake.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMach 1 isn\u0027t very fast by spaceplane standards (virtually parked, actually), and high-altitude intakes are designed for flying at ~30,000m. The standard spaceplane ascent pattern is to crank it up to Mach 5 and 30,000m before lighting the rockets; that\u0027s what the SP\u002B intakes are designed for.\u003C/p\u003E\u003Cp\u003EIf you just want to play around at low altitude (nothing wrong with that, plenty of fun to be had), use basic jet engines and circular intakes. At the moment, you\u0027re annoyed that your Ferrari isn\u0027t working well as a Jeep.\u003C/p\u003E\n"},{"CreatedByName":"acchilde","CreatedById":120114,"CreatedDateTime":"2014-09-01T06:50:15Z","Content":"\n\u003Cp\u003EThanks. That actually makes a lot of sense.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-09-01T10:43:22Z","Content":"\n\u003Cp\u003EThat intakes even store air at all is down to a game limitation. It\u0027s just needed as a buffer for the air to go from the intakes that make it into the engines that consume it. As long as it\u0027s not empty your jets will be running fine.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-09-01T11:05:01Z","Content":"\n\u003Cp\u003EIntake air really needs fixing. Shouldn\u0027t be storable, shouldn\u0027t be allocated based on part placement order, gauge in the resource panel should make more sense.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-09-01T16:39:53Z","Content":"\n\u003Cp\u003ESince it was mentioned, intakes are effected by their face angle relative to the wind stream (or loosely, AoA). Placement doesn\u0027t matter since they can\u0027t be blocked, but if the face is off from directly prograde, their efficiency is reduced. This can be significant when eeking out the last buts of jet power at high altitude.\u003C/p\u003E\u003Cp\u003EThat doesn\u0027t really answer the question though. You\u0027ll have to be higher and faster (but not too high) to see the bar fill up, but then it\u0027s just showing you excess air. The game shows you excess air so that you know when you are getting close to running out.\u003C/p\u003E\u003Cp\u003EAnd I agree, it needs a rework.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"}]}