{"TopicId":83968,"ForumId":16,"TopicTitle":"help creating a munbase?","CreatedByName":"Carlos_media","CreatedById":120483,"CreatedDateTime":"2014-09-06T20:08:12Z","PageNum":1,"Articles":[{"CreatedByName":"Carlos_media","CreatedById":120483,"CreatedDateTime":"2014-09-06T20:08:12Z","Content":"\n\u003Cp\u003EI need to go to the mÃƒÂ¼n to create a munbase tehre i cretaed a couple vehicles to go out there but i couldnÃ‚Â´t reach the mun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E help\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-07T14:52:59Z\u0022 title=\u002209/07/2014 02:52  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 7, 2014\u003C/time\u003E by Carlos_media\u003C/strong\u003E\n\u003Cbr\u003Efixed problem\n\u003C/span\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2014-09-07T00:00:03Z","Content":"\n\u003Cp\u003EThat depends what the problem is and what the vehicles are. If you can land a 3 man lander on the Mun you should be able to use the same rocket to drop a mobile processing lab onto the Mun since it weighs less than a 3 man pod and doesn\u0027t have to fly back.\u003C/p\u003E\u003Cp\u003EImages of the ships will probably be helpful.\u003C/p\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2014-09-07T03:38:28Z","Content":"\n\u003Cp\u003E\u0022I need to go to the store. I couldn\u0027t reach the store. Help.\u0022\u003C/p\u003E\u003Cp\u003EIf the above sounds rather pointless, that\u0027s because it is. Why couldn\u0027t you reach the store? Do you know where the store is? Did your car explode in your driveway? Is there a giant wall in the way?\u003C/p\u003E\u003Cp\u003EJust like going to the store, there are many challenges to overcome when trying to go to the Mun. We need more information about the specifics of your problem to be able to help.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-09-07T12:21:05Z","Content":"\n\u003Cp\u003EThere are several designs capable of reaching Mun in the tutorial in my signature, plus an explanation of why.\u003C/p\u003E\n"},{"CreatedByName":"Carlos_media","CreatedById":120483,"CreatedDateTime":"2014-09-07T12:25:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EThere are several designs capable of reaching Mun in the tutorial in my signature, plus an explanation of why.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk thanks i will see if it can help me.\u003C/p\u003E\u003Cp\u003EI removed a couple sketches i have so the only desing i have now orbiting kerbal is fuel-empty\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-07T13:10:52Z","Content":"\n\u003Cp\u003EIf you follow the usual KSP pattern, your first few attempts to get to the Mun will fail horribly. Then, when you do get there, you\u0027ll crash half a dozen landers while learning how to do that.\u003C/p\u003E\u003Cp\u003EThen you\u0027ll find that you don\u0027t have enough fuel to get home. Then you\u0027ll discover that serious Munar construction is probably going to require orbital rendezvous and docking, and you\u0027ll spend half a dozen missions failing horribly at that, too.\u003C/p\u003E\u003Cp\u003EIt\u0027s all part of the fun. Learn to enjoy failure, learn to enjoy learning from your mistakes. This is the Kerbal way.\u003C/p\u003E\u003Cp\u003EA Munbase is still a fair way off yet. But when you finally get it done, it will be awesome.\u003C/p\u003E\u003Cp\u003EThen you get to fail horribly at going to Duna for a while...\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-09-07T13:20:02Z","Content":"\n\u003Cp\u003EI miss the learning portion already. Once in a while i\u0027ll still overshoot a rendezvous... or forget my ship as abysmal TWR and not start braking soon enough. Docking at 50m/s tends to create many debris.... also landing at that speed seems bad too. ha ha ha.\u003C/p\u003E\u003Cp\u003EA mun base is kind of a big project. especially if you haven\u0027t had a successful landing (or... intercept???) I would practice landing with a small probe or single kerbal capsule first. Try it on minmus. It is much more forgiving than the mun and takes about the same amount of deltaV to accomplish. Then you need to design your base with the landing stage in mind. How is it going to be deployed? Sky crane? Will it land itself and then have the engines disabled? Are you going to attempt connecting multiple modules together? If you are then the docking ports need to be exactly level with each other on the ground. Kind of annoying to do but there are many many pictures of people that have done just that.\u003C/p\u003E\n"},{"CreatedByName":"Carlos_media","CreatedById":120483,"CreatedDateTime":"2014-09-07T14:51:54Z","Content":"\n\u003Cp\u003Enervemind! i get it! i finnaly orbited the mun! (after 666 fallings of course) but ok guys thanks for the help, i know i didnt tell you so much info, but tahts ok, guys, at least thanks to post on my thread\u003C/p\u003E\n"}]}