{"TopicId":84053,"ForumId":32,"TopicTitle":"What to do once you\u0026#039;ve completed the tech tree?","CreatedByName":"Tingjonki","CreatedById":120088,"CreatedDateTime":"2014-09-07T18:29:11Z","PageNum":1,"Articles":[{"CreatedByName":"Tingjonki","CreatedById":120088,"CreatedDateTime":"2014-09-07T18:29:11Z","Content":"\n\u003Cp\u003EWhat do you guys do?\u003C/p\u003E\u003Cp\u003Ealso Is there a way to exchange science for more funding? that\u0027d be nice and give reasons to still do experiments on other planets after you\u0027ve completed the tree, which is easy to do with the present ammount of mun/minnus science\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-09-07T18:32:41Z","Content":"\n\u003Cp\u003EGo land (and return) from every body in the Kerbol system with a 2 Man Lander Can as your ascent/descent vehicle.\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2014-09-07T18:39:08Z","Content":"\n\u003Cp\u003ENot yet for the Science to funds. Was mentioned that it was in the works. But, from the sounds of it they scrapped that idea, maybe, for 0.25 as they went with something else that was mentioned in one of the Dev notes. Think it was the one before last.\u003C/p\u003E\u003Cp\u003EYes. It certainly would be nice to have moar ways to spend Science on. One way would have been get a mod that increases all the tech trees costs. Other then adding mods. Just have fun exploring the system. Kind of like what I\u0027m doing right now. Building a multi-docked craft that will farry Kerbals to other planets SOI. Become, the next Whackjob and bring your pc to its knees, begging for mercy.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-09-07T18:42:12Z","Content":"\n\u003Cp\u003EPlay like we\u0027ve always done in Sandbox: set our own goals and meet them. Don\u0027t need a game to dictate what you do next, or would you prefer to be spoon-fed?\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-09-07T18:48:53Z","Content":"\n\u003Cp\u003EThere is lots to explore and lots of space to undertake cool missions.\u003C/p\u003E\u003Cp\u003EI have always dreamed about doing a grand tour through the complete system in one run, like in the BBC documentary \u0022Voyage to the planets\u0022. \u003C/p\u003E\u003Cp\u003EAt the moment, i am not experienced enough to do it with style, but i collect every piece of information from the game i can get, test all possible\u003C/p\u003E\u003Cp\u003Edesigns of special landers, rovers and stuff and go through possible mission profiles, to achieve this goal one day.\u003C/p\u003E\n"},{"CreatedByName":"WWEdeadman","CreatedById":105591,"CreatedDateTime":"2014-09-07T18:55:59Z","Content":"\n\u003Cp\u003EUsually, by the time I actually finish the career in a version, the next update is on the horizon, or already out, so I always get to start over. (That might be because I only play KSP when I record for my LP, and I have other games to play for LPs as well. If I would only play KSP, I\u0027d probably use the career as a sandbox with money and contracts, building bases, space stations, or whatever.)\u003C/p\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2014-09-07T18:58:22Z","Content":"\n\u003Cp\u003EI try to do high-science return missions only using stock science parts (ie: no Interstellar mod installed).\u003C/p\u003E\u003Cp\u003EI always have problem managing delta-v tho, hard to do a grand tour, even harder to lad everywhere (especially Eve because of take-off reqs). With stock parts, it\u0027s technically possible (say Ion/nuclear engine hybrid), but the THR-Weight ratio are insanely poor, I estimate at least 35k dV for main craft, and at least another 20 (if not more) for the lander. Never was able to put together a satisfactory craft (takes 3h burns ? no thanks) with that much dV in stock. Was able by building my derivative of the hybrid Ion parts I found a link to on the forum, but it\u0027s no longer stock when I do that.\u003C/p\u003E\u003Cp\u003EHoping for Stock to have such parts one day.\u003C/p\u003E\n"},{"CreatedByName":"chrise6102","CreatedById":109439,"CreatedDateTime":"2014-09-07T19:13:08Z","Content":"\n\u003Cp\u003ETry out some mods! Some even add extra bits to the science tech-tree if you\u0027re that way inclined (e.g. near future modset).\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-09-07T19:15:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhat to do once you\u0027ve completed the tech tree\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStart!\u003C/p\u003E\u003Cp\u003ECongratulations on messing about with all that rubbish, now you can enjoy KSP. Sandbox unless you still want to constrain yourself with funds - you\u0027ll keep getting \u0027science\u0027 contracts that you should be able to fulfill immediately and at zero extra cost with your existing satellites. You might want to do some others too, although I\u0027d only bother with \u0027landed at Kerbin\u0027 ones that can also be done immediately for no cost. You won\u0027t want much extra money anyway since your existing infrastructure of reusable vehicles will only be consuming fuel, with other new launch costs 98-100% recoverable.\u003C/p\u003E\u003Cp\u003EOr you can just say you\u0027ve \u0022won\u0022 KSP.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-09-07T19:15:33Z","Content":"\n\u003Cp\u003EWait for a next patch,\u003C/p\u003E\u003Cp\u003Ecomplete the tech tree with space planes.\u003C/p\u003E\u003Cp\u003EThat\u0027s my plan for now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003ECongratulations on messing about with all that rubbish, now you can enjoy KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*facepalm*\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-09-07T19:47:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EWait for a next patch,\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei was gonna say \u0022stop playing\u0022 but pretty much this, yeah.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-09-07T19:59:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EYou won\u0027t want much extra money anyway since your existing infrastructure of reusable vehicles will only be consuming fuel, with other new launch costs 98-100% recoverable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMeh... you have plenty of funds that you don\u0027t need recoverable SSTOs and such... I use them, yes, but I have plenty of money, and rockets are much faster and save real-life time.\u003C/p\u003E\u003Cp\u003EI say go easter egg hunting, and see the science flavor text from other worlds\u003C/p\u003E\n"},{"CreatedByName":"BadManiac","CreatedById":5194,"CreatedDateTime":"2014-09-07T20:31:10Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/88445-0-24-2-Fine-Print-v0-58b-Resource-Harvest-Contracts-Configuration-%28August-31%29\u0022 rel=\u0022external nofollow\u0022\u003EFine Print...\u003C/a\u003E You\u0027re Welcome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\n"},{"CreatedByName":"Tingjonki","CreatedById":120088,"CreatedDateTime":"2014-09-07T20:58:28Z","Content":"\n\u003Cp\u003Esince there is apparently no mod that does that automatically...does anyone know how if there\u0027s a debug command to subtract science from the player? that way I can add funds for every science I take away\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BadManiac\u0022 data-cite=\u0022BadManiac\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/88445-0-24-2-Fine-Print-v0-58b-Resource-Harvest-Contracts-Configuration-%28August-31%29\u0022 rel=\u0022external nofollow\u0022\u003EFine Print...\u003C/a\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E You\u0027re Welcome \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003Eyeah I use it with Mission Control II but I still want there to be reasons to use science modules after the tree is done (i use interstellar lite tech tree BTW)\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-07T21:05:05Z\u0022 title=\u002209/07/2014 09:05  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 7, 2014\u003C/time\u003E by Tingjonki\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-09-07T22:48:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003E...*facepalm*\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t feel too bad that you got caught in career mode - as you can see a lot of people think they have to \u0022win\u0022 that way. Once you learn to let go of the game props you too can progress.\u003C/p\u003E\u003Cp\u003E@ KerikBalm\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E...rockets are much faster and save real-life time...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour rockets are faster to orbit than my rockets? How does that happen?\u003C/p\u003E\u003Cp\u003EOoohhhh! You have me so wrong - I make resuable launch rockets and space-based rocket-powered vehicles. The only time my stuff gets wings is when it can lift a similar amount for a part-count my machine can cope with and with a launch-duration I can. I\u0027m not opposed to spaceplanes as such and certainly not to jets but they have to account for \u0027efficient\u0027 with something more than 30-minutes real-time just to get to orbit and back and 6xpartcount.\u003C/p\u003E\u003Cp\u003EMy next tutorial is going to be about efficient - in this sense resusable as well as initial funds - launch vehicles, my major objection to planes being that a lot of people think it\u0027s \u0022the\u0022 way. I\u0027d be happy to be proved wrong but to do the subject justice I really need a counterpart that wants to tell you how great they are. My preferred collaborator can\u0027t commit to the time involved so I\u0027m wondering who to ask next (Hodo probably, but I don\u0027t think he\u0027d accept either).\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2014-09-07T22:54:34Z","Content":"\n\u003Cp\u003EKeep gathering science because.. well do you need a reason to do science..?\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2014-09-07T23:58:45Z","Content":"\n\u003Cp\u003ETo reinforce what others have said, the science unlocks in career mode aren\u0027t the entirety of the game, they\u0027re just the tutorial. Once you unlock all the techs, you\u0027ll be free to play a sandbox-like game, albeit with the contract system still in place. The techs just give you a framework for getting there, so that new players don\u0027t start off with overly complex designs that fall apart on the launch pad. (Admit it, you did that when you started out in older versions. I know I did.)\u003C/p\u003E\u003Cp\u003EHonestly I wish there was a bit more to this \u0022tutorial\u0022 aspect. It\u0027s very handy for normal rockets, as you start off with small, simple rockets and slowly scale up as you need to go further from Kerbin. It\u0027s a good way to learn about the way rockets scale, how they handle, etc. But it\u0027s not designed well for other types of construct; there are a few key points in the tree where new build concepts unlock (spaceplanes, unmanned probes, stations), but at present there\u0027s no incentive to try those out instead of continuing to use classic-style rockets, which I suppose reinforces the monotony problem. All they\u0027d really need to do are add a few tech-unlocked custom missions that can only be completed with these sorts of vessels, just enough to encourage you to learn the proper ways to build things other than big heavy rockets.\u003C/p\u003E\u003Cp\u003EAnyway, just think of the tech tree as a tutorial and you\u0027ll be fine. I mean, I unlocked the entire tree with only ONE mission outside Kerbin\u0027s SOI (a single Ike/Duna trip), so there\u0027s still a lot more to do before I could ever consider the game to be over.\u003C/p\u003E\n"},{"CreatedByName":"SunChaser","CreatedById":119217,"CreatedDateTime":"2014-09-08T00:10:45Z","Content":"\n\u003Cp\u003ETry some mods! FAR, Deadly Re-Entry, etc. add a little more difficulty to whatever you do; B9 and such give you a lot more flexibility as far as design goes; Kethane (my new favorite) gives your Space Program a whole new purpose and allows you to refuel anywhere you have a base.\u003C/p\u003E\u003Cp\u003EAlternatively, try finding the Easter Eggs. Capture as many asteroids as you can find and put them all in orbit around Kerbin. Land on the Mun with as small a rocket as possible. KSP is a sandbox game, so come up with your own challenge!\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-09-08T00:19:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spatzimaus\u0022 data-cite=\u0022Spatzimaus\u0022\u003E\u003Cdiv\u003E...The techs just give you a framework for getting there, so that new players don\u0027t start off with overly complex designs that fall apart on the launch pad...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI appreciate the spirit of what you\u0027re saying but can you honestly claim there is anything at all good about the existing tech-tree? Starting manned with a big engine, small fuel tank and no decoupler? Ladder as tier-5 technology? It doesn\u0027t teach anyone anything that\u0027s useful and leads a lot of people, such as the OP, to think that \u0022the\u0022 tech-tree is \u0022the\u0022 game, or at least that parts later in the tree are better. There are two things that make it hard for people to learn how to design rockets in KSP; i) lack of information - mass, TWR, deltaV - in the VAB/SPH (but at least a spreadsheet sorts that out), ii) the tech-tree, which can only be fixed by essentially abandoning careeer/science mode.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-09-08T00:21:14Z","Content":"\n\u003Cp\u003EI restart with more stringent limits on science and money gains, or more limits on physics.\u003C/p\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-09-08T00:30:41Z","Content":"\n\u003Cp\u003EInstall some mods if you want\u003C/p\u003E\u003Cp\u003EFind all the easter eggs\u003C/p\u003E\u003Cp\u003EMake 100-kerbal bases everywhere\u003C/p\u003E\u003Cp\u003EBuild ridiculous stuff just \u0027cuz you can\u003C/p\u003E\u003Cp\u003EDive into the Sun or Jool\u003C/p\u003E\u003Cp\u003EFly your epic planes everywhere\u003C/p\u003E\u003Cp\u003ECrash your epic planes everywhere\u003C/p\u003E\u003Cp\u003EDo a grand tour of the system\u003C/p\u003E\u003Cp\u003EExplore intersellar space (just escape the sun)\u003C/p\u003E\u003Cp\u003EBonus: Read the first word on each line, summary of KSP?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-08T00:33:28Z\u0022 title=\u002209/08/2014 12:33  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 8, 2014\u003C/time\u003E by Nikola7007\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2014-09-08T01:03:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003Ecan you honestly claim there is anything at all good about the existing tech-tree?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I can. The existing tech-tree has a couple significant flaws, mainly involving the delay in getting any kind of unmanned probe core and battery, but most of it is just fine. The problem is you think of how ridiculous it is to see ladders as a tier-5 tech, but it makes a lot more sense than you\u0027re willing to accept; it\u0027s not that making a ladder is a problem, it\u0027s making \u003Cem\u003Ea ladder that can survive the stresses of launch/reentry stuck to the side of a rocket\u003C/em\u003E\u003Cem\u003E\u003Cem\u003E. A metal extension ladder from Home Depot isn\u0027t going to cut it there, you know. Go back and look at NASA\u0027s early manned missions, and tell me how many extendable ladders you see. There were fixed ladders on the side of the Apollo lander, but that was carried INSIDE the rocket for just this reason. If you use KW Rocketry you can get aerodynamic fairings to mimic this sort of design, but without that it would be less realistic to consider these to be a simple technology.\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003EThe same goes for things like plane parts; sure, airplanes existed before we sent rockets into orbit, but airplanes that could handle the heat and forces of suborbital flight? That\u0027s a whole different ballgame; the SR-71 entered service in 1964, and even it\u0027s had horrible engineering problems. (The few we still used in the 90s leaked fuel like crazy in flight, because no patch could adjust to how much the hull expanded from the heat.) Even with KSP\u0027s 10:1 scaling issue, you shouldn\u0027t equate the spaceplane parts to any kind of \u0022normal\u0022 airplane.\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003ESimilar logic applies to things like fuel transfer lines. Sure, it seems like a simple concept, but look at how difficult it was to get it right in the real world. This makes the placement in the tech tree make much more sense.\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003EThe current tech tree starts you off with a few basic parts (and it\u0027s ridiculous to refer to any 1.25m engine as \u0022big\u0022), which can easily be combined into a rocket capable of orbital flights since there\u0027s no downside in the early game to stacking a half-dozen small fuel tanks until you\u0027ve got the right amount of fuel for your engine setup. With a bit of creativity you can make a Mun rocket using only the first few techs; I know, because I\u0027ve done it. Then you unlock 2.5m parts, making it easy to lift things big enough to go to Mun or Minmus. Then you unlock 0.625m parts, 3.75m parts, and all the extraneous bits needed for GOOD lander designs and Duna missions. This sort of iterative unlocking process does make a good learning experience for new players; I walked my young cousin through exactly this process a few weeks ago, and now he\u0027s making good large designs using the principles he learned from those early experiences.\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003EI\u0027m not saying the tech tree can\u0027t be improved a bit, and there are plenty of mods that do just that. For one thing, there are just too many places where all related parts are at a single tech for simplicity\u0027s sake, or at least a few consecutive techs, when it\u0027d make more sense to space them out a bit more. Probe cores are the best example, with the round Sputnik-style probe being something you should get at the start of the game, while the inline cores (often designed to be used as a backup control for manned vessels) deserve to be much, much later.\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cem\u003E\u003Cem\u003EThere are two things that make it hard for people to learn how to design rockets in KSP; i) lack of information - mass, TWR, deltaV - in the VAB/SPH (but at least a spreadsheet sorts that out),\u003C/em\u003E\u003C/em\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003EJust download the Engineer mod; it gives you all of that stuff. Granted, once you\u0027ve played for a bit it\u0027s not hard to figure out a starting TWR yourself, but dV is a lot tougher, as is following an optimal ascent profile. (The existing interface already gives you a mass for world objects, although not in the VAB where it\u0027d be most useful.)\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003EMods are not evil. Most of the great features in KSP started out as mods, with the modders eventually becoming part of the development team. The next update will add the Spaceplane\u002B parts, which include a cargo bay, and that\u0027ll make a huge difference in a lot of ways, and it wasn\u0027t long ago that we received official 3.75m parts to take the load off of mods like KW Rocketry. IMO it\u0027s only a matter of time before something analogous to the engineer mod becomes stock, because of how simple it is and how important information is.\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-09-08T03:24:29Z","Content":"\n\u003Cp\u003EI think Science points are too easy to earn. I basically researched 90% of tree in 3 days.\u003C/p\u003E\u003Cp\u003EThat said, if I had never played before it would have taken a lot longer.\u003C/p\u003E\n"},{"CreatedByName":"Bothersome","CreatedById":66869,"CreatedDateTime":"2014-09-08T11:05:16Z","Content":"\n\u003Cp\u003EYea, now do it with Kerbal Construction Time. And while you\u0027re at it why not make KSP a little more realistic. Then all of a sudden, you won\u0027t be doing it in 3 days.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-09-08T11:18:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bothersome\u0022 data-cite=\u0022Bothersome\u0022\u003E\u003Cdiv\u003EYea, now do it with Kerbal Construction Time. And while you\u0027re at it why not make KSP a little more realistic. Then all of a sudden, you won\u0027t be doing it in 3 days.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProblem isn\u0027t in a construction time but rather that you don\u0027t need to leave Kerbin on order to research every single technology in the game.\u003C/p\u003E\n"}]}