{"TopicId":84081,"ForumId":34,"TopicTitle":"[0.24.2] TT\u0026#039;s Modular MultiWheels 7.2 Update to resolve mass bug \u002B get Roverpilot","CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2014-09-07T22:26:12Z","PageNum":1,"Articles":[{"CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2014-09-07T22:26:12Z","Content":"\n\u003Cp\u003E0.7 has a bug in the mass calculation. Get 0.7.1 to resolve the issue from either KerbalStuff OR download the replacement dll only here : \u003Ca href=\u0022http://www./download/1jbyijd7eahalto/Multiwheels7.dll\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/1jbyijd7eahalto/Multiwheels7.dll\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOkay, so I disagreed pretty strongly with the Spaceport shutdown, and I intended to hold to my plan. But I had a few weekends where I really needed something else to do, and this jumped back out at me. So, why not I thought.\u003C/p\u003E\u003Cp\u003ESo, yes, I updated MMW and right now it\u0027s up on KerbalStuff. Click the image below or the link to get it!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://beta.kerbalstuff.com/mod/151/Modular%20MultiWheels\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/WnbrjbX.png\u0022 alt=\u0022WnbrjbX.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://beta.kerbalstuff.com/mod/151/Modular%20MultiWheels\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://beta.kerbalstuff.com/mod/151/Modular%20MultiWheels\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EModular MultiWheels adds in a new rover mechanic with new tweakable wheels and placeable engines with multiple fuel types to power those wheels. The techtree implementation starts with simple heavy truck parts being available right away, leading up to lightweight car size wheels and an advanced omnidirectional 360Ã‚Â° wheel controlled via RCS translation keys ideally suited to base construction. The wheels also have dynamic friction and will slide to reduce the probability of rollover when driving at high speeds, unlike stock wheels which will typically see you dead in the same scenario. There are also two new capsules (truck cabs!) to use.\u003C/p\u003E\u003Cp\u003ESome pictures: *I\u0027ll get better ones later, these are from in development\u003C/p\u003E\u003Cp\u003ETweakables in action. The mass will also change with each button press, so try this with the CoM indicator on!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yv7i4qb.gif\u0022 alt=\u0022yv7i4qb.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003ERoverpilot trying to clear a mountain after I left it for a while. Drifting sideways around it at 40 m/s. think you can do this stock without rolling into an explosion? Doubt it! (p.s it will sometimes roll over but it\u0027ll take more than just trying to turn at speed to make that happen....)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VfELfcq.png\u0022 alt=\u0022VfELfcq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOmniwheels fitted to a base building machine. They can be raised or lowered using the throttle and locked in place using action groups. the fixes in 7 mean using these for basebuilding is feasible now without the horrible bugs it used to get on docking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HMBqGSP.png\u0022 alt=\u0022HMBqGSP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EChangelog 0.6 to 0.7\u003C/p\u003E\u003Cp\u003ERebalanced cost and mass on everything, added science, it\u0027s all in PART{} now.\u003C/p\u003E\u003Cp\u003EIntegrated Roverpilot as it never got many downloads anyway and is only Multiwheels compatible. Updated the code on this as some older legacy code from KSP it used has actually vanished.\u003C/p\u003E\u003Cp\u003EAdded Tweakability - even parts which are retained from original multiwheels have gained tweakability. All parts ride height can be adjusted Some parts can have driveshaft added Some parts can have steering added\u003C/p\u003E\u003Cp\u003EAdding or removing parts will alter the mass of the part. If the part has an engine built in, removing the driveshaft removes that engine.\u003C/p\u003E\u003Cp\u003EAdded ability for wheels to reference to the current navball. Changing the \u0022control from here\u0022 will now make the wheels think that direction is the forward direction.\u003C/p\u003E\u003Cp\u003EFixed bug where after docking omniwheels or car wheels would sometimes get confused. Fixed bug where wheels suddenly apply all torque and snap vehicle in half. Throttle now applies gradually which prevents this.\u003C/p\u003E\u003Cp\u003EThe transforms are entirely definable in the cfg. This should make it possible if you know the transforms of another wheel mod to actually highjack it and make it Multiwheels compatible yourself.\u003C/p\u003E\u003Cp\u003EAdded Tweakable Car Wheel\u003C/p\u003E\u003Cp\u003EAdded Tweakable Truck Wheel\u003C/p\u003E\u003Cp\u003EAdded Tweakable Landing Gears\u003C/p\u003E\u003Cp\u003EAdded Halfcab without the big radial nose front. Still can attach radially but doesn\u0027t have the dragging on the ground problem.\u003C/p\u003E\u003Cp\u003EREMOVED all original car wheels - now represented in above part\u003C/p\u003E\u003Cp\u003EREMOVED both steering truck axles as represented in above part\u003C/p\u003E\u003Cp\u003EREMOVED all other variants of landing gears, not needed\u003C/p\u003E\u003Cp\u003ELicense:\u003C/p\u003E\u003Cp\u003EPlease do NOT upload this mod pack in any collections, and do not upload any modification of this mod pack. You are free to upload new texture packs if you credit this mod and myself as the maker, and provide a link to the original upload thread/spaceport upload. Feel free to fiddle with the CFG or try unusual placements, If you have any suggestions or improvements let me know on the forum and I\u0027ll see it gets into the next version if I like it. You can make new mods that use this plugin, but please credit me as the plugin creator and do -not- reupload the plugin files, as these will be continually updated.\u003C/p\u003E\u003Cp\u003ESource:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/cfv4y1g9sct18e1/TTModularWheel\u002B0.7\u002BR1\u002Bsource.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/cfv4y1g9sct18e1/TTModularWheel\u002B0.7\u002BR1\u002Bsource.zip\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-09T20:19:10Z\u0022 title=\u002209/09/2014 08:19  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 9, 2014\u003C/time\u003E by TouhouTorpedo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-09-07T22:28:55Z","Content":"\n\u003Cp\u003EWow. Awesome. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Downloading, those gears will come in handy. Will you update Mk4 part pack someday? Ideally, it\u0027d use B9-style textures (or at least less stock-ish ones). Oh, and the Mk.3 cockpit with an MM config, please!\u003C/p\u003E\u003Cp\u003EAlso, any chance of radially attached gear with a tweakable suspension? It\u0027d be really, really great addition, properly setting up the gear is always a problem with planes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-07T22:32:09Z\u0022 title=\u002209/07/2014 10:32  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 7, 2014\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-09-07T22:31:44Z","Content":"\n\u003Cp\u003EGreat to see you back mate! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Your mods have always been fantastic\u003C/p\u003E\n"},{"CreatedByName":"Mach_XXII","CreatedById":94457,"CreatedDateTime":"2014-09-07T22:54:16Z","Content":"\n\u003Cp\u003EGreat to see you back TT, this update looks great\u003C/p\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2014-09-07T23:00:30Z","Content":"\n\u003Cp\u003EGlad you\u0027re back Sir. Downloading now.\u003C/p\u003E\n"},{"CreatedByName":"Storywalker4","CreatedById":92821,"CreatedDateTime":"2014-09-07T23:07:42Z","Content":"\n\u003Cp\u003E*gasp* I\u0027ve missed you multiwheels! Now add karbonite support! Please?\u003C/p\u003E\n"},{"CreatedByName":"tygoo7","CreatedById":57345,"CreatedDateTime":"2014-09-07T23:38:42Z","Content":"\n\u003Cp\u003EReally glad to see you back! Downloading now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hellbrand","CreatedById":65742,"CreatedDateTime":"2014-09-08T00:32:07Z","Content":"\n\u003Cp\u003EW/B TT! Does this mean that the other mods of yours will see updates as well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E??\u003C/p\u003E\n"},{"CreatedByName":"Wrench Head","CreatedById":175503,"CreatedDateTime":"2014-09-08T00:39:02Z","Content":"\n\u003Cp\u003EGreat to see your back!\u003C/p\u003E\n"},{"CreatedByName":"Pondafarr","CreatedById":99169,"CreatedDateTime":"2014-09-08T00:56:58Z","Content":"\n\u003Cp\u003EDownloaded!\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-08T01:36:37Z","Content":"\n\u003Cp\u003EGreat to see you rejoin the community, and great to see this back.\u003C/p\u003E\u003Cp\u003EI\u0027d suggest adding a copy of the license to the OP, or at least mentioning that the license is available at the KerbalStuff link.\u003C/p\u003E\n"},{"CreatedByName":"MaLuS","CreatedById":116251,"CreatedDateTime":"2014-09-08T02:00:17Z","Content":"\n\u003Cp\u003EWELCOME BACK!!! could we have some pics of the wheels please? Are you going to update the Mk4 parts? I would love to see a new version of your mk4 parts that look more updated and perhaps fit in with the look of spaceplane plus (as its gonna be stock soon) and B9, I\u0027m still using the old version of the mk4 parts.\u003C/p\u003E\n"},{"CreatedByName":"randomness5555","CreatedById":53367,"CreatedDateTime":"2014-09-08T14:11:08Z","Content":"\n\u003Cp\u003ECool, I never managed to get this mod working before, so this could be fun\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2014-09-08T15:26:32Z","Content":"\n\u003Cp\u003EYou really need to update and upload all your mods!!\u003C/p\u003E\u003Cp\u003EJust use Kerbalstuff!! that\u0027s what its there for\u003C/p\u003E\n"},{"CreatedByName":"Dracofunk","CreatedById":120324,"CreatedDateTime":"2014-09-08T15:51:52Z","Content":"\n\u003Cp\u003EWelcome back. This was one of my favorite mods!!! Glad you have updated.\u003C/p\u003E\n"},{"CreatedByName":"USS_Cuttlefish","CreatedById":92576,"CreatedDateTime":"2014-09-08T16:56:24Z","Content":"\n\u003Cp\u003EI am very glad to see you Sir. Some of my rovers now may continue on instead of collecting Duna dust on their solar panels.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2014-09-08T20:02:01Z","Content":"\n\u003Cp\u003EAdded license, source and some pictures to the OP. Gonna start a new game using these and see how I get on. So far tried the truck wheels at the start of career, and it\u0027s a great way to pick up science driving around local to KSC and grabbing samples.\u003C/p\u003E\u003Cp\u003EIf anyone\u0027s got any good creations on the go they\u0027ve made for trying these out, post up, I\u0027d love to see what you\u0027re making.\u003C/p\u003E\u003Cp\u003Eedit: start tech science gathering roadster. Got me a crisp 50 science without leaving the ground and wasn\u0027t being that thorough... \u003Cspan\u003E(i broke a wheel off being stupid)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VFT7z1a.png\u0022 alt=\u0022VFT7z1a.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-08T20:04:19Z\u0022 title=\u002209/08/2014 08:04  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 8, 2014\u003C/time\u003E by TouhouTorpedo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2014-09-08T20:28:33Z","Content":"\n\u003Cp\u003EVery cool TT, I am glad you are back! Those wheels are what far is for wings. good job!\u003C/p\u003E\n"},{"CreatedByName":"Thesonicgalaxy","CreatedById":71406,"CreatedDateTime":"2014-09-08T20:28:51Z","Content":"\n\u003Cp\u003EGlad to see you and this mod back \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Downloading now.\u003C/p\u003E\n"},{"CreatedByName":"NocTempre","CreatedById":100081,"CreatedDateTime":"2014-09-08T20:33:59Z","Content":"\n\u003Cp\u003EI am excited to see this mod again. It has always been on my \u0022minimum ksp\u0022 install list next to far, and later b9.\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2014-09-09T04:56:28Z","Content":"\n\u003Cp\u003EI\u0027d like to know more about the new rover mechanics. I guess seeing is believing, but knowing whether or not it\u0027s a new system or just tweaking the values of the present one would be nice. The present motorized wheels suck quite badly, so it gets my hopes up to hear there hear there are alternatives that might not.\u003C/p\u003E\n"},{"CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2014-09-09T07:01:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hyomoto\u0022 data-cite=\u0022Hyomoto\u0022\u003E\u003Cdiv\u003EI\u0027d like to know more about the new rover mechanics. I guess seeing is believing, but knowing whether or not it\u0027s a new system or just tweaking the values of the present one would be nice. The present motorized wheels suck quite badly, so it gets my hopes up to hear there hear there are alternatives that might not.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is an entirely new system. I started building the original Multiwheels code (MMW 0.6 if I remember was when I released it) before stock wheels were released. It has no relation to the stock wheel system whatsoever and was made from the ground up. That\u0027s why its able to behave so differently.\u003C/p\u003E\u003Cp\u003EWhat it has stock rovers don\u0027t\u003C/p\u003E\u003Cp\u003E- Wheels need an Engine to work, these engines can be placed anywhere and can use electricity, RCS, or air and liquidfuel to run and come in numerous sizes.\u003C/p\u003E\u003Cp\u003E- Wheels have steering or driveshaft applied using tweakables in the VAB/SPH to connect to your engines. Adding these will incur a mass penalty which you can see in the right click more info menu in the parts catalogue.\u003C/p\u003E\u003Cp\u003E- Wheels slide and skid, significantly reducing rollover probability. A really unstable design or a massive skid might still see you roll but generally you\u0027ll survive journeys and mistakes that stock wheels never could. also makes cool smoke when skidding sufficiently.\u003C/p\u003E\u003Cp\u003E- Theres an Omni wheel which is unlike anything else available in KSP right now. It doesn\u0027t use engines (not in this version, might do later) and is intended to base building. It drives in whatever direction you press the RCS translation keys. It also raises and lowers the wheels on throttle control, and they are locked in position by action groups. These are made for building bases and servicing in tight spaces.\u003C/p\u003E\u003Cp\u003E- Two truck cabs included, fairly lightweight for the crew capacity but have no SAS capability and very little electric charge, no monoprop.\u003C/p\u003E\u003Cp\u003EAnd unlike older versions of my mods this just goes in Gamedata like everything else.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-09-09T08:53:13Z","Content":"\n\u003Cp\u003EWelcome back. Nice to see this old classic mod back in action.\u003C/p\u003E\u003Cp\u003EI think Tosh\u0027s Cart plugin was one of the first mods I ever used for KSP.\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-09-09T12:14:37Z","Content":"\n\u003Cp\u003EThis is really good - tbh, if Squad are looking to overhaul how wheels work, they could do worse that adopt it.\u003C/p\u003E\u003Cp\u003EThe adjustable height landing gear is pure gold. I\u0027m looking forward to engines getting their own noises. Being able to use the throttle is great - I\u0027m looking forward to trying it with BurnTogether to see if I can control whole convoys of vehicles.\u003C/p\u003E\u003Cp\u003EOne thing, I\u0027ve never quite figured out how the truck wheels are supposed to work with a chassis - to get them to fit the truck cab (do I see an IVA placeholder for RPM monitors in it?), you need to use a narrow beam down the centre, along the bottom of a 1.25m tank. The nodes on the top, though, should make creating custom chassis just for them easy enough.\u003C/p\u003E\u003Cp\u003EI wonder how all the wheels will perform with TweakScale?\u003C/p\u003E\n"},{"CreatedByName":"cremasterstroke","CreatedById":110874,"CreatedDateTime":"2014-09-09T12:39:04Z","Content":"\n\u003Cp\u003EWelcome back TT! Just when I\u0027m looking for some nice rover wheels you pop back up - your timing is impeccable.\u003C/p\u003E\u003Cp\u003EGet ready though, cos here\u0027s your first bug report. The wheels with toggleable steering arms/drive shafts don\u0027t add mass correctly.\u003C/p\u003E\u003Cp\u003EHere\u0027s an example: \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/rBseP\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAs you can see, the addtional mass from steering arms and drive shafts are totally out of whack - the extras should\u0027ve added 0.32t according to the tooltip, instead 12t was added.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EThis was done on a clean install of KSP 0.24.2, with MechJeb as the only other mod. All wheels with toggleable bits seem to be affected.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAlso, a feature request - more wheel sizes e.g. larger Omnis for giant base parts and tiny car wheels for unmanned rover probes. Tweakable size would be awesome.\u003C/span\u003E\u003C/p\u003E\n"}]}