{"TopicId":84193,"ForumId":44,"TopicTitle":"Devastating Report On Record Greenhouse Gas Levels","CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-09-09T12:34:23Z","PageNum":4,"Articles":[{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-09-10T21:58:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EArgued poorly by making up facts- yes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll grant you that my argument is a bit patchy. Especially toward the end of that I was being a bit philosophical - we don\u0027t have to be nuts to \u003Cem\u003Ethink\u003C/em\u003E of ourselves having a grand destiny of saving the world and so on. Personally as I sort of mentioned I\u0027d rather leave the big natural processes alone as much as possible.\u003C/p\u003E\u003Cp\u003EBut I didn\u0027t make any of that up. I\u0027ll also grant that I was perhaps not looking at a big enough picture (imagine that xD) when I said 200 million years. I just spent 20 minutes or so fact-checking myself and indeed, over a mere 200 million years the atmospheric composition hasn\u0027t changed all that markedly. In fact I should have caught myself saying that, but I was a bit sleep deprived. However!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nap.edu/openbook/0309100615/gifmid/30.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nap.edu/openbook/0309100615/gifmid/30.gif\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELooking at billions of years, there is indeed a trend. A noisy one, easily affected by conjecture (and a wealth of feedback mechanisms and smaller fluctuations), but a trend nevertheless. And that was the best graph I could find - information about large-scale trends like that is hard to dig up amidst the piles and piles of debate articles about the human influence. Still, billions of years ago it isn\u0027t unsafe to wager that there was a lot more carbon dioxide around here, and that if one extrapolates into the future the trend will lead to zero. It isn\u0027t certain, of course, but it isn\u0027t preposterous.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-09-10T22:39:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003EI\u0027ll also grant that I was perhaps not looking at a big enough picture (imagine that xD) when I said 200 million years. I just spent 20 minutes or so fact-checking myself and indeed, over a mere 200 million years the atmospheric composition hasn\u0027t changed all that markedly. In fact I should have caught myself saying that, but I was a bit sleep deprived. However!\u003Cp\u003E\u003Ca href=\u0022http://www.nap.edu/openbook/0309100615/gifmid/30.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nap.edu/openbook/0309100615/gifmid/30.gif\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELooking at billions of years, there is indeed a trend. A noisy one, easily affected by conjecture (and a wealth of feedback mechanisms and smaller fluctuations), but a trend nevertheless. And that was the best graph I could find - information about large-scale trends like that is hard to dig up amidst the piles and piles of debate articles about the human influence. Still, billions of years ago it isn\u0027t unsafe to wager that there was a lot more carbon dioxide around here, and that if one extrapolates into the future the trend will lead to zero. It isn\u0027t certain, of course, but it isn\u0027t preposterous.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA billion years ago there were no multi-cellular lifeforms on planet Earth. 200 million years ago was when the first early species of dinosaurs were starting to emerge, when the Earth\u0027s landmass was still Pangaea. I think we\u0027re sort of losing perspective of the timescales here.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-10T22:51:33Z","Content":"\n\u003Cp\u003EIn billions of years the earth is going to cook. You can scoop off the whole damn atmosphere and it won\u0027t change that one iota.\u003C/p\u003E\n"},{"CreatedByName":"Bacterius","CreatedById":69384,"CreatedDateTime":"2014-09-11T03:09:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EIn billions of years the earth is going to cook. You can scoop off the whole damn atmosphere and it won\u0027t change that one iota.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell done, that was extremely deep and insightful. Now if you could explain how events that will (inevitably?) occur a few billion years from now are relevant today, on our timescale, and hence of relevance to this thread \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-11T03:17:14Z","Content":"\n\u003Cp\u003ETry reading parameciumkid\u0027s posts; he\u0027s saying there\u0027s a trend of lowered CO[sub[2 over billions of years (there is, but only because of the evolution of multicellular life and the setting up of the long-term carbon cycle, it\u0027s been pretty stable since then), and that adding more will \u0027save the planet\u0027 from us running out in another few billion years.\u003C/p\u003E\n"},{"CreatedByName":"Bacterius","CreatedById":69384,"CreatedDateTime":"2014-09-11T07:32:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003ETry reading parameciumkid\u0027s posts; he\u0027s saying there\u0027s a trend of lowered CO[sub[2 over billions of years (there is, but only because of the evolution of multicellular life and the setting up of the long-term carbon cycle, it\u0027s been pretty stable since then), and that adding more will \u0027save the planet\u0027 from us running out in another few billion years.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, okay. Noted, missed that post (wasn\u0027t sure what you were replying to \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-09-11T10:12:36Z","Content":"\n\u003Cp\u003EJust a side comment on those long term historic high co2 levels and mass extinctions. \u003C/p\u003E\u003Cp\u003EIt\u0027s pretty easy to imagine that anything leading to a mass extinction will also cause massive co2 releases. Ie. supervolcano releasing massive amounts of co2 from trapped inside the earth or asteroids/comets vaporising/killing sizeable amounts of life/trees/certain rocks releasing co2 trapped in those.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-09-11T10:23:39Z","Content":"\n\u003Cp\u003EIt seems a lot of you are stuck arguing if something is natural or pollution. Which is completely the wrong way of looking at global warming in my opinion.\u003C/p\u003E\u003Cp\u003ERegardless of whether you define rising CO2 as natural or pollution, in either case the climate will change. According to the best models we have right now this change in the climate will result in desertification of fertile lands, increased extreme weather and rising sea levels. This means we will lose farmland to feed ourselves, our infrastructure will take a pummeling and our coastal cities run an increased risk for major floods. All these things will cause large scale suffering and trillions of dollars in economic damage. So climate change is something we want to prevent regardless of whether its the \u0027natural\u0027 thing to happen.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-09-11T12:53:48Z","Content":"\n\u003Cp\u003EJust to add that, contrary to the popular opinion, the average sea level doesn\u0027t have to increase dramatically in order to cause huge problems. Few centimetres, combined with extreme weather, will for example require erecting dikes around Manhattan. Otherwise the subway system will be gone, roads will be under water.\u003C/p\u003E\u003Cp\u003EAdd tides to all of this, and you\u0027re in for a treat.\u003C/p\u003E\n"},{"CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2014-09-11T12:56:18Z","Content":"\n\u003Cp\u003E...and now more methane seeps are popping up. Take a look at the other thread on this.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-09-11T15:26:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EJust to add that, contrary to the popular opinion, the average sea level doesn\u0027t have to increase dramatically in order to cause huge problems. Few centimetres, combined with extreme weather, will for example require erecting dikes around Manhattan. Otherwise the subway system will be gone, roads will be under water.\u003Cp\u003EAdd tides to all of this, and you\u0027re in for a treat.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell tides should not come as an surprise \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Naturaly if you have maximum tide and get hit by an storm you can get an problem. \u003C/p\u003E\u003Cp\u003ENote that the major problem is not raising sea level but that land sink because you use up the ground water. This is that causing Venice to sink. I assume the same is a problem around Manhattan.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-11T17:20:48Z","Content":"\n\u003Cp\u003EFlooded subways are the least of it; it\u0027s the political flow on that\u0027s gonna cause the most damage in the short term.\u003C/p\u003E\u003Cp\u003EFor example: pretty much the entirety of Bangladesh is within a couple of feet of sea level. Their neighbours are large, nuclear armed, and have a long and recent history of military conflict. How do you think China and India are going to react when 100 million Bangladeshi climate refugees land on their doorstep?\u003C/p\u003E\u003Cp\u003EThis is just one example. There are countless analogous situations all over the world. Climate change is a hazard multiplier; it makes all of the existing problems dramatically worse.\u003C/p\u003E\n"},{"CreatedByName":"SorryDave","CreatedById":119474,"CreatedDateTime":"2014-09-12T01:24:01Z","Content":"\n\u003Cp\u003EPolar ice melting causes global warming. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI am an optimistic person and believe that in one billion years CO2 will not be an issue anymore.\u003C/p\u003E\u003Cp\u003EThe earth will adjust and intelligent squids will be speculating on the mysterious demise of the great ape civilization.\u003C/p\u003E\u003Cp\u003EI believe that the scientific evidence of global warming from rising CO2 is hard to deny, as well as the cause being human activity. We should all be concerned when humans drastically affects the environment at levels not generated since the time when a stone axe was the most advanced technology.\u003C/p\u003E\u003Cp\u003EOn a positive note, I think it will be my kids generation that has to address it as some scientist don\u0027t predict enough impact for another 20-100 years. Whew.\u003C/p\u003E\u003Cp\u003EIn the mean time, I am trying to develop a solar powered green house gas generator to help eliminate our dependence on fossil fuel for rising the temperature of the earth.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-12T01:48:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SorryDave\u0022 data-cite=\u0022SorryDave\u0022\u003E\u003Cdiv\u003EOn a positive note, I think it will be my kids generation that has to address it as some scientist don\u0027t predict enough impact for another 20-100 years. Whew.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, no.\u003C/p\u003E\u003Cp\u003EDue to the existence of positive feedback loops and the substantial inertia of climate systems, climate change is in some ways analogous to a long-incubation disease like HIV. By the time you\u0027re obviously ill, it\u0027s too late to stop the damage.\u003C/p\u003E\u003Cp\u003EOver the last thirty years, the refined predictions and observations have been reliably trending towards the worst-case scenarios. The ice is melting faster than hoped, the methane clathrates are bubbling off as we speak, and \u0022Lake North Pole\u0022 has been a reliable summer appearance for several years now. Severe climate impacts are going to affect people alive today.\u003C/p\u003E\n"},{"CreatedByName":"TranceaddicT","CreatedById":73653,"CreatedDateTime":"2014-09-12T01:54:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003EOk, because Venus got something that Mercury doesn\u0027t?\u003Cp\u003ELook at this one...\u003C/p\u003E\u003Cp\u003EEarth - 0.039% carbon dioxide\u003C/p\u003E\u003Cp\u003EMars - 95.97% carbon dioxide\u003C/p\u003E\u003Cp\u003Ewhere is that global warming effect on Mars? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf it occurs on Earth because of CO2 then why not on Mars?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd you do realize that Mars has 1/100 the atmosphere of Earth? So your 95.97% CO2 is more like .9597% Earth equivalent.\u003C/p\u003E\n"},{"CreatedByName":"SorryDave","CreatedById":119474,"CreatedDateTime":"2014-09-12T02:13:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EUnfortunately, no.\u003Cp\u003EDue to the existence of positive feedback loops and the substantial inertia of climate systems\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you are correct than we can only hope that this will help drive some action that has a positive impact on the environment.\u003C/p\u003E\u003Cp\u003EMaybe a scientifically literate country will take meaningful action. The cure is as simple as the cause, don\u0027t burn fossil fuels.\u003C/p\u003E\u003Cp\u003EUntil then, the evidence suggests that this will not be addressed by the same generation that continues to deny the impact of the damage they cause.\u003C/p\u003E\u003Cp\u003ETwenty years until an ice free Arctic is still on the minority of climatologist studies even with the impacts you mention.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-09-12T09:38:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SorryDave\u0022 data-cite=\u0022SorryDave\u0022\u003E\u003Cdiv\u003EThe cure is as simple as the cause, don\u0027t burn fossil fuels.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s hardly simple. You can\u0027t just yank away 86% of the world\u0027s energy supply overnight. It needs to be a slow, managed transition. Realistically fossil fuels are going to make up a large chunk of our energy use for the next couple of generations at least.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-12T09:56:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EThat\u0027s hardly simple. You can\u0027t just yank away 86% of the world\u0027s energy supply overnight. It needs to be a slow, managed transition. Realistically fossil fuels are going to make up a large chunk of our energy use for the next couple of generations at least.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it needed to be a slow, carefully managed transition. But it needed to happen thirty years ago, when the global scientific community told y\u0027all that it needed to happen. All those researchers calling for urgent, emergency action back in the 1990\u0027s weren\u0027t doing it for fun.\u003C/p\u003E\u003Cp\u003EWe\u0027re out of time. On a sane planet, we\u0027d shut down the global coal industry today. Even if we do that, we\u0027re still probably screwed; the evidence of the last few years strongly suggests that we have already passed irretrievable tipping points.\u003C/p\u003E\u003Cp\u003ESudden and drastic transition would cause immense economic and social harm. But the alternative is worse. We\u0027re well into \u0022get it done now, whatever it takes\u0022 territory.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-09-12T11:15:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESudden and drastic transition would cause immense economic and social harm. But the alternative is worse. We\u0027re well into \u0022get it done now, whatever it takes\u0022 territory.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven if you\u0027re right, it ain\u0027t going to happen. We don\u0027t have the technical solutions available for some things (eg: air transport) and for the rest it\u0027s a matter of overcoming a huge amount of inertia and vested interests. There\u0027s also not really any way in a capitalist democracy to mandate that people adopt really uneconomic solutions, so new systems need to be developed to the point where they\u0027re attractive to the industry.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-12T11:32:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seret\u0022 data-cite=\u0022Seret\u0022\u003E\u003Cdiv\u003EEven if you\u0027re right, it ain\u0027t going to happen. We don\u0027t have the technical solutions available for some things (eg: air transport) and for the rest it\u0027s a matter of overcoming a huge amount of inertia and vested interests. There\u0027s also not really any way in a capitalist democracy to mandate that people adopt really uneconomic solutions, so new systems need to be developed to the point where they\u0027re attractive to the industry.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt can be done, though; witness the rapid transformation of US industry during WWII. In just a few years, they went from an economy that was still largely agrarian to having the ability to pump out a few dozen aircraft carriers in a year. The USSR managed a similar trick, jumping from a virtually medieval economy that had been further impaired by decades of civil war to something that was able to spam T34\u0027s at a ridiculous rate.\u003C/p\u003E\u003Cp\u003EThe problem is political, not technological. We have (or at least \u003Cem\u003Ehad\u003C/em\u003E) the ability to prevent this disaster; we\u0027re just choosing not to do so.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-09-12T11:39:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EYes, it needed to be a slow, carefully managed transition. But it needed to happen thirty years ago, when the global scientific community told y\u0027all that it needed to happen. All those researchers calling for urgent, emergency action back in the 1990\u0027s weren\u0027t doing it for fun.\u003Cp\u003EWe\u0027re out of time. On a sane planet, we\u0027d shut down the global coal industry today. Even if we do that, we\u0027re still probably screwed; the evidence of the last few years strongly suggests that we have already passed irretrievable tipping points.\u003C/p\u003E\u003Cp\u003ESudden and drastic transition would cause immense economic and social harm. But the alternative is worse. We\u0027re well into \u0022get it done now, whatever it takes\u0022 territory.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow if only we had a powersource 30 years ago, which didn\u0027t release co2. We could have been shifting even our cars to electricity now (without just shifting the problem of co2 release from cars to powerplants). \u003C/p\u003E\u003Cp\u003EOh wait... We did... \u003C/p\u003E\u003Cp\u003EGee thanks greenpeace and anti nuclear people, whats 125.000.000 dead when, thank god it\u0027s not in our own backyards. \u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EWell I\u0027m still optimistic and privileged. I live in a country, where we can manage pretty much anything, but the worst, that mother nature can throw at us. Sadly, 5-6 billion of the worlds population won\u0027t be as fortunate.\u003C/p\u003E\n"},{"CreatedByName":"Dominatus","CreatedById":76870,"CreatedDateTime":"2014-09-12T12:11:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003ENow if only we had a powersource 30 years ago, which didn\u0027t release co2. We could have been shifting even our cars to electricity now (without just shifting the problem of co2 release from cars to powerplants). \u003Cp\u003EOh wait... We did... \u003C/p\u003E\u003Cp\u003EGee thanks greenpeace and anti nuclear people, whats 125.000.000 dead when, thank god it\u0027s not in our own backyards. \u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EWell I\u0027m still optimistic and privileged. I live in a country, where we can manage pretty much anything, but the worst, that mother nature can throw at us. Sadly, 5-6 billion of the worlds population won\u0027t be as fortunate.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, we had this. In fact, if you research thorium you would come to the stunning realization that we knew about it\u0027s safe nuclear benefits this entire time. Which is irritating. Politics called for nuclear weapons, meaning we needed plutonium and uranium. And guess what super-efficient nuclear reaction has a minimal uranium by-product? Thorium. Currently, most funding for this is coming from India. India is leading global research on a super-efficient, really common nuclear fuel source without risk of meltdown. I mean seriously? Do we just not care? Is enviornmental awareness just for those \u0022hippie types\u0022? It\u0027s ridiculous. Most people don\u0027t worry and figure someone else will solve the problem, if not flat out denying there is a problem.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-12T12:38:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002278stonewobble\u0022 data-cite=\u002278stonewobble\u0022\u003E\u003Cdiv\u003ENow if only we had a powersource 30 years ago, which didn\u0027t release co2. We could have been shifting even our cars to electricity now (without just shifting the problem of co2 release from cars to powerplants). \u003Cp\u003EOh wait... We did... \u003C/p\u003E\u003Cp\u003EGee thanks greenpeace and anti nuclear people, whats 125.000.000 dead when, thank god it\u0027s not in our own backyards. \u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EWell I\u0027m still optimistic and privileged. I live in a country, where we can manage pretty much anything, but the worst, that mother nature can throw at us. Sadly, 5-6 billion of the worlds population won\u0027t be as fortunate.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpeaking as someone who used to work at a reactor...\u003C/p\u003E\u003Cp\u003EFission has its own major problems, although they\u0027re not quite the problems that the general public perceives them as. Waste disposal isn\u0027t a major issue, weapons proliferation is a major issue, water consumption is a moderate issue, and safety...well, the problem there is again political rather than technological. A well-designed modern fission plant, run by sane and competent people, is well within the bounds of acceptable safety.\u003C/p\u003E\u003Cp\u003EBut show me where we\u0027ll find a sufficiently large group of sane and responsible people in North Korea. Or Syria. Or Russia, for that matter. Chernobyl wasn\u0027t caused by fission, it was caused by Russian.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThat \u003C/em\u003Eis not within the bounds of acceptably safe. And there is no need to take the risk; non-fission renewables can do the job just as well. Not any one of them, but all of them: hydro, geothermal, wind, tidal, solar (both thermal and PV), etc. And, most important of all, efficiency. Most of the problem is not that we can\u0027t cleanly produce sufficient power; it\u0027s that we insist on wasting vast amounts of power in ridiculously idiotic ways. Single use aluminium packaging; 24/7 lighting and aircon; single-occupant commuter vehicles driven by large-block V8\u0027s; etc.\u003C/p\u003E\u003Cp\u003EWe\u0027re dying of stupidity.\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2014-09-12T13:14:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003ESpeaking as someone who used to work at a reactor...\u003Cp\u003E1. Fission has its own major problems, although they\u0027re not quite the problems that the general public perceives them as. Waste disposal isn\u0027t a major issue, weapons proliferation is a major issue, water consumption is a moderate issue, and safety...well, the problem there is again political rather than technological. A well-designed modern fission plant, run by sane and competent people, is well within the bounds of acceptable safety.\u003C/p\u003E\u003Cp\u003E2. But show me where we\u0027ll find a sufficiently large group of sane and responsible people in North Korea. Or Syria. Or Russia, for that matter. Chernobyl wasn\u0027t caused by fission, it was caused by Russian.\u003C/p\u003E\u003Cp\u003E3. \u003Cem\u003EThat \u003C/em\u003Eis not within the bounds of acceptably safe. And there is no need to take the risk; non-fission renewables can do the job just as well. Not any one of them, but all of them: hydro, geothermal, wind, tidal, solar (both thermal and PV), etc. And, most important of all, efficiency. Most of the problem is not that we can\u0027t cleanly produce sufficient power; \u003C/p\u003E\u003Cp\u003E4. it\u0027s that we insist on wasting vast amounts of power in ridiculously idiotic ways. Single use aluminium packaging; 24/7 lighting and aircon; single-occupant commuter vehicles driven by large-block V8\u0027s; etc.\u003C/p\u003E\u003Cp\u003EWe\u0027re dying of stupidity.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. Well I\u0027ve never said nuclear fission power, was without problems or completely safe. However, as it turns out now, it is the \u0022lesser of evils\u0022. As it is, the path we are on, will, as estimated by the UN, be worse than 12.000 chernobyl sized nuclear accidents in terms of lives lost (or 500 if you go by rather exaggerated chernobyl casualty figures). \u003C/p\u003E\u003Cp\u003E2. Well I\u0027m pretty sure that the \u0022capitalist\u0022 (in airquotes) tendency to save money, was atleast partially responsible for the non adequate seawall at Fukushima, but I agree, nuclear powerplants are not something you want to be stupid about (or greedy or cheap). However, if we we\u0027re allready producing significant amounts of nuclear power in the vest, where we presumably could do it safer, then enviromentally, we could \u0022afford\u0022 that some nations went a cheaper/simpler coalpowered route. \u003C/p\u003E\u003Cp\u003E3. Except you can\u0027t use hydro everywhere, nor necessarily geothermal and we still don\u0027t have the capacity in any large scale to store the power from wind, tidal or solar power (we could use giant hydrogen storages, but I\u0027m betting thats gonna turn out allmost more dangerous than nuclear power on the scale needed) on a scale to fully power a western country. \u003C/p\u003E\u003Cp\u003E4. Or computer games or internet forums for anything, but the most necessary things. While I agree in principle that there are lots of ways, where we could use less ressources, I tend to think one should be very carefull of deciding what others can and cannot have and/or what other people are \u0022supposed\u0022 to think is important.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-09-12T14:02:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EAnd, most important of all, efficiency. Most of the problem is not that we can\u0027t cleanly produce sufficient power; it\u0027s that we insist on wasting vast amounts of power in ridiculously idiotic ways. Single use aluminium packaging; 24/7 lighting and aircon; single-occupant commuter vehicles driven by large-block V8\u0027s; etc.\u003Cp\u003EWe\u0027re dying of stupidity.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that is a very important point. It is easy to point the finger of blame at someone else... \u0022Stupid hippies and their antinuclear campaigns!\u0022, etc. But everyone should ask themselves \u0022 What am I doing to solve this problem?\u0022 What have we, as individuals, done to reduce our energy consumption? Do we really need an F150 to drive to work? Do we need to fly to Vegas for the weekend? Do we need the A/C running all summer? A lot of energy consumption is wasteful. Cutting down on that waste at the individual level will make a big difference if we all work on it.\u003C/p\u003E\n"}]}