{"TopicId":84228,"ForumId":70,"TopicTitle":"Worth trying to get KSP to work in Windows?","CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-09-09T21:21:32Z","PageNum":1,"Articles":[{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-09-09T21:21:32Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EKSP Version:\u003C/strong\u003E 0.24.2 Windows 32 bit \u0026amp; 64-bit\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMods Installed: \u003C/strong\u003E (Also crashes with no mods on a clean install) They are all up to date.\u003C/p\u003E\u003Cp\u003E-Active Texture Management\u003C/p\u003E\u003Cp\u003E-B9\u003C/p\u003E\u003Cp\u003E-Quantum Struts\u003C/p\u003E\u003Cp\u003E-City Lights and Clouds\u003C/p\u003E\u003Cp\u003E-Community Resource PAck\u003C/p\u003E\u003Cp\u003E-CrewXfer\u003C/p\u003E\u003Cp\u003E-Distant Object Enhancement\u003C/p\u003E\u003Cp\u003E-Environmental Visual Enhancements\u003C/p\u003E\u003Cp\u003E-Firespitter\u003C/p\u003E\u003Cp\u003E-JSI\u003C/p\u003E\u003Cp\u003E-Procedural Fairings\u003C/p\u003E\u003Cp\u003E-HyperEdit\u003C/p\u003E\u003Cp\u003E-Kethane\u003C/p\u003E\u003Cp\u003E-Karbonite\u003C/p\u003E\u003Cp\u003E-Klockheed Martian\u003C/p\u003E\u003Cp\u003E-Lackluster Labs\u003C/p\u003E\u003Cp\u003E-Mechjeb2\u003C/p\u003E\u003Cp\u003E-ModStatistics\u003C/p\u003E\u003Cp\u003E-Notes\u003C/p\u003E\u003Cp\u003E-NovaPunch 2\u003C/p\u003E\u003Cp\u003E-Open Resource System\u003C/p\u003E\u003Cp\u003E-Protractor\u003C/p\u003E\u003Cp\u003E-R\u0026amp;S Capsuledyne\u003C/p\u003E\u003Cp\u003E-ScanSat\u003C/p\u003E\u003Cp\u003E-SmokeScreen\u003C/p\u003E\u003Cp\u003E-SpacePlane Plus\u003C/p\u003E\u003Cp\u003E-SurfaceLights\u003C/p\u003E\u003Cp\u003E-Texture Replacer\u003C/p\u003E\u003Cp\u003E-Kerbal Alarm Clock\u003C/p\u003E\u003Cp\u003E-Vessel View\u003C/p\u003E\u003Cp\u003E-Wayland Corp (various packs)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProblem: \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m posting to see if anyone is running with no problems...\u003C/p\u003E\u003Cp\u003ESo I got a new gaming rig. My old one was running Linux and was playing KSP on it since last summer/fall-ish. Last version I used was the current 0.24.2. I got a new rig now running Windows 8 Pro, so I installed the win version of KSP 0.24.2. The 32-bit won\u0027t even load because of how many mods I use, I\u0027m aware of the memory limit. But the 64-bit works for me and loads fine, and runs all my previous ships with no problems. But it \u0022crashes\u0022 often. By crashes, I mean it just closes. No error message, nothing in the logs, it just goes from gaming to my desktop.\u003C/p\u003E\u003Cp\u003EI\u0027ve tried all kinds of different tweaks to get it to work, including different drivers and game card settings. I\u0027ve also tried removing enough mods to run it in 32-bit, but it also crashes often. Tried disabling a bunch of Windows Services, tried running it on my SSD and my mechanical drive, tried so so many things.... And this is on a fairly new Windows install... Running even with NO mods at all, STILL crashes...\u003C/p\u003E\u003Cp\u003EMy old rig was\u003C/p\u003E\u003Cp\u003ECore2 Quad OC\u0027ed @ 3.6Ghz\u003C/p\u003E\u003Cp\u003E8GB Ram OC\u0027ed\u003C/p\u003E\u003Cp\u003EDual Radeon HD5870 cards\u003C/p\u003E\u003Cp\u003ENew rig is \u003C/p\u003E\u003Cp\u003ECore i7 @ 4Ghz\u003C/p\u003E\u003Cp\u003E16GB Ram OC\u0027ed\u003C/p\u003E\u003Cp\u003ERadeon HD7990 card\u003C/p\u003E\u003Cp\u003EIt\u0027s not an AMD problem and I don\u0027t want this thread to be an AMD/NVidia thing. It ran fine in the old rig. So, I installed a 10GB Linux partition onto my new rig, put KSP on it, copied all my saves and ships, and it works flawlessly running 64-bit. I can play all day long and run tons of missions all over the solar system and it never crashes. So it\u0027s not an issue with the new hardware.\u003C/p\u003E\u003Cp\u003EThe reason I want to get it to work in Windows is because I already started installing a bunch of Windows games and programs and don\u0027t want to switch between OSes. Does \u003Cem\u003Eanyone \u003C/em\u003Erun this game in Windows with no crashes? Or very few crashes? Is there some fix I don\u0027t know about? Why does it run perfectly in Linux and not Windows? I\u0027m just curious about fixes because there were some glitches in old Linux versions where you had to run a few commands to get it to work properly on some distributions.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EReproduction Steps:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EJust play the game, and it will randomly crash within an hour. No specific event causes it and can be anytime.\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003EXT\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-09T21:44:41Z\u0022 title=\u002209/09/2014 09:44  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 9, 2014\u003C/time\u003E by xtoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-09-09T21:23:56Z","Content":"\n\u003Cp\u003EMoved to the Modded Support forum, General KSP Discussion is not where this belongs. Please read the sticky thread in this forum and provide the information requested. There\u0027s no telling if anyone will be able to help you if you don\u0027t give it a serious try.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-09-09T21:38:01Z","Content":"\n\u003Cp\u003EI\u0027ve listed all mods. However, as stated, even with no mods, I\u0027m still getting crashes randomly. There is nothing in the log except for what I was doing last, and it\u0027s never the same so there\u0027s no common denominator here. And yes I\u0027ve been giving it a serious try. I\u0027ve been trying to get it working properly for 5 days now and I even installed a Linux OS on my new system to rule out a hardware problem...\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-09-09T21:56:24Z","Content":"\n\u003Cp\u003EIt could still be a driver issue or something of the sorts. Please provide the output log file, a dxdiag and tell us which software is running concurrent with KSP, such as your anti-virus. It may provide clues.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-09-09T22:03:28Z","Content":"\n\u003Cp\u003EThat\u0027s part of the problem. There is no output log file, it just crashes to desktop. I know where the log files SHOULD be, but there are none. I also uninstalled McAfee, still crashes. Installed Avast, still crashes. Tried different versions of the video drivers. No other software running, it\u0027s a fresh system, and I\u0027m not running it off of steam. I guess what I\u0027m really looking for is to hear from someone who got it running with no problems, and what they did, if anything.\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-09-09T23:15:49Z","Content":"\n\u003Cp\u003Extoro,\u003C/p\u003E\u003Cp\u003EKasperVld referred you to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003Ethis post\u003C/a\u003E about what information to provide, including another location for the output log. You should also read the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92228-Known-Issues-Self-Help\u0022 rel=\u0022external nofollow\u0022\u003EKnown Issues \u0026amp; Self Help\u003C/a\u003E post.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-09-09T23:47:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Master Tao\u0022 data-cite=\u0022Master Tao\u0022\u003E\u003Cdiv\u003Extoro,\u003Cp\u003EKasperVld referred you to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003Ethis post\u003C/a\u003E about what information to provide, including another location for the output log. You should also read the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92228-Known-Issues-Self-Help\u0022 rel=\u0022external nofollow\u0022\u003EKnown Issues \u0026amp; Self Help\u003C/a\u003E post.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELike I said in my last post, I know where they\u0027re SUPPOSED to be, I already read the sticky and I googled it, but they aren\u0027t there. I also know that there\u0027s supposed to be folders that are year-month-day-xxxxxx and the logs should be in those folders, but they are not there. I get no message box saying the game crashed, I get nothing. The game just stops and instantly goes to desktop.\u003C/p\u003E\u003Cp\u003ERe-downloaded the game, fresh install, still crash, same deal.\u003C/p\u003E\u003Cp\u003ERan it on my wife\u0027s laptop for a bit, eventually crashed, but on hers I got an output log file for the 32-bit crash. Yes this was with mods. It also crashed when I tried it the first time without mods but the log file is 58MB and I have slow upload speeds.\u003C/p\u003E\u003Cp\u003EOn the win64-bit version, there\u0027s no crash logs after it crashes, it just goes to desktop.\u003C/p\u003E\u003Cp\u003EHere it is (32-bit log with mods) : \u003Ca href=\u0022https://www.dropbox.com/s/gnr9qq7fhpc2ezy/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/gnr9qq7fhpc2ezy/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt was exactly where it was supposed to be, but again, on my machine, no log files in that location...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-09T23:50:03Z\u0022 title=\u002209/09/2014 11:50  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 9, 2014\u003C/time\u003E by xtoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-09-10T00:10:45Z","Content":"\n\u003Cp\u003ESorry, usually when people say there\u0027s no output log, they mean there\u0027s no crash log folder. There should always be an output_log.txt in KSP_win64\\KSP_x64_Data\\ when you\u0027re running the 64-bit version. If there\u0027s not, something is going seriously wrong with your computer before KSP even has a chance to start loading. Does a stock install load? Where is KSP installed on your computer?\u003C/p\u003E\u003Cp\u003EIn the log you provided from your wife\u0027s computer, you\u0027re running out of memory. That said, there are other issues, like having two versions of Module Manager that aren\u0027t compatible with KSP 0.24. I can\u0027t tell if most of your other mods are up-to-date because you haven\u0027t provided the versions.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-09-10T01:02:04Z","Content":"\n\u003Cp\u003EIf there are no logs being created, it indicates that KSP does not have adequate permissions to read/write files from its own directory. It\u0027s not impossible for this to cause a lot of crashes. I would recommend you check your permissions, and ensure that KSP is not located on the Desktop, or in Program Files, or any other Windows-managed folders (unless you have a Steam install, in which case you should check in case Steam has marked the KSP directory Read-Only for whatever reason).\u003C/p\u003E\u003Cp\u003EIf you have KSP on the Desktop, or in Program Files, you\u0027ll need to copy it out to another location, then delete the original.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-09-10T16:50:05Z","Content":"\n\u003Cp\u003EWell, I\u0027m about ready to give it up.... I did have it on my Desktop so I created a new folder on C:\\ called KSP, put in a fresh install, and in the permissions for the folder and all it\u0027s contents, I gave System, Myself, Administrators and Everyone full control. Same issues. It does play for longer when it\u0027s stock than with mods, but in stock-only, when I start flying one of my larger stock-parts-only ships, it crashes within 30-60 minutes of playing.\u003C/p\u003E\u003Cp\u003EI started googling a lot more about crashing in windows and it seems to happen to a lot of people with no real fixes in sight. I guess I just don\u0027t understand why the windows versions are so buggy when I can play the linux version all day long... I\u0027ll even just leave it running, close my laptop and then the next day, open it up and continue playing, for days. I think the last time I had a crash was when I was playing version 0.20 last year and it was because of a mod (don\u0027t remember which one). So for now, I guess I\u0027ll keep switching into Linux to play KSP until I see something of a fix come up, or until the next version comes out.\u003C/p\u003E\n"}]}