{"TopicId":84234,"ForumId":51,"TopicTitle":"To Mun\u0026#039; Surface and Back with the Kerbal X in 0.23.5. Almost.","CreatedByName":"PLAD","CreatedById":104158,"CreatedDateTime":"2014-09-09T23:16:02Z","PageNum":1,"Articles":[{"CreatedByName":"PLAD","CreatedById":104158,"CreatedDateTime":"2014-09-09T23:16:02Z","Content":"\n\u003Cp\u003EWith an heroic rescue and feats of daring showing the minimum dV required for a Mun mission.\u003C/p\u003E\u003Cp\u003EThe Kerbal X rocket which comes with KSP was improved when version 0.24 came out and can now do a Munar land-and-return (MLAR) mission without too much trouble. However the older versions had about 500m/s less and could not quite make it to a Munar landing and back. See\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/91707-Kerbal-X-Has-More-dV-in-24-2\u0022 rel=\u0022external nofollow\u0022\u003E this thread\u003C/a\u003E for details and a demonstration flight with the .242 Kerbal X.\u003C/p\u003E\u003Cp\u003E The .235 version has about 6818m/s of total dV. I\u0027d done the mission with 6869m/s. I made only 3 changes to the stock .235 Kerbal-X:\u003C/p\u003E\u003Cp\u003E1. Added Mechjeb. I can\u0027t do precise nodes without it, or repeatable ascents and landings.\u003C/p\u003E\u003Cp\u003E2. Changed when the gantry towers release the rocket. They originally release after the main engines ignite, I made them release at the same time as ignition.\u003C/p\u003E\u003Cp\u003E3. Removed the default monopropellant from the Mk1-2 capsule. A Kerbal-X doesn\u0027t need it!\u003C/p\u003E\u003Cp\u003EThis raised the total vacuum dV to 6854m/s. I bet 3 Kerbal\u0027s lives that I could do a Munar mission with that. \u003C/p\u003E\u003Cp\u003EI was wrong....\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/wxGvv\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E6809m/s. A personal record -but why wasn\u0027t it enough? I forgot that not all of the 6809m/s is expended in a vacuum! In the atmosphere the Isp of the motors are lower than in a vacuum. Doh!! The mission was doomed in the first 2 minutes.\u003C/p\u003E\u003Cp\u003EI do think that I have proven that the old Kerbal-Xs cannot do an MLAR. The theoretical limit for an MLAR is around 6716m/s. But rounding errors, SOI changes, control inefficiencies (limited maximum thrust, inaccurate pointing and dV)and the like will add dozens of m/s to that. The practical limit is probably around 6780. Definitely more than the 6717 (vacuum equivalent) the old Kerbal-X can give.\u003C/p\u003E\n"},{"CreatedByName":"WH40krules","CreatedById":79752,"CreatedDateTime":"2014-09-11T00:36:42Z","Content":"\n\u003Cp\u003ECould you of gotten out and pushed? Or is the monoprop you removed the eva fuel? Anyway, nice job. The farthest I got was landing the Kerbal X on the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Felbourn","CreatedById":97344,"CreatedDateTime":"2014-09-11T04:35:59Z","Content":"\n\u003Cp\u003EI know you\u0027re trying to be super optimal and all with triple lifts toward Mun to save 20 dv etc, but Mun-and-back is about 7240 dv in Stock, so why not pack that amount? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E4500 to low orbit\u003C/p\u003E\u003Cp\u003E860 transfer\u003C/p\u003E\u003Cp\u003E310 low orbit capture\u003C/p\u003E\u003Cp\u003E580\u002B100 buffer for landing\u003C/p\u003E\u003Cp\u003E580 liftoff back to low orbit\u003C/p\u003E\u003Cp\u003E310 return trip\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-09-11T17:21:12Z","Content":"\n\u003Cp\u003EJust tried the same in 24.2 - worked perfectly with a safe munar landing and return to kerbin. a bit of fuel left over during reentry. However I forgot that I had recently installed Deadly Reentry (oops!) Also, with FAR it seems the first few asparagus stages release and slam into the central fuel tank. so a bit of disassembly going on there, but nothing important was broken - might need some sepratrons added...\u003C/p\u003E\u003Cp\u003ESo the landing gear and other bits of the Kerbal X return stage vaporised at about 20k altitude during reentry, but the engine survived and performed well as a heat shield (as expected with the temp tolerance), so the boys made it home without a hitch. I nice, simple mission - enjoyable.\u003C/p\u003E\n"},{"CreatedByName":"PLAD","CreatedById":104158,"CreatedDateTime":"2014-09-12T01:09:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Felbourn\u0022 data-cite=\u0022Felbourn\u0022\u003E\u003Cdiv\u003EI know you\u0027re trying to be super optimal and all with triple lifts toward Mun to save 20 dv etc, but Mun-and-back is about 7240 dv in Stock, so why not pack that amount? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EYou\u0027re right, I went to ridiculous lengths to save a few more meters per second, but I just had to know if a full mission could be done with something close to the original (pre-0.24)Kerbal X and its 6820m/s or so. \u003C/p\u003E\u003Cp\u003E I like how KSP works something like the real world, as you use less fuel to get somewhere, the time to get there goes up much faster than the fuel used goes down. A reasonable direct mission uses about 7100m/s and takes about 16 hours. My 6869m/s mission took 13 days, and the 6809m/s mission took 26 days (well, 25 if you don\u0027t count waiting for the rescue). If I ever start using the TAC life support mod I\u0027ll have to give these kinds of missions up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"}]}