{"TopicId":84275,"ForumId":16,"TopicTitle":"Advice mainly, with Fleets in general.","CreatedByName":"Moonfrog","CreatedById":76295,"CreatedDateTime":"2014-09-10T13:42:12Z","PageNum":1,"Articles":[{"CreatedByName":"Moonfrog","CreatedById":76295,"CreatedDateTime":"2014-09-10T13:42:12Z","Content":"\n\u003Cp\u003EI\u0027ve started a new career save, I thought I would do things differently. So I\u0027ve tried to send up missions at the same, or even do small fleets of ships, not actually gone higher than 3 so far. To put it clearer I would launch one vehicle to land on mun, then another to do flyby. But run both missions at the same time. I plan to do this with probes as well.\u003C/p\u003E\u003Cp\u003EI thought I would ask if there are any tips, with stuff you\u0027ve found, or run into problems with, or you discovered something useful.\u003C/p\u003E\u003Cp\u003EMuch appreciated if you could share your wisdom.\u003C/p\u003E\u003Cp\u003EOnly thing I\u0027ve learnt so far, is don\u0027t send both missions home so they arrive in atmosphere at the same time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-11T08:16:37Z\u0022 title=\u002209/11/2014 08:16  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 11, 2014\u003C/time\u003E by Moonfrog\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-09-10T13:55:27Z","Content":"\n\u003Cp\u003EGeschosskopf wrote a good tutorial on flotilla-style expeditions, you can read it \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/70026-Flotillas-A-Primer-in-3-Chapters\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. Aimed more at interplanetary, but many of the same principles apply.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-09-10T14:06:55Z","Content":"\n\u003Cp\u003EAccomplish multiple missions with one launch when possible. Example, when you get the Explore Mun or Minmus contract, build one ship to do the science from orbit, science landed, then place it back into orbit to do further contracts requesting data. Then, upgrade that ship for manned missions to gather further science.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RZIyc5k.jpg\u0022 alt=\u0022RZIyc5k.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kvNuDvT.jpg\u0022 alt=\u0022kvNuDvT.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELater placed back into orbit for the data contracts.\u003C/p\u003E\u003Cp\u003EWhile your ship is headed for Minmus, continue your exploration and contract program as it will take about 7 Kerbal days to get there. You should have the tech to launch both a explore and manned mission by the time you get that contract.\u003C/p\u003E\u003Cp\u003EManned, to return science data;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9Hp2ZJq.jpg\u0022 alt=\u00229Hp2ZJq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/K3o8jJX.jpg\u0022 alt=\u0022K3o8jJX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll stock variant;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QZLCvRM.jpg\u0022 alt=\u0022QZLCvRM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELater, leave a base there to fulfill the plant flag contracts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-10T14:11:30Z\u0022 title=\u002209/10/2014 02:11  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 10, 2014\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2014-09-10T14:11:28Z","Content":"\n\u003Cp\u003EDownload the Kerbal Alarm Clock mod so you can keep track of the SOI changes and manoeuvres of multiple craft.\u003C/p\u003E\u003Cp\u003EI tend to try and ensure that I have an alarm in my list for every mission that isn\u0027t finished. Alarms for SOI changes bacause you don\u0027t want things to do SOI changes at hight warps, alarms for every manoeuvre and I put in an alarm that will notify me a little while before anythign hits an atmposphere for earobraking or landing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-10T14:13:48Z\u0022 title=\u002209/10/2014 02:13  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 10, 2014\u003C/time\u003E by tomf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-09-10T14:29:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tomf\u0022 data-cite=\u0022tomf\u0022\u003E\u003Cdiv\u003EDownload the Kerbal Alarm Clock mod so you can keep track of the SOI changes and manoeuvres of multiple craft.\u003Cp\u003EI tend to try and ensure that I have an alarm in my list for every mission that isn\u0027t finished. Alarms for SOI changes bacause you don\u0027t want things to do SOI changes at hight warps, alarms for every manoeuvre and I put in an alarm that will notify me a little while before anythign hits an atmposphere for earobraking or landing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA definite requirement when the Eve and Duna - Ike window becomes available. You will want to launch a fleet of ships and place them in orbit before conducting missions from them.\u003C/p\u003E\u003Cp\u003EThe ship types;\u003C/p\u003E\u003Cp\u003E1. The contract one way landed probe.\u003C/p\u003E\u003Cp\u003E2. The contract data from orbit probe.\u003C/p\u003E\u003Cp\u003E3. Return with Goo and Material Bay missions from orbit\u003C/p\u003E\u003Cp\u003E4. Return with Goo and Material Bay after landing on Duna and Ike\u003C/p\u003E\u003Cp\u003E5. Manned landing to return with samples from Duna and Ike.\u003C/p\u003E\u003Cp\u003E6. Establish a base on all 3 locations.\u003C/p\u003E\u003Cp\u003E7. Return data from Duna and Ike.\u003C/p\u003E\u003Cp\u003ELacking an actual timetable chart, you will want to have a probe, preferring one of those test a part while escaping Kerbal, in solar orbit to plot the best time for a direct launch from Kerbal orbit to Duna or Eve. Even with the timetable, have your ships in low Kerbal orbit ready for the window for a direct burn to Duna or Eve intercept. This will eliminate the delta v needed for a transfer burn from solar orbit. Plan on using aerobraking to further save on fuel.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-09-10T14:47:52Z","Content":"\n\u003Cp\u003EMy main advice on fleets is: don\u0027t park the whole lot at the same space station at once. The totalled part count from a dozen ships is going to make your computer want to kill you.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-09-10T16:22:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moonfrog\u0022 data-cite=\u0022Moonfrog\u0022\u003E\u003Cdiv\u003EI\u0027ve started a new career save, I thought I would do things differently. So I\u0027ve tried to send up missions at the same, or even do small fleets of ships, not actually gone higher than 3 so far. To put it clearer I would launch one vehicle to land on mun, then another to do flyby. But run both missions at the same time. I plan to do this with probes as well.\u003Cp\u003EI thought I would ask if there are any tips, with stuff you\u0027ve found, or run into problems with, or you discovered something useful.\u003C/p\u003E\u003Cp\u003EMuch appreciated if you could share your wisdom.\u003C/p\u003E\u003Cp\u003EOnly thing I\u0027ve learnt so far, is don\u0027t send both missions home so they arrive in atmosphere at the same time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYay, another flotilla commander is born! I see Red Iron Crown already linked my guide on that (thanks for the prop, BTW). I said there I don\u0027t recommend flotillas for such short trips but if you want to give it a try, feel free.\u003C/p\u003E\u003Cp\u003EThe main thing is, as you\u0027ve discovered for yourself, is to arrange ship movements so you never have more than 1 ship in need of a critical maneuver (capture burn, reentry, etc.) at once. So like when leaving Kerbin, let the 1st ship get a ways down the road to Mun before sending off the 2nd one, and similarly on the return. And you can stretch the whole thing out as long as you want because every day is transfer window day many times over \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003ENow take the lessons you learn doing a Mun flotilla and apply them an interplanetary invasion armada \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Moonfrog","CreatedById":76295,"CreatedDateTime":"2014-09-10T18:08:38Z","Content":"\n\u003Cp\u003Ethx for the advice and the guide link. Think i\u0027ll ask another question, I plan on doing a mission to Duna system first, then maybe do something harder.\u003C/p\u003E\u003Cp\u003EI came up with an idea of having Four vehicles. Two landers, one for Ike and Duna, a Flyby vehicle for doing orbital research and a large Fuel vehicle with no engine of its own. Idea would be for the 4 vehicles to dock with the giant fuel vehicle for the interplanetary journey, then disembark for their individual mission, idea is that the refueler would use the smaller ships engines to push it.\u003C/p\u003E\u003Cp\u003Eis this viable ? or just a huge waste of effort?\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2014-09-10T19:01:23Z","Content":"\n\u003Cp\u003EIt\u0027s perfectly viable, but the flyby vehicle might not be necessary. Add a mobile lab to your tanker -\u0026gt; use your Duna landers to make science high and low in Duna\u0027 space -\u0026gt; dock with the tanker, use the lab to reset the material labs and goo -\u0026gt; Land\u003C/p\u003E\u003Cp\u003EAnother small tip for a flotilla is to name all your ships with their destination. For example, you could name your ships\u003C/p\u003E\u003Cp\u003EDuna #1 Ike Lander\u003C/p\u003E\u003Cp\u003EDuna #1 Duna Lander\u003C/p\u003E\u003Cp\u003EDuna #1 Tanker\u003C/p\u003E\u003Cp\u003EDuna #1 Flyby\u003C/p\u003E\u003Cp\u003EOr simply, \u0022D1\u0022 to shorten it. Or something more catchy, like \u0022Duna Express\u0022. That way, when you have several flotillas to different destinations, you can quickly tell by the name which ship is part of which flotilla.\u003C/p\u003E\u003Cp\u003ESo, you look at your list of alarms, or you\u0027re using targetron or haystack to keep track of all your ships.\u003C/p\u003E\u003Cp\u003EYou open Kerbal Alarm clock and you have an alarm for \u0022Jool #1 Laythe\u0022 followed by a SOI change for \u0022Duna #2 Space Station\u0022 and then \u0022Kerbin-Eve transfer window\u0022. So, at a glance, you know you have course correction for the Laythe lander of your first Jool flotilla. Afterwards, the space station of the second flotilla you\u0027re sending to Duna is entering Duna\u0027 SOI and, once you\u0027re done aerobreaking it, you turn your attention to your Eve flotilla which either you have to launch or is parked in LKO waiting for the transfer window.\u003C/p\u003E\u003Cp\u003EIt also simplifies all your ships. If your Vall lander doesn\u0027t have fuel to leave Vall\u0027 SOI and you have to send the tanker you put in the flotilla, you know you have to look for a ship named \u0022Jool something\u0022 (Probably \u0022Jool 1 Tanker\u0022) and you don\u0027t waste time jumping to the tanker you\u0027ve sent to Moho instead.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-09-11T12:49:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moonfrog\u0022 data-cite=\u0022Moonfrog\u0022\u003E\u003Cdiv\u003Eis this viable ? or just a huge waste of effort?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s viable. People do such things all the time.\u003C/p\u003E\u003Cp\u003EThe thing is, doing a clean sweep of the Science! at another planetary system in 1 expedition is a much bigger task than just sending a single lander to plant 1 flag like you\u0027ve been doing at Mun. Lots of tasks to be done, lots of places to go. There are 2 general approaches. You can either build a single mothership or you can send a flotilla. Both approaches have their pros and cons but either way, you\u0027re in for a lot of work both in the design/testing and execution phases.\u003C/p\u003E\u003Cp\u003EMy own preference is for flotillas instead motherships. Flotillas are a lot easier to design because each ships is relatively small and simple, whereas the mothership will probably require 1 or more full-scale orbital tests of assembling prototypes to make sure you\u0027ve got the dV and TWR you want, that it doesn\u0027t wobble too much under thrust, your computer can handle the part count, you\u0027ve got enough RCS thruster to rotate the beast to a burn heading in less than 2 weeks, and you\u0027ve got enough RCS fuel to make more than a couple of turns. But OTOH, the mothership is only 1 ship you have to fly instead of however many in the flotilla. But OTGH, once at the destination, each part of the flotilla can do its job independently of the others so 1 mission objective doesn\u0027t interfere with the others, and you\u0027ve got some redundancy and self-help available if something goes badly wrong. HOWEVER, if the sole objective of this expedition is just to grab the Science! and go home, without leaving behind a permanent station and/or refueling system, then 1 mothership is probably the best bet because Duna doesn\u0027t need much.\u003C/p\u003E\u003Cp\u003EFor instance, to get all the Duna Science!, you only need 1 lander, 1 set of instruments on the lander, a Mobile Lab, and enough fuel and engines to get this assembly there and back and refuel the lander several times. This doesn\u0027t make for a huge, wobbly mothership and it\u0027s relatively easy to design. You use the lander\u0027s instruments to get the Duna high and low orbit data on the way in to Pe (rearming the instruments with the lab in between) and use aerobraking to sling you out to an eventual Ike encounter. Then you get high and low Ike orbit data as you approach that. Land on Ike. Then go to Duna and land there twice, once for the surface data and once for \u0022while flying over\u0022 data in the atmosphere. All done. Now just wait for the window to come home again.\u003C/p\u003E\u003Cp\u003EYou can leave the lander behind in Duna orbit for use by later expeditions and not spend dV to get it home. And you\u0027ve transferred all the data from it into the lab each time, so it now contains dozens of data sets. Just get this back down on Kerbin, which requires 1) a probe core and power so you can control the lab during descent and 2) 4 big blue chutes and 4 big landing legs to get down safely. Mission accomplished.\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2014-09-11T13:24:01Z","Content":"\n\u003Cp\u003EOne thing I haven\u0027t seen specifically mentioned is the middle path, as I like to think of it. You send one ship - thus saving on the travel drive redundancies - but that ship is composed primarily of small probes (manned or otherwise) with just enough dv to get around the system when you get there. (This involves decouplers or docking ports.) It\u0027s different from the idea of a mothership in that the pieces aren\u0027t necessarily intended to come back together afterward.\u003C/p\u003E\u003Cp\u003EI personally favor this approach because it allows me to send a flotilla while not having to worry about making five different transfer burns and having the drive assembly for each.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-09-11T15:04:57Z","Content":"\n\u003Cp\u003EGeschosskopf gives some great advice. I will add on and simply say, go try it! I was a bit slow to try flying multiple mission like that myself until I finally just tried it one day. I learned a lot more about what Geschosskopf is telling you by putting my hands on the problem and seeing how it works.\u003C/p\u003E\u003Cp\u003EI definitely failed some of the missions because I didn\u0027t deconflict the arrival or science times from each other. The big one that took a while to sort out (especially coming back from Mun or Minmus with several ships) is allowing enough time between missions during the aero brake and atmospheric recovery portions. Sometimes that can take a lot of in-game time and you don\u0027t want the second ship needing to aerobrake while the first ship is still landing. I also keep a basic list of destinations, objectives, and abilities (equipment/fuel) for each mission so that I don\u0027t get confused while hopping around. (Nothing like inserting the wrong probe into the wrong place...)\u003C/p\u003E\u003Cp\u003EI\u0027d say when I was using Kerbal Alarm, I managed up to 14 simultaneous Munar missions (with manned, unmanned, flybys, orbitals, and landers). That was definitely my max and I certainly can\u0027t handle that many without the help of something like Alarm.\u003C/p\u003E\u003Cp\u003EGo give it a try, and Good Luck!\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"Moonfrog","CreatedById":76295,"CreatedDateTime":"2014-09-11T21:12:48Z","Content":"\n\u003Cp\u003EOk I built this as one of my flotilla craft for Duna. Its job is to do the flyby missions, I plan to have a lab as suggested on my refueler tank so it can do both ike and duna. It may also refuel if necessary. What do u guys think of it? It has around 2000 DV, I hope is enough, I plan on collecting the data transferring them to a pod, to help save mass on the journey home. After this I plan to build two landers, ike and duna.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/8ao6egbqv/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s7.postimg.org/8ao6egbqv/RCS_Pod_mk1.jpg\u0022 alt=\u0022RCS_Pod_mk1.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"}]}