{"TopicId":84409,"ForumId":32,"TopicTitle":"Program Names?","CreatedByName":"Sully805","CreatedById":120211,"CreatedDateTime":"2014-09-12T01:58:04Z","PageNum":1,"Articles":[{"CreatedByName":"Sully805","CreatedById":120211,"CreatedDateTime":"2014-09-12T01:58:04Z","Content":"\n\u003Cp\u003EI\u0027m just looking for ideas to name my rockets that have different objectives, for example I named my program that dealt with orbiting and collecting science from Kerbin the Renegade Program. And for Minmus I named the program Discovery. I\u0027m just looking for some names to use to christen my new programs that are going to be heading to new and uncharted areas for me at least. Any ideas? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-09-12T02:01:16Z","Content":"\n\u003Cp\u003EThe \u0022Because it\u0027s there\u0022 program\u003C/p\u003E\u003Cp\u003EThe \u0022Sagan\u0022 program\u003C/p\u003E\n"},{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2014-09-12T02:18:50Z","Content":"\n\u003Cp\u003EI got a few.\u003C/p\u003E\u003Cp\u003EThe Blue Kasket Series are ships designed to rescue kerbals in orbit around Kerbin.\u003C/p\u003E\u003Cp\u003EKerbollo were my first MÃƒÂ¼n trips, of course.\u003C/p\u003E\u003Cp\u003EKerveller are generic travellers for what I can\u0027t find a proper name, or aren\u0027t big enough to create a name series for it.\u003C/p\u003E\u003Cp\u003EThe Cleaner is a probe that orbits Kerbin looking for debris to deorbit.\u003C/p\u003E\u003Cp\u003EThe Sniffer Rover was a single rover made to explore Kerbin grounds, mostly for anomalies and checkpoints to be verified.\u003C/p\u003E\u003Cp\u003EKSS, Kerbal Space Station;\u003C/p\u003E\u003Cp\u003EKT-SS, Kethane Space Station (comes with a codename at the end depending on the body it\u0027s orbiting, eg Alpha, Bravo, etc.);\u003C/p\u003E\u003Cp\u003EKMSB: Kassandra - Minmus Science Base (WIP);\u003C/p\u003E\u003Cp\u003EAnd my first satellite sent out of kerbin SOI was the Parker 1: A satellite sent out to map Eve. The name was given in honour to the great photographer, Peter Parkerman.\u003C/p\u003E\n"},{"CreatedByName":"Sully805","CreatedById":120211,"CreatedDateTime":"2014-09-12T02:32:01Z","Content":"\n\u003Cp\u003EI have a few names, for example: \u0022Outlaw\u0022, \u0022Rebel\u0022, \u0022Explorer\u0022. But I do like \u0022Kerbollo\u0022 but I might switch it to Kerpollo for my Mun missions, in honor of Apollo of course.\u003C/p\u003E\n"},{"CreatedByName":"TimberWolffe","CreatedById":119811,"CreatedDateTime":"2014-09-12T03:53:56Z","Content":"\n\u003Cp\u003EMy Munar missions are under the \u0022Remember to brake before the ground does it for you\u0022, with some special missions under the \u0022Bring enough fuel next time\u0022 mission banner.\u003C/p\u003E\u003Cp\u003EMinmus missions are \u0022why is the thing so blue\u0022 and \u0022OH GOD I OVERSHOT WELL HELLO SOLAR ORBIT\u0022\u003C/p\u003E\n"},{"CreatedByName":"HorusKol","CreatedById":117326,"CreatedDateTime":"2014-09-12T04:00:43Z","Content":"\n\u003Cp\u003EYeah, decent (and original) names can be hard...\u003C/p\u003E\u003Cp\u003EIn the career mode, I used \u003Cem\u003ECrossbow\u003C/em\u003E for the series of rockets I built to meet all the contracts you get before you reach orbit.\u003C/p\u003E\u003Cp\u003EThen, the Mun and Minmus missions were \u003Cem\u003ESilline\u003C/em\u003E (Selene coming from the Greek goddess the Moon and, well, silly).\u003C/p\u003E\u003Cp\u003EMy probe missions to Eve and Duna were named \u003Cem\u003EValcan\u003C/em\u003E (can = probe, and from \u003Cem\u003EVulcan\u003C/em\u003E = Roman god of fire).\u003C/p\u003E\u003Cp\u003EThe last series I built before having to format my computer and losing the career save were the \u003Cem\u003ETeincan \u003C/em\u003E probes (tin can) I had on the way to Jool and it\u0027s moons.\u003C/p\u003E\u003Cp\u003EI think Greek and Roman mythology have some great names that can be riffed on - but there\u0027s a bunch of other sources:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/NATO_reporting_name#Lists_of_NATO_reporting_names\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/NATO_reporting_name#Lists_of_NATO_reporting_names\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Category:Naming_conventions\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Category:Naming_conventions\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EOh, and of course - \u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_NASA_missions#Manned_missions\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_NASA_missions#Manned_missions\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-09-12T04:09:39Z","Content":"\n\u003Cp\u003EI like to use \u0022explorer\u0022 names like Odyssey, Intrepid, Discovery, Horizon, etc. Sometimes I name individual ships after planets and moons, like Tylo or Minmus, or after deceased Kerbals. My current flagship is called the \u003Cem\u003EAmbassador\u003C/em\u003E, because it\u0027s the first true exploratory Kerbal spaceship.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-09-12T04:12:22Z","Content":"\n\u003Cp\u003EMine is called Sailor Mun. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/16683090/KSP/Sailor-Mun.png\u0022 alt=\u0022Sailor-Mun.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll let myself out...\u003C/p\u003E\n"},{"CreatedByName":"TimberWolffe","CreatedById":119811,"CreatedDateTime":"2014-09-12T04:51:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EMine is called Sailor Mun. \u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/16683090/KSP/Sailor-Mun.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/16683090/KSP/Sailor-Mun.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll let myself out...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is brilliant oh my god\u003C/p\u003E\n"},{"CreatedByName":"Sully805","CreatedById":120211,"CreatedDateTime":"2014-09-12T06:12:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mitchz95\u0022 data-cite=\u0022Mitchz95\u0022\u003E\u003Cdiv\u003EI like to use \u0022explorer\u0022 names like Odyssey, Intrepid, Discovery, Horizon, etc. Sometimes I name individual ships after planets and moons, like Tylo or Minmus, or after deceased Kerbals. My current flagship is called the \u003Cem\u003EAmbassador\u003C/em\u003E, because it\u0027s the first true exploratory Kerbal spaceship.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMe and you are on the same page, I like using explorer names, I\u0027ve used Discovery. But I haven\u0027t thought of the other\u0027s that you have mentioned.\u003C/p\u003E\n"},{"CreatedByName":"Rainbow-Dashie","CreatedById":76160,"CreatedDateTime":"2014-09-12T10:49:46Z","Content":"\n\u003Cp\u003EMine are named after how their test runs worked....\u003C/p\u003E\u003Cp\u003E\u0022KSS Crash and Burn\u0022\u003C/p\u003E\u003Cp\u003E\u0022Looppy Loop\u0022\u003C/p\u003E\u003Cp\u003E\u0022KSS No-Turn\u0022\u003C/p\u003E\u003Cp\u003E\u0022PerfectionButWorkedToWellIDontTrustIt\u0022 (Later suffered engine malfunction sending it flying into the surface of Minmus... never again shall i use a rocket that passes the first test runs...)\u003C/p\u003E\u003Cp\u003E\u0022TURN UP!\u0022 (Has a tendency to want to fly straight down :/, also refered to as the \u0022Turnip\u0022 )\u003C/p\u003E\n"},{"CreatedByName":"SRiley77","CreatedById":115337,"CreatedDateTime":"2014-09-12T12:36:51Z","Content":"\n\u003Cp\u003EMine are traditional, and semi-boring (at least as compared to the above)\u003C/p\u003E\u003Cp\u003E1 occupant capsules - Hephaestus Program\u003C/p\u003E\u003Cp\u003E3 occupant capsules - Callisto Program\u003C/p\u003E\u003Cp\u003EI haven\u0027t really been beyond these... so I\u0027m not sure where I\u0027d go from there.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2014-09-12T13:08:18Z","Content":"\n\u003Cp\u003EDunafish, on the way to Duna.\u003C/p\u003E\u003Cp\u003EMaximus, to Minmus\u003C/p\u003E\u003Cp\u003EJoolyJoker - Jool\u003C/p\u003E\u003Cp\u003EDrestroyer - Dres\u003C/p\u003E\u003Cp\u003EMohawk - Moho\u003C/p\u003E\u003Cp\u003EAdam - Eve\u003C/p\u003E\u003Cp\u003EEeloosive - Eeloo\u003C/p\u003E\u003Cp\u003Eand so on.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lord Nihilus","CreatedById":97741,"CreatedDateTime":"2014-09-12T13:11:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sully805\u0022 data-cite=\u0022Sully805\u0022\u003E\u003Cdiv\u003EAnd this is a call of a desperate person seeking attention from the all mighty internet....... so depressing.....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOfftopic and really uncalled for. If it was the case, something I seriously doubt by the way, do you feel good about yourself for making such a comment?\u003C/p\u003E\u003Cp\u003EOn topic, I usually go for the explorer(ish) names myself. Can\u0027t go wrong with Discovery \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-09-12T19:38:50Z","Content":"\n\u003Cp\u003EMy actual space program, as in the entity that designs, builds, and flies the rockets, is almost always called the Kethane or Karbonite Travelling Circus.\u003C/p\u003E\u003Cp\u003EThis entity is based at KSC (Kerbin Social Corrections) facility and is a division of the overall KSP (Kerbin State Prison) system.\u003C/p\u003E\n"},{"CreatedByName":"Daffs","CreatedById":109699,"CreatedDateTime":"2014-09-12T21:25:59Z","Content":"\n\u003Cp\u003EMine follow the simple rule of balance. Time thinking up a cool name VS Time building a successful craft.\u003C/p\u003E\u003Cp\u003ETherefore all \u0022cool\u0022 names have crashed and burned.\u003C/p\u003E\u003Cp\u003ESuccessful missions have been:\u003C/p\u003E\u003Cp\u003E\u0027yet another SSTO\u0027\u003C/p\u003E\u003Cp\u003E\u0027a silly one\u0027 (star destroyer SSTO)\u003C/p\u003E\u003Cp\u003E\u0027Big one\u0027 (Asparagus rocket)\u003C/p\u003E\u003Cp\u003E\u0027nuc 2\u0027 (First nuclear design craft...featuring two engines)\u003C/p\u003E\u003Cp\u003E\u0027nuc 6\u0027 (Second design...guess how many engines \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E)\u003C/p\u003E\u003Cp\u003E\u0027Bah\u0027 (Crew transfer rocket when someone fogot to crew the lab)\u003C/p\u003E\u003Cp\u003E\u0027Liq Lander\u0027 (probably the most sensible and heavily tested ship designed for Laythe and return)\u003C/p\u003E\u003Cp\u003E\u0027SM Lander\u0027 (....erm Scott Manley Lander \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E You might think you know better, but you don\u0027t and he\u0027s always right)\u003C/p\u003E\n"},{"CreatedByName":"Moss","CreatedById":106413,"CreatedDateTime":"2014-09-12T21:31:41Z","Content":"\n\u003Cp\u003EMost of my program names come from Slavic mythology.\u003C/p\u003E\n"},{"CreatedByName":"JayKay","CreatedById":90560,"CreatedDateTime":"2014-09-12T22:00:12Z","Content":"\n\u003Cp\u003EI try not to anguish more than 15 seconds for a name for a ship. Sometimes I have second thoughts later and rename them, but not often.\u003C/p\u003E\u003Cp\u003ERight now in my present con/sci save I have:\u003C/p\u003E\u003Cp\u003EJavelin: 1 or 2 stage size 2 boosters\u003C/p\u003E\u003Cp\u003ELongshot: 1 or 2 stage size 3 boosters\u003C/p\u003E\u003Cp\u003EBrutus: heavy 4 stage size 3 booster\u003C/p\u003E\u003Cp\u003ECSMs are:\u003C/p\u003E\u003Cp\u003EOrion: 3 man with small service module (name shamelessly stolen from NASA) for Kerbin system\u003C/p\u003E\u003Cp\u003ERigel: 3 man with large service module to act as fuel tender for stations as well\u003C/p\u003E\u003Cp\u003EVega: 3 man with engines on nacelles for landing cargo on Mun and Minmus\u003C/p\u003E\u003Cp\u003EMy stations are:\u003C/p\u003E\u003Cp\u003EUnity (Kerbin)\u003C/p\u003E\u003Cp\u003EMunity (Mun)\u003C/p\u003E\u003Cp\u003EMinmus 1 (I think you can guess...)\u003C/p\u003E\u003Cp\u003EDunity (not yet built, but it\u0027s on the drawing board)\u003C/p\u003E\u003Cp\u003ESo far no big interplanetary expeditions have been launched, but I usually use a theme; haven\u0027t thought of one for this save yet.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-13T00:56:07Z\u0022 title=\u002209/13/2014 12:56  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 13, 2014\u003C/time\u003E by JayKay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-09-12T23:22:02Z","Content":"\n\u003Cp\u003EI usually have boring, utilitarian names. \u0022Mun 1\u0022 or suchlike. But there are a few exceptions.\u003C/p\u003E\u003Cp\u003EWhen I get to the point in any save where I\u0027m building orbital infrastructure, the first two general-purpose tugs are ALWAYS named \u0022Flying Dutchman\u0022 and \u0022Fata Morgana\u0022.\u003C/p\u003E\u003Cp\u003EMinmus seems to bring out the goofy in me (it\u0027s doubtless the EVA and Crew reports responsible for that). So my first crewed landing mission (long before I ever tried landing on Mun) was known as Project Minty Dessert. Later, once I\u0027d mastered rendezvous/dock, there was the orbital station \u0022Bill-n-Bob\u0027s All-Night Dessert Diner\u0022 with reusable landers \u0022Julep\u0022 and \u0022Key Lime\u0022. (Jeb had already claimed the Munar orbiting station and called it \u0022Jeb\u0027s Gas-n-Go\u0022, so once again Bill and Bob are copycat also-rans.)\u003C/p\u003E\u003Cp\u003EMun lander names include Eagle and Armstrong. (Mun seems to inspire me, rather than make me giggle...)\u003C/p\u003E\u003Cp\u003EEvery save also eventually gets a transfer/refueling/construction station in LKO, generally with some variation on the theme of \u0022Kerbin High Port\u0022.\u003C/p\u003E\u003Cp\u003EAnd of COURSE I have used \u0022Kerbpollo\u0022 (as does everyone).\u003C/p\u003E\u003Cp\u003EProject Red Planet is pretty self-explanatory.\u003C/p\u003E\u003Cp\u003EThat\u0027s about it for interesting names. The rest are either prosaically descriptive (like \u002220-ton Lifter\u0022) or express my frustration (\u0022Orbit or Bust V3c\u0022 was an early effort).\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-09-12T23:58:36Z","Content":"\n\u003Cp\u003EMine usually go alphabetically, so they\u0027re nicely sorted in the VAB.\u003C/p\u003E\u003Cp\u003EI\u0027ve done a fair few different categories, animals, birds, towns in Ireland, beers...\u003C/p\u003E\u003Cp\u003EThe beers program was especially ill-fated. Eventually Fosters 6 managed to land on the Mun without exploding, tipping over, or running out of power. How no Kerbals were lost in this alcohol-fuelled endeavour is completely beyond me! (The Budweiser program was swiftly abandoned because it was rubbish. The Coors program was only marginally more successful)\u003C/p\u003E\n"},{"CreatedByName":"GreeningGalaxy","CreatedById":66813,"CreatedDateTime":"2014-09-13T00:17:44Z","Content":"\n\u003Cp\u003EMy programs so far:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERockets\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EVela- The constellation depicting a sail, Vela has traditionally been the name for my long-range transit vehicle programs, starting with my first single-orange-tank missions to Eve and Duna and, since then, including vessels of all sizes designed to carry landers and bases to almost anywhere in the Kerbol system. The Vela program came up with my biggest heavy-lift launch vehicles to date, and nearly all of my current payloads use the Vela III or IV launch vehicle subassemblies.\u003C/p\u003E\u003Cp\u003EHermes- Mixing mythologies with Vela a little, the Hermes project began with my tinkerings with KSP Interstellar and consists of ships designed with roughly the same delta-V requirements as the Velas, but without the capability to carry landers around. Hermes ships are often relatively light and have enough TWR to land on most moons, and a KSPI Hermes was used in the first asteroid redirect missions in my game.\u003C/p\u003E\u003Cp\u003ESagittarius- My newest program using the Near Future Technologies mod, dedicated to the development of a very long-range transit vehicle designed to be reusable and fly multiple missions. Only two VASIMR-powered Sagittarii have flown so far; one is landed at Minmus with a nearly full fuel tank, while the other is on the surface of Vall, probably without enough fuel to return home.\u003C/p\u003E\u003Cp\u003EFornax- Named for the constellation of The Furnace. Fornax was my first serious launch vehicle and landing craft when I first started playing back in .19, and made my first landings on Minmus and the Mun, as well as serving as the Vela-dockable lander for my first excursions to Duna, Ike, Eve, and Gilly. By the time I figured out how to go to Dres or further, the old Fornax program had been replaced by the newer, but still very similar, Aquarius lander.\u003C/p\u003E\u003Cp\u003EArgus- Using the Vela launch vehicle and the majority of the same transit-vehicle spaceframe, the Argus program launched a very large and complex (at least by my standards) station, Argus One, into Kerbin orbit back in 0.22.\u003C/p\u003E\u003Cp\u003EUp Goer- Crap rockets that didn\u0027t start seriously but turned out to be interesting enough to save.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESpaceplanes\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESagitta- Included my first planes to get off the ground in the stock .19 game. Mostly were single-engine canard-configuration aircraft which eventually were fitted with parachute drop-probes to investigate the ocean and outlying islands near KSC. The name Sagitta is still sometimes used for small SSTOs in my current game.\u003C/p\u003E\u003Cp\u003EVolans- My first serious spaceplane project and the first to launch an SSTO into low Kerbin orbit in my first save. The first iterations were nothing more than beefed-up Aeris 4A ripoffs, but the latest versions included massive KSPI nuclear-powered behemoths.\u003C/p\u003E\u003Cp\u003EStormsprit- By far my largest spaceplane program, Stormsprit began with a VTOL fighter project before being repurposed into designing long-range SSTOs. All-stock Stormsprits have made visits to Eve and the Mun, and have landed on Duna, Minmus, and Gilly.\u003C/p\u003E\u003Cp\u003EKestrel- The Kestrel project made SSTOs that were designed not only to get to orbit, but to get there fast. They had higher TWRs than anything I\u0027d built previously, and typically attained speeds in excess of 2 kilometers per second before rocket handover. Kestrels had enough delta-V to make it to Minmus and back, but anything much further was essentially out of the question.\u003C/p\u003E\u003Cp\u003EI guess I haven\u0027t come up with many other names to use since then, so there we have it. All my new stuff is just recyclings of names I\u0027ve used for a long time. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-09-13T00:51:11Z","Content":"\n\u003Cp\u003EI name my programs after planets, whether they\u0027re stock or not. For example, the Mun program was for sub-orbital flights to get used to them. The Minmus program was for rendezvouing with a space station. The Sentar program was to reach the Mun and return.\u003C/p\u003E\n"},{"CreatedByName":"mdkendall","CreatedById":114550,"CreatedDateTime":"2014-09-13T02:52:51Z","Content":"\n\u003Cp\u003EI started off naming my ships after animals (mostly small mammals), then birds, but my imagination ran out so now I am just working my way through the NATO phonetic alphabet. The program gets the designator and the components have very literal names; Kilo Station comprises the Kilo Habitat Module, Kilo Science Module, Kilo Tugs, put in orbit by the Kilo 5-ton Launcher, and so forth.\u003C/p\u003E\n"},{"CreatedByName":"Lar-E","CreatedById":78160,"CreatedDateTime":"2014-09-13T12:20:58Z","Content":"\n\u003Cp\u003EMy ships are generally named after food for orbiters (Ham-n-Cheese I, Burrito Grande); or flightless birds for landers (Emu, Ostrich, Kiwi). My space program is called \u0027Foops\u0027; a contraction of the words \u0027Fudge\u0027* and \u0027Oops\u0027.\u003C/p\u003E\u003Cp\u003E*The word is not actually \u0027fudge\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-09-13T12:31:01Z","Content":"\n\u003Cp\u003EI show an unmatched creativity when it comes to mission and spaceship names.\u003C/p\u003E\u003Cp\u003EMissions to planets/moons get the name of the planet/moon together with [mission number] if manned or R[Mission number] if unmanned\u003C/p\u003E\u003Cp\u003ESimilarly for spaceship names.\u003C/p\u003E\u003Cp\u003ESpaceships usually get [Target Planet/Moon] appended by [Version Number] for manned or R[Version Number] for unmanned ships\u003C/p\u003E\n"}]}