{"TopicId":84434,"ForumId":70,"TopicTitle":"KSP 24.2 crashing on Mac with B9 Aerospace and NEAR","CreatedByName":"Teuthos_41","CreatedById":121508,"CreatedDateTime":"2014-09-12T15:55:42Z","PageNum":1,"Articles":[{"CreatedByName":"Teuthos_41","CreatedById":121508,"CreatedDateTime":"2014-09-12T15:55:42Z","Content":"\n\u003Cp\u003EI\u0027ve been trying, without success, to get B9 Aerospace working on Kerbal Space Program 24.2 on OS X Mavericks. Whenever I install B9 Aerospace and attempt to launch Kerbal Space Program, the launcher freezes on either a stock part or a NASA mission part. I\u0027ve had launcher freezes before on another computer so the problem is not limited to Mac OS X.\u003C/p\u003E\u003Cp\u003EI got to the error by:\u003C/p\u003E\u003Cp\u003E1. Reinstalling KSP (clear local content on Steam, install the game again).\u003C/p\u003E\u003Cp\u003E2. Downloading B9 Aerospace. In the file I downloaded, I have the following:\u003C/p\u003E\u003Cp\u003E README.md\u003C/p\u003E\u003Cp\u003E Ships\u003C/p\u003E\u003Cp\u003E Source\u003C/p\u003E\u003Cp\u003E changelog.txt\u003C/p\u003E\u003Cp\u003E GameData\u003C/p\u003E\u003Cp\u003EThe interesting thing is that Game Data has 10 folders and 1 file:\u003C/p\u003E\u003Cp\u003EB9_Aerospace_DEPRECATED\u003C/p\u003E\u003Cp\u003ECrossFeedEnabler\u003C/p\u003E\u003Cp\u003EFirespitter\u003C/p\u003E\u003Cp\u003EJSI\u003C/p\u003E\u003Cp\u003EKineTechAnimation\u003C/p\u003E\u003Cp\u003EKlockheed_Martian\u003C/p\u003E\u003Cp\u003EModuleManager.2.3.5.dll\u003C/p\u003E\u003Cp\u003EMP_Nazari\u003C/p\u003E\u003Cp\u003EResGen\u003C/p\u003E\u003Cp\u003ESmokeScreen\u003C/p\u003E\u003Cp\u003EVirgin Kalactic\u003C/p\u003E\u003Cp\u003EB9_Aerospace\u003C/p\u003E\u003Cp\u003EIn previous versions of KSP, there hasn\u0027t been nearly this much stuff in the file, but as per instructions on the 24.2 version, I merged everything with GameData and put the change log and readme files together with the Source and Ships folders into the main KSP directory. I have also tried only putting the B9_Aerospace into GameData, but without success.\u003C/p\u003E\u003Cp\u003EThe launcher froze and stopped loading at a stock engine part.\u003C/p\u003E\u003Cp\u003E3. I read somewhere in the comments of the Curse page for B9 Aerospace that you need NEAR and/or FAR installed together with it. I installed FAR, I managed to load the game. I installed B9 Aerospace, same thing as on my previous attempt, but the game froze on the grappling hook that comes with the NASA mission.\u003C/p\u003E\u003Cp\u003E4. I deleted the NASA mission parts completely and installed NEAR; game crashed with the \u0022spinning beach ball of death\u0022 that you get when programs crash on Macs.\u003C/p\u003E\u003Cp\u003E5. So now, having completely messed up my game directory, I just downloaded KSP again for the third time. What should I do to get B9 Aerospace to work with KSP 24.2?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-12T22:01:03Z","Content":"\n\u003Cp\u003EPlease follow the instructions in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003EREAD FIRST\u003C/a\u003E sticky; they will tell you where you can find the log we need to be able to help.\u003C/p\u003E\n"},{"CreatedByName":"kStrout","CreatedById":116630,"CreatedDateTime":"2014-09-12T22:08:06Z","Content":"\n\u003Cp\u003EI had the exact same problem just a few weeks ago. Try installing the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59005-0-24-Release-3-4-Active-Texture-Management-Save-RAM-without-reduction-packs!\u0022 rel=\u0022external nofollow\u0022\u003Etexture compression mod. \u003C/a\u003EIt performed wonders and then some for me, I now use B9 and interstellar as well as pretty much any other minor mod I want \u003Cem\u003Eon a laptop\u003C/em\u003E!\u003C/p\u003E\n"}]}