{"TopicId":84464,"ForumId":16,"TopicTitle":"Help with rescueing Jeb","CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-09-12T23:24:12Z","PageNum":1,"Articles":[{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-09-12T23:24:12Z","Content":"\n\u003Cp\u003EHe got his head stuck in a claw no probe core or capsule with a kerbal in it. I will need another kerbal there as I have 2 command pods on it but just Jeb is there.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-09-13T01:22:15Z","Content":"\n\u003Cp\u003EOnly Jeb...\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-09-13T02:45:00Z","Content":"\n\u003Cp\u003EI guess you\u0027ll have to send Bill out to man the command pod. Or edit the persistence file, but there may be unintended, unforeseeable side effects to that.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-09-13T04:37:18Z","Content":"\n\u003Cp\u003ENever trust Jeb or Bill in a ship by themselves. Always send Bob along or your just asking for trouble.\u003C/p\u003E\u003Cp\u003EJust send up another ship and rendezvous\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-09-13T06:39:46Z","Content":"\n\u003Cp\u003EJeb insists on being a part of pretty much every mission I send up ... even the single-pod rescues!\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-09-13T13:01:15Z","Content":"\n\u003Cp\u003EBut I can only rendezvous with planets and moons! I accepted a rescue contract and tried it I was going to use the claw to grab the stranded ship...\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-09-13T14:11:17Z","Content":"\n\u003Cp\u003EIt\u0027s not a ship that\u0027s stranded, it\u0027s an EVA Kerbal ... and you\u0027ll need to use [ or ] to switch, btw.\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-09-13T16:51:47Z","Content":"\n\u003Cp\u003EI know that I just can\u0027t get close I can get same orbit and stuff but I have only gotten with 2,000 kilometres of most bodies just enough to get captured I cannot get within 5000 metres.\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2014-09-13T23:29:57Z","Content":"\n\u003Cp\u003ENow would seem to be a good time to learn then. Rendezvous and docking is very useful in the game and not that hard to do once you\u0027ve figured it out. The basics are,\u003C/p\u003E\u003Cp\u003ESelect the object as a target in map view\u003C/p\u003E\u003Cp\u003EMatch orbital planes by burning north or south at the ascending or descending nodes.\u003C/p\u003E\u003Cp\u003EAdjust your orbit so that one part of it intersects the target orbit. \u003C/p\u003E\u003Cp\u003EIf the target is ahead you need to catch up to it so you want your orbit to be lower on the side opposite the intersection point,\u003C/p\u003E\u003Cp\u003EIf the target is behind you you want to slow down, so it catches up with you so you need your orbit to be higher than the target orbit on the side opposite the intersection point.\u003C/p\u003E\u003Cp\u003Eorbit until the predicted target position overtakes you then you can adjust your orbit to get a close approach. E.g- if the target position goes from 20km behind you to 20km in front of you you can raise your orbit with a prograde burn and the target position marker will wind back. Short engine burns and RCS should get you within a km or two.\u003C/p\u003E\u003Cp\u003EOn the next orbit make sure \u0022target\u0022 is selected above the navball and kill your speed relative to the target. Then it\u0027s just a matter of moving towards the target and lining up the target prograde and prograde markers on the navball using RCS or off axis engine thrust to push(or pull) the markers around and keeping an eye on your closing speed.\u003C/p\u003E\n"}]}