{"TopicId":84488,"ForumId":32,"TopicTitle":"Share Your Favorite Vessel Descriptions (tell a story through your rockets!)","CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2014-09-13T08:10:49Z","PageNum":1,"Articles":[{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2014-09-13T08:10:49Z","Content":"\n\u003Cp\u003EThe premise is simple: I love telling the story of my space program through the rocket descriptions feature, so I decided to tell it here. If you want to, tell us yours!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUp-o-Tron Ib\u003C/strong\u003E - a small unmanned pod (from AIES) I bolted onto the top of an SRB for my very first mission. Mainly so I could test the configs for deadly-reentry, KIDS, and FAR without risking the lives of any of my kerbonauts (I religiously play with no respawn, so once my kerbals are dead, they\u0027re dead). Because the module was unmanned, I forgot to attach an antenna and rendered it useless after launch (RemoteTech2 ftw), so I added two counter-balancing antennas on either side. It turns out that was a great design choice, since right after the SRB burned out one of the antennas was destroyed by (the as-yet improperly configured) deadly-reentry. Anyway, this was the start of my space program (in this save) so I wrote what I felt to be a suitable introduction:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EAfter discovering the properties of certain substances to burn very rapidly, some madmen decided that channeling the exhaust gasses down a hollow tube may result in said tube moving upward very fast. If they were some how able to slow it down enough to recover it for later use, however... Now with 33% less random loss of communication!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDeathtrap I\u003C/strong\u003E - The cheeky name I usually give to my early manned craft, since the lack of building options on the opening tier of play usually means there\u0027s exactly one type of rocket I can reliably build with my configuration of mods. It basically ended up being a manned version of the Up-o-Tron, so I could actually gather some science. Jebediah Kerman (of course) ended up being the first kerbal to be launched rocketwise into the air. He made it high enough that he could pop out on (a highly dangerous and actively discouraged by mission control) EVA to take a very brief report, pop back inside before the air got moving too fast again to take a crew report, and then collect some down-range sea water upon recovery. Between this and the missions I\u0027d run with the Up-o-Tron, I had enough science to research the next four nodes in one go.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EDemonstrating that going up is in fact remotely feasible, the Up-o-Tron paved the way for properly kerballed flight. The early machines devised in the drug addled fever dreams of KSP\u0027s brightest engineers earned its name when the administrative staff decided it should be constructed only from the cheapest, lowest grade aluminum available on the market.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMoho Ic\u003C/strong\u003E - It\u0027s at this point that I usually start getting serious with my rocket names. Moho is my equivalent of the Mercury program - an early effort to get ma^H^Hkerbals into space. I actually went through three sub-iterations of this model (I, Ib, and Ic) before I managed to pack enough fuel, thrust, and ISP to make (a *very* tentative 75km) orbit. Interestingly enough, none of the orange-shirts made it past an atmo-grazing sub-orbital trajectory (though Bill got very close to making orbit). It ended up being a silver shirt by the name of Kasper Kerman who stole the show by being the first kerbal in a stable orbit! Upon returning to kerbin, he stuck a flag in the ground to commemorate the spot where the first kerbal to risk it all by going into a stable orbit came home.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EWith naught but a single manned test flight confirming the ability of the kerman people to put one of their own in a metal trap with no means of escape or rescue in case things go wrong, the engineers decided to move forward with a larger-scale rocket to (hopefully) put a kerbal in orbit. The lack of safety mechanisms notwithstanding.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMoho II\u003C/strong\u003E - Which brings me to my current project, the Moho II. The goal of this mark is to push the envelope and take kerbalkind out past 100km. I haven\u0027t actually flown any of the Mk. II\u0027s yet, but I came up with this description to lay out what the end-goal of this design is:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EFollowing the success of the Moho I to put the first ever kerbal into orbit, engineers decided that MOAR BOO- erm, a more efficient design was necessary to push the envelope of what is possible for kerbal science. Placing a kerbal into orbit earned the public trust, which meant that to keep it more testing and safety was required. Under these conditions, the Chairman of the newly commissioned Board Of Outer Space Technicians, Explorators, and Research Scientists (BOOSTERS) commissioned the Moho II for launch in as early a timeframe as kermanly possible.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOkay, so that was me laying it all out. Now it\u0027s your turn! Talk a little bit about some of your favorite rockets and post their descriptions here for all to read. After all, isn\u0027t that what they\u0027re for? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2014-09-13T09:29:52Z","Content":"\n\u003Cp\u003EThose rocket descriptions are quite funny \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI usually don\u0027t tell a story in my rocket descriptions but I leave a note about the rocket design and what it\u0027s made for. Additionally I leave a changelog in the description, which can grow quite large with very old rockets.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-09-13T11:18:14Z","Content":"\n\u003Cp\u003EMinotaur 5. Like the NASA version, it looks much like the real one. Unlike the NASA one, the probe payload can land on Mun with enough fuel to return.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vAMu2fw.jpg\u0022 alt=\u0022vAMu2fw.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kz3WA4a.jpg\u0022 alt=\u0022kz3WA4a.jpg\u0022\u003E\u003C/p\u003E\n"}]}