{"TopicId":84514,"ForumId":69,"TopicTitle":"KSP Crashing with Pink Lines (21in iMac)","CreatedByName":"cnhoward","CreatedById":91667,"CreatedDateTime":"2014-09-13T17:06:09Z","PageNum":1,"Articles":[{"CreatedByName":"cnhoward","CreatedById":91667,"CreatedDateTime":"2014-09-13T17:06:09Z","Content":"\n\u003Cp\u003EHello All,\u003C/p\u003E\u003Cp\u003EThank you for taking the time to read my post and assess my issue. My mac (specs below) crashes when it is in use. The problem seems to present when under heavy graphics demand or under heavy processor demand. I have tried restarting dozens of times, unplugging, and running hardware diagnostics. When the computer crashes it shows pink lines on the screen and audio tends to loop. Please see images attached (from Kerbal Space Program.)\u003C/p\u003E\u003Cp\u003EAny Ideas,\u003C/p\u003E\u003Cp\u003EChris\u003C/p\u003E\u003Cp\u003E21.5in Late 2013\u003C/p\u003E\u003Cp\u003E2.7 GHZ Intel Core i5\u003C/p\u003E\u003Cp\u003E8gb Memory\u003C/p\u003E\u003Cp\u003EIntel Iris Pro Graphics\u003C/p\u003E\u003Cp\u003EOSX 10.9.4\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RRi2Euy.jpg\u0022 alt=\u0022RRi2Euy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4jTDPtK.jpg\u0022 alt=\u00224jTDPtK.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-09-13T22:23:24Z","Content":"\n\u003Cp\u003EPlease see the stickied topics. We\u0027ll need some more information, ideally a comprehensive list of system specifications and some log files.\u003C/p\u003E\n"},{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2014-09-13T23:54:05Z","Content":"\n\u003Cp\u003EIt could be that your hardware (specifically CPU, because of the iGPU) is, as you said, under heavy load. What also come with heavy load? Heat. The lines could be showing due to the CPU becoming hot. Not hot enough to kill the machine and force it to shutdown, but hot enough for your display to start showing some artefacts. Seeing as the audio is looping as well as the pink lines on screen, I would say that it is probably a heat problem. Try getting the mac someone colder, perhaps but a fan mat underneath it, or use it in an A.C room (if you have an A.C in a room, that is).\u003C/p\u003E\u003Cp\u003EHope this helps,\u003C/p\u003E\u003Cp\u003EToTheMun\u003C/p\u003E\u003Cp\u003EEDIT: Also, as vexx32 said, could you please get some log files up? Try uploading the log files to pastebin.com (its free with no signup), or if you have mediafire/dropbox or equivalent, upload them there than put the linkies on this here thread. Cheers.\u003C/p\u003E\n"}]}