{"TopicId":84525,"ForumId":39,"TopicTitle":"Kerbal Space Program Time Loops","CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-09-13T19:13:18Z","PageNum":1,"Articles":[{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-09-13T19:13:18Z","Content":"\n\u003Cp\u003EHere will be a collection of various stories and anecotes pertaining to the idea of Time Loops.\u003C/p\u003E\u003Cp\u003EFor infomation on looping, please refer to the following text block.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EWelcome to the multiverse! This is a booklet assembled by about a hundred and fifty Anchors from different worlds. We hope that all your questions about your new Looping self are answered by this, and feel free to add on any suggestions you think may be needed.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELoop\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EEvery individual time that one goes back in time. Each time you wake up back in time, you are in a new Loop. It can also refer to different worlds; for example, the world with the little green men called Kerbals would be referred to as the Kerbol loop.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELooping\u003C/strong\u003E (Verb):\u003C/p\u003E\u003Cp\u003EThe process of going back in time, and the process of turning up in a new loop. So occasionally, our example person Steve may occasionally loop into the world known as Examplia, (yes that is something I just made up) and he would be referred to as \u0022Looping Into\u0022 Examplia. Whoever has given this to you has looped in the past; he or she is a Looper, and you are a Looper.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYggdrasil\u003C/strong\u003E (Proper Noun):\u003C/p\u003E\u003Cp\u003EYggdrasil is the tree that is the Multiverse. All loops are, in a way, \u0022Branches\u0022 of Yggdrasil. It has recently suffered severe damage, but it has been contained; this is why Loops can happen.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAwake\u003C/strong\u003E (Noun/Verb):\u003C/p\u003E\u003Cp\u003ETo be Awake is to have memories of having gone back in time; that is, to have looped. People can Awaken before or after other people; for example, occasionally someone can awake many thousands of years in the past and rise to be Immortal God-Emperor of the Universe, at least until the next loop.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnchor\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EAlmost every known loop has at least one Anchor. The Anchor is usually the first to start Looping in a given loop. For example, I, the mysterious writer, am an Anchor. The Anchor for a loop is usually quite easy to work out; they\u0027re the one who\u0027s always Awake (or almost always, at least.) So, for example, relatively often the Anchor will be the only one awake.\u003C/p\u003E\u003Cp\u003EThe death of the last present Anchor within a certain period tends to instantly end the loop. A Looper intentionally causing this to end (\u0022crash\u0022) the loop early tends to land the perpetrator in a punishment loop. Sometimes beats the alternative of going along with a particularly awful loop, and the admins are understanding.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EReplace\u003C/strong\u003E (Verb):\u003C/p\u003E\u003Cp\u003ETo take the place normally occupied by another individual, looping or not. This includes if you have swapped places with a friend, for example, though it is normally used when the place your are occupying is in another loop.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFused Loop\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EThe term \u0022Fused\u0022 loop is somewhat fluid. The more general meaning is that it is any iteration of a loop where elements from more than one world - looping or not - are present. So, for example, a world where my world and yours were mixed might mean that I\u0027m there. It might mean that you\u0027re here. Or it might mean any possible combination of circumstances, people, and events from between our two worlds.\u003C/p\u003E\u003Cp\u003EThe more specific meaning is the middle one - where there are things \u003Cem\u003Eother than loopers\u003C/em\u003E from both worlds. Or from all three, or more.\u003C/p\u003E\u003Cp\u003EMost Loopers learn about the broader multiverse in one of their first fused loops; if you happen to ve reading this, you probably received it from someone in a fused loop. Feel free to stash a few copies in your subspace pocket (if you have one) to pass on the favor.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBaseline\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EThe events of the first run-through of a loop, and the events that tend to result with no outside interference. If, for example, your ome loop had none of its loopers awake, and I was a million light years away and never got any closer, then the events back at your home region would be baseline.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVariant\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EA loop that varies from baseline independently from the influence of Loopers. This could be as subtle as your friend having slightly different tastes as they do in baseline, or as blatant as everyone in the world changing species as gender. Most variants are fairly benign; roll with them and enjoy the variety. Occasionally, you may encounter a variant loop that seems fundamentally wrong; feel free to team up with anyone else Awake and fix it, as decisively as necessary.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdmin\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EThe Admins are the deities who run Yggdrasil and who are working to fix it. If you meet them directly, there are a few things to remember. First, they spend a substantial fraction of their existences working to keep you alive, so allow for that. Second, they are essentially gods of a power beyond anything you have. Yes, that includes you. And third, they \u003Cstrong\u003Edo\u003C/strong\u003E care about the worlds they run, so just try to stay on their good side. It\u0027s really just simple common courtesy.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHub\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EA universe that includes fiction of most other universes. Only occurs via fused loops; the Hub has no Loopers. If you find yourself in the Hub, you might want to take the opportunity to stock up on fiction, and to meet or interact with the authors of your own fictional universe.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFicton\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EWhile not always the case, fiction is often descriptions of other universes. Used as backups of those universes in others. Many older loopers have substantial collections of fiction, both for entertainment and as reference material in case they loop into those universes.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESakura Syndrome\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003ENamed after the unfortunate Sakura Haruno, who was the first documented case. Loopers with a case of Sakura Syndrome tend to focus on the fact that things are returned to their original state when a loop restarts, and begin to use this to their advantage. The stricter definition is that they begin to behave like this to other loopers - who are \u003Cem\u003Enot\u003C/em\u003E reset in this manner - while the less strict definition is simply that they exploit the loops to mistreat non-looping individuals.\u003C/p\u003E\u003Cp\u003EPeople with this problem tend to come about because they have become bored or apathetic as a result of the loops, and turn to one means or another to enjoy themselves. This becomes gradually more extreme over time. The process is not inevitable, but care should be taken.\u003C/p\u003E\u003Cp\u003ESufferers of Sakura Syndrome are unfortunate. They are also potentially dangerous, and as such I cannot guarantee your safety near them.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESetsuna Syndrome\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EThe opposite of Sakura Syndrome, named for Setsuna Meiou. This is the case when a Looper comes to believe that the events of the baseline are sacrosanct and must not be interfered with.\u003C/p\u003E\u003Cp\u003EThis is especially dangerous - and risky, both for the sufferer and others - when they are not the only one Awake. Sufferers of Setsuna Syndrome may get violent to preserve what they see as the true timeline, and they can easily bite off more than they can chew.\u003C/p\u003E\u003Cp\u003ESetsuna Syndrome, unlike Sakura Syndrome, has a known and reliable solution in that it results from a simple misconception. Admins can help to talk sufferers around if other measures have not sufficed.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESubspace Pocket\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EAn ability most loopers eventually develop. This is when a looper sets up a storage space in his or her soul, into wich objects may be placed. The size of the pocket grows with both time and your own personal discipline and power. These objects are carried between Loops, which is of course very useful.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPunishment Loop\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EYou may have had one of these. Don\u0027t worry, we all do. They\u0027re bland, often embarrassing, and unpleasant to be in, you tend not to have access to most of your normal abilities, and you probably ended up there after doing something stupid which backfired spectacularly.\u003C/p\u003E\u003Cp\u003EThese are usually quite stable places, where you\u0027re put while the admins fix whatever you damaged. Just grin and bear it - trying to end a punishment loop early doesn\u0027t end well.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVacation Loop\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EWhen a Looper doesn\u0027t feel like playing along with the current loop (whether baseline or not), they may choose to take a break. if the loop would tend towards some horrific atrocity without intervention, it\u0027s frowned upon to not make some arrangements, but otherwise, Loopers need a break once in a while.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEiken\u003C/strong\u003E (Proper Noun):\u003C/p\u003E\u003Cp\u003EThe most common punishment loop. A horrifically bland high-school setting, even by high-school setting standards, with wish fulfillment fantasy for the protagonist. You are not the protagonist.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EGeneration\u003C/strong\u003E (Noun/Adjective):\u003C/p\u003E\u003Cp\u003EGenerations of loopers are essentially groups who started looping at about the same time. For example, I started looping several thousand loops after some other worlds, but their anchors and I are considered to be of the same generation due to the massive number of loops that there have been.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFirst Generation\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003EThe loopers who started ooping first. All Anchors, all very powerful. Owing to calculation issues (they\u0027ve all lost count), it is unclear whether there are five or seven. The broader definition is: Ranma Saotome, Shinji Ikari, Harry Potter, Naruto Uzumaki, Lina Inverse, Usagi Tsukino and Ichigo Kurosaki. (Evidence exists that Ichigo is younger, but evidence that he is the same generation also exists. Usagi, meanwhile appears to have pretended that her friend Rei was the Anchor for a considerable time.)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPing\u003C/strong\u003E (Noun/Verb):\u003C/p\u003E\u003Cp\u003EA combination of several different abilities that only someone who has been to multiple universes could perform. You send a ping when you want to know if anybody else is Awake, and they (usually) ping back. However, you usually can\u0027t identify the source of a ping. Some loops, such as mine, have seperate ways of identifying Awake individuals. As with the subspace pocket, you may want to ask the person who gave you this booklet how to do this.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStealth Anchor\u003C/strong\u003E (Noun):\u003C/p\u003E\u003Cp\u003ESome Loopers prefer to hide themselves from other Loopers. In the rare case where a Fused Loop is almost identical to the Baseline of one loop, the Anchor for that loop is not Awake, and the Anchor from the other Loop stays hidden, the second Anchor is known as a Stealth Anchor. This results in what appears to be a Loop in which the Anchor is not Awake, which is otherwise impossible.\u003C/p\u003E\u003Cp\u003EThank you for reading this booklet. If you have any additions you feel should be made, feel free to make them and start distributing the updated copy. And, good luck!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EThere have been no Loops yet, and as such no loops have been the strangest.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, here\u0027s how it\u0027ll work. In the next post, I will put a few loops. Anyone who wants to contribute any Loops or loop ideas can feel free to just post them, along with any critique and comments. I will try to incorporate all the ideas, but do not be surprised if your idea does not make it into the next post after you posted it. It\u0027s very likely that I simply didn\u0027t have the time to put it in that set, so it will probably be in the next one.\u003C/p\u003E\u003Cp\u003EAs always, have fun reading!\u003C/p\u003E\n"},{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-09-13T19:30:48Z","Content":"\n\u003Cp\u003E1.1\u003C/p\u003E\u003Cp\u003ESomething felt... off. Jeb felt as if he\u0027d done this before, not too terribly long ago. As the rocket climbed higher and higher into the atmosphere, Jeb felt like he\u0027d lived this mission before. Of course, that was insane. It was probably just all the previous missions coming together in his mind. He shook it off and focused on the task ahead; a simple mission to repair a damaged satellite.\u003C/p\u003E\u003Cp\u003EHe gout out of the capsule. With his EVA jetpack, he carefully maneuvered to the satellite and removed the damaged plate. \u0022Seriously?\u0022 he said to himself. \u0022This is the exact same damage as last time I did something like this. I think I need to speak to the manufacturer...\u0022 he said as he checked the internal wiring. Removing the damaged wiring, he had a growing suspicion that he\u0027d lived this before. He plugged in the new wires and put a shiny new plate on the satellite, then flew back to his spacecraft.\u003C/p\u003E\u003Cp\u003EAs he streaked through the atmosphere, surrounded by the plasma fires of reentry, he mulled it over to himself. If he was living this again, how and why? He knew he\u0027d probably never know the why, so he instead focused on the how. In fact, he was so focused that he forgot to open the parachute. As the capsule fell towards the ocean, he was just thinking about how, if at all, he would be going back in time, anyway. He only noticed his error when he and the capsule disintegrated against the water.\u003C/p\u003E\u003Cp\u003E1.2\u003C/p\u003E\u003Cp\u003EJeb suddenly found himself back inside of the rocket capsule, flying up towards orbit. \u0022Is this what I think it is?\u0022 he said to himself a bit too loudly.\u003C/p\u003E\u003Cp\u003E\u0022What\u0027re you talking about, Jeb? This is just a satellite maintenance mission.\u0022 said Gene over the radio.\u003C/p\u003E\u003Cp\u003E\u0022Don\u0027t worry about it, Control. Just a bit of thinking out loud.\u0022 Jeb said, hoping to deter attention.\u003C/p\u003E\u003Cp\u003EHe again got out of the capsule and flew to the satellite. Removing the damaged plate, he looked at the pattern of holes. \u0022Again? The exact same?\u0022 he said. \u0022Something is seriously up.\u0022 Fixing up the satellite again, he went back into the pod and commenced the deorbit burn.\u003C/p\u003E\u003Cp\u003EWhen he finally touched down in the middle of the ocean with his capsule, Jeb waited for the rescue choppers. As soon as he was on board the ship sent to take him out of the water, he requested a direct flight to the space center.\u003C/p\u003E\u003Cp\u003EThirty minutes later, the small jet touched down at the KSC. As soon as it\u0027d stopped, Jeb jumped out and ran towards the mission controller.\u003C/p\u003E\u003Cp\u003E\u0022Excited to see me, Jeb?\u0022 asked Gene.\u003C/p\u003E\u003Cp\u003E\u0022Not quite, but I have something I need to talk about.\u0022 Jeb replied. He told him about his theory about how he was time travelling.\u003C/p\u003E\u003Cp\u003E\u0022Wow, Jeb. That\u0027s... insane. I think you need to go to the psychiatric ward.\u0022 said Gene.\u003C/p\u003E\u003Cp\u003EJeb sighed as he stared at the roof of his hospital room. He wasn\u0027t insane; he knew that. He thought back to all of his memories of all those terrible time travel films, and decided to try establish his situation. \u0022Let\u0027s see...\u0022 he said to himself. \u0022So apparently I\u0027m stuck in a loop through time, which means I get to live this same time over and over for all eternity.\u0022 He sighed again. \u0022Let\u0027s just wait it out, then. It\u0027s supposed to loop after a certain amount of time, anyway.\u0022\u003C/p\u003E\u003Cp\u003ESo he waited. He waited for almost three years before coming to the conclusion that it wasn\u0027t going to work out like that. Then he remembered, \u0022Well, when I died it reset me to the beginning, so...\u0022\u003C/p\u003E\u003Cp\u003EHe walked up to the top of the building and threw himself off.\u003C/p\u003E\u003Cp\u003E1.3\u003C/p\u003E\u003Cp\u003E\u0022Well.\u0022 Jeb said to himself as he Awoke in the rocket. \u0022That actually worked.\u0022 he said as the rocket climbed up through the stratosphere. He took a mental note on the fact that dying seemed to teleport himself back in time, and continued the loop. He did the satellite repair, and came down again. This time, however, he tried something different.\u003C/p\u003E\u003Cp\u003EInstead of telling anyone else about his situation, he simply wrote down the plan for something he\u0027d always wanted to try and showed it to Gene.\u003C/p\u003E\u003Cp\u003EThe massive vehicle stood on the Launch Pad. Inside it was thousands of small nuclear warheads, and on the said it said \u003Cem\u003EOrion\u003C/em\u003E. Jeb sat in the tiny command capsule on the top, dwarfed by the propulsion system. \u0022And go!\u0022 he shouted into the intercom right before he blew up half of Kerbin - and himself - by launching.\u003C/p\u003E\u003Cp\u003E(End of Loop set 1)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-13T22:33:52Z\u0022 title=\u002209/13/2014 10:33  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 13, 2014\u003C/time\u003E by Kerboman\u003C/strong\u003E\n\u003Cbr\u003EFinished the first set\n\u003C/span\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-09-13T21:38:26Z","Content":"\n\u003Cp\u003EThis looks interesting. Will this be some sort of collaborative story?\u003C/p\u003E\n"},{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-09-13T22:34:19Z","Content":"\n\u003Cp\u003EKinda, yeah. I\u0027ll write some myself and take up the ones written by others as well.\u003C/p\u003E\n"},{"CreatedByName":"dbmorpher","CreatedById":77927,"CreatedDateTime":"2014-09-13T23:17:48Z","Content":"\n\u003Cp\u003EWait is this just an elaborate etiological fiction to explain reverting to the VAB?\u003C/p\u003E\n"},{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-09-14T01:04:51Z","Content":"\n\u003Cp\u003EI guess you could call it that if that\u0027s how you want to look at it\u003C/p\u003E\n"},{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-09-14T03:21:18Z","Content":"\n\u003Cp\u003EMore loops tomorrow morning\u003C/p\u003E\n"},{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-09-14T19:52:47Z","Content":"\n\u003Cp\u003E2.1\u003C/p\u003E\u003Cp\u003EThis was Jeb\u0027s tenth loop.\u003C/p\u003E\u003Cp\u003EHe let that sink in for a minute. He\u0027d gone through this same little bubble of time ten times. This definitely called for something special; Jeb decided he was going to go on a bit of an adventure.\u003C/p\u003E\u003Cp\u003E\u0022What do you mean, you quit?\u0022\u003C/p\u003E\u003Cp\u003E\u0022I mean that I\u0027m done. I want to see the world, not just the space.\u0022 said Jeb to the bewildered kerbal who was running the Astronaut Complex.\u003C/p\u003E\u003Cp\u003E\u0022Well, then you\u0027re free to go, I guess...\u0022 said the receptionist.\u003C/p\u003E\u003Cp\u003EJeb stood at the top of the tallest mountain on Kerbin, breathing through his oxygen mask. \u0022I wonder why I didn\u0027t do this more often?\u0022 he asked himself as he planted the flag and climbed back down.\u003C/p\u003E\u003Cp\u003EHe walked through the dense forest and looked for where he had left his car; as he wandered around, he saw it lying on its side in the middle of a meadow.\u003C/p\u003E\u003Cp\u003E\u0022Seriously?\u0022 he said to himself as he began the long trek back.\u003C/p\u003E\u003Cp\u003EWhen he finally arrived at his house again a year later, Jeb simply collapsed on the couch. \u0022Remind me to never do that again,\u0022 he said to himself.\u003C/p\u003E\u003Cp\u003E2.2\u003C/p\u003E\u003Cp\u003E\u0022Hey Jeb?\u0022 Bill asked.\u003C/p\u003E\u003Cp\u003E\u0022Yeah?\u0022\u003C/p\u003E\u003Cp\u003E\u0022You notice anything weird?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Like what?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Like, going back through time and stuff?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Wait, it\u0027s happening for you, too?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well, yeah. This is like the second time it\u0027s happened.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Huh. I\u0027m on my twelfth, about.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Huh.\u0022\u003C/p\u003E\u003Cp\u003E2.3\u003C/p\u003E\u003Cp\u003EJeb had seen many things in his life. He\u0027d been prepared for many things, ready to face many tasks.\u003C/p\u003E\u003Cp\u003EThis was not one of them.\u003C/p\u003E\u003Cp\u003EHe was currently hiding behind a table as balls of fire and ice flew back and forth across the room.\u003C/p\u003E\u003Cp\u003E\u0022Where\u0027s the fourth guy? There\u0027s supposed to be a fourth guy!\u0022 shouted someone out in the room.\u003C/p\u003E\u003Cp\u003E\u0022They\u0027re probably a new looper. I wouldn\u0027t be surprised, this would be a bit overwhelming for a first fused loop.\u0022 said another voice, this one more feminine.\u003C/p\u003E\u003Cp\u003E\u0022Check behind the table, they usually hide back there.\u0022 said a third voice, this one deep and masculine.\u003C/p\u003E\u003Cp\u003EJeb heard the sound of footsteps approaching, then some.... thing appeared around the corner.\u003C/p\u003E\u003Cp\u003E\u0022Oh, hi! You must be the new guy!\u0022 shouted the feminine voice.\u003C/p\u003E\u003Cp\u003EJeb just looked there in shock. It was a tall, Kerbaloid creature, with weird things protruding out each side of its head and sticking up, and with long golden hair dripping down.\u003C/p\u003E\u003Cp\u003E\u0022Well? Are you just going to stand there or tell me your name?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Uhhh.... my name\u0027s Jeb. What are you?\u0022 Jeb barely managed to ask.\u003C/p\u003E\u003Cp\u003E\u0022Oh, I\u0027m an elf! That short guy over there -\u0022 that earned her a \u0022Hey!\u0022 from the deep voice - \u0022is a dwarf, and that other guy is just a regular human. Anyway, welcome to the Dungeons, and the greater multiverse! I\u0027d give you the whole welcome talk, but we\u0027re really short on time, so take this booklet instead.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Er... Thanks. Anyway, do you know what I\u0027m supposed to do?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well, you\u0027re a Barbarian from the looks of it, so go pick up that axe over there and break through those goblins.\u0022\u003C/p\u003E\u003Cp\u003EJeb picked up the axe that was almost as tall as he was, and very clumsily ran to the center of the goblin horde and started swinging it around randomly.\u003C/p\u003E\u003Cp\u003E\u0022Yeah, definitely a new Looper,\u0022 said the human to the dwarf.\u003C/p\u003E\u003Cp\u003E2.4\u003C/p\u003E\u003Cp\u003E\u0022Jeb, you sure you want to do this?\u0022 Bill asked over the intercom.\u003C/p\u003E\u003Cp\u003E\u0022It\u0027ll be fine, don\u0027t worry,\u0022 Jeb said as he checked his wingsuit.\u003C/p\u003E\u003Cp\u003E\u0022Well, good luck.\u0022 Bill said with a bit of resignation in his voice.\u003C/p\u003E\u003Cp\u003EA small shape dropped from the helicopter, and started gliding towards the surface.\u003C/p\u003E\u003Cp\u003EJeb noticed that he was falling a bit fast. In fact, about seventy meters per second too fast. \u0022Oh -\u0022 he said as he smashed into the ground at half mach speed.\u003C/p\u003E\u003Cp\u003E2.5\u003C/p\u003E\u003Cp\u003EJeb awoke in a bland-looking high school.\u003C/p\u003E\u003Cp\u003E\u0022Oh Kerbol no, this must be one of those punishment loops that booklet talked about.\u0022\u003C/p\u003E\u003Cp\u003EHe then prepared himself for the most boring ride of his life.\u003C/p\u003E\u003Cp\u003E2.6\u003C/p\u003E\u003Cp\u003EJeb Awoke in a normal enough seeming Loop. After he\u0027d read that little instruction manual, he felt a lot less frightened by the coming eternity. After all, there were quite literally infinite loops that could happen, so he\u0027d probably never get bored! And just as he finished that thought, a plane came crashing into the Space Center.\u003C/p\u003E\u003Cp\u003EEmperor Kerby Kerman stood on the balcony of his giant evil tower thing, watching the world succumb to his rule. It wasn\u0027t long before someone stated to him, \u0022The Space Center has been eliminated, but Subject Jeb is nowhere to be found!\u0022\u003C/p\u003E\u003Cp\u003EThe Emperor slammed his fist on the desk. This was supposed to be easy! Where\u0027d it all gone wrong? Actually, he could probably pinpoint that pretty easily. It was probably when he\u0027d accidentally destroyed half of Kerlington in a police chase.\u003C/p\u003E\u003Cp\u003EJeb suddenly remembered things that never happened to him. Apparently he was the head of a secret rebel organization that was fighting against the evil Kerby Kerman. He had to suppress a laugh at that name; he\u0027d seen some odd names in his day, but none like that. He was also apparently supposed to be raiding some secret supply cache to provide the rebels arms. Jeb sighed and went along with it.\u003C/p\u003E\u003Cp\u003EONE MONTH LATER\u003C/p\u003E\u003Cp\u003EJeb hid behind a burning car as suppressive fire flew down the street. He poked his head up over the car and took another potshot at the government troops. He thought he was dead when he heard the drumming of twin rotors above him, but was relieved to find that instead it was just Bob, who was in fact Awake this loop, gunning down the troops with his little gunship. He then flew away, saying something on the radio about fighter cover and needing to look inconspicuous, but motioned to Jeb to push on down the street. He dashed out from behind the car and sprinted into a damaged building as two fighters flew in formation overhead. He then saw the tank round the corner. Swearing, he dived into cover behind a desk moments before the front of the building exploded in a ball of fire. He took the opportunity presented by the lingering smoke to run through the building out to the back...\u003C/p\u003E\u003Cp\u003E...and come face to face with a squad of five government soldiers. Jeb tried to duck into cover behind a dumpster, but felt a sharp pain as a bullet hit his leg. He did make it to the cover, however, and started shooting at the soldiers. After they were neutralized, he quickly wrapped a bandage around his leg and called for support. Almost half the entire friendly force in the city (about twenty kerbals) immediately started running over to his position. He waited patiently for them to arrive before allowing them to pick him up and drag him into a building.\u003C/p\u003E\u003Cp\u003ERemember to submit ideas for whatever loops you want to see!\u003C/p\u003E\u003Cp\u003EAlso, if you have any suggestions, or want to pick a candidate for Weirdest Loop, post them!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-14T22:32:31Z\u0022 title=\u002209/14/2014 10:32  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 14, 2014\u003C/time\u003E by Kerboman\u003C/strong\u003E\n\u003Cbr\u003Efixing broken/terrible loops or reordering loops to make more sense\n\u003C/span\u003E\n"}]}