{"TopicId":84562,"ForumId":70,"TopicTitle":"How do I tell in a save file which part of a craft has control or SASS enabled?","CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-14T07:11:41Z","PageNum":1,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-14T07:11:41Z","Content":"\n\u003Cp\u003EHere is a short and simple file from a nearly vanilla KSP. \u003Ca href=\u0022http://m.uploadedit.com/b039/1410677933105.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://m.uploadedit.com/b039/1410677933105.txt\u003C/a\u003E The only mods installed are KAS, MechJeb, HyperEdit and Blizzy\u0027s toolbar.\u003C/p\u003E\u003Cp\u003EThe Clampotron shown as docker has control from here set and I never set that on the dockee port - but I can\u0027t see what designates which port has control. If control is set to an RGU, command pod, probe body or other part with Command capability, what designates that attribute?\u003C/p\u003E\u003Cp\u003EI have another save on a much modded install that has apparently become \u0027confused\u0027 and managed to get at least two command/control parts with control from here active and/or SASS active. Right clicking any of the docking ports or RGUs (there are no command pods or probe bodies on it) and setting Control From Here has no effect. SASS shows as being OFF when I right click on every port and RGU and set control to it.\u003C/p\u003E\u003Cp\u003EIf I can edit the quicksave and save this, that will be very nice.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-14T21:35:04Z","Content":"\n\u003Cp\u003EI\u0027m not even sure that a set \u0022control from here\u0022 *does* persist.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-15T03:23:50Z","Content":"\n\u003Cp\u003ESomething persists because when reloading a quicksave or resuming using the persistent file, the part that had control when KSP was quit still has control.\u003C/p\u003E\u003Cp\u003EQuestion is where is that data kept?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-09-15T03:42:37Z","Content":"\n\u003Cp\u003EIt would have to be in the craft data somewhere, but... I can\u0027t say I can recall ever seeing such a thing.\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-09-15T04:01:26Z","Content":"\n\u003Cp\u003EIn the VESSEL node, it\u0027s \u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003Eref = \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003EPart UID\u003C/span\u003E\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-15T06:11:19Z","Content":"\n\u003Cp\u003Euid is the unique identifier. Doesn\u0027t tell if the part has overall control of the craft.\u003C/p\u003E\u003Cp\u003EI just had a line by line look at both docking ports in my test persistent file where one is set to control from here and the other has never been set to that. I don\u0027t see anything different aside from the uid, rotation and temperature data, one is labeled dockee, the other docker, and near the bottom of one the word probe has been appended to the vessel name.\u003C/p\u003E\u003Cp\u003EGah. Why couldn\u0027t they have simply used something like HasControl = True/False for docking ports, RGU\u0027s, probe bodies, command pods etc? Simple and easy to troubleshoot.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-09-15T06:55:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galane\u0022 data-cite=\u0022Galane\u0022\u003E\u003Cdiv\u003Euid is the unique identifier. Doesn\u0027t tell if the part has overall control of the craft.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, he\u0027s correct.\u003C/p\u003E\u003Cp\u003Eref is set to the uid of the part that has control.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBehold:\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI created a simple craft with a lander cabin and a docking port. (see PART excerpts below) When the cabin has been \u0027controlled from\u0027 then\u003C/p\u003E\u003Cp\u003Eref = 785815967\u003C/p\u003E\u003Cp\u003EBut when I do it from the port\u003C/p\u003E\u003Cp\u003Eref = 3152140321\u003C/p\u003E\u003Cp\u003EIt\u0027s not actually possible for multiple parts to have control. In fact control from only tells the game what transform to use as a reference for \u003Cem\u003Exyz\u003C/em\u003E axes. That\u0027s all it does and it looks at the vessel, queries it for a part to retrieve a transform from and if necessary queries the part (in case it has a control transform which is different from its root transform, which is the case for some docking ports like the lateral one)\u003C/p\u003E\u003Cp\u003EAs to your other question about SAS, look at the VESSEL\u0027s ACTIONGROUPS section. SAS is set to True or False depending on if the vessel\u0027s SAS is turned on. SAS is not enabled or disabled on a part by part basis, unlike reaction wheels. (it\u0027s probably possible to do so but there\u0027s no functionality to disable them built into them )\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E\t\t\tPART\u003Cbr\u003E\t\t\t{\u003Cbr\u003E\t\t\t\tname = mk2LanderCabin\u003Cbr\u003E\t\t\t\tuid = 785815967\u003Cbr\u003E\t\t\t\tmid = 1801472474\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E\t\t\tPART\u003Cbr\u003E\t\t\t{\u003Cbr\u003E\t\t\t\tname = dockingPort2\u003Cbr\u003E\t\t\t\tuid = 3152140321\u003Cbr\u003E\t\t\t\tmid = 1801472474\u003Cbr\u003E...\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-15T07:09:30Z","Content":"\n\u003Cp\u003ELearn something e\u0027ry day! Thanks, Master Tao and Starwaster. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-15T07:31:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003ENo, he\u0027s correct.\u003Cp\u003Eref is set to the uid of the part that has control.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EBehold:\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI created a simple craft with a lander cabin and a docking port. (see PART excerpts below) When the cabin has been \u0027controlled from\u0027 then\u003C/p\u003E\u003Cp\u003Eref = 785815967\u003C/p\u003E\u003Cp\u003EBut when I do it from the port\u003C/p\u003E\u003Cp\u003Eref = 3152140321\u003C/p\u003E\u003Cp\u003EIt\u0027s not actually possible for multiple parts to have control. In fact control from only tells the game what transform to use as a reference for \u003Cem\u003Exyz\u003C/em\u003E axes. That\u0027s all it does and it looks at the vessel, queries it for a part to retrieve a transform from and if necessary queries the part (in case it has a control transform which is different from its root transform, which is the case for some docking ports like the lateral one)\u003C/p\u003E\u003Cp\u003EAs to your other question about SAS, look at the VESSEL\u0027s ACTIONGROUPS section. SAS is set to True or False depending on if the vessel\u0027s SAS is turned on. SAS is not enabled or disabled on a part by part basis, unlike reaction wheels. (it\u0027s probably possible to do so but there\u0027s no functionality to disable them built into them )\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E\t\t\tPART\u003Cbr\u003E\t\t\t{\u003Cbr\u003E\t\t\t\tname = mk2LanderCabin\u003Cbr\u003E\t\t\t\tuid = 785815967\u003Cbr\u003E\t\t\t\tmid = 1801472474\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E\t\t\tPART\u003Cbr\u003E\t\t\t{\u003Cbr\u003E\t\t\t\tname = dockingPort2\u003Cbr\u003E\t\t\t\tuid = 3152140321\u003Cbr\u003E\t\t\t\tmid = 1801472474\u003Cbr\u003E...\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould you please have a look at the save files I linked \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/12384-PART-0-24-2-Anatid-Robotics-MuMech-MechJeb-Autopilot-v2-3-1?p=1413477\u0026amp;viewfull=1#post1413477\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/12384-PART-0-24-2-Anatid-Robotics-MuMech-MechJeb-Autopilot-v2-3-1?p=1413477\u0026amp;viewfull=1#post1413477\u003C/a\u003E and see if you can determine WTH is fouled up with them that is causing the craft to act as if it is defying the rule about one and only one part being the one to have control?\u003C/p\u003E\u003Cp\u003EI tried the ship again just now and this time after I relocated the first lander converter it went twisting around on two axes at an ever accelerating speed, to the point where parts started to fly off. This is a massive craft that is just not possible to make spin that fast when all is well. At least it was a different result from the twitching or gentle oscillation and unresponsiveness to controls I was getting before.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-09-15T08:21:04Z","Content":"\n\u003Cp\u003EUgh, no small task here.... which is it, Eve-Rover-C2a?\u003C/p\u003E\u003Cp\u003EDon\u0027t see anything wrong there but it sounds like phantom forces. Does it do it with no control inputs? MJ SmartAss turned off, SAS off?\u003C/p\u003E\u003Cp\u003EI wish I could fire it up and see what\u0027s happenign but you have too many mods that I dont have installed....\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-15T21:07:14Z","Content":"\n\u003Cp\u003EThere\u0027s only one vessel in that save. It should only require Kethane and ReStock Reloaded. The part that requires KAS and Hooligan Labs Airships is the Eve lander, which isn\u0027t in flight.\u003C/p\u003E\u003Cp\u003EI could try it without the MechJeb module manager patch and install some AR202 boxes. Would have to put at least four on it.\u003C/p\u003E\u003Cp\u003ENo control inputs, SAS and SASS are off.\u003C/p\u003E\u003Cp\u003EThe craft \u003Ca href=\u0022http://m.uploadedit.com/b039/1410814799517.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://m.uploadedit.com/b039/1410814799517.txt\u003C/a\u003E Launch procedure is to liftoff normally then set TAC to balance all fuel and oxidizer after the core Kerbodynes drop. Then in orbit transfer all into the ThunderMaximus. For testing, drop the two side boosters without docking ports.\u003C/p\u003E\u003Cp\u003EAll goes well to then. Decouple one of the lander converters at the top and dock it to the out-facing port on one of the side boosters, force roll to 0 degrees. That\u0027s when it goes wonky to varying degrees from simply no longer responding to manual or SASS control inputs to wobbling back and forth some to turning into a whirling dervish.\u003C/p\u003E\u003Cp\u003EThe prior revision had a kethane tank on the rover that was 2x the height and I had the docking ports on the Gilly lander parts in various directions which required using docking force roll settings of 90, 180 or 270 degrees, depending on which pairs were going together. But no control issues!\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-09-15T22:52:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galane\u0022 data-cite=\u0022Galane\u0022\u003E\u003Cdiv\u003EThere\u0027s only one vessel in that save. It should only require Kethane and ReStock Reloaded. The part that requires KAS and Hooligan Labs Airships is the Eve lander, which isn\u0027t in flight.\u003Cp\u003EI could try it without the MechJeb module manager patch and install some AR202 boxes. Would have to put at least four on it.\u003C/p\u003E\u003Cp\u003ENo control inputs, SAS and SASS are off.\u003C/p\u003E\u003Cp\u003EThe craft \u003Ca href=\u0022http://m.uploadedit.com/b039/1410814799517.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://m.uploadedit.com/b039/1410814799517.txt\u003C/a\u003E Launch procedure is to liftoff normally then set TAC to balance all fuel and oxidizer after the core Kerbodynes drop. Then in orbit transfer all into the ThunderMaximus. For testing, drop the two side boosters without docking ports.\u003C/p\u003E\u003Cp\u003EAll goes well to then. Decouple one of the lander converters at the top and dock it to the out-facing port on one of the side boosters, force roll to 0 degrees. That\u0027s when it goes wonky to varying degrees from simply no longer responding to manual or SASS control inputs to wobbling back and forth some to turning into a whirling dervish.\u003C/p\u003E\u003Cp\u003EThe prior revision had a kethane tank on the rover that was 2x the height and I had the docking ports on the Gilly lander parts in various directions which required using docking force roll settings of 90, 180 or 270 degrees, depending on which pairs were going together. But no control issues!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou also have quantum struts on it.\u003C/p\u003E\u003Cp\u003EAlso tweakscale. What happens if I don\u0027t have that; are those parts scaled? What happens if TweakScale suddenly goes missing, do they revert?\u003C/p\u003E\u003Cp\u003EAnyway I\u0027m really thinking this is phantom forces. Collision meshes overlapping or unstrutted masses in places that looks bad to Unity and looks fine to us.\u003C/p\u003E\u003Cp\u003EBottom line: you turn off SAS entirely? No mechjeb inputs? It\u0027s shaking itself to pieces. If you look at the inputs are they totally null? That\u0027s phantom forces\u003C/p\u003E\u003Cp\u003ERead this story:\u003C/p\u003E\u003Cp\u003EI had Kethane installed (quite a few KSP versions back, old story)\u003C/p\u003E\u003Cp\u003EI sent a refinery station to Minmus and assembled it in sections. One of Zzz\u0027s geodesic dome things, hubs, Fustek parts and a bunch of converters and large Kethane tanks attached radially to a central core. I did not strut the kethane tanks. All was fine until my mining ship had deposited about 3 loads. On the third delivery, the station began violently wobbling as the kethane tanks picked up mass. The station tore itself to pieces. It took me a few quickloads to get to a point where I could undock the entire faulty tank section so my station tug could get it to minimum safe distance.... Things have improved since then now that we have reinforced joints in stock, but you say this starts when you decouple part of the vessel? Is anything strutted across those sections? If the answer is yes then... phantom forces.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-16T00:31:39Z","Content":"\n\u003Cp\u003EOh, forgot about the quantum struts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E On this there are some 6x1 solar panels scaled up. The problem begins *after* docking.\u003C/p\u003E\u003Cp\u003EBefore I uncouple one of the parts all is fine. The ports were put together on top of the ship, the lander converter assembled atop that then the ports and all grabbed and moved to mount radially in 2x symmetry. (Would be much easier if ports could be attached face to face radially then more parts attached to the outer port.)\u003C/p\u003E\u003Cp\u003EIt\u0027s all fine after decoupling. I can control both sections.\u003C/p\u003E\u003Cp\u003EThere are quantum struts bridging the port pairs. I don\u0027t turn them off. Never have had this problem before with them, I\u0027ve built several rockets using those struts as reinforcement to radially and axially docked parts. I\u0027d use the Strut Guns but they don\u0027t release on Decouple Node, only on Undock.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-16T00:50:27Z","Content":"\n\u003Cp\u003EThis is what I need to assemble\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/p91Dfm\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm4.staticflickr.com/3916/15186862932_2433fc5108_z.jpg\u0022 alt=\u002215186862932_2433fc5108_z.jpg\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://flic.kr/p/p91Dfm\u0022 rel=\u0022external nofollow\u0022\u003Escreenshot36\u003C/a\u003E by \u003Ca href=\u0022https://www.flickr.com/people/27748767@N08/\u0022 rel=\u0022external nofollow\u0022\u003Eg_alan_e\u003C/a\u003E, on Flickr\u003C/p\u003E\u003Cp\u003EThat lander docked to the side of the core\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/oRxQaf\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm6.staticflickr.com/5583/15000567680_7f5df5c9bd_z.jpg\u0022 alt=\u002215000567680_7f5df5c9bd_z.jpg\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://flic.kr/p/oRxQaf\u0022 rel=\u0022external nofollow\u0022\u003Escreenshot34\u003C/a\u003E by \u003Ca href=\u0022https://www.flickr.com/people/27748767@N08/\u0022 rel=\u0022external nofollow\u0022\u003Eg_alan_e\u003C/a\u003E, on Flickr\u003C/p\u003E\u003Cp\u003EThe last *successful* test. Moved pieces from port to port a few times, no problem.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/p7TDPw\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm6.staticflickr.com/5590/15174182576_9a1f7d35c3_z.jpg\u0022 alt=\u002215174182576_9a1f7d35c3_z.jpg\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://flic.kr/p/p7TDPw\u0022 rel=\u0022external nofollow\u0022\u003Escreenshot32\u003C/a\u003E by \u003Ca href=\u0022https://www.flickr.com/people/27748767@N08/\u0022 rel=\u0022external nofollow\u0022\u003Eg_alan_e\u003C/a\u003E, on Flickr\u003C/p\u003E\u003Cp\u003EI\u0027d still have to undock the Eve lander to pull the stack of the Rockomax X16, RCS tank and docking port from between it and the rover. So I had the idea to swap out a Kethane tank 1/2 the size on the rover and launch this with two Gilly lander center sections stacked on top, with the lander converters coupled to each side of one of those, same as before. I also added decouplers to drop the big engines off the lander.\u003C/p\u003E\u003Cp\u003EThe idea being to relocate the center pieces to the sides of the big tank, each with a scanner satellite below it, then move the converters again to the other two ports on the big tank. At Gilly one of the center sections will be discarded, it was only there for balance and to hold a bit more fuel.\u003C/p\u003E\u003Cp\u003EI have a save (IIRC the one I uploaded on the MechJeb thread) where I did get the lander assembled *on top* of the rover in Gilly orbit. Then I updated to MechJeb 319 and that\u0027s when the trouble began. I decoupled the lander (with the spare center on below to dump it and the engines onto Gilly) and Landing Guidance managed to crash it into the core*. So I reloaded and after decoupling - that was it. Unable to control anything. Reloaded again and couldn\u0027t control before decoupling.\u003C/p\u003E\u003Cp\u003E*Notes that the small forces from decoupling VAB assembled docking ports will put ships in 50KM Gilly orbit on an escape trajectory.\u003C/p\u003E\u003Cp\u003ESo I\u0027ve tried several times in Kerbin orbit and can only control the ship until I do one decouple then docking. Tried it in a new save too. Tried deleting MechJeb\u0027s configuration files it creates.\u003C/p\u003E\u003Cp\u003ENext step, I\u0027ll try a KSP setup with only the mods this craft uses and see if it has the phantom forces. Need to find and kill that phantom...\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-09-16T08:39:51Z","Content":"\n\u003Cp\u003EFinally figured it out. For some reason KSP suddenly decided that Quantum Struts mounted on Oscar B fuel tanks shall be treated as if they are mounted on or aimed at a \u0022massless\u0022 part.\u003C/p\u003E\u003Cp\u003ENo idea why, they had worked there just fine from the day I first built those things to assemble a huge lander for Gilly. I also note that this behavior *may* in some screwy way be related to \u0022launching\u0022 with Hyperedit, now that I recall that previous tests had been warped to Gilly orbit *after* a normal launch during R\u0026amp;D of the all-together core.\u003C/p\u003E\u003Cp\u003EBefore I got that figured out, I did more testing, changing which side of the port pairs I right clicked to decouple. Made no difference. Then I noticed that movements of the second one were acting as though it was still connected to the main ship and jerking it around like a pitbull on a leash.\u003C/p\u003E\u003Cp\u003E\u0022Ahha!\u0022 I thought. \u0022Must be something to do with Quantum Struts going \u003Cem\u003Eboth ways\u003C/em\u003E across the docking ports.\u0022 So I set two action groups to deactivate and activate every strut mounted on the converters and on the main ship that touched them. So, turn them off, move one converter, turn them on and try to change orientation with SASS. No go and quite a lurch when turning them off. Hmmmmm.\u003C/p\u003E\u003Cp\u003ESo I completed lander assembly with them off and warped to Gilly. Separated the lander and turned the struts on again. \u0022Oh now What The \u0026lt;bleep\u0026gt;! There are no massless parts on this thing!\u0022 Turned off only the struts mounted on the Oscar B tanks and it\u0027s fine. Landed good, filled up and returned to orbit. No flex in the girders under the load - so off they go! Four fewer parts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-16T20:28:07Z\u0022 title=\u002209/16/2014 08:28  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 16, 2014\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-09-16T10:37:36Z","Content":"\n\u003Cp\u003EYeah, never trusted Quantum Struts. Also didn\u0027t think they fit in thematically so another reason why Starwaster stayed away from them...\u003C/p\u003E\n"}]}