{"TopicId":84706,"ForumId":44,"TopicTitle":"CCiCap was announced, SpaceX and Boeing were selected","CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2014-09-16T00:15:05Z","PageNum":6,"Articles":[{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-09-16T22:19:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EBoeing got more because they asked for more. That\u0027s genuinely it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, standard then you do do an tender, downside of putting the bill to high is that you might be dropped.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-09-16T22:35:04Z","Content":"\n\u003Cp\u003EWell, we started with capsules. Then we tried to move to winged, reuseable shuttles. It did not work out, so we reverted back to capsules. Not much of a progress there. It\u0027s like our ancestors decided to scuttle sailing boats and go back to using only paddle-driven canoes - just because you can always paddle, while wind does not blow all the time. Later the same happened with steam engines: Wind was free, while coal had to be mined and carried along, cutting into cargo capacity. And then internal combustion engines appeared: Coal was cheap and plentiful, while oil had to be drilled in far away lands, distilled and carefully stored. Looks like technological inertia and cosnservatism are worse enemies of progress than lack of money.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-16T22:39:06Z","Content":"\n\u003Cp\u003EIt\u0027s more like going to predominately aeroplanes, then airships, then aeroplanes again. Winged spacecraft are an expensive dead-end, even RLV groups have abandoned them en masse.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-09-16T22:50:28Z","Content":"\n\u003Cp\u003EI don\u0027t have much of a problem with capsules for getting to and from LEO. They\u0027re small and relatively cheap, and above all they\u0027re a proven technology. Reusable SSTOs would be more efficient for the role, but I\u0027m okay to wait until Skylon is up and running.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-09-16T22:54:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DigitalProeliator\u0022 data-cite=\u0022DigitalProeliator\u0022\u003E\u003Cdiv\u003EWhat Im suspecting is that Boing had the political pressure (dont tell me you didnt see the politics in the briefing)but they have a habit of going over budget and deadline on government contracts\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoeing was the only company in CCiCap to meet all of the milestones in time and within budget.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mitchz95\u0022 data-cite=\u0022Mitchz95\u0022\u003E\u003Cdiv\u003EI don\u0027t have much of a problem with capsules for getting to and from LEO. They\u0027re small and relatively cheap, and above all they\u0027re a proven technology. Reusable SSTOs would be more efficient for the role, but I\u0027m okay to wait until Skylon is up and running.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it ever is running. And that\u0027s a huge if.\u003C/p\u003E\n"},{"CreatedByName":"gbleck","CreatedById":116242,"CreatedDateTime":"2014-09-16T23:06:48Z","Content":"\n\u003Cp\u003EI belive they are using a cost plus contract. If you go over budget you just eat into your profit. The contract is it self the caret and stick.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-09-17T01:02:08Z","Content":"\n\u003Cp\u003ESpacex has been chosen, I don\u0027t know who is the other winner.\u003C/p\u003E\u003Cp\u003ECan someone tell me?\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2014-09-17T01:03:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022goldenpeach\u0022 data-cite=\u0022goldenpeach\u0022\u003E\u003Cdiv\u003ESpacex has been chosen, I don\u0027t know who is the other winner.\u003Cp\u003ECan someone tell me?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoeing. They were almost certain to get chosen, from what I have heard.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-09-17T01:05:28Z","Content":"\n\u003Cp\u003EThank you!\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-09-17T03:55:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EWell, we started with capsules. Then we tried to move to winged, reuseable shuttles. It did not work out, so we reverted back to capsules. Not much of a progress there. It\u0027s like our ancestors decided to scuttle sailing boats and go back to using only paddle-driven canoes - just because you can always paddle, while wind does not blow all the time. Later the same happened with steam engines: Wind was free, while coal had to be mined and carried along, cutting into cargo capacity. And then internal combustion engines appeared: Coal was cheap and plentiful, while oil had to be drilled in far away lands, distilled and carefully stored. Looks like technological inertia and cosnservatism are worse enemies of progress than lack of money.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell... what were you looking for exactly? And then define capsule... Because this is how things are going to be done for some time now. There is plenty of progress to be made in capsules.. Conservatism is the reason for the lack of money. But the fact that were sticking to a \u0022capsule\u0022 design ( you have to look at the vehicle as a whole. It only becomes a capsule for one purpose. ) has nothing to do with that. The lack of money comes from lack of interest which come from lack of education and tainted roll models. Kids these days want to grow up to be anything but engineers.\u003C/p\u003E\n"},{"CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2014-09-17T04:02:06Z","Content":"\n\u003Cp\u003EThe reason (IMHO) that they are sticking with the capsule is because they dont need the Cargo Bay of a Shuttle type design and all this contract is doing is paying for those companies to ferry astronauts and capsules are the simplest way to do it\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-17T04:08:44Z","Content":"\n\u003Cp\u003EDream chaser doesn\u0027t have (or wouldn\u0027t have had...) a payload bay.\u003C/p\u003E\n"},{"CreatedByName":"Aningaaq","CreatedById":99814,"CreatedDateTime":"2014-09-17T06:25:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022B787_300\u0022 data-cite=\u0022B787_300\u0022\u003E\u003Cdiv\u003EThe reason (IMHO) that they are sticking with the capsule is because they dont need the Cargo Bay of a Shuttle type design and all this contract is doing is paying for those companies to ferry astronauts and capsules are the simplest way to do it\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlus... doesnt the ISS have like two soyuz on it? Maybe the U.S. wants a little more capsule presence on the ISS. I dunno.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-09-17T06:26:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EDream chaser doesn\u0027t have (or wouldn\u0027t have had...) a payload bay.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore fun as dragon has a small payload bay in the trunk, it has been used for small modules to IIS and secondary satellites.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-09-17T08:25:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EMore fun as dragon has a small payload bay in the trunk, it has been used for small modules to IIS and secondary satellites.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECheck again. Dream Chaser is able to carry small payload just fine.\u003C/p\u003E\u003Cp\u003EOne of it\u0027s advantages over Dragon 2 is that it\u0027s able to carry pressurized cargo from the ISS in a low-G environment unlike Dragon which pulls notably higher Gs on reentry.\u003C/p\u003E\u003Cp\u003EThough as Kryten mentioned - it won\u0027t/wouldn\u0027t have a dedicated payload bay.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-09-17T09:04:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EWell... what were you looking for exactly? And then define capsule... Because this is how things are going to be done for some time now. There is plenty of progress to be made in capsules.. Conservatism is the reason for the lack of money. But the fact that were sticking to a \u0022capsule\u0022 design ( you have to look at the vehicle as a whole. It only becomes a capsule for one purpose. ) has nothing to do with that. The lack of money comes from lack of interest which come from lack of education and tainted roll models. Kids these days want to grow up to be anything but engineers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat am i looking for? Think hot-air baloons and planes. Both fly - but there is a world of difference between them. Dragon (especially his second incarnation) is a step in right direction. It is still a capsule, but containing all components necessary to operate in orbit independently. It is also fully reuseable, capable of powered landing in more than just \u0022Pop the chutes and pray\u0022 mode. That is a progress, and a substantial one. But Boeing capsule? From what we know it\u0027s just modern iteration of Apollo - nothing new and innovational. Guess NASA wanted a safe, fall-back option in case Dragon doesnt work as advertised. But if it does, then NASA just sank a mountain of money into system that will be redundant to much superior design.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-09-17T09:12:06Z","Content":"\n\u003Cp\u003EWas hoping it would be Dragon and Dream Chaser that got it. NASA wouldn\u0027t dare offend Boeing though.\u003C/p\u003E\u003Cp\u003EAnd Dragon is definitely not a step back. Reusable and precision landing like the Dream Chaser. Only downside is more Gs but it is a lot safer as it has an abort system.\u003C/p\u003E\u003Cp\u003EThe CST-100 has absolutely no innovation at all and is very expensive as well.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-09-17T09:32:40Z","Content":"\n\u003Cp\u003EFew facts:\u003C/p\u003E\u003Cp\u003E1) Every single competitor had an escape system. So don\u0027t think of it as an advantage for Dragon 2. It\u0027s not. Even stupid cheap Soyuz got escape system. Escape system is nothing you should praise as something new/great/unique - it\u0027s necessity. \u003C/p\u003E\u003Cp\u003E2) Powered landing is more dangerous than landing on a parachutes. Parachutes are not \u0022pop and pray\u0022 - powered landing is.\u003C/p\u003E\u003Cp\u003E3) Saying that CST-100 has no innovation is complete BS.\u003C/p\u003E\u003Cp\u003EI understand the hype on SpaceX, I know that SpaceX won the lobbying and PR war, but don\u0027t get blinded people. It\u0027s not /r/spacex here.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-09-17T09:48:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EWhat am i looking for? Think hot-air baloons and planes. Both fly - but there is a world of difference between them. Dragon (especially his second incarnation) is a step in right direction. It is still a capsule, but containing all components necessary to operate in orbit independently.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure what that means or how it makes Dragon any different from the CST-100.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt is also fully reuseable, capable of powered landing in more than just \u0022Pop the chutes and pray\u0022 mode. That is a progress, and a substantial one. But Boeing capsule? From what we know it\u0027s just modern iteration of Apollo - nothing new and innovational. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the same way a 787 Dreamliner is just a modern iteration of the 707. It uses the same basic layout, the same old jet engines, the same wings and fuselage... Boring!\u003C/p\u003E\u003Cp\u003EOr in the same way a new Porsche 911 is just a modern iteration of the old VW Beetle, same 4 wheels, same 2 doors, same steering wheel, same rear-mounted engine... Nothing new or innovative there either!\u003C/p\u003E\u003Cp\u003EThe architecture of a vehicle is the result of evolution: we try various architectures and shapes and we innovate within the layout that works best. We\u0027ve tried biplanes and seaplanes, we\u0027ve tried 3-wheeled cars or six-wheeled cars, and we\u0027ve tried winged spacecraft, and those simply weren\u0027t practical designs. In a few decades, we will look back at the Space Shuttle and it will look like the Zeppelins of the 1930\u0027s, the Concorde, or the 1961 Chevy Corvair, all things that seemed like a good idea at the time, but turned out being technological dead-ends.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBut if it does, then NASA just sank a mountain of money into system that will be redundant to much superior design. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow is CST an inferior design when you don\u0027t know the criteria that NASA used to rank each of the competitors? A superior design is the one that best meets the requirements. Evidently NASA considers that the two selected proposals were superior, otherwise they would have made a different choice.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003EWas hoping it would be Dragon and Dream Chaser that got it. NASA wouldn\u0027t dare offend Boeing though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not about offending Boeing, it\u0027s about picking the most credible competitor. Boeing has met all its milestones. SNC has not. Boeing has a solid and reliable design. SNC has not. There was serious risk associated with SNC\u0027s proposal, including the fact that they were about to switch engines, which is a major redesign that pretty much cancels the milestones that they did achieve, and that its abort scenarios were less convincing, making it harder to certify. We also don\u0027t know the price of SNC\u0027s bid. It might have been on par with Boeing, which makes the choice a no-brainer.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe CST-100 has absolutely no innovation at all and is very expensive as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECST lands on land with airbags, has a pusher escape system, and it can reboost the station if necessary. That\u0027s all pretty innovative. And so are most its systems, avionics, propulsion, which are all state of the art or brand new systems.\u003C/p\u003E\u003Cp\u003EIf anything, DreamChaser is less innovative since it\u0027s pretty much the old HL20 that was designed by NASA 20 years ago.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-17T13:28:06Z\u0022 title=\u002209/17/2014 01:28  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 17, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-09-17T10:15:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003ECheck again. Dream Chaser is able to carry small payload just fine.\u003Cp\u003EOne of it\u0027s advantages over Dragon 2 is that it\u0027s able to carry pressurized cargo from the ISS in a low-G environment unlike Dragon which pulls notably higher Gs on reentry.\u003C/p\u003E\u003Cp\u003EThough as Kryten mentioned - it won\u0027t/wouldn\u0027t have a dedicated payload bay.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll crafts is capable of carrying cargo and replacing passengers with cargo, dragon has an small unpressurized cargo hold in the trunk. I guess dragon v2 will have this too.\u003C/p\u003E\u003Cp\u003EUnsure if dream chaser has this, my comment was just that capsules also have cargo holds. \u003C/p\u003E\u003Cp\u003EI wonder if they would keep the seats stoved away somehow to retain the 7 man return capability in an emergency. One option would be to store spare seats at the IIS.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-09-17T11:06:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EAll crafts is capable of carrying cargo and replacing passengers with cargo, dragon has an small unpressurized cargo hold in the trunk. I guess dragon v2 will have this too.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIsn\u0027t it something like 0.1m3?\u003C/p\u003E\u003Cp\u003EOr you\u0027re talking about the one-way trunk which won\u0027t offer any access to the bay through spacecraft itself and has no ability of returning back to earth?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EUnsure if dream chaser has this, my comment was just that capsules also have cargo holds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs said - all of them offer something, in general: capability of brining down pressurized cargo is by far more useful than the unpressurised one, but as far as I remember - NASA didn\u0027t ask for a cargo bay.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EI wonder if they would keep the seats stoved away\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWho?\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-09-17T11:57:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EIsn\u0027t it something like 0.1m3?\u003Cp\u003EOr you\u0027re talking about the one-way trunk which won\u0027t offer any access to the bay through spacecraft itself and has no ability of returning back to earth?\u003C/p\u003E\u003Cp\u003EAs said - all of them offer something, in general: capability of brining down pressurized cargo is by far more useful than the unpressurised one, but as far as I remember - NASA didn\u0027t ask for a cargo bay.\u003C/p\u003E\u003Cp\u003EWho?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, i\u0027m talking about the one way trunk, and yes returning stuff under pressure is far more useful and all have that capability, dragon has its trunk for its own reasons, its an structure during launch, stability during launch abort, a place to mount solar panels, might also store extra fuel and air.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-17T14:34:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EWhat am i looking for? Think hot-air baloons and planes. Both fly - but there is a world of difference between them. Dragon (especially his second incarnation) is a step in right direction. It is still a capsule, but containing all components necessary to operate in orbit independently. It is also fully reuseable, capable of powered landing in more than just \u0022Pop the chutes and pray\u0022 mode. That is a progress, and a substantial one. But Boeing capsule? From what we know it\u0027s just modern iteration of Apollo - nothing new and innovational. Guess NASA wanted a safe, fall-back option in case Dragon doesnt work as advertised. But if it does, then NASA just sank a mountain of money into system that will be redundant to much superior design.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Dragon V2 can\u0027t operate in orbit independently (no solar panels as standard), and reusable capsule aren\u0027t remotely innovative. Soviet Zenit capsules were routinely reused, and they were literally the first capsule design ever built.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-09-17T14:45:29Z","Content":"\n\u003Cp\u003EThe Dragon V2 trunk carries solar panels. The capsule is designed to be able to operate for up to 30 days in orbit, IIRC. Not as long as the CST-100, but it\u0027s not like the only mission profile it can fly is a station rendezvous.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-09-17T14:52:00Z","Content":"\n\u003Cp\u003EAlso, it\u0027s not like reusability provides much of an advantage when there are only 6 flights planned.\u003C/p\u003E\n"}]}