{"TopicId":84822,"ForumId":16,"TopicTitle":"Any ideas what causes this?","CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-17T14:13:46Z","PageNum":1,"Articles":[{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-17T14:13:46Z","Content":"\n\u003Cp\u003EI build this beautiful space plane. It is easily capable of SSTO, it only uses around 25% of the fuel to reach 100KM orbit. it flies like a dream as long as you keep it fairly straight.\u003C/p\u003E\u003Cp\u003EHowever, as soon as you climb or turn faster than some unknown factor, the plane turns into a party popper. Is this due to g-force, aerodynamic stress, Kraken Spittle, or just odd game mechanics?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/SJx2Pu7Mn9o?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-22T06:26:10Z\u0022 title=\u002209/22/2014 06:26  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 22, 2014\u003C/time\u003E by Bit Fiddler\u003C/strong\u003E\n\u003Cbr\u003EMoved Video to youtube.\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-09-17T14:18:56Z","Content":"\n\u003Cp\u003EHmmm, it seems your dropbox link isn\u0027t working. I suggest using an image hosting site like Imgur. If you are using FAR it models aerodynamic stresses so if you try turning too fast too low it will shred your aircraft.\u003C/p\u003E\n"},{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-17T14:25:54Z","Content":"\n\u003Cp\u003EDropbox still uploading video... and yes I am using FAR. but the flight of the aircraft (in my opinion) was not out of the norm. I would not think a plane should fall apart that easily.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-09-17T14:28:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bit Fiddler\u0022 data-cite=\u0022Bit Fiddler\u0022\u003E\u003Cdiv\u003EDropbox still uploading video... and yes I am using FAR. but the flight of the aircraft (in my opinion) was not out of the norm. I would not think a plane should fall apart that easily.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027d be surprised. Also, for Video might I suggest youtube? Anyway, it really all depends on how much you get away from the prograde marker. A few degrees and you are fine, but depending on speed, more than 5 and your plane will shred.\u003C/p\u003E\n"},{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-17T14:31:24Z","Content":"\n\u003Cp\u003Eprobably FAR then. is there a way to tweak FAR to not be as sticky about this? after all modern fighter planes pull off far more demanding maneuvers than my plane was doing.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EOn a side note does your signature ribbon thing read your Final Frontier mod\u0027s data files ad create the signature for you automatically?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-17T14:34:48Z\u0022 title=\u002209/17/2014 02:34  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 17, 2014\u003C/time\u003E by Bit Fiddler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-09-17T14:42:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bit Fiddler\u0022 data-cite=\u0022Bit Fiddler\u0022\u003E\u003Cdiv\u003Eprobably FAR then. is there a way to tweak FAR to not be as sticky about this? after all modern fighter planes pull off far more demanding maneuvers than my plane was doing\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFighter Jets aren\u0027t going mach 4 when they do those sharp turns. It\u0027s the atmosphere ripping you apart, you have to balance how high you are, vs how fast you are going, vs how suddenly you want to change your AoA.\u003C/p\u003E\u003Cp\u003EThere is a way to change it though, use NEAR instead. FAR strives for super realism. NEAR is semi-realism. Which one you choose depends on whether you want a simulator or a realistic game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-17T14:45:36Z\u0022 title=\u002209/17/2014 02:45  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 17, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-17T15:56:27Z","Content":"\n\u003Cp\u003Emaximum mach in that video is around .7 and the turn was less than 10 deg. from Prograde. probably more like 5 degrees.\u003C/p\u003E\u003Cp\u003EIf I have a mod installed that requires FAR to run, and I delete it and run NEAR instead will this work? will NEAR give the mods what they need?\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-09-17T16:02:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bit Fiddler\u0022 data-cite=\u0022Bit Fiddler\u0022\u003E\u003Cdiv\u003Eafter all modern fighter planes pull off far more demanding maneuvers than my plane was doing.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, \u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eno\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAny modern plane will, on executing a 30-degree sideslip while transonic at sea level under heavy thrust, quite politely shred itself into confetti.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bit Fiddler\u0022 data-cite=\u0022Bit Fiddler\u0022\u003E\u003Cdiv\u003Eand the turn was less than 10 deg. from Prograde. probably more like 5 degrees.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain, no.\u003C/p\u003E\u003Cp\u003Eat 1:24, when you starboard rudder decides to run for it, you are at 22 degrees. Just before that you were a notch further away.\u003C/p\u003E\u003Cp\u003EPlease stop deluding yourself, and actually *look* at what you are doing.\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003EActually, that\u0027s likely asking too much.\u003C/p\u003E\u003Cp\u003Etry this: Switch on FAR\u0027s detail display for atmo flight.\u003C/p\u003E\u003Cp\u003ENote the figures for angle of attack, dynamic pressure. See the flashing Aerodynamic Failure light?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-17T18:03:31Z\u0022 title=\u002209/17/2014 06:03  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 17, 2014\u003C/time\u003E by MarvinKitFox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-17T16:17:32Z","Content":"\n\u003Cp\u003Ewell not to argue aircraft physics, but the roll may have been at 22, but the difference from prograde is the key, and it was not that far off. the aerodynamic forces are based on the angle of the body compared to the angle of motion. \u003C/p\u003E\u003Cp\u003EHowever this is not the point the point is how to keep it from happening. realistic or not. If it is caused by FAR, will switching to NEAR fix the issue while still providing other mods that require FAR the things they need.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-09-17T16:27:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bit Fiddler\u0022 data-cite=\u0022Bit Fiddler\u0022\u003E\u003Cdiv\u003Emaximum mach in that video is around .7 and the turn was less than 10 deg. from Prograde. probably more like 5 degrees.\u003Cp\u003EIf I have a mod installed that requires FAR to run, and I delete it and run NEAR instead will this work? will NEAR give the mods what they need?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just want to point out the video wasn\u0027t there when I posted. Your problem is your using YAW to turn, don\u0027t do that. Planes don\u0027t actually need rudders at all, most of mine don\u0027t have them. To turn, bank (i.e. Roll/Rotate) the plane in the direction you want to turn and pull back on the stick. Don\u0027t even touch A and D on the keyboard.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-17T16:31:54Z\u0022 title=\u002209/17/2014 04:31  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 17, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-17T16:39:40Z","Content":"\n\u003Cp\u003Ewell this video was just to demonstrate the point. this happens at all altitudes, and all speeds, doing any maneuver. I can just be cruising level and pitch up to 10 or 15 degrees while traveling around 300m/s at something like 15 to 20km altitude and the same thing happens. And forget re-entry, which is where I noticed the problem the first time. if I am at a 100Km orbit I turn prograde burn till I have about 1/4 of an orbit till splash down. then turn prograde again. I pass 70km at around mach 7 and pop a drogue chute. I slow down and dump the chute near 30KM and then it starts to disintegrate. I have yet to renter without exploding. it will not withstand any reentry I have been able to try yet.\u003C/p\u003E\u003Cp\u003Eso again all realism aside. will switching to NEAR give my other mods what they need, while making this issue less dramatic?\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2014-09-17T17:17:52Z","Content":"\n\u003Cp\u003EInstead of switching to NEAR, you can turn off aerodynamic dissassemblies in FAR by going to Gamedata\\FerramAerospaceResearch\\Plugins\\PluginData\\FerramAerospaceResearch/config.xml and changing allowStructuralFailures from \u0027True\u0027 to \u0027False\u0027\u003C/p\u003E\n"},{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-17T17:23:32Z","Content":"\n\u003Cp\u003Eah this is what I need. thanks a bunch. I am going to try to find a flight profile for this thing that works but if not ill just turn off structural failures. as the this thing is sapping the fun out of the game. I am tempted to forget SSTO space planes, and just go back to capsules and parachutes.\u003C/p\u003E\n"},{"CreatedByName":"SanderB","CreatedById":83050,"CreatedDateTime":"2014-09-17T17:31:03Z","Content":"\n\u003Cp\u003EI suggest using the Q value of FAR in flight data. Anything over 10 kPa for Q (dynamic drag) is a danger zone for anything that isn\u0027t facing close to prograde. Far above that you should really not be having sideslip of \u0026gt;3Ã‚Â° or an AoA of \u0026gt;5Ã‚Â°. Keep dynamic drag below 20k kPa. Also, you may be going down through the atmosphere too fast.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-09-17T17:37:59Z","Content":"\n\u003Cp\u003EIt was hard to tell but your engines are real close to overheating in the video. It almost looked like right before it turned and broke up the engine stopped. But it\u0027s hard to tell because of the weird turn you were performing. Try doing the same thing with proper banking maneuver.\u003C/p\u003E\u003Cp\u003EThose engines are designed for much larger craft than that, you can orbit a typical SP\u002B plane with 2 turbojets and a toroidal aerospike and they don\u0027t have a nasty habit of overheating. (Those are B9 sabres, right? That\u0027s what they look like)\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-09-17T18:24:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bit Fiddler\u0022 data-cite=\u0022Bit Fiddler\u0022\u003E\u003Cdiv\u003Ewell not to argue aircraft physics, but the roll may have been at 22, but the difference from prograde is the key, and it was not that far off. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt 1:24, your prograde is about 14* up, heading 98*.\u003C/p\u003E\u003Cp\u003Eyour nose is pointing at 4* up, heading 117*\u003C/p\u003E\u003Cp\u003EThe roll is not very important, relevant only as relative angle between prograde and heading. Here you are sideslipping strongly to your left, and a teensy bit down.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zH6WySJ.png\u0022 alt=\u0022zH6WySJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou really, **really** need to look at your own video with an open mind.\u003C/p\u003E\u003Cp\u003EYou are sideslipping at 22* to 23*, at a mere 500m altitude, thus at virtually full sealevel soupmosphere.\u003C/p\u003E\u003Cp\u003Eyou are doing this at 265m/s, which is mach 0.78\u003C/p\u003E\u003Cp\u003Efor an equivalent human experience, do a bellyflop into a pool.\u003C/p\u003E\u003Cp\u003E.from the high diving plank\u003C/p\u003E\u003Cp\u003E.wearing only a speedo\u003C/p\u003E\u003Cp\u003E.into 12 inches of water.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-09-17T18:50:04Z","Content":"\n\u003Cp\u003EMarvinKitFox is correct, The wing loading you put on that right rear tail section traveling at trans-sonic speeds was massive. That one section was taking many more times the weight of your entire aircraft. No real-life plane is flown like that. Yaw on high speed aircraft is there just to counteract sideslip(nose drop) during banking turns, not to do the actual turning. The only yaw used for turning are on planes that travel under 200km/hr(\u0026lt; 70m/s).\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-09-17T21:03:30Z","Content":"\n\u003Cp\u003EGood Gravy! You don\u0027t turn by Yawing (I\u0027m assuming that\u0027s what you are attempting to do there) what you should be doing is rolling your plane slightly and pulling up, but that\u0027s besides the point. You are travelling Mach .7 at somewhere around 200m, meaning you are moving way too fast way too low. If I were you and I needed to turn I would wait until I was higher in the atmosphere (Like somewhere around 10km) and travelling at a much lower speed (Like 200m/s) The main issue, and the source of all your problems, is that you have too many engines for not enough wing area. You could probably drop your outrigger engines (The ones attached to your wings) and reduce your forward canard significantly (The AV-R8 is a good choice for this). I\u0027ve also attached a pic of my newest SSTO Attempt (needs more oxidizer) for inspiration.\u003C/p\u003E\u003Cp\u003EOn an unrelated note you should click the ribbons in my sig. (They are clickable)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZFa5hhH.png\u0022 alt=\u0022ZFa5hhH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2014-09-18T09:10:55Z","Content":"\n\u003Cp\u003Eagain you are ALL MISSING THE POINT. this video was just made to quickly demonstrate the breakdown. the plane breaks down under most any maneuver at any speed and any altitude. it will break apart like this at 20km altitude under mach 1 if I pitch up by 10 degrees or so. I am not here talking about aircraft physics in a purely fictional world where reality has no bearing. I am here asking what caused this behavior and how to stop it. which I have received an answer for. in my experience KSP flight physics are far from ideal, but with some recent mods I loaded FAR was required, and now if that is indeed the culprit ( I have not tested this yet) then I have received an answer for how to disable that behavior. I am closing this thread as I have no wish to argue flight physics for a game with people who do not listen, and just fixate on the one video. I just wanted to know what was causing it, and how to fix it. This video was not made to show any perceived lack of reality, or to questions the FAR mods implementation of physics. it was just to demonstrate what I meant by the aircraft disintegrating. And thanks to Jovus, the only one who read and understood the question, I have my answer. No offence to the rest of you, but I was not asking about physics, just a game anomaly that cropped up recently. So talking of rudders and yaw etc., and missing the point entirely that the plane breaks up if I exceed something like 5 degrees from prograde at any speed or altitude, is a pointless discussion. the point is \u0022I DO NOT WANT THIS BEHAVIOR. HOW DO I GET RID OF IT.\u0022 Thanks again Jovus for your help.\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2014-09-18T10:38:17Z","Content":"\n\u003Cp\u003EAFAIK FAR is very unforgiving to sharp turns at high speeds, especially if you try to sideslip at the same time. Listen to Jovus and SanderB advice on this one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2014-09-18T11:06:17Z","Content":"\n\u003Cp\u003EJust maybe such simple thing as \u0022moar struts\u0022 will help.\u003C/p\u003E\n"}]}