{"TopicId":84871,"ForumId":46,"TopicTitle":"Blocked from forum Areas and Threads","CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-09-17T23:48:41Z","PageNum":1,"Articles":[{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-09-17T23:48:41Z","Content":"\n\u003Cp\u003EThis is a KSP forum question vice KSP game question.\u003C/p\u003E\u003Cp\u003EWhy am I blocked from certain threads or areas on the forum? I don\u0027t mean those areas reserved for the developers, testers, QA, etc. The reasons for that are obvious.\u003C/p\u003E\u003Cp\u003EBut threads like this: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64058-PROPOSAL-Package-Manager-style-for-KSP-Mods\u0022 rel=\u0022external nofollow\u0022\u003Eblocked thread\u003C/a\u003E It is not in the testers area. The thread was pointed to by another forum user. Yet, I cannot see it.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-09-17T23:54:15Z","Content":"\n\u003Cp\u003EHi Apollo,\u003C/p\u003E\u003Cp\u003EThat specific thread is in the Support archives. You may have noticed we recently changed to a new set-up in our Support forums which will hopefully help people get better support. However going through the old threads and manually assigning each and every one of the thousands of threads to the proper new section is more trouble than it\u0027s worth, so we dumped them in the forum archives (which are not publically viewable for reasons, sorry). \u003C/p\u003E\u003Cp\u003EWhat are you trying to get from the thread? We can always take a peek for you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-09-18T00:33:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EWhat are you trying to get from the thread? We can always take a peek for you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENothing in particular. As a new modder, I\u0027m just looking for sources of info, wherever it might be. That thread was just an example of what I run into.\u003C/p\u003E\n"}]}