{"TopicId":84905,"ForumId":55,"TopicTitle":"(suggestion \u0026amp; bug) thrust limiter sliders are not precise enough","CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-09-18T16:38:17Z","PageNum":1,"Articles":[{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-09-18T16:38:17Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI\u0027ve tried to adjust thrust of some engine and it\u0027s very unfortunate that 25 and 50% value are inaccessible; I can only get 24.5 and 25.5 or 49.5 and 50.5 but not 25 or 50.\u003C/p\u003E\u003Cp\u003EIt would be great to have keys to adjust them precisely \u002B snap to some standard values (multiple of 10 \u002B 25, 50, 75).\u003C/p\u003E\u003Cp\u003EI play windowed in 1280x960 resolution, this is with 0.23.5 version, and it is the same with 0.24.2.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-09-18T18:03:50Z","Content":"\n\u003Cp\u003EWell... I think a difference between 24.5% and 25% is very unlikely to be needed often... or at all; I\u0027m thinking this is to do with that \u0022I get annoyed at odd numbers, all number must be divisible by 5 or I get really irritated!!\u0022 thing. \u003C/p\u003E\u003Cp\u003EI do agree they need to be more precise though, but I want it because the thrust sliders don\u0027t let you choose between 0-5%, or 95-100% (though the latter is less useful); when doing tiny correction burns with a ship that only has a powerful engine, 5% can be too much, which is a pain!!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-18T18:05:49Z\u0022 title=\u002209/18/2014 06:05  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 18, 2014\u003C/time\u003E by Random Tank\u003C/strong\u003E\n\u003Cbr\u003EReasons\n\u003C/span\u003E\n"},{"CreatedByName":"Thanny","CreatedById":110623,"CreatedDateTime":"2014-09-20T03:00:22Z","Content":"\n\u003Cp\u003EI believe this is an acknowledged bug. And it\u0027s not at all about being picky, as you don\u0027t want to set one engine to 50% while the other refuses to be anything but 49.5 or 50.5%.\u003C/p\u003E\n"}]}