{"TopicId":85091,"ForumId":21,"TopicTitle":"SpaceM Munar Products presents Minmus Ion Landers","CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2014-09-20T23:46:11Z","PageNum":1,"Articles":[{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2014-09-20T23:46:11Z","Content":"\n\u003Cp\u003EI\u0027ve been working on these for a while, and they\u0027re a ton of fun. Too bad I didn\u0027t catch a screenshot of Mechjeb\u0027s Delta V readout - for both of these landers it was something ridiculous like 12km/s.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/cdy4I\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThe one with the four 1x6 panels is my first manned ion lander, the one with three is an unmanned one. As you can see I kind of abuse as many weightless parts as I can - even covering the legs in OX-STATs to help get some more juice. The only mod I used is a mechjeb console. SpaceM\u0027s official policy on automation is that the insurance deductions go way down when you use it. Pilot Roford Kerman usually turns it off and does his landings manually anyway because hey - what the insurance guys don\u0027t know won\u0027t hurt them.\u003C/p\u003E\u003Cp\u003EThey\u0027re as easy to fly (if not easier!) than your typical mun lander due to the low gravity of our favourite minty moon. One big safety tip - as these are electric you want to make sure that any burn of substance is done in the presence of full sunlight. They\u0027ve got battery but that\u0027s only a buffer, really. Ion drives use a lot of power!\u003C/p\u003E\u003Cp\u003EI\u0027ve got a question, though, and didn\u0027t see it on any FAQ - what\u0027s a good place to put up the .craft files online for sharing?\u003C/p\u003E\n"},{"CreatedByName":"EthanSchlegel","CreatedById":114346,"CreatedDateTime":"2014-09-21T00:40:43Z","Content":"\n\u003Cp\u003Elooks great, it\u0027s certainly better then my minmus ion lander\u003C/p\u003E\n"},{"CreatedByName":"2001kraft","CreatedById":120475,"CreatedDateTime":"2014-10-17T18:33:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022moogoob\u0022 data-cite=\u0022moogoob\u0022\u003E\u003Cdiv\u003Ewhat\u0027s a good place to put up the .craft files online for sharing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei personally use ge.tt\u003C/p\u003E\n"}]}