{"TopicId":85217,"ForumId":16,"TopicTitle":"Why doesn\u0026#039;t the estimated burn time ever show up for me?","CreatedByName":"Riffy","CreatedById":3900,"CreatedDateTime":"2014-09-22T16:48:35Z","PageNum":1,"Articles":[{"CreatedByName":"Riffy","CreatedById":3900,"CreatedDateTime":"2014-09-22T16:48:35Z","Content":"\n\u003Cp\u003ELately when I have been playing and I go to plan a maneuver I used to remember it showing me the burn time so I knew if I was doing it right or wrong. But now where the number should be is blank right up until I turn the engines on and then find out I set myself up with a three minute burn and abort. It has been a long time since I started playing again but I am not sure if it\u0027s a setting or something I need to go before hand to get it to show up correctly. Normally by the time I get into a correct orbit to move out to the mun I am on my last stage anyway because I still have problems with wasting fuel on the way up.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-09-22T16:56:47Z","Content":"\n\u003Cp\u003EIf your staging to a less powerful engine, the system won\u0027t recalculate until you have fired those engines at least once. What happens is the maneuver node is calculated using the engines you discarded, not the engines you have now. If the discarded engines were powerful enough, the calculation may have been less than a second resulting in no burn time shown.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-09-22T17:00:45Z","Content":"\n\u003Cp\u003EMine never shows an estimated burn time. Even after burning the engines and burning them on a maneuver node (to satisfaction of the node). Never. Mac OS.\u003C/p\u003E\n"},{"CreatedByName":"Riffy","CreatedById":3900,"CreatedDateTime":"2014-09-22T17:06:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EIf your staging to a less powerful engine, the system won\u0027t recalculate until you have fired those engines at least once. What happens is the maneuver node is calculated using the engines you discarded, not the engines you have now. If the discarded engines were powerful enough, the calculation may have been less than a second resulting in no burn time shown.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dumped my last booster stage and fired off the last engine I had and then hit x to zero it out. I go to set the node and it\u0027s still blank, maybe I need to reinstall it or something because I know a few updates back it used to work without any problems for me. Let me setup my ship again and record it, I am willing to bet I am just doing something stupid and throw it up on youtube.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-09-22T20:56:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EMine never shows an estimated burn time. Even after burning the engines and burning them on a maneuver node (to satisfaction of the node). Never. Mac OS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMine often does not show burn time correctly either (mac os)\u003C/p\u003E\u003Cp\u003EI often have to throttle up to get it to start calculating burn time.\u003C/p\u003E\u003Cp\u003ESo.. say 2 minutes before a node that I\u0027m expecting to take 1 minute of burn, I start burning for 1-2 seconds, and then it displays the burn time, and then I hit X, and then start the burn using the \u002250:50 rule\u0022 based on that burn time. If I really want to be precise, I quicksave, get the burntime, and then load\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-09-22T21:23:34Z","Content":"\n\u003Cp\u003EKerikBalm,\u003C/p\u003E\u003Cp\u003EAs far as I know, what you\u0027re seeing is normal behavior for KSP on all platforms. It won\u0027t show a good estimate until you burn the engines in the current stage for a few moments. This is true after staging or loading a save.\u003C/p\u003E\u003Cp\u003Etater\u0027s reporting that the burn time \u003Cem\u003Enever\u003C/em\u003E appears.\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2014-09-22T22:12:00Z","Content":"\n\u003Cp\u003EMechjeb has a hidden readout (ie, you need to customize a window) that shows accurate burn times. It won\u0027t work if you\u0027re staging during the burn, but if you aren\u0027t, it works.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-09-23T04:42:17Z","Content":"\n\u003Cp\u003EYou can always estimate things yourself. Thrust to mass ratio in kN/tonne equals acceleration in m/s^2. Get thrust by totting up your engines and mass from the info panel on the map screen. Burn duration is delta-V divided by acceleration.\u003C/p\u003E\u003Cp\u003EIt\u0027ll be an overestimate because you\u0027re using up fuel, but for most manoeuvres it doesn\u0027t matter much and anyway this is how the game\u0027s predictor does it.\u003C/p\u003E\n"}]}