{"TopicId":85368,"ForumId":55,"TopicTitle":"FMRS-style control of dropped stages","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-09-25T06:42:40Z","PageNum":1,"Articles":[{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-09-25T06:42:40Z","Content":"\n\u003Cp\u003EI recently installed and started playing with a relatively new mod: \u003Cem\u003E\u003Cstrong\u003EFlight Manager for Reusable Stages\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80292-0-24-2-Flight-Manager-for-Reusable-Stages-%28FMRS-v0-2-00%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/80292-0-24-2-Flight-Manager-for-Reusable-Stages-%28FMRS-v0-2-00%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s an excellent and easy-to-use and understand solution to the problem of dropped stages disappearing after dropping below 23 km (or the equivalent altitudes on other planets) when on rails.\u003C/p\u003E\u003Cp\u003EBasically, it creates a parallel save for each of the dropped stages. You load up the save for each, control them until they land on the ground of Kerbin or whatever planet/moon you\u0027re launching from, and then integrate the parallel saves back into the main save- which will then have the craft positions added into the save. Alternatively, you can recover the dropped stages and simply have the funds/science integrated into the main save.\u003C/p\u003E\u003Cp\u003EAll in all, an EXCELLENT solution to the problem of the game currently being unable to simulate things like Space-X style launches easily or realistically (the current best solution in the stock game is to circularize the upper stage before switching back to the lower stage- and obviously this only works for two-stage craft with a very high upper stage TWR...)\u003C/p\u003E\u003Cp\u003EI see no reason the devs couldn\u0027t integrate this feature into the stock game- it doesn\u0027t add any parts or major gameplay functions, yet improves the game experience MASSIVELY when attempting to re-use dropped stages.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E Other utility mod functions on my wish-list: Kerbal Alarm Clock style alarms, Atmospheric Trajectories style re-entry trajectory predictions, and of course some of the Kerbal Engineer/MechJeb style informational displays on Delta-V etc.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-25T06:45:58Z\u0022 title=\u002209/25/2014 06:45  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 25, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"}]}