{"TopicId":85381,"ForumId":44,"TopicTitle":"Is seasons last everywhere the same all over the Earth?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-25T13:38:45Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-09-25T13:38:45Z","Content":"\n\u003Cp\u003EI know that like us northern hemisphere, summer ends and autumn begins, the southern hemisphere in South America, Africa and Australia ends and winter begins in the spring, and vice versa. \u003C/p\u003E\u003Cp\u003EI wonder if the season last everywhere the same, read, and actually learned playing the game \u0022Take on Mars\u0022: D \u003C/p\u003E\u003Cp\u003EMars has its own seasons in each hemisphere, north and south, and that they are not equal, I wonder what it looks like in the case of our Earth.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-09-25T13:40:23Z","Content":"\n\u003Cp\u003EIt depends on the axial tilt of the planet.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-09-25T13:46:23Z","Content":"\n\u003Cp\u003ESeasons are defined by the period between equinoxes and solstices, which are related to the angle of the axial tilt to the sun. It seems to me that as long as the axial tilt itself doesn\u0027t wobble all over the place, a season will always be equal 1/4 of a year.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-09-25T14:28:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EIt seems to me that as long as the axial tilt itself doesn\u0027t wobble all over the place, a season will always be equal 1/4 of a year.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInterestingly, seasons on Earth aren\u0027t exactly equal in length.This is because the Earth\u0027s orbit is elliptical. Perihelion is reached in the first days of January while aphelion is reached on about July 4th each year. The time between the equinoxes and solstices is defined by how quickly the Earth moves around the Sun. \u003C/p\u003E\u003Cp\u003EEveryone here knows that orbital speeds are higher at perihelion than at aphelion. Correspondingly, the time between the northern hemisphere\u0027s spring equinox and autumn equinox is longer than the opposite half of the year by a couple of days. Spring and summer in the northern hemisphere extend over 186 days from March 21st (typical date of the Spring equinox) through September 23rd (typical autumn equinox), while the northern hemisphere\u0027s autumn/winter seasons only last 179 days.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-25T16:28:28Z\u0022 title=\u002209/25/2014 04:28  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 25, 2014\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003Cbr\u003EAdded a sentence to specify the number of days in each \u0026quot;half\u0026quot; of the year\n\u003C/span\u003E\n"},{"CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-09-26T12:42:40Z","Content":"\n\u003Cp\u003EThat effect is even stronger on Mars, as it has a greater eccentricity than Earth. Which is why I presume it comes up in a game set on Mars.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Climate_of_Mars#Seasons\u0022 rel=\u0022external nofollow\u0022\u003EOn this wikipedia page\u003C/a\u003E, in that section there\u0027s a table that compares the lengths of seasons on Earth (not more than five days difference) to those of the seasons on Mars (slightly more than fifty Martian days difference).\u003C/p\u003E\n"}]}