{"TopicId":85395,"ForumId":16,"TopicTitle":"How much delta v to laythe with a spaceplane and FAR?","CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2014-09-25T19:28:12Z","PageNum":1,"Articles":[{"CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2014-09-25T19:28:12Z","Content":"\n\u003Cp\u003EI\u0027m building a spaceplane to laythe and was wondering with Ferram Aerospace installed how much rocket delta v do you need from LKO (130 km) to get to laythe land on it and take off. when I am in atmosphere I will be running on air breathing power so landing is not as much of a concern. Right now I have about 6500 m/s with full tanks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-25T21:59:00Z\u0022 title=\u002209/25/2014 09:59  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 25, 2014\u003C/time\u003E by peachoftree\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-09-25T20:21:08Z","Content":"\n\u003Cp\u003EMight I suggest a \u003Ca href=\u0022http://i.imgur.com/IV8rzue.png\u0022 rel=\u0022external nofollow\u0022\u003EdV map?\u003C/a\u003E That\u0027s going to tell you how much it\u0027s going to be to get there, as far as actually landing and taking off from Laythe, it really depends on how fast you are going in atmosphere. If you get going fast enough (I know far Tops out at Mach 4-ish) high enough you can circularize with only a fraction of the dV listed.\u003C/p\u003E\n"},{"CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2014-09-25T20:23:03Z","Content":"\n\u003Cp\u003EIve seen that map before but don\u0027t know how to use it. do you add up every single value fron your destination and back because that gives me something like 7500 m/s I think thats much too high.\u003C/p\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2014-09-25T20:28:52Z","Content":"\n\u003Cp\u003EYes, you just add up the paths each way. The red arrows indicate where you can aerobrake to reduce the cost of going in one direction to nearly nothing.\u003C/p\u003E\u003Cp\u003EUnder FAR, it takes about 1000 m/s less to take off from Kerbin and Laythe. Also, the dV figures for air-breathing engines seem quite wonky in the game, though from a practical standpoint, they consume almost no fuel mass at all, and I almost never worry about liquid fuel. In addition, the use of air breathing engines reduces the dV to take off to about 1000 m/s in rocket mode (I assume you make it to about 25km at 1500 m/s with jet engines).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-25T20:32:03Z\u0022 title=\u002209/25/2014 08:32  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 25, 2014\u003C/time\u003E by Empiro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-09-25T20:32:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peachoftree\u0022 data-cite=\u0022peachoftree\u0022\u003E\u003Cdiv\u003EIve seen that map before but don\u0027t know how to use it. do you add up every single value fron your destination and back because that gives me something like 7500 m/s I think thats much too high.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s exactly how you use it (Don\u0027t forget to factor in any plane changes) Red arrows indicate aerobraking (Which is very useful because it significantly reduces the amount of dV needed) and if you are going to Laythe you don\u0027t even need to worry about getting into orbit before you land, just aerobrake to landing.\u003C/p\u003E\n"},{"CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2014-09-25T20:34:56Z","Content":"\n\u003Cp\u003ESorry I worded my response badley. the part I dont understand is why there are areobraking arrows on the jool-dres-duna-kerbin transfers as you still need to burn at jool to lower your orbit to kerbin.\u003C/p\u003E\n"},{"CreatedByName":"pellinor","CreatedById":85299,"CreatedDateTime":"2014-09-25T20:43:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peachoftree\u0022 data-cite=\u0022peachoftree\u0022\u003E\u003Cdiv\u003ESorry I worded my response badley. the part I dont understand is why there are areobraking arrows on the jool-dres-duna-kerbin transfers as you still need to burn at jool to lower your orbit to kerbin.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause you can aerobrake on your way back. So you first need to burn from LKO to a kerbin-jool transfer. Then you can aerobrake at jool into a Laythe transfer (the horizontal arrows), and then at Laythe into an orbit or a landing. On the way back you need to burn into a kerbin-jool transfer, and then can aerobrake at kerbin (following the vertical arrows).\u003C/p\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2014-09-25T20:46:18Z","Content":"\n\u003Cp\u003EThe part where you burn from Jool is calculated by the long chain of Laythe - Vall - Tylo - Bop - Pol - Escape - Jool Transfer. The map is Kerbin centric, so Jool Transfer means one part of your orbit touches Kerbin\u0027s, and the other part touches Jool\u0027s. To go from a Jool Transfer orbit to Kerbin orbit, you follow the arrows down, because you can aerobrake at Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-09-25T22:24:14Z","Content":"\n\u003Cp\u003EThere\u0027s also this map:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/w/images/7/73/KerbinDeltaVMap.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/w/images/7/73/KerbinDeltaVMap.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut some of the values are a bit fudged - as you\u0027ll notice they are different between this map and the previously linked one. Plane changes, drag, etc add a lot of fudge factor.\u003C/p\u003E\u003Cp\u003EThe 2nd one is a bit easier to use, and a lot simpler, even if it is less precise.\u003C/p\u003E\u003Cp\u003EFrom LKO:\u003C/p\u003E\u003Cp\u003E950 (sufficient for edge of kerbin SOI) \u002B\u003C/p\u003E\u003Cp\u003E956 (gets you into Jool SOI) -\u0026gt; with just some minor course corrections, you can directly aerobrake at Laythe!\u003C/p\u003E\u003Cp\u003E\u0026lt;2000 m/s to get to Laythe\u003C/p\u003E\u003Cp\u003EThe landing is essentually free (bring wings or a parachute)\u003C/p\u003E\u003Cp\u003EGetting to orbit from laythe, the jets are essentially free (they have an effective ISP of something like 19,000 at high altitude, and 40,000 at mid altitude)\u003C/p\u003E\u003Cp\u003EWith far, you should only need another 200-300 m/s to get to orbit.\u003C/p\u003E\u003Cp\u003E2200 (conservative) m/s to get to laythe from LKO, land, and get to laythe orbit.\u003C/p\u003E\u003Cp\u003EThe problem becomes finding out how much dV you need to get from low laythe orbit to Jool escape - the wiki\u0027s dV map doesn\u0027t help, as it routes you to low jool orbit first. As an approximation, take the dv from jool intercept to low jool orbirt, and from that subtract the dV to go from low jool orbit to laythe intercept.\u003C/p\u003E\u003Cp\u003E2200\u002B 780 (laythe escape) \u002B 2630-1600 = 4010 to get from LKO, to laythe and then escape jool.\u003C/p\u003E\u003Cp\u003EThen you still need to get to kerbin intercept (and aerobrake from there), add another 956... 5,000 m/s, assuming proper aerobraking and use of jets (but not counting jets towards the dV) should get you to laythe and back.\u003C/p\u003E\u003Cp\u003EAdding up the dV from the other ma gives a value of 5070 \u002B whatever you need to get to low laythe orbit that jets can\u0027t provide (300 m/s is my estimate)...\u003C/p\u003E\u003Cp\u003EI guess my rough estimates from the other map would have come up a few hundred m/s short... :/\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-09-25T22:49:54Z","Content":"\n\u003Cp\u003EAs has been said often enough: ~2000m/s to get to Laythe.\u003C/p\u003E\u003Cp\u003ELaythe has thinner air and lower gravity than Kerbin; the latter is by far more important, so any spaceplane that works on Kerbin can launch from Laythe on the same fuel budget \u003Cem\u003Eor less\u003C/em\u003E. Usually less, much less even.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-09-25T23:40:17Z","Content":"\n\u003Cp\u003EOne should add that the transfer dVs between planets might vary considerably with the constellation of Kerbin to the target planet, that is, with the day and year of your start.\u003C/p\u003E\u003Cp\u003EAlexMoons Launch Window Planner can help you a great deal with finding the right starting time and angle for a Jool transfer\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs you can see there, the needed dV between LKO and LJO can vary considerably .... from as low as 5 km/s (or even just 2 km/s with aerobraking) to more than 20 km/s, depending on time of start and length of flight you choose\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-25T23:42:28Z\u0022 title=\u002209/25/2014 11:42  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 25, 2014\u003C/time\u003E by Godot\u003C/strong\u003E\n\u003C/span\u003E\n"}]}