{"TopicId":85406,"ForumId":16,"TopicTitle":"Understanding navball yaw","CreatedByName":"GroovyMike","CreatedById":75987,"CreatedDateTime":"2014-09-25T21:45:45Z","PageNum":1,"Articles":[{"CreatedByName":"GroovyMike","CreatedById":75987,"CreatedDateTime":"2014-09-25T21:45:45Z","Content":"\n\u003Cp\u003EI\u0027ve searched and found people asking why this happens, but no answers, so I\u0027ll post a new thread myself.\u003C/p\u003E\u003Cp\u003EI\u0027ve played flight sims and am fine with the navball when flying an aircraft/spaceplane. My issue is with the navball while launching a rocket. \u003C/p\u003E\u003Cp\u003EPress A, or joystick left. The rocket\u0027s nose moves to the left/west, and the craft indicator on the navball moves to the left/west. Makes sense.\u003C/p\u003E\u003Cp\u003EPress D, or joystick right. The rocket\u0027s nose moves to the right/east, and the craft indicator moves to the right/east. Makes sense.\u003C/p\u003E\u003Cp\u003EPress W, or joystick forward. The rocket\u0027s nose moves away/north. Makes sense. But the craft indicator on the navball moves SOUTH. Huh?\u003C/p\u003E\u003Cp\u003EPress S, or joystick back. The rocket\u0027s nose moves toward/south. Makes sense. But the craft indicator on the navball moves NORTH. What?\u003C/p\u003E\u003Cp\u003EWhy does yaw \u0022work\u0022 and pitch is opposite? Obviously I could reverse this in the settings, but then I\u0027d have to exit the game and switch the setting back when I wanted to fly a plane. I\u0027m guessing there\u0027s some logical reason for this behavior, but I can\u0027t find it anywhere, and can\u0027t imagine any reason for it.\u003C/p\u003E\n"},{"CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2014-09-25T22:02:15Z","Content":"\n\u003Cp\u003EAre you sure you\u0027ve got you self oriented around ksc? looking from the launchpad towards the vab is west. behind you is east. to the left is south and to the right is north\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2014-09-25T22:13:54Z","Content":"\n\u003Cp\u003EPerhaps to give the rocket the same steering-properties as spaceplanes!?\u003C/p\u003E\u003Cp\u003EThere are several indicators on the Navball, but I don\u0027t know any of them under the name \u0022craft indicator\u0022. Which one do you mean?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Navball#Symbols_on_the_ball_instrument\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Navball#Symbols_on_the_ball_instrument\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-25T22:17:52Z\u0022 title=\u002209/25/2014 10:17  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 25, 2014\u003C/time\u003E by mhoram\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GroovyMike","CreatedById":75987,"CreatedDateTime":"2014-09-25T22:44:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mhoram\u0022 data-cite=\u0022mhoram\u0022\u003E\u003Cdiv\u003EPerhaps to give the rocket the same steering-properties as spaceplanes!?\u003Cp\u003EThere are several indicators on the Navball, but I don\u0027t know any of them under the name \u0022craft indicator\u0022. Which one do you mean?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Navball#Symbols_on_the_ball_instrument\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Navball#Symbols_on_the_ball_instrument\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I\u0027m referring to the level indicator.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-09-25T23:52:50Z","Content":"\n\u003Cp\u003EIn the launch position, you\u0027re looking straight up. \u0022Right\u0022 is east, \u0022Left\u0022 is west, therefore pulling \u0022up\u0022 is south and nosing \u0022down\u0022 is north.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-09-26T00:01:02Z","Content":"\n\u003Cp\u003EThe heading indicator is the wide V-shaped thing in the middle. That actually stays still, while the navball moves underneath it, like the artificial horizons on most aircraft.\u003C/p\u003E\u003Cp\u003EWhen you start on the pad the compass directions on the navball are like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E S\u003Cbr\u003EW E\u003Cbr\u003E N\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E(North is emphasised by a red line, by the way).\u003C/p\u003E\u003Cp\u003EYou might be thinking \u0022wait a moment, north and south are flipped!\u0022. The reason is that \u003Cem\u003Eyou\u0027re effectively looking straight up at the sky\u003C/em\u003E, not down on the ground like with maps of Earth. You get the same effect on star maps, if you put north at the top east and west appear reversed, for the same reason.\u003C/p\u003E\u003Cp\u003EWith that in mind, A yaws to port, which is west in the default craft orientation. B yaws to starboard, which is east. W pitches down, which is north. And S pitches up, into an inverted attitude heading south.\u003C/p\u003E\n"},{"CreatedByName":"GroovyMike","CreatedById":75987,"CreatedDateTime":"2014-09-26T00:27:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peachoftree\u0022 data-cite=\u0022peachoftree\u0022\u003E\u003Cdiv\u003EAre you sure you\u0027ve got you self oriented around ksc? looking from the launchpad towards the vab is west. behind you is east. to the left is south and to the right is north\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI apologize, as I\u0027ve incorrectly described my situation. Let me try again. When I click launch, the game places me facing the flag pole with the VAB to my left and the ocean to my right. The navball is set so that 0 degrees is at the bottom, 180 degrees is at the top, 90 degrees is to the right, and 270 degrees is to the left.\u003C/p\u003E\u003Cp\u003EAlready that throws me off, because I\u0027m used to a 2-dimensional compass. If 90 degrees is to my right and 270 is to my left, then a compass would put 0/360 at the top, and 180 at the bottom. But the navball has those two swapped.\u003C/p\u003E\u003Cp\u003EIf I launch from this view, and I press D, the nose of my rocket points to my right, and the level indicator moves right along the navball on the 90 degree line. Press A, nose points to left, level indicator moves left along 270. Both the motion of the nose and the navball match and make sense visually.\u003C/p\u003E\u003Cp\u003EBut pressing W, the nose of the rocket points away from me, which I know on a compass is 0/360/north. But on the navball, 0/360 is at the bottom, so the level indicator moves toward me (or more accurately, the ball rolls away from me), but the visual effect is that the rocket nose and navball are moving in opposite directions. Same for pressing S, just in the opposite directions.\u003C/p\u003E\u003Cp\u003EI\u0027m trying to wrap my head around this, and maybe a more direct question is, why is north and south on the navball opposite of a compass?\u003C/p\u003E\u003Cp\u003EThe problem it causes is when I\u0027m trying to use only navball to hit a maneuver node. My north-south motions are always the opposite of what I intend, because I\u0027m not used to the positions being swapped yet.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EYou might be thinking \u0022wait a moment, north and south are flipped!\u0022. The reason is that \u003Cem\u003Eyou\u0027re effectively looking straight up at the sky\u003C/em\u003E, not down on the ground like with maps of Earth. You get the same effect on star maps, if you put north at the top east and west appear reversed, for the same reason.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, in fact, I was replying to an earlier post that what\u0027s confusing is that north and south are flipped.\u003C/p\u003E\u003Cp\u003ENow that you\u0027ve mentioned the star map, I can see why this is. The difficulty comes in maneuvering from an external view, and trying to use the navball instead of watching rocket movement. For north-south movements, I keep expecting the ball to react the same as east-west, and I\u0027ll initially move in the wrong direction. I suppose this is just a matter of getting used to it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-26T00:40:16Z\u0022 title=\u002209/26/2014 12:40  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 26, 2014\u003C/time\u003E by tetryds\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lunaran","CreatedById":69822,"CreatedDateTime":"2014-09-26T01:11:25Z","Content":"\n\u003Cp\u003EPicture the gimbal is inside out.\u003C/p\u003E\u003Cp\u003EStare at it like one of those qbert illusions where the cubes flip orientation, until you see a concave bowl instead of a convex ball.\u003C/p\u003E\u003Cp\u003ENow imagine you\u0027re at the center of it, looking out.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-09-26T01:31:35Z","Content":"\n\u003Cp\u003EThis is the exact same paradox that is presented by looking in a mirror. \u003C/p\u003E\u003Cp\u003E The image in the mirror is reversed on the lateral plane (left/ right), but is *not* reversed in the vertical plane (up/down).\u003C/p\u003E\u003Cp\u003EYour nav ball is inverted, and should be thought of as being viewed from the inside instead of outside. \u003C/p\u003E\u003Cp\u003E Nothing else going on here beyond that.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"GroovyMike","CreatedById":75987,"CreatedDateTime":"2014-09-26T02:22:31Z","Content":"\n\u003Cp\u003EThanks everyone for the quick responses and help. I really appreciate it. The star chart, concavity, and mirror analogies help a lot. \u003C/p\u003E\u003Cp\u003EPart of the problem is I started out doing all my maneuvering by watching the ship, not the navball. Now I\u0027m trying to navigate more by instrument, but I\u0027m in the habit of looking at the ship still. \u003C/p\u003E\u003Cp\u003EJust a matter of getting in a different frame of mind and practicing, I\u0027m sure.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-09-26T03:51:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GroovyMike\u0022 data-cite=\u0022GroovyMike\u0022\u003E\u003Cdiv\u003EThanks everyone for the quick responses and help. I really appreciate it. The star chart, concavity, and mirror analogies help a lot. \u003Cp\u003EPart of the problem is I started out doing all my maneuvering by watching the ship, not the navball. Now I\u0027m trying to navigate more by instrument, but I\u0027m in the habit of looking at the ship still. \u003C/p\u003E\u003Cp\u003EJust a matter of getting in a different frame of mind and practicing, I\u0027m sure.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you are not adverse to Mods you could get \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57603-0-24-2-RasterPropMonitor-putting-the-A-in-your-IVA-(v0-18-2)-3-Aug\u0022 rel=\u0022external nofollow\u0022\u003ERaster Prop Monitor\u003C/a\u003E and fly from inside the cockpit, this way your rocket movement and \u0022joystick\u0022 movement will make more sense.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-09-26T05:58:55Z","Content":"\n\u003Cp\u003EShould I point out that there\u0027s a BIT of difference between \u0022adverse\u0022 and \u0022averse\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2014-09-26T06:09:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GroovyMike\u0022 data-cite=\u0022GroovyMike\u0022\u003E\u003Cdiv\u003EJust a matter of getting in a different frame of mind and practicing, I\u0027m sure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you fly mostly with rockets it is practical to change W and S -controls and I and K -controls. After that you can easily turn ship orientation or make RCS -translations to marks on navball. Unfortunately, if you use also planes, you have to change behavior back and forth or get used to \u0022strange\u0022 controls.\u003C/p\u003E\n"},{"CreatedByName":"Simes","CreatedById":117456,"CreatedDateTime":"2014-09-26T14:19:34Z","Content":"\n\u003Cp\u003EIt\u0027s like Kryxal says, when you\u0027re on the pad, you\u0027re looking straight up. When you\u0027re using a compass with a map, you\u0027re looking \u0022down\u0022. \u003C/p\u003E\u003Cp\u003ETry this with a map and compass if you like: look down at the map, with the map oriented in the usual way. Which way is north relative to where you\u0027re looking? Now, without moving any other way, look straight up. Which way is north relative to where you\u0027re looking now?\u003C/p\u003E\n"},{"CreatedByName":"RW-1","CreatedById":107278,"CreatedDateTime":"2014-09-26T17:59:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EThe heading indicator is the wide V-shaped thing in the middle. That actually stays still, while the navball moves underneath it, like the artificial horizons on most aircraft.\u003Cp\u003EWhen you start on the pad the compass directions on the navball are like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E S\u003Cbr\u003EW E\u003Cbr\u003E N\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E(North is emphasised by a red line, by the way).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet\u0027s hold on for a moment there.\u003C/p\u003E\u003Cp\u003EWhen you start on the pad, WITHOUT having rotated your craft in the VAB beforehand, it is that way.\u003C/p\u003E\u003Cp\u003EBut let\u0027s put it like this, you have N, 90, 180, 270, and if you ahve flown airfraft then you know what they corespond to.\u003C/p\u003E\u003Cp\u003EYour heading indicator at launch is straight up into the blue.\u003C/p\u003E\u003Cp\u003EDon\u0027t think left right, etc. move to the heading you want.\u003C/p\u003E\u003Cp\u003EI rotate my ships so that for an equatorial launch I don\u0027t have to \u0022bank\u0022, but can just make a pitchover W, if I rotated the opposite way, it would be a pitchup.\u003C/p\u003E\u003Cp\u003EIt can take a bit orienting to the FDAI .... too bad we don\u0027t have nav needles in addition to the ball itself, you could enable AP and fly the needles \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-26T18:03:50Z\u0022 title=\u002209/26/2014 06:03  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 26, 2014\u003C/time\u003E by RW-1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-09-26T18:09:38Z","Content":"\n\u003Cp\u003EFully explained, in two sentences:\u003C/p\u003E\u003Cp\u003EIn terrestrial maps, and when flying airplanes, your point-o-view is facing DOWN.\u003C/p\u003E\u003Cp\u003EIn KSP when launching rockets, your point-of-view is facing UP.\u003C/p\u003E\u003Cp\u003EThis has the effect of inverting north-south from the \u0022usual\u0022 orientation.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-09-26T20:36:34Z","Content":"\n\u003Cp\u003EThe navball doesn\u0027t have a \u0027rocket\u0027 and a \u0027plane\u0027 mode, it works in exactly the same way in both cases and the same as a real-life artifical horizon works too. Consider when you\u0027re flying a plane horizontally then pull back on the stick (S) - the plane\u0027s nose rises, pointing into the sky ... and so does the nose indicator on the navball. If you were flying North and pitch up to 90-degrees (without stalling ^^) the heading indicator follows the 0-degree (North) heading line. Similarly, pitching down from 90-degrees to horizontal again has to follow that line \u0027down\u0027 the sky.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2014-09-26T21:14:40Z","Content":"\n\u003Cp\u003EFunny. Even though I\u0027ve been flying flight sims for nearly two decades now, I find the default keys of KSP confusing for a different reason- pitch is reversed. My brain views the \u0022A\u0022, \u0022S\u0022, \u0022W\u0022, and \u0022D\u0022 keys as ARROW keys. So, pressing \u0022W\u0022 should make your nose go up, and pressing \u0022S\u0022 should make your nose go down. \u003C/p\u003E\u003Cp\u003EThat the \u0022A\u0022, \u0022S\u0022, \u0022W\u0022, and \u0022D\u0022 keys should be treated as arrow keys and NOT as joystick axes is further underscored by the fact that the \u0022A\u0022 and \u0022D\u0022 keys apply yaw, \u003Cem\u003Enot roll\u003C/em\u003E. If these keys were supposed to be regarded as joystick axes then shouldn\u0027t \u0022A\u0022 and \u0022D\u0022 be \u003Cem\u003Eroll\u003C/em\u003E?\u003C/p\u003E\u003Cp\u003ESo anyway, what I always do is that I reverse the functions of \u0022W\u0022 and \u0022S\u0022 and \u0022I\u0022 and \u0022K\u0022 so that they are like arrow keys, which is the standard way to treat \u0022ASWD\u0022 in video games anyway! Make \u0022W\u0022- up- make your nose go up, and \u0022S\u0022- down- make your nose go down.\u003C/p\u003E\u003Cp\u003EAn alternate setup- which wouldn\u0027t work for me but at least it would make sense- would be to make \u0022A\u0022 and \u0022D\u0022 be roll, and allow \u0022W\u0022 and \u0022S\u0022 to remain the same as they are in default. Then at least it could be logically argued that the the ASWD keys were something like joystick axes. The yaw axes would be switched to \u0022Q\u0022 and \u0022E\u0022.\u003C/p\u003E\u003Cp\u003EAnd no, I do not get confused when I switch back to using a joystick. It\u0027s just that my brain doesn\u0027t regard a joystick as being anything at all like arrow keys on a keyboard- \u003Cem\u003Ewhy in the hell should they be\u003C/em\u003E?! One is pressing four discrete buttons and the other is moving a single stick. But I\u0027ve been told that a lot of people find pressing the \u003Cem\u003Eup\u003C/em\u003E key to make your nose go \u003Cem\u003Edown\u003C/em\u003E feels natural to them, which completely boggles my mind. \u003C/p\u003E\u003Cp\u003EThe default KSP key setup really reminds me of this-\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/il-7z85lABo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-26T21:19:47Z\u0022 title=\u002209/26/2014 09:19  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 26, 2014\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"}]}