{"TopicId":85540,"ForumId":36,"TopicTitle":"[WIP](Important news)Spanners Boomsticks, Parts to complement BD Armory","CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-09-27T14:08:28Z","PageNum":2,"Articles":[{"CreatedByName":"MightyDarkStar","CreatedById":115126,"CreatedDateTime":"2014-10-10T18:32:40Z","Content":"\n\u003Cp\u003Ewhat ammo boxes are you meant to use for the respective weapons?\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-10-10T18:38:33Z","Content":"\n\u003Cp\u003E.30 cal use 30mm ammo, seems little silly. Though i\u0027m not a gun nut, it\u0027s still bothers me. I have changed it already, but i guess you should know.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-10T23:39:30Z","Content":"\n\u003Cp\u003EHey, I\u0027m working on finishing a little update including some re texturing , so any comments are welcome . I\u0027m by no means a gun nut, i just like making cool stuff ( quite happily standing on the shoulders of the plugin dev giants to do it as well!)\u003C/p\u003E\u003Cp\u003EOn some of the re textures I\u0027ve included a little numerical reference to correct ammo , I\u0027ll continue to add those, as even i sometimes get mixed up especially as I have so many different types and shapes now, But until i get the update published there are for most of them references to ammo type in the part selector window\u003C/p\u003E\u003Cp\u003EImages below as a little taster of upcoming stuff n things, The mag cannon is currently nothing more than tuned up 105, although with very high speed shells and virtually no drop over 2 km it\u0027s a fairly destructive piece of kit. Currently it\u0027s crew able by one fine Kerb although that\u0027s open to change, also likely to change is the ammo but I\u0027\u0027m loathe to scrap it, instead may come a laser version, that\u0027s already sitting in the unity waiting room awaiting completion of the Thunderkerb2.\u003C/p\u003E\u003Cp\u003EThe armed mk1 cockpit is definitely a work in progress, and although fully functional in use , the IVA is being troublesome , more bother than I\u0027ve had with any other I\u0027ve done, and constantly refuses to sit in the right position.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/YthlAJD.gif?1\u0022 alt=\u0022YthlAJD.gif?1\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAs you can see from the image , I have taken a swipe at some more stock like textures and added two new miniguns a single and double unit type, the downside for you fine lot is that the bullet storm has been dropped for now as it\u0027s a bit much. \u003C/p\u003E\u003Cp\u003EAlso any craft using the previous parts especially the dropped turrets will definitely be broken, part names having been changed in some cases for clarity \u003C/p\u003E\u003Cp\u003EMinor works have been done to most parts, with firing rates and slew rates being adjusted heavily downwards for the artillery units, more in line with reality i think., the APC dual 105 has had the range massively reduced as well as power and spread of shells and blast radius.\u003C/p\u003E\u003Cp\u003EThe new heavy duty 50 cal minigun was designed to sit on the top of a security drone and features a built in camera for those using RPM and or the probe control room allowing for remote mayhem, it also features an ammo loading simulation feeding from the built in ammo box\u003C/p\u003E\u003Cp\u003EDelivery is expected in a couple of days , or once I\u0027ve fixed the daughters car, whichever comes soonest \u003C/p\u003E\u003Cp\u003EThanks for the support and comments all useful and appreciated\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/szJnMUe.png\u0022 alt=\u0022szJnMUe.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"MightyDarkStar","CreatedById":115126,"CreatedDateTime":"2014-10-11T00:13:29Z","Content":"\n\u003Cp\u003EYeah, yeah, yeah, those new guns look nice but HOLY FRICKIN\u0027 FRICK! That cockpit literary has my jaw on the floor. The integrated guns look lovely jubely and the transparent canopy looks sweet too. I think I need to see the IVA first before I die of amazement.\u003C/p\u003E\n"},{"CreatedByName":"MightyDarkStar","CreatedById":115126,"CreatedDateTime":"2014-10-11T00:15:28Z","Content":"\n\u003Cp\u003ENot like I\u0027m trying to disown the guns at all but WOW!!\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-11T13:42:26Z","Content":"\n\u003Cp\u003EHey MDS the IVA is proving troublesome as mentioned in thread, so it\u0027s not suitable for consumption just yet, hopefully should get it nailed one way or the other this week and I\u0027ll let you have a test version.\u003C/p\u003E\n"},{"CreatedByName":"ceburas","CreatedById":43118,"CreatedDateTime":"2014-10-14T17:54:21Z","Content":"\n\u003Cp\u003Ei am anticipating that new mini-gun it looks excellent and the rpm camera sounds like a genius idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-19T19:27:38Z","Content":"\n\u003Cp\u003EThe new update has just been pushed up to Kerbal stuff after getting a couple of pokes from interested parties.\u003C/p\u003E\u003Cp\u003E Everything as mentioned previously is included, even the weaponized mk1 cockpit and a laser version of the huge mostly ornamental MAG cannon, it will destroy things but is not quite a planet popper, and the laser version is a bit limp to say the least, but it looks good,.\u003C/p\u003E\u003Cp\u003EToying with including the thing below if anyone\u0027s interested comes with built in weaponry, IVA for 4 but could be lots more and has RPM cams to deal with the lack of iva rotation in the turret, large cargo bay, and lighting and quite a few animated bits n bobs\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mtb5X1b.png\u0022 alt=\u0022mtb5X1b.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"MightyDarkStar","CreatedById":115126,"CreatedDateTime":"2014-10-19T21:35:32Z","Content":"\n\u003Cp\u003EYes! Will download tommorow!\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-19T23:21:40Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003EAnd freshly out of unity now being tested and balanced a nice little CIWS replica\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NliM8v9.png\u0022 alt=\u0022NliM8v9.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-10-20T00:00:54Z","Content":"\n\u003Cp\u003ESpanerMonkey,\u003C/p\u003E\u003Cp\u003EI have a few questions aboot the Quad 50 cannon in a marine style housing, Is there anyway to make it fire its guns one after another and not all 4 at the same time, and increase its max heat /reduce its heat gen? As it it right now it seams to overheat way to fast and (to me) It does not make seance to fire all four barrels at the same time. If memory serves me right another 4 gun Anti-air craft fired its 4 barrels in a rotating fashion to help reduce heat and increase firing time.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-20T00:04:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Damaske\u0022 data-cite=\u0022Damaske\u0022\u003E\u003Cdiv\u003ESpanerMonkey,\u003Cp\u003EI have a few questions aboot the Quad 50 cannon.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s something thats bugged me since a made it, i\u0027d much rather have it fire in the manner described , I looked at that when I finished it but couldn\u0027t get it to behave , I\u0027ll take another go as I\u0027ve had another idea regarding the how.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-10-20T00:12:46Z","Content":"\n\u003Cp\u003ENice Phalanx. Any chance of getting that in a more realistic textures? \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://media.defenceindustrydaily.com/images/ORD_Phalanx_CIWS_Firing_lg.jpg\u0022 alt=\u0022ORD_Phalanx_CIWS_Firing_lg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBasically, bright gray with a white radome.\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-10-20T00:14:38Z","Content":"\n\u003Cp\u003EMight want to ask BahamutoD about it as he has his hydra rocket pods fire in a certain order might be the same way as in this also? I\u0027ve begun to experiment with the heat myself If i find a good setting I\u0027ll post it up here to share.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-10-20T00:28:59Z","Content":"\n\u003Cp\u003EDownload is not an update...\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-10-20T01:13:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mekan1k\u0022 data-cite=\u0022Mekan1k\u0022\u003E\u003Cdiv\u003EDownload is not an update...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Econfirmed Download form both link (dropbox and Kerbalstuff) Are the older mod and does not contain the new stuff.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-20T01:37:13Z","Content":"\n\u003Cp\u003ELinks fixed , sorry for the confusion, screw up. Thanks for bringing it to my attention. as always assumption once again is the mother of all screw ups, I\u0027d assumed that the KS link was the same and forgot to delete the old dropbox version.\u003C/p\u003E\u003Cp\u003EThanks again\u003C/p\u003E\u003Cp\u003ERE alternate fire sadly the rockets and guns use two very different systems so it\u0027s not that easy, I\u0027ve made rocket launchers but not bothered adding them as there\u0027s not enough variety of designs to be worth pursuing. trying out some ideas\u003C/p\u003E\n"},{"CreatedByName":"Strayed","CreatedById":105854,"CreatedDateTime":"2014-10-20T01:40:28Z","Content":"\n\u003Cp\u003EAm i the only one getting massive issues with Tweakscale?\u003C/p\u003E\u003Cp\u003Ewhen i alt-click duplicate parts or use symmetry it auto scales the other part way way up to 5m, and there is no way to fix it. \u003C/p\u003E\u003Cp\u003EI\u0027m removing Tweakscale \u0026amp; infernal robotics, but this also doesn\u0027t happen with the other BDArmory parts.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-20T03:03:32Z","Content":"\n\u003Cp\u003EThe addition of tweakscale is very experimental, as it\u0027s not required in most cases, there is a chance of some conflict always, and I have not encountered similar issues with my install although I will check it again just to make sure, BDArmory parts do not feature tweakscale as standard and issues like yours may be the reason.\u003C/p\u003E\u003Cp\u003E Do check your log for instances of error however, while i can\u0027t fix any issues tweakscale has with the BDA plugin I can fix issues with the parts themselves\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-10-20T05:23:04Z","Content":"\n\u003Cp\u003EThe mac cannon needs a bigger shot- or a faster shot. Possibly both.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-20T11:21:20Z","Content":"\n\u003Cp\u003EAs mentioned in the intro the mag cannon is not at all as meaty as it should be, I\u0027m well aware that the performance doesn\u0027t match the size , It\u0027s early days for that particular item and making it as powerful as it should be is high on the agenda\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-10-22T20:23:16Z","Content":"\n\u003Cp\u003ECan you convert all your textures to MBM or PNG? TGA is notoriously bugged, it takes up memory and sometimes refuses to load. Seriously, don\u0027t use it.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-23T10:27:58Z","Content":"\n\u003Cp\u003EI should have them all converted to png very soon and will update as soon as they are\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-23T20:43:35Z","Content":"\n\u003Cp\u003EHi all just a quicky post to let you know that the latest update is available, more texture work, converted all textures to png , added Phalanx CIWS and single barrel 30mm Ball turret . further work on mk1 weaponised, internal and external some experimental smoke effects when firing, these are a completely new experience being the first time I\u0027ve messed with the KSP particle emitter. So they may yet disappear if I can\u0027t achieve the results I want\u003C/p\u003E\u003Cp\u003E Due to exceeding the current possibilities of the BA plugin it is not possible at this time to arrange the weapons so that multi barreled units fire in rotation or alternate.\u003C/p\u003E\u003Cp\u003E As this would entail a complete re write of the plugin please don\u0027t hold your breath, as you know Bahamuto has several mods he works on, and I\u0027m patient so you\u0027ll have to be also.\u003C/p\u003E\u003Cp\u003EThanks for your interest\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/21BVWUF.png?1\u0022 alt=\u002221BVWUF.png?1\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T20:50:25Z\u0022 title=\u002210/23/2014 08:50  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by SpannerMonkey(smce)\u003C/strong\u003E\n\u003Cbr\u003Etypo frenzy\n\u003C/span\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2014-10-26T14:45:02Z","Content":"\n\u003Cp\u003Eawww sad to hear about the non firing one after another thingy (thought it would be easy because of how the weapon manager knows how to fire bombs one after another to keep balance) but oh well.\u003C/p\u003E\u003Cp\u003Ei\u0027d like to ask if it\u0027s posible to make some more surf attach cannons? i think the cannons we get are very... bulky... and would like something like the howitzer cannon (maybe smaller?)\u003C/p\u003E\u003Cp\u003Eif i\u0027m just being an ass asking for this then just ignore it. i just thought 4 cannons and a heckton of machineguns/rockets is a bit iffy\u003C/p\u003E\n"}]}