{"TopicId":85552,"ForumId":44,"TopicTitle":"Methane Hydrates","CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-09-27T16:15:51Z","PageNum":1,"Articles":[{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-09-27T16:15:51Z","Content":"\n\u003Cp\u003EIn the October 2014 edition of Scientific American (a magazine I read) there was an article about Methane Hydrates. I am creating this thread to spread some info and see if anyone knows about Methane Hydrates.\u003C/p\u003E\u003Cp\u003ETo start things off, here are the facts about Methane Hydrates (from the scientific american): Methane hydrates are methane molecules (CH\u003Csub\u003E4\u003C/sub\u003E) that are trapped in an \u0022Ice-Crystal\u0022 Cage. They are found off almost every major shoreline at depths deeper than 3,000 feet. Methane Hydrates (as far as scientists can tell) are created when large underground methane bubbles begin seeping to the surface. When the methane comes in contact with water the water crystallizes around it. These create massive shelves at the ocean floor of methane hydrates. \u003C/p\u003E\u003Cp\u003ENow this is why they are important: Methane hydrates can release large amounts of energy when burned (like burning methane with oxygen). Also, when burned, they produce less CO\u003Csub\u003E2\u003C/sub\u003E than coal, oil, or gas. Recent discoveries have revealed these methane hydrates are being warmed by the oceans, and if the oceans reach an unknown tipping point, they could be released into the atmosphere. As some of you may know, Methane is a very potent greenhouse gas. Attempts to catch the hydrates have been relatively unsuccessful, as they are very loosely connected to the ocean floor and entire sections of the deposits break away at the slightest touch.\u003C/p\u003E\u003Cp\u003EThis is why I am writing this: Research, although on going, does not get much funding from any governments. The only nation to secure samples of methane hydrates is Japan, as they are attempting to phase out their nuclear program. Also, according to scientific american, the methane hydrates off the coast of the mainland USA hold enough energy to power the country for 2,000 years (at our current energy usage). The implications of methane hydrates are massive.\u003C/p\u003E\u003Cp\u003EWhat are you\u0027re thoughts/opinions?\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-09-27T16:22:34Z","Content":"\n\u003Cp\u003EA GREEN LIE!\u003C/p\u003E\u003Cp\u003EOil, natural gas, methane hydrates. It don\u0027t matter which you burn. They are \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EALL\u003C/strong\u003E\u003C/span\u003E fossil fuels! If you really want to make a positive impact you should switch to nuclear power and reduce carbon emissions.\u003C/p\u003E\u003Cp\u003EYes, nuclear waste is dangerous and we have no permanent solution for it yet. But after solar, hydro and wind it IS the cleanest source of energy.\u003C/p\u003E\u003Cp\u003EEdit: I forgot geothermal energy. Geothermal is of course also \u0027cleaner\u0027 than nuclear.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-27T16:46:48Z\u0022 title=\u002209/27/2014 04:46  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 27, 2014\u003C/time\u003E by Tex_NL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-27T16:41:42Z","Content":"\n\u003Cp\u003ESaying it\u0027d give off less CO\u003Csub\u003E2\u003C/sub\u003E than natural gas is misleading. Yes, there\u0027ll be a few percent less CO\u003Csub\u003E2\u003C/sub\u003E per unit energy due to the non-methane portion of natural gas, but it\u0027s going to take a lot more energy to get it out in the first place.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-09-27T16:51:48Z","Content":"\n\u003Cp\u003EAnd don\u0027t forget disturbing a methane hydrate layer can actually cause a spontaneous, cascading release of methane. You do NOT want your drilling rig sitting in a big cloud of flammable gas. Remember \u003Ca href=\u0022https://en.wikipedia.org/wiki/Piper_Alpha\u0022 rel=\u0022external nofollow\u0022\u003EPiper Alpha\u003C/a\u003E?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://technologism.net/ruscot/images/scothistory/20-21century/alpha%20piper.jpg\u0022 alt=\u0022alpha%20piper.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOK, Piper Alpha drilled for oil be the resulting fireball would be similar.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-09-27T17:01:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SelectHalfling0\u0022 data-cite=\u0022SelectHalfling0\u0022\u003E\u003Cdiv\u003EAlso, when burned, they produce less CO\u003Csub\u003E2\u003C/sub\u003E than coal, oil, or gas.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECleaner than coal and oil, but exactly the same as gas. The natural gas we currently burn is almost pure methane.\u003C/p\u003E\u003Cp\u003EThere\u0027s nothing particularly green about this source of carbon, it\u0027s still releasing a geologically sequestered carbon store into the atmosphere. The only way it could help is if it was cheaper to recover than coal so would displace some. Given where it\u0027s located that seems highly unlikely.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-09-27T20:40:57Z","Content":"\n\u003Cp\u003EMethane hydrates have also been suggested as a cause for disappearances in the Bermuda Triangle (and elsewhere). A ship in an area of a massive methane release would be unable to stay afloat in the frothing sea, and an airplane flying through a fresh methane cloud would probably ignite it (a mere spark would do it) and get knocked out of the sky. At the very least, I\u0027m not sure how the engines would perform running incredibly rich.\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-09-27T21:38:32Z","Content":"\n\u003Cp\u003EIf anyone actually read what I said, you would have noticed that I stated \u003Cem\u003Ecleaner\u003C/em\u003E than natural gas, coal, etc (not completely green). You would have also noticed I said when interacted with methane hydrates can break away (quite easily). I do thank you for finding a picture similar to the dangers methane hydrates pose.\u003C/p\u003E\u003Cp\u003EResponding to Stranded\u0027s question about using methane as fuel (for machines I presume) methane is incredibly explosive. It would probably be safer (for everyday folks) to make electricity out of it.\u003C/p\u003E\u003Cp\u003EAlso, this is not an add for different sources of energy. I want to see if anyone knows about these, and if they know of any environmental implications they have.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-09-27T21:43:28Z","Content":"\n\u003Cp\u003EI\u0027m not sure you understand; natural gas is about 95% methane. The only major difference it would have with methane derived from clathrates is the extraction would be inherently harder and thus dirtier.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-09-27T21:52:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022 data-cite=\u0022StrandedonEarth\u0022\u003E\u003Cdiv\u003EMethane hydrates have also been suggested as a cause for disappearances in the Bermuda Triangle (and elsewhere). A ship in an area of a massive methane release would be unable to stay afloat in the frothing sea, and an airplane flying through a fresh methane cloud would probably ignite it (a mere spark would do it) and get knocked out of the sky. At the very least, I\u0027m not sure how the engines would perform running incredibly rich.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGiven that the Bermuda triangle is statistically indistinguishable from any other arbitrary patch of ocean in terms of lost airplanes and ships, the problem with this explanation is that there is nothing to explain.\u003C/p\u003E\n"},{"CreatedByName":"TheGatesofLogic","CreatedById":58468,"CreatedDateTime":"2014-09-27T22:44:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EA GREEN LIE!\u003Cp\u003EOil, natural gas, methane hydrates. It don\u0027t matter which you burn. They are \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EALL\u003C/strong\u003E\u003C/span\u003E fossil fuels! If you really want to make a positive impact you should switch to nuclear power and reduce carbon emissions.\u003C/p\u003E\u003Cp\u003EYes, nuclear waste is dangerous and we have no permanent solution for it yet. But after solar, hydro and wind it IS the cleanest source of energy.\u003C/p\u003E\u003Cp\u003EEdit: I forgot geothermal energy. Geothermal is of course also \u0027cleaner\u0027 than nuclear.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENuclear is actually cleaner than solar energy, since phtovoltaic cells are made out of extremely volatile materials, and causes fewer deaths than wind. Just a point. Nuclear really is the very best energy source we have.\u003C/p\u003E\u003Cp\u003EAs for methane hydrates, people have all pointed out the issues already, it\u0027s hard to dredge them up, and after all that is it worth saving a few percent on our emissions budget? It\u0027s just not economical either.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-09-27T23:41:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheGatesofLogic\u0022 data-cite=\u0022TheGatesofLogic\u0022\u003E\u003Cdiv\u003ENuclear really is the very best energy source we have.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept for the stratospheric cost of construction. But in pretty much every other way, yeah.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-09-28T00:12:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheGatesofLogic\u0022 data-cite=\u0022TheGatesofLogic\u0022\u003E\u003Cdiv\u003ENuclear is actually cleaner than solar energy, since phtovoltaic cells are made out of extremely volatile materials, and causes fewer deaths than wind. Just a point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not quite correct. When all their external impacts are assessed nuclear does come out well (certainly better than most fossil fuels) but it still isn\u0027t as good as renewables.\u003C/p\u003E\u003Cp\u003ETake for example Pearce et al 1992 \u0022The Social Costs of Fuel Cycles\u0022, which rates various fuels in terms of external costs in UKÃ‚Â£ per MWh:\u003C/p\u003E\u003Cp\u003Ecoal = 54\u003C/p\u003E\u003Cp\u003Egas = 3.9\u003C/p\u003E\u003Cp\u003Enuclear = 4.8\u003C/p\u003E\u003Cp\u003Erenewable = 0.55\u003C/p\u003E\u003Cp\u003Eoil = 60.5\u003C/p\u003E\u003Cp\u003EThese external cost assessments attempt to take in diverse factors such as atmospheric pollution and GWP, human health, land use, damage to forestry and buildings, etc.\u003C/p\u003E\u003Cp\u003EPV cells aren\u0027t made \u003Cem\u003Efrom\u003C/em\u003E volatile materials, they\u0027re mostly just silicon which is what a large percentage of the Earth\u0027s crust is made from. The semiconductor industry does use a lot of nasty chemicals in the manufacturing process, which I assume is what you meant.\u003C/p\u003E\u003Cp\u003EContrasting nuclear to renewables is a bit pointless though. They\u0027re not competing technologies. They serve a different role in a well-balanced grid, and are complementary. A low carbon grid can (and probably should) contain substantial amounts of both.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-28T08:11:10Z\u0022 title=\u002209/28/2014 08:11  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 28, 2014\u003C/time\u003E by Seret\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-09-28T00:55:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SelectHalfling0\u0022 data-cite=\u0022SelectHalfling0\u0022\u003E\u003Cdiv\u003EResponding to Stranded\u0027s question about using methane as fuel (for machines I presume) methane is incredibly explosive. It would probably be safer (for everyday folks) to make electricity out of it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually my question was how well an aircraft engine (especially piston engines) would run when flying through a methane cloud. The fuel/air mixture would be much richer than usual. Since \u0022natural gas\u0022 is mostly methane, lots of stuff runs on it: my stove, fireplace, furnace, hot water heater...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dkmdlb\u0022 data-cite=\u0022Dkmdlb\u0022\u003E\u003Cdiv\u003EGiven that the Bermuda triangle is statistically indistinguishable from any other arbitrary patch of ocean in terms of lost airplanes and ships, the problem with this explanation is that there is nothing to explain.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is why I also stated (and elsewhere). It was floated as an explanation for unexplained disappearances in general, especially in coastal regions. The Bermuda Triangle is merely the \u0022poster boy\u0022 for unexplained disappearances.\u003C/p\u003E\n"},{"CreatedByName":"TheGatesofLogic","CreatedById":58468,"CreatedDateTime":"2014-09-28T23:56:06Z","Content":"\n\u003Cp\u003EYou\u0027re probably right on that, didn\u0027t think it through very much, but the danger to human life aspect I mentioned is still very valid. And you\u0027re right in that they don\u0027t really compete, except in government investments. Government investments into \u0022pure\u0022 renewables looks better than investment into nuclear energy even though the actually Wattage gain on the grid for such investments is less than nuclear. In that way the transition to a purer grid is slowed. What should be happening is a full switch to nuclear THEN a balancing of that system with other renewables. Unfortunately, because of nuclear capital costs, this would run into other issues as well :/\u003C/p\u003E\n"},{"CreatedByName":"Idobox","CreatedById":80299,"CreatedDateTime":"2014-09-30T17:28:05Z","Content":"\n\u003Cp\u003EOne good reason to exploit clathrates is that we really don\u0027t want them to be released in an uncontrolled manner.\u003C/p\u003E\u003Cp\u003EMethane is a much more potent greenhouse gas than CO2, and a common catastrophe scenario is that when they start releasing the stored methane, it could cause a very strong positive feedback loop and a \u0022flash heating \u0022 over a few years/decade, until the methane is destroyed (O2/CH4 mixture is inherently unstable, even at low temperatures).\u003C/p\u003E\u003Cp\u003EIf something like that is indeed possible, then extracting the methane, even if it is to burn it without using the energy, might still be preferable.\u003C/p\u003E\u003Cp\u003EA similar catastrophe scenario involves the permafrost thawing and releasing massive amounts of methane by putrefaction of accumulated frozen biological waste.\u003C/p\u003E\u003Cp\u003EFinally nuclear energy is great, but we don\u0027t know how expensive decommissioning modern power plants is, and it is also not very flexible (most of the cost is in the construction, so you don\u0027t really want to stop it or reduce the power output). We\u0027re running on 70-80% nukes in France, and it\u0027s a good things our neighbours don\u0027t, other wise the lack of flexibility would make it much more expensive.\u003C/p\u003E\u003Cp\u003EThe best energy is the one you don\u0027t use. Replace suburbs by dense, well insulated housing and you just saved between 30 and 50% of rich countries\u0027 consumption.\u003C/p\u003E\n"}]}