{"TopicId":85769,"ForumId":32,"TopicTitle":"KSP Skill level poll","CreatedByName":"Kallisto","CreatedById":98761,"CreatedDateTime":"2014-09-30T16:55:16Z","PageNum":8,"Articles":[{"CreatedByName":"el_coyoto","CreatedById":49292,"CreatedDateTime":"2015-04-14T11:22:28Z","Content":"\n\u003Cp\u003EQ1 : 4\u003C/p\u003E\u003Cp\u003EQ2 : 4\u003C/p\u003E\u003Cp\u003EQ3 : 24\u003C/p\u003E\u003Cp\u003EQ4 : 10\u003C/p\u003E\u003Cp\u003EQ5 : 16 (did a grand total of 2 ARM, but saving Kerbin from dino killers was fun)\u003C/p\u003E\u003Cp\u003EOQ1 : 0 (No \u0022serious\u0022 mods)\u003C/p\u003E\u003Cp\u003EOQ2 : 0 (I rely A LOT on reverts and quicksaves)\u003C/p\u003E\u003Cp\u003EQ6 : 105 (never returned from Tylo but returned a big aerospike bundle with a command chair from Eve, not from sea level though)\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003ETotal = 163\u003C/p\u003E\u003Cp\u003EFinal score : 163/20 = 8.15\u003C/p\u003E\u003Cp\u003EAt first, I thought the test was more targeted at people discovering the game, but I realized while answering it that docking and asteroid redirection are a good way to gauge the \u0022skill\u0022 of a player (or his familiarity with the game).\u003C/p\u003E\u003Cp\u003EMy only concern would be returning from Moho, which felt like a nightmare to me and is worth only 5 points... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-04-14T11:29:37Z","Content":"\n\u003Cp\u003EInteresting. Only 7.55 since I\u0027ve never done an ARM. A bit ironic considering I started playing in 0.23.5.\u003C/p\u003E\u003Cp\u003EThis poll is definitely oriented toward exploration/piloting. It seems likely that that is one of the more common things for a playstyle to focus on.\u003C/p\u003E\u003Cp\u003EI\u0027ve tried to imagine what an engineering/orbital construction skills poll might look like. Might be worth a try.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-04-14T16:26:23Z","Content":"\n\u003Cp\u003EOk...\u003C/p\u003E\u003Cp\u003EQ: Have you ever achieved a stable orbit around Kerbin?(2 points)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYes=2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EQ: Have you ever landed and returned from the Mun?(4 points)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYes=4\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EQ: Have you ever landed and returned from Minmus?(4 points)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYes=4\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EQ: On how many objects outside the Kerbin system(which includes Kerbin, the Mun and Minmus) have you landed on(doesn\u0027t have to be a return mission)(2 points per object, or 24 if you\u0027ve landed on all)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E24\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EQ: Have you ever successfully docked?(10 points)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYes=10\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EQ: Have you ever intercepted an asteroid?(16 points)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYes=16\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOptional question 1(if you use mods): How many of the following difficulty enhancing mods: TAC life support, Remote Tech, Deadly Reentry, FAR, RSS; have you used at the same time in a save?(4 points per mod)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERT,DRE,FAR=12\u003C/strong\u003E (I also use persistentrotation,kerbalmass,RWsaturatable)\u003C/p\u003E\u003Cp\u003EOptional question 2(if you don\u0027t use mods): Do you rarely(in less than half of your career saves) use reverts/reloads? If only your revertless/reloadless worlds were counted, would the amount of \u0027yes\u0027 answers to the above questions be roughly the same?(\u002B0.25 points for every \u0027yes\u0027 answer to the above questions that would remain the same, not including optional question 1)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENot sure, I don\u0027t use revert/reload in my DR,RT,FAR career games though. Guessing 0 for this one\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EQ: On which of the following objects outside the Kerbin system have you done successful return missions: Duna(2.5 points), Ike(2.5 points), Dres(5 points), Moho(5 points), Gilly(5 points), Laythe(10 points), Vall(10 points), Bop(10 points), Pol(10 points), Tylo(15 points), Eeloo(15 points), Eve(30 points)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAll except Eve=(2.5\u002B2.5\u002B5\u002B5\u002B5\u002B10\u002B10\u002B10\u002B10\u002B15\u002B15)=95\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo my score is (2\u002B4\u002B4\u002B24\u002B10\u002B16\u002B12\u002B95)=167/20=8.35\u003C/p\u003E\u003Cp\u003EJust realised the max score is 205/20=10.25\u003C/p\u003E\u003Cp\u003EA suggestion for future polls might be \u0027have you done any of the following challenges, Eve rocks, Jool 5, Take me to the moons or Grand tour\u0027 with increasing points for each.\u003C/p\u003E\u003Cp\u003ERight, off to return from Eve to add 1.5 points to my score.\u003C/p\u003E\n"}]}