{"TopicId":86265,"ForumId":25,"TopicTitle":"The Eve Rocks Challenge (v0.90 only)","CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-06T23:26:12Z","PageNum":6,"Articles":[{"CreatedByName":"Zipmafia","CreatedById":108469,"CreatedDateTime":"2014-11-11T18:46:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOne thing I didn\u0027t test is the spaceplane\u0027s capability to fly around Eve, as-well as it\u0027s ability to lift up from it. I guess we\u0027ll find out!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet us know how this goes, I have tried several times and failed each time. In fact there is a thread about if it is even possible with a SSTO spaceplane. \u003C/p\u003E\u003Cp\u003EI find that lift surfaces do you no good unless you are gliding in for a landing, or you have oxygen to burn. Otherwise it is probably going to be more efficient to fly straight up, then gravity turn. \u003C/p\u003E\u003Cp\u003EYou might want to try out multiple stages, or a cargo bay with your return capsule inside.\u003C/p\u003E\n"},{"CreatedByName":"2001kraft","CreatedById":120475,"CreatedDateTime":"2014-11-11T19:03:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zipmafia\u0022 data-cite=\u0022Zipmafia\u0022\u003E\u003Cdiv\u003Eor a cargo bay with your return capsule inside.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eif you remember my original idea with a lander inside the cargo bay, well, it failed worse than expected.\u003C/p\u003E\u003Cp\u003Eattempting to fit in a multiple-stage lifter was painful, and required several launches and docking the lander all over in eve orbit, well...i used KAS to try to attach struts to it in orbit, then added radial parachutes also using KAS. It didn\u0027t work or help. The lander broke up in Eve atmosphere, and the parachutes completely tore the remains apart. My only other plan now is to add parachutes to the spaceplane as to save fuel on burning retrograde to stop my steep descend, since I plan on landing close to water. Next up is just the capabilities of the spaceplane. Hopefully it will work.\u003C/p\u003E\n"},{"CreatedByName":"hazard-ish","CreatedById":115844,"CreatedDateTime":"2014-11-11T20:24:39Z","Content":"\n\u003Cp\u003EI\u0027ve been visiting this thread for a while now just to check on it. I am currently doing a career mode series on my youtube channel wher I also set my self the goal of performing a return mission (and planting a flag) on every object in the game without quicksaves. I have just recnelty completed the jool 5 challenge in my last few videos and all that remains now is an even return mission.\u003C/p\u003E\u003Cp\u003EOnce my jool 5 challenge is all sorted out on the forums I will turn my attention to recording my entry for this challenge! (Again, without quicksaves). I\u0027ve already conducted some tests and have got a pretty good eve lander that is definitely over-engineered but one of my favourite things i\u0027ve every built too! It weighs just over 36 tonnes and the lander itself costs just under 100,000 funds. The lifting stage will require some tweaks but the entire rocket for the mission should cost no more than about 430,000 funds which would make it the lightest one yet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor the mean time I will only be attempting the first level of the challenge but as an added bonus I will also visit gilly in the same mission. I will also be completing the challenge in version 0.24.2.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-11-11T20:55:50Z","Content":"\n\u003Cp\u003E36 tonnes?! Do you use Mk1 lander can? What altitude do you start at, and what are atmo stats? Could you post a couple of screenshots ahead, please? I\u0027m yearning to see it.\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2014-11-11T21:58:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003E36 tonnes?! Do you use Mk1 lander can? What altitude do you start at, and what are atmo stats? Could you post a couple of screenshots ahead, please? I\u0027m yearning to see it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMe too. Unless there are mods involved, it would need to have just an external seat and be a massively asparagused lander using nothing but 48-7S engines underneath FLT200s.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-11T22:10:16Z","Content":"\n\u003Cp\u003EIt is a bit surprising how light a high altitude Eve ascent vehicle can be made, 36t with a Mk1 lander can in stock is \u003Ca href=\u0022forum.kerbalspaceprogram.com/threads/76153\u0022 rel=\u0022external nofollow\u0022\u003Ecertainly possible\u003C/a\u003E. Lots of design ideas in that thread for those doing this challenge.\u003C/p\u003E\u003Cp\u003EEdit for Norcalplanner\u0027s response below: That thread was after the aerospike nerf, same performance as they have now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-11T23:08:05Z\u0022 title=\u002211/11/2014 11:08  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 11, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2014-11-11T22:47:15Z","Content":"\n\u003Cp\u003EOK Hazard-ish, you definitely know your way around a light lander. I just finished watching your Tylo landing and was impressed at the small size of your craft.\u003C/p\u003E\u003Cp\u003ERed Iron Crown, thanks for pointing out that earlier thread. I\u0027m trying to recall if that earlier thread was before or after the aerospikes got nerfed - I know that my first successful Eve ascent used them.\u003C/p\u003E\n"},{"CreatedByName":"hazard-ish","CreatedById":115844,"CreatedDateTime":"2014-11-11T22:56:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norcalplanner\u0022 data-cite=\u0022Norcalplanner\u0022\u003E\u003Cdiv\u003EMe too. Unless there are mods involved, it would need to have just an external seat and be a massively asparagused lander using nothing but 48-7S engines underneath FLT200s.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha, that pretty much sums it up. I don\u0027t use mods in my current career mode series on youtube and I would\u0027t consider doing so for (my first time at least) such a grand challenge as this. However, your description of my lander is pretty accurate. I also sadly only use a command seat for the lander (if that\u0027s okay?) I hope that isn\u0027t cheating in some way. One day I may attempt a the man lander but currently I\u0027ve never returned from Eve so i\u0027ll stick to basics. I also built my design around using a rover to get to the highest point on Eve. However, after the wheels broke I decided to test launching from Eve from my current position and i turns out that my lander can get into an orbit with plenty of fuel to spare from an altitude of about 5100m. (I had aimed at launch from the highest point but more on that later).\u003C/p\u003E\u003Cp\u003E36.6 tonnes if I remember correctly is what my lander weighs. It is either 346 or 446 parts (either is quite a lot!) and uses an extensive but simple asparagus system. I cannot post pictures now but I will do in the future! I\u0027ve gone through many versions of my lander, some using aerospikes but I have since settled for the lightweight appproach (although I though 36 tonnes was a lot). My lightest Eve lander that is capable of orbit weighs 23 tones but requires being launched from the highest point on Eve, about 7500m above sea level. This is very hard to do, however, as I am not an expert in precision landings. I\u0027ll continue this mission log/profile/whatever later when I also have screenshots to back everything up and show you what I mean.\u003C/p\u003E\u003Cp\u003EHopefully using a command seat and lots of asparagus has\u0027t made my attempt seem less impressive \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf it\u0027s any consolation, one of my initial concepts has a 54 stage asparagus system that took my about 90 minutes to get my head around and build at 2fps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2014-11-11T23:05:13Z","Content":"\n\u003Cp\u003EHi All \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is my Eve Rocks Challenge (Eve sample \u002B Eve sea sample) \u0022without Kethane\u0022 no refueling one shot last try \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Craft file of \u003Ca href=\u0022https://drive.google.com/file/d/0B2QsqoF78kPFQmx3WU5VQkxGMjg/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003E\u0022Eve Jeb Landing AR 9\u0022\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E379526$ ( - 279124$ reuseable SSTO Lifter - final kerbin lander = less than 100000$ final cost ) less than 99 Tons at launch from Kerbin, and less than 20 Tons ready to Launch at 7500m on Eve.\u003C/p\u003E\u003Cp\u003E553 parts full stock \u002B MechJeb2.\u003C/p\u003E\u003Cp\u003EKSP 0.25.\u003C/p\u003E\u003Cp\u003EI found this 7500m landing site some month ago with SCANsat.v6.1 mod and some hours of testing.... xD\u003C/p\u003E\u003Cp\u003EYou have to reach Eve with about 24Ã‚Â° inclined orbit and wait to be above to reach the landing site without burning to much fuel.\u003C/p\u003E\u003Cp\u003EAlso wait to be in the plane of the orbiter waiting for you before to leave Eve...\u003C/p\u003E\u003Cp\u003EI had to reload several times to undock the glider without breaking it...\u003C/p\u003E\u003Cp\u003EAND MechJeb2 Helped me a lot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso Thank You very much for the other players posts who helped me a lot, and mostly Tavert in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/76153-Lightest-Eve-Lander\u0022 rel=\u0022external nofollow\u0022\u003E\u0022Lightest Eve Lander\u0022\u003C/a\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Odyssey Album:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/mf1na\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E3 Hours of rover to return 7500m was the hardest part... xD\u003C/p\u003E\u003Cp\u003EHope you will love it ^^\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-11T23:28:13Z\u0022 title=\u002211/11/2014 11:28  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 11, 2014\u003C/time\u003E by astrobond\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-11-11T23:50:00Z","Content":"\n\u003Cp\u003E^^ Wow. I\u0027d make you the winner if I were a referee in this challenge. You really did the smartest thing. Really, why are we trying to land these cans at sea level when we care about science. There\u0027s no need to haul a hell lot of iron when you can get there by land at much lower cost.\u003C/p\u003E\u003Cp\u003EI wanted to make something as compact as possible, but you outperformed by far any expectations.\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-11-12T00:11:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003ETalking about refueling: in LKO, I will be content if you showcase your solution once. After that, you may resort to magic. No need to actually fly a dozen boring milk runs. However, I do want to see a solution that seems halfways adequate. Don\u0027t tell me you\u0027d deliver the fuel a spoonful at a time. (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php?p=1533810#post1533810\u0022 rel=\u0022external nofollow\u0022\u003Emore\u003C/a\u003E)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPhew. I refer you to the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/77742-Confess-your-KSP-sins?p=1117704#post1117704\u0022 rel=\u0022external nofollow\u0022\u003Eonly KSP sin I ever confessed\u003C/a\u003E. Time for some magic !!\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2014-11-12T00:27:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hazard-ish\u0022 data-cite=\u0022hazard-ish\u0022\u003E\u003Cdiv\u003EI also sadly only use a command seat for the lander (if that\u0027s okay?) I hope that isn\u0027t cheating in some way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt the risk of being Debbie Downer, the rules for the challenge include a requirement that the kerbal be inside a pod or capsule. Sorry. :-(\u003C/p\u003E\n"},{"CreatedByName":"MAV3RICK","CreatedById":128899,"CreatedDateTime":"2014-11-12T00:38:03Z","Content":"\n\u003Cp\u003EMy Level 1 mission (apologies to Laie, this was from a few months ago - I recreated as much as I could of the mission, but some stuff will be missing).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVersion\u003C/strong\u003E: 0.24\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMods\u003C/strong\u003E: Kerbal Engineer Redux during design, otherwise stock.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOverview: \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EA multi-launch mission, including reconnaissance and marking of chosen landing site, refueling of main lander craft, interplanetary transfer, landing, ascent and return to Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe landing site: \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EChosen using \u003Ca href=\u0022http://www.kerbalmaps.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalmaps.com/\u003C/a\u003E, at [spoiler, white text] 28\u003Csup\u003Eo\u003C/sup\u003E 54\u0027 20\u0022 S, 147\u003Csup\u003Eo\u003C/sup\u003E 54\u0027 39\u0022 W. The site is over 6500m in elevation and relatively flat at the top, although surrounded by steep slopes. [end spoiler]. The site was marked using the rover (below), which itself used the unmanned plane in the same launch as its own marker for rough location.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELanding site marker:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EParts: 250\u003C/p\u003E\u003Cp\u003EWeight: 334.56t in 11 stages\u003C/p\u003E\u003Cp\u003ECost: 240151 Funds\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELander launch:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EParts: 495\u003C/p\u003E\u003Cp\u003EWeight: 544.07t in 20 stages\u003C/p\u003E\u003Cp\u003ECost: 512257 Funds\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cstrong\u003ERefueller:\u003C/strong\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EParts: 158\u003C/p\u003E\u003Cp\u003EWeight: 608.05t in 4 stages\u003C/p\u003E\u003Cp\u003ECost: 326753 Funds (though the mission did require this to be launched around 4 times to refuel the lander and interplanetary craft once docked).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EInterplanetary transfer:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EParts: 197\u003C/p\u003E\u003Cp\u003EWeight: 71.01t in 4 stages\u003C/p\u003E\u003Cp\u003ECost: 368982 Funds\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESSTO\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EParts: 97\u003C/p\u003E\u003Cp\u003EWeight: 11.24t in 1 stage (I used action groups to control the engines)\u003C/p\u003E\u003Cp\u003ECost: 28586 Funds\u003C/p\u003E\u003Cp\u003EProcess:\u003C/p\u003E\u003Cp\u003ELaunch marker rovers, place at landing site.\u003C/p\u003E\u003Cp\u003ELaunch lander (it will get into orbit... with just fumes remaining).\u003C/p\u003E\u003Cp\u003ELaunch refuelling ship(s) - around 4 of these if memory serves.\u003C/p\u003E\u003Cp\u003ELaunch interplanerary ship to dock with lander\u003C/p\u003E\u003Cp\u003EGo to Eve\u003C/p\u003E\u003Cp\u003ELand at site - very much trial and error here, though some of the charts I\u0027ve found on the forums for equatorial landing heights and angles helped as well.\u003C/p\u003E\u003Cp\u003ECollect science\u003C/p\u003E\u003Cp\u003ELaunch from Eve\u003C/p\u003E\u003Cp\u003EGet into LKO\u003C/p\u003E\u003Cp\u003ELaunch SSTO rescue plane.\u003C/p\u003E\u003Cp\u003ELand at KSC for tea and medals.\u003C/p\u003E\u003Cp\u003ETotal missions cost (approx)\u003C/p\u003E\u003Cp\u003E2.8M Funds\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EImage gallery:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/zjuyh\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/zjuyh\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"2001kraft","CreatedById":120475,"CreatedDateTime":"2014-11-12T01:46:02Z","Content":"\n\u003Cp\u003EFailed completely. Just..\u003C/p\u003E\u003Cp\u003Eit went awful.\u003C/p\u003E\u003Cp\u003EIt made it to orbit super well, it was all fine and dandy. Then, I docked, re-fueled, and set out to Eve.\u003C/p\u003E\u003Cp\u003EIt barely made it into orbit, had 11 units of fuel left. I docked with my station, re-fueled, and when I was getting out of orbit...guess what happened..my fuel was at 9 units of fuel.\u003C/p\u003E\u003Cp\u003EI skipped across the atmosphere, did another orbit, and then re-entered again. Parachutes opened, 2/6 tore off. I landed on the ocean instead of coast, my spaceplane broke up into cockpit and rest of the body. When I set out to take a surface sample from the ocean, a kraken occurred and everything on the surface exploded.\u003C/p\u003E\u003Cp\u003EI will be trying again later, now with an even more-staged process.\u003C/p\u003E\u003Cp\u003EIt\u0027s actually my first interplanetary attempt like that, the only other thing I flew to was the Mun, so I guess not that bad for a first try \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI guess the main problem with this is that it doesn\u0027t have enough fuel. At all.\u003C/p\u003E\u003Cp\u003EOh and by the way, remember that rover? Lol, I didn\u0027t rotate my cargo bay the right way, so when I dropped it in hope of it getting to the coast since it\u0027s lighter, it just tore off my tail. I re-tested the rover on Eve this time, and guess what..it just doesn\u0027t drive. So, I guess no rovers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-12T01:48:10Z\u0022 title=\u002211/12/2014 01:48  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 12, 2014\u003C/time\u003E by 2001kraft\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-11-12T04:25:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00222001kraft\u0022 data-cite=\u00222001kraft\u0022\u003E\u003Cdiv\u003EFailed completely. Just..\u003Cp\u003Eit went awful.\u003C/p\u003E\u003Cp\u003EIt made it to orbit super well, it was all fine and dandy. Then, I docked, re-fueled, and set out to Eve.\u003C/p\u003E\u003Cp\u003EIt barely made it into orbit, had 11 units of fuel left. I docked with my station, re-fueled, and when I was getting out of orbit...guess what happened..my fuel was at 9 units of fuel.\u003C/p\u003E\u003Cp\u003EI skipped across the atmosphere, did another orbit, and then re-entered again. Parachutes opened, 2/6 tore off. I landed on the ocean instead of coast, my spaceplane broke up into cockpit and rest of the body. When I set out to take a surface sample from the ocean, a kraken occurred and everything on the surface exploded.\u003C/p\u003E\u003Cp\u003EI will be trying again later, now with an even more-staged process.\u003C/p\u003E\u003Cp\u003EIt\u0027s actually my first interplanetary attempt like that, the only other thing I flew to was the Mun, so I guess not that bad for a first try \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI guess the main problem with this is that it doesn\u0027t have enough fuel. At all.\u003C/p\u003E\u003Cp\u003EOh and by the way, remember that rover? Lol, I didn\u0027t rotate my cargo bay the right way, so when I dropped it in hope of it getting to the coast since it\u0027s lighter, it just tore off my tail. I re-tested the rover on Eve this time, and guess what..it just doesn\u0027t drive. So, I guess no rovers.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEve\u0027s gravity used to be 1.3G until we all dropped such a mass of rocket bits onto it. I\u0027ll bet if I opened up previous versions of the game and tallied up I have 5000T of stuff strewn across the surface all on my own. The seas are purple because that\u0027s the colour into which Kerbin metal and rocket doodads bio-degrade.\u003C/p\u003E\n"},{"CreatedByName":"hazard-ish","CreatedById":115844,"CreatedDateTime":"2014-11-12T07:23:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norcalplanner\u0022 data-cite=\u0022Norcalplanner\u0022\u003E\u003Cdiv\u003EAt the risk of being Debbie Downer, the rules for the challenge include a requirement that the kerbal be inside a pod or capsule. Sorry. :-(\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha, damn. That has certainly put a spanner in the works but is certainly something I can fix. My current design is capable of getting into orbit with quite a bit of fuel left from much lower on Ev\u0027es surface than I expected so by adding only an extra 0.66 tonnes I might still be okay! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks for letting me know, at least I know now rather than after I\u0027ve done the entire mission \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NQMT","CreatedById":79402,"CreatedDateTime":"2014-11-12T08:28:15Z","Content":"\n\u003Ca href=\u0022https://www.facebook.com/kerbalspaceprogram/photos/a.240767269275838.66315.240760572609841/886018534750705/?type=1\u0022 rel=\u0022external nofollow\u0022\u003ELook where Norcalplanner got to!\u003C/a\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2014-11-12T08:45:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kyrian\u0022 data-cite=\u0022Kyrian\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://www.facebook.com/kerbalspaceprogram/photos/a.240767269275838.66315.240760572609841/886018534750705/?type=1\u0022 rel=\u0022external nofollow\u0022\u003ELook where Norcalplanner got to!\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, dang! I had no idea that Squad had posted that until just a few minutes ago. Thanks for the shout out!\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-12T10:44:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astrobond\u0022 data-cite=\u0022astrobond\u0022\u003E\u003Cdiv\u003EHere is my Eve Rocks Challenge (Eve sample \u002B Eve sea sample) \u0022without Kethane\u0022 no refueling one shot last try \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003E^^ Wow. I\u0027d make you the winner if I were a referee in this challenge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhoa. This is not the kind of challenge where there can be a \u0022winner\u0022, but... wow. \u003C/p\u003E\u003Cp\u003EThe only downside is that you turned off the interface most off the time. This is not only about me being able to verify that you didn\u0027t cheat -- although that\u0027s a consideration, too: lacking any data to go by I will have to download and fly that craft myself. I don\u0027t doubt the outcome, not in this case, which makes this a pointless exercise and a waste of time. Yet I feel obliged to show a certain degree of diligence, and it may be a day or two until I get around to do it. You could save me the hassle, and yourself the wait, if you just showed some data.\u003C/p\u003E\u003Cp\u003EThe other reason is that in preparing my own mission, I was looking at the galleries I could find, and actively trying to make sense of the data that was available in the pictures: \u0022so he took off at mission time X, and the next pic shows him N seconds later at an alitude of Y... Mechjeb has throttled down, so this must be terminal velocity...\u0022 I understand that cluttering the screen with info panels doesn\u0027t make for exceptionally nice screenshots, and there can certainly be too much data, but Navball and altimeter aren\u0027t too much, and the data is vital. Toss in the resource panel as a basic cheat-proofing measure and I\u0027m happy.\u003C/p\u003E\u003Cp\u003EAll that nastiness for a missions that is, in essence, beautiful. I\u0027m sorry.\u003C/p\u003E\u003Cp\u003EIt makes me wonder if I put up the right challenge in the first place. The levels 1-4 mostly deal with bringing ever more powerful ships... as it has turned out, this doesn\u0027t add very much to the challenge. It also serves no real purpose, while this mission certainly does. \u003Cstrong\u003EIdeas, anyone?\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2014-11-12T11:18:21Z","Content":"\n\u003Cp\u003EHi all, my beta mission is almost done. Just a few steps left. ATM I need to collect the ocean sample and I am omw with the rover.\u003C/p\u003E\u003Cp\u003EHere are a few pics. I did not drop the rover on Gilly cause it could be a) boring \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E useless c) you might go to orbit with an easy jump. The ion lander performed as expected, it will be left in Eve\u0027s orbit with the mothership core (kinda like an escape boat for the unlucky one who will crew the refuelling station).\u003C/p\u003E\u003Cp\u003EThe new descent module I used for the main lander (D-Block/LK inspired) performed really well, however there is still room for improvements. I tried a new landing spot around 2600m.\u003C/p\u003E\u003Cp\u003EI had an issue with the rover (flat tyre @ landing), tbh my landing speed was 5.9 m/s, I do not think this should happen. The ocean is \u002B/- 80 Km eastbound\u003C/p\u003E\u003Cp\u003EI plan to find the time to finish the mission in a couple of days. \u003C/p\u003E\u003Cp\u003EOf course if you have any question just ask. \u003C/p\u003E\u003Cp\u003EI will not bother you with 40000000000 slides, so if there is anything you want to have a closer look at just let me know. I\u0027ve got all that 4000000000 slides.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/KaQ07\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2014-11-12T11:35:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EWhoa. This is not the kind of challenge where there can be a \u0022winner\u0022, but... wow. \u003Cp\u003EThe only downside is that you turned off the interface most off the time. This is not only about me being able to verify that you didn\u0027t cheat -- although that\u0027s a consideration, too: lacking any data to go by I will have to download and fly that craft myself. I don\u0027t doubt the outcome, not in this case, which makes this a pointless exercise and a waste of time. Yet I feel obliged to show a certain degree of diligence, and it may be a day or two until I get around to do it. You could save me the hassle, and yourself the wait, if you just showed some data.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for the \u0022wow\u0022 Laie \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI made a save of the game before lift off on Eve, do you need only the detailed screen of this chapter or all the mission ?\u003C/p\u003E\u003Cp\u003EIf you need only the Eve lift off to orbit, I can do that quickly, or even a video if you want \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBTW, I\u0027m also working on a \u003Cspan style=\u0022color:#0000cd;\u0022\u003EJebediah\u0027s Level\u003C/span\u003E version so I will make a fully detailed album this time... xD\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-12T13:50:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astrobond\u0022 data-cite=\u0022astrobond\u0022\u003E\u003Cdiv\u003EThank you for the \u0022wow\u0022 Laie \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EI made a save of the game before lift off on Eve, do you need only the detailed screen of this chapter or all the mission ?\u003C/p\u003E\u003Cp\u003EIf you need only the Eve lift off to orbit, I can do that quickly, or even a video if you want \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat wow is heartfelt.\u003C/p\u003E\u003Cp\u003EAs far as rulemongering is concerned, the Eve ascent will do. No need to replay the entire mission. Though I\u0027m curious about how that glider did in Eve\u0027s atmosphere, too: it looks like a swift descent, but without navball and mission time that\u0027s hard to tell. If you could add a few comments to that effect while updating the gallery, that would be most kind.\u003C/p\u003E\u003Cp\u003EAnd about going for Jebediah\u0027s level: You just did a wonderful Eve Exploration Mission and tell me that you\u0027re not happy with it and want to come back for Jebediah\u0027s level -- which would, at best, be just more of the same, and at worst would make you compromise on everything that is nice and beautiful, just for the sake of landing a bigger ship at lower altitude. I take this as a sign that I\u0027ve got the incentives all wrong.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@everybody:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d like to change the levels of achievement so that a good mission will be ranked higher than one that is merely big.\u003C/p\u003E\u003Cp\u003EMain problem: is that even an option? There\u0027s at least three missions in the making, and possibly quite a few more of which I haven\u0027t heard yet. Changing the rules on them in mid-flight doesn\u0027t seem fair.\u003C/p\u003E\u003Cp\u003ESecond problem: what constitutes a good mission, anyway? Returning a full set of science reports?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-12T14:00:10Z\u0022 title=\u002211/12/2014 02:00  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 12, 2014\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-11-12T14:38:38Z","Content":"\n\u003Cp\u003E@Laie: I had the same problem at JOOL-5 at the beginning and there were two ways ahead of me: introducing some kind of point system to get rid off the subjective judgement but this will change the motivation from doing an Eve-return to be the first on the list and will hold back many \u0022less-interesting\u0022 attempts (as we discussed before), or just add detailed comments in the notes so the readers can see and distinct the missions on their own. I decided on the second way.\u003C/p\u003E\u003Cp\u003EThere might be a list order so the better/complex/more elegant mission goes first in the lists but that would be subjective too. I decided to just note the details of the missions which will indicate how it was built up. Sometimes I used bold text, and when himynameisjake made a JOOL-5 Grand Tour he got a whole new level. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Emod","CreatedById":109552,"CreatedDateTime":"2014-11-12T16:20:49Z","Content":"\n\u003Cp\u003EAh, Eve my favourite purple planet! Thank you.\u003C/p\u003E\u003Cp\u003EHere\u0027s my contribution: Eve Concept V5\u003C/p\u003E\u003Cp\u003E1375 ton and 616 parts in 25 stages for the price of 790000 funds.\u003C/p\u003E\u003Cp\u003EIt has a comfy 113-ton 145-part sea level lander, rover and a scout rover to send down.\u003C/p\u003E\u003Cp\u003ELanding sites are usually shores near the equator, found with the tiny scout rover. Landing in water (or whatever it is) works too.\u003C/p\u003E\u003Cp\u003EHowever, with all the failed attemps and totally misplaced landings I\u0027ve found that Eve\u0027s mountains are really beautiful sometimes.\u003C/p\u003E\u003Cp\u003EI\u0027m a little proud of the horizontal staging system, it\u0027s odd but works. Also the rover throw-off from the lander looks kind of cool when you see it from inside the lander.\u003C/p\u003E\u003Cp\u003EMain thing with this ship is to make it user friendly, for you guys \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMechJeb is the only mod used.\u003C/p\u003E\u003Cp\u003EI guess I\u0027m in for level 3 then.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://kasplutt.dlinkddns.com/L/eveconceptv5.jpg\u0022 alt=\u0022eveconceptv5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETried to make it rocket-like too..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://kasplutt.dlinkddns.com/L/eveconceptv52.jpg\u0022 alt=\u0022eveconceptv52.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s made for 0.23.5 version but still works, just with smaller margins. Thread and download here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84643-Eve-Concept-Single-launch-Eve-sea-level-can-lander-and-rover\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/84643-Eve-Concept-Single-launch-Eve-sea-level-can-lander-and-rover\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEarlier version flown here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78841-Single-Launch-to-Eve-and-return-Challenge?p=1141156\u0026amp;viewfull=1#post1141156\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/78841-Single-Launch-to-Eve-and-return-Challenge?p=1141156\u0026amp;viewfull=1#post1141156\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHave fun!\u003C/p\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2014-11-12T18:14:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EThat wow is heartfelt.\u003Cp\u003EAs far as rulemongering is concerned, the Eve ascent will do. No need to replay the entire mission. Though I\u0027m curious about how that glider did in Eve\u0027s atmosphere, too: it looks like a swift descent, but without navball and mission time that\u0027s hard to tell. If you could add a few comments to that effect while updating the gallery, that would be most kind.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi Laie and All \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot so good at speaking English, but hopefully I had also the idea to backup a save with the glider ready to takeoff too !!! so here are the two \u0022new datas albums\u0022 ^^\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/uSEsd\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/RBGIM\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EHope this help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh and I love this challenge, that\u0027s why I also want to test the \u0022big ship\u0022 version ^^ just for fun.. I think it\u0027s the best way to play... for fun !\u003C/p\u003E\n"}]}