{"TopicId":86265,"ForumId":25,"TopicTitle":"The Eve Rocks Challenge (v0.90 only)","CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-06T23:26:12Z","PageNum":11,"Articles":[{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-12-13T21:53:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRex94\u0022 data-cite=\u0022SkyRex94\u0022\u003E\u003Cdiv\u003EYeah okay I admit it is not optimal documented. As a maybe little excuse: It was my first mission log made as a Video and not as a slideshow, so i kinda forgot to hit F1 as often as i may have done in lets say my Jool 5 Log (over 400 pics), because i simply thought \u0022Yeah why pictures, all can be seen in the video at the end\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I know how it happens. If I look at my own slideshows, they\u0027re not what I\u0027d like them to be. As said a few pages back, making a good mission report is an art. 400 pics for Jool-5 is way over the top btw, but with a gallery it\u0027s a lot easier to skip some and closely inspect others.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2014-12-13T23:28:59Z","Content":"\n\u003Cp\u003EHere\u0027s a pretty good lander\u002Borbiter I made if anyone is struggling to make one: \u003Ca href=\u0022https://www.dropbox.com/s/gl4boigw8qivilw/Eve%20lifter%201a%20with%20lander.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/gl4boigw8qivilw/Eve%20lifter%201a%20with%20lander.craft?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt will get you down from orbit, using Mechjeb if you like. Shutes while slow you to 10m/s and a blast on the engines before touchdown will give a soft landing. \u003C/p\u003E\u003Cp\u003ERaise the legs before launch. Check the main tanks are full - top up from the landing tanks (the ones with the legs on) if needed. Fire up the engines. Stage it to blow off the landing tanks and legs. Then you can use Mechjeb to orbit with the turn at 24Km and a 60Ã‚Â° turn shape.\u003C/p\u003E\u003Cp\u003EIt will get you from sea level to 100Km with 1000\u002B Dv to spare. \u003C/p\u003E\u003Cp\u003EDesign your own lifter to get it to Eve orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i395.photobucket.com/albums/pp38/FoxMouldy/Eve_zps95304f86.jpg\u0022 alt=\u0022Eve_zps95304f86.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-14T00:26:46Z\u0022 title=\u002212/14/2014 12:26  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 14, 2014\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"gm537","CreatedById":66746,"CreatedDateTime":"2014-12-14T04:11:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003EHere\u0027s a pretty good lander\u002Borbiter I made if anyone is struggling to make one\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDefinitely cool but I feel like the point of a challenge is to design your own thing and figure out what works well for you. Additionally that lander has just a command chair for the Kerbal and this challenge requires an actual capsule. Again cool for sure it just seems out of place...\u003C/p\u003E\n"},{"CreatedByName":"bitslizer","CreatedById":127646,"CreatedDateTime":"2014-12-14T04:55:45Z","Content":"\n\u003Cp\u003ENeed a lander can/pod for this challenge, not seat only\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2014-12-14T10:45:52Z","Content":"\n\u003Cp\u003EOh, OK. Should have read the rules a little better. I\u0027m 9/10s of the way there - might as well finish it now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"xNovax","CreatedById":131867,"CreatedDateTime":"2014-12-14T18:06:06Z","Content":"\n\u003Cp\u003EOne Spaceplane, 2 kerbals, a ton of fuel, one space station, and one aweosome landing\u003C/p\u003E\u003Cp\u003E. \u003Cimg src=\u0022http://ksp.schnobs.de/eve/The_Eve_Rocks_Challenge_badge.png\u0022 alt=\u0022The_Eve_Rocks_Challenge_badge.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot%201\u0022 alt=\u0022screenshot 1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2014-12-14T22:51:43Z","Content":"\n\u003Cp\u003EAlright. I\u0027m assuming I never actually completed the challenge because I had to show the lifting separately. I understand.\u003C/p\u003E\u003Cp\u003EThis was fun though! I actually learned about precise Eve launch window phase angles from this, so maybe I can make a challenge of my own regarding it in the future.\u003C/p\u003E\u003Cp\u003EJust as an announcement, I will be taking the Jool-5 challenge when Ziv gets back from vacation. Be sure to look for my submission there if you have the time.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-12-15T03:01:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vaporo\u0022 data-cite=\u0022Vaporo\u0022\u003E\u003Cdiv\u003EStock aerodynamics... ugh. Well, I did it with a probe, no reason I can\u0027t do it with a Kerbal. Though maybe you could make a FAR/NEAR aerodynamics subchallenge, as they actually make many aspects of EVE landing (not ascent, landing) quite difficult.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe FAR/NEAR should only be allowed if you also use Deadly Re-entry.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-12-15T03:06:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EI know little about tweakscale, other than that it exists. So I\u0027ll stick to my default rule: if you feel the need to ask, it\u0027s probably not OK.\u003Cp\u003EBut I want to remind you that not the entire mission has to be stock-only. This is only about the Lifter(s). I won\u0027t be holier-than-thou about support vessels; and anything that comes along as payload may be whatever you like. This probably won\u0027t help you if you\u0027re planning a single launch, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETweakscale? More like Cheatscale. \u003Cem\u003ENo one should ever use tweakscale unless they\u0027re playing in fully-blown realism overhaul. It removes the lego-like feel of building.\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-12-15T11:54:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xannari Ferrows\u0022 data-cite=\u0022Xannari Ferrows\u0022\u003E\u003Cdiv\u003EAlright. I\u0027m assuming I never actually completed the challenge because I had to show the lifting separately. I understand.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuh? Oh, you updated your submission -- Sorry, I didn\u0027t notice (PM would have helped).\u003C/p\u003E\u003Cp\u003ECongratulations, you completed the Eve Rocks Challenge on Level 1!\u003C/p\u003E\u003Cp\u003EThis is a great mission of could-have-beens; landing at barely above 500m, a good-looking science rover that almost worked... I ought to complain about the lack of pictures from the Eve ascent as well; but this vessel is obviously capable of returning from Eve when landing at high altitudes, and seeing as you didn\u0027t go below 500m anyway, I won\u0027t bother you with details.\u003C/p\u003E\n"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2014-12-15T15:09:02Z","Content":"\n\u003Cp\u003EOk, completed Level 1.\u003C/p\u003E\u003Cp\u003EGoing to take me a while to collate all the pictures, and calculate the Funds spent \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EOk, There And Back Again, Level 1.\u003C/p\u003E\u003Cp\u003ETotal cost 339082 funds.\u003C/p\u003E\u003Cp\u003EEve_Lander_5: \u003C/p\u003E\u003Cp\u003EInitial Cost: 508,577\u003C/p\u003E\u003Cp\u003EStage 2: 290,272 (refund) (4x 72568)\u003C/p\u003E\u003Cp\u003EStage 3: 38,709 (refund) (3x 12903)\u003C/p\u003E\u003Cp\u003ELander: 19,714 (refund)\u003C/p\u003E\u003Cp\u003ETotal cost: 159,882\u003C/p\u003E\u003Cp\u003EEL IP Stage:\u003C/p\u003E\u003Cp\u003ECost: 84,224\u003C/p\u003E\u003Cp\u003E(Probably could have got this back from Eve, but decided not to bother)\u003C/p\u003E\u003Cp\u003ERefuel:\u003C/p\u003E\u003Cp\u003EInitial Cost: 119,584\u003C/p\u003E\u003Cp\u003EStage 2: 95,840 (refund)\u003C/p\u003E\u003Cp\u003ETotal cost: 23,744\u003C/p\u003E\u003Cp\u003E(Payload ~2000L fuel/~2444 ox) x4 launches\u003C/p\u003E\u003Cp\u003ETotal cost: 94,976\u003C/p\u003E\u003Cp\u003E---------------\u003C/p\u003E\u003Cp\u003ECombined cost: 339,082 (after refund)\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/SI9YR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/cFgQk\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cem\u003E- weight and part count of the vessel on the launchpad\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E880.45T\u003C/p\u003E\u003Cp\u003E380 parts.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E- weight and part count awaiting liftoff on Eve\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E85.22T\u003C/p\u003E\u003Cp\u003E236 parts\u003C/p\u003E\u003Cp\u003E(Note that a significant number of these parts are landing gear, parachutes etc. Immediatly after staging for launch, without any fuel spent, this changes to: 79.18T, 122 parts)\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E- the approximate price tag of your entire mission, if at all possible\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E339082 vF\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E- game version\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E0.25\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E- mods used\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOnly pertinent ones are Mechjeb \u0026amp; Kerbal Alarm Clock. RCS BuildAid was used to help place the Vernier thrusters.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E- tell me how you found your landing site.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003Elooked it up \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43828-Highest-point-on-Eve-nearest-the-Equator/page2\u0022 rel=\u0022external nofollow\u0022\u003Ehere:\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E- if there\u0027s anything that your are especially proud of, be sure to point it out (provide a direct link to a picture if applicable).\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EInitial craft is stable enough to survive Kerbin launch under 4x physics with no glitches.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E- please also mention the things that didn\u0027t work out so well / required a lot of saveloading / you would do different next time.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe final stage of the lander started behaving oddly on launch. Simulations ran smoothly enough, but the \u0027real thing\u0027 kept exploding the central tank. Ended up having to briefly kill the main engine when performing that stage. (Note: In new set of pictures, launch worked flawlessly first go. Weird.)\u003C/p\u003E\u003Cp\u003EDocking the three ports for the EL IP stage \u0026amp; the lander was difficult, stage wobbled a lot.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-19T10:09:10Z\u0022 title=\u002212/19/2014 10:09  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 19, 2014\u003C/time\u003E by kahlzun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2014-12-15T19:49:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EHuh? Oh, you updated your submission -- Sorry, I didn\u0027t notice (PM would have helped).\u003Cp\u003ECongratulations, you completed the Eve Rocks Challenge on Level 1!\u003C/p\u003E\u003Cp\u003EThis is a great mission of could-have-beens; landing at barely above 500m, a good-looking science rover that almost worked... I ought to complain about the lack of pictures from the Eve ascent as well; but this vessel is obviously capable of returning from Eve when landing at high altitudes, and seeing as you didn\u0027t go below 500m anyway, I won\u0027t bother you with details.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...Oh, what\u0027s that? I actually did it!? For once in my life I didn\u0027t screw something up! \u003C/p\u003E\u003Cp\u003EEr, yes. The science rover does do good on it\u0027s own I found out, but kerbals beware... \u003C/p\u003E\u003Cp\u003EI really should have taken more pictures from the Eve ascent, I\u0027ll give you. I guess I was just concentrating.\u003C/p\u003E\u003Cp\u003EAnyway, thank you for approving my submission, and be sure to watch out for my Jool-5 attempt in the near future!\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-12-16T22:45:10Z","Content":"\n\u003Cp\u003EWell. It turns out it\u0027s a bit harder to build an Eve 200T pontoon lander than I had first figured. But on the upside, test #5 produced my first Kerbal survival and 80% of the ship still intact. (Tests number 1 thru 4 were fun too, watching the pontoons and girders bounce away into the distance...)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1zfPMfz.jpg\u0022 alt=\u00221zfPMfz.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-12-16T23:07:15Z","Content":"\n\u003Cp\u003E(laugh)\u003C/p\u003E\u003Cp\u003EPontoons, eh? I had reasonable success with wrapping them around my lander, so the CoM would be just below the flotation devices. Needs a powered landing, though, and the deeper you settle into the water the more careful you have to be with the throttle. I eventually decided that landing on the dry will still be easier, after all.\u003C/p\u003E\u003Cp\u003EBy the way: whatever I try I always come back to LFBs for a landing gear. Tall, rigid, resilient, these things are awesome.\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-12-17T03:53:46Z","Content":"\n\u003Cp\u003EI\u0027m slowly losing my mind. Something like test #9 (maybe 10) left me floating, with the upside of the ship pointing towards the correct hemisphere. (Dead level was a bit too much to ask for.) Followup tests duplicated the results.\u003C/p\u003E\u003Cp\u003EAnd now the exit from the capsule is, I dunno, 3m underwater?\u003C/p\u003E\u003Cp\u003EFirst I was too high. \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EWay\u003C/span\u003E too high might I add. Now, I\u0027m underwater. Off to bed. Overnight I\u0027ll think of a plan.\u003C/p\u003E\n"},{"CreatedByName":"redsh","CreatedById":118322,"CreatedDateTime":"2014-12-17T10:13:33Z","Content":"\n\u003Cp\u003EHi, this is my entry. Just completed my second Eve mission with 2 kerbals on surface.\u003C/p\u003E\u003Cp\u003EI\u0027m running 0.25, mods I\u0027ve used: MJ, Alarm Clock and Docking Port Alignment Indicator.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/tfKLZ\u0022 rel=\u0022external nofollow\u0022\u003ELink\u003C/a\u003E to gallery on imgur.\u003C/p\u003E\u003Cp\u003EThis is \u003Ca href=\u0022https://yadi.sk/d/jWdeYxCqdSFEX\u0022 rel=\u0022external nofollow\u0022\u003Ecraft file\u003C/a\u003E for rocket. The whole thing costs about $1.8M and part count is 1966. Mass at liftoff: 3000 tons (i\u0027ve used my most powerful lifter that carries up to 400 tons to 1000 km Kerbin orbit, which is little overpowered in this case).\u003C/p\u003E\u003Cp\u003Eand \u003Ca href=\u0022https://yadi.sk/d/lHyvFbh9dSFDv\u0022 rel=\u0022external nofollow\u0022\u003Ecraft file\u003C/a\u003E for lander only. Mass of lander is 192t (171t without landing equipment), delta-v amount is 8616/10355. Part count: 606. It uses vertical asparagus staging with 14 stages (plus two backup O-10 burners to utilize capsule RCS storage).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T22:24:38Z\u0022 title=\u002212/18/2014 10:24  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by redsh\u003C/strong\u003E\n\u003Cbr\u003Eupdated imgur link\n\u003C/span\u003E\n"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2014-12-17T11:36:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022James_Eh\u0022 data-cite=\u0022James_Eh\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EWay\u003C/span\u003E too high might I add. Now, I\u0027m underwater. Off to bed. Overnight I\u0027ll think of a plan.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELadders are pretty light, you\u0027d be surprised how easy it is to build a path down even a large rocket\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-12-17T15:03:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kahlzun\u0022 data-cite=\u0022kahlzun\u0022\u003E\u003Cdiv\u003ELadders are pretty light, you\u0027d be surprised how easy it is to build a path down even a large rocket\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not about weight, it\u0027s about making them work, which can be a mind-boggling task if the path isn\u0027t straight. Laddering up my own lander took up like 20-30% of the entire development time: put the vessel on the pad, test the ladders, revert to VAB, ad nauseam. On top of that, ladders can add quite a few parts to a vessel. My own inconspiciuos setup was like 5% of all parts.\u003C/p\u003E\u003Cp\u003EAs to your submission: could you please beef up the Eve Launch a bit? That\u0027s totally not enough pictures, and a lack of resource/info stuff to boot. I\u0027ve updated the OP because all recent submission have been wanting in that regard.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-12-17T18:54:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022redsh\u0022 data-cite=\u0022redsh\u0022\u003E\u003Cdiv\u003EHi, this is my entry. Just completed my second Eve mission with 2 kerbals on surface.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA two-man pod is certainly a rare sight. I also like your rover, it has style. And there\u0027s lots of sweet details like that necklace of debris. I only wonder why you flipped your rover at the end? Or was it generally flippy and this time you didn\u0027t reload?\u003C/p\u003E\u003Cp\u003EEither way, you made it. \u003Cstrong\u003ECongratulations, you completed the Eve Rocks Challenge on Level 3!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBefore I update the OP, you you please provide weight, part count and so on? I could cull them from the craft files, but would prefer to just copypaste.\u003C/p\u003E\u003Cp\u003EAlso, do you use any special settings on Imgur? That gallery pumps out all pictures as high-res PNGs, no matter what. Everyone who\u0027s just viewing this page on the forums, with your gallery linked, will receive a ~100MB download. Other Imgur galleries don\u0027t do that.\u003C/p\u003E\n"},{"CreatedByName":"redsh","CreatedById":118322,"CreatedDateTime":"2014-12-17T19:22:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EI only wonder why you flipped your rover at the end? Or was it generally flippy and this time you didn\u0027t reload?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll my imgur descriptions disappear! I have no idea why this happens. Will try to restore them; for now added some details to my post. Jeb has flipped rover because (due to poor rover testing) can\u0027t recover data from instruments another way.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso, do you use any special settings on Imgur? That gallery pumps out all pictures as high-res PNGs, no matter what.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHave no idea too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ECongratulations, you completed the Eve Rocks Challenge on Level 3!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! btw my design won\u0027t take off from low elevation so it\u0027s should be level 2.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T04:44:37Z\u0022 title=\u002212/18/2014 04:44  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by redsh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2014-12-18T14:21:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs to your submission: could you please beef up the Eve Launch a bit? That\u0027s totally not enough pictures, and a lack of resource/info stuff to boot. I\u0027ve updated the OP because all recent submission have been wanting in that regard.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlright, I\u0027ll see if I can get more pictures. Have needed to do another launch though, so keep in mind MET does not line up.\u003C/p\u003E\u003Cp\u003EStay tuned for requested, additional launch pictures.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003ERequested pictures are now added to initial application page. Seperate album made as was different launch.\u003C/p\u003E\u003Cp\u003ENote that as I used a disposable IP stage, which did not return from Eve, I used it as most of my descent stage.\u003C/p\u003E\u003Cp\u003EBeing as the fuel in the descent is immaterial, i hyperedit\u0027d the craft to a 200km eve orbit and landed from there.\u003C/p\u003E\u003Cp\u003EInitial application shows how I got it there legitimately.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-19T13:16:41Z\u0022 title=\u002212/19/2014 01:16  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 19, 2014\u003C/time\u003E by kahlzun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"hazard-ish","CreatedById":115844,"CreatedDateTime":"2014-12-18T14:55:35Z","Content":"\n\u003Cp\u003EHello! I posted a lot here a while ago detailing my mission plan but I have been so busy recently I have not had the time to perform it. Recently, however, I managed to spent the time to go through it. And go through it and go through it... roughly 8 times until I finally carried out the mission without quicksaves. Don\u0027t ask - I just don\u0027t like them I guess \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, I should be posting my entry here soon. I assume an imgur album is okay?\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2014-12-20T04:44:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hazard-ish\u0022 data-cite=\u0022hazard-ish\u0022\u003E\u003Cdiv\u003EHello! I posted a lot here a while ago detailing my mission plan but I have been so busy recently I have not had the time to perform it. Recently, however, I managed to spent the time to go through it. And go through it and go through it... roughly 8 times until I finally carried out the mission without quicksaves. Don\u0027t ask - I just don\u0027t like them I guess \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EAnyway, I should be posting my entry here soon. I assume an imgur album is okay?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow... no quicksaves? I mean, sure I never had to use them, but I\u0027d go mad before doing this 8 times. You\u0027ve got dedication!\u003C/p\u003E\u003Cp\u003EAnyway, imgur albums are the primary way to submit things here, so it\u0027s perfect for entering the competition.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-12-22T12:44:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kahlzun\u0022 data-cite=\u0022kahlzun\u0022\u003E\u003Cdiv\u003EOk, completed Level 1.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the update on the Eve launch, that will do.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003ECongratulations, you complete Eve Rocks on Level 1!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EGoing with a a plain old LV-T30 as the last engine is a good idea, that engine is much better than it\u0027s rep. Though I have to admit that the bit I like best is how you recover your lifter stages on Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"2001kraft","CreatedById":120475,"CreatedDateTime":"2014-12-22T17:06:05Z","Content":"\n\u003Cp\u003ELaie, am I allowed to refuel on ground?\u003C/p\u003E\u003Cp\u003EE.G. I have a base and a craft with docking/refueling capabilities and enough fuel in the base.\u003C/p\u003E\u003Cp\u003EIs it allowed or not?\u003C/p\u003E\n"}]}