{"TopicId":86289,"ForumId":20,"TopicTitle":"Input logger for replays","CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-10-07T02:11:11Z","PageNum":1,"Articles":[{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-10-07T02:11:11Z","Content":"\n\u003Cp\u003ECurrently if I want to get another camera angle on something, I have to try and re-fly it as best I can. When I do a launch, I record it so that if I want to go back and get booster cam footage, I know how it was flown so I can attempt to re-create the conditions. It would be better though if a mod could just do this instead. This mod would rely on the initial state of the game being the same from the moment it starts recording, so when activated to begin recording user input it would create a SFS file at that point. For playback, all the mod needs to do is reload that save file and begin feeding the game the same input the player did at the same time.\u003C/p\u003E\u003Cp\u003EThe tricky part is it can\u0027t simply record \u003Cem\u003Eall\u003C/em\u003E input. Obviously if you record yourself switching camera views and then want to replay the launch only from the booster cam, at some point the view will be switched during the replay. Flight controls (pitch, yaw, throttle, etc), action groups and staging events should definitely be recorded. I think that would be good enough to start with.\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-10-07T03:00:21Z","Content":"\n\u003Cp\u003ECan you use \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/49216-0-24-2-Persistent-Trails-record-share-and-replay-track-data!-%28Aug-1-V1-1%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/49216-0-24-2-Persistent-Trails-record-share-and-replay-track-data!-%28Aug-1-V1-1%29\u003C/a\u003E to do that ?\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-10-07T03:57:38Z","Content":"\n\u003Cp\u003EIt has issues with replays. Because it\u0027s set up to try and let you do things like fly alongside the craft you recorded, it attempts to rebuild the craft - and comes up short in some cases. At least, I\u0027ve not had much success with it and others have reported issues on the thread. It also doesn\u0027t do action groups or staging. It records the path of the craft, not the inputs, and the model that follows that path is completely static (no animations like gears up, etc)\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-01-14T12:52:50Z","Content":"\n\u003Cp\u003E*bump*\u003C/p\u003E\u003Cp\u003Eare we allowed to bump every couple of months?\u003C/p\u003E\n"}]}