{"TopicId":86298,"ForumId":70,"TopicTitle":"Contracts Wiped/NullReference Contracts","CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2014-10-07T04:07:10Z","PageNum":1,"Articles":[{"CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2014-10-07T04:07:10Z","Content":"\n\u003Cp\u003ESometime in the last few days, all record of my contracts was erased from my persistence file. This was weird enough, but I thought that fortunately I had backed them up when upgrading to OSX 10.9 a few days ago. The rest of my save file was untouched, but all of my current contracts and completed contracts were simply gone. I\u0027m not sure about the offered contracts because they would have simply been replaced by new offers.\u003C/p\u003E\u003Cp\u003ESo I thought that rather than undo all of the progress I\u0027ve made since that backup, I might be able to just copy in the contracts section of my old persistence file to the current one.\u003C/p\u003E\u003Cp\u003EThis seemed to work at first. The game loaded fine, and hovering my mouse over the contracts icon in the top right of the screen even showed the proper contracts again. Yay! But clicking on the tracking station did nothing, same result from the SPH and VAB. Buildings that bring up an overlay (like the runway, launchpad, and mission control bring up that building\u0027s display but nothing happens on clicking any buttons. Same awkward problem with the menu to exit. The only button that works is resume which leaves me force quitting my game and unable to do anything.\u003C/p\u003E\u003Cp\u003ENow, when I completely remove all the contracts again, everything works fine. Except I won\u0027t get my money or science from visiting Eve and I have no record of saving so many Kerbals. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooking at the logs, it seems to be throwing NullReferenceExceptions immediately after loading the contracts. I\u0027m putting this in the modded installs folder because I am running mods, but since I can clear the error without removing mods I suspect it is not due to any of them (I do not have contract modifying mods).\u003C/p\u003E\u003Cp\u003EPersistence file: \u003Ca href=\u0022https://www.dropbox.com/s/8k196eh065kbmy2/persistent.sfs?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8k196eh065kbmy2/persistent.sfs?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPlayer.log file: \u003Ca href=\u0022https://www.dropbox.com/s/96hs6dshhqldzx7/Player.log?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/96hs6dshhqldzx7/Player.log?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EKSP.log file: \u003Ca href=\u0022https://www.dropbox.com/s/agdrgmi2f3t6tse/KSP.log?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/agdrgmi2f3t6tse/KSP.log?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote that in the instance shown in the logs, I loaded the copy of my save with no contracts; entered the tracking station to confirm it worked; exited, and proceeded to load the version with contracts. The lack of NullReferenceExceptions is evident in the first and disappointing in the second.\u003C/p\u003E\u003Cp\u003EEssentially what I\u0027m wondering is if there is some way of re-instantiating my contract data into my current game or if I must choose between my contracts and my progress? Secondary objective is to find out why the contracts disappeared in the first place, though I understand that may be difficult since I don\u0027t know when that happened nor have logs from then.\u003C/p\u003E\n"},{"CreatedByName":"Aloriel","CreatedById":97201,"CreatedDateTime":"2014-10-09T01:16:39Z","Content":"\n\u003Cp\u003EI have also experienced this issue.\u003C/p\u003E\u003Cp\u003EI\u0027m running the Win32 version instead of the OSX version. The only difference is that I don\u0027t have a backup to load. My contracts are just gone.\u003C/p\u003E\n"},{"CreatedByName":"Dwaine","CreatedById":125117,"CreatedDateTime":"2014-10-09T03:44:49Z","Content":"\n\u003Cp\u003EI had the similar prob on Win32, I had NO contract modifying mods, not even mods adding new parts. ( Full list is : Toolbar \u002B modulemanager \u002B RasterPropMonitor \u002B KerbalAlarm \u002B Mechjeb \u002B Chatterer \u002B EnhancedNavBall \u002B KerbalJointReinforcement \u002B TSUtils \u002B HotRockets, NOTHING that change the core game )\u003C/p\u003E\u003Cp\u003EI just found out that this was caused by the last one. Hot rockets somehow break the game by trying to load \u0022TurboFanEngine\u0022 that don\u0027t exist, and it break it so much that all contract past and present are wiped out ! Even Science archives ! Anyway, on the last page of hotrockets there is a fix (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65754-HotRockets%21-Particle-FX-Replacement-Tutorial?p=1462438\u0026amp;viewfull=1#post1462438\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/65754-HotRockets%21-Particle-FX-Replacement-Tutorial?p=1462438\u0026amp;viewfull=1#post1462438\u003C/a\u003E) that works ! I loaded an old backup and all my contracts are here again, but I lost ~10H of progress ...\u003C/p\u003E\u003Cp\u003EWell if this can help. This is mostly due to a mod, and maybe not the one you\u0027ll expect !\u003C/p\u003E\n"},{"CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2014-10-09T17:42:44Z","Content":"\n\u003Cp\u003EI don\u0027t think we can say that it\u0027s caused exclusively by HotRockets because I don\u0027t have that mod. I\u0027m running Toolbar, DMagic Orbital Science, Extraplanetary Launchpads, Firespitter propellers, KAS, Kerbal Engineer, Kethane, Mechjeb 2, ModuleManager, RemoteTech, Trajectories, and Alarm Clock. My science archives were preserved as well, so I think Dwaine and I might have different but similar issues.\u003C/p\u003E\u003Cp\u003EOn the plus side, I found out that I had a named quicksave that had my contracts data so I only lost about two hours. Yay!?\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-10-09T18:20:36Z","Content":"\n\u003Cp\u003EContracts disapear in most cases because a mod that has its own contracts makes a major change or deletes one of its Contract.Parameters. If you happen to have a contract that is completed in list that uses the old Contract.Parameters and it is no longer there. Then the system will freak out and clear you Achieved list.\u003C/p\u003E\u003Cp\u003EIts the same idea that happens when you delete a part that is on one of your active vessels. When you start the game up again the Game will completely delete your vessel to protect your Persistant.\u003C/p\u003E\u003Cp\u003ESame thing will happen if you play a Mod that adds contracts, and you complete a bunch of contracts from it. Then remove the mod, your list will be wiped. Or if the above happens with a mod update. No way to get the archives back after this wipe.\u003C/p\u003E\u003Cp\u003ENo other mod should effect this. Unless it is actively making its own contracts. And Dmagic does have contracts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T18:23:08Z\u0022 title=\u002210/09/2014 06:23  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2014-10-09T20:55:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022malkuth\u0022 data-cite=\u0022malkuth\u0022\u003E\u003Cdiv\u003EContracts disapear in most cases because a mod that has its own contracts makes a major change or deletes one of its Contract.Parameters. If you happen to have a contract that is completed in list that uses the old Contract.Parameters and it is no longer there. Then the system will freak out and clear you Achieved list.\u003Cp\u003EIts the same idea that happens when you delete a part that is on one of your active vessels. When you start the game up again the Game will completely delete your vessel to protect your Persistant.\u003C/p\u003E\u003Cp\u003ESame thing will happen if you play a Mod that adds contracts, and you complete a bunch of contracts from it. Then remove the mod, your list will be wiped. Or if the above happens with a mod update. No way to get the archives back after this wipe.\u003C/p\u003E\u003Cp\u003ENo other mod should effect this. Unless it is actively making its own contracts. And Dmagic does have contracts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for explaining that. It\u0027s still bizarre because I hadn\u0027t updated any mods or the game itself when this happened. That also means that my outdated DMagic version hadn\u0027t added any contracts yet.\u003C/p\u003E\u003Cp\u003EFor future reference, couldn\u0027t I just narrow down the specific contract that was buggy and replace all but that one?\u003C/p\u003E\n"},{"CreatedByName":"Thanny","CreatedById":110623,"CreatedDateTime":"2014-10-12T02:38:09Z","Content":"\n\u003Cp\u003EMy contract history disappeared with the 0.25 update. I don\u0027t have any contract-altering mods.\u003C/p\u003E\n"}]}