{"TopicId":86333,"ForumId":36,"TopicTitle":"EVA view without fixed up and down.","CreatedByName":"haltux","CreatedById":29407,"CreatedDateTime":"2014-10-07T16:39:15Z","PageNum":1,"Articles":[{"CreatedByName":"haltux","CreatedById":29407,"CreatedDateTime":"2014-10-07T16:39:15Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI am really upset with EVA controls : there is an up and a down, which are either planetary up or planetary north, and no way to actually feel like you are in space where there is no up and down, no way to approach any spaceship the way you want.\u003C/p\u003E\u003Cp\u003EChase view should do the job, but somehow it does not work.\u003C/p\u003E\u003Cp\u003EHere is my proposal: \u0022Q\u0022 and \u0022E\u0022 should control kerbal rotation around an axis that goes from the back of the kerbal to the front of the kerbal (therefore perpandicular to your screen, considering you generally look from behind). The view should follow the Kerbal like it does for ships in Chase view.\u003C/p\u003E\u003Cp\u003EUnless someone give me a solution or tell me that it has already been done, I would like to develop a mod that solves this problem. However I have never developped any KSP mod. Could you give me your opinion on the development of such mod? Do you expect it to be easy? How much time do you think it would require for an experience developper that starts from scratch?\u003C/p\u003E\u003Cp\u003EAny comment would be appreciated.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-10-07T17:05:09Z","Content":"\n\u003Cp\u003EWouldn\u0027t it make more sense to make the Kerbal controls the same as RCS controls for ships?\u003C/p\u003E\u003Cp\u003EQEWASD for rotation IKJLHN for translation (or whatever the default is)\u003C/p\u003E\n"},{"CreatedByName":"Scarsz","CreatedById":113000,"CreatedDateTime":"2014-10-07T17:05:43Z","Content":"\n\u003Cp\u003EYES! I would 100% support this mod. There are no mods that do this to my knowlage. What you are proposing seems relitivly simple, but it all depends on your experience. \u0022experience developper\u0022 I am assuming you mean that you have used C# before or have coded for a game before. If that is what you mean that this shouldn\u0027t be really that complicated. If i could add my 2 cents I would quite like a fps style control system. mouse controls yaw and pitch with Q and E controling roll and WASD and Shift/ctrl controling translation.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-10-07T17:14:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scarsz\u0022 data-cite=\u0022Scarsz\u0022\u003E\u003Cdiv\u003EIf i could add my 2 cents I would quite like a fps style control system. mouse controls yaw and pitch with Q and E controling roll and WASD and Shift/ctrl controling translation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve changed my mind. This is much better.\u003C/p\u003E\n"},{"CreatedByName":"Reddragon","CreatedById":66937,"CreatedDateTime":"2014-10-07T18:16:05Z","Content":"\n\u003Cp\u003EI second Scarsz\u0027s idea.\u003C/p\u003E\n"},{"CreatedByName":"Spacepetscompany","CreatedById":119734,"CreatedDateTime":"2014-10-07T19:12:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reddragon\u0022 data-cite=\u0022Reddragon\u0022\u003E\u003Cdiv\u003EI second Scarsz\u0027s idea.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI third this idea!\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-07T19:27:03Z","Content":"\n\u003Cp\u003ELong as there\u0027s an easy toggle hotkey between the two modes. I\u0027d actually like to see a toggle like that which isn\u0027t bound to a button click in the IVA as well, which a small cross-hair in the middle of the screen to help in manipulating IVA controls with the view still attached to the mouse.\u003C/p\u003E\u003Cp\u003EBut that\u0027s a task for later. I\u0027d definitely love for some EVA FPS-style controls. This would especially be nice with first-person view mods.\u003C/p\u003E\u003Cp\u003EEventually, while we\u0027re on it, allowing for an FPS-style control of your ships movements, while still allowing RCS-balancing mods to function (such as mechjeb\u0027s balancer) would be awesome for those of us who just can\u0027t seem to get a handle on the separate controls for translation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-07T19:29:28Z\u0022 title=\u002210/07/2014 07:29  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 7, 2014\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Headhunter09","CreatedById":67393,"CreatedDateTime":"2014-10-07T19:38:51Z","Content":"\n\u003Cp\u003EIf you are looking for a reference, Crysis 1 had the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ebest\u003C/span\u003E FPS freefall control scheme I\u0027ve ever seen. Maybe look up a video of it?\u003C/p\u003E\n"},{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2014-10-07T19:45:24Z","Content":"\n\u003Cp\u003ECombine this with Through the Eyes of a Kerbal mod and this will be amazing.\u003C/p\u003E\n"},{"CreatedByName":"amankd","CreatedById":135588,"CreatedDateTime":"2015-05-13T23:45:19Z","Content":"\n\u003Cp\u003Ethanks for this great tutorial, i am making a halo ghost, and i was wondering i there was a way i could intergrate your repulsors into the model, is there some game object i need to add to get a slightly compressible frictionless game object, and is the re a way you coud add a bit of friction?\u003C/p\u003E\n"}]}