{"TopicId":86491,"ForumId":32,"TopicTitle":"What would you want in the next update (0.90)?","CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2014-10-08T14:58:22Z","PageNum":5,"Articles":[{"CreatedByName":"Unabled","CreatedById":75171,"CreatedDateTime":"2014-10-09T04:34:28Z","Content":"\n\u003Cp\u003EI know this is a .26 hopeful thread, but it is kinda \u0022future of KSP\u0022 as well.\u003C/p\u003E\u003Cp\u003EThought I\u0027d post this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://twitter.com/Maxmaps/status/520058187756888065\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://twitter.com/Maxmaps/status/520058187756888065\u003C/a\u003E :\u003C/p\u003E\u003Cp\u003E\u0022But before all that we\u0027re gonna drop some knowledge on you. Not the 0.26 plan. A post on the actual gameplan from here to 1.0\u0022\u003C/p\u003E\n"},{"CreatedByName":"bigbadben","CreatedById":89458,"CreatedDateTime":"2014-10-09T05:43:08Z","Content":"\n\u003Cp\u003EInclude space chemistry, in the science/resource parts of the game. I never thought a game about orbital mehanics could be fun, but squad managed it. Maybe they can make chemistry fun too?\u003C/p\u003E\n"},{"CreatedByName":"Lifeforce87","CreatedById":37674,"CreatedDateTime":"2014-10-09T06:03:55Z","Content":"\n\u003Cp\u003EI wish they would add reflections,\u003C/p\u003E\u003Cp\u003EKSP would look so much nicer with them.\u003C/p\u003E\u003Cp\u003EI know there is a plugin, but stock support would be so awesome!\u003C/p\u003E\n"},{"CreatedByName":"bonyetty","CreatedById":57769,"CreatedDateTime":"2014-10-09T06:06:33Z","Content":"\n\u003Cp\u003EFoot prints, wheel tracks, scorch marks and craters. And may be Mk3 parts.\u003C/p\u003E\u003Cp\u003EEdit:- Oh and of course Kerbals should go splat not poof!\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-10-09T09:44:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lifeforce87\u0022 data-cite=\u0022Lifeforce87\u0022\u003E\u003Cdiv\u003EI wish they would add reflections,\u003Cp\u003EKSP would look so much nicer with them.\u003C/p\u003E\u003Cp\u003EI know there is a plugin, but stock support would be so awesome!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a plugin that actually adds them to the buildings?\u003C/p\u003E\u003Cp\u003EThe only one I seen is with an option to add reflections in, but that\u0027s pretty much all - when you install it you don\u0027t actually get any reflections.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unabled\u0022 data-cite=\u0022Unabled\u0022\u003E\u003Cdiv\u003EI know this is a .26 hopeful thread, but it is kinda \u0022future of KSP\u0022 as well.\u003Cp\u003EThought I\u0027d post this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://twitter.com/Maxmaps/status/520058187756888065\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://twitter.com/Maxmaps/status/520058187756888065\u003C/a\u003E :\u003C/p\u003E\u003Cp\u003E\u0022But before all that we\u0027re gonna drop some knowledge on you. Not the 0.26 plan. A post on the actual gameplan from here to 1.0\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, I sure hope it\u0027ll include proper aerodynamics (including deadly reentry), life support, a stock display of a spacecraft characteristics (such as delta-V and thrust to weight ratio) and a new, proper, balanced tech tree. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"BoilingCold","CreatedById":119581,"CreatedDateTime":"2014-10-09T09:56:33Z","Content":"\n\u003Cp\u003EMostly what I would love to see in 0.26 is a big revamp of Career mode. I love playing Career mode, I love the feeling of unlocking new technologies and parts and being able to do new things because of it, but I feel that the rate of progression could do with completely re-evaluating and for there to be a more consistent difficulty curve throughout the progress of the game.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-10-09T11:49:36Z","Content":"\n\u003Cp\u003EDelta-v meter and TWR meter, as in Kerbal Engineer Redux, would be most helpful, too.\u003C/p\u003E\n"},{"CreatedByName":"PhaserArray","CreatedById":85824,"CreatedDateTime":"2014-10-09T12:35:06Z","Content":"\n\u003Cp\u003EColliders for terrain scatter.\u003C/p\u003E\n"},{"CreatedByName":"KapitaenM","CreatedById":125176,"CreatedDateTime":"2014-10-09T12:40:25Z","Content":"\n\u003Cp\u003EAll vessel renaming to be manageable by the Tracking Center, not the individual craft\u0027s control module (which also requires it to be powered to be named).\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2014-10-09T12:54:30Z","Content":"\n\u003Cp\u003EMore science parts (camera!), better stars/universe background, clouds, payload fairings, interplanetary maneuver nodes ... or a better way to see intercepts to other planetary bodies (Kerbin \u0026gt; Duna) while you\u0027re in the SOI of Kerbin; the current method of \u002B/- is a little clumsy ... maybe give a slider bar so I don\u0027t have to click it 100 times?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T12:57:44Z\u0022 title=\u002210/09/2014 12:57  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by Caelib\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drethon","CreatedById":100831,"CreatedDateTime":"2014-10-09T12:59:39Z","Content":"\n\u003Cp\u003EI can\u0027t find the things that will never be added page so hopefully none of this is on it but...\u003C/p\u003E\u003Cp\u003EI\u0027d like to see life support and something like remote tech formally added to KSP. A little more focus on really working with probes before moving onto throwing live Kerbals into the fireworks, especially with the new permadeath Kerbal mode. Also greenhouses and similar life support generation to go with the life support consumption.\u003C/p\u003E\u003Cp\u003EAlso I\u0027d like to see planetary bases get a little love. Maybe something like Kethane or another reason to actually be on the planet while also expanding items for making a good planetary base.\u003C/p\u003E\n"},{"CreatedByName":"andruszkow","CreatedById":104911,"CreatedDateTime":"2014-10-09T13:25:59Z","Content":"\n\u003Cp\u003EI know there\u0027s a mod for it (duh), but they should consider adding something like Fine Print to the stock game, giving contracts for specific things like rover missions following a pre-planned path to investigate something, building orbital stations etc.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/88445-0-25-Fine-Print-v0-59-Resource-Harvest-Contracts-Configuration-%28October-7%29\u0022 rel=\u0022external nofollow\u0022\u003EThis mod has all of that \u002B more!\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Doc","CreatedById":92176,"CreatedDateTime":"2014-10-09T14:56:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FleetAdmiralJ\u0022 data-cite=\u0022FleetAdmiralJ\u0022\u003E\u003Cdiv\u003Egod I read that and destroyed my face smashing it against a door. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003Cp\u003Eto each their own I guess. I just feel that just because he wants to play orbiter on hard mode doesn\u0027t mean he has to thrust it upon everyone else. The game is supposed to be hard, not necessarily NASA in real life. While I wouldn\u0027t mind some of those things eventually being added in as difficulty settings (which is what I see he suggests as well), I don\u0027t think many, if any, of those are pressing matters. The game is supposed to be \u0022educational\u0022 but one has to ask in what way. I don\u0027t think Squad ever intended the game to actually teach people to be actual rocket scientists, which is what it seems like the entire post is premised upon.\u003C/p\u003E\u003Cp\u003EOne of the few things he suggests that I would agree with would be to make the tech tree easier to edit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I gotta agree with you there.\u003C/p\u003E\u003Cp\u003ENot nearly enough people are interested in playing on \u0027uberhard\u0027 mode - which is what some other people are asking for. \u003C/p\u003E\u003Cp\u003EBy my accounting, KSP is a reasonable 1st order approximation of a space simulator. Yes, there are a ton of simplifications that have been made but here is the deal with building a simulation or a model:\u003C/p\u003E\u003Cp\u003EA model or simulation should only be as complex \u003Cem\u003Eas is needed to accomplish the goal\u003C/em\u003E no more complicated. This is the golden rule of building a model or a simulation in science. Model the stuff you need, control the stuff you don\u0027t. I work on modeling human-robot interaction. We have models that treat the human as a big sack of potatoes (which is useful when looking at \u0027out of bandwidth\u0027 behaviors) - that\u0027s easy, treat them like a m, spring, and damper. Done. We have models that treat the human as a sort-of intelligent potato; these are good for modeling how the person behaves when you throw different, yet in the same neighborhood challenges to them. Etc etc\u003C/p\u003E\u003Cp\u003EOver-complicating your model for the sake of accuracy is one way that people don\u0027t finish their PhDs (the other, of course, being KSP). \u003C/p\u003E\u003Cp\u003EYou can never win by making it more accurate for the sake of more accuracy, there needs to be a *specific* point for each layer of complexity. A cost benefit in other words. \u003C/p\u003E\u003Cp\u003EAll of the \u0027more realism\u0027 requests are generally in the direction of \u0027make the game more challenging\u0027 which is *not* necessarily a positive thing, especially if it costs a ton of work to get there. \u003C/p\u003E\u003Cp\u003ESome things, like FAR and DRE could add alot to the game, in that you need to think quite a bit more about your design, but in general, the cost to the player is fairly low. Even though the whole \u0027Your Center of Drag is higher than your CG, your rocket tipped over\u0027 is a hard thing to learn, without hitting the forums.\u003C/p\u003E\u003Cp\u003EAnd requiring people to hit the forums to play the basic game is a *bad* thing. It discourages people, when you want them to enjoy the awesomeness that building and flying rockets is. Anything that discourages more people than it inspires is, in my book, a terrible design choice.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-10-09T15:05:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Doc\u0022 data-cite=\u0022Doc\u0022\u003E\u003Cdiv\u003EAll of the \u0027more realism\u0027 requests are generally in the direction of \u0027make the game more challenging\u0027 which is *not* necessarily a positive thing, especially if it costs a ton of work to get there. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot true. Vast majority of it is actually to make game easier. It\u0027s been debunked few dozens of times already on a forum, just look at any of the topics devoted to the realism.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Doc\u0022 data-cite=\u0022Doc\u0022\u003E\u003Cdiv\u003EYou can never win by making it more accurate for the sake of more accuracy, there needs to be a *specific* point for each layer of complexity. A cost benefit in other words. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain: look at the topics devoted to the realism - people there give dozens of reasons why certain elements of simulation add value to the game and aren\u0027t just \u0022accuracy for the sake of more accuracy\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Doc\u0022 data-cite=\u0022Doc\u0022\u003E\u003Cdiv\u003ESome things, like FAR and DRE could add alot to the game, in that you need to think quite a bit more about your design, but in general, the cost to the player is fairly low. Even though the whole \u0027Your Center of Drag is higher than your CG, your rocket tipped over\u0027 is a hard thing to learn, without hitting the forums.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThings like that are a problem with game interface and... well... game focusing around \u0022repetitive attempts and failures are a good thing\u0022 principle which devs promote over and over again. Well - guess what: it doesn\u0027t work for everyone, and example you gave is clearly one of them.\u003C/p\u003E\u003Cp\u003EYou could easily have a \u0022checklist\u0022 in the GUI that would show you what you could have do wrong, like having too low TWR, too low delta-v to reach an orbit, missing solar panels, lack of wheels on a spaceplane, badly placed center of mass, etc.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Doc\u0022 data-cite=\u0022Doc\u0022\u003E\u003Cdiv\u003E And requiring people to hit the forums to play the basic game is a *bad* thing. It discourages people, when you want them to enjoy the awesomeness that building and flying rockets is. Anything that discourages more people than it inspires is, in my book, a terrible design choice.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETotally agreed.\u003C/p\u003E\u003Cp\u003ESadly KSP right now does very little to explain itself and visiting forums and/or Wiki is pretty much mandatory.\u003C/p\u003E\u003Cp\u003EEver since I bought KSP I joined forum and been posting for better GUI explaining people what\u0027s going on, cause the amount of hidden stuff and illogical quirks this game has is jaw-dropping once you know them all.\u003C/p\u003E\u003Cp\u003EBut it seems like both: developers and hardcore players with years of experience in KSP are very much against it or any other major changes devoted to making KSP more logical and intuitive game.\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-10-09T15:26:26Z","Content":"\n\u003Cp\u003EMake x64 work.\u003C/p\u003E\u003Cp\u003EEverything else I want is pretty much provided by mods. . . . I\u0027d like to be able to run more!\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2014-10-09T16:35:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Doc\u0022 data-cite=\u0022Doc\u0022\u003E\u003Cdiv\u003E(Snip)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/95910-What-would-you-want-in-the-next-update-%280-26%29?p=1462028\u0026amp;viewfull=1#post1462028\u0022 rel=\u0022external nofollow\u0022\u003EI think that my response to FleetAdmiralJJ would also fit to your argument\u003C/a\u003E ...\u003C/p\u003E\u003Cp\u003EMore clearly, the post they were talking about was a wish list made by regex, that a lot of people tend to label as a realism-monger ( his self-adversing of his wish of KSP being more like Orbiter probably doesn\u0027t help ). Did you cared to read the list ? I\u0027ll assume you did at this point, so you probably noticed that a lot of his requests were made with the propose of making the game more educational ( as the game is touted to be ... you probably know about KerbalEdu ), not to add necessarily more realism ... besides the fact that teaching lies is not educational, that is. Being myself tutoring some 16 yr old kids in Physics at this moment, I cannot stress enough the fact that the current game is \u003Cstrong\u003Enot\u003C/strong\u003E suitable to teach anything about physics as soon as you enter a atmosphere to kids at that point of their learning ( orbits are ok, since the gravity is modeled in a good enough way and you can do some interesting things regarding sat orbital planning and circular movements in general ) ... even ground movement is strangely non-physical ( just try to make a inclined path to demonstrate vectorial decomposition of forces, just to see that in some places in Kerbin gravity pushes sideways :/ ). I definitely do not want to teach to those kids that air drag is akin to a force field and is independent of the orientation of the object, just for a example \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn your argument of models, well, models should have certain thresholds of reality mimicking to be considered competent and those levels are defined by the model maker. So let\u0027s see a certain area of the game ( the one people bicker around more, TBH ): aerodynamics. If you ever read the text that describes nosecones, you\u0027ll see that they are supposed to help reduce drag effects on rockets, so you have a statement of the model maker that his model is supposed to make nosecones reduce drag related kinetic energy losses. Despite that, when you use them in the context of the modeled aerodynamics of the game, they actually increase drag losses. So this model is not compliant with the stated goals of the model maker ( thus in any sane environment you would either ( or both ) make a better model or lower your expectations ). Note that is is not saying that you need a model that takes in account heat dissipation dynamics and van der Walls corrections, just a model that makes nosecones useful \u003Cem\u003Eas per the model maker stated wish\u003C/em\u003E. Same would apply to other parts of the game, BTW ( like deadly reentry, as stated in the MK1 can text ).\u003C/p\u003E\u003Cp\u003EAnd on the \u0022 people needing to go to the forums or the wiki\u0022 issue: well, like Sky_walker says above, that is a issue of the game UI more than anything else .. and of the somewhat ... err ... confusing ( IMHO ) position devs have about the value of self discovery and learning by error and explosions ( while at the same time putting stuff in the shelf just because they are supposedly grindy ... sigh ). In other words, if the devs don\u0027t want to show numbers or initiate the players in the physics behind the game mechanics ( to fulfill their self-learnt and leant by error philosophy ), you won\u0027t learn that via the game, period ( at best you get a fuzzy understanding due to experience ). You can\u0027t have it both ways ...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T16:38:54Z\u0022 title=\u002210/09/2014 04:38  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by r_rolo1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2014-10-09T17:21:20Z","Content":"\n\u003Cp\u003E1. Stock Kerbal Engineer -- the only mod which I feel is an absolute must.\u003C/p\u003E\u003Cp\u003EOther worthy mention (mod/parts) that I always add for my play style, which I wouldn\u0027t mind stock : \u003C/p\u003E\u003Cp\u003E - B9 \u0022truck cockpit\u0022 (M27 ?) -- only B9 part I use, or almost.\u003C/p\u003E\u003Cp\u003E - BoulderCo\u0027s Clouds\u003C/p\u003E\u003Cp\u003E - Visual enhancements (oddly I prefer an older version, and I removed the city lights)\u003C/p\u003E\u003Cp\u003E - Kommit Nucleonics (for the 4 new nuclear engines, ideal for part reduction as the big one = 4 regular LV-N engine, and well balanced)\u003C/p\u003E\u003Cp\u003E - Kosmos for the solar panels\u003C/p\u003E\u003Cp\u003E - Near future tech for the solar panels\u003C/p\u003E\u003Cp\u003E - Surface Lights\u003C/p\u003E\u003Cp\u003E - and \u0022ion hybrid electric pack\u0022 for the nice \u0022future ion parts\u0022, and 5k xenon tanks (I always unlock these when my science tree is complete, and not before, at least in career)\u003C/p\u003E\u003Cp\u003E2. (not gonna happen... but) Custom fuel tank parts. \u003C/p\u003E\u003Cp\u003E1- pick shape (say spherical), \u003C/p\u003E\u003Cp\u003E2- pick size (Say extra large, or like 10k of resource) \u003C/p\u003E\u003Cp\u003E3- pick texture (say orange tank\u0027s), \u003C/p\u003E\u003Cp\u003E4- Pick color (say forest green), \u003C/p\u003E\u003Cp\u003E5- pick what it holds (say Xenon). \u003C/p\u003E\u003Cp\u003E --\u0026gt; You now have a huge, green, spherical fuel tank for that interplanetary Ion ship, which is 10k xenon, for ONE piece. That is even better than welding. Put them in a new \u0022custom\u0022 tab, and you don\u0027t HAVE to use that feature, newbies won\u0027t. But for others it\u0027s incredibly interesting !\u003C/p\u003E\u003Cp\u003E3. (not possible yet) Unity version that allows 1k\u002B part station \u002B visiting supership without any lag (except what your computer cannot handle.\u003C/p\u003E\u003Cp\u003EI love the game as it is already, but these 3 things would make it even better for me.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-10-09T17:51:35Z","Content":"\n\u003Cp\u003ERealism has no specific interaction with \u0022difficulty\u0022 in terms of direction. Some realism makes the game easier, some might make it seem harder. Any such changes are mostly compared tot he current state of the game, not compared to the state of a new player who has to kern the game anyway. Life support is about 1000X more \u0022difficult\u0022 to deal with than FAR/DRE/etc, for example---and that\u0027s just using \u0022Snacks.\u0022\u003C/p\u003E\u003Cp\u003EI\u0027d like to see the usual suspects added (reentry, and something like FAR) since the difficulty setting can always disable failures.\u003C/p\u003E\u003Cp\u003ELife support (abstracted as a single \u0022item\u0022 that is consumed, even) would be fine, and honestly is far more significant in terms of altering play than any fund limitations. Life support \u003Cem\u003Eprofoundly\u003C/em\u003E changes gameplay in a way that FAR, for example, simply doesn\u0027t. If I had started with FAR installed, I\u0027d never have noticed it was there, frankly (and I hardly notice having played stock). LS can be a difficulty setting as well, and there can be novel contracts associated with itÃ¢â‚¬Â¦ instead of stranded kerbals we could have a stranded craft (with docking port) and resupply it, for example. LS running out becomes a real time limit on the mission, as well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T20:40:46Z\u0022 title=\u002210/09/2014 08:40  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-10-09T20:22:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KapitaenM\u0022 data-cite=\u0022KapitaenM\u0022\u003E\u003Cdiv\u003EAll vessel renaming to be manageable by the Tracking Center, not the individual craft\u0027s control module (which also requires it to be powered to be named).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is already a thing. Click the \u0022i\u0022 button on the right after selecting a ship in the Tracking Station, then click its name to rename it. This allows you to rename flags, debris, and asteroids as well as ships.\u003C/p\u003E\u003Cp\u003EOr did you mean they should disable the option to rename it in flight?\u003C/p\u003E\n"},{"CreatedByName":"Fiddlestyx","CreatedById":57329,"CreatedDateTime":"2014-10-09T21:40:57Z","Content":"\n\u003Cp\u003ENot necessarily in the next update, but definitely someday I would like a Stock first person mode. Not just any first person mode either, but one where I see from inside the helmet. One where maybe it could bring up a HUD type display on the face shield when on EVA with vital info. That would be awesome.\u003C/p\u003E\n"},{"CreatedByName":"spaceman1999","CreatedById":68861,"CreatedDateTime":"2014-10-09T22:00:55Z","Content":"\n\u003Cp\u003EBTSM to become stock.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-10-09T22:45:23Z","Content":"\n\u003Cp\u003EI\u0027d love to see some major tweaks to the current big features of career mode, such as science, contracts, and the new strategies. Right now, they just seems to be \u0022optional\u0022 features floating around with little connection to the space-program-running part of the game. I\u0027d like Squad to make them less optional and more critical to your space program. How would thye do it? I really don\u0027t know, but the geniuses over there surely find an answer.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-10-09T23:12:03Z","Content":"\n\u003Cp\u003EI\u0027ve wanted this for a while. I\u0027d like a way to define mission parameters in-game (Land on Duna with a probe) and then with the assistance of the game plan the step-by-step mission (launch to LKO, transfer to Duna, aerobrake to orbit, land with probe) and generate \u0022planning nodes\u0022 that are like maneuver nodes but not attached to a ship, and just tell you the total dV needed for, say, your transfer to Duna. Like as if you could put a maneuver node on Kerbin\u0027s orbit.\u003C/p\u003E\u003Cp\u003EThen the game can come up with a suitable rep/money reward for success of each step and penalties for failure.\u003C/p\u003E\n"},{"CreatedByName":"airelibre","CreatedById":107713,"CreatedDateTime":"2014-10-09T23:34:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EUpdated unity, biomes on all planets, female Kerbals, Kerbals keeping a record of where they\u0027ve been.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWho\u0027s to say there are not already female Kerbals? It\u0027s no less crazy than the fact that all of them look exactly the same except for facial expressions. Or maybe there is only one gender of Kerbal. And if they do bring in sexually differentiated Kerbals, why should they look like stereotypical human females? (Long hair, longer eyelashes etc.)\u003C/p\u003E\n"},{"CreatedByName":"Reichtangle","CreatedById":116663,"CreatedDateTime":"2014-10-10T00:10:48Z","Content":"\n\u003Cp\u003EThis just in! What I want is for .TGAs to work!\u003C/p\u003E\n"}]}