{"TopicId":86596,"ForumId":36,"TopicTitle":"0.90 Kerbal Weather Systems! Alpha 0.5.3 WIP! (Jan 2)","CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2014-10-09T03:27:37Z","PageNum":9,"Articles":[{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2015-01-18T09:51:34Z","Content":"\n\u003Cp\u003EI\u0027m glad that you like it. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EVessel vessel = FlightGlobals.ActiveVessel;\u003C/p\u003E\u003Cp\u003EVector3 Up = vessel.upAxis.normalized; \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis gives me the normal vector to the planetary surface i suppose. But how do i know which direction is north or east?\u003C/p\u003E\u003Cp\u003ERegarding the other tips: thanks, yeah i might do that.\u003C/p\u003E\u003Cp\u003ERegarding licensing: Oh well, your are right of course. GPL conflicts with All Rights Reserved. I did not intend that. Next version will be MIT license so you can reintegrate it if you want to. I have been stripping the last bits of your code. The result would be free of your rights. AFAIK you can only copyright specific implementations, not ideas.\u003C/p\u003E\u003Cp\u003EEdit: New version is up.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-18T12:53:54Z\u0022 title=\u002201/18/2015 12:53  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 18, 2015\u003C/time\u003E by DaMichel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-18T15:49:37Z","Content":"\n\u003Cp\u003E@DaMichel, here is the north and east: \u003C/p\u003E\u003Cp\u003EVector3 East = Vector3.Cross(vessel.mainBody.angularVelocity, Up).normalized; \u003C/p\u003E\u003Cp\u003EVector3 North = Vector3.Cross(East, vessel.upAxis).normalized; \u003C/p\u003E\u003Cp\u003EAlso, I\u0027m quite sure you can\u0027t copy paste code, then delete it, then rewrite it to avoid copyright... So yeah... Also, because you did copy paste a giant portion of my code, it\u0027s not really your Intellectual Property, you just took an old version of mine and polished it, which is like taking art, recolouring it, and claiming it\u0027s now your own...\u003C/p\u003E\u003Cp\u003EAs for your \u0022mod\u0022 which is really just an extension of mine, and tbh, I think when my mod gets going, what you have now should definitely be integrated into a building of sorts. Perhaps we could look at something from KerbTown, make our own facility model, and then just go from there, eh?\u003C/p\u003E\u003Cp\u003E~SilverFox8124\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E@DaMichel, I don\u0027t know how much testing you\u0027ve done with the wind, but in meteorology, a wind blowing North, is Southerly wind. The winds you have when I click North, I\u0027m expecting it to go north, not be Northerly ;p. Also, if you\u0027re going to stick with the \u002B- windspeed stuff, Please, oh please put in a Wind Zero button, or implement a \u0022Remember\u0022 button, so that it \u0022remembers\u0022 the current wind speed, then you can zero the windspeed out, then change direction of whatever, then click a button to bring it back to the \u0022remembered\u0022 setting.\u003C/p\u003E\u003Cp\u003EAgain, despite how it may seem I am with the whole CR and Licensing stuff, I\u0027m the only one of my kind doing this, and so far it\u0027s taken me 4-5 months to get where I am, I\u0027m quite protective of it, and not only the countless hours I spent coding and testing, but the countless hours upon hours of research I put into it just to make sure I was giving you guys the most accurate weather I could give. *That\u0027s* what I\u0027m protective about.\u003C/p\u003E\u003Cp\u003E~SilverFox8124\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2015-01-18T18:57:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso, I\u0027m quite sure you can\u0027t copy paste code, then delete it, then rewrite it to avoid copyright... So yeah... Also, because you did copy paste a giant portion of my code, it\u0027s not really your Intellectual Property, you just took an old version of mine and polished it, which is like taking art, recolouring it, and claiming it\u0027s now your own...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are right, my bad. Consider my code as contribution then. I will fix the license shortly.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs for your \u0022mod\u0022 which is really just an extension of mine, and tbh, I think when my mod gets going, what you have now should definitely be integrated into a building of sorts. Perhaps we could look at something from KerbTown, make our own facility model, and then just go from there, eh?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, you can do with it whatever you want. And it is a significant extension. Can\u0027t argue about that either.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E@DaMichel, I don\u0027t know how much testing you\u0027ve done with the wind, but in meteorology, a wind blowing North, is Southerly wind. The winds you have when I click North, I\u0027m expecting it to go north, not be Northerly ;p. Also, if you\u0027re going to stick with the \u002B- windspeed stuff, Please, oh please put in a Wind Zero button, or implement a \u0022Remember\u0022 button, so that it \u0022remembers\u0022 the current wind speed, then you can zero the windspeed out, then change direction of whatever, then click a button to bring it back to the \u0022remembered\u0022 setting.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was thinking of the direction which the wind is reported in.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAgain, despite how it may seem I am with the whole CR and Licensing stuff, I\u0027m the only one of my kind doing this, and so far it\u0027s taken me 4-5 months to get where I am, I\u0027m quite protective of it, and not only the countless hours I spent coding and testing, but the countless hours upon hours of research I put into it just to make sure I was giving you guys the most accurate weather I could give. *That\u0027s* what I\u0027m protective about.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m sorry, i didn\u0027t mean to be disrespectful. I just want to have the freedom to do whatever i want to with the bits of code that i wrote and will write. So this project is finished. It has achieved the goal to get some specific wind going. If i ever get the urge to extend or change it, i\u0027m just going to rewrite it without ever looking at the present code. That should be fine. Or it won\u0027t because chances are that it will look exactly like what i have now ... but at least i will have a clean conscience then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-18T19:10:29Z\u0022 title=\u002201/18/2015 07:10  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 18, 2015\u003C/time\u003E by DaMichel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-18T19:40:38Z","Content":"\n\u003Cp\u003E@DaMichel, You are fine to look at my code for examples and help, but copy-pasting and claiming it is yours was my main worry. \u003C/p\u003E\u003Cp\u003EHowever, when weather people say Northerly wind, it\u0027s wind going from North to South, it\u0027s always opposite of what you think, and when I click North on your GUI, I expect it to blow Southerly, unless stated somewhere that the wind comes from that location, I, as a general user, assume I want wind to blow north.\u003C/p\u003E\u003Cp\u003EFrom what I see on the news, they don\u0027t say the -ly at the end, so I assume it is conveying to the viewer that the wind is blowing in that direction, unless they say \u0022coming from the north east\u0022 in which case, it is North Easterly. \u003C/p\u003E\u003Cp\u003EIn the context of making a wind tunnel, perhaps we could look into Kerbtown, make our own model and spawn the ship in the place for testing and go from there?\u003C/p\u003E\u003Cp\u003E~SilverFox8124\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2015-01-18T21:12:21Z","Content":"\n\u003Cp\u003EDear silverfox8124, would you put this file \u003Ca href=\u0022https://github.com/wased89/Kerbal-Weather-Systems/blob/master/KerbalWeatherSystems.cs\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/wased89/Kerbal-Weather-Systems/blob/master/KerbalWeatherSystems.cs\u003C/a\u003E under a permissive license, please? \u003C/p\u003E\u003Cp\u003EThis would be very awesome of you. The thing is, since you hold all the rights, you could just pull the plug by revoking any permission you gave me (?). I don\u0027t want that, obviously. Also when you stop playing the game, nobody can develop it further nor maintain it. This is obvious, but i\u0027d like my stuff not to be forever lost when i disappear. In this case i mean the work that i did to extend and polish your original. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHowever, when weather people say Northerly wind, it\u0027s wind going from North to South, it\u0027s always opposite of what you think, and when I click North on your GUI, I expect it to blow Southerly, unless stated somewhere that the wind comes from that location, I, as a general user, assume I want wind to blow north.\u003C/p\u003E\u003Cp\u003EFrom what I see on the news, they don\u0027t say the -ly at the end, so I assume it is conveying to the viewer that the wind is blowing in that direction, unless they say \u0022coming from the north east\u0022 in which case, it is North Easterly. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is confusing. I agree and it should be made more clear. I\u0027m thinking a little arrow would do the trick.\u003C/p\u003E\u003Cp\u003EAbout the wind tunnel idea: We? Err, to be frank, i have no plans for such an endeavor. Not devaluing your ideas. Your project is really cool.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-18T21:14:22Z\u0022 title=\u002201/18/2015 09:14  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 18, 2015\u003C/time\u003E by DaMichel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-19T03:50:14Z","Content":"\n\u003Cp\u003E@DaMichel, Sorry, but I\u0027m not changing the license on my project, Once you go from higher restrictive to lesser, there\u0027s no going back without repercussions. As I said before, I don\u0027t mind you using my code as reference, but copy-pasting and claiming as your own is something that doesn\u0027t go well with me.\u003C/p\u003E\u003Cp\u003EOn the note of no one developing it when/if I quit, yes, unless I change license before I quit, then I\u0027ll release a version under the new licensing and people can maintain it if they so please.\u003C/p\u003E\u003Cp\u003EOn the \u0022We\u0022 note, you seemed interested enough on the wind aspect that you wanted to control the wind for testing purposes, so I thought you\u0027d be interested in a wind tunnel kind of project, which is why I brought it up. Anyways, your mod extension could use a txtfield for wind speed, take a look at the Headmaster class under the storms section for the gui, you\u0027ll find a way of doing it there, also note how I empty the string on Awake(), without it, the textfield would fail for me.\u003C/p\u003E\u003Cp\u003EWith best regards,\u003C/p\u003E\u003Cp\u003E~SilverFox8124\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2015-01-19T13:36:55Z","Content":"\n\u003Cp\u003EExcuse me! I have given you credit from the very beginning and clearly stated that i based my work upon yours. Had i not been this honest then you could not even tell right now whether i started with your code or not.\u003C/p\u003E\u003Cp\u003ETo be honest again, i still believe that, by transforming your incomplete template into an actual functional mod, i created an original work which deserves to be protected under my terms. But i give you the benefit of doubt. Also i don\u0027t want to look like a thief.\u003C/p\u003E\u003Cp\u003EReally this one file, which you are so protective of, is not much more than common boilerplate code. The nontrivial parts have been replaced. That would be a) the determination of the wind vector which was incorrect. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E The gui, which was in a state of being worked on, was replaced with something different. I do admit though that your code gave me a head start. You also benefited from the work of other people very obviously (EVE clouds). Of course this was published under a permissive license.\u003C/p\u003E\u003Cp\u003EI changed the license statement according to your request. Are we cool that i still have permission to distribute my version? Proper credits will be given. Never intended anything else.\u003C/p\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-19T13:54:36Z","Content":"\n\u003Cp\u003E@DaMichel, I am only stating my worry in such a situation, No matter how .... my work may have been, Im protective over it. I also cant change the license for a specific file.. on the note of EVE code, I talked with rbray before copying his code and I received explicit permission to do so. All I ask for is proper recognition. Your mod extension is kind of on a line of being able to have it\u0027s own thread, but not at the same time. That much will be up to you. \u003C/p\u003E\u003Cp\u003EOn note of you distributing, yes, as long as proper recognition is given and that line of license code is added into your license, then yeah we\u0027re cool. \u003C/p\u003E\u003Cp\u003EThere\u0027s still a bit more to add however, and I\u0027ve been debating making my mod stock compatible, if I do, I\u0027ll send some code your way so that you too may benefit from it.\u003C/p\u003E\u003Cp\u003EOn another note, did you get the north east code in yet? And have you made an arrow for direction? If you ever need a visual way of debugging, I have a line renderer in my headmaster.cs in which you can use, it\u0027s quite helpful tbh.\u003C/p\u003E\u003Cp\u003E~SilverFox8124\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-19T14:28:30Z\u0022 title=\u002201/19/2015 02:28  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 19, 2015\u003C/time\u003E by silverfox8124\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"skykooler","CreatedById":60459,"CreatedDateTime":"2015-01-19T16:48:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022silverfox8124\u0022 data-cite=\u0022silverfox8124\u0022\u003E\u003Cdiv\u003EVector3 East = Vector3.Cross(vessel.mainBody.angularVelocity, Up).normalized; \u003Cp\u003EVector3 North = Vector3.Cross(East, vessel.upAxis).normalized; \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENote that that would give wrong results for any PF or Kopernicus planets that spin retrograde.\u003C/p\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-19T18:25:13Z","Content":"\n\u003Cp\u003E@skykooler, Ahh yes, that would makes sense, I\u0027ll investigate into that.\u003C/p\u003E\n"},{"CreatedByName":"Nitrous Oxide","CreatedById":131998,"CreatedDateTime":"2015-01-19T21:19:36Z","Content":"\n\u003Cp\u003EI\u0027m wondering, if I were to import my textures from EVE, as well as the config (using Better Atmospheres), should that work as I intend? I\u0027m interested in trying this out, but I\u0027ve already got EVE installed, so I\u0027d probably have to remove it first as far as I can tell... thanks.\u003C/p\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-19T21:59:34Z","Content":"\n\u003Cp\u003E@NO2, yes, you should uninstall EVE before installing my mod, otherwise there would be two cloud layers in one layer, or more layers than necessary, and that will poop on your computer\u0027s performance.\u003C/p\u003E\n"},{"CreatedByName":"Nitrous Oxide","CreatedById":131998,"CreatedDateTime":"2015-01-20T01:25:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022silverfox8124\u0022 data-cite=\u0022silverfox8124\u0022\u003E\u003Cdiv\u003E@NO2, yes, you should uninstall EVE before installing my mod, otherwise there would be two cloud layers in one layer, or more layers than necessary, and that will poop on your computer\u0027s performance.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI figured as much. Is your system set-up to handle any EVE config for the cloud layers, or just the one specific one? If I were to remove the clouds from my EVE config and put them into your cloudLayers.cfg (same syntax and all), would it work? I have a few changes and custom textures that I\u0027d like to keep if possible (well, the textures are easy, just overwrite the file).\u003C/p\u003E\u003Cp\u003EAlso I assume I could technically leave EVE installed for auroras/atmosphere effects if the above works, since EVE wouldn\u0027t be adding any cloud layers anymore. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2015-01-20T10:39:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022silverfox8124\u0022 data-cite=\u0022silverfox8124\u0022\u003E\u003Cdiv\u003EI also cant change the license for a specific file.. on the note of EVE code, I talked with rbray before copying his code and I received explicit permission to do so. All I ask for is proper recognition. Your mod extension is kind of on a line of being able to have it\u0027s own thread, but not at the same time. That much will be up to you. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy do you think you cannot change the license for a specific file? I mean you put it under \u0022All rights reserved\u0022. My interpretation of it is that you can do anything you want to. What is the legal state of my code right now anyway? Could be that i violated your copyright. Now it is very much different from your code. So whose property is it? If it was all yours - that would not be cool.\u003C/p\u003E\u003Cp\u003EEasiest solution would be to just give me permission to put the code *which i have now* under the MIT license. Let me add an extra clause that credit shall be given to you. I\u0027m quite liberal with giving credit. See my other mods. Don\u0027t worry.\u003C/p\u003E\u003Cp\u003EI\u0027m going to make a release thread this evening, i guess.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThere\u0027s still a bit more to add however, and I\u0027ve been debating making my mod stock compatible, if I do, I\u0027ll send some code your way so that you too may benefit from it.\u003C/p\u003E\u003Cp\u003EOn another note, did you get the north east code in yet? And have you made an arrow for direction? If you ever need a visual way of debugging, I have a line renderer in my headmaster.cs in which you can use, it\u0027s quite helpful tbh.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t really take requests. But yeah. If you have something interesting, just make a pull request.\u003C/p\u003E\u003Cp\u003EYes, i changed the code and managed to add a direction arrow using unicode symbols \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E There are also a couple of more fixes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-20T10:44:39Z\u0022 title=\u002201/20/2015 10:44  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 20, 2015\u003C/time\u003E by DaMichel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-20T17:54:36Z","Content":"\n\u003Cp\u003E@NO2, I\u0027m not sure about the custom textures, as long as they have the same file name and are in the same place as my own, it should work. Try it out and give it a see, I haven\u0027t experimented with custom textures and such just yet.\u003C/p\u003E\u003Cp\u003E@DaMichel, It\u0027s fine by me if you release the code, as I\u0027ve stated before, I am concerned about giving credit where credit is due (And I\u0027m not saying you don\u0027t do it, I\u0027m just re-iterating my concerns on the topic in general) As long as you link to this thread and have that license line I supplied you in with it, I\u0027m all cool with it, and would be glad to help you if you have any more requests in regards to how about I went things, or how a certain aspect of my code makes sense, or how else it could be utilized. I\u0027m quite glad to help when I can. And yes, you have my permission to put your code under MIT and add a clause that gives credit where credit is due.\u003C/p\u003E\u003Cp\u003EAlso, on a more general note. What kind of Memory space do you all have for KSP (windows 32 bit, Linux whatever), as I\u0027m looking into making my code better and the such and sometimes the mod can take a few hundred MBs of RAM. If you all are tight on RAM space, then are you guys able to sacrifice CPU usage to make up for it? This is the kind of balancing I need to do the entire time to make sure that it\u0027s as optimal as can be for you all.\u003C/p\u003E\u003Cp\u003ESorry for the delay in releases, this update is going to be tricky to get right, and is already quite massive tbh.\u003C/p\u003E\u003Cp\u003E~SilverFox8124\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2015-01-20T21:13:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022silverfox8124\u0022 data-cite=\u0022silverfox8124\u0022\u003E\u003Cdiv\u003EAnd yes, you have my permission to put your code under MIT and add a clause that gives credit where credit is due.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerfect. Thank you so much.\u003C/p\u003E\u003Cp\u003EI\u0027m using the 32 bit version, btw. 64 bit KSP didn\u0027t work properly in 0.25 and it is supposed have become even more unstable. CPU time is scarce. I usually don\u0027t have too much part mods at the same time so memory consumption is not so much of an issue. Hundreds of MBs is a lot though. \u003C/p\u003E\u003Cp\u003EI suggest to offload the calculations into an extra thread. Weather simulation is perfect for that because there is virtually no interaction with the rest of the game. Tiny exception is that you need to get the wind speed at the craft location. It could run on an otherwise unused core. Synchronize the data only every few frames.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-20T23:29:13Z\u0022 title=\u002201/20/2015 11:29  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 20, 2015\u003C/time\u003E by DaMichel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-20T22:55:28Z","Content":"\n\u003Cp\u003E@DaMichel, yes, multi-threading has gone through my head, and will eventually be thing I will do, in some form. I also found out that my grids aren\u0027t using much memory at all, but it is the textures that are using more memory than I\u0027d like, with kerbin\u0027s being ~28MB each layer... So I will do some tweaking on that, and there should be less RAM usage by my mod. But going through and doing a bit of optimizing on my cells has brought down the memory usage a bit, which always helps.\u003C/p\u003E\u003Cp\u003EEDIT: I have tuned down the resolution on Kerbin\u0027s cloud maps, this has freed up ~300MB of RAM, expect performance updates to come!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-20T23:23:48Z\u0022 title=\u002201/20/2015 11:23  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 20, 2015\u003C/time\u003E by silverfox8124\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Astrofox","CreatedById":135785,"CreatedDateTime":"2015-01-21T00:21:33Z","Content":"\n\u003Cp\u003Esilverfox8124, I was wondering if there will ever be an optional config for Kerbal Weather Systems to work with Stock Drag.\u003C/p\u003E\u003Cp\u003EThank you\u003C/p\u003E\u003Cp\u003E-Astrofox\u003C/p\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-21T02:31:19Z","Content":"\n\u003Cp\u003E@Astrofox, I\u0027m debating whether to add in stock drag as well, it\u0027ll be great to have, but it\u0027ll be a challenge to get right. I\u0027ll look into it, but no promises for the next release.\u003C/p\u003E\n"},{"CreatedByName":"Doctor Axel","CreatedById":64944,"CreatedDateTime":"2015-01-22T14:37:54Z","Content":"\n\u003Cp\u003EI LOVE the idea of this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI can\u0027t really tell from what it says on the tin, though - can you tell it to just randomly generate random weather over time? Also - does this have an impact on worlds with atmospheres other than Kerbin?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-22T15:06:29Z\u0022 title=\u002201/22/2015 03:06  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 22, 2015\u003C/time\u003E by Doctor Axel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-22T16:18:21Z","Content":"\n\u003Cp\u003E@Doctor Axel, No, Whimsical weather is NOT something I want to do. Weather should be predictable, follow patterns, laws and rules, you should be able to track it with accuracy and knowledge and experience. On the topic of weather on other planets, it won\u0027t be as accurate on say Duna than it is on Kerbin, mainly because we don\u0027t know as much about the climate of Mars as we do Earth. Some of the same concepts are still hanging around, but the atmosphere is highly different in it\u0027s molecular composition, and it makes it extremely hard for me to work with, given some of my formulas use the mass of dry air in moles.\u003C/p\u003E\u003Cp\u003E*Choo choo* Hype train, there WILL be dust storms on Duna, in time I can promise you that that is one of my end goals of this, is to have dust storms like they do on Mars. Laythe will be quite interesting to do, but I\u0027m still working on ways of making my code better and TOTALLY NOT THROWING NaN AT ME ALL THE TIME ARGH.\u003C/p\u003E\u003Cp\u003E~SilverFox8124\u003C/p\u003E\n"},{"CreatedByName":"Doctor Axel","CreatedById":64944,"CreatedDateTime":"2015-01-22T16:31:40Z","Content":"\n\u003Cp\u003EHm, I see. So wind will happen pretty much when the \u0022wind\u0022 box is checked off? And gusts will happen when the \u0022gusts\u0022 box is checked off? Or will there will be (slash is there) a system to automate the whole thing intelligently?\u003C/p\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-22T17:01:15Z","Content":"\n\u003Cp\u003E@Doctor Axel, The wind box isn\u0027t a thing anymore, the wind happens automatically as of the current live version. Read the OP and changelog, that should answer some of your basic questions.\u003C/p\u003E\n"},{"CreatedByName":"Doctor Axel","CreatedById":64944,"CreatedDateTime":"2015-01-22T17:06:21Z","Content":"\n\u003Cp\u003EAha. That\u0027s what I get for being lazy. =P \u003C/p\u003E\u003Cp\u003EThanks for the info! Definitely gonna check this one out.\u003C/p\u003E\n"},{"CreatedByName":"silverfox8124","CreatedById":125032,"CreatedDateTime":"2015-01-24T04:41:58Z","Content":"\n\u003Cp\u003EDev Update!: After two days of bug tracking, darklight and I have found a way so that you guys don\u0027t have to worry about FAR versioning with the next upcoming release of KWS. If you want to use the previous FAR, then so be it, and newer versions of FAR that come out shouldn\u0027t require me to make an update.\u003C/p\u003E\n"}]}