{"TopicId":86616,"ForumId":70,"TopicTitle":"Joystick not working - Bug?","CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2014-10-09T07:44:42Z","PageNum":1,"Articles":[{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2014-10-09T07:44:42Z","Content":"\n\u003Cp\u003EKSP Version: 0.25 Windows 32-bit\u003C/p\u003E\u003Cp\u003EMods: chatterer 0.7.1, kerbal alarm clock 2.7.7.0\u003C/p\u003E\u003Cp\u003EOS: Windows 7 64-bit\u003C/p\u003E\u003Cp\u003EInstalled 0.25 yesterday. Had to re-setup all my joystick settings for the axis after upgrade to 0.25. Started a new career game. After that yesterday the joystick axes worked well. Today no trick in the world will make the joystick work at all. Reloaded KSP, went to settings changed something just to force new settings but didn\u0027t work. Checked in windows game controller settings but joystick is working well, must be a bug in KSP.\u003C/p\u003E\u003Cp\u003EThe buttons i configured to toggle SAS and RCS and breaks work though, it\u0027s just the axis setup thats not working anymore.\u003C/p\u003E\u003Cp\u003ESomething similar was in 0.23. I always went to settings first, hit \u0027apply\u0027 and then joystick usually worked. In 0.24 it worked fine without any tricks and in 0.25 it doesn\u0027t seem to work properly at all anymore.\u003C/p\u003E\u003Cp\u003ENon working joystick axis renders the game pretty much unplayable for me.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EUSB Game Controllers plugged in:\u003C/p\u003E\u003Cp\u003ET.Flightstick.X (Thrustmaster) \u0026lt;- default for old programs\u003C/p\u003E\u003Cp\u003ELogitech Driving Force GT USB\u003C/p\u003E\u003Cp\u003EEdit: not even rebooting helps to get joystick functionality back\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T07:33:19Z\u0022 title=\u002210/10/2014 07:33  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by DocMoriarty\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2014-10-11T10:03:47Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cstrong\u003EThe Solution\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EDeleted settings.cfg in KSP Game folder and did a complete re-setup. After that the joystick axis worked normal and seems to stay that way. I don\u0027t think this bug is related to any mods.\u003C/p\u003E\n"}]}