{"TopicId":86666,"ForumId":69,"TopicTitle":"0.25 Bugs (VAB building missing after revert to VAB)","CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2014-10-09T16:19:41Z","PageNum":1,"Articles":[{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2014-10-09T16:19:41Z","Content":"\n\u003Cp\u003EI was trying to destroy a number of the buildings on KSP and ran into a huge number of problems. First, I could not click on revert flight button (it clicks but does nothing), go to space center (it clicks but does nothing), but I could revert to VAB and when I do, I get something like the attached screenshot. Once that occurs, I\u0027m unable to take screenshots and have to do it with print-screen. The next thing I do results in a crash (save ship, launch, space center, etc). These issues have not occurred to me on other versions of KSP. This one seems unbelievably unstable for me.\u003C/p\u003E\u003Cp\u003E* KSP 0.25 non steam (32bit, stock, clean install, no modifications, even keyboard controls, re-downloaded twice.)\u003C/p\u003E\u003Cp\u003E* Windows XP (32 bit)\u003C/p\u003E\u003Cp\u003E* VAB missing when reverted to VAB\u003C/p\u003E\u003Cp\u003E* Screenshot (For Reference Only. I didn\u0027t get it for the VAB but got it for the SPH): \u003Ca href=\u0022http://2thextreme.org/forum_images/ksp/0.25_Bugs/badsph.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://2thextreme.org/forum_images/ksp/0.25_Bugs/badsph.jpg\u003C/a\u003E (Cant take screenshots using F1)\u003C/p\u003E\u003Cp\u003E* My KSP_Data/output_log.txt is 18.9 MB (19,832,236 bytes), it would take me \u003Cstrong\u003Eforever\u003C/strong\u003E to upload (my upload is abysmal), and it would hammer my host if I posted it there. If there\u0027s a particular thing in there, I can look for it and post bits manually.\u003C/p\u003E\u003Cp\u003E* AMD FX8120 8-core (4GB RAM - 8 physical), older video drivers. Updating has no effect, and causes issues in other applications when I do.\u003C/p\u003E\u003Cp\u003ESteps I took:\u003C/p\u003E\u003Cp\u003E1. Load KSP.\u003C/p\u003E\u003Cp\u003E2. Create new sandbox game.\u003C/p\u003E\u003Cp\u003E3. Go to VAB and build rocket to crash into buildings (probe core, biggest ASAS module, the 32 tank (the one half the size of the orange), mainsail, 4 winglets).\u003C/p\u003E\u003Cp\u003E4. Destroyed launchpad by flying up, turning retrograde and burying the rocket nose first at 450 m/sec into the launchpad by turning the throttle to 11. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E5. Revert to launch.\u003C/p\u003E\u003Cp\u003E6. Crash into the tanks near the launchpad.\u003C/p\u003E\u003Cp\u003E7. Revert launch. Fail at 3 more attempts to hit other buildings.\u003C/p\u003E\u003Cp\u003E8. Revert to VAB. VAB missing, see screenshot above.\u003C/p\u003E\u003Cp\u003E9. Exited.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T16:23:12Z\u0022 title=\u002210/09/2014 04:23  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by MGCJerry\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-10-09T16:25:00Z","Content":"\n\u003Cp\u003ETry zipping the output_log.txt (Send to compressed folder if you don\u0027t have a dedicated program). It should become very much smaller...\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-10-09T16:40:20Z","Content":"\n\u003Cp\u003EThat\u0027s an epic picture. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen logs are this big, they are often full of the same error over and over.\u003C/p\u003E\u003Cp\u003EIf what Padishar suggests is still not manageable, try to recreate the problem with just the bare minimum needed to make it happen, then exit the game. This will ensure the log isn\u0027t full of extra info. Then if you can zip it up it should be even smaller.\u003C/p\u003E\u003Cp\u003EYou can also try opening the log file (which migght be a challenge given the size, and look for a spam of messages at the end. If there is a long list of the same error, you can delete all the extras. That can also trim down the size.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"},{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2014-10-09T20:30:27Z","Content":"\n\u003Cp\u003EThanks for the replies.\u003C/p\u003E\u003Cp\u003EI don\u0027t know why I didn\u0027t think of that Padishar, I feel like such an idiot but my post was typed before I had to leave for awhile (while running into KSP crash after crash).\u003C/p\u003E\u003Cp\u003EClaw, I looked toward the end, and it seems there\u0027s a lot of out of memory messages with this taking up most of the lines \u0022d3d: VB or IB is null\u0022 (starts at line 9,137 and goes to line 852,495). I\u0027ll try to reproduce this \u0022disappearing VAB/SPH\u0022 alone, but I\u0027m getting all kinds of crashes at different periods.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-10-10T00:55:15Z","Content":"\n\u003Cp\u003EBugs like this usually start with one failure that cascades into many problems. That\u0027s why the log will be very important here. Once you run into a problem, you can stop. Because the bugs that come after are usually just the result of the earlier bug.\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"},{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2014-10-11T15:36:34Z","Content":"\n\u003Cp\u003EUnfortunately, I can\u0027t reliably reproduce this bug. I tried documenting my steps later that night but KSP ran wonderfully for over 3 hours. Its never run that good. So I just decided to take advantage of it running great and have fun building stuff with the new parts, which are awesome as well.\u003C/p\u003E\u003Cp\u003EThen last night I had to start KSP 5 times before I could even see the space center. It kept crashing (Something about a non responding part, then the windows \u0022Program has crashed\u0022 popup so I didn\u0027t get time to screenshot the error, it happens quickly). Now my log is over 343MB. During this slugfest with KSP the VAB \u0026amp; SPH did disappear again. I just keep running into different problems with 0.25 when doing the same things.\u003C/p\u003E\u003Cp\u003EI\u0027m going to hold off on my bug reports until I do a more thorough system hardware check.\u003C/p\u003E\u003Cp\u003E* Disk defrag has already been done, its done weekly. (which I think is irrelevant to the problem)\u003C/p\u003E\u003Cp\u003E* I\u0027ve already ran memtest several times and came up clean (21 hours wall-time, 15 passes, 0 errors) (did that the last 2 days while I was not home).\u003C/p\u003E\u003Cp\u003E* Going to run a spinrite surface scan (chkdsk comes up clean).\u003C/p\u003E\u003Cp\u003E* Going to restore \u0022plain os\u0022 disk image restore. I did a disk image with all my drivers installed after I setup my os.\u003C/p\u003E\u003Cp\u003E* Another 3 day full burn-in test.\u003C/p\u003E\u003Cp\u003EIt will be a few days for any ksp.\u003C/p\u003E\n"}]}