{"TopicId":86704,"ForumId":25,"TopicTitle":"Prestige Challange","CreatedByName":"@@","CreatedById":4167,"CreatedDateTime":"2014-10-09T21:24:35Z","PageNum":1,"Articles":[{"CreatedByName":"@@","CreatedById":4167,"CreatedDateTime":"2014-10-09T21:24:35Z","Content":"\n\u003Cp\u003ECongratulations as being appointed The United Kerbal Federations New Space Agency Administrator. As you know this is a political appointment that lasts 5 years, do a good job, and the prime Kerbal will appoint you for another 5. Bringing prestige to your program is the best way to ensure your reappointment, and as such your goal is simple: shower this new agency with as much glory as you can, making it the crown jewel of our planet. \u003C/p\u003E\u003Cp\u003EThis is certainly a different type of challenge. Most challenges involve some kinda build or flight rules. This challenge requires good flight skills for sure, but will also require diligence and good managerial skills. The goal is easy: Highest prestige after a given amount of time. I am going to keep two main scores: 5 years and 10 years. One reason I am running this challenge is because even in a hard campaign I\u0027m finding money a non-issue. Given time, I can do any mission I want, science is just a grind, etc, and I suspect many of you are in the same position. So this is about using the most of what you got, and really pushing that bottom line. \u003C/p\u003E\u003Cp\u003ETo really achieve victory multiple long duration missions are going to have to be going at once. You can\u0027t afford to be sitting on good money that could be earning you prestige by flying a new mission (with contracts) while you wait for your Duna explorer to make its interception. I bet I\u0027m not the only one who runs these long range missions completely before continuing. I know for a fact, I could set up my Jool intercept, and work several other missions going while it is in flight. This is the challenge, run not just one mission, but the entire agency. Maximize resource utilization, and bring GLORY to your space space agency. The hopes and dreams of billions of Kerbals rests in your administrations hands. \u003C/p\u003E\u003Cp\u003ERules:\u003C/p\u003E\u003Cp\u003E1: Must be a career (obviously)\u003C/p\u003E\u003Cp\u003E2: Must be on hard difficulty\u003C/p\u003E\u003Cp\u003E3: Vanilla parts only\u003C/p\u003E\u003Cp\u003E4: No physics mods or other game play mods that in any way effect income, prestige, science\u003C/p\u003E\u003Cp\u003E5: No cheats obviously\u003C/p\u003E\u003Cp\u003E6: It will be hard to verify, but please try to avoid an exploitative bugs/cheats/etc, no kraken engines, no ifinigliders, etc... If you feel that a ship is dubious don\u0027t use it\u003C/p\u003E\u003Cp\u003E7: Even 1 second over time will disqualify you, must be in kerbal time (not earth)\u003C/p\u003E\u003Cp\u003E8: You may use the same save for both entries. \u003C/p\u003E\u003Cp\u003E9: v. 0.25 or later\u003C/p\u003E\u003Cp\u003EI reserve to right to change rules later if I find I forgot anything.\u003C/p\u003E\u003Cp\u003ELeader Board 5 year:\u003C/p\u003E\u003Cp\u003E1.\u003C/p\u003E\u003Cp\u003E2.\u003C/p\u003E\u003Cp\u003E3.\u003C/p\u003E\u003Cp\u003E4.\u003C/p\u003E\u003Cp\u003E5.\u003C/p\u003E\u003Cp\u003E6.\u003C/p\u003E\u003Cp\u003E7.\u003C/p\u003E\u003Cp\u003E8.\u003C/p\u003E\u003Cp\u003E9.\u003C/p\u003E\u003Cp\u003E10.\u003C/p\u003E\u003Cp\u003ELeader Board 10 year:\u003C/p\u003E\u003Cp\u003E1.\u003C/p\u003E\u003Cp\u003E2.\u003C/p\u003E\u003Cp\u003E3.\u003C/p\u003E\u003Cp\u003E4.\u003C/p\u003E\u003Cp\u003E5.\u003C/p\u003E\u003Cp\u003E6.\u003C/p\u003E\u003Cp\u003E7.\u003C/p\u003E\u003Cp\u003E8.\u003C/p\u003E\u003Cp\u003E9.\u003C/p\u003E\u003Cp\u003E10.\u003C/p\u003E\n"}]}