{"TopicId":86702,"ForumId":32,"TopicTitle":"Anyone else not really care for the career stuff?","CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2014-10-09T21:07:57Z","PageNum":3,"Articles":[{"CreatedByName":"haltux","CreatedById":29407,"CreatedDateTime":"2014-10-10T08:33:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Francois424\u0022 data-cite=\u0022Francois424\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIMHO, contacts needs to be more RL inspired, and prolly will be as they get polished. But stuff like : Orbit around Saturn(yeah just using RL analogues here), drop a lander on Titan, do atmospheric science and surface science as the probe falls down. Or get a plane into orbit with 12 kerbals with a total vehicle cost (all stages) of \u0026lt; 100k.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet\u0027s be clear, I am not a hater, but I think contracts are currently completely boring and useless.\u003C/p\u003E\u003Cp\u003EI think the big mistake is to have built a mission generator. Random generated mission are boring, and even if they improve, they will still be boring. There is no such thing as an exciting random mission.\u003C/p\u003E\u003Cp\u003EWe should get entirely scripted mission, that would be similar to forum challenges, but integrated in a consistant scenario, written by an actual, human, scenario writter. Considering how much time it take to do a complex mission in KSP, a \u0022campaign\u0022 could integrate 10 to 20 mission, and new campaigns could be provided as DLC (free or not, that\u0027s not the point of the discussion).\u003C/p\u003E\u003Cp\u003EI think the mission engine is already there, what should be added are unique elements specific to missions (existing spaceships, artifacts are natural elements to investigate, specific parts to deliver somewhere...).\u003C/p\u003E\n"},{"CreatedByName":"Tail_TL","CreatedById":121487,"CreatedDateTime":"2014-10-10T08:44:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EPart of the magic in KSP for me is the exploring aspect. I like the \u0022science\u0022 system in the game because it gives me a purpose to go to these places, but the currency and contracts are piling on features I don\u0027t really want and kind of diverts what I want to do in the game. There\u0027s also tons of mods that I feel should be part of the \u0022official\u0022 game as well but that\u0027s a different argument for another day. I\u0027m just stating my dislike for the focus on the career mod.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EYes And Yes and Yes. Its just sad on how much time they have put in Career mode and it could of been a lot better and more fun, the direction they are going is completely \u0022Bleh\u0022. They started out good with Career and the \u0022Science\u0022 while it was the only thing in career, but after that they went completely side-ways. Would be great if they would scrap the career mode and Re-think it all from ground up, because I don\u0027t see how they could improve it with what they got.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EWhat a bore. Career mode isn\u0027t about nerfing or making the game difficult, it\u0027s about giving it structure. Going to Minmus IS the point, it IS the goal. So is returning. So is dealing with a mishap. Career simply provides structure around how you go about doing these things. It provides a sense of progression and funnels your activity. If you find there is nothing to do when you get somewhere, that\u0027s a lack of vision and imagination on your part.\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EWell I love telling you this: you no longer have perspective of the game as a whole, and that being the case, everything you say is from a tiny, compartmentalized viewpoint. I\u0027m not making a case against creative by the way, I\u0027m pointing out that when you arbitrarily decide that parts of the game aren\u0027t for you and you skip them, whether literally or just mentally, it will shallow the experience. Period. In this case it isn\u0027t the game that has become uninteresting, it\u0027s you who have become uninvested. That\u0027s fine of course, just don\u0027t pretend like your apathy is the game\u0027s fault.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI lol\u0027ed at this. So your saying if a game isn\u0027t giving you any options or a reason to go or do something I.e. going to other planets.. then thats our fault? We should use our imaginations? Sorry, but if I want to use my imaginations, a rather go outside and imagine I\u0027m super man and run around like a 6 year old.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ELike the OP said, the Science points give you a reason to explore other planets, biomes. and whatnot. They should focus on that aspect of the game, they should make exploration more meaningful, improve it. They should make it a \u0022Holy crap, look what I\u0027ve found!!\u0022 kind of thing. Because in the end thats what Space and the game is about, \u0022Exploration\u0022 And how can you do that if the game isn\u0027t giving you anything to explore? They should focus on the core game rather than Career mode.. A game should never leave something up for your imagination to make it \u0022Fun\u0022. If you want to use your imagination then go play Toilet simulator: \u003C/span\u003E\u003Ca href=\u0022/submissions/109-totally-accurate-toilet-simulator\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bmo.....thisjam.com/submissions/109-totally-accurate-toilet-simulator\u003C/a\u003E I\u0027m sure you\u0027ll have a lot of fun with it and your \u0022Imagination\u0022.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T08:57:14Z\u0022 title=\u002210/10/2014 08:57  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by Tail_TL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cheeseit","CreatedById":71142,"CreatedDateTime":"2014-10-10T08:53:54Z","Content":"\n\u003Cp\u003EI think career mode just needs some tweaking on the income/science fronts. I\u0027m sure squad will keep adding features as time goes on as well. The last 2 updates have added a massive amount of stuff and multiple quality of life fixes.\u003C/p\u003E\u003Cp\u003EAfter a while just making gigantic rockets with no budget/no direction gets pretty old. I enjoy getting a mission I\u0027m not sure I can do and then figuring out a way to do it with the resources I have.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T08:57:22Z\u0022 title=\u002210/10/2014 08:57  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by cheeseit\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cheeseit","CreatedById":71142,"CreatedDateTime":"2014-10-10T09:01:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tail_TL\u0022 data-cite=\u0022Tail_TL\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EYes And Yes and Yes. Its just sad on how much time they have put in Career mode and it could of been a lot better and more fun, the direction they are going is completely \u0022Bleh\u0022. They started out good with Career and the \u0022Science\u0022 while it was the only thing in career, but after that it could\u0027ve been better. Would be great if they would scrap the career mode and Re-think it all from ground up, because I don\u0027t see how they could improve it with what they got.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI lol\u0027ed at this. So your saying if a game isn\u0027t giving you any options or a reason to go or do something I.e. going to other planets.. then thats our fault? We should use our imaginations? Sorry, but if I want to use my imaginations, a rather go outside and imagine I\u0027m super man and run around like a 6 year old.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ELike the OP said, the Science points give you a reason to explore other planets, biomes. and whatnot. They should focus on that aspect of the game, they should make exploration more meaningful, improve it. They should make it a \u0022Holy crap, look what I\u0027ve found!!\u0022 kind of thing. Because in the end thats what Space and the game is about, \u0022Exploration\u0022 And how can you do that if the game isn\u0027t giving you anything to explore? They should focus on the core game rather than Career mode.. A game should never leave something up for your imagination to make it \u0022Fun\u0022. If you want to use your imagination then go play Toilet simulator: \u003C/span\u003E\u003Ca href=\u0022/submissions/109-totally-accurate-toilet-simulator\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bmo.....thisjam.com/submissions/109-totally-accurate-toilet-simulator\u003C/a\u003E I\u0027m sure you\u0027ll have a lot of fun with it and your \u0022Imagination\u0022.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you want them to do? \u003C/p\u003E\u003Cp\u003ESquad doesn\u0027t want to add procedural planets for a few good reasons imo. If you want more stuff to explore go download mods.\u003C/p\u003E\n"},{"CreatedByName":"Tail_TL","CreatedById":121487,"CreatedDateTime":"2014-10-10T09:25:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cheeseit\u0022 data-cite=\u0022cheeseit\u0022\u003E\u003Cdiv\u003EWhat do you want them to do? \u003Cp\u003ESquad doesn\u0027t want to add procedural planets for a few good reasons imo. If you want more stuff to explore go download mods.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo I\u0027m not asking procedural planets. I\u0027m just asking for them to make them a bit more complex I.e More Biomes like they are already planning, add more interesting terrain like the \u0022Mun Arch\u0022 scattered around planets. just add more detail to terrain and whatnot, and also improve the Science mechanics so it wouldn\u0027t be just a \u00222 clicks and its done\u0022 kind of thing. Just more depth in to the Science gaining part so it would be fun to hang around in one spot and do science.\u003C/p\u003E\n"},{"CreatedByName":"NWDogg","CreatedById":118058,"CreatedDateTime":"2014-10-10T09:38:02Z","Content":"\n\u003Cp\u003EI\u0027ve tried to play career mode, every single update I try. I tried science mode in .23, but I quit after 20 minutes. In .24 I tried the new contracts, got bored 30 minutes later. Last night I played career again, set difficulty options to how I would want them, and I got bored less than 30 minutes later. \u003C/p\u003E\u003Cp\u003EI play sandbox mode almost every single day, and I have been since before version .20, for hours on end. I never get bored, I never run out of things to do or things to see, I always have new and interesting design challenges for myself, and I usually end up finding something new I\u0027ve never seen before. Wanna know the funniest part? I\u0027ve never been past Minmus. In sandbox mode I have so much to do that career mode just kills any enthusiasm I have for the game.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022haltux\u0022 data-cite=\u0022haltux\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWe should get entirely scripted mission, that would be similar to forum challenges, but integrated in a consistant scenario, written by an actual, human, scenario writter. Considering how much time it take to do a complex mission in KSP, a \u0022campaign\u0022 could integrate 10 to 20 mission, and new campaigns could be provided as DLC (free or not, that\u0027s not the point of the discussion).\u003C/p\u003E\u003Cp\u003EI think the mission engine is already there, what should be added are unique elements specific to missions (existing spaceships, artifacts are natural elements to investigate, specific parts to deliver somewhere...).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow this, this I agree with. I suggested this a few days ago, and I\u0027ve actually been considering working on an addon to add story missions (though it might be out of my technical ability). There\u0027s a huge Kerbal solar system out there, and we don\u0027t know a thing about it except that Kerbals are a space-fairing species. Contracts don\u0027t add anything to the lore, and science is usually just \u0027You took a surface sample. Yay.\u0027 I think the contracts would be far, far more interesting if there were scripted story missions to play through instead of random, haphazard tests that make no sense- or keep the random contracts, and have scripted missions in between. This would give career mode an actual purpose, and in my opinion at least, would make it actually worth playing. Barring scripted missions, even just an enhancement to the info that science gives us would make a difference.\u003C/p\u003E\n"},{"CreatedByName":"Galactic Nexus","CreatedById":986,"CreatedDateTime":"2014-10-10T10:10:11Z","Content":"\n\u003Cp\u003EAfter playing the game for over 3 years now, career is a nice change of pace. I know how to build vast rockets to get to the edge of the solar system and back and to be honest it\u0027s gotten kinda boring just doing it for the sake of it.\u003C/p\u003E\u003Cp\u003ECareer gives me restrictions and I like that. I use 1.25m parts like back in the old days before they were just eclipsed by 2.5/3.75m parts. I can\u0027t build stupidly overengineered monstrosities because I need to worry about how I\u0027m going to afford it.\u003C/p\u003E\u003Cp\u003EIt\u0027s not as polished as I\u0027d like it to be yet, but I still enjoy it.\u003C/p\u003E\u003Cp\u003ESandbox is still where I build my replicas and silly experiments though and it\u0027s where I play a fair percentage of my time. I just don\u0027t go very far outside of Kerbin anymore.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-10T10:22:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EYou don\u0027t need solar panels on a Mun landers either.\u003Cp\u003EJust a set of batteries. With LV909 on your rocket upper stage it\u0027s what.... 10 small cheap batteries? Or something around that to safely reach Mun with a probe and transfer science back.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s exactly the kind of kludgy stop-gap approach that I loved to hate with the old science/career mode.\u003C/p\u003E\u003Cp\u003EHowever, that strategies thing has fixed this nicely for me: I can reroute cash and reputation towards science to quickly uncover the tech tree. It will take me a while to actually unlock (=pay for) all parts, but I can have the ones I really care about pretty early. My first Munar Lander isn\u0027t exactly high-tech, but it does have proper landing legs, solar panels and a few other niceties that I consider essential.\u003C/p\u003E\u003Cp\u003EIt works for me, therefore I like it.\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2014-10-10T10:49:54Z","Content":"\n\u003Cp\u003EIt seems that a lot of people have gone through a similar progression to me. When you start with ksp, it\u0027s all about the challenge of whether you can. However once you know you can, you want new challenges and restrictions which career mode provides. It\u0027s like the original Europa plan, they wanted a direct orbiter but budget demanded a cheaper Jupiter orbiter with multiple Europa intercepts. NASA most likely could put a probe under the ice sheet of Europa if budget were no option, but that restriction provides limitations that require creative thinking to get the best value out of every allowed dollar.\u003C/p\u003E\n"},{"CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2014-10-10T11:22:14Z","Content":"\n\u003Cp\u003EI love career mode!\u003C/p\u003E\u003Cp\u003EAnyone can cheat, well, I guess... since this is a solo game, a sandbox, so the word \u0022cheating\u0022 might not be exactly true. Anyone can play the game as he/she thinks it is the most rewarding way of playing.\u003C/p\u003E\u003Cp\u003EI do not condemn anyone for hacking the gravity on Kerbin, or whatever. Everyone can do whatever he wants.\u003C/p\u003E\u003Cp\u003EI can see why career mode can turn off some people, starting a new career mode is hard work, do, all the science and keep up with the spending. I always play career and use mods also, one of them is the stage recover, because it makes sense to try to recover most of the parts in my stage. \u003C/p\u003E\u003Cp\u003EFor example my lunar module, for landing on the mun or whatever, always return intact to Kerbin. The planning, the missions (i use a mod that add more missions also) is all part of the game, the science can be hard if you want to unlock a certain part. I admit, I cheat a bit, but in terms of mechjeb, no, not by using it, because I know most people think mechjeb is for noobs, I disagree, since every thing that fly needs a very special computer programs and instruments to fly. Even old planes had them, and rockets that go to other planets don\u0027t? No, my cheating is not using mechjeb, but hack mechjeb to unlock all it\u0027s functions on the start. When you play for so long, it gets a bit boring to fly, increase AP or PE, an so on, also, i like the extra info it gives. There are thing i still like to do manually like docking, for incredible that might sounds since it seams that docking is what most people have difficulties, i love it.\u003C/p\u003E\u003Cp\u003EI tried playing sandbox with everything open, I quickly realize that i hate it, because there are no challenges, sure you can create your owns, but i do like the game progression in career mode.\u003C/p\u003E\u003Cp\u003EAlso, about contracts, for example, I play with KOS, kethane, and Fineprint (that adds more contracts depending the mods you have) among other mods, one of the contracts is to put a satellite in a certain orbit around Kerbin or the mun, i do that and then use the same satellite to scan for kethane, or kerbonite or whatever i need. So it serves for 2 purposes.\u003C/p\u003E\u003Cp\u003EAnyway, this is getting to long now, this is a forum not a book writing lol.\u003C/p\u003E\u003Cp\u003ETastes are not to be discussed, someone like sandbox and blow up stuff and do their thing, others go just for the science, i personally, what all the stuff, in fact, the more stuff Squad adds to the career mode, the more happy they make me!!\u003C/p\u003E\u003Cp\u003EFly safe.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-10-10T11:30:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kar\u0022 data-cite=\u0022Kar\u0022\u003E\u003Cdiv\u003EI admit, I cheat a bit, but in terms of mechjeb, no, not by using it, because I know most people think mechjeb is for noobs, I disagree, since every thing that fly needs a very special computer programs and instruments to fly. Even old planes had them, and rockets that go to other planets don\u0027t?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUse kOS if you want to run on that excuse. Otherwise it doesn\u0027t work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E kOS is the mod that\u0027s closest to what real \u0022autopilot\u0022 in rockets looks like.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kar\u0022 data-cite=\u0022Kar\u0022\u003E\u003Cdiv\u003EAlso, about contracts, for example, I play with KOS\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood.... good. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EkOS definitely deserves more attention than it gets. Everyone only mumble about MechJeb over and over again as if it\u0027d be some magical solution to make KSP more realistic, or whatever excuse they feel like using for today.\u003C/p\u003E\u003Cp\u003EWhich, by the way, is funny in it\u0027s own way - that people feel like they need to apologise each time they run game with MechJeb.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T11:36:37Z\u0022 title=\u002210/10/2014 11:36  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by Sky_walker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-10T12:49:37Z","Content":"\n\u003Cp\u003EI play mostly sandbox, but I\u0027ve tried career with each of the last few versions. I really want to like career mode but it doesn\u0027t suit my playstyle just yet.\u003C/p\u003E\u003Cp\u003EWhy I stick to the sandbox:\u003C/p\u003E\u003Cp\u003E- I find science a tedious clickfest, though strategies can reduce this greatly.\u003C/p\u003E\u003Cp\u003E- It is very easy to make money for a somewhat skilled player, there is not much of a financial constraint.\u003C/p\u003E\u003Cp\u003E- I don\u0027t find the stock contracts all that interesting in and of themselves.\u003C/p\u003E\u003Cp\u003E- Science and contracts are things I do to unlock the parts and accumulate the funds to do the missions I really want to do.\u003C/p\u003E\u003Cp\u003E- Since that is so, why not just play sandbox where I don\u0027t need to do the missions I don\u0027t want just so I can do the missions I do want to do?\u003C/p\u003E\u003Cp\u003EI know mods can change some of these things to make them more entertaining. But for me, I\u0027d rather just do the missions I want and pretend I\u0027ve done the science and contracts to pay for them.\u003C/p\u003E\u003Cp\u003EThat said, I\u0027ll keep trying Career in each version, it gets more enjoyable each time.\u003C/p\u003E\n"},{"CreatedByName":"RW-1","CreatedById":107278,"CreatedDateTime":"2014-10-10T13:10:50Z","Content":"\n\u003Cp\u003EFor me, I think I avoid Sandbox because if I can create a mission to Jool for example, and get there, it appears I don\u0027t get anything back (playing stock).\u003C/p\u003E\u003Cp\u003EThe downside of career and especially now is that by the time I get to where I may have been pre-update, it\u0027s time for another \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut, I do think there is enough variation so that you can tailor it to your own playstyle etc.\u003C/p\u003E\u003Cp\u003ERight now I\u0027m playing stock, hard, and it\u0027s amazing how many times I want to revert, and can\u0027t hehehe.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-10-10T13:23:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RW-1\u0022 data-cite=\u0022RW-1\u0022\u003E\u003Cdiv\u003ERight now I\u0027m playing stock, hard, and it\u0027s amazing how many times I want to revert, and can\u0027t hehehe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup - to a small degree I regret not having disabled reverting (quicksave - never, not with the ever present possibility of bugs, power outages, UFO alarms etc. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E ) - noticing an error on the pad is no problem, just recover the vessel - but after launch it starts to feel like cheating to me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scrogdog","CreatedById":66879,"CreatedDateTime":"2014-10-10T13:35:44Z","Content":"\n\u003Cp\u003EI enjoy career. However, that\u0027s not to say that it does not need work because it certainly does.\u003C/p\u003E\u003Cp\u003EThe ridiculous mission objectives break immersion, in my case. Somehow, I don\u0027t plan to actually use an SRB in the water.\u003C/p\u003E\u003Cp\u003EAlso, there needs to be some sort of difference between a part that hasn\u0027t been tested in any capacity with one that has. Unfortunately, since there will be no failure mode for given parts in the game, I\u0027m at a loss to suggest what the difference might mean. Also, there is no consequence to failing a test. And really, no way to fail it unless you don\u0027t meet parameters. That seems odd to me.\u003C/p\u003E\u003Cp\u003EIn any case, as is almost always the case with new stuff for the game, I think they are moving in the right direction. Just not quite there yet.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T13:38:27Z\u0022 title=\u002210/10/2014 01:38  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by Scrogdog\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tail_TL","CreatedById":121487,"CreatedDateTime":"2014-10-10T13:44:56Z","Content":"\n\u003Cp\u003EWell.. Completely removing all the \u0022Test that and that part\u0022 Contracts would be a good start... I\u0027m a completionist and I can\u0027t stand that there are 70% of all the contracts are about testing ******* parts.. Who\u0027s idea was that to put that in?\u003C/p\u003E\n"},{"CreatedByName":"mrwinesauce","CreatedById":122672,"CreatedDateTime":"2014-10-10T13:53:42Z","Content":"\n\u003Cp\u003EI like designing planes and flying them around, and career/hard mode/ironman/no MJ is the antithesis of what I want for KSP.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EkOS definitely deserves more attention than it gets. Everyone only mumble about MechJeb over and over again as if it\u0027d be some magical solution to make KSP more realistic, or whatever excuse they feel like using for today.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow about \u0022I don\u0027t care about any of those geometry things and just want to fly my planes.\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T13:57:21Z\u0022 title=\u002210/10/2014 01:57  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by mrwinesauce\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-10T14:50:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EkOS definitely deserves more attention than it gets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf there was nothing but kOS, people would be sharing code. A lot. Not everyone can put \u0022Circularize at apoapsis\u0022 into code, after all; and quite a few could but wouldn\u0027t, seeing as there\u0027s an excellent version available for them to run. I think a large subset of mechjeb\u0027s functionality would be effectively be replicated -- up to and including someone wrinting a pointy-clicky interface to quickload\u0026amp;run the most common programs. Things would be pretty much the same, only with longer execution time and more glitches.\u003C/p\u003E\u003Cp\u003EAs it is, kOS is a toy for people who like to code, and/or who have an itch that mechjeb can\u0027t scratch.\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-10-10T15:26:50Z","Content":"\n\u003Cp\u003EI started a new career save recently, for the first time in ages. It was fun at first, to try to make do with so few parts, and to simultaneously try to maximise science, cash and rep. \u003C/p\u003E\u003Cp\u003EBut a few hours in, while undocking from the Minmus mothership for the 4th or 5th time, in search of the remaining Minmus biomes, I realised I was bored.\u003C/p\u003E\u003Cp\u003ESo I went back to building cool and silly things in Sandbox, and I\u0027ve been happily doing that ever since. \u003C/p\u003E\u003Cp\u003EI think career was fun when I first started. It was exciting to go to Minmus, and try to cover as many biomes as possible. But back then, it was exciting just to get a suborbital flight. Once you\u0027ve sent huge craft to explore the Jool system, and captured asteroids into LKO, and been on grand tours, I think there\u0027s limited fun in the early career grind. But it\u0027s good when you\u0027re starting out.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-10-10T15:38:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESince that is so, why not just play sandbox where I don\u0027t need to do the missions I don\u0027t want just so I can do the missions I do want to do? -snip-\u003C/p\u003E\u003Cp\u003EBut for me, I\u0027d rather just do the missions I want and pretend I\u0027ve done the science and contracts to pay for them.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is exactly what I do. A little cheating, and I have all the funds and science I need, but I still use a career save for the occasional interesting contracts, and science record keeping.\u003C/p\u003E\u003Cp\u003EI too found career something that was interesting for a while, but then got boring compared to mucking about in space. I am hoping this is a reflection on the limited completion of the game, and not poor design. This game has potential to be great if the devs aim high. Fingers crossed that we get more features that make it feel like managing a space program, not just ticking off things for points. This game could be a complex and nuanced. Simcity, not farmville.\u003C/p\u003E\n"},{"CreatedByName":"Dreamixpl","CreatedById":32905,"CreatedDateTime":"2014-10-10T15:46:05Z","Content":"\n\u003Cp\u003E[i just want to say, english is not my primary language, it\u0027s not even my seconary language] \u003C/p\u003E\u003Cp\u003EI personally thing, KSP isn\u0027t going in the right direction, I was launching kerbals since the very first versions, I played it like carrer mode (possibly) before it was even planned. What is the point of playing carrer/science mode, when you mastered launching small/cheap crafts to every celestial body in KSP. Currently im playing KSP in hardcore, roleplaying way, to launch very small probe to gas giant (farther than Jool, I have mods), I need radio connection, and lots of solar panels, and when Im there, I need to take surface sample, thermometric values, and take them back (using docking, etc.). I don\u0027t like the direction, which KSP developers are going, they don\u0027t make new end game goals, but still enchance early game...\u003C/p\u003E\n"},{"CreatedByName":"Tail_TL","CreatedById":121487,"CreatedDateTime":"2014-10-10T15:52:36Z","Content":"\n\u003Cp\u003EIt seems a lot of people agree that Career mode isn\u0027t so much fun (Atleast in the long term) I wonder if they will consider re-thinking on how they want to implement \u0022Career\u0022 mode. Make it fun for all of us. I wish I could like career mode... I even forced my self a couple of times to play it but always turned it down after 10-30 minutes. I know this game isn\u0027t anywhere near \u0022Finished\u0022 but career mode is already going a bad direction, unless they completely revamp the Mission system/\u0022Contracts\u0022.. Atleast. I would suggest them to focus on the core gameplay mechanics and features.\u003C/p\u003E\n"},{"CreatedByName":"hansen","CreatedById":125016,"CreatedDateTime":"2014-10-10T16:54:56Z","Content":"\n\u003Cp\u003EI also think it would be better to concentrate on what made ksp so popular: the core gameplay which is building flying, driving and rotating stuff in all forms and sizes; and also the aspect of teaching orbital physics in a very entertaining way. the career mode works against both these attractive elements in my opinion by restricting building choices and discouraging from an experimental approach to craft design and actual maneuvering: if failure has bad consequences you actually keep people from exploring new approaches.\u003C/p\u003E\u003Cp\u003Ebut it is mirroring the most popular game mechanics: many games today have to be about artificial restriction of game mechanics to motivate players to keep on playing and unlock new stuff. i don\u0027t like that which is why i am happy about the sandbox mode of ksp. my impression is that squad should leave this capitalistic career mode behind or at least redesign it fundamentally so that gathering science at least has a pedagogic element. or if you want it to be realistic at least put some real historical background into it. this could be used for a critical evaluation of the connection of space programs, military research and the cold war.\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2014-10-10T17:08:34Z","Content":"\n\u003Cp\u003EI play career exclusively to have some sense of structure and tangible, game-reinforced goals. In general, I find I get bored just playing in sandboxes with no goals other than \u0022build stuff!\u0022 I desperately want KSP\u0027s career mode to be better about giving me those goals, because several hundred hours in, just climbing the science tree doesn\u0027t do it for me anymore. What I enjoy was planning missions with the technology I had available, looking forward to the next tier of tech, and maximizing my launch windows to get science. That gave me solid objectives and real rewards for my missions, instead of doing things just to do them. Once I have the tree maxed out, I\u0027m basically playing sandbox, and I quickly lose interest and look for more mods to change the flow of my experience in the game.\u003C/p\u003E\u003Cp\u003EI want to see tangible rewards for executing missions; I lost interest in my .25 career after two part-test contracts netted me 6000 science with the funds-to-science strategy. There\u0027s still some joy to be had in unlocking the parts with funds, but what I really want is to get unlockable upgrades (better fuels? more efficient engines? lower dry masses?) or base building that can only be done with rare minerals or something from other planets and moons. Totally unrealistic, I know, since there\u0027s nothing out there that we can\u0027t get more of easier here on Earth, but my playstyle makes me crave a purpose for my missions other than sightseeing.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-10-10T17:33:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EkOS definitely deserves more attention than it gets. Everyone only mumble about MechJeb over and over again as if it\u0027d be some magical solution to make KSP more realistic, or whatever excuse they feel like using for today.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELike mrwinesauce said: What if I don\u0027t want to do all the math and calculus that some people do? What if I just want to play the game? And, honestly, you\u0027re being a little elitist, don\u0027t you think?\u003C/p\u003E\n"}]}