{"TopicId":8676,"ForumId":32,"TopicTitle":"Aurora 4x, possible inspiration for late-game campaign mode?","CreatedByName":"Millitron","CreatedById":2495,"CreatedDateTime":"2012-03-26T00:40:56Z","PageNum":1,"Articles":[{"CreatedByName":"Millitron","CreatedById":2495,"CreatedDateTime":"2012-03-26T00:40:56Z","Content":"\n\u003Cp\u003EIn case you haven\\\u0027t heard of it, Aurora 4x is an indie game which is basically Europa Universalis meets Master of Orion, or what Spore\\\u0027s space stage should\\\u0027ve been. You start with a single planet and work your way up to having a galactic empire (or until hostile aliens blow you up). It has amazingly in-depth ship construction, with the player manually specifying designs for the different classes of ships, with incredibly flexible and complex possibilities. You build your space fleets, and work on interstellar colonization, managing everything from galactic politics to terra-forming. I\\\u0027m no good at the game, as it\\\u0027s wicked hard, but I definitely see good things in its future.\u003C/p\u003E\u003Cp\u003EHere\\\u0027s the wiki if you want to read more about it: \u003Ca href=\u0022http://aurorawiki.pentarch.org/index.php?title=Main_Page\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://aurorawiki.pentarch.org/index.php?title=Main_Page\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhat do you guys think? Would this be a good way to go? Maybe we could even get a converter like for going between Europa Universalis saves to Victoria scenarios, so your final save in KSP could be your starting point in Aurora?\u003C/p\u003E\u003Cp\u003EEven if it wouldn\\\u0027t be good for KSP, what do you guys think of the game?\u003C/p\u003E\n"},{"CreatedByName":"Dynamo","CreatedById":16626,"CreatedDateTime":"2012-03-26T04:56:12Z","Content":"\n\u003Cp\u003ETell this to the RP community. As an ambassador, Ascensiam and the other RP\\\u0027ers are having a HUGE problem getting a proper politics/economical system formally set up that works for everyone. If we could get a \u0027simulator\u0027 to deal with, say wars in game, that\\\u0027d be fantastic. \u003C/p\u003E\u003Cp\u003EMy fighters would have targets 8)\u003C/p\u003E\u003Cp\u003EEDIT: Just looked at the page. Holy boosters, that is almost (i think) EXACTLY what we need, except modded to a planetary rather than intergalactic scale. \u003C/p\u003E\n"}]}