{"TopicId":87162,"ForumId":20,"TopicTitle":"Checking if this is possible (modify existing parts, event triggered science, ...)","CreatedByName":"RyuKajiy","CreatedById":125735,"CreatedDateTime":"2014-10-13T10:06:36Z","PageNum":1,"Articles":[{"CreatedByName":"RyuKajiy","CreatedById":125735,"CreatedDateTime":"2014-10-13T10:06:36Z","Content":"\n\u003Cp\u003EI would like to know (before i try to do it and crash into a wall) if some things are possible with mods.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIs it possible to dynamicaly change values of parts ?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EMeaning that i think that later researches should have an influence on the earlier tech tree parts. So i would like to modify the existing parts when certain researches are bought.\u003C/p\u003E\u003Cp\u003EAs an example: when unlocking Advanced Electrics increase the capacioty of all batteries by 5%.\u003C/p\u003E\u003Cp\u003ESo a mod would have to check when this topic is bought and go through all parts tagged \u0022battery\u0022 and increas their capacity. Then it would probably need to catch some load event, because the values in config files are not changes. So on a load event it would need to check if certain research topics are allready bought and modify the loaded values of the parts.\u003C/p\u003E\u003Cp\u003EI wonder if this would also influence ships in flight, are their values stored in the save data, or are their parts loaded later when you switch to controlling those ?\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIs it possible to hide research topics until a certain condition is met ?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI would like to change the research tree a bit, so that you need to do certain actions to be able to research certain topics.\u003C/p\u003E\u003Cp\u003EFor example you need to have successfully launched a ship in orbit before you can research some advanced rocketry topics. Or you have to do a certain field test in orbit/on the mun to open up nuclear propulsion.\u003C/p\u003E\u003Cp\u003ESo it should hide those topics in the tree, or grey them out with a hint what you need to do. Catch an event when these conditions are met and unlock the topics then. Also would need to store somethwere that the conditions were achieved, so that on loading i can make sure that the topics will have the right status.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWould it be possible to create a space elevator ?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWell this is rather a topic for later, cause this would need some serious modeling and coding, but i wonder if it is even possible at all.\u003C/p\u003E\u003Cp\u003EWhat it would need is to add another building to the space center, representing the surface hook of the elevator. Then it would need some counterweight model (maybe a cought asteroid) as the geostatic orbit kook. And a cable connecting the two. I am not sure if you can place a new building in the space center, and the cable would probably be outside of what is possible. Also it would need to add a new menu to the space center, where you can control the elevator, e.g. sending pre constructed ships into space and launch then from the counterweight instead of the launch platform.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EModify existing parts just with cfg file?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELast but not least i found some reference (but from earlier versions of KSP) that you can change existing parts just by copying and modifying the cfg files. Is it also possible to clone then, just paste a different skin on the model and change the values, just using the cfg file, or do you need to create a dll too for new parts now ?\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-10-13T17:47:11Z","Content":"\n\u003Cp\u003EBuildings are certainly possible.\u003C/p\u003E\n"},{"CreatedByName":"Putnam","CreatedById":125984,"CreatedDateTime":"2014-10-15T06:39:51Z","Content":"\n\u003Cp\u003EIf you\u0027re not doing anything unique, then you don\u0027t need a new DLL.\u003C/p\u003E\n"}]}