{"TopicId":87217,"ForumId":24,"TopicTitle":"New Member Hoping to Enjoy KSP to the Max","CreatedByName":"vaironl","CreatedById":125811,"CreatedDateTime":"2014-10-13T19:50:38Z","PageNum":1,"Articles":[{"CreatedByName":"vaironl","CreatedById":125811,"CreatedDateTime":"2014-10-13T19:50:38Z","Content":"\n\u003Cp\u003EHello All!\u003C/p\u003E\u003Cp\u003EI\u0027m new to the forums, but have owned KSP for about 3 months. However, I\u0027m a college student who also works and time is very limited on most weeks. I\u0027ve been able to do a couple of successful launches in about 20 total hours of gameplay. When I heard about the game I was initially thinking of waiting for a sale and couldn\u0027t resist so I bought it a full price. I still don\u0027t mind as I believe this game is worth every penny, however time and knowledge have limited my enjoyment on the game.\u003C/p\u003E\u003Cp\u003EBy time as I explained previously work and school keep me very busy. By knowledge I mean I\u0027m not good at building aircrafts, etc at all. I\u0027ve watched some videos and read certain parts of the wiki, but I guess I didn\u0027t learn all subjects needed to be successful in the game.\u003C/p\u003E\u003Cp\u003EIf you guys have a path you followed to learn how to properly play the game please link me to it! My goal is to eventually build my own model aircrafts/spacecrafts without the aid of someone\u0027s video. I also would love to apply what I\u0027m learning in my Calc class to the game.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-10-13T20:57:44Z","Content":"\n\u003Cp\u003ELearning KSP is the process of crashing closer and closer to your destination. There is no formal way to do it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Welcome to the forum. (I suck at planes, too.)\u003C/p\u003E\n"},{"CreatedByName":"Lhathron the Elf","CreatedById":118706,"CreatedDateTime":"2014-10-13T21:13:09Z","Content":"\n\u003Cp\u003EThe tutorials in-game as well as Scott Manley\u0027s youtube channel initially really helped me. My mindset at first when playing this game in the Demo version was basically this: \u0022I just gotta make the next stage bigger den da first and den I can get to space!\u0022 It turned out that this helped me figure out the mechanics quite well, because it often didn\u0027t work. But I\u0027ve recently been a lot more efficient in my designs. \u003C/p\u003E\u003Cp\u003EAnother thing that really helped me a lot more in my effort to build is this... Say you\u0027re going to build a small rocket that\u0027s going to go into orbit and then return to the surface. First you have to think, \u0022Okay, first I need a stage that\u0027s going to actually land on Kerbin.\u0022 Maybe that\u0027s a Mk1 command pod with a radially mounted parachute. Then you have to think, \u0022How am I going to get this to the surface from orbit?\u0022 Once you have that, you can figure out what you need to get all of that up into a circular orbit from ascent. Then you need a stage to get all of that off of the launch pad and up into the sky. It\u0027s the same basic idea if you\u0027re trying to land on Mun or even get a permanent base to Laythe.\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-10-13T22:11:25Z","Content":"\n\u003Cp\u003EWelcome to the forums vaironl.\u003C/p\u003E\u003Cp\u003EDont worry about the learning curve in KSP. It either comes naturally by crashing a lot or you take a look at some youtube channels as mentioned above. I can recommend kurtjmac and simgamerstv f.e..\u003C/p\u003E\u003Cp\u003ESome tips that helped me a lot... Start small, use a sandbox game beside your career game to test yor designs, keep your designs as simple as possible.\u003C/p\u003E\u003Cp\u003EEnjoy the stay and the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vaironl","CreatedById":125811,"CreatedDateTime":"2014-10-13T22:27:17Z","Content":"\n\u003Cp\u003EThank you all for the warm welcome and for the tips!\u003C/p\u003E\u003Cp\u003EI have at times watched Scott Manley\u0027s videos and applied some of his models, so I guess I simply need to keep taking in information and eventually I\u0027ll be able to design space ships knowing the possible outcome they might have (crashing, too slow, unstable, etc.).\u003C/p\u003E\n"}]}