{"TopicId":87239,"ForumId":21,"TopicTitle":"0.25 Spaceplane","CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2014-10-14T00:00:46Z","PageNum":1,"Articles":[{"CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2014-10-14T00:00:46Z","Content":"\n\u003Cp\u003EHello guys! 0.25 is out, and I kinda played around with the new spaceplane parts (technically not new), and they were awesome! So I decided to make a spaceplane to carry my Kerbals to my space station. I wanted to design one with lots of excess fuel for my sloppily-done rendezvous, and also not too large nor too expensive. I scrapped a few designs and finally came up with this.\u003C/p\u003E\u003Cp\u003EThis spaceplane can carry 5 Kerbals to a space station and has a generous amount of fuel for orbital maneuvering (around 500 to 900 m/s delta-v) cause I brought some LV-Ns on it. This thing can also get up to Keostationary transfer orbit, and with proper aerobraking, it has just the right amount of fuel to return home. It features 2 RAPIERs, 2 jettisonable turbojets, and of course, nukes. It is technically not a SSTO because of the staged turbojets.\u003C/p\u003E\u003Cp\u003EI also made one cargo variant which is a few posts downward, but the download link here will also show you that variant. That thing can bring 2t to Keostationary transfer orbit.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/96746-0-25-Spaceplane?p=1477043\u0026amp;viewfull=1#post1477043\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/96746-0-25-Spaceplane?p=1477043\u0026amp;viewfull=1#post1477043\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI tested this plane many times and I finally worked out a plan which could maximize delta-v on this particular plane.\u003C/p\u003E\u003Cp\u003E(Reaching orbit with FAR installed not guaranteed. Only tested in stock aerodynamics. Please tell me if this could get into orbit in FAR.)\u003C/p\u003E\u003Cp\u003EHow to fly this plane:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EAction groups:\u003C/p\u003E\u003Cp\u003E1. Toggle RAPIERs\u003C/p\u003E\u003Cp\u003E2. Toggle RAPIER mode\u003C/p\u003E\u003Cp\u003E3. Toggle LV-Ns\u003C/p\u003E\u003Cp\u003E4. Toggle intakes\u003C/p\u003E\u003Cp\u003E1. Activate RAPIERs and turbojets through staging. Take off as usual, climb at 45 degrees.\u003C/p\u003E\u003Cp\u003E2. At or above 17000m, pitch down to 20-30 degrees. Doing this too early will make it hard to pitch up later.\u003C/p\u003E\u003Cp\u003E3. Once the RAPIERs switch to rocket mode, activate staging immediately to jettison dedicated turbojets and activate LV-Ns. Don\u0027t try to wait until the jets go flameout. This should happen at 20000m.\u003C/p\u003E\u003Cp\u003E4. Close intakes with action group 4. Pitch up to 45-50 degrees. The engines have low TWR and sacrifice that for delta-v so it is important to pitch up.\u003C/p\u003E\u003Cp\u003E5. Once the apoapsis reaches your target orbital altitude (e.g. 75000m) minus 10000m (e.g. 65000m), switch off the RAPIERs with action group 1 and pitch down to 30 degrees. Continue to fire LV-Ns. Saves fuel here.\u003C/p\u003E\u003Cp\u003E6. Cut throttle, set up a maneuver node for orbital insertion (do it quickly!), then immediately throttle up and burn at the node with LV-Ns. Don\u0027t wait and coast to 30s before apoapsis! (The node should be a bit more than 1 minute away right after setting up node).\u003C/p\u003E\u003Cp\u003E7. When the node reaches T-15, fire up those RAPIERs again with action group 1. Switch them off again after around 20 seconds or when the remaining burn is 100 m/s delta-v.\u003C/p\u003E\u003Cp\u003E8. This ascent profile is meant to maximize delta-v for this particular spaceplane. You should have around 500-900 m/s remaining for an orbital rendezvous. If you only have 100 oxidizer, you will have less than 500 m/s. If you have 300 oxidizer, that translates to 900m/s.Only use LV-Ns for orbital maneuvers.\u003C/p\u003E\u003Cp\u003E10. Deorbit the spaceplane. Turn off the LV-Ns with action group 3, switch on RAPIERs and change their mode with action group 1 and 2. Open the intakes with action group 4 as well.\u003C/p\u003E\u003Cp\u003E12. Do this step right after you finish the last step. Finish this step before you fire up your RAPIERs in atmosphere mode. If insufficient liquid fuel for landing remain in the FL-T800s...\u003C/p\u003E\u003Cp\u003EOption 1:\u003C/p\u003E\u003Cp\u003EThe traditional (lazy) way.\u003C/p\u003E\u003Cp\u003ETransfer fuel from the middle bicoupler to the 2 FL-T800s or the RAPIERs won\u0027t function. Try to distribute the fuel evenly between the two tanks as much as possible. You only have to do it for liquid fuel, not the oxidizer.\u003C/p\u003E\u003Cp\u003EOption 2:\u003C/p\u003E\u003Cp\u003EFor people who are OCD about even fuel distribution.\u003C/p\u003E\u003Cp\u003ETransfer all the fuel into the middle bicoupler. Disable all of the fuel tanks on the side of the spaceplane, including liquid fuel-only fuselages (but not the bicoupler in the middle), by accessing the option through right clicking the fuel tank. You only have to do it for liquid fuel, not the oxidizer. Then the RAPIERs will feed from the middle tank.(Well, this is how the game\u0027s code works). No more worrying about unbalanced fuel distribution\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FqyoAFX.jpg\u0022 alt=\u0022FqyoAFX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDownload link (Dropbox):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/sh/3dseqqh1dru22en/AAA1r_z9pU_ncMCaOFzPNISwa?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/sh/3dseqqh1dru22en/AAA1r_z9pU_ncMCaOFzPNISwa?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(Links to the Dropbox folder which contains the .craft file, flying instructions, and a picture of the spaceplane. You can choose which to download.)\u003C/p\u003E\u003Cp\u003EThanks everyone.\u003C/p\u003E\u003Cp\u003EI would like to quote Scott Manley\u0027s catchphrase:\u003C/p\u003E\u003Cp\u003EFly Safe.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-04T18:45:16Z\u0022 title=\u002211/04/2014 06:45  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 4, 2014\u003C/time\u003E by deepspacecreeper\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-10-14T00:10:47Z","Content":"\n\u003Cp\u003EThe pic isn\u0027t showing, although here\u0027s the direct link: \u003Ca href=\u0022https://www.dropbox.com/s/per4qepiuqedo2i/front_Spaceplane_1.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/per4qepiuqedo2i/front_Spaceplane_1.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou should use imgur instead, it\u0027s free and very simple. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2014-10-14T00:39:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astropapi1\u0022 data-cite=\u0022astropapi1\u0022\u003E\u003Cdiv\u003EThe pic isn\u0027t showing, although here\u0027s the direct link: \u003Ca href=\u0022https://www.dropbox.com/s/per4qepiuqedo2i/front_Spaceplane_1.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/per4qepiuqedo2i/front_Spaceplane_1.png?dl=0\u003C/a\u003E\u003Cp\u003EYou should use imgur instead, it\u0027s free and very simple. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPicture uploaded! Thanks.\u003C/p\u003E\u003Cp\u003EThe link to the picture in dropbox has been deleted.\u003C/p\u003E\u003Cp\u003E(NOT the download link)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-14T14:38:00Z\u0022 title=\u002210/14/2014 02:38  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 14, 2014\u003C/time\u003E by deepspacecreeper\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2014-10-14T03:28:52Z","Content":"\n\u003Cp\u003ECargo version coming soon...\u003C/p\u003E\u003Cp\u003EI am currently modifying the craft to allow 2t payloads delivered to Kerbin orbit.\u003C/p\u003E\n"},{"CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2014-10-14T14:32:50Z","Content":"\n\u003Cp\u003EHello again! This time I made the cargo variant of the spaceplane.\u003C/p\u003E\u003Cp\u003EThis thing can bring a 2t space probe into Keostationary transfer orbit and has just enough fuel to return. with proper aerobraking of course.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/juJdJ9E.jpg\u0022 alt=\u0022juJdJ9E.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGo to the Dropbox link for downloads.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/sh/3dseqqh1d...OFzPNISwa?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/sh/3dseqqh1d...OFzPNISwa?dl=0\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"akron","CreatedById":116554,"CreatedDateTime":"2014-10-14T21:13:20Z","Content":"\n\u003Cp\u003ELooks awesome, although it is technically not a SSTO Spaceplane because you do jettison a stage.\u003C/p\u003E\n"},{"CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2014-10-15T00:52:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022akron\u0022 data-cite=\u0022akron\u0022\u003E\u003Cdiv\u003ELooks awesome, although it is technically not a SSTO Spaceplane because you do jettison a stage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah it is *virtually* SSTO but not technically.\u003C/p\u003E\u003Cp\u003EThe idea of dropping the twin turbojets came from the new stock craft \u0022Stearwing D45\u0022.\u003C/p\u003E\n"}]}