{"TopicId":87389,"ForumId":16,"TopicTitle":"Help me turn my plane","CreatedByName":"code99","CreatedById":113538,"CreatedDateTime":"2014-10-15T12:58:38Z","PageNum":1,"Articles":[{"CreatedByName":"code99","CreatedById":113538,"CreatedDateTime":"2014-10-15T12:58:38Z","Content":"\n\u003Cp\u003EHello, I\u0027ve been having a problem with my planes (plane actually, only got one.).So, after a lot of attempts of making a plane i finally ended up with a fast and surprisingly stable aircraft. I can take off no problem, i can reach speeds over 1000 m/s, the plane doesn\u0027t spin out of control and flies straight. And there is the problem, it just flies straight. It takes me forever to turn this thing. It either turns very slowly or starts to turn fast but then returns back straight even tho im still pressing S ...Altho recently, with my latest attempt at it, the plane steers very slowly. What\u0027s going on? Im on 24.2, i dont have FAR or NEAR and i am typing from my phone so i can\u0027t post pics about my plane.Currently my center of lift is slightly behind the center of mass.Ideas?\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-10-15T13:02:23Z","Content":"\n\u003Cp\u003ESteering issues with spaceplanes (well, planes in general) are usually due to a lack of a sufficient number of control surfaces. What kind of control surfaces are you employing (what parts and for which purposes)? You should also consider adding a few reaction wheels.\u003C/p\u003E\u003Cp\u003ECan\u0027t posts pics - that\u0027s fine. Can you give us a general description of your plane? How about its mass at take-off?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-15T13:05:24Z\u0022 title=\u002210/15/2014 01:05  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 15, 2014\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-10-15T13:33:42Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPitch \u003C/strong\u003Econtrol surfaces should be as far from the center of mass as possible in front (canards) or behind (elevator). \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERoll \u003C/strong\u003Esurfaces can be in line with the center of mass (ailerons), or the elevator can be dual purposed and do both roll and pitch (elevon). \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYaw \u003C/strong\u003Esurfaces are on the vertical stabilizer (rudder), rudders are not required for flight but a fixed vertical stabilizer is.\u003C/p\u003E\u003Cp\u003EHowever, regardless of design, pitch surfaces are always as far from the center of mass, they act as a force on the plane where the center of mass is the fulcrum and the plane is a lever.\u003C/p\u003E\u003Cp\u003EHere are examples, these planes are in the link in my signature, but they are balanced for the ferram mods, which makes them behave as they should.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v445/Alshain/KSP/elevator.png\u0022 alt=\u0022elevator.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v445/Alshain/KSP/elevons.png\u0022 alt=\u0022elevons.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-15T13:50:37Z\u0022 title=\u002210/15/2014 01:50  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 15, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-10-15T13:53:59Z","Content":"\n\u003Cp\u003EOne other note on turning. Some beginners mistakenly believe yaw is for turning. That is not correct. To turn, bank the craft by rolling (Q and E on the keyboard) and pitch up (S). Use the yaw control if you decide to implement it to keep your nose on the horizon as you turn (A and D), however as mentioned before yaw is not required.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-10-15T14:03:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022code99\u0022 data-cite=\u0022code99\u0022\u003E\u003Cdiv\u003E... or starts to turn fast but then returns back straight even tho im still pressing S ...Altho recently, with my latest attempt at it, the plane steers very slowly. ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPost snipped for brevity. This is indicative of a misunderstanding. You are pressing \u0027S\u0027 which is a pitch control, not a yaw control (This goes with the common newbie mistake of trying to use yaw to turn) What this tells me is that you either:\u003C/p\u003E\u003Cp\u003EA. Don\u0027t have enough control authority (in the form of control surfaces or reaction wheels) \u003C/p\u003E\u003Cp\u003EOr\u003C/p\u003E\u003Cp\u003EB. Trying to turn at all but instead trying to adjust your pitch which is a very different scenario, in which case your thrust might be misaligned.\u003C/p\u003E\u003Cp\u003EIn either case a pic of your craft would really help, preferably with the CoM, CoL, and CoT icons activated.\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-10-15T14:17:23Z","Content":"\n\u003Cp\u003EAs has been said, plenty of well-positioned control surfaces will fix your issue. \u003C/p\u003E\u003Cp\u003EMake sure you right click on them (in the SPH or on the runway, but SPH is easier as it duplicates for symmetry) and select which things you want each one to control. So, a vertical control surface attached to a tailfin (a rudder) should only control yaw, not pitch or roll. While elevons on the back of your wings should be set to control pitch and roll, but not yaw. Setting this up correctly makes such a big difference to how your plane handles.\u003C/p\u003E\u003Cp\u003EAnd yeah, roll then pull up to turn, don\u0027t try to turn far by yawing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-15T14:33:15Z\u0022 title=\u002210/15/2014 02:33  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 15, 2014\u003C/time\u003E by Oafman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-10-15T14:32:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003Ea fixed vertical stabilizer is. [required for flight]\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeechcraft disagrees with you. See their V-series. Ruddervators also work in KSP.\u003C/p\u003E\n"},{"CreatedByName":"code99","CreatedById":113538,"CreatedDateTime":"2014-10-15T14:35:03Z","Content":"\n\u003Cp\u003EThe way i turn is i first roll then pitch up (Q then S). \u003C/p\u003E\u003Cp\u003EAnyway, after some more fiddling around ive substituted my normal turbojet engines with 2 F119 Turbofan Engines from B9 (F22 Raptor style engines) which have venturing thrust and took my plane for a spin. \u003C/p\u003E\u003Cp\u003EIt improved the turning ability a bit but it still feels slow ...\u003C/p\u003E\u003Cp\u003EI then moved back my wings so the control surfaces for pitch are all the way back near the engines and it seemed to have improved the turning capability (altho now its easier to flip the aircraft). \u003C/p\u003E\u003Cp\u003ENow tho at altitudes over 8000 m the plane just gets almost impossible to control, ii even flown backwards ...\u003C/p\u003E\u003Cp\u003EMy plane is 12.4 tons heavy at launch. \u003C/p\u003E\u003Cp\u003EPitch control surfaces are at the back (at the back of the wings, near the engines), yaw controls are non existent and roll surfaces are at the front on the cockpit sides accomplished by 2 delta deluxe winglets.\u003C/p\u003E\u003Cp\u003EI also have 2 vertical stabilizers without rudder at the back that look just pretty.\u003C/p\u003E\u003Cp\u003EAll my control surfaces are dedicated, meaning pitch control surfaces only pitch and nothing else.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-15T14:48:30Z\u0022 title=\u002210/15/2014 02:48  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 15, 2014\u003C/time\u003E by code99\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-10-15T14:39:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EdFred\u0022 data-cite=\u0022EdFred\u0022\u003E\u003Cdiv\u003EBeechcraft disagrees with you. See their V-series. Ruddervators also work in KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, but that\u0027s still technically a pair of vertical stabilizers. Vertical stabilizers do not have to be 100% vertical, another example of this is the \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/0/08/MQ-1_Predator_unmanned_aircraft.jpg\u0022 rel=\u0022external nofollow\u0022\u003EPredator\u003C/a\u003E and \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/b/b0/MQ-9_Reaper_in_flight_%282007%29.jpg\u0022 rel=\u0022external nofollow\u0022\u003EReaper\u003C/a\u003E UAVs. This just illustrates the open ended design possibilities with KSP. \u0022Fixed\u0022 was a wrong term, I apologize for that, I was just trying to differentiate between a vertical stabilizer and a vertical stabilizer with a rudder. The first image I posted has an active vertical stabilizer/rudder. All I was trying to say is you must have a vertical stabilizer (of some kind) if you want to fly straight without wobbling around but do not need to have yaw control if you don\u0027t want it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-15T14:45:13Z\u0022 title=\u002210/15/2014 02:45  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 15, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-10-15T14:44:28Z","Content":"\n\u003Cp\u003EI don\u0027t recall any vertical stabilizers on the B2, though I haven\u0027t tried building one in KSP.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-10-15T14:47:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EdFred\u0022 data-cite=\u0022EdFred\u0022\u003E\u003Cdiv\u003EI don\u0027t recall any vertical stabilizers on the B2, though I haven\u0027t tried building one in KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn that unique case I believe the body design may act in that purpose. (I\u0027m not an expert on that though). However intuitively on the B9 the body ejects up from the wing creating nearly flat vertical surfaces for the air to go around which I would think would stabilize it. \u003C/p\u003E\u003Cp\u003E It may be possible to fly without one, but it\u0027s an exception, not the rule. In most cases, you want to have one and I\u0027m not sure KSP can go to B2 design levels.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-15T14:55:31Z\u0022 title=\u002210/15/2014 02:55  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 15, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ratchet freak","CreatedById":119895,"CreatedDateTime":"2014-10-15T14:53:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EIn that unique case I believe the body design may act in that purpose. (I\u0027m not an expert on that though) It may be possible to fly without one, but it\u0027s an exception, not the rule. In most cases, you want to have one and I\u0027m not sure KSP can go to B2 design levels.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe B2 had differential thrust to assist in yaw stability\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2014-10-15T14:55:52Z","Content":"\n\u003Cp\u003EThe B2 uses so many computers to fly, in KSP it\u0027d drain a 2.5m battery bank in under an hour. It probably does stabilization via thrust differentiation or airbrake-like control surfaces.\u003C/p\u003E\u003Cp\u003Eedit: ninja\u0027d.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-10-15T14:58:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022code99\u0022 data-cite=\u0022code99\u0022\u003E\u003Cdiv\u003EMy plane is 12.4 tons heavy at launch. \u003Cp\u003EPitch control surfaces are at the back (at the back of the wings, near the engines), yaw controls are non existent and roll surfaces are at the front on the cockpit sides accomplished by 2 delta deluxe winglets.\u003C/p\u003E\u003Cp\u003EI also have 2 vertical stabilizers without rudder at the back that look just pretty.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay...suggestions then - put a pair of control surfaces (I\u0027d suggest Small Control Surfaces but use elevons if you\u0027re going for aesthetics) as far outboard on the wings as you can; you\u0027ve got very little roll authority as it is and need some ailerons. You can make them function as proper elevons (pitch and roll axes) if you so choose, but you need more roll authority. Lose the delta-deluxe winglets; for the mass they don\u0027t provide much in terms of steering authority whatsoever. You\u0027d be better off with Advanced Canards, Standard Canards or even AV-8s there - but I\u0027d use them for pitch authority, not roll. A few (3-4) Reaction Wheels wouldn\u0027t hurt either; assuming a Mk-2 fuselage design, you could easily cram that many into a small cargo bay, shut the doors and be set. And if you\u0027re using Rockomax-sized parts in your fuselage, a single Large ASAS Module will do the trick instead. Finally, I\u0027d replace those vertical stabilizers with something that \u003Cem\u003Ecould\u003C/em\u003E give you \u003Cem\u003Esome\u003C/em\u003E yaw authority. AV-8s work well in that role; you shouldn\u0027t need a lot of yaw capability with a plane that light, but a little won\u0027t hurt.\u003C/p\u003E\n"},{"CreatedByName":"code99","CreatedById":113538,"CreatedDateTime":"2014-10-15T15:06:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003EOkay...suggestions then - put a pair of control surfaces (I\u0027d suggest Small Control Surfaces but use elevons if you\u0027re going for aesthetics) as far outboard on the wings as you can; you\u0027ve got very little roll authority as it is and need some ailerons. You can make them function as proper elevons (pitch and roll axes) if you so choose, but you need more roll authority. Lose the delta-deluxe winglets; for the mass they don\u0027t provide much in terms of steering authority whatsoever. You\u0027d be better off with Advanced Canards, Standard Canards or even AV-8s there - but I\u0027d use them for pitch authority, not roll. A few (3-4) Reaction Wheels wouldn\u0027t hurt either; assuming a Mk-2 fuselage design, you could easily cram that many into a small cargo bay, shut the doors and be set. And if you\u0027re using Rockomax-sized parts in your fuselage, a single Large ASAS Module will do the trick instead. Finally, I\u0027d replace those vertical stabilizers with something that \u003Cem\u003Ecould\u003C/em\u003E give you \u003Cem\u003Esome\u003C/em\u003E yaw authority. AV-8s work well in that role; you shouldn\u0027t need a lot of yaw capability with a plane that light, but a little won\u0027t hurt.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, ill try your suggestions, thanks to you an to the others for your help so far.\u003C/p\u003E\u003Cp\u003EI should mention tho that in my current config i have no problems whatsoever with roll.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2014-10-15T15:12:40Z","Content":"\n\u003Cp\u003EYeah, two delta-deluxes is plenty for roll of a small craft. What you have problems with is A) having enough pitch authority, and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E having enough wing surface. The latter is a problem because the plane won\u0027t spontaneously change direction, it needs its wings to push it into the new direction first, which may be a problem with smaller wings at higher speeds.\u003C/p\u003E\n"},{"CreatedByName":"MrChittyChad","CreatedById":168608,"CreatedDateTime":"2016-09-12T01:06:49Z","Content":"\n\u003Cp\u003E\nnote that turning in this simulator is completely wrong. even when banked at 45 degrees, it still flies straight. when someone tells you to just pitch up, you loose lots of speed and realistically that\u0027s not how turning happens unless you are doing high bank turning. it still suprises me that ksp hasn\u0027t fixed this issue.\n\u003C/p\u003E\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2016-09-12T07:00:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222751756\u0022 data-ipsquote-contentid=\u002287389\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473642409\u0022 data-ipsquote-userid=\u0022168608\u0022 data-ipsquote-username=\u0022MrChittyChad\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, MrChittyChad said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nnote that turning in this simulator is completely wrong. even when banked at 45 degrees, it still flies straight. when someone tells you to just pitch up, you loose lots of speed and realistically that\u0027s not how turning happens unless you are doing high bank turning. it still suprises me that ksp hasn\u0027t fixed this issue.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot true, I do create and fly planes a lot in KSP and i know for sure that if you bank, the plane starts turning slowly to the direction you are banked. 45 degrees gives you nice turnrate, offcourse you would also have tu use elevator to compensate, as the planes tend to also slightly dive when banked.\n\u003C/p\u003E\n\u003Cp\u003E\nI recommend using  \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E, KAX, and Firespitter, as Stock KSP is somewhat dull in airplane area.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-12T07:15:38Z\u0022 title=\u002209/12/2016 07:15  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 12, 2016\u003C/time\u003E by KOCOUR\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2016-09-12T07:09:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222751756\u0022 data-ipsquote-contentid=\u002287389\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473642409\u0022 data-ipsquote-userid=\u0022168608\u0022 data-ipsquote-username=\u0022MrChittyChad\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, MrChittyChad said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nnote that turning in this simulator is completely wrong.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNice necro of an almost 2 year old thread, the aerodynamics has been completely overhauled since 0.24.\n\u003C/p\u003E\n\u003Cp\u003E\nOn that, planes turn just fine - though you may want to turn off \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E or it will fight you.\n\u003C/p\u003E\n"}]}