{"TopicId":87448,"ForumId":16,"TopicTitle":"Exploding Launch Pad","CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-10-15T21:44:46Z","PageNum":1,"Articles":[{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-10-15T21:44:46Z","Content":"\n\u003Cp\u003ESo I finally had my first experience with \u0022destructible buildings\u0022. It happened when I took a vehicle I\u0027ve successfully used a couple times in V0.24 and put it on the launch pad. \u003C/p\u003E\u003Cp\u003EAnd the launch pad promptly blew up. Near as I can tell, from the stress of setting the rocket on it...?\u003C/p\u003E\u003Cp\u003ENow, this was NOT a Humongo-Booster[tm], certainly not by the standards I\u0027ve seen tossed around here. Most of the mass was in 9 Kerbodyne SRBs that get it most of the way to orbit; those add up to around 200 tons, so the whole thing on the pad is probably 250 tons or thereabouts.\u003C/p\u003E\u003Cp\u003EI\u0027m sure that there are plenty of people out there who have successfully launched vastly heavier lifters than that, in V0.25 with destructible buildings turned on. I have also seen complaints here that the runway is too fragile (though I haven\u0027t experienced that yet, myself). \u003C/p\u003E\u003Cp\u003ESo how have others worked around this? Is the era of Heavy Lift over?\u003C/p\u003E\u003Cp\u003E(And for that matter, do we know if the devs have any plans to toughen up the runway and launch pad?)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-15T22:22:23Z\u0022 title=\u002210/15/2014 10:22  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 15, 2014\u003C/time\u003E by Srpadget\u003C/strong\u003E\n\u003Cbr\u003EMark as \u0026#039;Answered\u0026#039;\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-10-15T21:53:02Z","Content":"\n\u003Cp\u003EUse launch clamps to jack the rocket up a couple meters off the ground. Problem solved, even for monstrously monumental rockets. Just make sure you have the staging done right so it doesn\u0027t fall on the pad anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-10-15T22:23:13Z","Content":"\n\u003Cp\u003ED\u0027oh! \u0022Launch clamps: they\u0027re not just for stability any more!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-10-15T23:00:23Z","Content":"\n\u003Cp\u003EJust don\u0027t try landing back on the pad - however gently you touch-down it\u0027ll still blow up.\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-10-17T23:58:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EJust don\u0027t try landing back on the pad - however gently you touch-down it\u0027ll still blow up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E::snort:: Yeah, right, like THAT\u0027S a danger. My \u0022precision re-entry/landings\u0022 when returning rockets to Kerbin are now getting good enough that I *usually* don\u0027t hit the mountains to the west, or end up too awfully many kilometers out to sea in the east. \u003C/p\u003E\u003Cp\u003EThank goodness funds are so easy to come by (flag spam! *ka-ching!* orbital science spam *ka-ching!*) that it\u0027s just gilding the lily to try to extract every possible Kredit of recovery costs, or I\u0027d never fly anything I couldn\u0027t launch in a spaceplane...\u003C/p\u003E\n"}]}