{"TopicId":87569,"ForumId":16,"TopicTitle":"Eve interception trajectory fails","CreatedByName":"Tokamak","CreatedById":115593,"CreatedDateTime":"2014-10-16T19:24:39Z","PageNum":1,"Articles":[{"CreatedByName":"Tokamak","CreatedById":115593,"CreatedDateTime":"2014-10-16T19:24:39Z","Content":"\n\u003Cp\u003EI have an issue with getting to eve, and it has been plaguing me since .23: Vessels that are supposed to enter Eve\u0027s SOI don\u0027t. \u003C/p\u003E\u003Cp\u003ETo be more specific, I can make a vessel, put it into orbit, make an transfer burn headed for eve, and even a careful fine tuning adjustment once I\u0027ve left Kerbin\u0027s SOI. After getting everything lined up, with the projected Eve encounter showing in the map view, and a nice close periapsis and everything, I go to the space center and time warp, as one does. However, here is the problem: Even if I only time warp for 100 days or so, not even the whole trip, when I go back to my vessel the trajectory not only no longer encounters Eve, but is several thousand m/s away from even getting close enough to have a \u0022closes approach\u0022 marker. \u003C/p\u003E\u003Cp\u003EAlmost every single time. Frankly, I sometimes just use the debug menu to turn on infinite fuel and correct my course, but I dislike cheating even if I am just fixing a game fail.\u003C/p\u003E\u003Cp\u003EDoes anyone know what could be causing this? I\u0027ve dealt with things like the \u0022flicker\u0022 of encounter points, which I understand are due to floating point issues (and are a totally different annoying problem) but this is different. There is no flicker. Everything shows me as PERFECTLY lined up, unless I go and time warp. If I time warp with the vessel focused in the flight interface or even in the tracking station, the trajectory doesn\u0027t derp, but if I warp for any length of time while it is not in focus it all goes cockeyed.\u003C/p\u003E\u003Cp\u003EHelp!? D:\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2014-10-17T00:39:25Z","Content":"\n\u003Cp\u003EAre you time warping before or after SOI transitions? If you time warp at 10,000x or 100,000x during or right after SOI transitions, your trajectory will be very different.\u003C/p\u003E\u003Cp\u003EThis happens right after SOI transitions too. If you go straight to 100,000x right after leaving Kerbin\u0027s SOI, that will change your trajectory significantly. Make sure to ramp it up slowly (going 10x, 100x, 1000x, 10,000x, 100,000x over a few seconds).\u003C/p\u003E\n"},{"CreatedByName":"Tokamak","CreatedById":115593,"CreatedDateTime":"2014-10-17T06:30:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metaphor\u0022 data-cite=\u0022metaphor\u0022\u003E\u003Cdiv\u003EAre you time warping before or after SOI transitions? If you time warp at 10,000x or 100,000x during or right after SOI transitions, your trajectory will be very different.\u003Cp\u003EThis happens right after SOI transitions too. If you go straight to 100,000x right after leaving Kerbin\u0027s SOI, that will change your trajectory significantly. Make sure to ramp it up slowly (going 10x, 100x, 1000x, 10,000x, 100,000x over a few seconds).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm... I always use Kerbal Alarm Clock to slow down before the SOI transition, but I didn\u0027t know it was still iffy AFTER the transition. I will look at that. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2014-10-17T08:50:36Z","Content":"\n\u003Cp\u003EThere\u0027s definitely bugs outside the \u0022SOI transition\u0022 issue. I setup a Duna transfer last night. I used KAC to safely leave Kerbin\u0027s SOI, after I did that, the intercept had a pe of 5 million km. Then I timed warped a bit, but killed it about halfway there - no transitions had been made. There was no intercept at all any more, and I had a 200ms correcting burn to get it again.\u003C/p\u003E\n"}]}