{"TopicId":87589,"ForumId":29,"TopicTitle":"How to spawn a Kerbal","CreatedByName":"Marclev","CreatedById":108506,"CreatedDateTime":"2014-10-16T21:46:45Z","PageNum":1,"Articles":[{"CreatedByName":"Marclev","CreatedById":108506,"CreatedDateTime":"2014-10-16T21:46:45Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EHaving looked all over the internet and forums, I can\u0027t find anything to help me with this, so ...\u003C/p\u003E\u003Cp\u003EDoes anybody know how I would go about, in a mod, spawning a Kerbal from nothingness? i.e. just have him appear from one moment to the next (let\u0027s assume I know what to call him and where I want him to spawn)? Think along the lines of the \u0022rescue a kerbal from orbit\u0022 contracts that you get in career mode. From what I can tell it\u0027s probably something to do with creating a new config node at runtime and then getting that to instantiate the new kerbal for me, but I don\u0027t even know where to begin with that...\u003C/p\u003E\u003Cp\u003EMany thanks in advance!\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-10-17T01:32:33Z","Content":"\n\u003Cp\u003Efirst - I don\u0027t know the answer andI have a hunch, it will be complicated..\u003C/p\u003E\u003Cp\u003Esecond - would a work around be acceptable?\u003C/p\u003E\u003Cp\u003Ethere is a function called \u0022spawn_vessel_crew\u0022 (or similiar).\u003C/p\u003E\u003Cp\u003Eif you spawn a 1-Seat commandpod (that code exists in different locations like KAS and others), you can spawn a crew and then you can send him on EVA..\u003C/p\u003E\u003Cp\u003Eafter that, in the same frame, you remove the pod and the kerbal is left..\u003C/p\u003E\u003Cp\u003Eif no one has a better solution, that would be my suggestion..\u003C/p\u003E\n"},{"CreatedByName":"SuperSeniorComicGuy","CreatedById":62983,"CreatedDateTime":"2014-10-29T04:42:56Z","Content":"\n\u003Cp\u003EThe Crew Manifest mod has logic that spawns Kerbals with custom names and attributes:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60936-0-25-Kerbal-Crew-Manifest-v0-5-9-0-(Oct-16)\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/60936-0-25-Kerbal-Crew-Manifest-v0-5-9-0-(Oct-16)\u003C/a\u003E\u003C/p\u003E\n"}]}