{"TopicId":88164,"ForumId":32,"TopicTitle":"Opinions on \u0026quot;Kerbal Experience\u0026quot;","CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-10-22T01:17:26Z","PageNum":21,"Articles":[{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2014-10-22T21:56:42Z","Content":"\n\u003Cp\u003EI\u0027m not going to say the engine modifications were a good thing - but if that\u0027s the direction they were going to go I had a good explanation. Although it\u0027s true that there\u0027s a lot of \u0022efficiency\u0022 gains that come from the player gaining real experience (good flight paths etc), there are a lot of controls on the rocket to which the player has no input. All those switches and knobs. I don\u0027t know much about how to relight a rocket IRL, but maybe you leave the \u0022starter\u0022 on too long and it\u0027s burning a hole in the combustion chamber which reduces efficiency or something. Or adjusting fuel ratios - that sounds plausible enough. The point is, there\u0027s a lot of switches and procedures for running a rocket that we don\u0027t have to worry about as a player and it seems plausible that a more experienced Kerbal could eek out better or worse performance.\u003C/p\u003E\u003Cp\u003EAll these things could be done by computer but I think we\u0027ve established Kerbals don\u0027t automate everything.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-10-22T21:58:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ignath\u0022 data-cite=\u0022Ignath\u0022\u003E\u003Cdiv\u003EOooh, ooh...can my sarcasm be 5% easier to detect?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, no. We\u0027ve already discussed that you can\u0027t use skills to violate the laws of physics. The laws of conservation of the sar-chasm are immutable.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-10-22T21:59:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxmaps\u0022 data-cite=\u0022Maxmaps\u0022\u003E\u003Cdiv\u003EWe\u0027re keeping an eye on this discussion regarding changes but I\u0027d like to clarify some things first.\u003Cp\u003EThe way we look at the thrust boosting trait is more nuanced than it looks. \u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/2jy307/devnote_tuesdays_the_kspumpkin_edition/clg70zw\u0022 rel=\u0022external nofollow\u0022\u003EThis guy over at Reddit\u003C/a\u003E actually nailed our reasoning perfectly.\u003C/p\u003E\u003Cp\u003EBut here\u0027s some extra points that should be made clear!\u003C/p\u003E\u003Cp\u003EThe current system works on 5 levels of veterancy, with level 1 giving no bonus at all.\u003C/p\u003E\u003Cp\u003EThese bonuses would be really, really small, think something between 3 and 5% at max level.\u003C/p\u003E\u003Cp\u003EThey would be hard to earn, as we want to encourage people to leave Kerbin\u0027s SOI\u003C/p\u003E\u003Cp\u003EThey only affect parts you have full control over, to signify the Kerbal knowing how to work a rocket better, modules without thrust control would see no benefit whatsoever.\u003C/p\u003E\u003Cp\u003EThe current system we have planned has them only active under certain circumstances, say a Kerbal may have a trait for 4% more thrust while in Atmosphere, and another one while in Vacuum.\u003C/p\u003E\u003Cp\u003ETraits don\u0027t stack.\u003C/p\u003E\u003Cp\u003EWe\u0027re still looking at the system as a whole, so feedback is always welcome!\u003C/p\u003E\u003Cp\u003EEdit: Franklin beat me on reposting!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs to the reddit post, that is spot on imo. I mean, if you are going to add this to the game, there is probably going to be a way to disable experience, and this could be a very entertaining game mechanic. If I\u0027m playing perma-death career, I\u0027d love some raised antics in taking an experienced pilot out to Tylo! That\u0027d make KSP-TV more entertaining to watch, my own vids better, AND add more plot suspense to the other KSP YouTubers. \u003C/p\u003E\u003Cp\u003EImagine if [Nassault] could say within a stock video how [bob] doesn\u0027t have enough [aerodynamics experience] to pilot the [Whack-plane Mk1], but [bill] does. Fill in those brackets with whatever YouTuber and kerbals you want! Or maybe \u0022Jeb take the wheel! You\u0027ve got more experience in crash landings!\u0022 Or other plot devices like this. Just me?\u003C/p\u003E\u003Cp\u003EFrom what I see, there isn\u0027t anything bad to come out of this as I highly doubt this would be an un-editable trait. You can probably turn it off if you don\u0027t want it. Could a mod answer that/has this been answered yet?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T22:04:45Z\u0022 title=\u002210/22/2014 10:04  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Avera9eJoe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-10-22T21:59:58Z","Content":"\n\u003Cp\u003ESomeone needs to define the link between experience, stupidity and bravery. I\u0027m not sure its clear at the moment.\u003C/p\u003E\n"},{"CreatedByName":"Yellowburn10","CreatedById":107558,"CreatedDateTime":"2014-10-22T22:02:14Z","Content":"\n\u003Cp\u003EI still fail to understand how people are so upset that kerbals could affect an engine, even by a very tiny amount, because it \u0022defies physics.\u0022 I understand why you disagree with this, and I\u0027ve even questioned this too, but people are completely fired up about this. \u003Cstrong\u003EHow are people fired up over this?\u003C/strong\u003E I\u0027ve heard less complaints about the current soupy atmosphere! Is it because of miss information? A want for completely real physics? \u003C/p\u003E\u003Cp\u003EIf you didn\u0027t know, kerbals don\u0027t \u003Cem\u003Emagically\u003C/em\u003E make an engine ISP greater, or thrust larger. They\u0027ve been astronauts for longer, flown more missions, and they would know how to make a rocket work better and preform more efficiently than newer kerbals. Does this not make sense, logically or physically? Also, I\u0027d actually prefer this over wobbly craft because of a shaky joystick of a newbie pilot. Secondly, since when has KSP been in the realm of \u0022realistic physics?\u0022 Small planetary bodies, soupospheres, OP Ion engines, all that \u0022law-bending\u0022 stuff has been in the game for a while now. All of it (besides the souposphere stuff) is there to make this not just fun to use as a space simulator, but fun as a space game as well.\u003C/p\u003E\u003Cp\u003EIt\u0027s pretty obvious that the major bias here is simulator before game (yes, they are two different things). People would rather have constant ship statuses, and do whatever they wish with their kerbals, than to give the kerbals a little control over the ship that they\u0027re piloting. Giving Kerbal XP perks to the ship, they\u0027re on, and the rest of kerbel XP, helps give kerbals a little bit of character, rather than be a blank clone with a name. Now you could give you kerbals some character yourself, but sometimes is funner to let the game play out and see them make a character for themselves.\u003C/p\u003E\u003Cp\u003EIMO, Kerbal XP isn\u0027t really meant to be such a big gameplay mechanic, rather to be something to further characterize your roster of eager green kerbonauts. Sure, some XP perks don\u0027t really follow laws of physics, but we still don\u0027t know all the details about kerbal XP yet. Like, oh, exactly how they get it? Sure, they said that they get it from flying lots of missions, but that explanation is vague at best. They never really said specifically how your kerbals get certain XP.\u003C/p\u003E\u003Cp\u003EEdit: I see Maxmaps has already gone over this.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T22:06:33Z\u0022 title=\u002210/22/2014 10:06  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Yellowburn10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2014-10-22T22:04:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FleetAdmiralJ\u0022 data-cite=\u0022FleetAdmiralJ\u0022\u003E\u003Cdiv\u003EApparently it was so much so that a near riot broke out in the forums and reddit causing squad to gut the feature.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I can\u0027t talk about everyone else, but IMHO the very concept of the pilot skill changing engineering facts is in the exact antipodes of the SQUAD stated goal of having a game that respect the laws of physics ( OTOH if we were talking of the skill of the engineers in the ground that makes those parts , that would be a whole different thing, but that was definitely not what was stated in the dev notes ). And would definitely not be surprised if most of the people that were against it at the core thinked the exact same ...\u003C/p\u003E\u003Cp\u003E@Yellowburn10\u003C/p\u003E\u003Cp\u003EMaybe this was the straw that broke the camel\u0027s back *dunno* ANd I would say that people were never that happy with the things you enumerate. And BTW , as stated above, it was SQUAD itself that said they wanted to make a game that respected the laws of physics. People that expect so are only waiting that SQUAD makes their word true ...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T22:08:12Z\u0022 title=\u002210/22/2014 10:08  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by r_rolo1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-10-22T22:05:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dreamixpl\u0022 data-cite=\u0022Dreamixpl\u0022\u003E\u003Cdiv\u003EI really hate the experience concept, i just won\u0027t repeat what others said. But i hate even more the \u0022Wait and see\u0022 option in the pool. People who have chosen this option will wait between 3 months to even one year for update, whose they don\u0027t even know (if) they will like it. That update will propably add only (hated) experience system. I thing Squad should focus on making SANDBOX, because \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Ecarreer is sandbox with funds\u003C/strong\u003E\u003C/span\u003E, and not sandbox is carrer without funds. Meanwhile sandbox havent changed since years (???)!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m still not convinced that this thread is actually a flame war against the Kerbal Experience feature. It would seem that this thread is actually a flame war against Career Mode.\u003C/p\u003E\u003Cp\u003ETherefore, those of us who actually do play Career Mode have to loose an important feature that we want, because players who don\u0027t play Career Mode don\u0027t want Squad to spend time developing career mode.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-10-22T22:06:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wallygator\u0022 data-cite=\u0022Wallygator\u0022\u003E\u003Cdiv\u003EI\u0027m sure there is a more advanced view of the experience/training/qualification gameplay dynamic that actually adds even deeper emersion for role-play without denigrating the physics foundation. Now is the opportunity to contribute further ideas. The devs now realise this - the community can help on the requirements definition.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebingo! now there is a chance we will get a well thought out immersive game mechanic instead of a half baked \u0022jebs enchanted gloves of fuel efficiency\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trentendegreth\u0022 data-cite=\u0022Trentendegreth\u0022\u003E\u003Cdiv\u003EI think that the OPTION has been taken out of our hands, Due to Peoples OPINIONS, the majority rules and has spoken without consideration of the minority in the end we all loose\u003C/div\u003E\u003C/blockquote\u003E ok. i dont know why your capitalizing OPINIONS, but yes in this case the majority does rule. the view of the minority was certainly considered, but the overwhelming majority believed the XP system described was not good enough. i dont understand how \u0022we all loose\u0022 when the community says something is not good enough, and the devs say they will go back to the drawing board.\u003Cp\u003Eim now confident that good things will come.\u003C/p\u003E\n"},{"CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2014-10-22T22:06:45Z","Content":"\n\u003Cp\u003ELike what was said before, I don\u0027t exactly see why this is SOOOOOO bad. I mean, sure there are other ways of approaching this, like making missions and contracts reward more funds/science/rep, and maybe these other ways would make the game more realistic, but if this experience approach is executed properly, i think it could be awesome.\u003C/p\u003E\u003Cp\u003EBesides, it could have some funny implications. for example, someone makes an eve ssto using stock engines. most people think \u0022whoa! that\u0027s impossible! this guy is a h4cker!\u0022\u003C/p\u003E\u003Cp\u003Eand then some observant people would respond with \u0022that ship has 20 kerbals on board who did a grand tour of the kerbol system\u0022 and then the other people would say \u0022ohhh\u0022 XD\u003C/p\u003E\u003Cp\u003EAlso, i\u0027d be careful about forcefully suggesting things for this game. After all, everybody talks about how bad the minecraft effect is.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T22:13:29Z\u0022 title=\u002210/22/2014 10:13  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by quasarrgames\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Parkaboy","CreatedById":64208,"CreatedDateTime":"2014-10-22T22:17:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EI\u0027m still not convinced that this thread is actually a flame war against the Kerbal Experience feature. It would seem that this thread is actually a flame war against Career Mode.\u003Cp\u003ETherefore, those of us who actually do play Career Mode have to loose an important feature that we want, because players who don\u0027t play Career Mode don\u0027t want Squad to spend time developing career mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI feel the very same way.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2014-10-22T22:17:51Z","Content":"\n\u003Cp\u003EI posted this in another portion of the forums, but wanted to quote it here in the hopes that Squad might be more likely to read it:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlowerChild\u0022 data-cite=\u0022FlowerChild\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIMO, an XP system just doesn\u0027t go very well with a game like KSP. I think for that to work in a game, you need systems that are essentially abstracted beyond the point where the player can control them directly (e.g. the details of combat in a turn based RPG). Sim-style games are usually fairly devoid of these kinds of abstracted systems. You might have the odd example like the speed at which someone can unjam a gun in a WWI flight sim or what have you, which really isn\u0027t something the player would be able to control to a sufficient degree to make it entirely dependent on the player\u0027s own actions, or situations in which the player can\u0027t effectively control everything going on and thus an XP system can serve to determine the efficiency of AI at various posts (say like in a submarine or WWII bomber simulator) but usually these details aren\u0027t enough to warrant an entire XP system for your crew.\u003C/p\u003E\u003Cp\u003EI think that\u0027s basically what\u0027s happening here in KSP. It\u0027s not a full blown simulator, but on the other hand it shares many gameplay attributes with one, which I think makes it ill suited for an XP system overall.\u003C/p\u003E\u003Cp\u003ERight now, it feels like Squad is determined to have an XP system \u0022just because\u0022, and is trying to find justification for it through additional gameplay mechanisms, rather than putting an XP system in the game because they have a specific benefit to gameplay in mind. I think the question they should really be asking is why the game needs an XP system in the first place, much as I\u0027ve previously said about the admin building and the strategies I feel were included largely just to justify its existence.\u003C/p\u003E\u003Cp\u003EEDIT: Actually, a good example of an XP system in an appropriate context is KSP\u0027s own science system. The details of conducting scientific research are obviously beyond the player\u0027s direct control and thus must be abstracted to be a reasonable part of the game. At this point, inserting XP in the form of \u0022science points\u0022 is so natural a gameplay mechanism that we tend to not even think about it for what it is.\u003C/p\u003E\u003Cp\u003EWith Kerbal XP on the other hand, an attempt seems to be being made to abstract systems which we already have direct control over and thus an XP system winds up feeling distinctly unnatural. It\u0027s basically a case where control is being *removed* from the player in order to justify an XP system rather than an XP system being created to fill in the blanks the player has no ability to control. IMO, it\u0027s moving the game away from interactivity as a result.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn short, I don\u0027t think the issue with the XP system is the particular variables you have it affecting (engine performance, etc.), I think that it\u0027s more an issue that the game is ill-suited for such a system in the first place, and it may be entirely reasonable to consider scrapping it entirely.\u003C/p\u003E\u003Cp\u003EAnd this is coming from a guy that is ONLY interested in playing career mode, so career/sandbox bias isn\u0027t a factor here.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-10-22T22:22:09Z","Content":"\n\u003Cp\u003EAfter reading over what Maxmaps said; I have this to say.\u003C/p\u003E\u003Cp\u003EJust PLEASE don\u0027t make it a passive effect that increases the thrust of all throttleable engines. Even if no EVA interaction is required, at LEAST make it a button on the Flight GUI that lets you overthrust the engines. \u003C/p\u003E\u003Cp\u003EI remember the RCS L.E.D. on the Navball used to read \u0022OVR THRST\u0022. There\u0027s even a bit of extra space on the throttle indicator on the Navball. Ideal is that \u0022Z\u0022 Key defaults to 100% thrust, but \u0022SHIFT\u0022 can throttle up further, and how much further is depending on the situation and the Kerbal\u0027s skill level for that trait. A Kerbal might be able to increase the thrust up to 130%, then when they reach Vacuum he cuts back down to 100%.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDo. NOT. Make. It. Passive.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI can deal with this perfectly fine if the boost is something the player has control over.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-10-22T22:25:30Z","Content":"\n\u003Cp\u003EScience, Reputation, Funding....\u003C/p\u003E\u003Cp\u003EThese things the Kerbals should be able to affect.\u003C/p\u003E\u003Cp\u003EThrust... NO\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-10-22T22:26:48Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://twitter.com/Maxmaps/status/524974197551149056\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://twitter.com/Maxmaps/status/524974197551149056\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m now actually pretty disappointed that there will be no engine perks of any kind. My only objection was making it passively increased instead of unlocking a higher throttle setting or allowing EVA interaction.\u003C/p\u003E\n"},{"CreatedByName":"UltraOne","CreatedById":103170,"CreatedDateTime":"2014-10-22T22:31:29Z","Content":"\n\u003Cp\u003EI agree with the many comments on this thread that Kerbal XP should not affect parts of the simulation the player has direct control over, such as anything having to do with vehicle flight performance or piloting (e.g. thrust, ISP, heat generation, turn torque). The fact that this would mean that the viability of some designs (to reach orbit, for example) would depend on crew XP is a further reason not to do this.\u003C/p\u003E\u003Cp\u003EI am fine with Kerbal XP affecting things that are already abstracted, like science, money or reputation rewards. I am also Ok with a system where Kerbals have AI that allows them to complete certain tasks (e.g. docking) automatically, and the XP determines how rapidly and efficiently (in terms of propellant, for the docking example) they can complete the task, as long as none of the physics rules in the simulation are broken.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-10-22T22:33:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EI\u0027m still not convinced that this thread is actually a flame war against the Kerbal Experience feature. It would seem that this thread is actually a flame war against Career Mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWeird. I disagree with you on at least 2 points.\u003C/p\u003E\u003Cp\u003EFirst, it\u0027s not a flame war. It\u0027s a (mostly) reasonable (though heated) discussion about a proposed game feature that a lot of us feel will not only just not add to the game, but will actually detract from it.\u003C/p\u003E\u003Cp\u003ESecond, I play career almost exclusively (I only use Sandbox to test things and most of the time I don\u0027t even do that... I just make sure i have backups of my persistence file and then rely on reverting to VAB) and I was against this. I don\u0027t see why anybody who only plays sandbox would care what happens in career mode.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003ETherefore, those of us who actually do play Career Mode have to loose an important feature that we want, because players who don\u0027t play Career Mode don\u0027t want Squad to spend time developing career mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see Maxmaps\u0027 retraction not as losing a feature, but as retaining one: The feature where you can watch my videos, see the ship I used, build that ship, and do what I did. There will be no \u0022Weird. He got into orbit just after dumping his launch stage and I can\u0027t get that far even though I\u0027m doing it EXACTLY the same way.\u0022\u003C/p\u003E\u003Cp\u003EWe\u0027ve gone over the arguments for and against far too much in this thread so I won\u0027t rehash it, but thought that aspect (We *WERE* losing something) was worth reiterating based on your comment that you are losing something because of those of use who voiced dissent.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-10-22T22:39:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avera9eJoe\u0022 data-cite=\u0022Avera9eJoe\u0022\u003E\u003Cdiv\u003EAs to the reddit post, that is spot on imo. I mean, if you are going to add this to the game, there is probably going to be a way to disable experience, and this could be a very entertaining game mechanic. If I\u0027m playing perma-death career, I\u0027d love some raised antics in taking an experienced pilot out to Tylo! That\u0027d make KSP-TV more entertaining to watch, my own vids better, AND add more plot suspense to the other KSP YouTubers. \u003Cp\u003EImagine if [Nassault] could say within a stock video how [bob] doesn\u0027t have enough [aerodynamics experience] to pilot the [Whack-plane Mk1], but [bill] does. Fill in those brackets with whatever YouTuber and kerbals you want! Or maybe \u0022Jeb take the wheel! You\u0027ve got more experience in crash landings!\u0022 Or other plot devices like this. Just me?\u003C/p\u003E\u003Cp\u003EFrom what I see, there isn\u0027t anything bad to come out of this as I highly doubt this would be an un-editable trait. You can probably turn it off if you don\u0027t want it. Could a mod answer that/has this been answered yet?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYouTubers and streamers are a way of crowd (public?) entertainment, and -I believe- should not be taken into account when factoring new features, otherwise we would end with shallow cinematic games designed to be watched and not played, oh wait, we already have those and they suck.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yellowburn10\u0022 data-cite=\u0022Yellowburn10\u0022\u003E\u003Cdiv\u003EI still fail to understand how people are so upset that kerbals could affect an engine, even by a very tiny amount, because it \u0022defies physics.\u0022 I understand why you disagree with this, and I\u0027ve even questioned this too, but people are completely fired up about this. \u003Cstrong\u003EHow are people fired up over this?\u003C/strong\u003E I\u0027ve heard less complaints about the current soupy atmosphere! Is it because of miss information? A want for completely real physics? \u003Cp\u003EIf you didn\u0027t know, kerbals don\u0027t \u003Cem\u003Emagically\u003C/em\u003E make an engine ISP greater, or thrust larger. They\u0027ve been astronauts for longer, flown more missions, and they would know how to make a rocket work better and preform more efficiently than newer kerbals. Does this not make sense, logically or physically? Also, I\u0027d actually prefer this over wobbly craft because of a shaky joystick of a newbie pilot. Secondly, since when has KSP been in the realm of \u0022realistic physics?\u0022 Small planetary bodies, soupospheres, OP Ion engines, all that \u0022law-bending\u0022 stuff has been in the game for a while now. All of it (besides the souposphere stuff) is there to make this not just fun to use as a space simulator, but fun as a space game as well.\u003C/p\u003E\u003Cp\u003EIt\u0027s pretty obvious that the major bias here is simulator before game (yes, they are two different things). People would rather have constant ship statuses, and do whatever they wish with their kerbals, than to give the kerbals a little control over the ship that they\u0027re piloting. Giving Kerbal XP perks to the ship, they\u0027re on, and the rest of kerbel XP, helps give kerbals a little bit of character, rather than be a blank clone with a name. Now you could give you kerbals some character yourself, but sometimes is funner to let the game play out and see them make a character for themselves.\u003C/p\u003E\u003Cp\u003EIMO, Kerbal XP isn\u0027t really meant to be such a big gameplay mechanic, rather to be something to further characterize your roster of eager green kerbonauts. Sure, some XP perks don\u0027t really follow laws of physics, but we still don\u0027t know all the details about kerbal XP yet. Like, oh, exactly how they get it? Sure, they said that they get it from flying lots of missions, but that explanation is vague at best. They never really said specifically how your kerbals get certain XP.\u003C/p\u003E\u003Cp\u003EEdit: I see Maxmaps has already gone over this.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot logical -at all-. Tell me how do you change the combustion chamber size, the plumbing, the turbo-pump capacity, etc in flight and then we may talk about it. If those physical changes were to exist (they do, actually, SSMEs were fined tuned multiple times for example to thrust more) why would they require a magical Kerbal instead of a technological advancement (like what most people wanted the tech tree to be about)?\u003C/p\u003E\u003Cp\u003EEverything else you mentioned here has been complained about multiple times, statements have been made about all of that: Atmosphere is getting overhauled, for example, and until now that\u0027s as certain as it can possibly be), the planetary body size problem will arise again and again, and \u003Cstrong\u003Eeven stronger once they change the aerodynamics\u003C/strong\u003E. The OP ion engine has been discussed to hell and back, and the final word from squad was \u0022it\u0027s more fun to have them be OP\u0022, yet the topic is mentioned really often. Also, as far as I remember, the planets and universe in general are small because back in the day there was no timewarp, and you don\u0027t want to go to the moon 400000km away without timewarp, it was implemented as a gameplay \u0022enhancement\u0022 and stands that way even now that we have our timewarp for no apparent reason (maybe because of the soupy atmosphere, who knows).\u003C/p\u003E\u003Cp\u003EBy the way, it doesn\u0027t matter how they get it, they are still affecting ship performance magically with no logical explanation other than abstractions of abstractions of abstractions of somebody\u0027s idea of what a good gameplay element should be.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlowerChild\u0022 data-cite=\u0022FlowerChild\u0022\u003E\u003Cdiv\u003EI posted this in another portion of the forums, but wanted to quote it here in the hopes that Squad might be more likely to read it:\u003Cp\u003EIn short, I don\u0027t think the issue with the XP system is the particular variables you have it affecting (engine performance, etc.), I think that it\u0027s more an issue that the game is ill-suited for such a system in the first place, and it may be entirely reasonable to consider scrapping it entirely.\u003C/p\u003E\u003Cp\u003EAnd this is coming from a guy that is ONLY interested in playing career mode, so career/sandbox bias isn\u0027t a factor here.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbal individualization and motivation to take care of them has been requested (and mentioned by devs) since long ago, most people want the feature, just not implemented like this. I bet most people would be happy if it was introduced as ribbons, medals, plaques, memorials and whatnot, but since they mentioned a gameplay affecting element, that comes into play in the discussion too.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-10-22T22:40:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EI\u0027m still not convinced that this thread is actually a flame war against the Kerbal Experience feature. It would seem that this thread is actually a flame war against Career Mode.\u003Cp\u003ETherefore, those of us who actually do play Career Mode have to loose an important feature that we want, because players who don\u0027t play Career Mode don\u0027t want Squad to spend time developing career mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI play pretty much exclusively Career and disliked this idea from the get-go. I just didn\u0027t want Squad to spend time developing something that amounts to \u002B5 Shirt of Isp or \u002B3 Boots of Thrust. It\u0027s just turning kerbals into totems that improve the engines performance (apparently through magic). I actually want kerbal XP, but as long as it increases at least funds/science/rep - the driving forces behind Career mode. \u003C/p\u003E\u003Cp\u003EAnd it wasn\u0027t a flame war against anything - in fact, one of the most civilised arguments I\u0027ve seen here. And it wasn\u0027t against kerbal XP, it was about the specific incarnation of it (again, people suggested better uses for it in this thread, like science boost, or repair things better somehow).\u003C/p\u003E\u003Cp\u003ESo yeah - I play career and I don\u0027t want to be magically granted more thrust because I have a specific pilot on board. Let me just remove him and oops, my rocket can\u0027t even take off any more. How does that make any sense at all... a rocket has a specific mass and a specific thrust - simply having Ludberry Kerman instead of Ferfel Kerman in the pilots seat does not change that.\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-10-22T22:43:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yellowburn10\u0022 data-cite=\u0022Yellowburn10\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf you didn\u0027t know, kerbals don\u0027t \u003Cem\u003Emagically\u003C/em\u003E make an engine ISP greater, or thrust larger. They\u0027ve been astronauts for longer, flown more missions, and they would know how to make a rocket work better and preform more efficiently than newer kerbals. Does this not make sense, logically or physically?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it doesn\u0027t make sense, neither logically, nor physically.\u003C/p\u003E\u003Cp\u003EYou say that they have been astronauts for longer, flown more missions, and therefore can make stuff perform better. I ask you: how? Specifically, in what way could the flight experience of a pilot have any impact on the physical design of an engine? I am asking seriously for a specific answer.\u003C/p\u003E\u003Cp\u003EUnless someone can provide a procedure that would allow the pilot to increase the thrust of an engine, you are just moving the \u0022it\u0027s magic\u0022 explanation one level down: \u0022It\u0027s not magic! It\u0027s the pilot that is improving the engine... using magic.\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T22:46:10Z\u0022 title=\u002210/22/2014 10:46  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Ippo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-22T22:46:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EI\u0027m still not convinced that this thread is actually a flame war against the Kerbal Experience feature. It would seem that this thread is actually a flame war against Career Mode.\u003Cp\u003ETherefore, those of us who actually do play Career Mode have to loose an important feature that we want, because players who don\u0027t play Career Mode don\u0027t want Squad to spend time developing career mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t even understand how you think that this was against career mode. It wasn\u0027t even against experience, but it was very much about what can, and can not, be affected by experience. Pilots directly improving thrust or ISP would pretty much amount to magic... but that has been said a thousand times already. There also have been enough suggestions how a skilled pilot could improve flight performance without invoking a blanket 5% bonus.\u003C/p\u003E\u003Cp\u003EBrowse this thread -- it\u0027s far more than just \u0022do not want\u0022.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2014-10-22T22:51:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PDCWolf\u0022 data-cite=\u0022PDCWolf\u0022\u003E\u003Cdiv\u003EKerbal individualization and motivation to take care of them has been requested (and mentioned by devs) since long ago, most people want the feature, just not implemented like this. I bet most people would be happy if it was introduced as ribbons, medals, plaques, memorials and whatnot, but since they mentioned a gameplay affecting element, that comes into play in the discussion too.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHonestly I don\u0027t think that there are enough systems in the game to justify the above.\u003C/p\u003E\u003Cp\u003EIf for example, there was a system for Kerbals to maintain or repair vessels while in flight (which itself would necessitate some kind of damage system), then I could see XP affecting the rate or quality of repair making sense, as that\u0027s not something the player can reasonably control short of quick-time events (which suck mightily). It then becomes a situation similar to what I mentioned about unjamming a gun in a WWI flight sim.\u003C/p\u003E\u003Cp\u003EIn a case like that the role of the player and the role of the Kerbal are clearly defined. I think where the current ideas I\u0027ve seen mentioned fall flat is that they\u0027re crossing the line between what is the players responsibility, and what is the Kerbal\u0027s.\u003C/p\u003E\u003Cp\u003EXP systems are ultimately abstractions used to fill the gap where the player doing something themselves is either impractical due to UI limitations, or would be so dull as to not qualify as fun. They\u0027re not really things that should be aspired towards for their own sake IMO.\u003C/p\u003E\u003Cp\u003EI think a big problem with all this is that *Kerbals just don\u0027t do much* and thus trying to jam a system in place to make them more significant is destined to get funky. If people want them to have a more significant role in the game, then I suspect more significant activities must be added to the game for them first instead of trying to jury rig existing activities the player has full control over to give Kerbals significance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T23:07:01Z\u0022 title=\u002210/22/2014 11:07  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by FlowerChild\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-10-22T22:55:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EAfter reading over what Maxmaps said; I have this to say.\u003Cp\u003EJust PLEASE don\u0027t make it a passive effect that increases the thrust of all throttleable engines. Even if no EVA interaction is required, at LEAST make it a button on the Flight GUI that lets you overthrust the engines. \u003C/p\u003E\u003Cp\u003EI remember the RCS L.E.D. on the Navball used to read \u0022OVR THRST\u0022. There\u0027s even a bit of extra space on the throttle indicator on the Navball. Ideal is that \u0022Z\u0022 Key defaults to 100% thrust, but \u0022SHIFT\u0022 can throttle up further, and how much further is depending on the situation and the Kerbal\u0027s skill level for that trait. A Kerbal might be able to increase the thrust up to 130%, then when they reach Vacuum he cuts back down to 100%.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDo. NOT. Make. It. Passive.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI can deal with this perfectly fine if the boost is something the player has control over.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah I agree. I\u0027m picturing an option for when you go 100% throttle to show an \u0022ELEVEN\u0022 button to go into the red zone on top. Again this would be super cool in filming and suspenseful streaming! Enjoy my 30 second paint sketch!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/aTuw1\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EImagine you\u0027re about to crash into Tylo and go full throttle. A big red flashing, caution striped lined button pops up from the side of the navbal with big red letters displaying \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003E11\u003C/span\u003E\u003C/span\u003E shows up! It\u0027s your last hope! You engage the omega 13! The hyper drive! Lint warp! CRANK it to eleven and BOOM! Sparks fly and a new meaning to the world fireball launches itself out of the engine! You land safe on Tylo.\u003C/p\u003E\u003Cp\u003EAnd again another reference to pop-culture and stupid movies.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T23:05:02Z\u0022 title=\u002210/22/2014 11:05  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Avera9eJoe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-10-22T23:00:12Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt is the most complete Kerbal Space Program we\u0027ve ever made... it\u0027s magic\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/coGslWk.jpg?1\u0022 alt=\u0022coGslWk.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s good that they removed the engine perks, it still stinks that they are still thinking about modifying other parts. I\u0027ll still have to mod it out of existence, I guess.\u003C/p\u003E\n"},{"CreatedByName":"Kerano","CreatedById":107460,"CreatedDateTime":"2014-10-22T23:04:32Z","Content":"\n\u003Cp\u003EI\u0027m very pleased to see that Squad has changed its mind and decided that engines will not be affected by Kerbal XP.\u003C/p\u003E\u003Cp\u003EPersonally, I would be happy if Kerbal XP just gave bonus funds/rep/science. Awarding badges depending on where the Kerbal has been would also be neat.\u003C/p\u003E\u003Cp\u003EThat\u0027s all I want out of the system; I don\u0027t want the way my crafts physically function to be altered at all. As others have said, if you fly a rocket I\u0027ve designed, then we should be able to achieve the same objectives - it shouldn\u0027t depend on which Kerbals we stick in the seats.\u003C/p\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2014-10-22T23:11:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxmaps\u0022 data-cite=\u0022Maxmaps\u0022\u003E\u003Cdiv\u003EAnd that\u0027s kinda where the crux of the argument is here. People who are okay with the idea of the Kerbals being the ones piloting don\u0027t really seem to mind the fact that they get better at steering and overall become more efficient pilots. People who see themselves as the pilot don\u0027t like the idea of getting extra bonuses when they are already performing at what they consider to be peak capacity.\u003Cp\u003E\u003Cstrong\u003EEdit: This is also a pretty good example of the divide between the playerbase between seeing the game as a simulator or a game.\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know if this has come up earlier but if this the way you truly see your community I would humbly suggest a change in viewpoint. This is an artificial dichotomy to start with as is the alleged divide of the players ourselves. All of us I\u0027m sure find that a game can also be a simulator?\u003C/p\u003E\n"}]}