{"TopicId":88176,"ForumId":16,"TopicTitle":"Why use the arospike","CreatedByName":"Apature rocket science","CreatedById":77886,"CreatedDateTime":"2014-10-22T03:39:18Z","PageNum":1,"Articles":[{"CreatedByName":"Apature rocket science","CreatedById":77886,"CreatedDateTime":"2014-10-22T03:39:18Z","Content":"\n\u003Cp\u003EI want to know why people use the aro spike, personly I never use it but idont get why others use its just a rocket engine.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-10-22T04:03:29Z","Content":"\n\u003Cp\u003EFor this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1378.photobucket.com/user/craigmotbey/media/Kerbal/Challenges/Akademy%20Awards/Kerbodyne%20Whirlwind/screenshot452_zps8d7c5caa.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1378.photobucket.com/albums/ah120/craigmotbey/Kerbal/Challenges/Akademy%20Awards/Kerbodyne%20Whirlwind/screenshot452_zps8d7c5caa.jpg\u0022 alt=\u0022screenshot452_zps8d7c5caa.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Overjay","CreatedById":104131,"CreatedDateTime":"2014-10-22T05:39:29Z","Content":"\n\u003Cp\u003EYou see, specific impulses of aerospike in vacuum and atmosphere are almost equal. This fact makes it perfect for using in space planes and small multipurpose landers.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-10-22T06:04:48Z","Content":"\n\u003Cp\u003EEve ascent vehicles are where it shines like a diamond among clumps of coal. However, I\u0027ve seen people using it for spaceplanes and small rockets too.\u003C/p\u003E\u003Cp\u003EYou just need to find a craft that will spend time in the atmosphere but won\u0027t be able to use jets.\u003C/p\u003E\n"},{"CreatedByName":"Wavechaser","CreatedById":125058,"CreatedDateTime":"2014-10-22T21:59:55Z","Content":"\n\u003Cp\u003EYou won\u0027t say \u0022it\u0027s just another rocket engine\u0022 if, if you take a look of its specific impulse. And compare it with LV T-45 and some other engines.\u003C/p\u003E\u003Cp\u003E388s/390s (atsp/vacm), man!! 388s in ASL! That\u0027s almost as effective as LV-909/Rockomax Poodle/KR-2L in vaccum! I know it is kinda ugly and can\u0027t be attached in the bottom, but, hey, it\u0027s extremely fuel-effecient. In fact, it has the most ASL specific impulse among all the stock engines. Plus, 175kN of thrust is fairly a lot. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-10-22T22:22:47Z","Content":"\n\u003Cp\u003EIt is powerful, efficient and lightweight for a rocket engine. If you like, take a look at my Mission to Eve (Link in the signature) which makes extensive use of the aerospike engine. Its pretty much one of the best engines you can put on a heavy lander in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2014-10-22T22:41:19Z","Content":"\n\u003Cp\u003EIt is fairly efficient, as it\u0027s specific impulses are balanced, so it is versatile.\u003C/p\u003E\u003Cp\u003EOn a space plane, it can be used for a gliding assist and landing assist.\u003C/p\u003E\u003Cp\u003EOn a rocket, it is typically used on landers, but can be used as a lightweight lifter.\u003C/p\u003E\u003Cp\u003EOn a rocket, I highly recommend the nuclear engine over all else as an upper stage.\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-10-22T22:51:19Z","Content":"\n\u003Cp\u003EI have used it for just aesthetic purposes before it was the last stage so the transit vehicle had to be upside down but still.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-22T23:13:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wavechaser\u0022 data-cite=\u0022Wavechaser\u0022\u003E\u003Cdiv\u003E388s/390s (atsp/vacm), man!! [...] it\u0027s extremely fuel-effecient. In fact, it has the most ASL specific impulse among all the stock engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt also has a pretty underwhelming thrust-to-weight ratio, and the atmospheric ISP hardly ever matters (just look what happens to your engine\u0027s ISP during an ordinary launch). For most use cases, a lowly LV-T30 will serve you better. The aerospike really only shines if you try to get out of a deep, dense atmosphere; that is, Jool or Eve. Other than that, well, it looks sharp on spaceplanes.\u003C/p\u003E\n"},{"CreatedByName":"kujuman","CreatedById":28299,"CreatedDateTime":"2014-10-22T23:36:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EIt also has a pretty underwhelming thrust-to-weight ratio, and the atmospheric ISP hardly ever matters (just look what happens to your engine\u0027s ISP during an ordinary launch). For most use cases, a lowly LV-T30 will serve you better. The aerospike really only shines if you try to get out of a deep, dense atmosphere; that is, Jool or Eve. Other than that, well, it looks sharp on spaceplanes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI bet the aerospike would do nicely in some of the scaled-up Kerbin mods. Most of the time on lowly 600km radius Kerbin one\u0027s out of most of the atmosphere in maybe 20-30 seconds.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-10-23T00:59:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kujuman\u0022 data-cite=\u0022kujuman\u0022\u003E\u003Cdiv\u003EI bet the aerospike would do nicely in some of the scaled-up Kerbin mods. Most of the time on lowly 600km radius Kerbin one\u0027s out of most of the atmosphere in maybe 20-30 seconds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. The atmosphere is not only higher with Real Solar System- orbital velocity is a lot greater too. Which means, when running FAR (which will *drastically* increase your terminal velocity with an aerodynamically-shaped rocket: especially with any rocket large enough to make orbit in any of the RSS configs), you\u0027ll probably be wanting to start your gravity-turn fairly early: as you\u0027ll want to reduce the amount of velocity-change your upper stages will be responsible for...\u003C/p\u003E\u003Cp\u003EWhat that means is, having an engine that operates well in the lower atmosphere is a MAJOR advantage with RSS. Especially with spaceplanes (though you don\u0027t have much hope of building a successful one in anything besides the 6.4x scale config- and even then you\u0027ll need a LOT of drop-tanks), as your lift-to-drag ratio tends to better with the smaller Angles of Attack you can maintain in the lower atmosphere (and you want all your thrust directed at the horizon- not being used to directly hold your spaceplane up...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E Aerospike engines also work extremely will with rockets that have a *VERY* low TWR (less than 1.10 on liftoff), as they tend to spend a lot more time in the lower atmosphere. So, if you\u0027re building some massive beast of a rocket using Procedural Parts fuel tanks...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T01:04:35Z\u0022 title=\u002210/23/2014 01:04  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Apature rocket science","CreatedById":77886,"CreatedDateTime":"2014-10-23T01:00:40Z","Content":"\n\u003Cp\u003EThanks for clarifying that here\u0027s some rep\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-10-23T01:45:47Z","Content":"\n\u003Cp\u003EYou may like to look at tavert\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/45155-Mass-optimal-engine-type-vs-delta-V-payload-and-min-TWR\u0022 rel=\u0022external nofollow\u0022\u003EMass-optimal engine\u003C/a\u003E thread some time. It\u0027s a little out of date at the moment but the spreadsheet version is easy to update*.\u003C/p\u003E\u003Cp\u003EIn a lot of cases the aerospike (still) out-performs any other launch-engine for light to moderate payloads, \u003Cem\u003Eas long as you ignore costs\u003C/em\u003E! If your optimisation of choice is for payload-ratio/mass-efficiency then you\u0027ll be throwing away a lot of stages (=expensive engines) but you want to get the most from them before you do; that\u0027s where the aerospike comes into its own. Getting into orbit from Eve is sufficiently difficult that mass-efficiency has to be your first priority, regardless of cost, which is why it\u0027s particularly popular for missions there.\u003C/p\u003E\u003Cp\u003E[*I\u0027m playing with SSTOs (rockets that go to orbit and back without staging) at the moment so haven\u0027t bothered to update that spreadsheet myself. In the previous version of KSP (0.24.x) it was still true, however, that with staging for efficiency there were only three engines worth considering for almost any mission - LV-Ns, 48-7Ss or aerospikes. 909s were, except in a small exceptional set of circumstances, the \u0027wrong answer\u0027 every time.]\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2014-10-23T02:31:44Z","Content":"\n\u003Cp\u003EGoing to move this to a more appropriate forum.\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-10-23T02:45:06Z","Content":"\n\u003Cp\u003EAs others said, it\u0027s all about Eve. And now that I think about it, it is the only place I use the aerospikes.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-10-23T04:50:56Z","Content":"\n\u003Cp\u003EMy \u0022rocket engine only\u0022 spaceplane uses aerospikes. I have no complaints about them.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-10-23T04:59:44Z","Content":"\n\u003Cp\u003EThe high in-atmo Isp occasionally lets it give your craft a payload fraction advantage, and the high impact tolerance can be of use in landing. Before 0.24, it was arguably the highest performance lander engine, but with the extreme costs, meh Isp as a launcher engine, and Poodle buffed to almost the same TWR...\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2014-10-23T05:03:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frank_G\u0022 data-cite=\u0022Frank_G\u0022\u003E\u003Cdiv\u003EIt is powerful, efficient and lightweight for a rocket engine. If you like, take a look at my Mission to Eve (Link in the signature) which makes extensive use of the aerospike engine. Its pretty much one of the best engines you can put on a heavy lander in my opinion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not lightweight, that\u0027s one of it\u0027s problems. The LV-909 is 1 ton lighter and clustered 48-7s usually beat the aerospike for light spacecraft.\u003C/p\u003E\u003Cp\u003EIt is useful, though, but it\u0027s sort of a niche engine. It\u0027s a must for a return from Eve surface. It can be useful in medium sized spaceplanes as you aren\u0027t likely to stack anything below it, it\u0027s efficient, short (so it won\u0027t collide with the runway on take off) and packs a decent thrust. However, LV-909s, nukes and 48-7s will often beat it in efficiency, so if you can push your Ap outside the atmosphere on air breathers or if your craft is light enough that you don\u0027t need the extra thrust, you shouldn\u0027t use the aerospike.\u003C/p\u003E\u003Cp\u003EIt does have a lot of clearance for landing gear so it can be useful in some lander designs where the low thrust of the 909 or the nukes won\u0027t be enough and the Poodle or the KR-L2 don\u0027t fit.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-10-23T06:35:09Z","Content":"\n\u003Cp\u003EI don\u0027t find it very useful.\u003C/p\u003E\u003Cp\u003EFor those that said spaceplanes:\u003C/p\u003E\u003Cp\u003EBy the time you light your rockets in Space planes, you are so high up, it might as well be vacuum ISP\u003C/p\u003E\u003Cp\u003EFor those that say Eve:\u003C/p\u003E\u003Cp\u003EIts poor TWR means you need so many engines, that your dry weight increases so much that other engines are more efficient (48-7s clusters, LFBs, probably the buffed mainsails, etc).\u003C/p\u003E\u003Cp\u003EIt can\u0027t accept a stage below it, and its unique ISP properties are only useful deep in the atmosphere, that implies it should be used as part of a first stage- ie \u0022Boosters\u0022 - but it has a pretty bad TWR, which is not what you want in boosters.\u003C/p\u003E\u003Cp\u003EAs a result, I buffed it on my install to have a TWR equal to the LV-T45.\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-10-23T08:11:33Z","Content":"\n\u003Cp\u003EIts small size is a key factor. Full length rockets strapped to the back of spaceplanes look ugly; aerospikes look great.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-10-23T08:25:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EI don\u0027t find it very useful.\u003Cp\u003EFor those that said spaceplanes:\u003C/p\u003E\u003Cp\u003EBy the time you light your rockets in Space planes, you are so high up, it might as well be vacuum ISP\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt ain\u0027t all about efficiency. Sure, by the time I \u003Cem\u003Eneed\u003C/em\u003E rocketry, I\u0027m at 35,000m and Mach 5.5 and a wet sneeze can get me to orbit. But my spaceplanes have enough slack in their performance envelope that I don\u0027t need to sacrifice everything to efficiency. Aerospikes make good, high-efficiency orbital thrusters when I need them, but they also function well as atmospheric afterburners when I\u0027m playing around. 4g thrust at treetop height is way fun, and there\u0027s something to be said for orbital burns that don\u0027t take ten minutes to do.\u003C/p\u003E\u003Cp\u003EThe 48-7\u0027s give better efficiency, but the \u0027spikes give better \u003Cem\u003Eperformance\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-10-23T10:27:27Z","Content":"\n\u003Cp\u003EThe Aerospike is the engine of choice for small (1-kerbal) Eve landers. It could also be useful as a first-stage engine in ordinary rockets, but I never build small enough rockets to use it.\u003C/p\u003E\u003Cp\u003EIt\u0027s also a good lander/vacuum engine for situations, where the LV-909 is too small and the Poodle is too large. It has the same vacuum Isp as the other two engines, and a slightly higher TWR. I rarely use the Aerospike in this role, however, as I only the big non-nuclear vacuum engines in situations, where the engine has to fit inline in the stack.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-10-23T11:13:55Z","Content":"\n\u003Cp\u003EYeah, what Pecan said.\u003C/p\u003E\u003Cp\u003E When I go to design a rocket stage the first thing I do is plug the payload and desired DV into a spreadsheet to see which engine will yield the lowest total stage mass overall. A good deal of the time the aerospike comes out on top. \u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"lukeoftheaura","CreatedById":124144,"CreatedDateTime":"2014-10-23T11:29:27Z","Content":"\n\u003Cp\u003EIt\u0027s useful for high in atmospheres, when you don\u0027t want a big rocket and jets won\u0027t work.\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-10-23T12:14:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFor those that say Eve:\u003C/p\u003E\u003Cp\u003EIts poor TWR means you need so many engines, that your dry weight increases so much that other engines are more efficient (48-7s clusters, LFBs, probably the buffed mainsails, etc).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy signature disagrees with you. The low profile of the \u0027spike allows for a lower CG Eve lander. A lower CG lander means when you go to land on Eve\u0027s surface - where it is near impossible to find a decent flat landing area - your rocket doesn\u0027t tip over. What\u0027s the point of an ascent vehicle that is laying on its side?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T12:18:05Z\u0022 title=\u002210/23/2014 12:18  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by EdFred\u003C/strong\u003E\n\u003C/span\u003E\n"}]}