{"TopicId":88197,"ForumId":44,"TopicTitle":"Cannae/EmDrive","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-10-22T09:54:53Z","PageNum":35,"Articles":[{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-07-29T09:24:33Z","Content":"\n\u003Cp\u003EWhat if Emdrive is in fact a low-level, low-power Warp Drive? Eagleworks experiment with laser beam shooting through the cavity, suggested there migh be a weak warp bubble inside. Superluminal bubble of course wuld require negative energy, but i remember from earlier discussions about Alcubierre drive, that it is possible to build slower-than-light version that works without it. Maybe we stumbled upon it without trying? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-07-29T09:30:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003Ebeliefs - How Higgs boson was found?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince my background is actually in theoretical particle physics, I\u0027m going to answer this one directly.\u003C/p\u003E\u003Cp\u003ELots. Of hard. Work.\u003C/p\u003E\u003Cp\u003EI\u0027ve met at conferences both with people who crunched numbers, trying to figure out what mass range to look for Higgs, and experimentalists who actually contributed data excluding various possibilities. A lot of people were starting to grow skeptical of Higgs mechanism specifically, myself included, but we knew that \u003Cem\u003Esomething\u003C/em\u003E had to be going on. Because of gauge symmetries and what they have told us about electroweak bosons. Without another field, some kind of another field, there just had to be four kinds of photons, all massless. Instead, we observed photons, and three kinds of very massive bosons. The standard model said that the \u003Cem\u003Eonly\u003C/em\u003E way this can happen is if another field is involved. So people kept looking. People kept building larger and larger particle accelerators, until they finally found it.\u003C/p\u003E\u003Cp\u003EThis wasn\u0027t the only explanation. There were others, involving different fields with different mechanisms. Some of these predicting that we will not find the guilty boson. Some predicting that it will be a different set of bosons with different properties. But we were able to focus on several \u003Cem\u003Elikely\u003C/em\u003E explanations, and invest heavily into investigating these.\u003C/p\u003E\u003Cp\u003EThis was not about belief. Higgs boson was found because underlying symmetries said that something had to be there. These were the same underlying symmetries that tell us about conservation of energy and momentum. Because physics works. Because this is what generations of incredibly smart people, and scores of dedicated researchers have developed the science into. A tool for separating the improbable from effectively impossible.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETrue, but what if EmDrive inventor is that above average smart guy and those who are saying \u0022it is not working\u0022 are only those average smart scientists?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen I would have expected his explanation not to be total nonsense, which has now been universally accepted as being the case.\u003C/p\u003E\u003Cp\u003EWe still don\u0027t have a definitive explanation for why thrust has been measured in several independent experiments, some of which had pretty decent control. But we know a lot of explanations that simply do not work, because they make bad predictions in cases that are easy to test and disprove. Original concept for EMDrive is one of these. It came from very bad understanding of ordinary, undergraduate level electrodynamics. He did, however, happen to be one of these extremely rare misguided inventors that managed to build something which does something interesting entirely by accident.\u003C/p\u003E\u003Cp\u003EWhen people figure out exactly what\u0027s going on with EMDrive, I think the invention will live on. Potentially, as just a toy. So he has made a useful contribution, unlike all these crazy dudes on Youtube with their perpetual motion magnets that, \u0022Look, it\u0027s almost working.\u0022 This one is genuinely interesting.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEinstein - Quantum mechanics is certainly imposing. But an inner voice tells me that it is not yet the real thing. The theory says a lot, but does not really bring us any closer to the secret of the \u0022old one.\u0022 I, at any rate, am convinced that He does not throw dice.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd interestingly enough, he was absolutely right. It\u0027s a shame that he didn\u0027t live a few years longer. He would have been very happy with the way Quantum Field Theory turned out.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EWhat if Emdrive is in fact a low-level, low-power Warp Drive?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA warp drive can\u0027t generate a force, except by emitting gravity waves, which have the same power/thrust efficiency as photon drive. So a warp drive pushing against a plate would still require 300MW/N. EMDrive measurements are orders of magnitude lower.\u003C/p\u003E\u003Cp\u003EIf all that thing did was accelerate in free space, warp would be on the table. But it doesn\u0027t explain the force.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-29T09:37:26Z\u0022 title=\u002207/29/2015 09:37  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 29, 2015\u003C/time\u003E by K^2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-07-29T10:06:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EBecause of gauge symmetries and what they have told us about electroweak bosons. \u003Cstrong\u003EWithout another field, some kind of another field\u003C/strong\u003E, there just had to be four kinds of photons, all massless. Instead, we observed photons, and three kinds of very massive bosons. The standard model said that the \u003Cem\u003Eonly\u003C/em\u003E way this can happen is\u003Cstrong\u003E if another field\u003C/strong\u003E is involved. So people kept looking. People kept building larger and larger particle accelerators, until they finally found it.\u003Cp\u003EThis wasn\u0027t the only explanation. There were others, involving different fields with different mechanisms. Some of these predicting that we will not find the guilty boson. Some predicting that it will be a different set of bosons with different properties. But we were able to focus on several \u003Cem\u003Elikely\u003C/em\u003E explanations, and invest heavily into investigating these.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you please explain this... another field/another kind of field...\u003C/p\u003E\u003Cp\u003EDoes that means if you would found another source of electromagnetic field, that would be good enough to claim Higgs boson and gravitational fields are unnecessary?\u003C/p\u003E\u003Cp\u003EOr it means it HAS TO BE DIFFERENT kind of field (it can\u0027t be electromagnetic) and there is no other way?\u003C/p\u003E\u003Cp\u003ESource of that field shouldn\u0027t add any mass to observed particle, or I misunderstood that part of your post?\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd interestingly enough, he was absolutely right. It\u0027s a shame that he didn\u0027t live a few years longer. He would have been very happy with the way Quantum Field Theory turned out.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally you know what he would say? If you can read minds of the dead I can try read minds of the living \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThen I would have expected his explanation not to be total nonsense, which has now been universally accepted as being the case.\u003C/p\u003E\u003Cp\u003EWe still don\u0027t have a definitive explanation for why thrust has been measured in several independent experiments, some of which had pretty decent control. But we know a lot of explanations that simply do not work, because they make bad predictions in cases that are easy to test and disprove. Original concept for EMDrive is one of these. It came from \u003Cstrong\u003Every bad understanding of ordinary, undergraduate level electrodynamics\u003C/strong\u003E. He did, however, happen to be one of these extremely rare misguided inventors that managed to build something which does something interesting entirely by accident.\u003C/p\u003E\u003Cp\u003EWhen people figure out exactly what\u0027s going on with EMDrive, I think the invention will live on. Potentially, as just a toy. So he has made a useful contribution, unlike all these crazy dudes on Youtube with their perpetual motion magnets that, \u0022Look, it\u0027s almost working.\u0022 This one is genuinely interesting.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd you never thought that he could made that \u0022mistake\u0022 deliberately, because that way he don\u0027t have to explain this groundbreaking and negating the most popular theories experiment? \u003C/p\u003E\u003Cp\u003EI am pretty sure that if he would try to use some of his own hypothesis, that would explain how this device works and would go against accepted branches of physics then... \u003C/p\u003E\u003Cp\u003ENASA would never touch this device and we could only read about EmDrive on some crazy sites about electromagnetism and perpetual motion magnets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-29T13:38:14Z\u0022 title=\u002207/29/2015 01:38  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 29, 2015\u003C/time\u003E by Darnok\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-07-29T14:04:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOne of the biggest problems with people of average intelligence, or bellow it, is that they think that \u003Cem\u003Eeveryone\u003C/em\u003E is of the same inteligence as they are. Part of the problem is that when people don\u0027t understand something, they can\u0027t gauge just how incompetent they are at the subject.\u003C/p\u003E\u003Cp\u003ESo when you say that scientists aren\u0027t smarter than anyone else, I have bad news for you.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you said intelligence.. I think you want to said \u0022knowledge in the field of this discussion\u0022\u003C/p\u003E\u003Cp\u003EWe are not sure how to measure intelligence yet, there are some IQ test, but they depends on how much practice you got in similar actions. I can get really good scores, but a monkey can beat me in many of those single test if he has practice.\u003C/p\u003E\u003Cp\u003EIs like play a video game, if we are good in some respective video game does not means we are more intelligent or smart than everybody else.\u003C/p\u003E\u003Cp\u003EIts prove that our brain dint change much in the last 50000 years, if someone born now and send him 30000 years to the past, he will not be more intelligent than any other guy of that time. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI like how EmDrive is going, because first someone made observation and invention, then he is trying to use science to explain that. \u003C/p\u003E\u003Cp\u003EI dislike how some people are trying to make science in opposite direction... they first write something on paper and then trying to convince others they are right, without single evidence!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDiscover something by observation or error and then trying to understand the physsics behind that phenomenon is also science.\u003C/p\u003E\u003Cp\u003EBut if you create a theory from nothing without basis or a math path that guide you to that, then it does not look like science.\u003C/p\u003E\u003Cp\u003Esaying this, I really dont know how this EM theory born and what are their basis, the only that I know is that seems to violates thermodynamics.\u003C/p\u003E\n"},{"CreatedByName":"sjwt","CreatedById":9268,"CreatedDateTime":"2015-07-29T15:22:12Z","Content":"\n\u003Cp\u003EAnd I\u0027m jsut saying that we could all be better off if we stayed on topic and away from other aspects of this conversation below, lest the power of MOD is applied with an application of thread lock.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-07-29T16:03:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EBoth of which are in contradiction with GR, which is direct mathematical consequence of the gauge symmetries in question. In other terms, their violations are simply hidden under more math.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom the EMdrive wiki (\u003Ca href=\u0022http://emdrive.wiki/Energy_Conservation\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://emdrive.wiki/Energy_Conservation\u003C/a\u003E)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EFree-energy is a just a consequence of incorrectly assuming that constant acceleration will result from constant input power\u003Cp\u003EThis \u0022paradox\u0022 is no longer a proper paradox (a statement that apparently contradicts itself and yet might be true), but like most paradoxes in Physics it just a result of unwarranted assumptions. It is a misunderstanding that arises from making the assumptions that\u003C/p\u003E\u003Cp\u003E1) one can have constant acceleration at constant power ad infinitum and\u003C/p\u003E\u003Cp\u003E2) that one can ignore the 1st and 2nd laws of thermodynamics.\u003C/p\u003E\u003Cp\u003EInitially, that the acceleration cannot be constant at constant power may not be obvious. But once this becomes obvious (and @frobnicat made an excellent argument to explain this) to continue to use these assumptions becomes unwarranted and eventually it becomes a straw man argument. The so-called typical \u0022attacking a straw man\u0022 argument creates the illusion of having completely refuted or defeated an opponent\u0027s proposition (that there can be an EM Drive) by replacing it with a different proposition (i.e., \u0022stand up a straw man\u0022) (that EM Drive implies constant acceleration at constant power) and then to refute or defeat that false argument (\u0022knock down a straw man\u0022) (that the EM Drive necessarily implies free energy) instead of the original proposition.\u003C/p\u003E\u003Cp\u003EThis is not a debunking proof, all that the \u0022paradox\u0022 proves, is that one cannot have free energy: that the assumption of constant acceleration at constant power is untenable. It certainly does not prove that there cannot be an EM Drive that respects the 1st and 2nd Law of Thermodynamics. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, is there somewhere in the gauge symmetries or GR that REQUIRES constant acceleration for constant power?\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2015-07-29T16:27:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sjwt\u0022 data-cite=\u0022sjwt\u0022\u003E\u003Cdiv\u003E lest the power of MOD is applied with an application of thread lock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that would be a mistake. The things K^2 are saying, need to be said to the general science loving public.\u003C/p\u003E\u003Cp\u003EWe should be thankful he\u0027s taking the time to say them...again.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-07-29T16:57:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSK\u0022 data-cite=\u0022KSK\u0022\u003E\u003Cdiv\u003EIt\u0027s not a boundary that\u0027s limited to this thread either but to be fair that\u0027s because a lot of the threads on this forum are due to curious people asking Big Questions. The problem is that the answer (or partial answer) to those Big Questions generally depends on complicated maths which I\u0027m guessing most folks here - myself included by the way - just don\u0027t understand. At which point, the conversation drifts into arguments over more-or-less incorrect analogies and usually culminates in the scenario that K^2 outlines above.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept that it isn\u0027t just this people on this board, and it isn\u0027t just people who are \u0022bad at math.\u0022 There are real scientists who are also backing this, and here is where this discussion started to get strange. I don\u0027t know for sure if this was someone putting words into K^2\u0027s mouth or not, but it began to sound like K^2 is not only smarter than all of us, but smarter than the scientists defending the EMdrive as well. But when challenged to go to the NASA boards (or elsewhere) to put the argument to rest, K^2 simply said, \u0022The burden of proof is on them, not me.\u0022 So, to summarize the speculation, on this board, where K^2\u0027s intellectual superiority is ensured, wasting tons of posts calling all of us idiots and using examples we can\u0027t begin to comprehend is perfectly fine. But a debate with other math wizards who are defending the EMdrive and are capable of comprehending what K^2 is talking about, is magically a waste of time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-29T17:21:19Z\u0022 title=\u002207/29/2015 05:21  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 29, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-07-29T17:28:48Z","Content":"\n\u003Cp\u003EAll this arguing is why I avoid paying attention to the actual theory side of the EM drive. Tons of theories floating round, a lot of which don\u0027t agree with physics.\u003C/p\u003E\u003Cp\u003EIn reality all we know is this:\u003C/p\u003E\u003Cp\u003ESmall amount of thrust detected.\u003C/p\u003E\u003Cp\u003ENumerous experiments all detect similar thrust.\u003C/p\u003E\u003Cp\u003EThe cause, whether an error or not, has yet to be found.\u003C/p\u003E\u003Cp\u003EMore testing needed.\u003C/p\u003E\u003Cp\u003EAll we can do is wait for more detailed tests to be run.\u003C/p\u003E\n"},{"CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-07-29T18:14:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003EAll this arguing is why I avoid paying attention to the actual theory side of the EM drive. Tons of theories floating round, a lot of which don\u0027t agree with physics.\u003Cp\u003EIn reality all we know is this:\u003C/p\u003E\u003Cp\u003ESmall amount of thrust detected.\u003C/p\u003E\u003Cp\u003ENumerous experiments all detect similar thrust.\u003C/p\u003E\u003Cp\u003EThe cause, whether an error or not, has yet to be found.\u003C/p\u003E\u003Cp\u003EMore testing needed.\u003C/p\u003E\u003Cp\u003EAll we can do is wait for more detailed tests to be run.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. People are jumping to conclusions way too fast and obviously basing them on sometimes unrealistic expectations from what is still essentially a curiosity. It\u0027s super far too early to try to deduct new physics from this.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2015-07-29T18:21:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aanker\u0022 data-cite=\u0022Aanker\u0022\u003E\u003Cdiv\u003EThis. People are jumping to conclusions way too fast and obviously basing them on sometimes unrealistic expectations from what is still essentially a curiosity. It\u0027s super far too early to try to deduct new physics from this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. Until we have a clearer idea of what is even happening with the drive, we can\u0027t jump to any conclusions.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-07-29T18:32:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CalculusWarrior\u0022 data-cite=\u0022CalculusWarrior\u0022\u003E\u003Cdiv\u003EExactly. Until we have a clearer idea of what is even happening with the drive, we can\u0027t jump to any conclusions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll we know is it has been reported to make a tiny thrust without using any fuel, just electricity, and that a professional has tried to find external causes for the thrust and has been unsuccessful so far, though he did find the control also made thrust, so I think they are still not sure which direction to point the thing for optimal effect.\u003C/p\u003E\u003Cp\u003EOh and we know it is essentially just a lidded copper bucket with a microwave oven stuck to it, any of us could build it in the garage/shed/kitchen, but we\u0027d have no means to measure the thrust.\u003C/p\u003E\u003Cp\u003EAs to why it makes a thrust, no one knows, the explanation from its creator wouldn\u0027t be out of place in a 70\u0027s sci-fi B movie, maybe we\u0027ll never know and this will magically stop working just like room temperature fusion power.\u003C/p\u003E\u003Cp\u003EJust have to wait and see..\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-07-29T18:46:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003ESo, is there somewhere in the gauge symmetries or GR that REQUIRES constant acceleration for constant power?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, specifically, the Poincare symmetry group. It requires proper acceleration to remain constant, of course. Otherwise, you have a preferred coordinate system. Coordinate acceleration will scale with boosts, but that\u0027s to be expected. A conventional rocket under constant thrust will not have constant coordinate acceleration, either. It will have constant proper acceleration.\u003C/p\u003E\u003Cp\u003EThis is a fundamental problem with EM drive that you can\u0027t just sweep under a rug. Anything that violates momentum conservation in one coordinate system necessarily violates energy conservation in another.\u003C/p\u003E\u003Cp\u003EBy the way, this is also taught in undergraduate courses. I don\u0027t know who\u0027s writing that wiki, but they have zero training. There are real scientists hypothesizing about EMDrive, but they definitely aren\u0027t the ones maintaining that wiki. I wish people would stop quoting it as facts.\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-07-29T19:02:08Z","Content":"\n\u003Cp\u003EI\u0027m part of the wiki team (though have been away for a month) and our job is not to add content, our job is to summarize information provided within the NASA forum threads. Most of us start in the early pages and advance through, collecting and adding data/sources as we go. Unfortunately this might mean that after making a lovely page on some section of information, we then need to delete most of it a day later when we get to the page explaining how all of that info was the result of a math error on someone\u0027s part and is not valid for discussion. Further unfortunately, the discussion happens faster than we can analyze. So we are always behind.\u003C/p\u003E\u003Cp\u003EIt spawned out of a desire to provide a quick link for people to point to when old arguments came up anew. One of the most common posts in those threads is \u0022I don\u0027t have time to read 500 pages of text, but I just wanted to let you guys know that the thrust is clearly thermal effects. You know what that is right? It gets hot and moves air. Simple!\u0022 or something like that. Then they go on to get all grumbly and want to talk out every point just to make sure we truly understand that it is thermal effects. If someone says that, they can be provided a link to the page explaining how thermal effects has been pretty heavily ruled out as the source of the problem. If they have a reason to believe that the thrust is the result of thermal effects and their thought is not addressed by that page, people are happy to discuss it. But honestly, I\u0027d probably say around 1/6th of the pages of that thread discussion are constantly refuting the idea that it is thermal effects, starting over every time.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-07-29T19:28:10Z","Content":"\n\u003Cp\u003EFair. But that does lead to the situation I\u0027m mentioning, where people just point at the wiki, as if it somehow has facts. A lot of it is trivially and objectively wrong.\u003C/p\u003E\u003Cp\u003EThere might be a use for a summary log, but in terms of what should be exposed to more casual readers, there needs to be far more moderation. Like that statement above that acceleration can simply drop off at higher speeds, preventing energy conservation violations. It\u0027s absurd. And anyone with the most basic understanding of relativity - even just plain old Galilean Relativity - would instantly know it to be so. But it\u0027s on wiki, and it confuses people who don\u0027t know better.\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-07-29T19:34:00Z","Content":"\n\u003Cp\u003ETrue, but most of the people working on the wiki are doing it because we cannot help the technical/math/physics discussion due to being untrained in those topics. So we are hoping to streamline the thread as much as possible to encourage more of that same discussion.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-07-29T20:24:30Z","Content":"\n\u003Cp\u003EMaybe the wiki could have a huge disclaimer that \u0022the content within this page is just collected reposts of what random guys on an internet forum say, and is certainly riddled with basic physics errors.\u0022 ?\u003C/p\u003E\n"},{"CreatedByName":"Thomassino","CreatedById":137899,"CreatedDateTime":"2015-07-29T20:58:49Z","Content":"\n\u003Cp\u003EI think EM/Cannae drive can be easily explained by radiation pressure from its magnetron. In principle, EM drive works as an inverted solar sail. No energy conservation defying and no witchcraft.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-07-29T21:35:47Z","Content":"\n\u003Cp\u003EMaybe we should just start a Kickstarter campaign to build Emdrive into a Cubesat and put it in orbit. If it flies away, we would know 100% it works. Then we could start attaching unholy progenies of metal drums and microwave heaters to our space probes and happily explore our Solar system. And scientists could keep to argue about what is causing it to work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-07-29T21:57:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EMaybe we should just start a Kickstarter campaign to build Emdrive into a Cubesat and put it in orbit. If it flies away, we would know 100% it works. Then we could start attaching unholy progenies of metal drums and microwave heaters to our space probes and happily explore our Solar system. And scientists could keep to argue about what is causing it to work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBasically, this. All these efforts to answer the questions of \u0022how\u0022 and \u0022why\u0022 are taking resources better directed at answering the question \u0022whether\u0022. If it works, it works, and proper amounts of resources can be directed to the \u0022how\u0022 and \u0022why\u0022. If it doesn\u0027t, it doesn\u0027t, and scientists can keep taking their sweet time searching for what it was that made the anomalous thrust in testing.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-07-29T22:42:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EYes, specifically, the Poincare symmetry group. It requires proper acceleration to remain constant, of course. Otherwise, you have a preferred coordinate system. Coordinate acceleration will scale with boosts, but that\u0027s to be expected. A conventional rocket under constant thrust will not have constant coordinate acceleration, either. It will have constant proper acceleration.\u003Cp\u003EThis is a fundamental problem with EM drive that you can\u0027t just sweep under a rug. Anything that violates momentum conservation in one coordinate system necessarily violates energy conservation in another.\u003C/p\u003E\u003Cp\u003EBy the way, this is also taught in undergraduate courses. I don\u0027t know who\u0027s writing that wiki, but they have zero training. There are real scientists hypothesizing about EMDrive, but they definitely aren\u0027t the ones maintaining that wiki. I wish people would stop quoting it as facts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut if the drive relies on a preferred coordinate system, and that coordinate system can be identified as the presence of (low vacuum particles/planetary magnetic field/other effect translatable to at least near earth space) then the EM drive can be said to both work and be useful, without violating GR. (like the electromagnetic tether, it needs to push off something, but not nessisarally something solid)\u003C/p\u003E\u003Cp\u003EThis drive can only work if it doesnt violate conservation of momentum, but it can avoid that violation in exotic ways and still be \u0022real\u0022.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-07-29T22:59:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EBut if the drive relies on a preferred coordinate system [...] then the EM drive can be said to both work and be useful, without violating GR.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat IS a violation of GR. That IS a violation of the symmetry. Laws of physics must be the same under any local choice of coordinate systems. Or in more precise terms, Lagrangian is invariant under continuous local Poincare group of transformations. If things work differently in different coordinate systems, you\u0027ve broken local symmetry, general relativity, special relativity, and conservation laws for energy, momentum, and angular momentum.\u003C/p\u003E\u003Cp\u003EThis isn\u0027t even science. It\u0027s just math. Science is the part that tells you that this is bad.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-07-29T23:15:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thomassino\u0022 data-cite=\u0022Thomassino\u0022\u003E\u003Cdiv\u003EI think EM/Cannae drive can be easily explained by radiation pressure from its magnetron. In principle, EM drive works as an inverted solar sail. No energy conservation defying and no witchcraft.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen its just a photon drive, which can already be done more efficiently by putting a really big flashlight on your spacecraft. Power requirement for even one measly millinewton of thrust from a photon drive is enormous.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-07-29T23:21:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EThat IS a violation of GR. That IS a violation of the symmetry. Laws of physics must be the same under any local choice of coordinate systems. Or in more precise terms, Lagrangian is invariant under continuous local Poincare group of transformations. If things work differently in different coordinate systems, you\u0027ve broken local symmetry, general relativity, special relativity, and conservation laws for energy, momentum, and angular momentum.\u003Cp\u003EThis isn\u0027t even science. It\u0027s just math. Science is the part that tells you that this is bad.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf pushing off something (not just empty space, actually something) is a violation of GR, I\u0027m not sure how useful GR really is. (but you deleated the part of my quote that explains what I\u0027m talking about)\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-07-29T23:47:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EIf pushing off something\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe are \u003Cem\u003Especifically\u003C/em\u003E discussing scenarios where you are not pushing off anything.\u003C/p\u003E\u003Cp\u003EIf you are pushing from something, there is momentum flux wherever the force is applied. This is precisely what I expect to be happening. The question is, what is it pushing from?\u003C/p\u003E\u003Cp\u003E1) Something massless: Efficiency will be equal to that of a photon drive, which contradicts measurements.\u003C/p\u003E\u003Cp\u003E2) Something massive and remote: This requires a massless mediator boson, which we ought to have discovered by now.\u003C/p\u003E\u003Cp\u003E3) Something massive and proximate: There will be a detectable exhaust.\u003C/p\u003E\u003Cp\u003ESo either efficiency measurements are wrong, which is very unlikely, there is a completely new type of force, which has infinite range and has remained undetected, even more unlikely. Or there is an exhaust/recoil which we simply haven\u0027t found yet. That\u0027s what we should focus on for now.\u003C/p\u003E\u003Cp\u003EUnless the whole thing is a measurement error, of course. The odds of that being the case keep decreasing with each experiment, but I\u0027d still call it at least even odds with this being some form of an exotic ion drive.\u003C/p\u003E\n"}]}