{"TopicId":88207,"ForumId":21,"TopicTitle":"UKSN Land Pack","CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-10-22T13:14:43Z","PageNum":1,"Articles":[{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-10-22T13:14:43Z","Content":"\n\u003Cp\u003EI promised more stuff for the skunkworks, and then I went and only added a puny fighter. Well, I was working on these on the background:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zCwb5Di.png\u0022 alt=\u0022zCwb5Di.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFrom left to right, the Main Battle Tank \u0022\u003Cem\u003EDefiant\u003C/em\u003E\u0022, the Multipurpose Troop Transport \u0022\u003Cem\u003EReliant\u003C/em\u003E\u0022 carrying a couple of missile cells, and the light APC \u0022\u003Cem\u003ESwift\u003C/em\u003E\u0022. But wait, there is more! The \u003Cem\u003EReliant\u003C/em\u003E MTT had already deployed a few defense turrets, both laser (note they are kethane-powered, so chemical lasers) and conventional, around KSC:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/llRRYJW.png\u0022 alt=\u0022llRRYJW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, let\u0027s take things one at a time. First, the big guns, the tank. There is little to say about it, other than it sports the obvious main weapon, plus a couple of .50 cals as light armament and two countermeasures pods to lay some some smoke around. That works out much cooler than I thought, and if it confuses antitank missiles, all the better. Single pilot and no seats inside, but the door to the interior actually works, and I\u0027m very pleased with how it looks. Here, some pics because they are better than words!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y96rW7K.png\u0022 alt=\u0022Y96rW7K.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LqO0IiF.png\u0022 alt=\u0022LqO0IiF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I should talk more about the (probably) most interesting file. The \u003Cem\u003EReliant\u003C/em\u003E Land Defense Package comes as a trailer with a lot of different modules, both offensive and defensive:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MjYYVql.png\u0022 alt=\u0022MjYYVql.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe trailer on front acts as a troop transport and ammunition depot for the turrets, while it tows the actual combat modules. There you can see the four I include: front to back, they are the sidewinder VLS pod for atmospheric attack, the similar non-atmospherics VLS missile pod with KV-1\u0027s which is probably not very useful on kerbin (minimum effective distance of 2.5kms, we\u0027ll see how it does in vacuum compared to the Sidewinder\u0027s .5km minimum firing distance in atmo); and then afterwards the two defense turrets: the kethane-powered laser defense system (which combined with a kethane architecture, is sustainable offworld), and the more conventional CIWS. You can configure the load you take out of the SPH depending on the mission that way. Note how the modules are symmetrical and have a docking port right under the center of mass: I plan to put some of these on rockets. You would need select root for that, but totally doable on your own. The thing is, I think I am working at some point on a \u0022cargo-something\u0022 that can carry the other vehicles around, so I\u0027ll get back to you on that on the following weeks. Also, while the wheels of the modules start unpowered and locked, I\u0027ve set up action groups 1 and 2 to toggle front/rear drive on each of them, so they can perfectly move around by themselves, then dock to form a defensive battery. Plus, I added lots of ammo to the roof of the truck after seeing what a gun took to take a single missile out.\u003C/p\u003E\u003Cp\u003EAnd last but not least, the APC:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XlzHYZc.png\u0022 alt=\u0022XlzHYZc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Gzn5uDI.png\u0022 alt=\u0022Gzn5uDI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith light armament, and light in general, it is incredibly fun to drive around, and the missiles give it a decent punch until they run out, while the gatling is just fun to use. You also get a cockpit with good view, another with a view of the passenger compartment, and it sports an additional four seats in there. Mind you, the only way to get into and out of those seats is a bit cheaty, and the front cockpit is accessible from the ground only now thanks to the crew transfer thingy. To get in the seats, you click with the kerbal on the outside and they magically teleport in. To get out, they magically teleport to the roof of the vehicle. Works for me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyhow, here are all the craft files, enjoy!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/d6a12m9iiscn16h/UKSN\u002BMain\u002BBattle\u002BTank.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003EDefiant\u003C/em\u003E-Class Main Battle Tank\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/ujr2c5pypkqj3dt/UKSN\u002BLand\u002BDefense\u002BPackage.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003EReliant\u003C/em\u003E-Class Multipurpose Troop Transport\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/5fwjd77j4nfj8fq/UKSN\u002BAPC.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003ESwift\u003C/em\u003E-Class Armored Personnel Carrier\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERune. Now is that enough boom to keep you happy for a while? Probably not, but one does one\u0027s best.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T13:20:11Z\u0022 title=\u002210/22/2014 01:20  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"soulreaver1981","CreatedById":38542,"CreatedDateTime":"2014-10-22T13:38:08Z","Content":"\n\u003Cp\u003ECool crafs rune.\u003C/p\u003E\u003Cp\u003Ei need to start playing with mods agian\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-10-22T13:52:47Z","Content":"\n\u003Cp\u003Enice little tanks! They look very functional.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-10-22T17:13:41Z","Content":"\n\u003Cp\u003EGlad you guys like them!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zekes\u0022 data-cite=\u0022zekes\u0022\u003E\u003Cdiv\u003Enice little tanks! They look very functional.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConsidering that with BD pretty much all armor is useless (even you behemoths would jump when hit by a missile, and once you jump you are toast once you come down), I went for a limited part count (which I blew on the Land Package, 300 parts in all) and aesthetics, keeping the weight low in number and position, so they are quite sporty. There are a number of sacrificial part that could perhaps stop a few bullets before something crucial breaks, but that\u0027s about it. And they allow you to have some fun and take cool screenies with several of them on screen, that\u0027s nice about them.\u003C/p\u003E\u003Cp\u003ERune. They do look the part, too.\u003C/p\u003E\n"},{"CreatedByName":"ZLM-Master","CreatedById":185115,"CreatedDateTime":"2014-10-22T17:16:41Z","Content":"\n\u003Cp\u003ENice job !\u003C/p\u003E\u003Cp\u003EThe small one is too cute ! Congratz !\u003C/p\u003E\n"},{"CreatedByName":"CDK","CreatedById":114733,"CreatedDateTime":"2014-10-26T00:55:35Z","Content":"\n\u003Cp\u003EWhat mods does it require?\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-10-26T13:34:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CDK\u0022 data-cite=\u0022CDK\u0022\u003E\u003Cdiv\u003EWhat mods does it require?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust BD Armory, I like to keep things simple. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CDK","CreatedById":114733,"CreatedDateTime":"2014-10-26T21:04:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EJust BD Armory, I like to keep things simple. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see in the pictures Kethane tanks.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2014-10-26T21:14:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CDK\u0022 data-cite=\u0022CDK\u0022\u003E\u003Cdiv\u003EI see in the pictures Kethane tanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh yeah! Almost forgot, sorry. Yes, the trailer thingy has some kethane parts, specifically the laser battery if kethane-powered with four small tanks and two generators. It was MUCH more compact than trying to feed that laser with solar panels. The APC and the tank don\u0027t carry anything weird.\u003C/p\u003E\u003Cp\u003ERune. But that \u003Cem\u003Eshould\u003C/em\u003E really be it, I held from putting KAS container and such.\u003C/p\u003E\n"}]}