{"TopicId":88234,"ForumId":44,"TopicTitle":"Stopping All Movement: Possible?","CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2014-10-22T19:22:58Z","PageNum":1,"Articles":[{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2014-10-22T19:22:58Z","Content":"\n\u003Cp\u003EI fear I do not have the words to properly format my question/thought. It requires me to know more about physics then I do.\u003C/p\u003E\u003Cp\u003EThink about the known universe. Everything is is motion. We have spinning planets circling around stars that are in turn traveling in a circular pattern around in a galaxy which is tugging on other galaxy\u0027s with gravitational forces. Everything is moving. You put a spacecraft between earth and the moon. Cancel you momentum so that you are not moving. But you are still moving. If you go by the moon and the earth as anchor points, you are standing still in space. But the Earth and moon are spinning around the sun, so, to that effect you are still moving.\u003C/p\u003E\u003Cp\u003ESo what if you could stop? I suppose you would need some sort of anchor point or instrumentation to judge if we were actually stopped. Let\u0027s say something of that nature existed. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EWould it be possible to stop all movement?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHow much energy might this take?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHow might forces like gravity effect an object that is \u0022stopped\u0022 in space?\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-10-22T19:28:32Z","Content":"\n\u003Cp\u003EIt is not possible to \u0022actually stop\u0022. There is no \u0022anchor point\u0022 that is special or more valid than any other arbitrarily choosen \u0022anchor point\u0022\u003C/p\u003E\u003Cp\u003EYou base your whole question on the assumtion: \u0022Let\u0027s say something of that nature existed.\u0022\u003C/p\u003E\u003Cp\u003EYour question is like: Lets assume there lives a person on pluto. How old is he?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T19:30:48Z\u0022 title=\u002210/22/2014 07:30  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by N_las\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2014-10-22T19:35:32Z","Content":"\n\u003Cp\u003EIt is not possible to \u0022actually stop\u0022. [2]\u003C/p\u003E\u003Cp\u003EIn a different way, this is because you can\u0027t change any object\u0027s temperature to absolute zero.\u003C/p\u003E\n"},{"CreatedByName":"_The_Burn_","CreatedById":64617,"CreatedDateTime":"2014-10-22T20:14:18Z","Content":"\n\u003Cp\u003EMovement is relative to a certain point, with out that certain point movement is undefined and invalid. Say you had a certain theoretical point, and that we mapped every object in the universe, and things were at absolute zero (So molecules would stop vibrating and moving around), you could stop all movement. Of course, everyone would be dead as a result of the conditions, but it could be done. The amount of energy required would be massive, and storing all the energy (you have to store it because energy cannot be created or destroyed) would be hard without resulting in heat or movement. If everything stopped moving, I imagine everything would clump together in the middle of the universe (which would temporarily create movement and heat). Even doing all this, I\u0027m pretty sure subatomic particles cannot be stopped (correct me if I\u0027m wrong) All this would become irrelevant if a single particle was discovered that was moving. You can theoretically stop all movement in a system relative to a certain point, but it becomes exponentially difficult as you increase the size of the system, and stopping all movement in the universe would be near impossible.\u003C/p\u003E\n"},{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2014-10-22T20:18:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022N_las\u0022 data-cite=\u0022N_las\u0022\u003E\u003Cdiv\u003EIt is not possible to \u0022actually stop\u0022. There is no \u0022anchor point\u0022 that is special or more valid than any other arbitrarily choosen \u0022anchor point\u0022\u003Cp\u003EYou base your whole question on the assumtion: \u0022Let\u0027s say something of that nature existed.\u0022\u003C/p\u003E\u003Cp\u003EYour question is like: Lets assume there lives a person on pluto. How old is he?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for your contribution.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-10-22T20:40:11Z","Content":"\n\u003Cp\u003EThere actually is a special inertial reference frame in the visible universe: that of the cosmic microwave background radiation. It\u0027s known as the cosmic rest frame. (Relativity asserts that the laws of physics are the same in all reference frames, not that there is no special reference frame in our existing cosmology.) The Earth is currently moving at something like 370 km/s relative to the cosmic rest frame. This manifests as a dipole in the CMB: it\u0027s hotter in one half of the sky than the other because of Doppler effects. Note though that even if you were to zero your velocity relative to the cosmic rest frame, you\u0027d still see Doppler effects due to the expansion of space.\u003C/p\u003E\n"},{"CreatedByName":"bdito","CreatedById":112760,"CreatedDateTime":"2014-10-22T20:42:37Z","Content":"\n\u003Cp\u003EIt might be possible for a split second, but after that gravity from something (even if it\u0027s extremely minute) would cause you to move.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-22T20:46:21Z","Content":"\n\u003Cp\u003EPhysics recognises no state of \u0022absolute rest\u0022, all motion is relative to some frame of reference. That idea dates back to the time of Galileo and Newton. That said, if you do want to pick a reference frame to stop relative to, the Cosmic Microwave Background seems like a sound choice. The Milky Way is doing something like 400 km/s relative to that, so you\u0027re going to need a big rocket!\u003C/p\u003E\u003Cp\u003EWith a big enough rocket, you could get your bulk motion through space pretty slow, but never zero. First up gravity will still affect you, but that\u0027s easily dealt with, just find somewhere where there\u0027s zero net gravitational force. Next is radioactive decay, the recoil of which would push you slightly. That\u0027s a random process so you can\u0027t predict it, and the light speed limit means you can\u0027t instantly compensate for it. You could though in principle purge all radioisotopes leaving only stable ones.\u003C/p\u003E\u003Cp\u003EElectromagnetic radiation is also quantised, and statistical fluctuations will mean you will never radiate quite isotropically and thus there will be some tiny thrust. This I can see no way to deal with; cooling an object to absolute zero so it gives off no electromagnetic radiation is not possible.\u003C/p\u003E\u003Cp\u003EThen quantum mechanics really weighs in. The more certain an object\u0027s momentum - which relates directly to its speed if the mass is fixed - the less certain its position. So if the speed is extremely precise, which \u0022virtually zero\u0022 qualifies as, the position is extremely imprecise. There comes a point where to get the speed closer to zero the position could be anywhere in the observable universe and things frankly break down.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2014-10-22T20:46:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022N_las\u0022 data-cite=\u0022N_las\u0022\u003E\u003Cdiv\u003EIt is not possible to \u0022actually stop\u0022. There is no \u0022anchor point\u0022 that is special or more valid than any other arbitrarily choosen \u0022anchor point\u0022\u003Cp\u003EYou base your whole question on the assumtion: \u0022Let\u0027s say something of that nature existed.\u0022 \u003Cem\u003E-snip- \u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMakes sense, but when we\u0027re being told that Earth is moving through the solar system at __ km/s, and the solar system is moving through the galaxy at __ km/s, the galaxy is moving through the local group at __ km/s, etc, etc, what \u0022anchor point\u0022 are these numbers based off of? And then, what if your speed was actually 0 m/s relative to that object?\u003C/p\u003E\u003Cp\u003EWould it be possible to say an object in geosynchronous orbit around something would have a speed of 0 m/s relative to that object? Like a satellite that stays relative to the Earth, neither getting further nor closer to the Earth. Relative to Earth, it\u0027s not moving, but relative to literally anything else, it\u0027s moving.\u003C/p\u003E\u003Cp\u003E(Sorry if none of this makes sense)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T20:49:09Z\u0022 title=\u002210/22/2014 08:49  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Slam_Jones\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-22T20:54:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Slam_Jones\u0022 data-cite=\u0022Slam_Jones\u0022\u003E\u003Cdiv\u003EMakes sense, but when we\u0027re being told that Earth is moving through the solar system at __ km/s, and the solar system is moving through the galaxy at __ km/s, the galaxy is moving through the local group at __ km/s, etc, etc, what \u0022anchor point\u0022 are these numbers based off of?\u003C/div\u003E\u003C/blockquote\u003ECar driving on the road, Earth moving through the solar system, Sun orbiting the galaxy - in all cases the speed is the first objective relative to the second.\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2014-10-22T21:00:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ECar driving on the road, Earth moving through the solar system, Sun orbiting the galaxy - in all cases the speed is the first objective relative to the second.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESimple enough. Follow-up question, however: what would be the largest objective to compare speeds to? The Milky Way galaxy? Local group? Observable universe?\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-10-22T21:03:33Z","Content":"\n\u003Cp\u003EIf you make it be absolute zero nothing moves but that is not possible so I doubt it is possible to stop all movement because at heat even one nanokelvin (barely above absolute zero) it still moves. Not possible.\u003C/p\u003E\n"},{"CreatedByName":"N_las","CreatedById":31280,"CreatedDateTime":"2014-10-22T21:35:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EThere actually is a special inertial reference frame in the visible universe: that of the cosmic microwave background radiation. It\u0027s known as the cosmic rest frame. (Relativity asserts that the laws of physics are the same in all reference frames, not that there is no special reference frame in our existing cosmology.) The Earth is currently moving at something like 370 km/s relative to the cosmic rest frame. This manifests as a dipole in the CMB: it\u0027s hotter in one half of the sky than the other because of Doppler effects. Note though that even if you were to zero your velocity relative to the cosmic rest frame, you\u0027d still see Doppler effects due to the expansion of space.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis frame isn\u0027t special either. There is nothing about the \u0022cosmic rest frame\u0022 that suggest that it is more special than my moms frame. What if \u0022the whole cosmos\u0022 is moving at a certain velocity?\u003C/p\u003E\u003Cp\u003EBeing at rest in regards to the cosmic background ratiation isn\u0027t \u0022more\u0022 at rest than being at rest in regards to some random galaxy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T21:37:16Z\u0022 title=\u002210/22/2014 09:37  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by N_las\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-22T21:37:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Slam_Jones\u0022 data-cite=\u0022Slam_Jones\u0022\u003E\u003Cdiv\u003ESimple enough. Follow-up question, however: what would be the largest objective to compare speeds to? The Milky Way galaxy? Local group? Observable universe?\u003C/div\u003E\u003C/blockquote\u003ECentre of mass of the observable universe, I suppose. Which I would guess is the same as the CMB, but I\u0027ve really no idea.\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2014-10-22T22:19:08Z","Content":"\n\u003Cp\u003EWhat if the centre of mass of the observable universe is not the centre of mass of the whole universe? What if there is something else beyond the visible universe? A parallel universe? What if these universes are moving relative to each other? Only because we don\u0027t see beyond some point does not mean that there is nothing. I guess we will never find some answers for some questions.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-10-22T22:29:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ECentre of mass of the observable universe, I suppose.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou would need to define \u0022center of mass\u0022 first. You obviously need to assume some finiteness condition on the universe (infinite mass will be a problem unless somehow spaced out thinner the far you go out), but you also need to to define what \u0022the universe\u0022 even is: depending on your frame of reference, it will look differently. Also, even if fixing a frame of reference (which sounds very asymetrical) I don\u0027t see how to define centers of masses unless requiring some flatness condition on space.\u003C/p\u003E\u003Cp\u003ETo maybe better understand some of the problems (and using the bad analogy of spacetime being like that): where on the earth\u0027s surface (!) is the center of mass of all humansÃ‚Â¿\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-22T22:40:59Z","Content":"\n\u003Cp\u003EIndeed if beyond the observable universe is indeed unobservable, the question of whether the observable universe is in motion relative to other observable universes (for other observers) or to the whole Universe will remain hypothetical.\u003C/p\u003E\u003Cp\u003EThe observable universe is emphatically finite and observations show it\u0027s geometrically near-flat and topologically not looped back on itself. So no worries there. Position of the observer obviously impacts, but that can be assumed to be on Earth for our purposes. My bigger concern is how that centre of mass depends on the motion of the observer, which I don\u0027t know. Might that render things circular?\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2014-10-22T23:34:50Z","Content":"\n\u003Cp\u003EEven if there is some \u0027total reference frame\u0027 that incorporates the entire system of the universe, that reference frame has no claim to truth. Motion is completely relative; I can define any imaginary frame of reference I want, whenever I want, wherever I want, and I can define it so as to be in motion relative to anything I want. So in that sense, no, it\u0027s not possible to stop everything in the universe.\u003C/p\u003E\u003Cp\u003EHowever, what you could do to sidestep that problem is to define the desired state as every local mass being at rest relative to every other local mass in the universe, effectively unifying their reference frames. According to Newtonian mechanics this is at least theoretically possible, though of course the engineering solution is not.\u003C/p\u003E\u003Cp\u003EAccording to quantum mechanics? Not really, no. Any state of absolute rest would violate Heisenberg\u0027s uncertainty theorem. There are people who will tell you that the uncertainty principle is an epistemic rather than ontic problem, but so far complementarity seems to win out pretty strongly against hidden determinism.\u003C/p\u003E\n"},{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2014-10-23T01:04:35Z","Content":"\n\u003Cp\u003EPerfect. I want to thank everyone for participating in this thought experiment of mine. The general conclusion seems to be that speed and velocity are relative to the frame to which they are measured.\u003C/p\u003E\u003Cp\u003EI was thinking about the universe much like this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Slam_Jones\u0022 data-cite=\u0022Slam_Jones\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EEarth is moving through the solar system at __ km/s, and the solar system is moving through the galaxy at __ km/s, the galaxy is moving through the local group at __ km/s, etc, etc, \u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I thought, jokingly, \u0022why waste the rocket fuel? Let the galaxies come to you!\u0022. Then the stupid idea was stuck in my head. First I had to figure out movement. You guys did that nicely. The second part I figured out for myself:\u003C/p\u003E\u003Cp\u003ECould a vessel or ship, by not moving (within a frame of reference) travel to other planets/solar systems/galaxies? The answer is yes, dependent upon the frame of reference. And, I would add, is no different than the normal means of travel given another frame of reference. Actually might require more fuel too.\u003C/p\u003E\n"},{"CreatedByName":"CjStaal","CreatedById":112518,"CreatedDateTime":"2014-10-23T01:19:06Z","Content":"\n\u003Cp\u003EThey have stopped some atoms from vibrating for milliseconds.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-10-23T02:32:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022N_las\u0022 data-cite=\u0022N_las\u0022\u003E\u003Cdiv\u003EThis frame isn\u0027t special either. There is nothing about the \u0022cosmic rest frame\u0022 that suggest that it is more special than my moms frame. What if \u0022the whole cosmos\u0022 is moving at a certain velocity?\u003Cp\u003EBeing at rest in regards to the cosmic background ratiation isn\u0027t \u0022more\u0022 at rest than being at rest in regards to some random galaxy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt actually sort of is. There\u0027s a reason why you don\u0027t see relativistic mass shooting all over the visible universe. It\u0027s because there was a rest frame for matter when it first condensed from the ionic plasma, before it all started getting tugged around by gravity. The distribution of velocities throughout the visible universe is not random, which is why, for instance, there is an apparent uniform distribution of mass around us whichever direction you look. The cosmic rest frame isn\u0027t privileged as far as physical laws go, but it does speak to the cosmological history of the universe.\u003C/p\u003E\n"}]}