{"TopicId":88274,"ForumId":44,"TopicTitle":"Is it possible to pass through a planet? (Many assumptions ahead)","CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2014-10-23T04:16:39Z","PageNum":1,"Articles":[{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2014-10-23T04:16:39Z","Content":"\n\u003Cp\u003ESo, a question came up in my head today that I haven\u0027t been able to accurately answer, and is a pretty far-fetched question.\u003C/p\u003E\u003Cp\u003EFirst of all, rules. On this topic, we will ignore the speed of light being the cosmic speed limit. We will also be ignoring things such as gravitational tidal effects and spaghetiffication.\u003C/p\u003E\u003Cp\u003ENow, here\u0027s the question: If an object were travelling fast enough.. in fact, so fast, that the atoms don\u0027t even have time to recognize and react to one another, could passing through a solid body of matter be possible? I mean, it makes sense. The atoms in a body of matter never touch each other. They can get ever so close, but the repulsive forces of their own power and magnetic properties are enough to keep them apart. If you were to keep the atoms in one body of matter from reacting with the atoms in another body, theoretically they should be able to pass through each other without even interacting at all.\u003C/p\u003E\u003Cp\u003EIn fact, you could make a valid comparison by using a very old, fairly sparse theory. Compare this to a hyperbolic orbit while moving at plex-warp speeds, but not in our space. Say, you were to move the speed of light in Verteron space (A theory of my own suggestion that the space we live in is small, and we can gain access to a bigger space, effectively being able to move much greater distances without moving any faster. Still under development, and far beyond our capability to test it.)\u003C/p\u003E\u003Cp\u003EAnyway, moving the speed of light here could move you vaster distances without compressing space, moving faster, but still interacting with our space.\u003C/p\u003E\u003Cp\u003EIf moving fast enough, indeed, can you pass through a planet?\u003C/p\u003E\u003Cp\u003EDoes this make sense to anyone else, or am I missing something? Keep in mind, we are not here to discuss why this wouldn\u0027t be possible. Just would it happen if it could.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-03T08:57:24Z\u0022 title=\u002203/03/2015 08:57  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 3, 2015\u003C/time\u003E by Xannari Ferrows\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"No one","CreatedById":112131,"CreatedDateTime":"2014-10-23T04:59:04Z","Content":"\n\u003Cp\u003EI don\u0027t understand quantum physics/general relativity/your magicalness which allows FTL stuff, but I\u0027m pretty sure that the answer is a massive explosion.\u003C/p\u003E\n"},{"CreatedByName":"TheGatesofLogic","CreatedById":58468,"CreatedDateTime":"2014-10-23T05:18:55Z","Content":"\n\u003Cp\u003EWell, the problem here is relativity, it limits the passing period in exchange for accelerating the rate at which the interactions proceed (I think). So you end up with a major interaction regardless of how fast you go (maybe).\u003C/p\u003E\n"},{"CreatedByName":"JUDUFU","CreatedById":76051,"CreatedDateTime":"2014-10-23T05:45:48Z","Content":"\n\u003Ca href=\u0022https://what-if.xkcd.com/20/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://what-if.xkcd.com/20/\u003C/a\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2014-10-23T06:01:58Z","Content":"\n\u003Cp\u003EI imagine that if you\u0027re going so fast that from your perspective it takes less than a minute to travel from Earth to the nearest Galaxy in the observable Universe, and at this speed you \u0022fly into\u0022 Earth - It\u0027s safe to say that you\u0027ll just go through it. You might blow the Earth up and set fire to Venus and Mars in the process, but the planet certainly won\u0027t stop you.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-10-23T06:10:42Z","Content":"\n\u003Cp\u003EOn the scale of atoms and sub-atomic particles, things happen \u003Cem\u003Efar \u003C/em\u003Emore quickly than the time scales we are used to. I don\u0027t believe there is any speed at which the particles would not have time to interact with each other, and by \u0022interact\u0022 I mean, KA-BOOM!\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-10-23T06:18:37Z","Content":"\n\u003Cp\u003EThe main reason collision events are happening is because of the EM fields of atoms interacting. EM fields aren\u0027t discrete processes, no matter how fast you are going you\u0027ll still feel them. So no, no matter how fast you\u0027re going you\u0027ll still hit the earth.\u003C/p\u003E\u003Cp\u003EProvided you are moving fast enough you can emerge on the other side as an incandescent cloud of plasma, but I\u0027m fairly sure that\u0027s not what you\u0027re aiming for here.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-10-23T06:50:48Z","Content":"\n\u003Cp\u003EUh, the atoms in solids do touch - or at least their electrons interact - otherwise you wouldn\u0027t have a solid. The nuclei of those atoms don\u0027t come into contact though, unless they happen to be found in the core of a star or a fusion reactor. So the \u003Cem\u003Enuclei\u003C/em\u003E in the atoms in your body might get quite a long way through the planet, but even then most of them would scatter and be stopped before they got out the other side.\u003C/p\u003E\u003Cp\u003EThe nearest real-world version of what you\u0027re proposing that I can think of, would be neutrinos. Those interact with matter via the weak force (the name says it all), rather than the electromagnetic force, so they do pass through very large amounts of matter (including planets) without stopping.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T06:55:17Z\u0022 title=\u002210/23/2014 06:55  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-10-23T08:40:46Z","Content":"\n\u003Cp\u003EDid you pass trough an moon or planet in KSP using maximum warp? \u003C/p\u003E\u003Cp\u003EMoving fast at 100.000x warp might let you pass trough an planet without interacting with it, say relative speed is 2km/s, with warp its 200.000 km/s or 4000 km every 50 ms who I believe is the sample rate, this is less than the diameter of kerbin and the warp reduction area around it, increasing speed will make it easier. \u003C/p\u003E\u003Cp\u003EIn real world it would not work well, hard to know if we did not have the lightspeed limit and you might be able to move so fast you would be able to pass trough however many of the atoms would interact and heat you to plasma or at least boiling, this would not be noticeable on the surface as you would interact loosely but you would pass trough dense rock for 12.000 km.\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2014-10-23T11:40:48Z","Content":"\n\u003Cp\u003ESomething which I heard in my learnings around astronomy : anything that moves with the speed of light (or faster, maybe ) is called a light.\u003C/p\u003E\u003Cp\u003ESo, imagine a light going to pass Earth.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-10-23T11:46:15Z","Content":"\n\u003Cp\u003EYou\u0027d never pass through Earth. The more speed you have, the more energy you deliver and it means larger temperature of the impact site. Therefore, more boom.\u003C/p\u003E\u003Cp\u003EOh and btw, it\u0027s \u0022many hypotheses ahead\u0022. No theories here.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T12:12:30Z\u0022 title=\u002210/23/2014 12:12  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-10-23T14:08:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022YNM\u0022 data-cite=\u0022YNM\u0022\u003E\u003Cdiv\u003ESomething which I heard in my learnings around astronomy : anything that moves with the speed of light (or faster, maybe ) is called a light.\u003Cp\u003ESo, imagine a light going to pass Earth.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnything that moves at the speed of light is massless. Photons are the only known massless particle that can exist as a free particle. But its very possible that there are other massless particles that travel freely at c.\u003C/p\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2014-10-23T14:12:38Z","Content":"\n\u003Cp\u003EYes.\u003C/p\u003E\u003Cp\u003ENeutrinos do it all the time.\u003C/p\u003E\u003Cp\u003EIf I remember correctly they have a 50/50 of making it through a light year of lead.\u003C/p\u003E\u003Cp\u003EThey don\u0027t even go c either.\u003C/p\u003E\u003Cp\u003EOther stuff can if its going fast enough, it\u0027s just that there may not be much planet left behind afterwards \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESufficiently high energy photons ought to be able to, if you look at the progression of visible light to UV to Xray to gamma ray to high energy gamma etc.\u003C/p\u003E\u003Cp\u003EGravitons do, if they exist in the first place.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-23T15:57:43Z","Content":"\n\u003Cp\u003EI can see four ways to do this:\u003C/p\u003E\u003Cp\u003EAn object that doesn\u0027t interact with normal matter much can fly straight through with no impact to object or Earth. Neutrinos, dark matter, micro black holes, etc.\u003C/p\u003E\u003Cp\u003EAn object that\u0027s travelling blazing fast can punch through but will heavily damage the object and potentially the Earth. xkcd\u0027s near-light-speed diamond.\u003C/p\u003E\u003Cp\u003EAn object that\u0027s much denser than the Earth will pass through like a thrown rock in air, with little damage to the object but potential damage to the Earth. Neutron star stuff would fit the bill here, as might a planetary mass black hole.\u003C/p\u003E\u003Cp\u003EAn object could quantum tunnel from one side of the Earth to the other, with no impact to object or Earth. Maybe anything stupidly cold could do this?\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2014-10-23T16:22:51Z","Content":"\n\u003Cp\u003ENo one, Honestly I\u0027m not sure if there is a more straightforward answer.\u003C/p\u003E\u003Cp\u003EThatGatesofLogic. I\u0027m not sure what you\u0027re referring to when you brought up relativity. Are you meaning the Earth\u0027s orbital velocity and your speed are your reference frames? Because I\u0027m taking Earth as a central reference frame, and moving relative to it at this ungodly speed.\u003C/p\u003E\u003Cp\u003EWestAir... Well, that makes sense. Now that I think more about it, Earth\u0027s convection would be involved as well, but that stuff\u0027s too complicated for now. \u003C/p\u003E\u003Cp\u003EVanamonde, I\u0027m still trying to find what that speed is. My closest guess right now is c(1.141636 x 10^360) That number seem familiar?\u003C/p\u003E\u003Cp\u003EReally it\u0027s just an estimate. \u003C/p\u003E\u003Cp\u003ERalathon. I would imagine you would be interacting, but maybe I did misspeak a little. I was honestly referring to if they had time to effect each other so much that you would stop. I guess I said interacting and meant reacting. Sorry for that.\u003C/p\u003E\u003Cp\u003EKSK. You can think of them like a repulsive magnet inside an attracting magnet. Bring another one in close, and it will stay a very close distance, but never touch. Sure, they are interacting, but they aren\u0027t touching, if by touching you mean coming in absolute contact.\u003C/p\u003E\u003Cp\u003ENeutrinos are a valid comparison, but aren\u0027t tangential to what I\u0027m referring to, as their interaction are enough to redirect their momentum. (Brownian motion, is it?)\u003C/p\u003E\u003Cp\u003EMagnemoe. Ahh darn, ye caught me. Yes, that\u0027s how this question came to my mind. I started wondering about what the real world speed to do this would be. I do get what you mean about Kerbin, though. The game is constantly accounting for frame differences, when you can\u0027t do that in real life.\u003C/p\u003E\u003Cp\u003EYNM. A photon (If that\u0027s what you mean) could pass into Earth, but not likely out. It would lose all of it\u0027s energy fairly fast actually.\u003C/p\u003E\u003Cp\u003ELajoswinkler, the reason an object gets hot is because the transferal of energy from one object to the next. I know I said we would be ignoring the light speed limit for now, but it would make sense to assume that this energy transferal happens slower than light, and rather at the speed of sound (As compression waves travel through solids at the speed of sound, so does energy). This reaction probably wouldn\u0027t happen fast enough to keep up with you. The end result in this scenario would be you produce enough kinetic energy to destroy the Earth, but I\u0027m still not sure if that would be the case. (There is my theory of Verteron space, but I\u0027ll admit, I was out of it last night.) \u003C/p\u003E\u003Cp\u003EBobnova. I\u0027m afraid the context and layout of your reply eludes me.\u003C/p\u003E\u003Cp\u003ECantab. I much approve of black holes. Oh right, the answer. \u003C/p\u003E\u003Cp\u003EThe first answer is very valid. A way of eluding the context of the question without breaking any rules. I\u0027ll do a quick review later to verify if any reactions are made, if any at all.\u003C/p\u003E\u003Cp\u003EAs for the second answer, I took a quick look at that page, and I don\u0027t see how that comparison is relevant to the question. Sure, it\u0027s about an object flying to the Earth at ridiculous speeds, but this question ignores that.\u003C/p\u003E\u003Cp\u003EThe third answer, A denser object would likely be able to pass through, but will cause masses of interactions in the process.\u003C/p\u003E\u003Cp\u003EThe last answer, Another valid answer. You could quantum tunnel to the other side while keeping the context of the question, but the scales and probabilities of that happening are so low, it probably wont even be worth discussing in the next lifetime (Not meaning to start anything about that.)\u003C/p\u003E\u003Cp\u003EAll in all, very good answers! It seems I have some work of my own to do, but I\u0027ll do that later.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T17:03:41Z\u0022 title=\u002210/23/2014 05:03  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by Xannari Ferrows\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-10-23T18:42:00Z","Content":"\n\u003Cp\u003EAssuming force propagates at a speed equal to or less than C, and assuming that you may travel faster than C, one may expect to see an effect not at all dissimilar to a super-sonic Doppler graph \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/q9YfWbc.png\u0022 alt=\u0022q9YfWbc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the rings being a following force\u003C/p\u003E\n"},{"CreatedByName":"TheGatesofLogic","CreatedById":58468,"CreatedDateTime":"2014-10-23T19:19:34Z","Content":"\n\u003Cp\u003EI was referring to relativistic forces, despite the period of time of the passing appearing to decrease due to spatial contraction coupled with relativistic dilation forces should act at a faster rate in accordance (IIRC). Also, as said before, electromagnetic forces are not discrete, so no matter how fast you travel through the planet there will still be SIGNIFICANT scattering.\u003C/p\u003E\u003Cp\u003EAfter rereading a bit on relativistic forces I was in fact correct, passing time would be countered by a force proportional to the momentum of the object based on its relativistic mass over the invariant mass, which means that a high amount of interaction is essentially unavoidable. (Maybe)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T19:24:27Z\u0022 title=\u002210/23/2014 07:24  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by TheGatesofLogic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2014-10-23T19:31:51Z","Content":"\n\u003Cp\u003ETheGatesOfLogic. Ah, I see what your saying. I do understand that there are still interactions happening, and in turn scattering, but what I\u0027m still looking for is how insignificant is can get. I\u0027m trying not to sound rude, but there\u0027s on thing that comes into my head whenever I think about what you\u0027re saying. \u003C/p\u003E\u003Cp\u003EThink of a hyperbolic orbit. The faster you move, the much less of an impact it has on your trajectory. I understand it still has an impact regardless of how faster you\u0027re moving, but I\u0027m looking for the point in which you\u0027re moving so fast, it\u0027s negligible enough to not even account for. In turn, think of minimizing these changes to your matter string to a point where you practically don\u0027t change. Like I said, I understand that interactions will happen regardless.\u003C/p\u003E\u003Cp\u003EI do get what you\u0027re saying, though. Truly. As for your point of dilation, that is still theoretical, and does not ignore a relative cosmic speed limit (A bit confusing word choice, but hopefully it still makes sense), so I\u0027m sorry to say I cannot take that into account. I do hope you understand.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T19:37:25Z\u0022 title=\u002210/23/2014 07:37  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by Xannari Ferrows\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-10-24T07:56:17Z","Content":"\n\u003Cp\u003ENo - atoms in a solid touch. They form bonds, the distribution of electrons around the nuclei changes when they do so. Try a quick Wikipedia search for molecular orbital theory.\u003C/p\u003E\u003Cp\u003EConsider the very simplest case of two hydrogen atoms. Radius of a hydrogen atom is 53 pm (Google for \u0027hydrogen atom radius). Bond length of the H2 molecule is 74 pm (or 0.74 A) - in other words, considerably less than the sum of the two atomic radii. You can\u0027t think of a hydrogen molecule as two discrete hydrogen atoms that are almost but not quite touching.\u003C/p\u003E\u003Cp\u003EThe same goes for atoms in a solid. Treating a solid as a set of close packed spheres is a nice picture, and a helpful one for visualizing solid structure, but a picture is all it is.\u003C/p\u003E\u003Cp\u003EBack to the question. Apparently, the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Planck_time\u0022 rel=\u0022external nofollow\u0022\u003EPlanck\u003C/a\u003E time, is the smallest possible unit of time, in that, for events occurring less than one Planck Time apart, no change can be measured or detected. So if you could hurl yourself at a planet fast enough to pass through it in one Planck Time, you would theoretically pass through it unaltered. \u003C/p\u003E\u003Cp\u003EUnfortunately, the Planck Time is also defined as the length of time it takes a photon to travel one Planck length - and a Planck Length is a massive 1.6x10 -35 m. So for that to work, you would need to be travelling at around 10 to the power of 42 times the speed of light. So yeah, if you completely ignore relativity it might work. In the real world - not a hope.\u003C/p\u003E\u003Cp\u003EIncidentally - quantum tunneling is also a *very* distance dependent effect. The chance of tunneling more than a few nanometres is vanishingly small.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-24T08:03:20Z\u0022 title=\u002210/24/2014 08:03  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 24, 2014\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-10-24T11:09:22Z","Content":"\n\u003Cp\u003EEven if you went at light speed (ignoring the relativistic distortions of everything), you\u0027re too slow to be faster than the electrical interactions between atoms.\u003C/p\u003E\u003Cp\u003EResult - big bada boom.\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-10-24T11:21:06Z","Content":"\n\u003Cp\u003ENot only EM, the nuclear forces will also have something to say.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-10-24T11:47:52Z","Content":"\n\u003Cp\u003EIt could be calculated. The temperatures between the surface and impactor would grow to incredible values, true...\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-24T13:15:43Z","Content":"\n\u003Cp\u003EIf all else fails, there\u0027s always the prosaic approach of a really big drill \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ZetaX","CreatedById":60692,"CreatedDateTime":"2014-10-24T14:32:07Z","Content":"\n\u003Cp\u003EWhich won\u0027t work.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-10-24T15:10:20Z","Content":"\n\u003Cp\u003EMegaman certainly isn\u0027t an \u003Cem\u003Eeasy\u003C/em\u003E game, but it\u0027s orders of magnitude away from the old Ninja Gaiden games\u003C/p\u003E\n"}]}