{"TopicId":88280,"ForumId":34,"TopicTitle":"Compatibility Popup Blocker","CreatedByName":"Khatharr","CreatedById":102687,"CreatedDateTime":"2014-10-23T06:21:16Z","PageNum":1,"Articles":[{"CreatedByName":"Khatharr","CreatedById":102687,"CreatedDateTime":"2014-10-23T06:21:16Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://puu.sh/cn3W4/4e6fe50d5a.gif\u0022 alt=\u00224e6fe50d5a.gif\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https://kerbalstuff.com/mod/284/Compatibility%20Popup%20Blocker\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EDOWNLOAD HERE - Version 1.0.2\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027;\u0022\u003E\u0022Some installed mods may be incompatible with this version of Kerbal Space Program. Features may be broken or disabled. Please check for updates to the listed mods.\u0022\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EAre you tired of seeing this message?\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EYou\u0027ve checked for updates, but none are available?\u003C/p\u003E\u003Cp\u003EThe mods listed are working just fine anyway?\u003C/p\u003E\u003Cp\u003EYou don\u0027t want to bother downloading the source, rebuilding the project and recompiling the mod just to get rid of an annoying popup?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003ECompatibility Popup Blocker is for YOU!\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EAll you have to do is install the mod as instructed in the included txt. The popup will be disabled and you can get on with your life and take responsibility for your own actions like a grown-up.\u003C/p\u003E\u003Cp\u003EIf you want to re-enable the compatibility check, just remove the dll and restart KSP.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003ENo muss, no fuss, no recompiling mods.\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIf any mod you have rejects this popup blocker or exhibits bad behavior in response to its presence, just post in this thread which mod has the problem and I\u0027ll mutate the popup blocker and upload the revision. \u003C/p\u003E\u003Cp\u003E\u003Cem\u003EIt should only take a few minutes at most.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/cn3Xl/328e8a3c67.jpg\u0022 alt=\u0022328e8a3c67.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESource code included in download. WTFPL license.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EUse this mod at your own discretion.\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u0022But Khatharr! How does it work?\u0022\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m glad you asked. That annoying popup is a source code section that mod authors can include in their mod if they want to \u0022lock it to a specific version\u0022. Since several installed mods may have that source segment, and they may have different versions of it, they all load, and then they compare version numbers with one another to find the highest version. Only the one that has the highest number shows the dialog. This plugin works by telling KSP that it\u0027s a part of that collection and then setting its version number to the highest possible value. Before anyone comes along to tell you differently, this does not actually prevent the internal behavior of the other mods. They may still internally disable some of their features if they think that they are incompatible. \u003Cstrong\u003EAll this does is block the popup window.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-25T06:52:49Z\u0022 title=\u002210/25/2014 06:52  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 25, 2014\u003C/time\u003E by Khatharr\u003C/strong\u003E\n\u003Cbr\u003EFREEDOM!\n\u003C/span\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-10-23T07:17:13Z","Content":"\n\u003Cp\u003EWhile I don\u0027t object to this mod on some levels, be aware it has a very long list of potential problems, primarily the problem that people will not know to update their mods and won\u0027t be told they\u0027re running old incompatible mods, this can cause a nightmares for support of mods, people will think a mod should be working fine when in fact it\u0027s broken and has since been fixed.\u003C/p\u003E\u003Cp\u003EAs a modder that has to handle support fairly frequently this mod terrifies me.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-23T07:36:53Z","Content":"\n\u003Cp\u003EYou just have to hope that people are smart enough to disable this when a major game update comes about to see what needs updating.\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-10-23T07:38:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaalidas\u0022 data-cite=\u0022Gaalidas\u0022\u003E\u003Cdiv\u003EYou just have to hope that people are smart enough to disable this when a major game update comes about to see what needs updating.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy hopes aren\u0027t high.\u003C/p\u003E\n"},{"CreatedByName":"Roadkill","CreatedById":111931,"CreatedDateTime":"2014-10-23T07:48:09Z","Content":"\n\u003Cp\u003EThe big thing is, when Squad says \u0022OK, the game is finished\u0022, should we expect mods to work on all versions after that? Seeing that this game has no DRM, I fully expect this to never happen. For as long as this game is making money, there will always be new versions and broken mods that require updating. This is the DRM.\u003C/p\u003E\u003Cp\u003EAs far as the \u0022I\u0027m tired of supporting noobs that run old versions\u0022 argument is concerned, it\u0027s really, really simple. Post bug reporting guidelines in your forum thread. If the guidelines are not followed, them IGNORE THE DAMN POST. It\u0027s quite obvious to me that if a poster cannot follow guidelines set forth by the mod author in a particular thread, then there will most likely be nothing to gain from said bug report in the first place. If you wish to continue beating you\u0027re head on the wall with bug reports that don\u0027t even start by posting a log, the who\u0027s the real idiot? When people see pop ups in game. it tends to .... them off. As a result, we see the mod posted here.\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-10-23T07:52:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roadkill\u0022 data-cite=\u0022Roadkill\u0022\u003E\u003Cdiv\u003EAs far as the \u0022I\u0027m tired of supporting noobs that run old versions\u0022 argument is concerned, it\u0027s really, really simple. Post bug reporting guidelines in your forum thread. If the guidelines are not followed, them IGNORE THE DAMN POST.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou say that, but if you got 20\u002B a day that followed the same pattern and is about 90% of the posts in your thread I\u0027m not sure you\u0027d be as resolute on that.\u003C/p\u003E\n"},{"CreatedByName":"Roadkill","CreatedById":111931,"CreatedDateTime":"2014-10-23T07:57:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003EYou say that, but if you got 20\u002B a day that followed the same pattern and is about 90% of the posts in your thread I\u0027m not sure you\u0027d be as resolute on that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd you\u0027re right about that, I admit it. I can see where it would get frustrating if I had to scroll through pages of junk. Come to think of it, that\u0027s pretty much what the entire internet is all about. Scrolling through pages of junk to find the answer to some of the simplest questions. Can I please have a compatibility checker for google?\u003C/p\u003E\n"},{"CreatedByName":"Khatharr","CreatedById":102687,"CreatedDateTime":"2014-10-23T08:02:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roadkill\u0022 data-cite=\u0022Roadkill\u0022\u003E\u003Cdiv\u003EWhen people see pop ups in game. it tends to .... them off. As a result, we see the mod posted here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not the popup that bothers me so much as the fact that there\u0027s no convenient method to say \u0022Okay. Please don\u0027t show me this again unless there\u0027s a change in the report.\u0022 I talked about adding such a check-box to the popup in the Compat Check thread, but was told \u0027no\u0027 by the OP and then told to drop the matter by a moderator. If the CC implementer(s) decide to add such a feature, I\u0027ll gladly remove this mod, because warnings are good, but continual harassment is not.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-23T08:15:33Z","Content":"\n\u003Cp\u003ECompatibilityChecker is licensed BSD-2. You could have just created a CC version 5 that did what you wanted instead of doing this. Then that would have overridden all the older versions of CC, just like this does, and you would have gotten exactly what you wanted. Why didn\u0027t you do that instead?\u003C/p\u003E\n"},{"CreatedByName":"Khatharr","CreatedById":102687,"CreatedDateTime":"2014-10-23T08:26:31Z","Content":"\n\u003Cp\u003EBall\u0027s in your court. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-23T08:31:10Z","Content":"\n\u003Cp\u003EHow so? You want a feature, it\u0027s licensed so that you can fork the code to implement that feature, so why aren\u0027t you implementing it? Why do you want to make our support workload heavier?\u003C/p\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2014-10-23T08:36:53Z","Content":"\n\u003Cp\u003ETBH, my answer to this mod would be to completely disable my mod if this mod were found, whether it works or no. It\u0027s a deliberate attempt at making life harder for modders, and honestly, a pretty douchey move. Too bad we don\u0027t have a down-vote system for reputation.\u003C/p\u003E\n"},{"CreatedByName":"Khatharr","CreatedById":102687,"CreatedDateTime":"2014-10-23T09:02:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Autochton\u0022 data-cite=\u0022Autochton\u0022\u003E\u003Cdiv\u003ETBH, my answer to this mod would be to completely disable my mod if this mod were found, whether it works or no. It\u0027s a deliberate attempt at making life harder for modders, and honestly, a pretty douchey move. Too bad we don\u0027t have a down-vote system for reputation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s easier for me to mutate this than it is for modders to try and work around it. The path of least resistance at this point is to implement the feature. \u003C/p\u003E\u003Cp\u003EMeanwhile, since you\u0027re visiting my intentions, I made this mod in order to solve a problem for users. If that creates a problem for modders then frankly I\u0027m not obligated to care about that, especially taking into account the attitude toward inconveniencing users that was demonstrated last night. I was being told by everyone involved that the feature in question was unacceptable, essentially because it robbed them of their power to coerce users into specific behaviors - with the justification provided more or less being that users are stupid. \u003C/p\u003E\u003Cp\u003EThis is called irony. Now CC is inconvenienced (though by phantoms, to be frank) and the users have the power. When you play dirty you get dirty. \u003C/p\u003E\u003Cp\u003EThere\u0027s a significant difference in magnitude, though. Firstly, the revision to CC is a once-and-done affair, whereas the work they were demanding from users was on a per-mod, per-user basis, and god help any user that doesn\u0027t have an IDE installed to make the necessary changes, or if the mod doesn\u0027t include full source code. \u003C/p\u003E\u003Cp\u003ESince the tune has changed a bit and the feature is suddenly no longer anathema, I\u0027m prepared to work it out and send it to the CC team to do with as they please, which I shall begin presently.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-10-23T09:33:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Khatharr\u0022 data-cite=\u0022Khatharr\u0022\u003E\u003Cdiv\u003EAll you have to do is drop the included dll in your GameData folder. The popup will be disabled and you can get on with your life and take responsibility for your own actions like a grown-up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d like it if the OP would include some statement that some (or all) plugin authors might deny providing support for installs that also have your plugin installed. Just a friendly advice to players before installing your plugin.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-23T09:41:09Z","Content":"\n\u003Cp\u003EAnd the feature will be overridden by the KSP version incrementing, correct? For major, minor, patch, and build versions? Because otherwise, your feature will have the same problems that you have created with this particular mod.\u003C/p\u003E\u003Cp\u003EI\u0027ll admit I\u0027m not happy about even this suggestion. The number of times I\u0027ve gotten reports from people that consider ignoring the Compatibility Checker to be okay is still very high, and every update it becomes worse because of people that claim that the mods are working perfectly fine, even when they aren\u0027t. This is not a good feature. It\u0027s just better than breaking the whole damn system. Good job. Even better, you broke everything by exploiting the system that was purposefully intended to not .... off users with a ton of popups each time they opened the game. Shows what we get for trying to warn you without it being a popup parade.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure who you\u0027re going to send it to though. There is no \u0022CC team.\u0022 You\u0027ll be releasing it as a new version of CC and hoping that it is taken up by the modding community, just as was intended by the license.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-10-23T09:46:51Z","Content":"\n\u003Cp\u003EGotta say, I personally don\u0027t use CC, but the toxicity of this mod is most certainly enough to make me aggressively not support anyone who installs this if not outright disable plug-ins with a giant box telling them why and pointing them at this thread. \u003C/p\u003E\u003Cp\u003EAs noted earlier, a better course of action would be to enhance the existing CC code (KSP AVC has examples of how to thus kind of warning unobtrusively past the first warning) vs the barrel of toxicity this current implementation is.\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-10-23T09:51:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EGotta say, I personally don\u0027t use CC, but the toxicity of this mod is most certainly enough to make me aggressively not support anyone who installs this if not outright disable plug-ins with a giant box telling them why and pointing them at this thread. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGues \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81794-Alpha-1-rev-3-Dang-It%21-A-random-failures-mod\u0022 rel=\u0022external nofollow\u0022\u003Ewhat mod\u003C/a\u003E put a part module on *every* part in the game, and is considering making them explode if this plugin is found.\u003C/p\u003E\n"},{"CreatedByName":"Chimaine","CreatedById":4211,"CreatedDateTime":"2014-10-23T10:26:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ippo\u0022 data-cite=\u0022Ippo\u0022\u003E\u003Cdiv\u003EGues \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81794-Alpha-1-rev-3-Dang-It%21-A-random-failures-mod\u0022 rel=\u0022external nofollow\u0022\u003Ewhat mod\u003C/a\u003E put a part module on *every* part in the game, and is considering making them explode if this plugin is found.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I certainly share the opinion that this mod is pure toxic, that move would be on the same level. I\u0027ve seen the outcome of that in another community already (Minecraft, the \u0022war\u0022 between GregTech and Tinker\u0027s Construct). Don\u0027t be that guy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2014-10-23T10:29:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chimaine\u0022 data-cite=\u0022Chimaine\u0022\u003E\u003Cdiv\u003EWhile I certainly share the opinion that this mod is pure toxic, that move would be on the same level. I\u0027ve seen the outcome of that in another community already (Minecraft, the \u0022war\u0022 between GregTech and Tinker\u0027s Construct). Don\u0027t be that guy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis isn\u0027t a mod, it\u0027s a sabotage attempt.\u003C/p\u003E\n"},{"CreatedByName":"Khatharr","CreatedById":102687,"CreatedDateTime":"2014-10-23T10:37:35Z","Content":"\n\u003Cp\u003ELOL\u003C/p\u003E\u003Cp\u003EAs soon as I even begin to be nice we\u0027re back to \u0022the users are stupid\u0022 and \u0022we won\u0027t allow it!\u0022.\u003C/p\u003E\u003Cp\u003EFine, then. As I mentioned, it\u0027s effortless for me to mutate the popup blocker. \u003C/p\u003E\u003Cp\u003EI\u0027ll give you what I have so far for the feature change. This was a snippet to be spliced into the existing code. In its current state it shows a warning once and then suppresses it until there\u0027s a change, which is close to the target behavior except that it always assumes that the user wants to suppress the warning. I was going to change the dialog out to one with a check-box that defaults to \u0027off\u0027 and then set the bool according to the state of the check-box when \u0027OK\u0027 is pressed. It doesn\u0027t matter at this point.\u003C/p\u003E\u003Cp\u003ESince you can\u0027t grasp the concept of respecting the user, the popup blocker mod stays and will be mutated as often as necessary any time a user reports a mod that is bypassing it.\u003C/p\u003E\u003Cp\u003EAs long as people feel inconvenienced by CC they can come use this mod to circumnavigate it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPOPUP BLOCKED\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s your code. The only way to get away from the popup blocker at this point is to make the end users stop resenting your intentionally annoying behavior. Good luck.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E            if ((incompatible.Length \u0026gt; 0) || (incompatibleUnity.Length \u0026gt; 0))\u003Cbr\u003E            {\u003Cbr\u003E                ///////////////////////////////////\u003Cbr\u003E  //LICENSE - Khatharr (the author) hereby relinquishes all rights to this code to the extent permitted by law. Good grief.\u003Cbr\u003E\u003Cbr\u003E                const String suppressionFileName = \u0022GameData/CompatCheckSuppress\u0022;\u003Cbr\u003E                bool warningSuppressed = false;\u003Cbr\u003E                String silencedMessage;\u003Cbr\u003E\u003Cbr\u003E                try\u003Cbr\u003E                {\u003Cbr\u003E                    silencedMessage = System.IO.File.ReadAllText(suppressionFileName);\u003Cbr\u003E                    warningSuppressed = Equals(message, silencedMessage);\u003Cbr\u003E                    if (!warningSuppressed)\u003Cbr\u003E                    {   //messages didn\u0027t match, so there\u0027s been a change - remove the suppression\u003Cbr\u003E                        System.IO.File.Delete(suppressionFileName);\u003Cbr\u003E                    }\u003Cbr\u003E                }\u003Cbr\u003E                catch (Exception)\u003Cbr\u003E                {\u003Cbr\u003E                    Debug.Log(\u0022Compatibility Checker suppression file not found. (This is not an error.)\u0022);\u003Cbr\u003E                }\u003Cbr\u003E\u003Cbr\u003E                if (!warningSuppressed)\u003Cbr\u003E                {\u003Cbr\u003E                    bool suppressionRequested = true;\u003Cbr\u003E\u003Cbr\u003E                    //~~_ need to replace this with a different dialog that allows the bool to be set\u003Cbr\u003E                    PopupDialog.SpawnPopupDialog(\u0022Incompatible Mods Detected\u0022, message, \u0022OK\u0022, true, HighLogic.Skin);\u003Cbr\u003E\u003Cbr\u003E                    if (suppressionRequested)\u003Cbr\u003E                    {\u003Cbr\u003E                        System.IO.File.WriteAllText(suppressionFileName, message);\u003Cbr\u003E                    }\u003Cbr\u003E                }\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E                ///////////////////////////////////////////\u003Cbr\u003E            }\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-23T21:55:27Z\u0022 title=\u002210/23/2014 09:55  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 23, 2014\u003C/time\u003E by Khatharr\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-10-23T10:45:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Khatharr\u0022 data-cite=\u0022Khatharr\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESince you can\u0027t grasp the concept of respecting the user, the popup blocker mod stays and will be mutated as often as necessary any time a user reports a mod that is bypassing it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, to be fair, it seems you can\u0027t grasp the concept of respecting the modder\u0027s choices.\u003C/p\u003E\n"},{"CreatedByName":"Khatharr","CreatedById":102687,"CreatedDateTime":"2014-10-23T11:04:55Z","Content":"\n\u003Cp\u003EIrony at its finest.\u003C/p\u003E\u003Cp\u003EYou don\u0027t get to choose what happens on my machine.\u003C/p\u003E\u003Cp\u003EKeep complaining or start adapting.\u003C/p\u003E\u003Cp\u003ESee you tomorrow.\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-10-23T11:09:37Z","Content":"\n\u003Cp\u003EYou are right. I don\u0027t get to choose what happens on your machine: you do... by choosing to install my mod, and I get to choose what my mod does. If my work doesn\u0027t suit your tastes, uninstall it.\u003C/p\u003E\u003Cp\u003EBut yes, I\u0027ll adapt very soon. I won\u0027t be using Compatibility Checker anymore: I will implement the same exact thing inside the mod, instead of using CC. I\u0027m sure many other will want to do the same.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-10-23T11:11:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ippo\u0022 data-cite=\u0022Ippo\u0022\u003E\u003Cdiv\u003EI won\u0027t be using Compatibility Checker anymore: I will implement the same exact thing inside the mod, instead of using CC. I\u0027m sure many other will want to do the same.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI won\u0027t, because I don\u0027t believe in mod wars, which I find stupid, to be really blunt.\u003C/p\u003E\n"},{"CreatedByName":"mjmj1996","CreatedById":116811,"CreatedDateTime":"2014-10-23T11:38:58Z","Content":"\n\u003Cp\u003ESadly saying, as a user i would not appreciate your mod much..... though there might be users who will like this idea but it definitely not me.\u003C/p\u003E\u003Cp\u003EAll i seeing is somehow you are annoying modders, as i believe.\u003C/p\u003E\u003Cp\u003ELike in KSP, if i wants to make mods useful i will maintain a copy of correct version of KSP, instead of getting an idea of blocking the popup, since blocking the popup can solve none of the issue. I do not want a malfunctioning mod exist in my library since I had enough crash already.\u003C/p\u003E\u003Cp\u003Efor whatever the reason is, i am glad to wait until the modder run through a check even it could take weeks. Its ok.\u003C/p\u003E\u003Cp\u003EWell, basically for me if i sees the compatibility popup i will delete the corresponding mod instead of doing something to the popup - its somehow something like when you flying a plane you see a warning sign and you just trying to shut down the warning sign instead of trying to solve the problem.\u003C/p\u003E\n"}]}