{"TopicId":88409,"ForumId":20,"TopicTitle":"Realism Overhaul Discussion Thread","CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-10-24T20:08:23Z","PageNum":14,"Articles":[{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-02-18T06:55:21Z","Content":"\n\u003Cp\u003Echrisl: I am not sure about the reason MechJeb is not turning until later; I suggest you lower your turn start until MJ does turn at 100m/s.\u003C/p\u003E\u003Cp\u003EAs for the apogee issue, my suggestion is to control your *actual* apogee with the \u0022turn end\u0022 parameter, and set your \u0022desired apoapsis\u0022 to something just a hair higher than your near-final apogee (it will take practice to determine what is best). That way, when you finally circularize, you\u0027ll be in a nearly-circular oribt.\u003C/p\u003E\u003Cp\u003EExample:\u003C/p\u003E\u003Cp\u003ETurn end 150km, desired final apogee 200km. Set the desired apoapsis in the guidance window to, say, 210km, and then using the \u0022final angle\u0022 control your burn such that your apogee doesn\u0027t go above 200km. Then when MJ shuts off the engines, you should be in a 200x210km orbit.\u003C/p\u003E\u003Cp\u003EHowever, the key here is that you are using the turn shape and the \u0022final angle\u0022 bit to \u003Cem\u003Econtrol time to apogee, and thus apogee itself\u003C/em\u003E: if time to apogee is getting too low, pitch up; if it\u0027s getting too high, pitch down. You should spend most of the last minute or two with your apogee not changing in the least.\u003C/p\u003E\u003Cp\u003EAlso don\u0027t be afraid to circularize after apogee. Set desired apoapsis rather high (300km, say), adjust turn shape so your \u0022inital\u0022 apogee is around 230km, and then as you fall back down pitch up to cancel the vertical velocity, such that you end up in a final orbit of 200x200km (which may require falling *under* 200km, pitching up again, and setting \u0022desired apoapsis\u0022 back from 300km to 200km so MJ cuts off the engines correctly).\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-02-18T16:13:07Z","Content":"\n\u003Cp\u003E@Chrisl - The MechJeb issue your having is the \u0022Corrective Steering\u0022 option. I forget if it does that with it on or off so try playing with that. I\u0027m pretty sure it\u0027ll delay your gravity turn with it on, but I could be wrong and it\u0027s the other way around.\u003C/p\u003E\u003Cp\u003EAs for the rest of your question Nathan covered it pretty well. But in my opinion and experience it was easier to just disable MJ auto guidance once in the cruising stage of a launch after it performs most of the gravity turn. Then just fly manually. Caution. When you shut down auto guidance it will kill your throttle. Most engines can re-ignite for free if your fast, but just mash the Z key when/if you turn off MJ.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-18T16:15:08Z\u0022 title=\u002202/18/2015 04:15  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 18, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-02-18T18:04:02Z","Content":"\n\u003Cp\u003EThanks. I\u0027ll give those a try. Mostly I\u0027m just trying to find a way to make the gravity turn itself a bit smoother. When I do it by hand I end up with my rocket bobbing up and down alot. It works, but it\u0027s just not pretty. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-02-18T21:02:56Z","Content":"\n\u003Cp\u003EI\u0027m having some issues setting up a satellite. I\u0027m using my tested Atlas/Agena rocket. The Agena stage uses the Bell 80xx engine. It has four of the small RV-025 RCS blocks setup to use Nitrogen. And the fuel tank has a small amount of Nitrogen and 4m35s worth of fuel for the Bell 80xx. When I look at the stats for that engine, I\u0027m able to ignite the engine up to 16 times (Ignitions: Hypergolic - 16/16). That all works as intended.\u003C/p\u003E\u003Cp\u003EMounted above the Agena I have the actual satellite. It\u0027s made up of the same Bell 80xx engine, plus four small RV-025 RCS blocks setup to use Hydrazine. The rest of the satellite is made up of a fuel tank that contains a small amount of Hydrazine, some battery power, and enough fuel to run the Bell 80xx for 1m3s. But when I look at the stats for this engine, I can only fire the engine once (Ignitions: Hypergolic - 1/1). What am I doing wrong?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-02-19T02:55:32Z","Content":"\n\u003Cp\u003EThe default configuration of that engine has 16 ignitions. If you\u0027re playing RP-0, however, that\u0027s the last configuration to unlock. The early (80xx rather than 82xx) configs have either 1 ignition (the first config) or 5 (the second).\u003C/p\u003E\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-02-19T18:08:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EThe default configuration of that engine has 16 ignitions. If you\u0027re playing RP-0, however, that\u0027s the last configuration to unlock. The early (80xx rather than 82xx) configs have either 1 ignition (the first config) or 5 (the second).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am playing with RP-0. That said, when I\u0027m in the VAB, the stats listed for the \u0022Bell 80XX\u0022 state: \u0022Engine Ignitor: Can ignite for 16 time(s). Ignitor type: Hypergolic\u0022. Also, as I mentioned this rocket has two of these Bell 80XX engines. One is on the Agena stage and it gets the 16 restarts it appears it\u0027s supposed to get. But the exact same engine on my satellite stage was only getting a single restart. If I shouldn\u0027t have the 16 restart version yet, then why does the Agena get that? Is this a recent change? My Agena stage is setup as a subassembly so maybe it\u0027s using old information? But then, why would the description in the VAB say the engine gets 16 restarts?\u003C/p\u003E\u003Cp\u003EI currently have all three tier 3 techs (Orbital Rocketry, 3-axis stability, Survivability) and one tier 4 (Orbital Science)\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-02-19T20:16:43Z","Content":"\n\u003Cp\u003EDoes anybody have a RO config for Roverdude\u0027s UKS?\u003C/p\u003E\n"},{"CreatedByName":"BevoLJ","CreatedById":77242,"CreatedDateTime":"2015-02-19T20:38:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chrisl\u0022 data-cite=\u0022chrisl\u0022\u003E\u003Cdiv\u003EI am playing with RP-0. That said, when I\u0027m in the VAB, the stats listed for the \u0022Bell 80XX\u0022 state: \u0022Engine Ignitor: Can ignite for 16 time(s). Ignitor type: Hypergolic\u0022. Also, as I mentioned this rocket has two of these Bell 80XX engines. One is on the Agena stage and it gets the 16 restarts it appears it\u0027s supposed to get. But the exact same engine on my satellite stage was only getting a single restart. If I shouldn\u0027t have the 16 restart version yet, then why does the Agena get that? Is this a recent change? My Agena stage is setup as a subassembly so maybe it\u0027s using old information? But then, why would the description in the VAB say the engine gets 16 restarts?\u003Cp\u003EI currently have all three tier 3 techs (Orbital Rocketry, 3-axis stability, Survivability) and one tier 4 (Orbital Science)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EYou are using different version of the Bell on your different stages. The old version can\u0027t be relit while the new versions can. By versions I mean if you right click the engine in the VAB there is an option to change the version at the bottom of that menu. Also you can click the \u0022Open Engine GUI\u0022 and in there you can change the version of the engine. As you progress up various science tiers more versions become available (even set as default) in the VAB right click tab \u0026amp; gui.\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-02-19T20:41:26Z","Content":"\n\u003Cp\u003Echrisl: Does it say 16 ignitions when you hover over the part on your craft, or just in the info box from the parts list? You most certainly do \u003Cem\u003Enot\u003C/em\u003E have the nodes unlocked for the relightable Agena engine, so that\u0027s clearly the issue, the only question is if the part on the craft in the VAB is not displaying correctly, or if you\u0027re thinking that something displayed about the default configuration (what you see in the parts list) is true for all configurations.\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-02-19T21:46:42Z","Content":"\n\u003Cp\u003EEverytime I revert flight with a rocket it zooms me out of the VAB and I have to zoom all the way back in.\u003C/p\u003E\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-02-19T23:02:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BevoLJ\u0022 data-cite=\u0022BevoLJ\u0022\u003E\u003Cdiv\u003EYou are using different version of the Bell on your different stages. The old version can\u0027t be relit while the new versions can. By versions I mean if you right click the engine in the VAB there is an option to change the version at the bottom of that menu. Also you can click the \u0022Open Engine GUI\u0022 and in there you can change the version of the engine. As you progress up various science tiers more versions become available (even set as default) in the VAB right click tab \u0026amp; gui.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003Echrisl: Does it say 16 ignitions when you hover over the part on your craft, or just in the info box from the parts list? You most certainly do \u003Cem\u003Enot\u003C/em\u003E have the nodes unlocked for the relightable Agena engine, so that\u0027s clearly the issue, the only question is if the part on the craft in the VAB is not displaying correctly, or if you\u0027re thinking that something displayed about the default configuration (what you see in the parts list) is true for all configurations.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m guessing this is a recent change to the Bell engine. Like I said, I\u0027m using a subassembly for my Agena stage. When I hover over the engine actually on the Agena stage of my rocket, it says \u0022Ignitor: Hypergolic(16).\u0022. And when I right-click and select \u0022Show Engine GUI\u0022, the \u0022Configure Bell 80XX\u0022 window is completely blank. Also, the right-click menu has options for Show Engine GUI, Lock Gimbal, Assign Group ID, Clear Group ID, Bell 8048 and Tech Level.\u003C/p\u003E\u003Cp\u003EHowever, when I hover over the engine on the satelite (third) stage, it says, \u0022Ignitor: Hypergolci(1).\u0022. It\u0027s right-click menu has options for Show Engine GUI, Lock Gimbal, Assign Group Id, Clear Group ID, and Bell-8048. Notice there is a dash in \u0022Bell-8048\u0022 and no Tech Level option. And when I select \u0022Show Engine GUI\u0022, the Configure Bell 80XX window actually shows information. Says I lack the tech for the Bell-8081 and Bell-8247.\u003C/p\u003E\u003Cp\u003EI can only assume that the engine on my Agena stage is from before a recent update that messed with the Bell engine. That explains that.\u003C/p\u003E\u003Cp\u003EI would suggest updating the description of the Bell 80XX so it indicates that the relightable version is a later version. The description now is rather confusing, especially if you don\u0027t realize there were later versions of the Bell engine.\u003C/p\u003E\u003Cp\u003EI am still curious as to which tech is needed for the better Bell engine. According to the wiki I\u0027m reviewing, the Agena B (using Bell 8081) flew from 1961-65 and according to the tech screen, \u0022Orbital Rocketry\u0022 (which I have) is 1958-62 which would technically include both the 8048 and 8081.\u003C/p\u003E\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-02-20T00:43:15Z","Content":"\n\u003Cp\u003EThink there might be a problem with the Altair (X-248) Solid Kick Motor, though this may be an RP-0 problem. Anyway, I noticed that it now has a stated thrust of 1957.218.\u003C/p\u003E\n"},{"CreatedByName":"Kerbolution","CreatedById":84965,"CreatedDateTime":"2015-02-22T17:56:54Z","Content":"\n\u003Cp\u003ESooo, does anybody have a suggestion for an ISRU mod that goes well with Realism Overhaul? I tinkered a bit with UKS and Karbonite (to get the mining and greenhouses part), but am not sure if that\u0027s the road to go.\u003C/p\u003E\n"},{"CreatedByName":"Carlo","CreatedById":138644,"CreatedDateTime":"2015-02-25T07:45:23Z","Content":"\n\u003Cp\u003Eedited\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-25T09:18:50Z\u0022 title=\u002202/25/2015 09:18  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 25, 2015\u003C/time\u003E by Carlo\u003C/strong\u003E\n\u003Cbr\u003Ewrong thread\n\u003C/span\u003E\n"},{"CreatedByName":"Dean.A.","CreatedById":137533,"CreatedDateTime":"2015-02-25T09:47:29Z","Content":"\n\u003Cp\u003EGreetings to anyone that reads this.\u003C/p\u003E\u003Cp\u003EI am new to KSP and have only been with it for about 1 month or less. I love the game but i wanted some more realistic parameters of game play so i am very attracted to the Real Solar System and Realism Overhaul mods, i have used them for about 3 weeks at most and spent 2 weeks and continuing to find out why i have a issue with spontaneous rocket explosions.\u003C/p\u003E\u003Cp\u003ESo the first week i had the RSS and RO mods everything seemed good, but of course i did not have many mods at all when i was trialing it.\u003C/p\u003E\u003Cp\u003EThan i assumed everything was sweet and that i will download a few more mods on the supported mods list, but than .... hit the fan.\u003C/p\u003E\u003Cp\u003EEVERY time i launch a rocket they explode for reasons not fully known to myself, i would appreciate any help and tips.\u003C/p\u003E\u003Cp\u003ESo ill give you the story.\u003C/p\u003E\u003Cp\u003EI used the mod for about 1 week and was very happy with it, than i thought i would add to it with a few more mods in the supported mods list. So i got a few than every rocket i used (Mod or stock) started exploding, i removed ALL mods and even uninstalled and re installed the game close to 10 times now and am finally reduced to applying 1 mod at a time and testing each mod with 3 rocket flights.\u003C/p\u003E\u003Cp\u003E(I have also used the supported spaceX and ESA rockets and same thing happens, BOOM)\u003C/p\u003E\u003Cp\u003EAt this stage i am not 100% sure what the problem is but i think it is related to the Realism Overhaul mod, when it is applied it changes the dimensions of the components in such a way that they do not fit together right, and i think this makes a weak point that results in an explosions when the slightest turn is made at velocities over ~300m/s.\u003C/p\u003E\u003Cp\u003EI predominantly am using the OLDD proton rocket and it is the only RO supported rocket i want to use and i know its not a direct issue with the that rocket cause i have tested other stock rockets too as well as test the OLDD proton without the RO mod.\u003C/p\u003E\u003Cp\u003ESo i am about 80% sure the RO mod is doing something very strange but i cannot quite work it out cause its such an odd thing that happens.\u003C/p\u003E\u003Cp\u003EIf anyone knows a solution please let me know by replying here or with a PM.\u003C/p\u003E\u003Cp\u003EP.S.\u003C/p\u003E\u003Cp\u003EIf my future RSS/RO gaming is to continue my beloved OLDD Proton-K rocket must stop exploding (its not the rockets fault though). Also note that the RO mod changes the size of the proton rocket so that the engines do not fit right (still works though). So again, i am very sure it is something to do with the RO re-sizing.\u003C/p\u003E\u003Cp\u003EPLEASE HELP\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-25T09:52:39Z\u0022 title=\u002202/25/2015 09:52  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 25, 2015\u003C/time\u003E by Dean.A.\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Felger","CreatedById":76828,"CreatedDateTime":"2015-02-25T22:28:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dean.A.\u0022 data-cite=\u0022Dean.A.\u0022\u003E\u003Cdiv\u003EGreetings to anyone that reads this.\u003Cp\u003EI am new to KSP and have only been with it for about 1 month or less. I love the game but i wanted some more realistic parameters of game play so i am very attracted to the Real Solar System and Realism Overhaul mods, i have used them for about 3 weeks at most and spent 2 weeks and continuing to find out why i have a issue with spontaneous rocket explosions.\u003C/p\u003E\u003Cp\u003ESo the first week i had the RSS and RO mods everything seemed good, but of course i did not have many mods at all when i was trialing it.\u003C/p\u003E\u003Cp\u003EThan i assumed everything was sweet and that i will download a few more mods on the supported mods list, but than .... hit the fan.\u003C/p\u003E\u003Cp\u003EEVERY time i launch a rocket they explode for reasons not fully known to myself, i would appreciate any help and tips.\u003C/p\u003E\u003Cp\u003ESo ill give you the story.\u003C/p\u003E\u003Cp\u003EI used the mod for about 1 week and was very happy with it, than i thought i would add to it with a few more mods in the supported mods list. So i got a few than every rocket i used (Mod or stock) started exploding, i removed ALL mods and even uninstalled and re installed the game close to 10 times now and am finally reduced to applying 1 mod at a time and testing each mod with 3 rocket flights.\u003C/p\u003E\u003Cp\u003E(I have also used the supported spaceX and ESA rockets and same thing happens, BOOM)\u003C/p\u003E\u003Cp\u003EAt this stage i am not 100% sure what the problem is but i think it is related to the Realism Overhaul mod, when it is applied it changes the dimensions of the components in such a way that they do not fit together right, and i think this makes a weak point that results in an explosions when the slightest turn is made at velocities over ~300m/s.\u003C/p\u003E\u003Cp\u003EI predominantly am using the OLDD proton rocket and it is the only RO supported rocket i want to use and i know its not a direct issue with the that rocket cause i have tested other stock rockets too as well as test the OLDD proton without the RO mod.\u003C/p\u003E\u003Cp\u003ESo i am about 80% sure the RO mod is doing something very strange but i cannot quite work it out cause its such an odd thing that happens.\u003C/p\u003E\u003Cp\u003EIf anyone knows a solution please let me know by replying here or with a PM.\u003C/p\u003E\u003Cp\u003EP.S.\u003C/p\u003E\u003Cp\u003EIf my future RSS/RO gaming is to continue my beloved OLDD Proton-K rocket must stop exploding (its not the rockets fault though). Also note that the RO mod changes the size of the proton rocket so that the engines do not fit right (still works though). So again, i am very sure it is something to do with the RO re-sizing.\u003C/p\u003E\u003Cp\u003EPLEASE HELP\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is pretty bizarre. I\u0027ve not seen behavior like this in all my testing, could you get us some more information?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eoutput_log.txt might have some useful info (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s how to find it\u003C/a\u003E - Look halfway down the page at \u0022The Logs\u0022)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EScreenshots of the rockets exploding (f1 to take a screenshot, upload to imgur or something)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EScreenshots of the event log in-game to show what\u0027s exploding when (f3 to pull up the event log)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EScreenshot of your GameData folder\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWho knows if any of that is actually going to point us to the right solution, but it\u0027ll probably help.\u003C/p\u003E\n"},{"CreatedByName":"ColKlonk","CreatedById":137078,"CreatedDateTime":"2015-03-01T07:58:51Z","Content":"\n\u003Cp\u003EI \u0027installed\u0027 this on the Kerbal OPM-V1.5 version, but not quite sure which mod it was \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003EDoes RSS have something similar, or does the same mod work here... and of course which mod is it ? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks for help\u003C/p\u003E\u003Cp\u003ECol\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-03-02T05:20:55Z","Content":"\n\u003Cp\u003EHaving trouble getting a Mercury pod into orbit with an Atlas rocket. I have the entierty of FASA installed and i see theres several variants of the rocket itself and the engines. Im using the largest tank and most powerful versions of each and the delta-v still falls significatly short. I tried replacing the upper tank with a procedural one and even with an extended tank i could not make orbit. Im dropping the boosters at around 4gs so i dont know if maybe thats too late and there burning too much fuel?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-02T05:23:25Z\u0022 title=\u002203/02/2015 05:23  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 2, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-03-02T17:09:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EHaving trouble getting a Mercury pod into orbit with an Atlas rocket. I have the entierty of FASA installed and i see theres several variants of the rocket itself and the engines. Im using the largest tank and most powerful versions of each and the delta-v still falls significatly short. I tried replacing the upper tank with a procedural one and even with an extended tank i could not make orbit. Im dropping the boosters at around 4gs so i dont know if maybe thats too late and there burning too much fuel?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI put my Mercury/Atlas up without too much difficulty. I used the Atlas fuel tank that was specific for the Mercury/Atlas rocket. It\u0027s not the largest Atlas tank available. Really it\u0027s just a matter of timing. When I did my Mercury/Atlas flight, I basically just watched the launch clock and at t\u002B2:15 I stage the boosters. That left me with about 4 minutes flight time on the sustainer which was just enough to push me into something like a 140km x 1.2Mm orbit. I did aim for a 230km orbit and fell back down to 140km by the time I\u0027d completed the circulization, but it was still a good orbit.\u003C/p\u003E\u003Cp\u003ELater flights I\u0027ve made with the Atlas (though not specifically Mercury/Atlas flights) I\u0027ve changed my process a bit. Rather then aiming to t\u002B2:15, I wait until my apoapsis is just about 180km, then stage the booster regardless of the flight time. That has worked well for all the satellite launches I\u0027ve done with various Atlas rockets. My guess is it should work with a Mercury/Atlas launch as well.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-03-02T17:15:25Z","Content":"\n\u003Cp\u003EThats strange the mercury-atlas tank doesn\u0027t have as much fuel as the largest one I\u0027m using and it falls short almost a thousand Dv. Flight path is very similar to yours.\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2015-03-08T19:03:18Z","Content":"\n\u003Cp\u003E-- removed: apparently I am one of those people who don\u0027t research what they are doing before they ask. Sorry!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-08T19:28:57Z\u0022 title=\u002203/08/2015 07:28  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 8, 2015\u003C/time\u003E by Ippo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BevoLJ","CreatedById":77242,"CreatedDateTime":"2015-03-09T07:28:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EHaving trouble getting a Mercury pod into orbit with an Atlas rocket. I have the entirety of FASA installed and i see theres several variants of the rocket itself and the engines. Im using the largest tank and most powerful versions of each and the delta-v still falls significantly short. I tried replacing the upper tank with a procedural one and even with an extended tank i could not make orbit. Im dropping the boosters at around 4gs so i don\u0027t know if maybe thats too late and there burning too much fuel?\u003C/div\u003E\u003C/blockquote\u003EHave you tried using the smaller tank? The Atlas\u0027 tank changed a lot over time and the larger tanks are heavy. The Atlas\u0027 tanks (especially early on) were not the strongest, safest or most reliable. To say the least. But those early ones that weren\u0027t very strong were lighter which helped them go further with less fuel.\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-03-09T07:47:09Z","Content":"\n\u003Cp\u003EOk, for whatever reason, I can\u0027t seem to get my Zarya module into orbit in my RSS/RO game using the OLDD Proton rocket! Anyone know how I should be getting to orbit?\u003C/p\u003E\n"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-03-13T16:05:05Z","Content":"\n\u003Cp\u003EGuys what are the best mods for a person that want to make perfect replica and basically nothing of more?\u003C/p\u003E\n"},{"CreatedByName":"Spica","CreatedById":65153,"CreatedDateTime":"2015-03-14T01:54:35Z","Content":"\n\u003Cp\u003EAfter messing around with RPA v.1.2 (Rocket Propulsion Analysis), I found that a fuel mixture of Diborane (B2H6) and OF2 performs VERY WELL.\u003C/p\u003E\u003Cp\u003EPracticality aside, I whipped up a config for an engine that burns that fuel, but the engine exhaust is still blue, which doesn\u0027t make sense.\u003C/p\u003E\u003Cp\u003ESince there are lots of Boron compounds in the exhaust, and boron glows bright green when it burns, I would like to make the exhaust bright green as well, yet I don\u0027t see any options to change the color of realplume exhausts.\u003C/p\u003E\u003Cp\u003EIf it is possible to easily change the exhaust color in a cfg file somewhere, I would like some help either finding said file, or changing the color some other way.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003Cp\u003ESpica\u003C/p\u003E\u003Cp\u003Ep.s I hope I posted this in the right place(I don\u0027t post often).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-15T00:05:13Z\u0022 title=\u002203/15/2015 12:05  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 15, 2015\u003C/time\u003E by Spica\u003C/strong\u003E\n\u003Cbr\u003ETiredness\n\u003C/span\u003E\n"}]}