{"TopicId":88440,"ForumId":16,"TopicTitle":"Help with getting parts to a space station","CreatedByName":"Mtshaw113","CreatedById":115693,"CreatedDateTime":"2014-10-25T02:45:00Z","PageNum":1,"Articles":[{"CreatedByName":"Mtshaw113","CreatedById":115693,"CreatedDateTime":"2014-10-25T02:45:00Z","Content":"\n\u003Cp\u003EMods: KW Rocketry, Station Science, other misc. stuff\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EHello all. I just got Station Science about a day ago, and I\u0027ve never built a space station before. I got a contract, not realizing the stations were 2.5m and are big and heavy, and now im trying to complete it.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI currently have an extremely small station up in orbit, and I was wondering if anyone has a good rocket design to get a Zoology Bay up into orbit and successfully dock with it. Im having some trouble building rockets, as I am pretty bad. Thanks for anyones help!\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"slumpie","CreatedById":121922,"CreatedDateTime":"2014-10-25T02:52:59Z","Content":"\n\u003Cp\u003EDoes it have to be cost efficient? Are you playing in sandbox or career?\u003C/p\u003E\n"},{"CreatedByName":"Mtshaw113","CreatedById":115693,"CreatedDateTime":"2014-10-25T03:01:37Z","Content":"\n\u003Cp\u003ECareer, I do have 12 million funds somehow, but i would prefer it not to be a 5 million dollar craft, or something extremely expensive\u003C/p\u003E\n"},{"CreatedByName":"Zylark","CreatedById":101018,"CreatedDateTime":"2014-10-25T09:36:54Z","Content":"\n\u003Cp\u003EIn my career save, I got a sub-assembly of a lifter capable of getting 45 Tons to a 250km orbit - nearly 60 Tons if the payload got its\u0027 own engines to do the final push under its\u0027 own power. It\u0027s a pretty simpe design as these things go, no fancy non-stock parts, Asparagus or complicated staging.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XQQWJjy.png\u0022 alt=\u0022XQQWJjy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETop to bottom: 4 way large Hub, Zoo module, Science module, Service module, 4 way large Hub. Slung underneath is the lifter itself.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003EThis { means in symmetry }\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E4th Stage - Rockomax X200-32 tank with a Skipper engine.\u003C/p\u003E\u003Cp\u003E3rd Stage - Rockomax X200-32 and a LFB KR 1x2.\u003C/p\u003E\u003Cp\u003E2nd Stage - 2x {2x Rockomax X200-32 (or just use a Jumbo - I did not have this unlocked when making this lifter) and a LFB KR 1x2.}\u003C/p\u003E\u003Cp\u003E1st Stage - 4x {S1 SRB - KD25k}\u003C/p\u003E\u003Cp\u003ESince I use Stage Recovery, each stage got plenty of Parachutes slapped onto them - and Sepatrons to make sure they do not hit anything when staging. No mishaps yet.\u003C/p\u003E\u003Cp\u003EUsing three launches, I got this in orbit so far:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Wjzo4oJ.png\u0022 alt=\u0022Wjzo4oJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELeft to right: The Hab module, Science module and then Fuel and Life Support module. Docked are two vessels, the Station Assembler that is used to dock the big heavy modules. Features a long skirt to envelop the modules, with RCS thrusters at the end for easy docking. And a unmanned little fuel-hauler to carry fuel from my Mun based Karbonite operation and back to LKO.\u003C/p\u003E\u003Cp\u003ENext up is getting two Cyclotrons to the station. Each of those weigh in at 45 Tons, so is just on the edge of what my Lifter can manage to kick into orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-25T09:41:32Z\u0022 title=\u002210/25/2014 09:41  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 25, 2014\u003C/time\u003E by Zylark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zzabur","CreatedById":94190,"CreatedDateTime":"2014-10-25T12:03:34Z","Content":"\n\u003Cp\u003EI am using this kind of design to get massive modules into orbit \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/32975489550517649/EE6F6076B8682510597C37A1940DC75E2D102823/\u0022 alt=\u0022EE6F6076B8682510597C37A1940DC75E2D102823\u0022\u003E\u003C/p\u003E\u003Cp\u003EDon\u0027t trust the DV MJ stats, i could bring this launcher into orbit, this is a Mun planetary base using a karbonite drill, it has landed on Mun karbonite hotspot with....0/ms DV left ! Boosters are very useful to lower the cost of the rocket, but can be hard to manage with FAR if you don\u0027t use the optimal thrust.\u003C/p\u003E\u003Cp\u003EI could reach orbit with 3 space station modules (about 200t each) and the munar drill (though for this one, DV is really low and you must be very careful on DV losses).\u003C/p\u003E\u003Cp\u003EI am using FAR, TAC life support, karbonite, MKS/OKS, TAC CLS, scanSAT... The design is not very aerodynamic, i guess that using nosecones will make the lander too heavy. I can send you my .craft files if you want, but you have to use same mods, or you can pick up ideas on screenshots and build your own launcher.\u003C/p\u003E\u003Cp\u003EI know my launchers are ugly, but they are efficient, i almost always use a central propulsion with 4 liquid boosters around and solid boosters for the first step. As solid boosters are often not powerful enough to take off the rocket, i calculate the final TWR and use engines to get an optimal one : either SRB then liquid boosters then main engine (lightest top module) or SRB\u002Bliquid boosters as 1st stage then main engine, or even SRB\u002Bliquid boosters\u002Bmain engine at the 1st stage, but then i often lower thrust to stay under terminal velocity. This is not the moste efficient design, but you need a lot of mower to lift these kind of heavy modules.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-10-25T12:21:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mtshaw113\u0022 data-cite=\u0022Mtshaw113\u0022\u003E\u003Cdiv\u003E...I was wondering if anyone has a good rocket design to get a Zoology Bay up...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo idea what a Zoology Bay is but I have lots of launch vehicles. What does the total payload mass?\u003C/p\u003E\n"},{"CreatedByName":"Mtshaw113","CreatedById":115693,"CreatedDateTime":"2014-10-25T14:36:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zylark\u0022 data-cite=\u0022Zylark\u0022\u003E\u003Cdiv\u003EIn my career save, I got a sub-assembly of a lifter capable of getting 45 Tons to a 250km orbit - nearly 60 Tons if the payload got its\u0027 own engines to do the final push under its\u0027 own power. It\u0027s a pretty simpe design as these things go, no fancy non-stock parts, Asparagus or complicated staging.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/XQQWJjy.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/XQQWJjy.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETop to bottom: 4 way large Hub, Zoo module, Science module, Service module, 4 way large Hub. Slung underneath is the lifter itself.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003EThis { means in symmetry }\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E4th Stage - Rockomax X200-32 tank with a Skipper engine.\u003C/p\u003E\u003Cp\u003E3rd Stage - Rockomax X200-32 and a LFB KR 1x2.\u003C/p\u003E\u003Cp\u003E2nd Stage - 2x {2x Rockomax X200-32 (or just use a Jumbo - I did not have this unlocked when making this lifter) and a LFB KR 1x2.}\u003C/p\u003E\u003Cp\u003E1st Stage - 4x {S1 SRB - KD25k}\u003C/p\u003E\u003Cp\u003ESince I use Stage Recovery, each stage got plenty of Parachutes slapped onto them - and Sepatrons to make sure they do not hit anything when staging. No mishaps yet.\u003C/p\u003E\u003Cp\u003EUsing three launches, I got this in orbit so far:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Wjzo4oJ.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Wjzo4oJ.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELeft to right: The Hab module, Science module and then Fuel and Life Support module. Docked are two vessels, the Station Assembler that is used to dock the big heavy modules. Features a long skirt to envelop the modules, with RCS thrusters at the end for easy docking. And a unmanned little fuel-hauler to carry fuel from my Mun based Karbonite operation and back to LKO.\u003C/p\u003E\u003Cp\u003ENext up is getting two Cyclotrons to the station. Each of those weigh in at 45 Tons, so is just on the edge of what my Lifter can manage to kick into orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour design looks very good actually. I just installed TAC LS, SXT, and Interstellar cause why not(But i dont really know how to use them yet lol). Do the LFB KR\u0027s on the side feed fuel into the center stage? And do you have all 3 engines and 4 boosters launching at once? Thanks everyone, I managed to get my extremely sketchy rocket into orbit with the Zoology Bay. I\u0027ll put some pictures up at some point(Its so awful lol)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-25T14:44:25Z\u0022 title=\u002210/25/2014 02:44  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 25, 2014\u003C/time\u003E by Mtshaw113\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zylark","CreatedById":101018,"CreatedDateTime":"2014-10-25T15:02:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mtshaw113\u0022 data-cite=\u0022Mtshaw113\u0022\u003E\u003Cdiv\u003EDo the LFB KR\u0027s on the side feed fuel into the center stage? And do you have all 3 engines and 4 boosters launching at once? Thanks everyone, I managed to get my extremely sketchy rocket into orbit with the Zoology Bay. I\u0027ll put some pictures up at some point(Its so awful lol)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe side LFBs\u0027 do feed the central one. The central one do not ignite until the SRBs\u0027 are spent however. Too high a TWR at the start is just wasting fuel pushing against the souposphere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}