{"TopicId":88521,"ForumId":69,"TopicTitle":"Slow loading, loading bar not working in screen/1 thing/part per minute! PLEASE HELP","CreatedByName":"DODESED","CreatedById":127302,"CreatedDateTime":"2014-10-26T01:05:35Z","PageNum":1,"Articles":[{"CreatedByName":"DODESED","CreatedById":127302,"CreatedDateTime":"2014-10-26T01:05:35Z","Content":"\n\u003Cp\u003EWhenever I start up KSP, the thing loads 1 part per minute. I have tried reinstalling with mods, without mods, removing mods, and re-installing again. This problem is persistent and annoying. I have deleted all files in GameData except for Squad and NasaMission but it still persists. I am re-installing again.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-10-26T05:09:57Z","Content":"\n\u003Cp\u003EThis sounds like a stock issue, if it\u0027s occurring without mods. I am thus moving to Umodded Installs, and would ask you to examine the stickies in this forum. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2014-10-26T05:37:30Z","Content":"\n\u003Cp\u003EDo you have any unused network adapters? If you\u0027re in windows you could be experiencing a bug where the loading time of the game is vastly increased because it tries to look for parts and other assets in those network adapters. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92228\u0022 rel=\u0022external nofollow\u0022\u003EThe bug is described here, under \u0027windows specific\u0027\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThe workaround is to disable all networks adapters apart from the one(s) you\u0027re actually using.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-10-26T05:37:34Z","Content":"\n\u003Cp\u003ECheck your Network Connections in Control Panel. If there are any virtual network adapters installed (e.g., Hamachi, VPN services), try disabling them. And as Nathan said, we\u0027re going to have to ask that you check the stickied threads and provide some more useable information.\u003C/p\u003E\n"}]}