{"TopicId":88570,"ForumId":51,"TopicTitle":"Never Go to Eve!","CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-10-26T17:34:50Z","PageNum":1,"Articles":[{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-10-26T17:34:50Z","Content":"\n\u003Cp\u003EI\u0027ll have to collate my images and videos... but let\u0027s just say I plan to never send another Kerbal to Eve ever again!\u003C/p\u003E\u003Cp\u003ENo less than 3 completely failed attempts to rescue this poor kerbal. Possibly 100s of retries on save games. Countless glitches, including physics glitches and ladder failures (that actually caused me to hack gravity, as I\u0027m not rebuilding a craft that works on Kerbin, but causes glitches on Eve with ladders :/ ).\u003C/p\u003E\u003Cp\u003EI was finally about to ragequit, when I noticed my ascent angle was too shallow. Going nearly \u0022straight up\u0022 I just just enough DV, after some careful fuel rebalancing, to get into orbit.\u003C/p\u003E\u003Cp\u003EEve, one hell (correct use of the word?) of a planet!\u003C/p\u003E\n"},{"CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2014-10-26T20:19:27Z","Content":"\n\u003Cp\u003EYea I hear you. I\u0027m not sure if you have deadly re-entry but I attempted it with that and it made the mission even more difficult, if I didn\u0027t disintegrate then my solar panels instead would spontaneously explode. I tried using someone else\u0027s lander design but it did not have enough fuel to get into orbit.\u003C/p\u003E\u003Cp\u003ETo date, I have legitimately landed and returned a Kerbin from every body in the game except Eve. Eve is just too frustrating. I\u0027ve gotten Kerbals there but have been unable to return them. I\u0027ve tried big landers, small landers, planes, jets, ion engines, nothing works. It just requires to big of a vessel that I do not have the time and patience at this time to build. \u003C/p\u003E\u003Cp\u003EIf you attempt it again, build something that has more than enough fuel to get into orbit and plan for the worst. Don\u0027t think you will land on the highest mountain in the game because it is very difficult to do precise landings on Eve. Plan for the worst and bring enough fuel to escape from anywhere on the planet. Put more than enough parachutes and utilize expendable fuel tanks and parts.\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2014-10-27T09:45:54Z","Content":"\n\u003Cp\u003EGiven the amount of try/retry involved, I suggest the following:\u003C/p\u003E\u003Cp\u003ERun in sandbox\u003C/p\u003E\u003Cp\u003EBuild rocket\u003C/p\u003E\u003Cp\u003EHyperedit it to Eve\u003C/p\u003E\u003Cp\u003ELand\u003C/p\u003E\u003Cp\u003Etry to reorbit\u003C/p\u003E\u003Cp\u003EDon\u0027t try it \u0022for real\u0022 until you know it works. By the time you hit iteration ten of your rocket, you\u0027ll be glad.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-10-27T14:10:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sedativechunk\u0022 data-cite=\u0022sedativechunk\u0022\u003E\u003Cdiv\u003EYea I hear you. I\u0027m not sure if you have deadly re-entry but I attempted it with that and it made the mission even more difficult, if I didn\u0027t disintegrate then my solar panels instead would spontaneously explode. I tried using someone else\u0027s lander design but it did not have enough fuel to get into orbit.\u003Cp\u003ETo date, I have legitimately landed and returned a Kerbin from every body in the game except Eve. Eve is just too frustrating. I\u0027ve gotten Kerbals there but have been unable to return them. I\u0027ve tried big landers, small landers, planes, jets, ion engines, nothing works. It just requires to big of a vessel that I do not have the time and patience at this time to build. \u003C/p\u003E\u003Cp\u003EIf you attempt it again, build something that has more than enough fuel to get into orbit and plan for the worst. Don\u0027t think you will land on the highest mountain in the game because it is very difficult to do precise landings on Eve. Plan for the worst and bring enough fuel to escape from anywhere on the planet. Put more than enough parachutes and utilize expendable fuel tanks and parts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, I did bring extra, it was the only thing that made it work (it allowed my to do partial stages, and thankfully my descent/landing rockets were not needed, so I could put fuel back into a stage I antecedently emptied in orbit). But every extra part adds extra weight, and a heavy craft seems to pancake on Eve, even without timewarp/moving. It just spontaneously explodes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks Technion. I usually only try such things in Sandbox, career would be probes only. But I do try to avoid hyperedit, so it\u0027s save replays only. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-10-27T15:17:09Z","Content":"\n\u003Cp\u003EIt\u0027s hard but doable. Many people have done it including myself several times. Frustrating yes. But lots of asparagus staging helps.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-10-27T15:39:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xtoro\u0022 data-cite=\u0022xtoro\u0022\u003E\u003Cdiv\u003EIt\u0027s hard but doable. Many people have done it including myself several times. Frustrating yes. But lots of asparagus staging helps.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt used to be possible, with some effort, to get a useful payload off Eve with an SSTO powered in the atmosphere by Firespitter electric props or Karbonite jets. But both those mods have been nerfed considerably and I haven\u0027t been able to get that strategy to work lately. I think you can still do this with KSPI, though. Or perhaps Hooligan Labs blimps, although I haven\u0027t messed with them in a long time.\u003C/p\u003E\u003Cp\u003EAnyway, if all you want to do is say you\u0027ve returned from Eve, perhaps with a surface sample to prove it, then it\u0027s not fundamentally difficult, just tedious and frustrating, to build a mountain of 1.25m asparagus stacks to do it. But if you actually want to own Eve, with a colony exporting say Karborundum, then you need either an SSTO or at least something not too hard to build in quantity on-site with Extraplanetary Launchpads. Otherwise, Eve is a prison planet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-10-27T16:16:30Z","Content":"\n\u003Cp\u003EMy signature disagrees with you.\u003C/p\u003E\u003Cp\u003EI\u0027ve ascended from Eve sea level, in a 2 Kerbal Lander Can.\u003C/p\u003E\n"}]}