{"TopicId":88593,"ForumId":16,"TopicTitle":"Probes launching off of main ship with no fuel or mono","CreatedByName":"queloggs","CreatedById":127403,"CreatedDateTime":"2014-10-26T20:25:34Z","PageNum":1,"Articles":[{"CreatedByName":"queloggs","CreatedById":127403,"CreatedDateTime":"2014-10-26T20:25:34Z","Content":"\n\u003Cp\u003EI built a long range ship that launches multiple probes. My problem is that when my probes launch, there is no fuel or mono in them. I do not have external fuel lines running to them (next course of action) so I suspect that they are being drained in the stage. Going to try external fuel lines but does anyone else have a suggestion in case this does not work. Thanks for the suggestions! Once I get these last bugs taken care of I\u0027ll post design to the ship exchange thing.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-26T21:21:41Z","Content":"\n\u003Cp\u003EBeginning with the obvious...\u003C/p\u003E\u003Cp\u003EDoes the large ship definitely have fuel/monoprop remaining when you launch your probes? If so you can top up the probe tanks by alt-right clicking the tanks and doing a manual fuel transfer.\u003C/p\u003E\u003Cp\u003EIf you haven\u0027t already invested a lot of time in the mission, you could start again from launch and make sure that the tanks in question are shut off, also by right-clicking the part and clicking the little button next to the fuel level indicator.\u003C/p\u003E\u003Cp\u003EUnless it\u0027s been changed in a recent patch, fuel/monoprop shouldn\u0027t cross over decouplers, so if you\u0027re using docking ports you could consider replacing them.\u003C/p\u003E\u003Cp\u003EA few pictures of the craft in question showing how the probes are undocked and the respective tank levels would be an advantage.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-26T21:29:10Z","Content":"\n\u003Cp\u003EFor monopropellant, the game tries to drain the lowest stages first. Fuel lines have no effect. That\u0027s fine for a single rocket, but will cause decouplable probes to lose their monoprop before the main ship. The resolution is to disable fuel flow from the probes\u0027 monoprop tanks, by right-clicking them (either in the VAB or flight) and changing the green arrow to a red no sign.\u003C/p\u003E\n"},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2014-10-26T23:02:23Z","Content":"\n\u003Cp\u003EThis happens when the ships are docked to the main ship. The fuel of this probes will normally be further away than most other tanks and thus the ship will use it\u0027s fuel before other ones. There are some solutions to this:\u003C/p\u003E\u003Cp\u003EYou can disable this in the dock, but it\u0027s not persistent. \u003C/p\u003E\u003Cp\u003EAnother solution is to trasfer the necessary fuel before undocking (mod\u002Bclick on both parts, check the wiki). \u003C/p\u003E\u003Cp\u003EYou could also just disable every tank in the probes before launch so their fuel is not spent until you need it.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-10-26T23:43:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003EUnless it\u0027s been changed in a recent patch, fuel/monoprop shouldn\u0027t cross over decouplers, so if you\u0027re using docking ports you could consider replacing them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMonoprop will cross decouplers. It\u0027s been that way since at least 0.24, and I think 0.23.5. Cantab is correct that it drains from lower stages first.\u003C/p\u003E\u003Cp\u003EThe fuel (presumably LF/O) issue sounds like a docking issue, it does not cross over decouplers. The best solution is, again, what cantab suggested: lock the fuel and oxidizer tanks.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-10-27T03:19:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EThe fuel (presumably LF/O) issue sounds like a docking issue, it does not cross over decouplers. The best solution is, again, what cantab suggested: lock the fuel and oxidizer tanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFuel actually will transfer through a decoupler, if the child part connected to the decoupler allows crossfeed and is not a fuel tank. The decouplers are actually crossfeed capable, but have a small bit of special case logic that stops the crossfeed if it\u0027s a fuel tank connected to the jettison side. This is something that often bites people when they use things like cubic struts to connect to a decoupler.\u003C/p\u003E\u003Cp\u003EMonopro has been a \u0022transfer to anywhere on the ship\u0022 type resource for many versions. It wasn\u0027t until recently (either 0.23.5 or 0.24) where it was set up so that it drains from the latest stages first. Xenon works the same way.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2014-10-27T17:20:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EFuel actually will transfer through a decoupler, if the child part connected to the decoupler allows crossfeed and is not a fuel tank. The decouplers are actually crossfeed capable, but have a small bit of special case logic that stops the crossfeed if it\u0027s a fuel tank connected to the jettison side. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou learn something everyday.\u003C/p\u003E\u003Cp\u003EIs this mentioned/tested anywhere? Never heard of it before.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-27T17:38:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bakanando\u0022 data-cite=\u0022bakanando\u0022\u003E\u003Cdiv\u003EYou learn something everyday.\u003Cp\u003EIs this mentioned/tested anywhere? Never heard of it before.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64362\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E. An example \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64362-Fuel-Flow-Rules-%280-24-2%29?p=886926\u0026amp;viewfull=1#post886926\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EI believe it only applies to radial decouplers, but am not 100% sure.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-10-28T00:48:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EFuel actually will transfer through a decoupler, if the child part connected to the decoupler allows crossfeed and is not a fuel tank. The decouplers are actually crossfeed capable, but have a small bit of special case logic that stops the crossfeed if it\u0027s a fuel tank connected to the jettison side. This is something that often bites people when they use things like cubic struts to connect to a decoupler.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIm not going to argue the point, because I trust both Claw and RIC on this.\u003C/p\u003E\u003Cp\u003EBut this is some serious WTF logic. The devs really need to clean up their code.\u003C/p\u003E\n"},{"CreatedByName":"DeathSabre","CreatedById":57730,"CreatedDateTime":"2014-10-29T14:02:31Z","Content":"\n\u003Cp\u003EI\u0027ve had problems with cargo ssto\u0027s using fuel from their cargo in the past. the best solution I had was to clip your camera through the cargobay/ or open it on the runway/launchpad.\u003C/p\u003E\u003Cp\u003Eand disable the fuel in them so nothing can use that fuel.\u003C/p\u003E\u003Cp\u003Ejust be careful if you disable electricity on your probe. that you re-enable it before undocking/decoupling your probe from the SSTO or you will have an unusable piece of junk in orbit.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-29T14:10:39Z","Content":"\n\u003Cp\u003ELast I checked you could enable and disable resources without control, or has that been changed?\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-10-29T18:01:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ELast I checked you could enable and disable resources without control, or has that been changed?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI also have not checked recently, but as far as I know it hasn\u0027t been changed.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"}]}