{"TopicId":88641,"ForumId":16,"TopicTitle":"X-Axis swapped by Default? (Spaceplane)","CreatedByName":"Th3F3aR","CreatedById":124827,"CreatedDateTime":"2014-10-27T08:35:49Z","PageNum":1,"Articles":[{"CreatedByName":"Th3F3aR","CreatedById":124827,"CreatedDateTime":"2014-10-27T08:35:49Z","Content":"\n\u003Cp\u003EHi there,\u003C/p\u003E\u003Cp\u003Ei tried to design SSTOs and failed on circularization or even takeoff, somehow i don\u0027t manage to get an adequate dV or thrust for my planes.\u003C/p\u003E\u003Cp\u003EI started off with normal planes which are quite good working but now i thought about taking the next step for satellite deployment and shove it into a SSTO. \u003C/p\u003E\u003Cp\u003EThe problem is that the ones i got up most times failed to circularize or the ones not able to take-off, yeah .... crash \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI assumed having not enough Thrust to lift but with 4 RAPIER Engines and 2 LV-N I think i got enough power to lift a 15 to 30 Ton plane. \u003C/p\u003E\u003Cp\u003ETherefore i checked my Elevons on the Mainwings and saw that on pressing W (up) they went up instead of down, which basically means they are inverted?\u003C/p\u003E\u003Cp\u003EAlso plonking them at angled wings is a pain and i don\u0027t understand how to do this right. My wings are not angled, maybe thats the problem?\u003C/p\u003E\u003Cp\u003EMy question is this correct or did i mount them wrong? Or is my Liftproblem caused by not enough control surfaces, i usually use wings and elevons with one or 2 main ruders on the end of the plane trying to keep the liftmarker slightly behind the mass. \u003C/p\u003E\u003Cp\u003EMight it be the fact that the Liftmarker sometimes is above the mass ?\u003C/p\u003E\u003Cp\u003EThanks for intel.\u003C/p\u003E\u003Cp\u003E(Can not post a screenie, at work :/ )\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-27T09:59:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Th3F3aR\u0022 data-cite=\u0022Th3F3aR\u0022\u003E\u003Cdiv\u003EMy question is this correct or did i mount them wrong? Or is my Liftproblem caused by not enough control surfaces, i usually use wings and elevons with one or 2 main ruders on the end of the plane trying to keep the liftmarker slightly behind the mass. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EControl surfaces are reasonably smart: they will move into the right direction depending on where they are in relation to your center of mass. Elevons near the rear of your plane will need to push the tail down in order to bring the nose up. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Th3F3aR\u0022 data-cite=\u0022Th3F3aR\u0022\u003E\u003Cdiv\u003EI started off with normal planes which are quite good working but now i thought about taking the next step for satellite deployment and shove it into a SSTO.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour plane should have a TWR \u0026gt; 1 from the get-go (1). That means it must be possible to make a vertical take-off. If that won\u0027t work, you don\u0027t have enough thrust. (Rolling start is usually better -- vertical take-off is only testing your TWR.) Other than that, standard airplane rules apply. We\u0027ll need a screeny before we can talk aerodynamics, though.\u003C/p\u003E\u003Cp\u003EA good spaceplane can almost make orbit on Jets alone, apo-/periapsis of 80/20km is common. A short squirt from a tiny rocket motor will suffice to make a stable orbit -- OK, so you\u0027re impatient and want to use the rockets earlier, in order to get there in less than twenty minutes. You will still only need perhaps 500m/s worth of rocket power in order to make orbit. There\u0027s no point in bringing the heavy LV-Ns unless you want to go (at least) to the Mun and back. If your plane is so lightweight that it can take off on four Rapiers, you *definitely* shouldn\u0027t bring more than one nuclear engine.\u003C/p\u003E\u003Cp\u003EThere\u0027s also no point in using Rapiers if you\u0027re carrying dedicated rocket motors. I suggest you rebuild your plane with four Turbojets and two 48-7s (2); the turbojets have more power (even more so at speeds \u0026gt;2000m/s), and you can keep them running in parallel to the rockets. With shutting down one pair of jets and throttling down the other, you can milk the jets for some extra thrust up to 40km or higher, even while the rockets are already running.\u003C/p\u003E\u003Cp\u003EIt\u0027s absolutely mandatory that you can take the 30km barrier, though. If your jets allow sustained flight at 30km, that means you\u0027re going ~2000m/s, which happens to be almost escape velocity -- enough for a 80/-30km orbit, at any rate. And the higher you get, the less thrust is necessary to maintain that speed. If you can fly at 30km, you can also escape the atmosphere on jets alone.\u003C/p\u003E\u003Cp\u003EA plane that \u0022only\u0022 makes 1600m/s at 26km can still be brought to orbit with comparatively little rocket power, of course; but you\u0027ll need more powerful rockets and the fuel to drive them. If you can do that, you should definitely try to ditch most of the rockets and fuel -- this will save a lot of weight, and with the craft being lighter you may well find that you no longer need them.\u003C/p\u003E\u003Cp\u003E(1) TWR \u0026gt; 1 isn\u0027t strictly necessary, but as long as you\u0027re still struggling to make space at all, I strongly suggest you stay above that threshold.\u003C/p\u003E\u003Cp\u003E(2) a single 48-7 would suffice, actually. But from the description of your craft, you need two rocket motors for symmetry.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-27T10:11:25Z\u0022 title=\u002210/27/2014 10:11  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 27, 2014\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-10-27T11:46:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Th3F3aR\u0022 data-cite=\u0022Th3F3aR\u0022\u003E\u003Cdiv\u003ETherefore i checked my Elevons on the Mainwings and saw that on pressing W (up) they went up instead of down, which basically means they are inverted?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EW is not up, it is the same as pushing forward on a joystick, which pitches down.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-27T11:53:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Th3F3aR\u0022 data-cite=\u0022Th3F3aR\u0022\u003E\u003Cdiv\u003EThe problem is that the ones i got up most times failed to circularize or the ones not able to take-off, yeah .... crash \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003ETherefore i checked my Elevons on the Mainwings and saw that on pressing W (up) they went up instead of down, which basically means they are inverted?\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EMy question is this correct or did i mount them wrong?\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EMight it be the fact that the Liftmarker sometimes is above the mass ?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat you\u0027re perceiving as an elevon issue is probably unrelated to your inability to circularise an orbit, but it could have something to do with why you\u0027re not getting off the ground. However, if you\u0027re wasting a lot of fuel in reaching orbit altitude due to an inefficient design, that could still be related.\u003C/p\u003E\u003Cp\u003Ey-axis inversion is a question of personal preference. In your typical plane, pressing forwards on the control column (joystick) - your W key - would cause the aircraft to descend. However, in microlights, and some other light aircraft that use a yoke to steer, pressing forward causes the aircraft to climb. Either is a legitimate way to organise your control keys, but most people find one way naturally intuitive and the other simply confusing.\u003C/p\u003E\u003Cp\u003ETherefore, in terms of what your elevons do when you press W, it firstly depends on which way around you normally expect or prefer your keys to work, especially if you\u0027ve changed any keybinds. I have a feeling that you might be able to tweak their steering direction in the VAB/SPH but I rarely do this.\u003C/p\u003E\u003Cp\u003ESecondly, it also depends on where the elevons are located in relation to the CoM (assuming a profile view). A surface that tips downwards at the back of the plane - behind the CoM - would cause the tail to rise, and the plane to descend. The same movement at the front of the plane - in front of the CoM - would cause the nose to rise, and the plane would climb. Also, if the control surfaces are close to the CoM, they\u0027ll have little or no effect on pitch, but they might perform as airbrakes.\u003C/p\u003E\u003Cp\u003EThe \u0022liftmarker\u0022, or CoL, being above the CoM shouldn\u0027t affect the plane\u0027s flight characteristics too much as long as it\u0027s still in the right kind of place behind the CoM.\u003C/p\u003E\u003Cp\u003EA few pictures of your aircraft would definitely help get to the bottom the problem if this doesn\u0027t help.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-27T11:57:29Z\u0022 title=\u002210/27/2014 11:57  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 27, 2014\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-10-27T12:06:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003EHowever, in microlights, and some other light aircraft that use a yoke to steer, pressing forward causes the aircraft to climb. Either is a legitimate way to organise your control keys, but most people find one way naturally intuitive and the other simply confusing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have *NEVER* heard of a plane where the controls are configured such that pushing forward causes the nose to pitch up, ad I would very much like to see evidence for that.\u003C/p\u003E\u003Cp\u003EIt simply boggles the mind that someone would make a plane with controls that go agaisnt the instinct of 99.999% of pilots everywhere.\u003C/p\u003E\u003Cp\u003EThe only case I can think of that is remotely similar to what you describe, are weightshift controlled aircraft, ie a hangglider/Trike, where the control frame is pushed forward relative to the pilot (but really, its pushing the pilot or pilot\u002B trike backward, shifting weight backwards).\u003C/p\u003E\u003Cp\u003EIf its anything else, I think the designer should be shot.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-27T12:16:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EI have *NEVER* heard of a plane where the controls are configured such that pushing forward causes the nose to pitch up, ad I would very much like to see evidence for that.\u003Cp\u003EIt simply boggles the mind that someone would make a plane with controls that go agaisnt the instinct of 99.999% of pilots everywhere.\u003C/p\u003E\u003Cp\u003EThe only case I can think of that is remotely similar to what you describe, are weightshift controlled aircraft, ie a hangglider/Trike, where the control frame is pushed forward relative to the pilot (but really, its pushing the pilot or pilot\u002B trike backward, shifting weight backwards).\u003C/p\u003E\u003Cp\u003EIf its anything else, I think the designer should be shot.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://blog.nasm.si.edu/aviation/ultralights-are-for-the-birds/\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E is what I had in mind. It\u0027s essentially as you say, changing the relationship between the aerofoils and the mass, but then it could be argued that that\u0027s what \u003Cem\u003Eall\u003C/em\u003E control surfaces do.\u003C/p\u003E\u003Cp\u003EI\u0027ve found that my friends who grew up on a diet of FPS games struggle with W pitching down and S up. As I said, it\u0027s a question of preference - as are all keybinds, really!\u003C/p\u003E\u003Cp\u003EEdit: Google Image Search \u0022Microlight\u0022 and you\u0027ll see this is a pretty common control arrangement.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-10-27T12:24:41Z","Content":"\n\u003Cp\u003EIn my experience, control surfaces are pretty dumb. They react to their rotational alignment and whatever control inputs are enabled, but won\u0027t reverse themselves or operate proportionally based on where they\u0027re placed on the longitudinal axis.\u003C/p\u003E\u003Cp\u003E I place any elevators or ailerons behind the COM and canards ahead.\u003C/p\u003E\u003Cp\u003E We really need an official test of this...\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-27T12:29:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EI place any elevators or ailerons behind the COM and canards ahead.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAilerons don\u0027t need to be in front or behind the CoM, as long as they\u0027re spaced wide enough apart. Elevators OR Canards are a must.\u003C/p\u003E\u003Cp\u003ESee \u003Ca href=\u0022http://selair.selkirk.bc.ca/training/aerodynamics/configurations.htm\u0022 rel=\u0022external nofollow\u0022\u003Ethis neat article\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-10-27T13:15:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003EAilerons don\u0027t need to be in front or behind the CoM, as long as they\u0027re spaced wide enough apart. Elevators OR Canards are a must.\u003Cp\u003ESee \u003Ca href=\u0022http://selair.selkirk.bc.ca/training/aerodynamics/configurations.htm\u0022 rel=\u0022external nofollow\u0022\u003Ethis neat article\u003C/a\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Apologies, I mean using a KSP \u0022aileron\u0022 part as an elevator/ canard. In my experience, placing it ahead of the CoM will not make it reverse it\u0027s direction and start acting like a canard.\u003C/p\u003E\u003Cp\u003E Likewise, placing a canard in back will not make it act like an elevator.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-27T13:42:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EApologies, I mean using a KSP \u0022aileron\u0022 part as an elevator/ canard. In my experience, placing it ahead of the CoM will not make it reverse it\u0027s direction and start acting like a canard.\u003Cp\u003E Likewise, placing a canard in back will not make it act like an elevator.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust fired up KSP and made a testing rig. Took me three minutes. AV-R8 winglet, standard canard, and wing-with-elevon: all three honor their position relative to the CoM. I won\u0027t take the time to make and post screenshots, though -- I\u0027m at work after all.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-10-27T13:55:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://blog.nasm.si.edu/aviation/ultralights-are-for-the-birds/\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E is what I had in mind.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is not a yolk, that is fundamentally different. I know of this form of control input quite well.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/x1B-TvyZmsQ?start=84\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/x1B-TvyZmsQ?start=160\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/x1B-TvyZmsQ?start=175\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E^that is me.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt\u0027s essentially as you say, changing the relationship between the aerofoils and the mass, but then it could be argued that that\u0027s what \u003Cem\u003Eall\u003C/em\u003E control surfaces do.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, there are control surfaces, and there are controls. FWIW, hanggliders(excepting rigidwings) and trikes have no control surfaces.\u003C/p\u003E\u003Cp\u003EWith control surfaces, you move the center of lift, with weightshift, you move the center of mass (although in a flex wing hangglider, shifting the weight does noticably warp the wing, soch that roll inputs are much more effective)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEdit: Google Image Search \u0022Microlight\u0022 and you\u0027ll see this is a pretty common control arrangement.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is not a flight yolk or a joystick - that is the control frame, two downtubes and a basetube.\u003C/p\u003E\u003Cp\u003EI know of no 3axis control aircraft that allows you to push forward and have that pitch up.\u003C/p\u003E\u003Cp\u003EBasically, if it controls control surfaces, pushing forward makes it pitch down.\u003C/p\u003E\u003Cp\u003EIf you are just shifting weight, shifting the weight forward makes it pitch down.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-10-27T14:28:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EJust fired up KSP and made a testing rig. Took me three minutes. AV-R8 winglet, standard canard, and wing-with-elevon: all three honor their position relative to the CoM. I won\u0027t take the time to make and post screenshots, though -- I\u0027m at work after all.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame here. I routinely use AV-R8\u0027s and Standard Canards as tailplane elevators. No problems at all. Ditto for jumbo canards made from wing \u002B control surfaces.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-10-27T15:48:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003ESame here. I routinely use AV-R8\u0027s and Standard Canards as tailplane elevators. No problems at all. Ditto for jumbo canards made from wing \u002B control surfaces.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Cool! I stand corrected, then. I\u0027ll have to make use of that...\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Dogface","CreatedById":75396,"CreatedDateTime":"2014-10-27T21:47:24Z","Content":"\n\u003Cp\u003EI had a similar problem. It was that I had multiple control parts. And the wrong one had control. Before you take off, select \u0022control from here\u0022 on the part which gives the proper nav-ball orientation.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-28T01:04:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EThat is not a yolk, that is fundamentally different.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you mean \u003Ca href=\u0022https://en.wikipedia.org/wiki/Yoke_%28aeronautics%29\u0022 rel=\u0022external nofollow\u0022\u003Eyoke\u003C/a\u003E. Perhaps more correctly I should have used the term \u0027control bar\u0027.\u003C/p\u003E\u003Cp\u003ENot that I in any way particularly disagree with your post (apart from the spelling \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E), I\u0027m not sure what the purpose of saying it is. I\u0027m not confused about how a plane is controlled, I\u0027m just trying to help the OP out with his problem, and being as clear as I can about what could be causing it. If he preferred to invert the pitch keybinds (as a number of people I know, albeit a minority, do) that could make a lengthy explanation totally unclear.\u003C/p\u003E\u003Cp\u003EStill, kudos to you for knowing your $h*t.\u003C/p\u003E\n"},{"CreatedByName":"Higgs","CreatedById":121852,"CreatedDateTime":"2014-10-28T01:23:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EW is not up, it is the same as pushing forward on a joystick, which pitches down.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe op if i read him right stated that pushing W caused the control surface to pitch up, which is inverted from what irl is.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-28T01:26:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Higgs\u0022 data-cite=\u0022Higgs\u0022\u003E\u003Cdiv\u003EThe op if i read him right stated that pushing W caused the control surface to pitch up, which is inverted from what irl is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes if it\u0027s an elevator, no if it\u0027s a canard.\u003C/p\u003E\u003Cp\u003EThe difference is related to where the surface is in relation to the CoM. In front = canard, behind = elevator.\u003C/p\u003E\u003Cp\u003EWhat he said was:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Th3F3aR\u0022 data-cite=\u0022Th3F3aR\u0022\u003E\u003Cdiv\u003Ei checked my Elevons on the Mainwings and saw that on pressing W (up) they went up instead of down\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebut without knowing where the CoM is, it\u0027s not really possible to say which way they \u003Cem\u003Eshould\u003C/em\u003E move.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-28T01:29:43Z\u0022 title=\u002210/28/2014 01:29  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 28, 2014\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Higgs","CreatedById":121852,"CreatedDateTime":"2014-10-28T02:46:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe difference is related to where the surface is in relation to the CoM. In front = canard, behind = elevator.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis sounds exceptionally condescending. As an RC pilot i take exception to your phrasing. I am well aware of what control surfaces are. Flaps, ailerons, elevators, rudders, elevons and so on are. I am not sure of your intensions but I am decidedly offended.\u003C/p\u003E\u003Cp\u003Ereasons:\u003C/p\u003E\u003Cp\u003E1. I am a pilot, even if only RC with real stick time on a Cessna 182.\u003C/p\u003E\u003Cp\u003E2. I pointed out that the op stated how his control surfaces reacted to HIS inputs and you then make a condescending remark to me.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-10-28T02:59:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Higgs\u0022 data-cite=\u0022Higgs\u0022\u003E\u003Cdiv\u003EThis sounds exceptionally condescending. As an RC pilot i take exception to your phrasing. I am well aware of what control surfaces are. Flaps, ailerons, elevators, rudders, elevons and so on are. I am not sure of your intensions but I am decidedly offended.\u003Cp\u003Ereasons:\u003C/p\u003E\u003Cp\u003E1. I am a pilot, even if only RC with real stick time on a Cessna 182.\u003C/p\u003E\u003Cp\u003E2. I pointed out that the op stated how his control surfaces reacted to HIS inputs and you then make a condescending remark to me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Honestly, this is probably just a misunderstanding. Text doesn\u0027t convey emotion and it\u0027s really easy to confuse the intent behind the words. \u003C/p\u003E\u003Cp\u003E When dealing with people who play KSP, I default to \u0022he / she didn\u0027t mean anything by it\u0022 because this game attracts a certain personality type who strive to be very precise in what they\u0027re saying. That precision can come off as condescending, but it\u0027s almost never intended to be that way.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"mdkendall","CreatedById":114550,"CreatedDateTime":"2014-10-28T06:18:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Th3F3aR\u0022 data-cite=\u0022Th3F3aR\u0022\u003E\u003Cdiv\u003E...Also plonking them [elevons] at angled wings is a pain and i don\u0027t understand how to do this right.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs the question how to attach control surfaces to wings that are angled, and have the control surfaces be at the correct angle?\u003C/p\u003E\u003Cp\u003EThe best way I have found to do it is to put the wings on straight, then attach the control surfaces, then pull the wings off (the control surfaces will come with them) and put them back on angled how you want.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-10-28T09:19:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003EI think you mean \u003Ca href=\u0022https://en.wikipedia.org/wiki/Yoke_%28aeronautics%29\u0022 rel=\u0022external nofollow\u0022\u003Eyoke\u003C/a\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ED\u0027oh! I derpted. Technically it is still correct, it is not an egg yolk either \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EBasically, when it comes down to it, if I rotate the controls one way, I want the aircraft to rotate the same way.\u003C/p\u003E\u003Cp\u003EIf the control pivot is below where I am holding them, this means that pushing forward should pitch down.\u003C/p\u003E\u003Cp\u003EIn a hangglider, you hang underneath, and the \u0022pivot\u0022 is above you (note that the control frame does not move at all in relation to the aircraft/wing, just your body, in a trike there is your body and some structure - wheels and a mounted engine basically, but I still wouldn\u0027t consider that the main aircraft), and thus controls are \u0022reversed\u0022 if you think of it as moving the control frame. To roll left, you push the control frame right. Yet... to roll left, you move your body left. Again... its best thought of as moving your body, not the controlframe.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003EYes if it\u0027s an elevator, no if it\u0027s a canard.\u003Cp\u003EThe difference is related to where the surface is in relation to the CoM. In front = canard, behind = elevator.\u003C/p\u003E\u003Cp\u003EWhat he said was:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ei checked my Elevons on the Mainwings and saw that on pressing W (up) they went up instead of down\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebut without knowing where the CoM is, it\u0027s not really possible to say which way they \u003Cem\u003Eshould\u003C/em\u003E move.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, I simply assumed they were behind the CG. For most designs with a \u0022main wing\u0022, the trailing edge of the main wing is behind the CG. Yet there are numerous possible designs where this is not the case - although it depends what you call a \u0022main wing\u0022 (is a wing providing only 51% of the lift still a main wing?).\u003C/p\u003E\u003Cp\u003EIt does depend on his specific craft, and it was probably premature to think that he simply wanted his controls to be inverted.\u003C/p\u003E\u003Cp\u003E*edit* ah, reading it again, its again clear to me (as it was when I first responded), that he does want inverted controls.\u003C/p\u003E\u003Cp\u003EHe stated:\u003C/p\u003E\u003Cp\u003E\u0022...and saw that on pressing W (up) they went...\u0022\u003C/p\u003E\u003Cp\u003EW is not \u0022up\u0022 for standard controls.\u003C/p\u003E\u003Cp\u003EIt is working as intended.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-28T10:15:51Z\u0022 title=\u002210/28/2014 10:15  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 28, 2014\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-28T13:15:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Higgs\u0022 data-cite=\u0022Higgs\u0022\u003E\u003Cdiv\u003EI am not sure of your intensions but I am decidedly offended.\u003Cp\u003Ereasons:\u003C/p\u003E\u003Cp\u003E1. I am a pilot, even if only RC with real stick time on a Cessna 182.\u003C/p\u003E\u003Cp\u003E2. I pointed out that the op stated how his control surfaces reacted to HIS inputs and you then make a condescending remark to me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m very sorry if you\u0027re offended, there was certainly no malicious or scathing intent. I was simply trying to keep a line of clarity between actual input and expected output. The OP may be less experienced than you when it comes to control surfaces. As it happens, I\u0027m not a pilot, tho I have flown RC and spent a lot of time in Flight Sims. I do, however, know a thing or two about the theory of flight - a personal hobby.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EHonestly, this is probably just a misunderstanding. Text doesn\u0027t convey emotion and it\u0027s really easy to confuse the intent behind the words. \u003Cp\u003E When dealing with people who play KSP, I default to \u0022he / she didn\u0027t mean anything by it\u0022 because this game attracts a certain personality type who strive to be very precise in what they\u0027re saying. That precision can come off as condescending, but it\u0027s almost never intended to be that way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENailed it. \u002BRep\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E*edit* ah, reading it again, its again clear to me (as it was when I first responded), that he does want inverted controls.\u003Cp\u003EHe stated:\u003C/p\u003E\u003Cp\u003E\u0022...and saw that on pressing W (up) they went...\u0022\u003C/p\u003E\u003Cp\u003EW is not \u0022up\u0022 for standard controls.\u003C/p\u003E\u003Cp\u003EIt is working as intended.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, this exact phrase is probably what started me off on clearing up expected outputs. If the OP\u0027s instinctive expectations are for W to go up, then the obvious solution is to reverse the keybinds rather than learn to write left-handed (if you see what I mean).\u003C/p\u003E\n"},{"CreatedByName":"DeathSabre","CreatedById":57730,"CreatedDateTime":"2014-10-29T13:52:16Z","Content":"\n\u003Cp\u003EYour problem might have to do with not enough lift for your weight.\u003C/p\u003E\u003Cp\u003EMore often I\u0027ve found that landing gear are at fault with not being able to lift off.\u003C/p\u003E\u003Cp\u003EYour rear landing gear should ideally be in front of your rear Elevons/control surfaces. that way your rear elevons can \u0027lever\u0027 the front up. if they are behind your rear gear they actually wind up pushing your nose down. Assuming you are using stock aerodynamics(not sure about near or far haven\u0027t played enough with them), you can think of your Elevons as pushing straight down/up depending on their position relative to center of mass and the direction arrows you are pressing. as stated above they should automatically switch direction based on their relationship to center of mass.\u003C/p\u003E\u003Cp\u003EControl surfaces can also help at the front to Pick your nose up.\u003C/p\u003E\u003Cp\u003Eanother trick would be to use part tweaking to empty all your tanks in your SSTO that way you can see where your COM and COL are expected to be when you re-enter after burning all your fuel.\u003C/p\u003E\u003Cp\u003EBuilding an SSTO that can carry any significant weight into Orbit is difficult. if you are running out of fuel you need to look at ways to make it more efficient. e.g.(Carry less RCS feul if you don\u0027t need it, tweak your fuel balance so you don\u0027t end up with excess Oxidizer or Excess Liquid Fuel, or add more Intakes so you can get higher and faster before engaging your rockets)\u003C/p\u003E\u003Cp\u003EScott Manley has a lot of videos with SSTO\u0027s and he explains a lot of the techniques I\u0027ve discussed here. if you have the time maybe check out some of his video\u0027s.\u003C/p\u003E\u003Cp\u003EFly Safe.\u003C/p\u003E\n"},{"CreatedByName":"Th3F3aR","CreatedById":124827,"CreatedDateTime":"2014-10-30T18:12:43Z","Content":"\n\u003Cp\u003ESorry for the late response and the confusion i made by my W (up) sentence.\u003C/p\u003E\u003Cp\u003EThe screenies are here\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022\u0022 alt=\u0022a\u0026gt;\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewhen i push W the elevons go down by the way, that is as i knw it incorrect, and also according to your responses the wrong way\u003C/p\u003E\u003Cp\u003EHope you find the error on my bad design ^^\u003C/p\u003E\n"}]}