{"TopicId":88666,"ForumId":16,"TopicTitle":"(Modded/USI) What is the best way to earn Credits?","CreatedByName":"Methusalem","CreatedById":125765,"CreatedDateTime":"2014-10-27T15:03:26Z","PageNum":1,"Articles":[{"CreatedByName":"Methusalem","CreatedById":125765,"CreatedDateTime":"2014-10-27T15:03:26Z","Content":"\n\u003Cp\u003EMy current playthrough is on extreme difficulty (only 10% Cash/Rep/Science). The core mods are from Roverdude (MKS/OKS, Karbonite, Freighters etc.), together with the common support mods (KAS, DRE, TAC-LS etc.). Starting out was not too hard, especially with the stock strategies being so overpowered for getting science. Now the complete Tech Tree is unlocked, but not too many parts purchased yet. I\u0027ve got around 500k available, science probes around Kerbin and Mun (plus a lander on Mun), the Minmus vehicle is still in transfer.\u003C/p\u003E\u003Cp\u003EThe next step will be to put a station in orbit around Kerbin and outposts on the moons. What are possible ways to finance that - and of course also all future exploration.\u003C/p\u003E\u003Cp\u003EMissions don\u0027t look like the way to go, the payments are rather low. There are the \u0022Test abc in orbit around xyz\u0022 missions, which have quite decent rewards. But please keep in mind, that this amount is affected by the difficulty setting. And if the orbit is around Duna, then it takes a long time to do one of these missions and the Credits/Day ratio is even lower than doing a \u0022Recover Science from Mun\u0027s Orbit\u0022 thingie.\u003C/p\u003E\u003Cp\u003EI also got a Karbonite Drill already set up on Kerbin, a Logistics Unit with storage and processing at the KSC and can start selling off either LFO or Karbonite directly. Is Karbonite the best material to sell? Or would it be better to process it into something different like Xenon or Monopropellant? Processing at the drilling site or better at the KSC (where it is a lot easier to add facilities and storage)? Does anybody know any good tutorials or has sample setups?\u003C/p\u003E\u003Cp\u003EWould it be better to build mining sites on the Mun? What material? How to sell it? What other options are there? Build a colony, start to produce and sell machinery? How much can you make from that?\u003C/p\u003E\u003Cp\u003EBasically, the question is: How do you finance your space program on the hardest difficulty settings?\u003C/p\u003E\n"}]}