{"TopicId":88972,"ForumId":35,"TopicTitle":"[WIN] KSP to DDS texture converter","CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-10-31T00:01:38Z","PageNum":1,"Articles":[{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-10-31T00:01:38Z","Content":"\n\u003Cp\u003EHi everyone! As you might know, Sarbian came up with a quite nice plugin after the release of KSP 0.25, allowing the game to load DDS files, instead of standard TGA and PNG files.\u003C/p\u003E\u003Cp\u003EThe main benefits is a faster loading time. REALLY faster. Twice as fast on certain setups... It should also avoid some memory issues due to TGA loading (that need confirmation, but I have good reasons to think this comes from DX9, and not from Unity).\u003C/p\u003E\u003Cp\u003EThe only \u0022problem\u0022 with this plugin is, you have to convert all textures manually, using an external program, like nvdxt or Crunch (it\u0027s not a problem with the plugin actually, it works quite well). And having all textures converted properly can be quite tedious.\u003C/p\u003E\u003Cp\u003ESo, to allow more people to enjoy this, I\u0027d like to share a tool to convert all those textures automatically.\u003C/p\u003E\u003Cp\u003EThe main reason I\u0027ve made a new thread in this section of the forum is to keep Sarbian\u0027s thread clean from this development. There\u0027s too much exceptions to be added, and maybe too much bugs to be crushed, to keep it in the same thread as another plugin.\u003C/p\u003E\u003Cp\u003EThe principle is almost the same as Active Texture Management (who am I kidding? It\u0027s the exact same thing...), except textures are converted once and for all, instead of being converted every time you launch KSP. So, like ATM, it needs some exceptions to be defined in an external text file. As it\u0027s still a WIP, I didn\u0027t had time to test every popular mod and check if everything looks right. So it might need some updates for this tool to convert all mods properly. And, most of all, I need some feedbacks to update it and make it as complete as possible.\u003C/p\u003E\u003Cp\u003EFor now, only RGB8/ARGB8/XRGB8 textures are converted, into DXT1/DXT5(nm) formats. As those are usually the heaviest textures, it should already have a huge impact on loading time.\u003C/p\u003E\u003Cp\u003EI tried to make this tool user-friendly, and I think you won\u0027t need any documentation to use it, but I still expect you to know what you are doing with it. Don\u0027t convert any folder or file unless you\u0027ve made a backup. And keep an eye on the KSP\u0027s logs after converting a mod folder, to check if everything is loaded properly.\u003C/p\u003E\u003Cp\u003EIt use the .NET Framework (3.5), and DirectX9, so for now it\u0027s a tool for Windows only. If there\u0027s demand for it, I\u0027ll re-write it to use open-source, cross-platforms libraries.\u003C/p\u003E\u003Cp\u003EYou\u0027ll need \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/96729-0-25-DDSLoader-1-4-%28Oct-23%29-Loads-DDS-Texture-Yes-it-is-boring-edition\u0022 rel=\u0022external nofollow\u0022\u003EDDSLoader\u003C/a\u003E to use converted textures in KSP, and some \u003Ca href=\u0022http://www.microsoft.com/en-US/download/details.aspx?id=35\u0022 rel=\u0022external nofollow\u0022\u003EDirectX components\u003C/a\u003E, if the program crash at startup (as those components are required by some DX9 games, hopefully you won\u0027t have to download them).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/x83lxm6srwht5dr/DDS4KSP_0_1_7.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EDOWNLOAD\u003C/a\u003E. (Executable\u002Bsources)\u003C/p\u003E\u003Cp\u003EAny feedback (positive or negative) will be appreciated, if you have any suggestion or new exception to add to the list, please let me know about it, and I\u0027ll update it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-05T23:01:28Z\u0022 title=\u002211/05/2014 11:01  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 5, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003Cbr\u003E06/11: v0.1.7:Updated ModsExceptions.txt\n\u003C/span\u003E\n"},{"CreatedByName":"lincourtl","CreatedById":72218,"CreatedDateTime":"2014-10-31T01:34:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilleman\u0022 data-cite=\u0022Lilleman\u0022\u003E\u003Cdiv\u003EThe principle is almost the same as Active Texture Management (who am I kidding? It\u0027s the exact same thing...), except textures are converted once and for all, instead of being converted every time you launch KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept you\u0027re not actually compressing the textures so they use less memory, right?\u003C/p\u003E\u003Cp\u003EAlso, as I understand it, ATM does not convert the textures every single time it runs either. It creates a TextureCache directory, and then loads from that.\u003C/p\u003E\u003Cp\u003EIs it OK to run DDSLoader with ATM?\u003C/p\u003E\n"},{"CreatedByName":"slumpie","CreatedById":121922,"CreatedDateTime":"2014-10-31T02:07:25Z","Content":"\n\u003Cp\u003EIt does use S3 texture compression.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-31T02:10:28Z\u0022 title=\u002210/31/2014 02:10  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 31, 2014\u003C/time\u003E by slumpie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-10-31T02:40:12Z","Content":"\n\u003Cp\u003EATM loads and compresses textures each time it runs. So does KSP. The advantage here is doing that step ahead of time, so the texture can simply be loaded into memory directly, already compressed.\u003C/p\u003E\u003Cp\u003EWhat ATM does cache is when it *rescales* a texture. But it caches them uncompressed, so it has to compress on load whether or not it has cached a rescaled texture.\u003C/p\u003E\u003Cp\u003EAnd yes, it\u0027s fine to use ATM too, although ATM only touches textures in GameData which aren\u0027t DDS, and this converts them all to DDS, so...ATM won\u0027t be doing much of anything. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dreadicon","CreatedById":117295,"CreatedDateTime":"2014-10-31T05:18:01Z","Content":"\n\u003Cp\u003ESo, I can confirm that, at least with OpenGL or directX 11, this does something no other mod has been able to do. It makes my arrangement of mods playable. \u0027nuff said. Not saying this will work for everyone, but it worked for me.\u003C/p\u003E\u003Cp\u003Esome stats:\u003C/p\u003E\u003Cp\u003EDirectx9(Vanilla): crash @ ~50% progress (out of memory)\u003C/p\u003E\u003Cp\u003EDirectx9 \u002B ATM: crash @ ~80% progress (out of memory)\u003C/p\u003E\u003Cp\u003EDirectx9 \u002B ATM \u002B LoD: crash @ ~90% progress (out of memory)\u003C/p\u003E\u003Cp\u003EOpenGL \u002B ATM: loads @ 3.6 GB, crashes on VAB/SPH (out of memory)\u003C/p\u003E\u003Cp\u003EDirectX11 \u002B ATM: Crash @ ~90% progress (out of memory)\u003C/p\u003E\u003Cp\u003EDirectX9 \u002B Full DDS conversion: Crash @ ~80% (out of memory)\u003C/p\u003E\u003Cp\u003EDirectX11 \u002B Full DDS conversion: Loads @ 2.6 GB; Runs generally stable with some texture artifacts (black or missing textures, mostly in stock assets). Peaks at 3.0 GB usage while running.\u003C/p\u003E\u003Cp\u003EOpenGL \u002BFull DDS conversion: Loads @ 2.3 GB; Runs generally stable with sparse texture artifacts (mostly things like toolbar icons or PartCatalogue icons). Peaks at around 2.6 GB\u003C/p\u003E\u003Cp\u003EMy GameData folder before conversion was 2.6 GB. After DDS application, it is 1.7 GB.\u003C/p\u003E\u003Cp\u003EDefinitely some glitches and oddities to work out here and there, but this is wonderful news for me and my KSP endeavors!\u003C/p\u003E\u003Cp\u003EEdit: after more thorough investigation, looks like almost all the squad engines and about 4 of the tanks are broken by the conversion to DDS format. Looks like this is because, for whatever reason, Squad decided to put the textures in entirely different folders than the configs and models/meshes. perhaps some MM configs or an exemption could fix this? Will play with solutions as I have time. Just thought I would give a heads up. Also, the stock satellite/orbital icons seem to be broken, as do some mod icons for the toolbars as mentioned prior.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-31T05:51:15Z\u0022 title=\u002210/31/2014 05:51  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 31, 2014\u003C/time\u003E by dreadicon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"slumpie","CreatedById":121922,"CreatedDateTime":"2014-10-31T12:03:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dreadicon\u0022 data-cite=\u0022dreadicon\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEdit: after more thorough investigation, looks like almost all the squad engines and about 4 of the tanks are broken by the conversion to DDS format. Looks like this is because, for whatever reason, Squad decided to put the textures in entirely different folders than the configs and models/meshes. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, the textures are in the same folders and conversion into dxt does not break them. At least not on my install, I used nvdxt and not this tool though.\u003C/p\u003E\u003Cp\u003EMaybe you\u0027re using some sort of stock texture replacement mod.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso, the stock satellite/orbital icons seem to be broken, as do some mod icons for the toolbars as mentioned prior.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESatellite/orbital icons don\u0027t break because of this, no idea what went wrong or what this tool does wrong.\u003C/p\u003E\u003Cp\u003EHe\u0027s aware of the icons and said he\u0027s going to fix it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-31T20:27:06Z\u0022 title=\u002210/31/2014 08:27  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 31, 2014\u003C/time\u003E by slumpie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-10-31T13:06:58Z","Content":"\n\u003Cp\u003E@lincourtl: If you don\u0027t use the rescaling option, memory usage should be about the same. Maybe a little less since TGA textures seems to cause memory issues. But for PNG and MBM files, it should not make any difference. Except loading times, of course.\u003C/p\u003E\u003Cp\u003EIt\u0027s not compatible with ATM and thats why I\u0027ve implemented a rescaling option, this will have a noticeable impact on memory usage.\u003C/p\u003E\u003Cp\u003E@dreadicon: DX11 seems to have his own glitches, some textures are turning black, others pink... I would recommend to stick with DX9 or OpenGL, but if you have memory issues with a vanilla install, you should consider the rescaling option. For a vanilla install, I got everything converted properly, icons included. Can you tell me what\u0027s broken with tanks and engines? Or post a screenshot? \u003C/p\u003E\u003Cp\u003ETo avoid blurry icons, all images with a resolution lower than 64*64 are saved in an uncompressed format, that should keep them free from compression artifacts. \u003C/p\u003E\u003Cp\u003EI\u0027ll test PartCatalog, and see what exceptions needs to be added. Any other particular mod that add an icon to the toolbar?\u003C/p\u003E\u003Cp\u003EThanks for the feedbacks!\u003C/p\u003E\u003Cp\u003EEdit: PartCatalog seems to be looking for png files directly from the code. I\u0027ve updated the link in OP, but if you\u0027ve already downloaded it, you can just add those two lines to ModsExceptions.txt, so it\u0027ll skip the mod during a conversion:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E//PartCatalog is looking for png, hard-coded\u003Cbr\u003EPartCatalog\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEdit2: I forgot to mention: This tool will convert only mods/part textures, and will make them incompatible with ATM. But ATM still compress a lots more textures that this tool can\u0027t reach. So it\u0027s not totally incompatible. It just let less textures available for ATM to compress. I have some test to run, with ATM, LOD and this, to see if they work together. Normally, they should.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-31T14:27:40Z\u0022 title=\u002210/31/2014 02:27  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 31, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lincourtl","CreatedById":72218,"CreatedDateTime":"2014-10-31T13:53:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilleman\u0022 data-cite=\u0022Lilleman\u0022\u003E\u003Cdiv\u003E@lincourtl: If you don\u0027t use the rescaling option, memory usage should be about the same. Maybe a little less since TGA textures seems to cause memory issues. But for PNG and MBM files, it should not make any difference. Except loading times, of course.\u003Cp\u003EIt\u0027s not compatible with ATM and thats why I\u0027ve implemented a rescaling option, this will have a noticeable impact on memory usage.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMerci! I\u0027ll try it out later.\u003C/p\u003E\n"},{"CreatedByName":"timmers_uk","CreatedById":97413,"CreatedDateTime":"2014-10-31T14:34:21Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EAny chance that instead of deleting the original texture files, you could have an option to add a \u0027.ddsified\u0027 suffix to the file names. That way the process is easier to revert (than copy pasta the whole gamedata dir and running a sync on it) than deleting, and (ideally) we could have an option on the tool to revert by deleting the .dds files and removing the \u0027.ddsified\u0027 suffix from the file names.\u003C/p\u003E\u003Cp\u003EI\u0027d try and do this myself and submit a patch (if source was on github I could try for the whole submitting a pull request thing, but in any case I\u0027m not down with the kids enough to be familiar with doing that anyway) ... but I\u0027ve not got VB devtools setup on my machine, and haven\u0027t ever done any VB coding.\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003ETimmers\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-10-31T15:27:43Z","Content":"\n\u003Cp\u003ESure. I\u0027m on it, I\u0027ll update the link later today.\u003C/p\u003E\u003Cp\u003ESorry about VB, I\u0027m just used to code with it. I suppose I should rewrite this in C# for everyone\u0027s convinience, That might take some times, though.\u003C/p\u003E\u003Cp\u003EUpdate: The backup option is here! It would have been better if I could have them stored in an archive, to spare some disk space, but it would have required an external library (I should really consider using those). For now, it just add the \u0022.ddsified\u0022 suffix (at first I wanted to use a suffix like \u0022.bak\u0022 or something more formal, but at least I\u0027m sure this one will not be taken by another program), to original files, and allow to revert a folder to it\u0027s original state.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-31T16:21:02Z\u0022 title=\u002210/31/2014 04:21  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 31, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dreadicon","CreatedById":117295,"CreatedDateTime":"2014-10-31T17:10:37Z","Content":"\n\u003Cp\u003ESo, it was my mistake about satellite icons. What i was seeing was, in fact, the landing site icons from Kerbal Konstructs. They are replaced by SNES glitch screen patterns \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Not a biggie though.\u003C/p\u003E\u003Cp\u003EDon\u0027t worry about dx11, I just included it for completeness. I am using OpenGL for all examples going forward (because dx9 gains no benefit from this RAM wise, far as I can tell)\u003C/p\u003E\u003Cp\u003EI do want to point out, however, for whatever reason, there is a very, very clear RAM usage reduction resulting from this mod for me when running as OpenGL or DirectX 11. It reduced my RAM usage by about 1.3 GB over OpenGL \u002B ATM alone. I am guessing it has to do with how dx9 keeps all textures backed in system RAM, with no alternative option. But that\u0027s just a wild guess.\u003C/p\u003E\u003Cp\u003EConcerning the missing textures, I will get you a screenshot when I get home from work. Basically, the parts are \u0027invisible\u0027. their tiles show up in the editor, they have stats, if selected they have nodes with which to attach them, but the models and their textures don\u0027t show up at all. I will also have to do some control testing on this to make sure it\u0027s not some other mod. Off the top of my head, the Poodle and Skipper engines were affected, along with most of the rest of them. Again, will do proper research this afternoon; the least I could do to repay is to offer good, well-researched feedback.\u003C/p\u003E\u003Cp\u003EI can also confirm that ATM \u0027works\u0027, in so much as it doesn\u0027t crash the game, or make anything worse. I believe ATM does also reduce memory use for some things like EVE which cannot pre-convert to dds, but I don\u0027t have numbers to back that up.\u003C/p\u003E\u003Cp\u003EAn odd side effect seems to have been a massive speedup in my framerates overall (in-atmosphere flight still laggy, but that\u0027s just FAR). When in orbit or parked on the ground, or in the VAB/SPH, I can get double previous framerates (though lag spikes still abound, but that\u0027s not new). My load times are moderately improved, but load times were never my main concern.\u003C/p\u003E\u003Cp\u003EFinally, I just wanted to thank you again for all your work on this (and, of course, sarbian for DDS Loader). This obliterated my RAM troubles when using OpenGL like no other method could. I had RAM to burn after this (which I promptly used on EVE and visual enhancement packs)\u003C/p\u003E\n"},{"CreatedByName":"timmers_uk","CreatedById":97413,"CreatedDateTime":"2014-10-31T20:15:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilleman\u0022 data-cite=\u0022Lilleman\u0022\u003E\u003Cdiv\u003ESure. I\u0027m on it, I\u0027ll update the link later today.\u003Cp\u003ESorry about VB, I\u0027m just used to code with it. I suppose I should rewrite this in C# for everyone\u0027s convinience, That might take some times, though.\u003C/p\u003E\u003Cp\u003EUpdate: The backup option is here! It would have been better if I could have them stored in an archive, to spare some disk space, but it would have required an external library (I should really consider using those). For now, it just add the \u0022.ddsified\u0022 suffix (at first I wanted to use a suffix like \u0022.bak\u0022 or something more formal, but at least I\u0027m sure this one will not be taken by another program), to original files, and allow to revert a folder to it\u0027s original state.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problem on the VB, I\u0027m not a hater, I just can\u0027t contribute much to VB stuff, and meanwhile ... awesome! thanks for the quick turnaround on the backup option. As soon as I\u0027ve found which mod which is causing opening the revert popup to cause NPEs, I\u0027ll take the plunge and try this on my main career install\u003C/p\u003E\u003Cp\u003ETimmers.\u003C/p\u003E\n"},{"CreatedByName":"Telanor","CreatedById":94360,"CreatedDateTime":"2014-10-31T20:19:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilleman\u0022 data-cite=\u0022Lilleman\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt would have been better if I could have them stored in an archive, to spare some disk space\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t bother, that\u0027s the point of png, compressing images. Compressing it again in a zip/rar isn\u0027t going to make it any smaller (it might even make it bigger) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"timmers_uk","CreatedById":97413,"CreatedDateTime":"2014-10-31T21:28:15Z","Content":"\n\u003Cp\u003ECouple more configs I\u0027ve noted aren\u0027t coming through unscathed. I\u0027ve disabled compression for the below in my install, maybe they could be compressed but the setting tweaked? :-\u003C/p\u003E\u003Cp\u003E//KSP-AVC \u003C/p\u003E\u003Cp\u003EKSP-AVC\\Textures\u003C/p\u003E\u003Cp\u003E//FinalFrontier\u003C/p\u003E\u003Cp\u003ENereid\\FinalFrontier \u003C/p\u003E\u003Cp\u003E//StageRecovery - its only toolbar icons\u003C/p\u003E\u003Cp\u003EStageRecovery -nm -nr\u003C/p\u003E\u003Cp\u003E//ContractsWindow - toolbar icon doesn\u0027t look right converted\u003C/p\u003E\u003Cp\u003EContracts Window\\Textures\\ContractsIcon.png\u003C/p\u003E\u003Cp\u003E//Scansat - toolbar icon\u003C/p\u003E\u003Cp\u003ESCANsat\\Icons\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-11-01T00:42:47Z","Content":"\n\u003Cp\u003EThanks for the reports!\u003C/p\u003E\u003Cp\u003EI\u0027ve found a \u0022bug\u0022 with icons (okay it was my fault, sorry). Saving 24BPP icons to uncompressed (RGB24 in this case) format turned them into a grey mess. Now they\u0027re saved to ARGB32 format to avoid this.\u003C/p\u003E\u003Cp\u003EI\u0027ve also included exceptions for AVC, and for Stage Recovery. Thanks to the fix Final Frontier, Contracts Window and ScanSat don\u0027t need them. I also removed the one for USI Kolonization System, since they are converted properly now.\u003C/p\u003E\u003Cp\u003EEdit: I realized I forgot to mention it, but Kerbal Konstructs icons should be fine too, now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-01T11:59:25Z\u0022 title=\u002211/01/2014 11:59  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 1, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-11-01T14:14:21Z","Content":"\n\u003Cp\u003EI just wonder when someone finally make a proper tool for this after sarbian\u0027s DDSLoader plug-in.\u003C/p\u003E\u003Cp\u003EThanks Lilleman.\u003C/p\u003E\n"},{"CreatedByName":"starkline","CreatedById":120280,"CreatedDateTime":"2014-11-01T14:41:35Z","Content":"\n\u003Cp\u003EHi, I also found a few things that needed tweaking. I didn\u0027t, however, try to fix any problems, I just added exceptions. I know a few were mentioned a post or two ago, but I\u0027m too lazy to edit them out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Also, I think I recall seeing that the Orbital Logistics and Station Manager Icon from USI had been fixed to point to their new location. If not, they\u0027ve moved to UmbraSpaceIndustries\\Kolonization\\MKS\\Assets in the newest experimental builds (which likely means RoverDude\u0027s new release will retain the change).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E//Ambient Light Adjustment\u003Cbr\u003Eblizzy\\AmbientLightAdjustment\u003Cbr\u003E//MechJeb Warp Helper Icon\u003Cbr\u003EMechJeb2\\Icons\\Warp_Helper.png\u003Cbr\u003E//NavUtils\u003Cbr\u003EKerbalScienceFoundation\\NavInstruments\u003Cbr\u003E//SCANSat\u003Cbr\u003ESCANsat\\Icons\u003Cbr\u003E//ConnectedLivingSpaces\u003Cbr\u003EShipManifest\\Plugins\\\u003Cbr\u003EConnectedLivingSpace\\assets\\IconOff_24.png\u003Cbr\u003EConnectedLivingSpace\\assets\\IconOn_24.png\u003Cbr\u003E//PartAngleDisplay\u003Cbr\u003EPartAngleDisplay\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAlso, suggestion for the fantasic tool: it would be cool if the windows explorer folder picker included an entry field whereby it is possible to manually type or paste in the location. I know it\u0027s a small thing, but it would save from having to manually go through all the folder to pick the target.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\u003Cp\u003Estarkline\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-01T14:49:38Z\u0022 title=\u002211/01/2014 02:49  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 1, 2014\u003C/time\u003E by starkline\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-11-01T17:16:38Z","Content":"\n\u003Cp\u003EThanks! I\u0027ve updated the link in OP to include the new exceptions (I\u0027ve also added one for Interstellar).\u003C/p\u003E\u003Cp\u003EIf you already have downloaded the v0.1.5, you can just copy-paste \u003Ca href=\u0022http://pastebin.com/BTnJED5t\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E into your ModsExceptions.txt.\u003C/p\u003E\u003Cp\u003EI\u0027ll try to implement the new folder browser dialog for the next release. Also, Sarbian is looking for a way to improve compatibility with mods (loading some textures as \u0022read/write\u0022, instead of \u0022read-only\u0022), so hopefully some exceptions will be removed soon.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-01T17:31:01Z\u0022 title=\u002211/01/2014 05:31  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 1, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-11-01T22:41:06Z","Content":"\n\u003Cp\u003EUp(date): \u003Ca href=\u0022https://www.dropbox.com/s/4lbw27ubgc7vck0/DDS4KSP_0_1_6.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ev0.1.6 is out\u003C/a\u003E, with a proper folder browser dialog. This part comes from a bunch of code from \u003Ca href=\u0022https://code.google.com/p/fed/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. This small part of the program actually have a different license from mine (GPL GNU v2 vs v3), so it comes in an external dll, and sources are separated. As it\u0027s mostly a copy-pasta, all credit for this should go to the \u003Ca href=\u0022http://www.lyquidity.com/devblog/?p=136\u0022 rel=\u0022external nofollow\u0022\u003Eoriginal author\u003C/a\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-01T22:44:12Z\u0022 title=\u002211/01/2014 10:44  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 1, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Telanor","CreatedById":94360,"CreatedDateTime":"2014-11-01T22:47:24Z","Content":"\n\u003Cp\u003EI was bored today, so I converted the converter to C# and uploaded it to github: \u003Ca href=\u0022https://github.com/Telanor/DDS4KSP\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Telanor/DDS4KSP\u003C/a\u003E. Release is \u003Ca href=\u0022https://github.com/Telanor/DDS4KSP/releases/tag/v1.0\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. I did some light testing of it and it seems to work properly, but there might be some issues I missed, VB is a strange language...\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-11-01T23:04:49Z","Content":"\n\u003Cp\u003EDamn, now everyone can see all the dumb comments I put in my code:D.\u003C/p\u003E\u003Cp\u003EThe only change I\u0027ve made with this last release was the folder dialog, so if you used Ooki you shouldn\u0027t have to rewrite anything. I\u0027ve just updated ModsExceptions this afternoon, so feel free to share the new one as well.\u003C/p\u003E\u003Cp\u003ECan I use this as a base for future releases?\u003C/p\u003E\u003Cp\u003EEdit: Thank you!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-01T23:09:28Z\u0022 title=\u002211/01/2014 11:09  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 1, 2014\u003C/time\u003E by Lilleman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Telanor","CreatedById":94360,"CreatedDateTime":"2014-11-01T23:16:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilleman\u0022 data-cite=\u0022Lilleman\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe only change I\u0027ve made with this last release was the folder dialog, so if you used Ooki you shouldn\u0027t have to rewrite anything. I\u0027ve just updated ModsExceptions this afternoon, so feel free to share the new one as well.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust updated and pushed the ModsExceptions changes.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilleman\u0022 data-cite=\u0022Lilleman\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECan I use this as a base for future releases?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely, please do. If you want me to add you as a collaborator I can, or you can just fork it, whatever works for you.\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-11-01T23:37:05Z","Content":"\n\u003Cp\u003EI have to learn a few things about Github before being added as a collaborator (I never used it), so for the time being I\u0027ll go with forking, but I\u0027ll let you know if there\u0027s any change. For now the main problem is indexed image formats (L8, P8, etc...), so I guess the flipping function won\u0027t stay, and the normal detection needs to be rewritten as well (it kind of works, but I\u0027ll check Shaw\u0027s converter sources to see how he does it). Thanks again!\u003C/p\u003E\n"},{"CreatedByName":"starkline","CreatedById":120280,"CreatedDateTime":"2014-11-02T00:51:22Z","Content":"\n\u003Cp\u003EOne more change, as RoverDude just updated all USI components:\u003C/p\u003E\u003Cp\u003EThis exception moved:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Eremove: UmbraSpaceIndustries\\AES\\Spaces\u003Cbr\u003Eadd:    UmbraSpaceIndustries\\ExpPack\\AES\\Spaces\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOh, and I noticed that the exceptions ended with Toolbar, did the USI icons get cut off accidentally?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E//USI Kolonization System, those toolbar icons will look like a grey mess if converted\u003Cbr\u003EUmbraSpaceIndustries\\Kolonization\\MKS\\Assets\\OrbLogisticsIcon.png\u003Cbr\u003EUmbraSpaceIndustries\\Kolonization\\MKS\\Assets\\StationManager.png\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n"},{"CreatedByName":"Lilleman","CreatedById":112321,"CreatedDateTime":"2014-11-02T11:12:10Z","Content":"\n\u003Cp\u003EThose last two are converted properly now, so their exceptions have been removed, I\u0027ll download the last version of USI pack to check if there\u0027s anything new to add (apart from this moved folder), and I\u0027ll update the OP later today.\u003C/p\u003E\n"}]}