{"TopicId":89052,"ForumId":20,"TopicTitle":"Discussion regarding unathorised forks of mods and their distribution","CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-31T15:01:12Z","PageNum":3,"Articles":[{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-31T20:08:48Z","Content":"\n\u003Cp\u003EEdit: I need to learn to read.\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2014-10-31T20:10:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EPosting private messages is not cool. They\u0027re called \u003Cstrong\u003Eprivate\u003C/strong\u003E messages for a reason.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECalm yourself, sir. Both parties agreed to the posting of the PMs.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-31T20:11:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DuoDex\u0022 data-cite=\u0022DuoDex\u0022\u003E\u003Cdiv\u003ECalm yourself, sir. Both parties agreed to the posting of the PMs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI realized I had misinterpreted that last message after posting, the mistake is definitely mine.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-10-31T20:22:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI might better let this go, but I feel that is a bit of a non sequitur. The fact that people fork you work in a way that you do not agree with does nothing to detract from the work itself, or the pleasure people are having with it. That someone disagrees with you does not make the whole endeavour without merit.\u003Cp\u003EI can see you are feeling strongly about this, but really hope that you also see that people are not opposing the mod maker\u0027s wishes for the sake of it. If you still feel that strong about your wishes being respected, then sure, a closed source license might be better suited for your work.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I was more active I took a very carefree approach to my code and felt that sharing was the order of the day, which is why I used the BSD 2-clause license instead of the GPL (for instance), happy just that the code might be found useful to someone else. Now, because I just see the community getting nastier and nastier when mod authors try to protect themselves from issues (Win x64, CC, etc...), I find that it is just easier to simply license ARR and call it good, regardless of whether I use CC or disable Win x64, or whatever. My wishes regarding my content will be respected one way or the other under ARR.\u003C/p\u003E\u003Cp\u003EAs other people have put it, it\u0027s an \u0022endless September\u0022 of new people who neither care about the existing community nor take the time to figure out how they fit into it and what etiquette is appropriate. As the community gets bigger stronger protections are needed against strong-arm tactics. Alternatively, people just decide they\u0027ve had enough. If I ever do get back to modding KSP, I will definitely use ARR because of the recent nastiness; there has been a serious breach of trust IMO.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-31T20:39:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAs other people have put it, it\u0027s an \u0022endless September\u0022 of new people who neither care about the existing community nor take the time to figure out how they fit into it and what etiquette is appropriate. As the community gets bigger stronger protections are needed against strong-arm tactics. Alternatively, people just decide they\u0027ve had enough. If I ever do get back to modding KSP, I will definitely use ARR because of the recent nastiness; there has been a serious breach of trust IMO.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair enough. I think it is important people choose a license they are comfortable with, I agree with Alshain there. I also hope that you do not let the good things be spoiled by the sparse element that does not jive with the plan. The community is growing, meaning more people with less connection with the community, but it also means a huge swathe of talented, enthousiastic en nice people that can do wonderful things in the most pleasant ways.\u003C/p\u003E\u003Cp\u003EWhen it comes to trust - I think Senshi is doing this in the best way you can do this. The unpleasantness is in the past, now we must see how this plays out.\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2014-10-31T20:51:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EFair enough. I think it is important people choose a license they are comfortable with, I agree with Alshain there. I also hope that you do not let the good things be spoiled by the sparse element that does not jive with the plan. The community is growing, meaning more people with less connection with the community, but it also means a huge swathe of talented, enthousiastic en nice people that can do wonderful things in the most pleasant ways.\u003Cp\u003EWhen it comes to trust - I think Senshi is doing this in the best way you can do this. The unpleasantness is in the past, now we must see how this plays out.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. Everyone\u0027s had their say, now all we can do is see how this goes.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-10-31T20:52:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EWhen it comes to trust - I think Senshi is doing this in the best way you can do this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I agree about that and I wrongly shat on his thread; I\u0027m not really talking about him anyway.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-31T21:06:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EYes, I agree about that and I wrongly shat on his thread; I\u0027m not really talking about him anyway.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, right, I see where you are coming from now.\u003C/p\u003E\n"},{"CreatedByName":"Senshi","CreatedById":57692,"CreatedDateTime":"2014-10-31T22:31:36Z","Content":"\n\u003Cp\u003EI fully understand that a lot of people need to vent, no worries \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E . But luckily we have our ever vigilant moderators to sort out the forum mess we make.\u003C/p\u003E\u003Cp\u003EVenting like this can actually be healthful, as it - at least for some here - smoothed out issues, instead of silently nurturing them further. I would love if a constructive discussion comes into being, as it only can be healthy for the community. It\u0027s certainly a very important topic that concerns and troubles a lot of players, but more importantly modders. Modders being discouraged to open their code to the public for whatever reason is usually a very troublesome direction for a game that relies so much on the vast creativeness and work done by the community. The golden days when everyone knew everyone else personally are long gone with the ever rising popularity of KSP. A new way of handling the support requests which caused modders to wall themselves off against x64 with CC or licenses in the first place would be a great start.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-10-31T23:19:11Z","Content":"\n\u003Cp\u003EFor the record, as Senshi said I am fine with RF without disabling on Winx64 being distributed in Senshi\u0027s thread and maintained and supported by Senshi. While I share ferram\u0027s belief that I will have to deal with bug reports (or rather, won\u0027t be able to deal with them, because the bugs are not in my code and not fixable by me), I think that the locking has by and large served one of its main purposes, which was to change the conversation on the forums and at Squad from \u0022mods are broken on Winx64\u0022 to \u0022Winx64 is broken.\u0022 For the people it is not broken for, or is not visibly-and-always broken (since a lot can break under the surface), however, it *is* a problem. It\u0027s not a \u0022mod community divided\u0022 or an \u0022x64-x86 war\u0022 as some of the posts have mentioned; I think I can safely say I want x64 as much as anyone (RSS in 8192x4096 for all planets!) but we\u0027re just not there yet (unless we\u0027re happy little penguins and run Linux x64).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHere, however, is my call to action.\u003C/strong\u003E Please don\u0027t just say \u0022people gonna people.\u0022 If you see someone complaining about mods breaking x64, or with an x64 instability-related issue, \u003Cem\u003Edon\u0027t assume it\u0027s just going to happen and you can\u0027t stop it.\u003C/em\u003E \u003Cstrong\u003ESay something.\u003C/strong\u003E Only with the help of the community can we change the community, indeed, only with the help of the community can we \u003Cem\u003Emaintain\u003C/em\u003E this community as the one we cherish.\u003C/p\u003E\u003Cp\u003EYes, it\u0027s true that there are lots of people who Y THIS NO WORK FIX NAOW. But that problem can be helped if everybody pitches in, and in particular, that can ease the stress of your favorite modders if their Hobson\u0027s choice isn\u0027t either to deal with every, even rude, bug report ever (and perhaps get goatse in return), \u003Cem\u003Eor\u003C/em\u003E to let people post about how mod x is bad and broken and you shouldn\u0027t use it. Together we can make this, keep this, a better place for everyone.\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2014-11-01T00:45:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Senshi\u0022 data-cite=\u0022Senshi\u0022\u003E\u003Cdiv\u003EI fully understand that a lot of people need to vent, no worries \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E . But luckily we have our ever vigilant moderators to sort out the forum mess we make.\u003Cp\u003EVenting like this can actually be healthful, as it - at least for some here - smoothed out issues, instead of silently nurturing them further. I would love if a constructive discussion comes into being, as it only can be healthy for the community. It\u0027s certainly a very important topic that concerns and troubles a lot of players, but more importantly modders. Modders being discouraged to open their code to the public for whatever reason is usually a very troublesome direction for a game that relies so much on the vast creativeness and work done by the community. The golden days when everyone knew everyone else personally are long gone with the ever rising popularity of KSP. A new way of handling the support requests which caused modders to wall themselves off against x64 with CC or licenses in the first place would be a great start.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah. Banning support requests in the megathreads and directing people to Github or some other support request feature might cut down on the number of people, who as Nathan has said, go \u0022Y NO WORK FIX NAOW\u0022. And that\u0027s really a good thing for everyone.\u003C/p\u003E\u003Cp\u003ECase in point: As a technical consultant for a small and minor mod, I much prefer addressing bugs that have been brought to my attention politely. If you don\u0027t use grammar, don\u0027t have anything beyond \u0022are borked; no woreking with my save\u0022, I\u0027m honestly going to be less helpful than a bug report which contains a concise description, a logfile if necessary, and steps taken to reproduce the problem with/without other mods installed.\u003C/p\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2014-11-01T07:57:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DuoDex\u0022 data-cite=\u0022DuoDex\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E I feel that legality is a minor issue here-author permission should come first,\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAn open source security library I wrote ended up used in a firewall product that sells for six, or in some cases, seven figures. I attempted to contact the vendor to discuss my concerns that their method of using it introduced bugs, and they responded with a letter from their legal team brutally telling me to shut my mouth and deal with it.\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ELegality is definitely an issue in the grown up world.\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-11-01T09:54:01Z","Content":"\n\u003Cp\u003EIMHO, there can\u0027t be an \u0022unauthorized\u0022 fork if the license allows it. The license states what I can do with your stuff, and if the license allows me to fork, then you have already given me explicit and written permission to fork your work. So yeah, if you are not comfortable with some uses that are allowed by your license, maybe you should choose another license... just my 2 cents.\u003C/p\u003E\n"},{"CreatedByName":"Senshi","CreatedById":57692,"CreatedDateTime":"2014-11-01T10:58:57Z","Content":"\n\u003Cp\u003ELicenses might be the legal foundation, but in the end we still are a community. One that can exist without having to resort to courts of law, I hope.\u003C/p\u003E\u003Cp\u003EThe Win64 situation is something no mod author could have anticipated when setting up their license. Nobody could anticipate that it became necessary for authors to lock Win64 compatibility to stem the immense tide of not-mod-related bug reports flooding their threads.\u003C/p\u003E\u003Cp\u003ERemember that was what caused the current situation.\u003C/p\u003E\u003Cp\u003EWhile modders can hardly \u0022take back\u0022 the licenses of released versions, they certainly can change the license for future releases. Which they are more likely to do if people use the leeway of the license in a manner the original author does not approve of. Modders are not businessmen, they are enthusiastic people who waste away their free time to create amazing stuff, free of charge, for everyone to use. If they get frustrated, license or not, they will protect their sanity by either closing down licenses or stopping their work entirely. And frustrating modders is not easily done. They don\u0027t do this because they crave the appreciation (of which there always is too little anyway), so there\u0027s nothing substantial they gain, except the joy of fiddling and tweaking with a game and sharing and collaborating with other modders who fiddle and tweak the same game.\u003C/p\u003E\u003Cp\u003EI found that being open and respectful goes a long way. Modders are people just like everybody else, and treating them as such usually means you get treated as such by them as well. It\u0027s common sense - which often lacks in internet communities, sadly.\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-11-01T14:32:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Senshi\u0022 data-cite=\u0022Senshi\u0022\u003E\u003Cdiv\u003ELicenses might be the legal foundation, but in the end we still are a community. One that can exist without having to resort to courts of law, I hope.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, it just strikes me as very odd that someone would choose a license that allows forks and then refuse to let others fork. I mean, they already given you written permission to do so, refusing it later is just bipolar.\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-11-01T14:44:29Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Ippo:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETwo different kinds of refusal: refusing to allow the fork to happen, or refusing to approve the fork. The first isn\u0027t possible with a permissive license, but the second is asking the forker to respect the author\u0027s wishes. You can only have an authorized fork with the author\u0027s approval.\u003C/p\u003E\n"},{"CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2014-11-01T22:38:21Z","Content":"\n\u003Cp\u003EIn my opinion, when forking a project you should attempt to contact the owner about how to mitigate confusion and compatability issues. This is a general sign of respect in the Open Source community. While it is not necessary, it falls under the \u0022it\u0027s a good idea\u0022 matter.\u003C/p\u003E\u003Cp\u003EThis of course, does not apply to a personal fork. If someone knows enough to track down your personal fork on GitHub, they should also be smart enough not to bug the original author about bugs relating to the fork. However, if you actively publish your fork, such as on a forum, it is generally respectful to ask what you need to do to prevent issues. Often the author is grateful that you are willing to take on certain bugs or features that they aren\u0027t, so long as you are willing to play nice.\u003C/p\u003E\u003Cp\u003EThis comes under no obligation, so third parties shouldn\u0027t complain unless the person is directly violating the license, for instance by not releasing their own code, or claiming it is the original. However, as I repeated many times, it\u0027s the respectful thing to do.\u003C/p\u003E\n"},{"CreatedByName":"AbhChallenger","CreatedById":106911,"CreatedDateTime":"2014-11-01T23:20:22Z","Content":"\n\u003Cp\u003EI hate to say it. But I also think that 64 bit enabled ports that are against the wishes of the creator are not good for the community and should be banned from the official community despite their open source status.\u003C/p\u003E\u003Cp\u003EPeople ARE going to end up going to the official topics and complain. How on earth can anyone expect anything different from an internet where people will ask for support on pirated games!\u003C/p\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2014-11-01T23:30:18Z","Content":"\n\u003Cp\u003EI really, really wish that Squad had never caved to the demands for a 64-bit release. If they were a car manufacture, it would have been like releasing a car that might run perfectly fine for the next ten years, but is far more likely to flip over and start on fire when you try to open the trunk. It\u0027s a hot mess and people really ought to be cross with Squad for this mess, not authors who are right to not want to touch it with a ten foot pole. \u003C/p\u003E\u003Cp\u003EAnd I agree with the sentiment that even if a fork *can* legally be distributed in a case like this, doesn\u0027t mean it should. Especially not against the wishes of the creator when he/she is being perfectly reasonable, and when all you\u0027re going to do is create a lot of havoc for a: people whose saves get borked trying to run x64 with rehashed mods, b: the original authors of the mods, and c: the people releasing unauthorized forks.\u003C/p\u003E\u003Cp\u003EIt\u0027s rude to muck around with other people\u0027s mods against their wishes. It shouldn\u0027t be an issue of whether you *can* do it, but whether it\u0027s something that actually needs to happen. If the community of mod authors aren\u0027t releasing a particular type of mod despite a few calls for it, there\u0027s more than likely a good reason for it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-01T23:36:44Z\u0022 title=\u002211/01/2014 11:36  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 1, 2014\u003C/time\u003E by Boomerang\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2014-11-02T00:37:29Z","Content":"\n\u003Cp\u003EIt seems like this is boiling down to a respect vs. legality discussion.\u003C/p\u003E\u003Cp\u003EIt\u0027s not my place to say what should take precedence on the forums; that\u0027s for the mods.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-11-02T04:17:36Z","Content":"\n\u003Cp\u003EAs a member of this community who has been here far longer than most... longer than all but a few. I find this whole thing rather confusing. I don\u0027t comment often, and really, I guess, I missed the tempest in a teapot that has been happening ever since x64KSP came out. Early on I probably made one or two post about a mod I was using in winx64 not working. But it did not take me more that 5 days to realize that it was not the mod that was broken but winx64. So I simply stop reporting bugs when I ran winx64 KSP. Afterall Squad said it was experimental, and the mod makers said it was not something they could fix. So if I ran a mod and it broke my game I uninstalled it and did not use it. Afterall if I really must have that mod I could always instal x86 KSP.\u003C/p\u003E\u003Cp\u003E In any case I was a little surprised when 0.25 came out that most of the major mods had blocked x64KSP from running their mod, since I figured most reasonable people had come to the same realization I had come to. I am rather SHOCKED and disappointed that it has all come to such harsh exchanges when all that was necessary is a little common sense. I am glad that Senshi has made these mods available to me again. I am very disappointed that it became necessary for him to do so. I am sure many of the mod makers feel exactly like I felt today when my 4 year old complained to me that the cookie I gave her was not a kind she prefered. You should be thanking them for all their hard work, not jumping down their throat if everything isn\u0027t perfect, after all you did not pay them, they owe you nothing, and they did their work for love of the game.\u003C/p\u003E\u003Cp\u003E That said, the removal of the x64 support felt like I was getting punished for something I did not do. I know that was not their intent but it was a consequence. I dont know what the solution is, since if people can\u0027t act like adult, then what choice do they have. Senshi, too has asked everyone to act like they have two brain cells to rub together, if they don\u0027t then boom, I again will have to pay for others misdeeds and the only people I will be cross with are a nondescript group of adolescent crybabies who don\u0027t know how to read.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T04:22:35Z\u0022 title=\u002211/02/2014 04:22  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by mcirish3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-11-02T04:44:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technion\u0022 data-cite=\u0022technion\u0022\u003E\u003Cdiv\u003EAn open source security library I wrote ended up used in a firewall product that sells for six, or in some cases, seven figures. I attempted to contact the vendor to discuss my concerns that their method of using it introduced bugs, and they responded with a letter from their legal team brutally telling me to shut my mouth and deal with it.\u003Cp\u003ELegality is definitely an issue in the grown up world.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s nothing to keep you from contacting, possibly anonymously, a few technological websites to point this out to them, right? \u003C/p\u003E\u003Cp\u003EIn essence, legality is all that counts in the grown up world. Liking or disliking are generally irrelevant after contracts are signed. You agree to something and are held to it. Though what goes around, comes around. If you shovel crap onto people you can expect a good smelly bear hug in return.\u003C/p\u003E\n"},{"CreatedByName":"Corodius","CreatedById":127065,"CreatedDateTime":"2014-11-02T09:02:26Z","Content":"\n\u003Cp\u003EI am not trying to stray off topic here, but I would like to mention a few things in regards to the licenses and open-source.\u003C/p\u003E\u003Cp\u003EThese plugins are licensed under Open Source Licenses, and one of the things this implies is when an author doesn\u0027t necessarily want to support/add something, they are usually more than happy for others to do so. Why else would they share their Source in such an open fashion? It is kind of one of the driving forces behind Open Source, being free to modify a program/plugin as you see fit. \u003C/p\u003E\u003Cp\u003ENot only has Senshi done the right thing by the Authors and the Community by speaking with the Respective Authors first, he has also mentioned those Authors reasons for being cautious about releasing these versions, and made sure that any problems/reports are directed to him instead of to the other Authors. \u003C/p\u003E\u003Cp\u003EI guess people are starting to realise that a license is more than just a few words, and there are damn good reasons they are required. Also, that you cannot pick and choose how a License applies to you, You choose a License you choose all that goes with it. If people do not want their stuff Open Sourced, or others to use their Code, they should not use an Open Source License, as that is exactly what it means.\u003C/p\u003E\u003Cp\u003EIn saying this, I am a HUGE Supporter of Open Source and it is how I prefer to work. Everything I do is licensed under Open Source Licenses when applicable. I have not done much for KSP Yet, but for other games and projects. People just need to be aware of what a License entails, and all that goes with it, not just choose a few arbitrary words to put on their work because they were told to. There are damn good reasons they are needed.\u003C/p\u003E\u003Cp\u003ENow, a bit more on-topic, Thank you for releasing these! The no 64bit check kept me from trying out the windows 64bit version as I have not had the time to set up my KSP Build Environment yet, I am still learning the game and how the parts all work together. My first big Unity based game, especially on the modding side, so still learning a lot atm. However I completely understood the \u0022why\u0022 behind these Author\u0027s Choices. Thank you for compiling these for those of us who at least understand not to bug the original Authors about bugs in something they themselves have been forced to disable. (I really wish people would think sometimes, would avoid these sorts of issues, but that is the way things are I guess.)\u003C/p\u003E\n"},{"CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2014-11-02T09:43:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Corodius\u0022 data-cite=\u0022Corodius\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThese plugins are licensed under Open Source Licenses, and one of the things this implies is when an author doesn\u0027t necessarily want to support/add something, they are usually more than happy for others to do so. Why else would they share their Source in such an open fashion? \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESharing the source is a forum rule for posting your mods here. If it wasn\u0027t I wouldn\u0027t have posted my source at all, to be honest.\u003C/p\u003E\n"},{"CreatedByName":"Corodius","CreatedById":127065,"CreatedDateTime":"2014-11-02T11:34:47Z","Content":"\n\u003Cp\u003EWell, I was speaking on the License itself. It may be required that you share the source, however it is not required that you use an Open Source License (as far as I am aware, I may have misread something). This is not uncommon, it allows people to learn without giving them free reign with your Source. \u003C/p\u003E\u003Cp\u003EIf you truly don\u0027t want your source shared, well there is always the option of not sharing your mod at all, or distributing it in your own locations/sources. Otherwise, in keeping with the Rules here, you can use a Non-Open Source License, which does not allow people to re-use your Code.\u003C/p\u003E\u003Cp\u003EI, Personally, Love the focus on Open Source and encouraging people to use it. A lot of KSP is built using Open Source Projects, which would not even exist without sharing code. That they recognize this and encourage sharing, is Awesome to me. Can you honestly say you have never looked at another Mod Authors code? Or never read any information shared by others? If so, good for you that is awesome, but if not then, at least to me, it is kind of hypocritical to expect everyone to give information, and not want to share back. That is just my Personal View on that situation though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T11:40:39Z\u0022 title=\u002211/02/2014 11:40  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by Corodius\u003C/strong\u003E\n\u003C/span\u003E\n"}]}