{"TopicId":89113,"ForumId":44,"TopicTitle":"SLS Flyback.","CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-11-01T13:45:25Z","PageNum":1,"Articles":[{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-11-01T13:45:25Z","Content":"\n\u003Cp\u003EI\u0027ve been wondering, with significant modification would it be possible for a SLS with Pyrios boosters be capable of being modified for full or partial reusability? It would cut payload quite a bit but would the reduced cost per launch should make up for this?\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-11-01T14:23:17Z","Content":"\n\u003Cp\u003EWhat\u0027s Pyrios?\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-11-01T14:28:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWhat\u0027s Pyrios?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA liquid fueled rocket, presumably these would either supplement the typical SRBs, or be used to fly back the central core\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-11-01T14:29:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWhat\u0027s Pyrios?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAn alternative booster they are developing for it. Liquid fuelled and each booster uses a pair of F-1 Engines.\u003C/p\u003E\n"},{"CreatedByName":"kenbobo","CreatedById":70629,"CreatedDateTime":"2014-11-01T14:40:25Z","Content":"\n\u003Cp\u003EEach booter has 2 F1 Engines? Damn, thats alot\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2014-11-01T15:55:24Z","Content":"\n\u003Cp\u003ENo Chance. There are several resons for this:\u003C/p\u003E\u003Cp\u003ESLS is supposed to carry payloads no other rocket can carry, reducing the payload would make the wohle rocket pointless.\u003C/p\u003E\u003Cp\u003EThe core stage is far to fast on burn out, it would have to make a complete reentry and requires thermal protection that would extremly reduce the payload.\u003C/p\u003E\u003Cp\u003EThe Pyrios boosters are powered by 2 F1-B engines. For symetric thrust you would have to use both at once and 2 F1-B is the exact opposite of the carefull controlled low thrust you would need for a powered descent...\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-11-01T15:56:38Z","Content":"\n\u003Cp\u003E^^The Space Shuttle SRB (which is the basis for the ones used on the SLS - I believe the first flights will use extended SRBs and eventually, new boosters (liquid or solid) will be made according to Wikipedia) has 80% more thrust than a Saturn V F-1 engine, so 2 F-1s is a bit more than a normal Shuttle SRB.\u003C/p\u003E\n"}]}