{"TopicId":89277,"ForumId":20,"TopicTitle":"Realism Overhaul Career Mode Discussion","CreatedByName":"OtherBarry","CreatedById":100948,"CreatedDateTime":"2014-11-03T04:57:31Z","PageNum":5,"Articles":[{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-12-10T09:08:59Z","Content":"\n\u003Cp\u003ECan\u0027t remove the biomes as then you wouldn\u0027t get biomes in orbit. Can\u0027t remove biomeness from an instrument or it won\u0027t supported landed/splashed biomes on other bodies.\u003C/p\u003E\u003Cp\u003EZeroing science is *exactly* what we do though.\u003C/p\u003E\n"},{"CreatedByName":"tmikesecrist3","CreatedById":99603,"CreatedDateTime":"2014-12-11T00:10:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bender222\u0022 data-cite=\u0022Bender222\u0022\u003E\u003Cdiv\u003EDoesnt the mercury redstone engine look ery simiar to the v2? try Fasa\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes I did And I do have FASA love te mod the problem with trying to use the redstone geno also known as the R-7 is that well it is of the same famly as the R-4 used in the V-2 if the model numbers are any thing to go by the R-4 was 3 generations newer, is larger and has a higher thrust then the R4 did.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-12-11T02:46:17Z","Content":"\n\u003Cp\u003EI think you might be a little confused.\u003C/p\u003E\u003Cp\u003EThe V-2 was part of the Aggregate series of rockets, the missile itself was the A-4.\u003C/p\u003E\u003Cp\u003EThe Redstone (and the Jupiter C / Juno I) used the NAA75-110 engine, of which there were various models designated A1 through A7 (e.g. NAA75-110-A4, -A5, etc.), which were unrelated to the Aggregate series numbering, although the engine itself was of course a derivative of the V-2\u0027s engine. The A4 engine, used in Redstone, burned 75-25 Ethyl Alcohol / Water with LOx as oxidizer (like the V-2\u0027s engine), whereas the A7 burned Hydyne as its fuel, with LOx as oxidizer.\u003C/p\u003E\u003Cp\u003ER-7 is the designation of the first Soviet ICBM, derivatives of which launched Sputnik PS1, Sputnik PS2, Objekt D, and with an upper stage Luna, Vostok, etc.\u003C/p\u003E\u003Cp\u003EPlease try to get the spelling and acronyms right, it\u0027s very hard to figure out what you mean otherwise...\u003C/p\u003E\n"},{"CreatedByName":"tmikesecrist3","CreatedById":99603,"CreatedDateTime":"2014-12-11T02:54:50Z","Content":"\n\u003Cp\u003EI see you point, I just wish i had an option that would give me something like the performance of the V-2s engine\u003C/p\u003E\n"},{"CreatedByName":"tmikesecrist3","CreatedById":99603,"CreatedDateTime":"2014-12-11T21:04:09Z","Content":"\n\u003Cp\u003Eone thing I noticed that seems kind of odd... and with the last update the Administration building does not seem to be working\u003C/p\u003E\n"},{"CreatedByName":"tmikesecrist3","CreatedById":99603,"CreatedDateTime":"2014-12-17T19:03:10Z","Content":"\n\u003Cp\u003EHey I just found somthing you may want to add it is a mod pack form rover dude.... for sounding rockets \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/102502\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/102502\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T19:24:01Z\u0022 title=\u002212/17/2014 07:24  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by tmikesecrist3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-12-17T22:38:57Z","Content":"\n\u003Cp\u003ERoverDude\u0027s sounding rocket model doesn\u0027t look very much like a real sounding rocket, honestly. It\u0027s cool, but it would not behave well in a real atmosphere with that big egg. Also, it would take a lot of work to convert, since his style is pretty much diametrically different from RO\u0027s, from the aesthetics to the part choices (sticks as launch clamps...) to the flavor text.\u003C/p\u003E\u003Cp\u003EThat said, RP-0 has had sounding rocket contracts long before RoverDude released his mod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tmikesecrist3","CreatedById":99603,"CreatedDateTime":"2014-12-18T01:44:48Z","Content":"\n\u003Cp\u003EI do rember those and nathen you have a point, I seem to rember there where some really good sounding rocket parts in RPl that was something that was lacking the low powered engines needed for a light little sounding rocket\u003C/p\u003E\n"},{"CreatedByName":"tmikesecrist3","CreatedById":99603,"CreatedDateTime":"2014-12-23T22:24:57Z","Content":"\n\u003Cp\u003EI know we dont have any piston engines unless we use fire spliter, but I think we should start with plane engines and a cockpit atleast by the 2nd node on the tech tree, I dont know but firespliter might not be a bad thing to add...\u003C/p\u003E\n"},{"CreatedByName":"Seria17hri11er","CreatedById":134685,"CreatedDateTime":"2015-01-11T05:46:27Z","Content":"\n\u003Cp\u003ELooking for a little help here.\u003C/p\u003E\u003Cp\u003EPut the full shebang in. RO, RP-0 all the required content and recommended content. It\u0027s really feeling like a grind fest now. I like how the construction mod is warping time forward actually giving me a sense of days, but clicking back and forth from simulations and real launches and screw ups has become very tedious. Thinking about just replicating real missions with prebuilt rockets. But I digress.\u003C/p\u003E\u003Cp\u003EI have very little control over these sounding rockets, and I cant keep em pointed up. What\u0027s the build method for these things? Haven\u0027t found a way to keep the CG more forward for stability. Fins didn\u0027t seem to help at all.\u003C/p\u003E\u003Cp\u003EUsing that very first sounding rocket motor.\u003C/p\u003E\u003Cp\u003EWhat am I doing wrong here? I\u0027m spending a whole hell of a lot of time failing (I know, pretty realistic right? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) The tediousness of building in RO is really putting me off. Really hope its just a steep learning curve that will fall off. Almost to the point of abandoning career mode.\u003C/p\u003E\n"},{"CreatedByName":"Hattivat","CreatedById":110255,"CreatedDateTime":"2015-01-11T11:51:17Z","Content":"\n\u003Cp\u003EThe trick for sounding rockets is that the faster they go, the stabler they are. For that reason you want to have a \u0022kick stage\u0022 with high TWR (probably solid-fueled) as your first stage to get it going. Fins do help, but only once you have some speed. Also, don\u0027t make them too large. Basically you want to construct something like this: \u003Ca href=\u0022https://en.wikipedia.org/wiki/WAC_Corporal\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/WAC_Corporal\u003C/a\u003E or this \u003Ca href=\u0022https://en.wikipedia.org/wiki/Aerobee\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Aerobee\u003C/a\u003E (notice both of them have solid boosters as first stages)\u003C/p\u003E\u003Cp\u003E^That is, BTW, the cool thing about RO - that you can simply google a real-life solution to your problem and apply that, instead of learning silly game-specific concepts like \u0022asparagus staging\u0022.\u003C/p\u003E\u003Cp\u003EAnother suggestion for the future, since many people seem not to realize this at first - you can rotate the rocket as a whole and then attach it to a launch clamp to fire it at some different biome (like this, but more vertical: \u003Ca href=\u0022http://media.militaryphotos.net/photos/albums/album291/abf.sized.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://media.militaryphotos.net/photos/albums/album291/abf.sized.jpg\u003C/a\u003E )\u003C/p\u003E\u003Cp\u003EAnd yes, RO does have a pretty steep learning curve, but it does get easier once you get used to everything. Once you get used to real-life engineering problems (like not having the ability to throttle or not having magically strong reaction wheels) it becomes easier to play RO than it is to play RSS with stock-scale parts, for the very simple reason that real-life engines have far better performance than stock ones. For me constructing a rocket to launch a satellite into a geostationary orbit is already completely routine. What never gets easy is landing on Mars, but then so is the case in real life \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-11T12:23:23Z\u0022 title=\u002201/11/2015 12:23  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 11, 2015\u003C/time\u003E by Hattivat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BevoLJ","CreatedById":77242,"CreatedDateTime":"2015-01-11T20:31:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Seria17hri11er\u0022 data-cite=\u0022Seria17hri11er\u0022\u003E\u003Cdiv\u003ELooking for a little help here.\u003Cp\u003EPut the full shebang in. RO, RP-0 all the required content and recommended content. It\u0027s really feeling like a grind fest now. I like how the construction mod is warping time forward actually giving me a sense of days, but clicking back and forth from simulations and real launches and screw ups has become very tedious. Thinking about just replicating real missions with prebuilt rockets. But I digress.\u003C/p\u003E\u003Cp\u003EI have very little control over these sounding rockets, and I cant keep em pointed up. What\u0027s the build method for these things? Haven\u0027t found a way to keep the CG more forward for stability. Fins didn\u0027t seem to help at all.\u003C/p\u003E\u003Cp\u003EUsing that very first sounding rocket motor.\u003C/p\u003E\u003Cp\u003EWhat am I doing wrong here? I\u0027m spending a whole hell of a lot of time failing (I know, pretty realistic right? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) The tediousness of building in RO is really putting me off. Really hope its just a steep learning curve that will fall off. Almost to the point of abandoning career mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EThere is a pretty steep learning curve to RP-0, but most of that is changing bad habits from the stock game into habits that are more in line with real life. It really isn\u0027t all that hard once past those bad habits from stock. A couple very cool things that has helped me a lot is first and most of all, like Hattivat said, google what they did in real life. Then apply that. 95% of the time the issues I am having in RP-0 has a solution from real life that I can find with a bit of Google. Rockets are hard, so there is a LOT of documentation out there on them. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EAnother thing I\u0027ve learned to do that helps a lot is to do like real life and design launch systems and use those. I only click the build button when I know it won\u0027t fail. Rather I do a lot more clicking of the simulation button. With the simulations you don\u0027t need to wait all that time and do all that other stuff. Also it allows you to start on the pad or in orbit. It is VERY handy. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But once I have a launch system that I know will work I make a subassembly of that launch system and I use that lauch system a lot. So for example I will have a bunch of stage ones from real life such as \u003Ca href=\u0022http://www.astronautix.com/lvs/atlas.htm\u0022 rel=\u0022external nofollow\u0022\u003EAtlas\u003C/a\u003E, \u003Ca href=\u0022http://www.astronautix.com/lvs/thor.htm\u0022 rel=\u0022external nofollow\u0022\u003EThor\u003C/a\u003E, \u003Ca href=\u0022http://www.astronautix.com/lvs/delta.htm\u0022 rel=\u0022external nofollow\u0022\u003EDelta\u003C/a\u003E, and so on. Then have a bunch of stage two like the \u003Ca href=\u0022http://www.astronautix.com/stages/able.htm\u0022 rel=\u0022external nofollow\u0022\u003EAble\u003C/a\u003E, \u003Ca href=\u0022http://www.astronautix.com/stages/agenad.htm\u0022 rel=\u0022external nofollow\u0022\u003EAgena \u003C/a\u003Eor \u003Ca href=\u0022http://www.astronautix.com/stages/centaurc.htm\u0022 rel=\u0022external nofollow\u0022\u003ECentaur \u003C/a\u003Eand so on. Put these together just like they did in real life and you have the \u003Ca href=\u0022http://www.astronautix.com/lvs/thorable.htm\u0022 rel=\u0022external nofollow\u0022\u003EThor-Able\u003C/a\u003E, \u003Ca href=\u0022http://www.astronautix.com/lvs/atlgenad.htm\u0022 rel=\u0022external nofollow\u0022\u003EAtlas-Agena\u003C/a\u003E or \u003Ca href=\u0022http://www.astronautix.com/lvs/atlntaur.htm\u0022 rel=\u0022external nofollow\u0022\u003EAtlas-Centaur\u003C/a\u003E and so on. I get the systems designed and tested to where I know they are good before ever clicking that build button and performing a launch. That testing may seem like a bit of work, but in the long run having well designed launch systems that are reliable saves me a LOT more time and money. (I put links to all the RL systems you can take a look at. I would suggest building to the specs from the real systems before designing your own system. The real ones work great in RP-0)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit\u003C/strong\u003E: Oh, and the most important thing I\u0027ve found is that when I run into issues I just ask folks like Hattivat or any of the many others on the forums. These folks know how hard space is and are absolutely AMAZING! They are super helpful. Space isn\u0027t easily conquered by one man, it takes a group effort.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-11T21:11:27Z\u0022 title=\u002201/11/2015 09:11  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 11, 2015\u003C/time\u003E by BevoLJ\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lilienthal","CreatedById":119423,"CreatedDateTime":"2015-03-23T09:48:12Z","Content":"\n\u003Cp\u003EHi guys, just coming back to KSP after too much rl interference. \u003C/p\u003E\u003Cp\u003EIt is really nice to see RP-0. I played RO career mode back in November, and thought it was fun, but this is amazing on a totally different level. Great choice to have local control of probe cores. The messing with kOS just to break to land on the moon was not really worth it. \u003C/p\u003E\u003Cp\u003EI have two suggestions on the OP:\u003C/p\u003E\u003Cp\u003Ea) My understanding is that without FASA, the start is very, very difficult. Maybe it should be noted as \u0022working on, but already reccomended\u0022?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E I am a little bit embarrased to say that, but when I first ran it, I didn\u0027t click \u0022enable\u0022 on the Techmanager, and played a few hours with the wrong tech tree... Now with CKAN, it is so simple, and people like me don\u0027t really read the list of mods anymore, that a comment in the OP like that might make sense: \u0022after the first start, you have to enable the techmanager and choose CommunityTech\u0022. (It is a little bit embarrassing for me, not having done so, but thought I share anyway.) \u003C/p\u003E\u003Cp\u003ESuggestion: pruner. \u003C/p\u003E\u003Cp\u003EWould it make sense to design and maintain a list of non-RO, non-RP0 parts that can be auto-pruned by pruner? (I know Nathan says it doesn\u0027t make much difference to memory usage, but data shows that memory usage with FASA is significantly bigger than without.) Here I\u0027d be happy to contribute, but not to maintain. (RL might force me to abstain from KSP again.) \u003C/p\u003E\u003Cp\u003E(possble) Bugs:\u003C/p\u003E\u003Cp\u003E- I don\u0027t seem to be able to complete the 5,000m height challenge. It just stays in the active contracts, no matter whether I reach 50km, or 250km. At one point in time it just disappeared. - Sounds familiar? more detail wished? \u003C/p\u003E\u003Cp\u003E- I build a 700t unmanned craft. put a 2m core on it. I started it, could steer it. Then I dropped the solid rockets and steerage was lost. After another staging, the craft was small enough to be steered. - Sounds familiar? more details wished? \u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003EGustav.\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-03-23T10:38:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilienthal\u0022 data-cite=\u0022Lilienthal\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E- I don\u0027t seem to be able to complete the 5,000m height challenge. It just stays in the active contracts, no matter whether I reach 50km, or 250km. At one point in time it just disappeared. - Sounds familiar? more detail wished? \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe stock starting altitude contracts can only be completed by manned vessels, not by probes.\u003C/p\u003E\u003Cp\u003EThis mini-mod might help you out:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/106130#contracts\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#0000ff;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EInitialContracts\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt replaces the buggy stock contracts with basic ContractConfigurator contracts, which can be completed by probes and manned vessels.\u003C/p\u003E\u003Cp\u003EThough I do not know whether they need adjustments for different sizes of kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Lilienthal","CreatedById":119423,"CreatedDateTime":"2015-03-23T11:28:55Z","Content":"\n\u003Cp\u003EThanks. How do I know what\u0027s stock and what\u0027s not?\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-03-23T11:52:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lilienthal\u0022 data-cite=\u0022Lilienthal\u0022\u003E\u003Cdiv\u003EThanks. How do I know what\u0027s stock and what\u0027s not?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe stock contracts are deactivated by the initial contracts mod (launch, 5km - 56km contracts, reach space, orbit), at least if you start a new game (not sure what stays if you mod an existing save).\u003C/p\u003E\u003Cp\u003ESo with the mod installed, there are only 3 contracts: 18km, space and orbit.\u003C/p\u003E\u003Cp\u003EAs I said, you might need to ajust the payouts/advances if you play with larger kerbin sizes. Or you just compensate by giving you more money after completion, with the debug menu.\u003C/p\u003E\n"},{"CreatedByName":"Oksbad","CreatedById":79888,"CreatedDateTime":"2015-03-25T01:34:42Z","Content":"\n\u003Cp\u003EHey guys, typing in \u0022contract\u0022 in the CKAN GUI uncovers a whole lot of contract packs. Are they compatible with RP0? It seems I might have a problem with either planets that no longer exist (mimnus) or the different sizing of everything.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-03-25T03:04:50Z","Content":"\n\u003Cp\u003EContract packs are not balanced for RP-0 yet. Yemo, thanks for that link, though yours won\u0027t be balanced for RP-0 either. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Oksbad","CreatedById":79888,"CreatedDateTime":"2015-04-04T21:39:35Z","Content":"\n\u003Cp\u003EWhat\u0027s the word on strategies available from the administration building? A quick look suggests most of them are utterly useless or completely overpowered. There are stock mods to make then more sane (such as \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/96230-0-90-Sane-Strategies-0-42-1-Dec-18\u0022 rel=\u0022external nofollow\u0022\u003ESane Strategies\u003C/a\u003E), are any of them recommended for use with RP0?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-04-05T02:42:46Z","Content":"\n\u003Cp\u003EWe haven\u0027t gone deep enough into funds/rep/science balancing to know what to do with strategies since as you say the stock ones are kinda nuts. For now I\u0027d say just steer clear of them entirely...\u003C/p\u003E\n"}]}