{"TopicId":89288,"ForumId":32,"TopicTitle":"Remember your first launches?","CreatedByName":"serolrom","CreatedById":127826,"CreatedDateTime":"2014-11-03T09:11:44Z","PageNum":1,"Articles":[{"CreatedByName":"serolrom","CreatedById":127826,"CreatedDateTime":"2014-11-03T09:11:44Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003EI see in theforums and in Youtube that many of you have gone a long way in KSP. You havevisited remote planets, built huge space stations, created original things andclever ways to get them in orbit.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003EI am stillquite far from that. I started two days ago and messing with a rocket buildthat can rescue the first crew that got to Mun and got stuck there when theirrocket exploded. Bill Kerman suggested jumping high enough in the low gravityof Mun could make it, but Bob doesn\u0027t have the courage it takes for such atest.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003E \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003EI just wantto let everyone know how I am enjoying my new toy and also invite you toremember how your first days were, before you got to know all the stuff, whenjust getting into orbit was, if not much, at least a bit of a challenge. Yeah,when some of you might even do a countdown before the launch.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003E \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003ENow back todesign. Jebediah really wants to come back home to lead the important missions.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-11-03T09:36:19Z","Content":"\n\u003Cp\u003EFirst I launched straight up. Then I remembered to tilt the rocket but I tilted far to slow and high, high probability I thought I needed 250-300 km attitude for orbit like on earth.\u003C/p\u003E\u003Cp\u003EThis was in the old demo felt pretty cool then I managed an circular orbit, bought the game and continued.\u003C/p\u003E\u003Cp\u003EFirst Mun mission, probe with some science equipment and one static solar panel no battery. Got into orbit around Mun lowered it and lost controll as the solar pannel pointed away from sun and the science equipment also drew power.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2014-11-03T09:56:10Z","Content":"\n\u003Cp\u003Eyes i do. and i immediately achieved orbit too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ebut that is because i massively over engineered my rocket and because i found the game through some youtube tutorials.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-11-03T10:01:38Z","Content":"\n\u003Cp\u003EMy first launch went like most people\u0027s first launch, I imagine.\u003C/p\u003E\u003Cp\u003ECapsule, tank, engine, and then a parachute on top. Go to launch pad. Hit spacebar like you learned in the tutorial. Watch it horribly crash and burn as the parachute deploys at launch! Oh right, there was this thing called a staging order that the tutorial back then neglected to mention... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"iCT","CreatedById":104631,"CreatedDateTime":"2014-11-03T10:09:05Z","Content":"\n\u003Cp\u003EMy first rocket haven\u0027t decouplers.\u003C/p\u003E\u003Cp\u003EAnd i attached rocket engine on solid rocket boosters. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo... exploded.\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-11-03T10:12:41Z","Content":"\n\u003Cp\u003EFire and fun it was... Actually my solid rocket boosters decoupled and launched, leaving the main rocket on the pad with the above mentioned deployed parachute before tipping over.\u003C/p\u003E\u003Cp\u003EI have never encountered a game, where failing is so much fun... I guess this is, what kept me going. For almost a year now... With no end in sight \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-11-03T10:13:52Z","Content":"\n\u003Cp\u003EFairly sure my first launch was an SRB \u0026amp; a command pod.\u003C/p\u003E\u003Cp\u003EAlso pretty sure it didn\u0027t end well.\u003C/p\u003E\u003Cp\u003EThen I discovered parachutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2014-11-03T10:33:16Z","Content":"\n\u003Cp\u003EIt was a long time ago, and in the demo version...I loosely remember making a single stick vehicle initially, having a big grin on my face as the vehicle slowly lifted off from the pad - then quickly realising I had rolled the vehicle over too early, was quickly running out of propellant, and my second stage had terrible thrust to weight. Crashed and burned, shortly followed by obssessive tinkering with vehicle design that has continued to the present day \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hary R","CreatedById":111339,"CreatedDateTime":"2014-11-03T10:50:43Z","Content":"\n\u003Cp\u003EUnfortunately, I don\u0027t... but i\u0027m sure it was something like going up, gravity turn (yeah I watched scott manly before acquiring the game:P) and pouf, rapid unplaned disassembly. Ah! those time before KJR become stock:D\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2014-11-03T11:34:13Z","Content":"\n\u003Cp\u003ECan\u0027t say I do either, probably something generic with insane amounts of monoprop.\u003C/p\u003E\u003Cp\u003EI do on the other hand remember my 1st successful Laythe landing! 8-]\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Gis4k6E.jpg\u0022 alt=\u0022Gis4k6E.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/exHQL7l.jpg\u0022 alt=\u0022exHQL7l.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe 1st thing I launched probably did look similar to this.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-11-03T11:41:36Z","Content":"\n\u003Cp\u003EActually, I don\u0027t... It was probably a horrid failure, though.\u003C/p\u003E\u003Cp\u003EI \u003Cem\u003Edo\u003C/em\u003E remember how I got to the Mun in the demo version, though. I had forgotten, and when I played again (After mastering the game) I crashed and burned the ship. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was designed to go straight up, then turn (At apoapsis) and get into orbit. I hadn\u0027t learned to gravity turn yet! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Titusin","CreatedById":127773,"CreatedDateTime":"2014-11-03T11:44:53Z","Content":"\n\u003Cp\u003EJeb died a lot in the early days. Crashing into kerbin and mun mostly.\u003C/p\u003E\n"},{"CreatedByName":"Rainbow-Dashie","CreatedById":76160,"CreatedDateTime":"2014-11-03T11:54:09Z","Content":"\n\u003Cp\u003EI do try to repress those memories.... *shudder*\u003C/p\u003E\u003Cp\u003EMy first launches weren\u0027t as \u0022Explosive\u0022 as everyone elses seemed to be, I did have alot of mistakes with staging, and hard to control rockets, but they did manage to get off the ground and not kill everyone....\u003C/p\u003E\u003Cp\u003EHowever.... I do remember my first 50 or so rockets failed to achieve an altitude above 50,000m.... I just could not build rockets powerful enough to reach space. Though... when I did reach actual space... I was quite pleased. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-11-03T12:01:49Z","Content":"\n\u003Cp\u003ESome early missions;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ndTgbgv.jpg\u0022 alt=\u0022ndTgbgv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SikuCmT.jpg\u0022 alt=\u0022SikuCmT.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EStranded on Duna and Minmus;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3i4rYC4.jpg\u0022 alt=\u00223i4rYC4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FyQ78PR.jpg\u0022 alt=\u0022FyQ78PR.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2014-11-03T12:11:27Z","Content":"\n\u003Cp\u003EI remember my first Mun lander... Ahhh those days... And my first station, it was about 3 or 4 module, but it was looking nice. I was so proud of it. And my first interplanetary mission - Gilly landing. I sent 10 kerbals. 7 of them stayed in transfer vehicle, while Jeb, Bill and Bob were chosen to land in small RCS powered lander. They went on EVA and froze. The rest in transfer vehicle ran out of fuel in Kerbol orbit, so they had to fly with RCS, then they ran out of RCS and I had to send an unmanned rescue vehicle to put them on Kerbin orbit, they were sitting there for about a week, Then They\u0027ve reentered Kerbin\u0027s atmosphere, but Jeb, Bil and Bob were still sitting on Gilly frozen, so I came up with a plan to recover them. I\u0027ve sent 1-man crew to recover them, I had to use KAS ropes, but strange things were happening on time warps, so they\u0027ve died.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-11-03T12:12:16Z","Content":"\n\u003Cp\u003EI started on the demo version. I pretty much followed the NASA progression for spaceflight. I didn\u0027t have a lot of failures because I went after the math first.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2014-11-03T12:56:00Z","Content":"\n\u003Cp\u003Eoh yes, the demo version.... I still have the demo craft files for it I think.....\u003C/p\u003E\u003Cp\u003EI made liquid fuel rockets, 4x simitry, and then boosters on those, making a big box... center rocket was doubly tall....\u003C/p\u003E\u003Cp\u003EI thought space began at 100,000m So when I only made it to 80k on 2nd try, I was super disapointed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen I perpetually made the box bigger, then added solid fuel below it... still lags my pc....\u003C/p\u003E\u003Cp\u003EThose were the days...\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-03T13:05:43Z","Content":"\n\u003Cp\u003EI remember my rockets, at least. I didn\u0027t know about the whole not going too fast thing, so I just kept adding MOAR BOOSTERS in stage 1. Think eventually it took 18 or so, with a single central stack, to make orbit.\u003C/p\u003E\u003Cp\u003EI also remember my first SSTO. Four 800 tanks and an LV-T engine. Made orbit but didn\u0027t have the fuel to deorbit. That made me learn how to rendezvous. Nowadays I can do an SSTO with half that fuel.\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2014-11-03T13:14:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022steve_v\u0022 data-cite=\u0022steve_v\u0022\u003E\u003Cdiv\u003EFairly sure my first launch was an SRB \u0026amp; a command pod.\u003Cp\u003EAlso pretty sure it didn\u0027t end well.\u003C/p\u003E\u003Cp\u003EThen I discovered parachutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, cheer out, friend, you\u0027re not alone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-11-03T13:25:57Z","Content":"\n\u003Cp\u003EThere were control issues, then I learned about T to toggle SAS (the tutorial only mentioned F). Orbit was achieved shortly thereafter, as was various bits of insanity. (Playing with designs and a lack of destinations, really)\u003C/p\u003E\u003Cp\u003EBut then, this was 0.8.4, so minor things like ASAS, struts, RCS, the map, planetary rotation, and any body other than Kerbin didn\u0027t yet exist...\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-11-03T13:31:26Z","Content":"\n\u003Cp\u003EOh, I remember them \u003Cem\u003Efondly\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RuV973w.png\u0022 alt=\u0022RuV973w.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vh9ALYa.png\u0022 alt=\u0022vh9ALYa.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"serolrom","CreatedById":127826,"CreatedDateTime":"2014-11-03T13:44:10Z","Content":"\n\u003Cp\u003EThank you guys for sharing... I have to say I\u0027ve laughted with many of your adventures. One makes quite an effort to build a rocket, you really want it to reach space, and when it explodes... err... well.... KSP has something that, instead of feeling frustrated, I laugh and go for another one.\u003C/p\u003E\u003Cp\u003EYes, I am enjoying these first days. I like to watch videos and all, but honestly, I prefer not to learn much at first... I want to go through the problems by myself first.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-11-03T15:37:55Z","Content":"\n\u003Cp\u003EMy first launches were insane! I could only get a few kilometers up, just because I was so bad at rocket building. \u003Cem\u003EMan\u003C/em\u003E did I get frustrated! So, I watched quite a few tutorials (Hail Manley), and I learned a lot! The in-game tutorials were incredible too! it took many months, but eventually I learned my way into orbit.\u003C/p\u003E\n"},{"CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2014-11-03T15:56:52Z","Content":"\n\u003Cp\u003EI used the Kerbal X for my first launch. I burned straight up and got myself on a Kerbin escape. I did not know how to revert, so the crew is still orbiting the sun in that abandoned save.\u003C/p\u003E\u003Cp\u003EThe first time I got into orbit was when I was messing around with maneuver nodes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-03T20:54:01Z\u0022 title=\u002211/03/2014 08:54  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 3, 2014\u003C/time\u003E by Engineer Of Stuff\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-11-03T16:07:05Z","Content":"\n\u003Cp\u003EMy first launch was the piloting tutorial. I couldn\u0027t figure out why the stupid thing would only go up a few thousand meters before it crashed. Then I started reading about delta-V, and I designed and flew a rocket that made it all the way to space! Yes! Orbit!! Except.......not. Learned quickly that \u0022in space\u0022 and \u0022in orbit\u0022 were two different things...but at least I remembered the chute.\u003C/p\u003E\u003Cp\u003EI remember the first time I killed a Kerbal - I decided to add these cool looking \u0022launch clamp\u0022 things to my rocket to see what they did. Didn\u0027t know they were supposed to go on the bottom-most stage. Hit the SRBs and couldn\u0027t figure out why my rocket didn\u0027t go. Hit the controls for the next stage...with the SRBs still burning..........\u003C/p\u003E\n"}]}