{"TopicId":89467,"ForumId":70,"TopicTitle":"B9Aerospace/FAR Bug? Aircraft spontaneously disintegrate in Eve\u0026#039;s lower atmosphere.","CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-11-05T07:55:30Z","PageNum":1,"Articles":[{"CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-11-05T07:55:30Z","Content":"\n\u003Cp\u003ESo, while testing my Eve exploration glider in 0.25, I encountered this very strange and brutal bug.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/6XlKoDL9QX0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAs you can see, I\u0027ve jacked up the density of Kerbin\u0027s atmosphere with HyperEdit to simulate Eve\u0027s atmosphere at sea-level to make testing more convenient. This bug still occurs in the \u0022real\u0022 Eve\u0027s atmosphere, usually when I descend into the lower atmosphere, even at shallow angles and reasonable speeds.\u003C/p\u003E\u003Cp\u003EI\u0027m running a few mods, the most significant being FAR and B9-Aerospace and they are both up to date.\u003C/p\u003E\u003Cp\u003ENow, this bug only seems to effect my aircraft in dense atmospheres (such as Eve), they perform just fine in the thinner atmospheres of Kerbin, Duna, and Laythe.\u003C/p\u003E\u003Cp\u003EThe strangest part is that this same glider design worked perfectly in Eve\u0027s atmosphere in KSP 0.24.2. Its just 0.25 that\u0027s causing the problems. (BTW, I rebuilt the craft in 0.25 just eliminate the possibility of bugs from porting over my craft from 0.24.2, same result)\u003C/p\u003E\u003Cp\u003EDoes anyone have any idea whats going on here?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-11-05T08:37:26Z","Content":"\n\u003Cp\u003ENot a bug in FAR. It\u0027s a bug in KSP, due to the timestep being too small. Nothing that I can do.\u003C/p\u003E\n"},{"CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-11-06T01:52:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003ENot a bug in FAR. It\u0027s a bug in KSP, due to the timestep being too small. Nothing that I can do.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh well, I guess this is the last time I try to port my save-game over to 0.25. I\u0027ll just stick with KSP 0.24.2 since there seems to be less problems with it. \u003C/p\u003E\u003Cp\u003EThanks for your response anyways.\u003C/p\u003E\n"}]}