{"TopicId":89539,"ForumId":20,"TopicTitle":"Looking to get into modding... What should I do, where should I start?","CreatedByName":"GregA","CreatedById":126788,"CreatedDateTime":"2014-11-06T00:35:23Z","PageNum":1,"Articles":[{"CreatedByName":"GregA","CreatedById":126788,"CreatedDateTime":"2014-11-06T00:35:23Z","Content":"\n\u003Cp\u003EI am going on 10 years on and off experience with Blender. Everything up to and including character animation. In as much or as little detail as needed.\u003C/p\u003E\u003Cp\u003EIve programmed a number of games (simple games... connect 4, tic tac toe, and lunar lander come to mind) In C# XNA, C and C\u002B\u002B way back in the day, and more recently have been tinkering with Darkbasic because it is easy and free. And of course, back when it was being developed, I made a number of gamish things with the Blender game editor.\u003C/p\u003E\u003Cp\u003EI have looked over, and over looked Unity. However, the multiple years of C# XNA programming I did should make learning Unity\u0027s C# implementation a snap. I have used Unreal, and other game engines though, so I expect this to be a straight forward learning process.\u003C/p\u003E\u003Cp\u003EWatched a number of tutorials about making parts for Kerbal. Seems right up my ally.\u003C/p\u003E\u003Cp\u003EIf I had a weakness it would be... Game design. I make things too complex. I fail to see simple interactions that people enjoy. I think this is one of the reasons that in the last month I have become a full on Kerbal Junkie. I have it so bad I gave up my SJWing so as to not get banned from the community here.\u003C/p\u003E\u003Cp\u003ESo anyhow, here I am. What should I do?\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-11-06T00:45:39Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94638-New-Mod-Development-Links-Compilation\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/94638-New-Mod-Development-Links-Compilation\u003C/a\u003E\n"}]}