{"TopicId":89569,"ForumId":70,"TopicTitle":"Broken Spaceplanes!","CreatedByName":"Stikkychaos","CreatedById":128396,"CreatedDateTime":"2014-11-06T11:44:51Z","PageNum":1,"Articles":[{"CreatedByName":"Stikkychaos","CreatedById":128396,"CreatedDateTime":"2014-11-06T11:44:51Z","Content":"\n\u003Cp\u003EHello everyone. \u003C/p\u003E\u003Cp\u003EMy current issue is this: After downloading \u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cstrong\u003EModular Kolonization System\u003C/strong\u003E\u003C/span\u003E and \u003Cspan style=\u0022color:#000080;\u0022\u003E\u003Cstrong\u003EKarbonite\u003C/strong\u003E\u003C/span\u003E for .25 from Umbra repository, my game broke. While building a vessel - no matter what type of it - my lift rating indicator will not move. At first i though it\u0027s just a glitch, but it persisted through several gamesaves: planes have a visible issue with steering, both stabilizers and winglets do not work. Said \u0022issue\u0022 basically means i can shove SPH up my arse, since spaceplanes are unsteerable.\u003C/p\u003E\u003Cp\u003EHere\u0027s a list of mods i have installed:\u003C/p\u003E\u003Cp\u003EKerbal Attachment System\u003C/p\u003E\u003Cp\u003ENeophytes Elementary Aerodynamics Replacement\u003C/p\u003E\u003Cp\u003EB9 Aerospace\u003C/p\u003E\u003Cp\u003EKW Rocketry\u003C/p\u003E\u003Cp\u003ESCANsat\u003C/p\u003E\u003Cp\u003ETACs Life Support\u003C/p\u003E\u003Cp\u003EMechjeb\u003C/p\u003E\u003Cp\u003ENavhud\u003C/p\u003E\u003Cp\u003EDocking Port Alignment\u003C/p\u003E\u003Cp\u003EEvery mod i have has been updated to fit 0.25 version of the game. Also, i have to run it on x64 executable, since normal file wont start the game.\u003C/p\u003E\u003Cp\u003EHas anyone encountered such problem? Anyone has a solution already?\u003Cimg src=\u0022http://i.imgur.com/SRBnGys.jpg\u0022 alt=\u0022SRBnGys.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-11-06T12:00:00Z","Content":"\n\u003Cp\u003EFerram broke NEAR for x64, you need to download a fix. There\u0027s a thread for those on the addon release forums.\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-11-06T13:32:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EFerram broke NEAR for x64, you need to download a fix. There\u0027s a thread for those on the addon release forums.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is more accurate to say Ferram intentionally disabled FAR/NEAR for x64 due to all the \u0022bug reports\u0022 which were just more x64 instability. For the benefit of Stikkkychaos: Ferram is hardly the only modder to have done this; the instability of the Windows x64 distribution is common, and there are enough entitled idiots with x64 issues to cause every modder headaches.\u003C/p\u003E\u003Cp\u003ESenshi has released an x64-enabled version of NEAR. If you download this, do be aware that Ferram will not support you, and Senshi will probably not support you either, because Windows x64 is a buggy piece of crap. The alternatives are to use Active Texture Management to reduce RAM consumption, which should allow you to play 32-bit with a bigger stack of mods, or take the dive and install Linux, whose 64-bit distribution has so far been rock-solid. That, or just not play with so many mods. This issue will be resolved when the Windows x64 release\u0027s stability problems are resolved, and modders no longer get stupid bug reports from people who are simply running into x64 issues.\u003C/p\u003E\n"},{"CreatedByName":"Stikkychaos","CreatedById":128396,"CreatedDateTime":"2014-11-06T13:50:50Z","Content":"\n\u003Cp\u003EWell, neither Google nor forum search seems to locate the fix... Could I ask for the link?\u003C/p\u003E\u003Cp\u003EEDIT: disregard this post. I wrote it before Starman\u0027s tip.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-06T15:08:35Z\u0022 title=\u002211/06/2014 03:08  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 6, 2014\u003C/time\u003E by Stikkychaos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stikkychaos","CreatedById":128396,"CreatedDateTime":"2014-11-06T14:05:57Z","Content":"\n\u003Cp\u003EWell, thanks for help. \u003C/p\u003E\u003Cp\u003EI do have ATM, and it seems to not help much in the matter. Seems like i will have to leave some of the mods behind... sad day is upon me. Still, thank you for your cooperation.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-11-07T14:23:19Z","Content":"\n\u003Cp\u003EYou know that Linux x64 is perfectly usable, right?\u003C/p\u003E\n"}]}