{"TopicId":89619,"ForumId":32,"TopicTitle":"Lalo.","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-11-07T01:55:47Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-11-07T01:55:47Z","Content":"\n\u003Cp\u003EWhat happened to him? There seems to be some accusations here. People think he\u0027s been fired, and are implying Squad is \u0022evil\u0022 or something for firing someone with a kid.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/2lj9e0/squad_just_fired_the_employee_that_has_a_newborn/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reddit.com/r/KerbalSpaceProgram/comments/2lj9e0/squad_just_fired_the_employee_that_has_a_newborn/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe link goes to the KSP about page, which has a bit about the developers of the game, including legacy developers. A while ago, Lalo (Eduardo) had a kid, announcing it on a devnote.\u003C/p\u003E\u003Cp\u003EHere\u0027s my standpoint on the subject:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gregrox on Reddit\u0022 data-cite=\u0022Gregrox on Reddit\u0022\u003E\u003Cdiv\u003EWe don\u0027t know he\u0027s been fired. Clara Lyrae wasn\u0027t fired, nor was Hugo or Chad. He may have taken a parenting leave, or moved on to other projects.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as i can tell, this is his last devnote. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/91100-Devnote-Tuesdays-The-Can-t-Spell-Kerbal-without-K-Edition\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/91100-Devnote-Tuesdays-The-Can-t-Spell-Kerbal-without-K-Edition\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eduardo (Lalo)\u0022 data-cite=\u0022Eduardo (Lalo)\u0022\u003E\u003Cdiv\u003EOrganizing some legal contracts, making sure that the remodeling of the office is in order and following up with the entire team on deadlines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet\u0027s try and keep assumptions and accusations to a minimum!\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2014-11-07T02:39:39Z","Content":"\n\u003Cp\u003ECan we please keep in mind that the name of the user that posted this is called \u0022Maxlieskspdies\u0022 or , parsed differently, \u0022Max Lies, KSP Dies\u0022. I am inclined to believe this is just trolling.\u003C/p\u003E\u003Cp\u003EPlease no spreading of false rumors or lies.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-11-07T02:51:36Z","Content":"\n\u003Cp\u003EI imagine if he was fired Squad would tell us in some way. There seems to be no evidence that he was fired other than his lack of input in the dev notes.\u003C/p\u003E\n"},{"CreatedByName":"Rowsdower","CreatedById":91811,"CreatedDateTime":"2014-11-07T03:02:13Z","Content":"\n\u003Cp\u003EIn order to keep the speculation to a bare minimum (and since they\u0027re publicly posted on our staff page), I will confirm that both Lalo and Calisker moved on recently. No, they were not \u003Cem\u003Efired\u003C/em\u003E. A firing would also imply that they were bad at what they did, when in fact, they were not. They were consummate professionals and great teammates who didn\u0027t want to make a big deal about their departures. I look forward to seeing what they have planned in the future. What this means for us is that Max and I have a lot more work to do. What this means for you is, well, not much. We\u0027re still plugging away at making sure everything\u0027s on course and by the looks of things, they are just that. Please remember that as has been our policy, we will not be commenting on the reasons behind past or present departures.\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2014-11-07T03:51:47Z","Content":"\n\u003Cp\u003EGregrox, don\u0027t feed the troll. No sense in bringing it here.\u003C/p\u003E\n"}]}