{"TopicId":89635,"ForumId":70,"TopicTitle":"New SpacePlane parts.","CreatedByName":"Chezburgar7300","CreatedById":114873,"CreatedDateTime":"2014-11-07T07:37:52Z","PageNum":1,"Articles":[{"CreatedByName":"Chezburgar7300","CreatedById":114873,"CreatedDateTime":"2014-11-07T07:37:52Z","Content":"\n\u003Cp\u003EHey, sorry to bother. I\u0027ve recently gotten into KSP again after a short break due to constant RAM crashes (I got more RAM, this isn\u0027t the problem), and have several mods. Now, the problem. I\u0027m trying to create a craft using the Spaceplane\u002B Procedural Wing, and the Spaceplane \u002B parts that were recently integrated into the latest update of KSP. Whenever I place one of the now stock parts onto my Procedural Wing, the toolbar (plugin) disappears and the game freezes up. The cursor even freezes and I have to Alt\u002BTab to get out of the game window. I can\u0027t close the game unless I shut down my PC. I\u0027d greatly appreciate any fix for this, and I would post on the PWing thread, but it may not be the problem here, as I\u0027ve never had any problem like this. Anyway, any help is appreciated.\u003C/p\u003E\u003Cp\u003EP.S. the game doesn\u0027t register as crashing, so there is no log for it as far as I know.\u003C/p\u003E\u003Cp\u003EEDIT: A completely unrelated problem, aswell. There seems to be duplicates to the stock parts. Some have different values, but all stock command pods mess up the clicking of the game, and once I click on the root part it won\u0027t let me unclick it. I cannot exit, and must Alt\u002BTab. Would you guys just recommend a clean KSP install and add mods one by one to see what is the problem?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-07T08:50:57Z\u0022 title=\u002211/07/2014 08:50  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 7, 2014\u003C/time\u003E by Chezburgar7300\u003C/strong\u003E\n\u003Cbr\u003EAdded a bit.\n\u003C/span\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-11-07T09:46:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chezburgar7300\u0022 data-cite=\u0022Chezburgar7300\u0022\u003E\u003Cdiv\u003EEDIT: A completely unrelated problem, aswell. There seems to be duplicates to the stock parts. Some have different values, but all stock command pods mess up the clicking of the game, and once I click on the root part it won\u0027t let me unclick it. I cannot exit, and must Alt\u002BTab. Would you guys just recommend a clean KSP install and add mods one by one to see what is the problem?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that will probably be your best bet, though following all the instructions in the \u0022How to get support\u0022 sticky thread (mod list and output_log.txt) may also help...\u003C/p\u003E\n"}]}