{"TopicId":89719,"ForumId":66,"TopicTitle":"Anyone up for barn raising?","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2014-11-08T01:40:01Z","PageNum":10,"Articles":[{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-11-10T18:25:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beale\u0022 data-cite=\u0022Beale\u0022\u003E\u003Cdiv\u003EI mean, seriously:\u003Cp\u003E\u003Cstrong\u003ESee-through backface on the roof underside.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/cI4H2/e70bc56fb0.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/cI4H2/e70bc56fb0.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESmall textures stretched over a massive object.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/cI4HA/30eb873f7d.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/cI4HA/30eb873f7d.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWeird cartoonish plank texture stretched across the terrain with no model.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/cI4JW/31ae1556c0.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/cI4JW/31ae1556c0.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThis stuff.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/cI4NW/967d9f4ac9.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/cI4NW/967d9f4ac9.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENo ambient occlusion, anywhere.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/cI525/9d05686301.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/cI525/9d05686301.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter bac9\u0027s amazing work, it honestly feels like a step back into the art style of version 0.18 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E .\u003C/p\u003E\u003Cp\u003EI really hope these are heavy works in progress...\u003C/p\u003E\u003Cp\u003EOn the other hand, I do really like the \u0022patchwork\u0022 rough roads, it\u0027s just the stuff that is filling them.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/cI4Mg/73d68d1aee.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/cI4Mg/73d68d1aee.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I kinda saw this coming after the admin centre. The current centre \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entries/747-The-Making-Of-New\u0022 rel=\u0022external nofollow\u0022\u003Ewas modeled by bac9\u003C/a\u003E, who did a great job and understands atlas standardization and is a great modeller. When the admin centre dropped a number of modellers noticed it didn\u0027t seem to be made with the same standardization, and bac9 actually \u003Ca href=\u0022http://i.imgur.com/SP24SVw.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eresponded before the patch with change recommendations\u003C/a\u003E, but they were ignored. So some of us didn\u0027t have hope that the new models would be up to the same standard.\u003C/p\u003E\u003Cp\u003EI wish Squad would contract bac9 more, he raised the bar high enough that the new models being produced (SP\u002B notwithstanding, that\u0027s not Squad) are amateur in comparison.\u003C/p\u003E\u003Cp\u003Eedit: We can look forward to similar recommendations being ignored this time around,\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Krevsin\u0022 data-cite=\u0022Krevsin\u0022\u003E\u003Cdiv\u003EOn a less facetious note, I have no problem with the idea of starting in a barn and having trailers, but the texture and model work is, to put it mildly, sloppy. I would elaborate, but i\u0027d just make the thread sound like an echo chamber so I\u0027ll just link the excellent critiques posted on Reddit and imgur.\u003Cp\u003E\u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/2lpao5/my_thoughts_on_the_kerbal_space_program/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reddit.com/r/KerbalSpaceProgram/comments/2lpao5/my_thoughts_on_the_kerbal_space_program/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/onpH9fp.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/onpH9fp.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-10T18:37:46Z\u0022 title=\u002211/10/2014 06:37  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 10, 2014\u003C/time\u003E by Franklin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-11-10T18:29:53Z","Content":"\n\u003Cp\u003EAlso as quirky as the new barn models are, I doubt the rocket models are getting a similar tiering, which means it\u0027s gonna be jarring to be building sleek, MK2 spaceplanes out of farmer bob\u0027s poorly-modeled tool shed.\u003C/p\u003E\u003Cp\u003EIt seems like an odd artistic angle to take if they\u0027re only taking it with the buildings.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-11-10T18:30:04Z","Content":"\n\u003Cp\u003EI think that the building are fine. What needs changing is the \u003Cem\u003Eearly tech tree. \u003C/em\u003EThe KSC buildings look like early 20th century facilities (though instead of a barn, an old factory look could\u0027ve been better), but the tech doesn\u0027t reflect this. Instead of early 60s tech, we should be getting Goddard-era materials with which we\u0027d reinvent the V2 and work our way up to space. Oh, and once again, it should not look shoddy. This was what passed for \u0022cutting edge research facility\u0022 back then.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-11-10T18:34:23Z","Content":"\n\u003Cp\u003ESquad could you please expose those assets so that modders can replace them?\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-11-10T18:39:14Z","Content":"\n\u003Cp\u003EOr at very least make use of the model fixes being recommended here and on Reddit. You\u0027ve made a game that has a surprisingly large modelling community, don\u0027t waste the resource.\u003C/p\u003E\n"},{"CreatedByName":"Alizerin","CreatedById":126590,"CreatedDateTime":"2014-11-10T18:45:11Z","Content":"\n\u003Cp\u003EI positively love the new designs. I think it\u0027s funny. I\u0027m not sure I would upgrade these.\u003C/p\u003E\u003Cp\u003EThese are Kerbals we\u0027re talking about. Let the junkyards be upgradable to something basic which can be upgradable to more advanced stuff (like the current buildings now).\u003C/p\u003E\n"},{"CreatedByName":"K77LostNSpace","CreatedById":72529,"CreatedDateTime":"2014-11-10T19:03:13Z","Content":"\n\u003Cp\u003EReading over these post and made me think about the upgrade of the VAB and tech tree. What if they could make a special tech tree for each version of the VAB? have to upgrade in order to research different parts. \u003C/p\u003E\u003Cp\u003EExample: First version of the Space Center, the tech tree only includes plane parts and basic rockets. The Tech tree could be one of a few tabs in the R\u0026amp;D Screen. to get to the next \u0022grayed out\u0022 tab you have to upgrade parts of the space center.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-10T19:18:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K77LostNSpace\u0022 data-cite=\u0022K77LostNSpace\u0022\u003E\u003Cdiv\u003EReading over these post and made me think about the upgrade of the VAB and tech tree. What if they could make a special tech tree for each version of the VAB? have to upgrade in order to research different parts. \u003Cp\u003EExample: First version of the Space Center, the tech tree only includes plane parts and basic rockets. The Tech tree could be one of a few tabs in the R\u0026amp;D Screen. to get to the next \u0022grayed out\u0022 tab you have to upgrade parts of the space center.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that\u0027s the current plan.\u003C/p\u003E\n"},{"CreatedByName":"Alguien","CreatedById":1623,"CreatedDateTime":"2014-11-10T19:47:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EYes I do know that, and it isn\u0027t isolated to just one of them but it was definitely not originated in America, and the \u0022Classic American Red Barn\u0022 is not a thing. European was the correct term and what I said is correct, your facetiousness needs a history lesson.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENobody said red colored farms were invented by americans, just like the apple pie or the statue of liberty, all of them came from Europe but are now associated with America thanks to pop culture.\u003C/p\u003E\u003Cp\u003EAnd for your other post, yes, there are more countries with space programs, some of them do more than NASA does this days, but guess what, if you open KSP you will notice how heavily based is in NASA, not ESA, not CNSA, not CCCP/ROSCOSMOS, not JAXA.\u003C/p\u003E\u003Cp\u003ESo apply yourself.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-10T19:54:48Z","Content":"\n\u003Cp\u003EI would somewhat dislike K77\u0027s suggestion. Simply making VAB upgrades - or any building upgrades - a \u003Cem\u003Ethird\u003C/em\u003E requirement for using new parts, or even a fourth if the idea of \u0022need a qualified Kerbal\u0022 is implemented, I fear makes too many things to jump through on part unlocks. I\u0027d rather see the VAB affect something else. For example overall rocket size is the obvious thing and would give the player options: go for the VAB upgrade to make big single-launch ships, or work within the limitations by developing small efficient craft or. Or/and general rocket strength might be a logical thing for the VAB to affect: a more sophisticated, sturdier and less flammable building permits using more advanced welding methods.\u003C/p\u003E\u003Cp\u003EUpgrading the R\u0026amp;D building, mind you, might well affect the tech tree because what else could it do? But I think that might be a bit better at least anyway: upgrading the building you do your research in to do better research is more intuitive than upgrading the building you make your rockets in to do better research. Alternatively, upgrading R\u0026amp;D could simply make research cheaper in science and/or funds, giving the player the option of spending money now to make savings later, but the full tech tree could still be researched in a caravan if you really wanted.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-11-10T20:00:56Z","Content":"\n\u003Cp\u003EIt\u0027s important to understand that the player space program is not the first space program the kerbals have. Someone else is already launching rockets in large enough volumes that they produce a steady supply of kerbals stranded in orbit. This means that the facilities should be appropriate for a bunch of underdogs with a limited budget, not for a major government space program with the ambitions of being the first kerbals to reach orbit/the Mun/whatever.\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-11-10T20:36:39Z","Content":"\n\u003Cp\u003EThe pics imply that the spaceplane shown is spawned on the grass where the future SPH and runway will stand. If so, it would seem that the SPH begins as a simple open airfield and evolves into a hangar and runway later.\u003C/p\u003E\u003Cp\u003EOne explanation for this is that the tech tree will remain as it currently is, so players will not need a facility for planes at the start of the game.\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-11-10T20:37:32Z","Content":"\n\u003Cp\u003EConsidering Kerbal philosophy.. that seems \u0027bout right.\u003C/p\u003E\u003Cp\u003EKeep the hilarious and good work up!\u003C/p\u003E\n"},{"CreatedByName":"K77LostNSpace","CreatedById":72529,"CreatedDateTime":"2014-11-10T20:51:39Z","Content":"\n\u003Cp\u003EI can see your point cantab, i was thinking in general terms of extending the game time before maxing the tech tree. similar to other games that use tech tree\u0027s like age of empires and civ. but having buildings be part of a prerequisite for what can be built is still on the same lines as having the R\u0026amp;D center upgrades a prerequisite for what tech tree tier you can put science into.\u003C/p\u003E\u003Cp\u003EI use these ideas, because it does not require adding values that do not already exist. like part count limit or anything. Just felt it would be a simpler way of integrating building upgrades. Similar to how we did\u0027nt want Kerbals affecting ship parts, we likely don\u0027t want buildings doing the same thing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-10T20:55:04Z\u0022 title=\u002211/10/2014 08:55  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 10, 2014\u003C/time\u003E by K77LostNSpace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-10T20:53:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EThe pics imply that the spaceplane shown is spawned on the grass where the future SPH and runway will stand. If so, it would seem that the SPH begins as a simple open airfield and evolves into a hangar and runway later.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure about that. These screenshots could be from a dev build or a craft could have been inserted into the persistence file just to get screenshots. You could be right, but we don\u0027t know that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EOne explanation for this is that the tech tree will remain as it currently is, so players will not need a facility for planes at the start of the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat assumes stock. They would be limiting plane part plugins to later tiers. There is no reason firespitter parts can\u0027t be earlier, many of those planes look like they were meant to be flown around farms anyway.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-11-10T20:58:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EIt\u0027s important to understand that the player space program is not the first space program the kerbals have.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree. Apart from thee rescue contracts, (which I think come far two early) there isn\u0027t too much to suggest that. I think that having a predecessor who has done much detracts from the fun of making a Kerbal the first to land somewhere.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-11-10T21:03:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd I honestly vote for adding \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/33400-First-Flight\u0022 rel=\u0022external nofollow\u0022\u003EFirst Flight by KSK\u003C/a\u003E to the official canon, as it is not that different from what is being added to the game, and the background lore for the Kerbals is very creative.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would be delighted and honoured.\u003C/p\u003E\n"},{"CreatedByName":"bigbadben","CreatedById":89458,"CreatedDateTime":"2014-11-10T21:12:42Z","Content":"\n\u003Cp\u003EI, for one, cannot wait until youtubers get a hold of this update.\u003C/p\u003E\u003Cp\u003EWe are in for months of hilarity. Just imagine what they can come up with!\u003C/p\u003E\u003Cp\u003EAlso, I think new players will have a blast exploring KSC with it\u0027s new iterations \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"19chickens","CreatedById":121179,"CreatedDateTime":"2014-11-10T21:23:28Z","Content":"\n\u003Cp\u003EI personally oppose adding First Flight to the canon, as it detracts from the feeling of \u0022YES! I FINALLY MADE IT INTO ORBIT!\u0022 I\u0027m so bad I have to use MechJeb-it\u0027s brilliant to land on the Mun, especially if you\u0027re first.\u003C/p\u003E\u003Cp\u003EI also want to show you this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/goSqViZ.jpg\u0022 alt=\u0022goSqViZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe normal KSC land areas show-it\u0027s really jarring and the R\u0026amp;D/Kerbonaut Complex border was really hard to find.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-10T22:08:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002219chickens\u0022 data-cite=\u002219chickens\u0022\u003E\u003Cdiv\u003EThe normal KSC land areas show-it\u0027s really jarring and the R\u0026amp;D/Kerbonaut Complex border was really hard to find.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaxmaps said in Squadcast that they were working on smoothing the land. These are from a dev build so stuff like that will likely be improved.\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-11-10T22:16:17Z","Content":"\n\u003Cp\u003ELooking at the buildings and thinking about the pace of Career Mode as we currently know it makes me wonder about the role these buildings play and how they will affect the progress of Career Mode gameplay.\u003C/p\u003E\u003Cp\u003EThe blockhouse building that serves as mission control screams \u0022missile range\u0022 to me. We only see the launch pad from a distance, but it looks like little more than a patch of sand with a burn mark on it. I can easily envisage Werhner Von Kerman\u0027s team launching the Kerbal equivalent of V2 rockets from here. The sandbags at the blockhouse help to confer the feeling of a military firing range.\u003C/p\u003E\u003Cp\u003EThe observatory gives a strong feeling of amateur astronomy. The crude construction implies it was built out of whatever spare building materials could be scavenged.\u003C/p\u003E\u003Cp\u003EThe admin building is particularly telling. It consists of a single prefab hut surrounded by rusting junk. This is their headquarters?! The trailer park living quarters look similarly low budget.\u003C/p\u003E\u003Cp\u003EI\u0027m intrigued by the collection of shacks and tanks that seem to represent the early research facility. It looks to me like they\u0027re making rocket fuel here. Some of the wooden buildings look like basic workshops, which again implies amateurs.\u003C/p\u003E\u003Cp\u003EThe runway and hangar are conspicuously not present, which implies we won\u0027t be using spaceplanes in the early game.\u003C/p\u003E\u003Cp\u003ELooking at the early KSC as a whole, I can easily see them tech level zero \u0022the stuff we started out with\u0022 rockets. Thinking about who kerbals are, their equivalent of a V2 rocket probably consists of Jeb in a capsule on top of an RT-10 booster or a basic LV-T30 with a couple of fuel tanks. These parts have been purchased off-the-shelf from aerospace companies and then assembled in the barn, so they don\u0027t need to look ramshackle like the KSC does. \u0022The first rule of Amateur Rocket Club is: We never talk about Amateur Rocket Club! The second rule of Amateur Rocket Club is: No smoking near the fuel storage tanks!\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003ELook at the state of these facilities. Can these kerbals put a satellite into orbit and then track it? Can they put a Kerbal into orbit? The kerbals who run this early KSC are clearly a long way away from undertaking a space program as we like to think of it. Can you imagine president John F Kerman challenging these kerbals to land a kerbal on the Mun by the end of the decade?\u003C/p\u003E\u003Cp\u003ELooking at the pictures of the early KSC, it looks like the program has a long way to go in terms of both time and funding before it reaches the point where it can perform a Mun landing. Compare that to the rate at which a current Career Mode save progresses. This could have a huge impact on the way the early game is played.\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-11-10T22:17:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EMaxmaps said in Squadcast that they were working on smoothing the land. These are from a dev build so stuff like that will likely be improved.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s good to hear, I\u0027ve always had similar issues with the odd terrain platforms all the buildings were on. Makes the whole site look that much less organic when it\u0027s a barn and dirt roads all on top of an artificial terrain platform.\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2014-11-10T22:17:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd I honestly vote for adding \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/33400-First-Flight\u0022 rel=\u0022external nofollow\u0022\u003EFirst Flight by KSK\u003C/a\u003E to the official canon, as it is not that different from what is being added to the game, and the background lore for the Kerbals is very creative.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI second this. When I saw those pictures for the first time the thing that came to mind first, we right after \u0022that\u0027s really cool\u0022, was KSK\u0027s story.\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-11-10T22:22:50Z","Content":"\n\u003Cp\u003EQuick Question: will the building levels limit the size of rockets/parts they use?\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-11-10T22:30:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EI\u0027m not sure about that. These screenshots could be from a dev build or a craft could have been inserted into the persistence file just to get screenshots. You could be right, but we don\u0027t know that.\u003Cp\u003EThat assumes stock. They would be limiting plane part plugins to later tiers. There is no reason firespitter parts can\u0027t be earlier, many of those planes look like they were meant to be flown around farms anyway.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou correctly point out that I\u0027m speculating here. I noticed in the Imgur album that the stock plane shown in the pictures appears to spawn exactly where it should have done if the runway was present. My thinking is that the stock game will not offer spaceplane parts at tech level zero, but might offer some kind of airfield so that modders can still provide tech level zero plane parts if they want to. Propeller driven planes taking off from an airfield is easy to imagine.\u003C/p\u003E\u003Cp\u003EMy personal view of spaceplanes in KSP is that Kerbals already knew how to make airplanes, but it took them a while to figure out how to make wings that could withstand re-entry and thus be useful to the space program.\u003C/p\u003E\n"}]}