{"TopicId":89743,"ForumId":55,"TopicTitle":"A more intuitive tech tree","CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-09-11T22:34:43Z","PageNum":6,"Articles":[{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-12-23T23:28:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EI don\u0027t like that. It seems contrived for no purpose other than restricting what you can do.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay then put all the probe, manned, and plane parts in the initial node and then just branch off normally from there.\u003C/p\u003E\u003Cp\u003EAlso, \u0022contrived for no purpose other than restricting what you can do\u0022 is a good description of the entire tech tree mechanic.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-23T23:40:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EOkay then put all the probe, manned, and plane parts in the initial node and then just branch off normally from there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr you could have a compromise between the two: Have them all in separate nodes and have them cost a normal amount \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E lol.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EAlso, \u0022contrived for no purpose other than restricting what you can do\u0022 is a good description of the entire tech tree mechanic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs it is now, yes, but it\u0027s meant to be an abstraction of technological progress, so there\u0027s a reason for having it, just not in the current form.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-12-24T04:43:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EOr you could have a compromise between the two: Have them all in separate nodes and have them cost a normal amount \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E lol.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah but then you get back to the \u0022what do you put in the starting node\u0022 question. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor what it\u0027s worth, the tech tree I started fiddling with had the starting node the same as the current one, then had a \u0022probes\u0022 tree (starting with stayputnik and going up slowly through each probe type) a \u0022planes\u0022 tree (with a starting package about as fleshed out as the starting rocket package, ie a cockpit, single wing part, control surface, tail fin, engine, intake, fuel, and landing gear), and a few more trees (structural, fuel, engines, electronics, yadda yadda). I lost interest when there wasn\u0027t a simple program with drag and drop support to make the tree but hey, I thought it had promise.\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-12-24T05:13:05Z","Content":"\n\u003Cp\u003EI don\u0027t see why there has to be a starting node with anything in it to begin with. Either have an option when you set up the career game where you select one of three starting trees, or you start career mode with a science/funds budget that lets you buy parts.\u003C/p\u003E\u003Cp\u003EThe buying parts option would work best if fewer parts were in each node and each node cost less, but there would be MANY more nodes. The option for mods to add nodes attached to pre-existing nodes would also be great. Of course, this makes the tech tree a lot more complex and would probably mean an extensive re-write of that section of the game... but that\u0027s pretty much what\u0027s needed in the end I believe.\u003C/p\u003E\u003Cp\u003EAgain, the overall consensus is: More choice when it comes to advancing in career mode.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2014-12-24T06:52:29Z","Content":"\n\u003Cp\u003EA tech web is probably a much better implementation of technological progress. You can have a certain number of categories that overlap in cool ways. The first node should have a Mk1 Pod, the Stayputnik Mk1, and a collection of parts similar to the starting tech currently in use. Although the RT-10 should be replaced in that node by a smaller 0.625 meter SRB that\u0027s about a tone in mass, and based off of the Delta IIs SRBs. The RT-10 should come later on. Maybe in the propulsion technology category of the tech web. Or something like that.\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-12-24T08:17:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EA tech web is probably a much better implementation of technological progress. You can have a certain number of categories that overlap in cool ways. The first node should have a Mk1 Pod, the Stayputnik Mk1, and a collection of parts similar to the starting tech currently in use. Although the RT-10 should be replaced in that node by a smaller 0.625 meter SRB that\u0027s about a tone in mass, and based off of the Delta IIs SRBs. The RT-10 should come later on. Maybe in the propulsion technology category of the tech web. Or something like that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut what about plane parts? I don\u0027t want to start with manned/unmanned rockets.\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2014-12-24T12:48:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Baythan\u0022 data-cite=\u0022Baythan\u0022\u003E\u003Cdiv\u003EBut what about plane parts? I don\u0027t want to start with manned/unmanned rockets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see a problem with starting with plane because (1) that\u0027s realist, (2) there\u0027s a lot of biomes on Kerbin.\u003C/p\u003E\u003Cp\u003EOnce the tech-tree get reworked -hopefully toward a more choice based architecture- it should be more than balanced to allow plane without going straight into spaceplane.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-24T17:23:46Z","Content":"\n\u003Cp\u003EI think the Start node should only have a few basic or small structural parts that are useful for all or most types of craft, like nacelle pylons or small girders.\u003C/p\u003E\u003Cp\u003EEverything else should branch off, including plane parts. The player should chose.\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-12-24T18:26:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EI think the Start node should only have a few basic or small structural parts that are useful for all or most types of craft, like nacelle pylons or small girders.\u003Cp\u003EEverything else should branch off, including plane parts. The player should chose.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. There are a number of parts that are useful for all craft types that currently end up 3-5 tiers into the tech tree, like the cubic octagonal strut, small hardpoint and all nosecones, any of which could be put much earlier. If we get that Drag model revamp soon we\u0027ll really want those nosecones early and possibly some fairings introduced into stock.\u003C/p\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-24T23:32:11Z","Content":"\n\u003Cp\u003EI\u0027ve been playing with taking the current parts and actually dropping them into a tech tree like we\u0027re talking about (I\u0027ll probably post that here soon). Among other things I\u0027m realizing as I work through it, I think a \u0022starting node\u0022 really may not be necessary. I think the main purpose of starting node parts is so that you don\u0027t have players making bad choices with their starting science that leave them unable to do anything, but in practice I\u0027m finding that with just a few logical dependencies you end up with a set of initial choices of parts that are *very* flexible in letting the player choose what they find interesting, but don\u0027t easily let you \u0022waste\u0022 science on stuff that doesn\u0027t work.\u003C/p\u003E\u003Cp\u003EAlternatively, it also seems like you might just give all of the entry point parts to a player off the bat to encourage them to play around without feeling like they have to make choices they can\u0027t undo. I don\u0027t think it would be so bad to give them the parts to build a very very simple rocket, plane, and rover automatically.\u003C/p\u003E\u003Cp\u003EPlus I\u0027m just overall finding that (surprisingly to me) even with the current stock parts you can create a pretty satisfying tree that feels both realistic (ie. the dependencies feel like meaningful progress on a part type rather than arbitrary) and seems like it would balance out gameplay wise. I\u0027m liking it so much, I may take a shot of putting it into a config file for the custom TechManager mod so I can play a career with it. I\u0027ll definitely be interested in feedback from you guys first though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-24T23:58:03Z\u0022 title=\u002212/24/2014 11:58  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 24, 2014\u003C/time\u003E by sherkaner\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-24T23:44:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sherkaner\u0022 data-cite=\u0022sherkaner\u0022\u003E\u003Cdiv\u003E I\u0027ll definitely be interested in feedback from you guys first though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re using the default nodes and just moving the parts then I\u0027d be interested in trying. All my mod parts will obviously be in the wrong place, but I\u0027ll just have to suffer through it.\u003C/p\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-24T23:56:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EIf you\u0027re using the default nodes and just moving the parts then I\u0027d be interested in trying. All my mod parts will obviously be in the wrong place, but I\u0027ll just have to suffer through it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I need to look at this mod more and figure out how much I can define. I\u0027m really hoping to do away with the default nodes and define nodes that almost always contain one part. Stock parts only obviously. Not sure if the mod is that flexible though. Either way I\u0027ll post my tech tree diagram organized that way so you guys can critique.\u003C/p\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-25T00:40:51Z","Content":"\n\u003Cp\u003EAh, nice, it looks like the .cfg files that KSP/TechManager use are fully flexible for defining nodes as well as parts within, so totally doable for me to create the tree we\u0027re talking about. Might even be able to have it in \u0022explosion\u0022 format. It\u0027ll take me some time though. I\u0027ll get the diagram up first later this evening.\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-12-25T00:56:08Z","Content":"\n\u003Cp\u003EI\u0027d love to have a look at what you work out. Almost anything that anyone would find enjoyable would be better than what we have now.\u003C/p\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-25T06:36:57Z","Content":"\n\u003Cp\u003EOkay, here\u0027s the tech tree I\u0027ve been working on incorporating all stock parts. It\u0027s in linear format, but of course it could be wrapped into an explosion format. Of course I think we\u0027re all expecting Squad to modify, rebalance, and possibly add parts during beta, but I was surprised how well this worked out even using today\u0027s parts -- vastly better than the grouped tree we have today for providing flexibility and a sense of guiding a \u0022real\u0022 R\u0026amp;D program, while still providing challenges and tough choices:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hlrFxLT.png\u0022 alt=\u0022hlrFxLT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003ENote: New version of this diagram now posted later in this thread \u003C/strong\u003E\u003C/em\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/99521-Tech-tree-and-parts-final-polish?p=1632962\u0026amp;viewfull=1#post1632962\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003E\u003Cstrong\u003Ehere\u003C/strong\u003E\u003C/em\u003E\u003C/a\u003E\u003Cem\u003E\u003Cstrong\u003E.\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EYeah, it\u0027s huge.\u003C/p\u003E\u003Cp\u003EThe guiding principle here is the \u0022per part\u0022 nodes concept we\u0027ve been discussing where each part type essentially has its own branch in the tree with a sequence of branching nodes for more and more advanced versions. I\u0027ve tried to stick to that philosophy pretty closely, but here are a few additional background notes:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EIf you look at the first parts in each category on the left, I think those provide a very nice cross-section of basic parts that will provide players with many choices but not be too \u0022overpowered\u0022 or get the player in trouble researching useless parts. Basically with those you can create a basic rocket, plane, or rover and do a little science. I think these might even be parts to just give the player outright.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou\u0027ll see that I sometimes have multiple inputs to a single node -- these are meant to be multiple \u003Cem\u003Eoptions\u003C/em\u003E of getting to that part, NOT multiple \u003Cem\u003Eprerequisites\u003C/em\u003E. I did this in places where there were \u0022realistic\u0022 feeling different ways you\u0027d get to a certain technology by different paths, and also to add flexibility in places where -- for example -- both spaceplanes and rockets could use a part and I wanted to avoid forcing somebody to dig through a tree branch they\u0027d otherwise be uninterested in.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhile I generally stuck to \u0022one part per node\u0022, I do group a few parts together that were so similar that making them separate nodes seemed ridiculous.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI basically punted on the wings section, describing in general terms what I think should be at the different R\u0026amp;D levels. These were the only parts that seem so \u0022broken\u0022 currently that organizing them was almost nonsensical. The pre-procedural wing/fin parts just make no sense, but I wager all of that is about to change soon anyway.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI could use some input on the structural (i-beams, girders, etc.) parts. I haven\u0027t had much opportunity to use those yet, so I\u0027m not sure how well my choices play out. But generally I think these parts should be available sooner rather than later.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnyway, looking forward to hearing what people think, and maybe after I make some revisions I\u0027ll work on getting this into a .cfg for TechManager so we can play it. Personally I\u0027m super-excited about playing a career with something like this tech tree. I can imagine a lot of very different-feeling programs being played through this tree to a high level with very different sets of technologies unlocked. And as an engineer, this to me feels like something much closer to the organic way that real technology developments evolve and arrive at solutions from different angles.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-27T21:06:14Z\u0022 title=\u002212/27/2014 09:06  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 27, 2014\u003C/time\u003E by sherkaner\u003C/strong\u003E\n\u003Cbr\u003EMerry Christmas\n\u003C/span\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-12-25T06:50:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sherkaner\u0022 data-cite=\u0022sherkaner\u0022\u003E\u003Cdiv\u003EOkay, here\u0027s the tech tree I\u0027ve been working on [snip] \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like it!\u003C/p\u003E\u003Cp\u003EI might move the mobile processing lab into the science branch rather than the habitat/command pod branch. Also, I think the QBE probe might be too early, but I don\u0027t know what pilot skill level it has programmed in.\u003C/p\u003E\u003Cp\u003ENext would be balancing the research cost of each node/part.\u003C/p\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-25T07:19:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Baythan\u0022 data-cite=\u0022Baythan\u0022\u003E\u003Cdiv\u003EI like it!\u003Cp\u003EI might move the mobile processing lab into the science branch rather than the habitat/command pod branch. Also, I think the QBE probe might be too early, but I don\u0027t know what pilot skill level it has programmed in.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI debated on the processing lab. I kept it in habitat just because it does contain Kerbals and so purely R\u0026amp;D wise I thought of the main development of the lab (as opposed to its usage) would be more similar to pods and landing cans.\u003C/p\u003E\u003Cp\u003EAnd yeah, I need to look into the QBE -- good point. I was making the assumption that it was very basic (and cheap), but I\u0027m actually not sure with 0.90. I probably need to do some sandbox play with the new probe cores in general before I settle that branch.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Baythan\u0022 data-cite=\u0022Baythan\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENext would be balancing the research cost of each node/part.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that\u0027s going to be interesting. Clearly each node is going to have to be much cheaper than current (since you\u0027re only getting one part generally), but because the player can be very selective, you can probably make the parts somewhat expensive. I\u0027m open to suggestions, if somebody with more career experience wanted to mark up my tree with costs...\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2014-12-25T12:07:01Z","Content":"\n\u003Cp\u003EJust a little off-topic chime-in, but has anyone explained why the small hardpoint, radial attachment point, and 1.25m quad coupler are so crazy expensive? I mean they\u0027re handy and I like them but they\u0027re like 3x the cost of the average structural part. The 2.5m quad coupler is like 40% the price of its little brother, the Hubmax is 70% the cost of radial attachment point, and the small hardpoint seems just crazy overpriced.\u003C/p\u003E\u003Cp\u003EThat\u0027s it, carry on!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-25T12:15:47Z\u0022 title=\u002212/25/2014 12:15  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 25, 2014\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2014-12-25T21:12:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sherkaner\u0022 data-cite=\u0022sherkaner\u0022\u003E\u003Cdiv\u003EOkay, here\u0027s the tech tree \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice work, now that\u0027s something I would actually be interested of playing with.\u003C/p\u003E\u003Cp\u003ESincerely, I wouldn\u0027t worry much about order and balance, not only people will disagree on a few point but news parts with new interaction, and another tiers not-yet-added (if I remember) make it subject to big change.\u003C/p\u003E\u003Cp\u003EA few remark :\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sherkaner\u0022 data-cite=\u0022sherkaner\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EYou\u0027ll see that I sometimes have multiple inputs to a single node -- these are meant to be multiple \u003Cem\u003Eoptions\u003C/em\u003E of getting to that part, NOT multiple \u003Cem\u003Eprerequisites\u003C/em\u003E. I did this in places where there were \u0022realistic\u0022 feeling different ways you\u0027d get to a certain technology by different paths, and also to add flexibility in places where -- for example -- both spaceplanes and rockets could use a part and I wanted to avoid forcing somebody to dig through a tree branch they\u0027d otherwise be uninterested in.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMyself I would actually support multiple prerequisites for a few carefully chosen part.\u003C/p\u003E\u003Cp\u003EYes, that\u0027s surprising coming from someone who loath the bundles we have now, but a few parts isn\u0027t a big cost for the following reasons :\u003C/p\u003E\u003Cp\u003E- Encouraging new players to try out new part they wouldn\u0027t think to unlock first.\u003C/p\u003E\u003Cp\u003E- As a balance mechanism (limiting minimaxing even though R\u0026amp;D tier take care of that at 80%)\u003C/p\u003E\u003Cp\u003E- Minimal verisimilitude (less people complaining about unrealistic tech order.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sherkaner\u0022 data-cite=\u0022sherkaner\u0022\u003E\u003Cdiv\u003E\u003Cul\u003E\u003Cli\u003EI basically punted on the wings section, describing in general terms what I think should be at the different R\u0026amp;D levels. These were the only parts that seem so \u0022broken\u0022 currently that organizing them was almost nonsensical. The pre-procedural wing/fin parts just make no sense, but I wager all of that is about to change soon anyway.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI could use some input on the structural (i-beams, girders, etc.) parts. I haven\u0027t had much opportunity to use those yet, so I\u0027m not sure how well my choices play out. But generally I think these parts should be available sooner rather than later.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thing the way we could make sense of wing parts would be to put the wing form that are \u0022the most practical\u0022 (in term of achieving exactly the wing profile you want) on later tier.\u003C/p\u003E\u003Cp\u003EFor example, it would be impossible without clipping (which can intersect inside cargo-bay) to obtain more than 45% Delta wing.\u003C/p\u003E\u003Cp\u003EAs for structural part, from my opinion they should be nearly all unlockable in Tier 1 except for those based upon 2.5m, 3.75m, mk2 and mk3 structure (which would be prerequisite)\u003C/p\u003E\u003Cp\u003EMy 2cents\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-25T21:15:56Z\u0022 title=\u002212/25/2014 09:15  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 25, 2014\u003C/time\u003E by Kegereneku\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-26T06:25:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kegereneku\u0022 data-cite=\u0022Kegereneku\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMyself I would actually support multiple prerequisites for a few carefully chosen part.\u003C/p\u003E\u003Cp\u003EYes, that\u0027s surprising coming from someone who loath the bundles we have now, but a few parts isn\u0027t a big cost for the following reasons :\u003C/p\u003E\u003Cp\u003E- Encouraging new players to try out new part they wouldn\u0027t think to unlock first.\u003C/p\u003E\u003Cp\u003E- As a balance mechanism (limiting minimaxing even though R\u0026amp;D tier take care of that at 80%)\u003C/p\u003E\u003Cp\u003E- Minimal verisimilitude (less people complaining about unrealistic tech order.)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou make some good points, and I there are a couple of places where I sort of wanted to have multiple prerequisites (the LFB KR-1 was one in particular). But I just felt like there weren\u0027t enough parts to justify forcing people into building out whole branches just for a prerequisite. I think if Squad were to add a lot more endgame parts, that\u0027s where I\u0027d be most in favor of it to make people work a little harder for really awesome high-tech stuff.\u003C/p\u003E\u003Cp\u003EBut it might be interesting to try. Basically anywhere that I have multiple input lines to a part, it would be easy enough to create a version of a tech tree that treats those as prerequisites rather than options. I might try both.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kegereneku\u0022 data-cite=\u0022Kegereneku\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI thing the way we could make sense of wing parts would be to put the wing form that are \u0022the most practical\u0022 (in term of achieving exactly the wing profile you want) on later tier.\u003C/p\u003E\u003Cp\u003EFor example, it would be impossible without clipping (which can intersect inside cargo-bay) to obtain more than 45% Delta wing.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, I might be able to split up the procedural parts a bit that way, within R\u0026amp;D level 2, good idea.\u003C/p\u003E\u003Cp\u003EThe non-procedure stuff (that I\u0027m lumped into R\u0026amp;D level 1) is where I\u0027m just totally baffled. But I think those are also probably the ones likely to change a lot -- especially with the mention that Squad\u0027s looking at aerodynamics soon. So just for the sake of playtesting this tree for now, I\u0027ll probably just throw all of those into one or two nodes and call it a day.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kegereneku\u0022 data-cite=\u0022Kegereneku\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs for structural part, from my opinion they should be nearly all unlockable in Tier 1 except for those based upon 2.5m, 3.75m, mk2 and mk3 structure (which would be prerequisite)\u003C/p\u003E\u003Cp\u003EMy 2cents\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was my feeling mostly also, and pretty much what I have in the diagram I think. Any in particular there that you\u0027d disagree with?\u003C/p\u003E\u003Cp\u003EI\u0027ll definitely start trying to get this dumped into a tech tree .cfg file in the coming days.\u003C/p\u003E\u003Cp\u003EKeep the input coming!\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-26T06:36:51Z","Content":"\n\u003Cp\u003EI like what I\u0027m seeing a lot. And the diagram itself is really elegant.\u003C/p\u003E\u003Cp\u003EI looked at it in detail and I have a bunch of question and a bunch of suggestions but they\u0027ll have to wait a bit.\u003C/p\u003E\u003Cp\u003EOne thing I wanted to ask you is whether you have all those part images saved as separate files, and if you could upload them for those who\u0027d like to try designing their own trees.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2014-12-26T15:02:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sherkaner\u0022 data-cite=\u0022sherkaner\u0022\u003E\u003Cdiv\u003EOkay, here\u0027s the tech tree I\u0027ve been working on incorporating all stock parts. It\u0027s in linear format, but of course it could be wrapped into an explosion format. Of course I think we\u0027re all expecting Squad to modify, rebalance, and possibly add parts during beta, but I was surprised how well this worked out even using today\u0027s parts -- vastly better than the grouped tree we have today for providing flexibility and a sense of guiding a \u0022real\u0022 R\u0026amp;D program, while still providing challenges and tough choices:\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/hlrFxLT.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/hlrFxLT.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYeah, it\u0027s huge.\u003C/p\u003E\u003Cp\u003EThe guiding principle here is the \u0022per part\u0022 nodes concept we\u0027ve been discussing where each part type essentially has its own branch in the tree with a sequence of branching nodes for more and more advanced versions. I\u0027ve tried to stick to that philosophy pretty closely, but here are a few additional background notes:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EIf you look at the first parts in each category on the left, I think those provide a very nice cross-section of basic parts that will provide players with many choices but not be too \u0022overpowered\u0022 or get the player in trouble researching useless parts. Basically with those you can create a basic rocket, plane, or rover and do a little science. I think these might even be parts to just give the player outright.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou\u0027ll see that I sometimes have multiple inputs to a single node -- these are meant to be multiple \u003Cem\u003Eoptions\u003C/em\u003E of getting to that part, NOT multiple \u003Cem\u003Eprerequisites\u003C/em\u003E. I did this in places where there were \u0022realistic\u0022 feeling different ways you\u0027d get to a certain technology by different paths, and also to add flexibility in places where -- for example -- both spaceplanes and rockets could use a part and I wanted to avoid forcing somebody to dig through a tree branch they\u0027d otherwise be uninterested in.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhile I generally stuck to \u0022one part per node\u0022, I do group a few parts together that were so similar that making them separate nodes seemed ridiculous.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI basically punted on the wings section, describing in general terms what I think should be at the different R\u0026amp;D levels. These were the only parts that seem so \u0022broken\u0022 currently that organizing them was almost nonsensical. The pre-procedural wing/fin parts just make no sense, but I wager all of that is about to change soon anyway.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI could use some input on the structural (i-beams, girders, etc.) parts. I haven\u0027t had much opportunity to use those yet, so I\u0027m not sure how well my choices play out. But generally I think these parts should be available sooner rather than later.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnyway, looking forward to hearing what people think, and maybe after I make some revisions I\u0027ll work on getting this into a .cfg for TechManager so we can play it. Personally I\u0027m super-excited about playing a career with something like this tech tree. I can imagine a lot of very different-feeling programs being played through this tree to a high level with very different sets of technologies unlocked. And as an engineer, this to me feels like something much closer to the organic way that real technology developments evolve and arrive at solutions from different angles.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is really good. If this were stock, I\u0027d definitely play science career.\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2014-12-26T19:42:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sherkaner\u0022 data-cite=\u0022sherkaner\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat was my feeling mostly also, and pretty much what I have in the diagram I think. Any in particular there that you\u0027d disagree with?\u003C/p\u003E\u003Cp\u003EI\u0027ll definitely start trying to get this dumped into a tech tree .cfg file in the coming days.\u003C/p\u003E\u003Cp\u003EKeep the input coming!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI as said, I would take your picture as a concept demonstration rather than a route plan to polish.\u003C/p\u003E\u003Cp\u003EIt\u0027s expected to go through many change, Engines stats are going to change with the upgrade of the Aerodynamic model, new parts are to be expected, all might create new dynamic susceptible to ask for a reorder. Also one token guy might consider the Dockport .jr should come first as it is technologically less advanced...etc\u003C/p\u003E\u003Cp\u003EPlus, in the end it\u0027s SQUAD who will have the last words.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-26T21:34:09Z\u0022 title=\u002212/26/2014 09:34  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 26, 2014\u003C/time\u003E by Kegereneku\u003C/strong\u003E\n\u003Cbr\u003Eit really needed correction\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-26T20:11:55Z","Content":"\n\u003Cp\u003EOK Questions first:\u003C/p\u003E\u003Cp\u003E1. Why did you make the stability enhancer dependent on the radial decoupler?\u003C/p\u003E\u003Cp\u003E2. Why place the mini decoupler and separator after the medium?\u003C/p\u003E\u003Cp\u003E3. Same question for the clampotron junior.\u003C/p\u003E\u003Cp\u003E4. Same question for Oscar fuel tank.\u003C/p\u003E\u003Cp\u003E5. I think I already know the answer but why make the klaw dependent on docking ports? It\u0027s a modified docking port out of laziness on Squads part (or time constraints) more than anything else.\u003C/p\u003E\u003Cp\u003E6. What does the line connecting the \u0022Mk2 Cockpit\u0022 and \u0022Mk2 Liquid fuel fuselage short\u0022 mean?\u003C/p\u003E\u003Cp\u003E7. Why is the structural intake last in that branch?\u003C/p\u003E\u003Cp\u003E8. Why are the radial RCS tanks so late?\u003C/p\u003E\u003Cp\u003E9. Why are the Xenon tanks dependent on all the RCS tanks before them?\u003C/p\u003E\u003Cp\u003E10. Why make RCS thrusters dependent on the the little orange LFO engine?\u003C/p\u003E\u003Cp\u003E11. Why make the O-10 and Vernor dependent like that and not the other way around? I think you went by function, rather than technology.\u003C/p\u003E\u003Cp\u003E12. Why make the ion engine technically dependent on a battery? I know it\u0027s practically dependent, but you could do it the way you did the RTG. Available late, with no dependency.\u003C/p\u003E\u003Cp\u003E13. Why is the gravioli detector not a part of the sensor branch?\u003C/p\u003E\u003Cp\u003EYou can probably tell a lot of these are veiled suggestions, but I\u0027ll go through my exact thoughts later when you answer.\u003C/p\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-26T23:06:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EI like what I\u0027m seeing a lot. And the diagram itself is really elegant.\u003Cp\u003EI looked at it in detail and I have a bunch of question and a bunch of suggestions but they\u0027ll have to wait a bit.\u003C/p\u003E\u003Cp\u003EOne thing I wanted to ask you is whether you have all those part images saved as separate files, and if you could upload them for those who\u0027d like to try designing their own trees.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, yeah, I do actually. They\u0027re basically just screenshots from the KSP wiki, but for convenience here you go:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.filedropper.com/kspparts\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/kspparts\u003C/a\u003E\u003C/p\u003E\n"}]}