{"TopicId":89866,"ForumId":70,"TopicTitle":"Cant launch...Staging does not appear in launch screen","CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2014-11-09T21:21:56Z","PageNum":1,"Articles":[{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2014-11-09T21:21:56Z","Content":"\n\u003Cp\u003ESo I am running a heavily modded install, but dont know if its due to any mod or not.\u003C/p\u003E\u003Cp\u003EI built a rocket, and everything seems fine in VAB. When i go to the launch screen, there is nothing showing for staging, and I cant launch.\u003C/p\u003E\u003Cp\u003EI loaded several other ships, and they work fine... ???\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-11-09T21:31:45Z","Content":"\n\u003Cp\u003EPlease follow the instructions in the \u0022How to get support\u0022 sticky thread in this sub-forum. Mod list (with versions), logs, screenshots etc will be required to give you help...\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2014-11-09T21:39:17Z","Content":"\n\u003Cp\u003EOK, not to appear to be ungrateful or lazy (yes, i have read that thread before, and i have spent quite awhile already searching the forums to see if anyone has had this issue), but I was just wondering if anyone had ever seen this with a vanilla install, before assuming its due to any mods, and spending quite awhile to list all my mods and also, thats the thing: I am not getting ANY crash/error logs...Not to mention i dont even have any idea how to do, or host screenshots....I didnt ask in the UNMODDED support forum, since I figured the second I mentioned I have mods, someone would tell me to come post HERE instead.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m not even SURE its a mod, since all my other ships seem to work fine.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-09T21:46:25Z\u0022 title=\u002211/09/2014 09:46  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 9, 2014\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-11-09T21:47:38Z","Content":"\n\u003Cp\u003EI\u0027ve never encountered this issue (whatever it is) is stock. \u003C/p\u003E\u003Cp\u003ETo take a screenshot, press F1. It\u0027ll be saved in the Screenshots folder in your main KSP install. As for hosting, the easiest is \u003Ca href=\u0022http://imgur.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/\u003C/a\u003E - upload the picture and copy the link under \u0022BBCode (message boards \u0026amp; forums)\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-11-09T22:31:24Z","Content":"\n\u003Cp\u003EI have never seen this particular issue in either a stock or modded install. It is most likely that one of the mods you are using in this particular craft is causing the problem and the things I asked for (logs, screenshots, mod list) as well as the actual .craft file concerned are the most likely things to enable anyone to help...\u003C/p\u003E\u003Cp\u003EThe game writes out a file called output_log.txt on every single run, no exceptions. It can be found in the KSP_Data folder. You will need to run the game, reproduce the issue and then quit the game. \u003C/p\u003E\u003Cp\u003EThen upload the output_log.txt file to a file sharing service (e.g. dropbox etc) and provide a link here. This is all explained in that thread...\u003C/p\u003E\n"},{"CreatedByName":"Didaskalos","CreatedById":129266,"CreatedDateTime":"2014-11-15T18:49:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stone Blue\u0022 data-cite=\u0022Stone Blue\u0022\u003E\u003Cdiv\u003ESo I am running a heavily modded install, but dont know if its due to any mod or not.\u003Cp\u003EI built a rocket, and everything seems fine in VAB. When i go to the launch screen, there is nothing showing for staging, and I cant launch.\u003C/p\u003E\u003Cp\u003EI loaded several other ships, and they work fine... ???\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis just happened to me this morning. The newest mod is KERT. The rocket has a Pack Rat in it. I\u0027ll play with it some more and see what I can discover.\u003C/p\u003E\n"},{"CreatedByName":"Didaskalos","CreatedById":129266,"CreatedDateTime":"2014-11-15T20:47:22Z","Content":"\n\u003Cp\u003EI\u0027m pretty sure it\u0027s the HERP Maintenance Pod. I built a minimal rocket with it as the controlling pod. Manned or unmanned I saw the same thing...no staging, no crew. The output_log.txt had some error lines with it, too. I think I need to reinstall some things and check back later.\u003C/p\u003E\n"},{"CreatedByName":"Didaskalos","CreatedById":129266,"CreatedDateTime":"2014-11-16T00:42:48Z","Content":"\n\u003Cp\u003ETurns out it was the maintenance pod. It\u0027s a broken config file that Roverdude has already posted a hotfix for on his dropbox.\u003C/p\u003E\n"}]}