{"TopicId":89876,"ForumId":18,"TopicTitle":"Science fiction space film in the works","CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-09T22:32:15Z","PageNum":1,"Articles":[{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-09T22:32:15Z","Content":"\n\u003Cp\u003EHello everyone,\u003C/p\u003E\u003Cp\u003EI\u0027m new here, so if what I\u0027m posting isn\u0027t permitted, please let me know.\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027m working on a short film that I hope to later turn into a feature, and I figured I\u0027d mention it here - you all seem like you might be interested in this (I\u0027ve been a space fan since the Gemini days, and I would have been since Mercury if I\u0027d been old enough to realize what was going on).\u003C/p\u003E\u003Cp\u003EThe film is \u0022...and miles to go before i sleep.\u0022 \u003Ca href=\u0022http://www.milestogo-movie.com\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.milestogo-movie.com\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u0022A deadly flu pandemic strikes Earth as a team of astronauts work on the moon. A solar storm wipes out communications and an injury forces them to leave for Earth \u0022in the blind,\u0022 not knowing what to expect back home. \u0022\u003C/p\u003E\u003Cp\u003EWhat\u0027s unusual about this film, especially for an independent short film, is the level of realism we\u0027re trying to achieve. We have some plans for simulating zero-g by using a rotating spacecraft set (rotated between shots, so that what was up is now down or left or right, etc.), along with some other tricks. We\u0027ll also be simulating the one sixth gravity on the moon, something I don\u0027t believe I\u0027ve ever seen another film attempt.\u003C/p\u003E\u003Cp\u003EWe\u0027re also working to make the spacecraft set realistic. The instrument panels are based on those found in spacecraft from Mercury through the Space Shuttle. Not exact, but based on them. Some will even be interactive so that when the actors press a button, something will happen.\u003C/p\u003E\u003Cp\u003EIt\u0027s ambitious, yes, but it would be cheating if it weren\u0027t.\u003C/p\u003E\u003Cp\u003EThe website has links to photos, videos, social media sites and downloadable wallpapers, etc. Visit the site and see what the film is all about!\u003C/p\u003E\u003Cp\u003EAgain, if this isn\u0027t something appropriate for this forum, please let me know and I\u0027ll delete the post or see if I can have an admin do it. I don\u0027t want to break any forum rules.\u003C/p\u003E\u003Cp\u003E- Dave\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh4.googleusercontent.com/-llkYINJrz8g/VF65ItKQJ0I/AAAAAAAAAIw/7FRnhdUZ1LY/s674-no/title-patch-1.png\u0022 alt=\u0022title-patch-1.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-09T22:44:13Z\u0022 title=\u002211/09/2014 10:44  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 9, 2014\u003C/time\u003E by dbarak\u003C/strong\u003E\n\u003Cbr\u003EAdded a missing comma so I don\u0026#039;t look like an idiot.\n\u003C/span\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-11-09T22:41:24Z","Content":"\n\u003Cp\u003EGood luck with your idea, we need more hard sci-fi films! Some thoughts:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dbarak\u0022 data-cite=\u0022dbarak\u0022\u003E\u003Cdiv\u003EWe have some plans for simulating zero-g by using a rotating spacecraft set (rotated between shots, so that what was up is now down or left or right, etc.), along with some other tricks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt might be easier (and much cheaper) to do that with a camera mount that\u0027s able to move into odd positions and angles, rather than the potentially dangerous option of having the whole set move around, if I understand your intention at least.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dbarak\u0022 data-cite=\u0022dbarak\u0022\u003E\u003Cdiv\u003EWe\u0027ll also be simulating the one sixth gravity on the moon, something I don\u0027t believe I\u0027ve ever seen another film attempt.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe that was done for a scene in Apollo 13 where Lovell imagines what walking on the moon would be like. They tied helium balloons to the actors to cancel out 5/6 of their weight.\u003C/p\u003E\n"},{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-09T22:53:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EGood luck with your idea, we need more hard sci-fi films! Some thoughts:\u003Cp\u003EIt might be easier (and much cheaper) to do that with a camera mount that\u0027s able to move into odd positions and angles, rather than the potentially dangerous option of having the whole set move around, if I understand your intention at least.\u003C/p\u003E\u003Cp\u003EI believe that was done for a scene in Apollo 13 where Lovell imagines what walking on the moon would be like. They tied helium balloons to the actors to cancel out 5/6 of their weight.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, thanks NovaSilisko, we need all the good luck thoughts coming our way! As for the rotating set, it would only be rotated between shots with the actors gone. In the long run, they\u0027d all still be on what is actually the bottom of the set. We may have them lie on a platform or something now and then so their hair is streaming \u0022up\u0022 or \u0022out.\u0022 Our number one goal is safety. We don\u0027t want a tragic \u003Ca href=\u0022http://www.cnn.com/2014/02/26/showbiz/slates-for-sarah-elizabeth-jones/index.html\u0022 rel=\u0022external nofollow\u0022\u003ESarah Jones\u003C/a\u003E death or injury, and if any actors or crewmembers have any concerns at any time, they\u0027d be addressed. I couldn\u0027t live with myself if something like that happened.\u003C/p\u003E\u003Cp\u003EHelium balloons? Cool idea, and possibly better than mine. I was thinking of using black bungee cords (I can buy it in bulk), and hanging the actors (only one in a shot at any one time) and hanging them a couple of feet of the ground with the cords under their arms or attached to some sort of harness. It would also need to be shot in slow motion since dust falls back down slower than here (one sixth the speed? I\u0027ll have to check on that).\u003C/p\u003E\u003Cp\u003E- Dave\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-11-09T23:00:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dbarak\u0022 data-cite=\u0022dbarak\u0022\u003E\u003Cdiv\u003EHelium balloons? Cool idea, and possibly better than mine. I was thinking of using black bungee cords (I can buy it in bulk), and hanging the actors (only one in a shot at any one time) and hanging them a couple of feet of the ground with the cords under their arms or attached to some sort of harness. It would also need to be shot in slow motion since dust falls back down slower than here (one sixth the speed? I\u0027ll have to check on that).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat might depend on what you\u0027re using for dust. If you can find something light enough (or fine enough) you might not have to worry about it falling too fast.\u003C/p\u003E\u003Cp\u003EAnd also on that, where are you shooting the lunar scenes? If anything is getting green-screened, you might save yourself a lot of trouble and CGI the dust particles. In terms of post production effects, dust is pretty easy and cheap to do.\u003C/p\u003E\n"},{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-09T23:03:34Z","Content":"\n\u003Cp\u003EGreen screen is an option, but my hope is that we can do it as a live effect so the actors have a bit more to react to. There are a few sand and gravel quarries here in San Diego that might work if I can get permission (and permission to shoot at night). There are dunes east of here that could work too, but the actors might not be too keen on driving two or three hours (I wouldn\u0027t either!). But green screen is an option that we may end up having to go with.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EThat might depend on what you\u0027re using for dust. If you can find something light enough (or fine enough) you might not have to worry about it falling too fast.\u003Cp\u003EAnd also on that, where are you shooting the lunar scenes? If anything is getting green-screened, you might save yourself a lot of trouble and CGI the dust particles. In terms of post production effects, dust is pretty easy and cheap to do.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-11-09T23:07:06Z","Content":"\n\u003Cp\u003EA set would perhaps be a better idea for the moon. With a quarry you could get lots of little annoyances like small plants that have come up between rocks, footprints, tire tracks, etc.\u003C/p\u003E\u003Cp\u003ESomething I see in a lot of moon scenes in various films is dust billowing around after it\u0027s been kicked up - but it doesn\u0027t do that in a vacuum. All the dust particles travel in perfect arcs from their point of origin, yielding a very distinctive \u0022rooster-tail\u0022 effect, as I believe the Apollo astronauts called the dust thrown up by the lunar rover.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/3/3d/Ap16_rover.ogg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/3/3d/Ap16_rover.ogg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-09T23:18:14Z","Content":"\n\u003Cp\u003EExaclty! I\u0027ve been watching quite a few videos of astronauts on the moon, and a lot of people forget there\u0027s no wind to help spread things around. Now that I think about it, kicked-up dust may be something that needs to be added later on.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-11-10T00:58:44Z","Content":"\n\u003Cp\u003EYou might also want to perhaps check out the \u003Ca href=\u0022www.nasaspaceflight.com\u0022 rel=\u0022external nofollow\u0022\u003Ewww.nasaspaceflight.com\u003C/a\u003E forums to ask around for some information and advice. I\u0027m not sure what subforum you\u0027d have to post it in there, though.\u003C/p\u003E\u003Cp\u003ERecommendation: give some sort of subtle explanation in dialogue as to how the crew can navigate to return home from the moon without tracking data from Earth, given trajectory calculations usually depend on that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-10T01:09:42Z\u0022 title=\u002211/10/2014 01:09  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 10, 2014\u003C/time\u003E by NovaSilisko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-10T01:15:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dbarak\u0022 data-cite=\u0022dbarak\u0022\u003E\u003Cdiv\u003EExaclty! I\u0027ve been watching quite a few videos of astronauts on the moon, and a lot of people forget there\u0027s no wind to help spread things around. Now that I think about it, kicked-up dust may be something that needs to be added later on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy the way, my brain knows how to spell but my fingers don\u0027t. I meant \u0022ex-ACT-ly\u0022. I\u0027m not really stipud. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-10T01:19:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EYou might also want to perhaps check out the \u003Ca href=\u0022www.nasaspaceflight.com\u0022 rel=\u0022external nofollow\u0022\u003Ewww.nasaspaceflight.com\u003C/a\u003E forums to ask around for some information and advice. I\u0027m not sure what subforum you\u0027d have to post it in there, though.\u003Cp\u003ERecommendation: give some sort of subtle explanation in dialogue as to how the crew can navigate to return home from the moon without tracking data from Earth, given trajectory calculations usually depend on that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, navigation isn\u0027t something I\u0027d even considered! That\u0027s a good point, and I\u0027ll figure that into the story. I know I won\u0027t be able to get everything technologically right, but hopefully I\u0027ll get enough either right, or likely correct based on projections into the near future. I want to avoid anything groan-worthy. (I\u0027m also doing some fairly heavy research into optical and radio-astronomy, astrobiology and SETI for another film I want to do someday - think \u0022Contact\u0022 if it were to REALLY happen.)\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-11-10T01:21:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dbarak\u0022 data-cite=\u0022dbarak\u0022\u003E\u003Cdiv\u003EActually, navigation isn\u0027t something I\u0027d even considered! That\u0027s a good point, and I\u0027ll figure that into the story. I know I won\u0027t be able to get everything technologically right, but hopefully I\u0027ll get enough either right, or likely correct based on projections into the near future. I want to avoid anything groan-worthy. (I\u0027m also doing some fairly heavy research into optical and radio-astronomy, astrobiology and SETI for another film I want to do someday - think \u0022Contact\u0022 if it were to REALLY happen.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will happily provide feedback on things, science and otherwise. Like I said earlier, there aren\u0027t enough good hard sci-fi films out there, so it would be nice to help change that.\u003C/p\u003E\n"},{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-10T01:41:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EI will happily provide feedback on things, science and otherwise. Like I said earlier, there aren\u0027t enough good hard sci-fi films out there, so it would be nice to help change that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, you don\u0027t know what you\u0027ve gotten yourself in to... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Actually, I would appreciate your advice on things! Should I do that offline here, or via the forum? What I may do is collect my thoughts a bit and send a few questions at once so I don\u0027t clobber the forum or your in-box.\u003C/p\u003E\u003Cp\u003EDave\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-11-10T02:42:18Z","Content":"\n\u003Cp\u003EI\u0027m all for lending a helping hand as well. And this is two of my favorite subjects balled into one. Realistic space adventures, and speculative \u0022how would people react?\u0022 disaster scenarios.\u003C/p\u003E\u003Cp\u003EThe navigation problem might easily be remedied depending on the era in which this takes. Since this is a moon \u0027base,\u0027 we\u0027re talking twenty years ahead at the very least. And computers are WAY better than they were during the Apollo missions. With the kind of electronic gear we can build these days, isn\u0027t it conceivable that the ship could find its own way home? Either way, surely NASA (or whoever this is) has a plan in the event of a long-term communication failure (either from Mission Control OR the astronauts).\u003C/p\u003E\u003Cp\u003E\u0027course, if the flare hit the moon as well and knocked out the autopilot, having your guys whip out the old pen and paper to start planning things out the old-fashioned way could be pretty fun to see.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-10T02:44:37Z\u0022 title=\u002211/10/2014 02:44  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 10, 2014\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-10T03:00:41Z","Content":"\n\u003Cp\u003EActually, this all relates to another issue I had considered - radio frequency transmissions from unattended transmitters. My thought was some power generation systems could continue to run unmonitored for awhile.\u003C/p\u003E\u003Cp\u003EAlthough I understand - vaguely - the workings of GPS, I assume it would be of no value in space, at least the way the system is set up right now. But then again, as you mentioned, computer systems are more powerful now. In fact, I just read an article about some crewmembers from the ISS preparing to return to Earth, and how they would need to fire the ending for four minutes, 41 seconds in order to begin a descent under the correct parameters. Even with Apollo 13, the crew did a fair amount of manual calculation for things like rocket burn times.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-11-10T03:19:58Z","Content":"\n\u003Cp\u003EI\u0027m sure someone out there is already smart enough to have generators in the event of a massive solar flare. I\u0027d be pretty surprised actually, if NASA didn\u0027t have them. Easy way to find out is to just call up and ask. That wouldn\u0027t necessarily help the transmitters though. If the computers get knocked out, anything that sends out signals is going to get fried. However, on a more general level, it\u0027s conceivable that even damaged equipment would be transmitting. It might not be anything a receiver would be happy to hear from, but Earth is probably still going to be sending out some kind of a signal, even if it\u0027s just a lot of very loud static. Even the aurora borealis sends out radio waves when they\u0027re active, and I\u0027ll bet Earth is producing one heck of a light show when this hits the fan. Whether or not it could be heard from the Moon though, I have no idea.\u003C/p\u003E\u003Cp\u003EIf they\u0027re going to do manual calculations though, they don\u0027t need a signal. As long as shipboard clocks are still working and they know everything they need to about their local orbit, they can calculate out where they are, and where the Earth is, relative to the moon, and go from there.\u003C/p\u003E\n"},{"CreatedByName":"dbarak","CreatedById":78310,"CreatedDateTime":"2014-11-10T03:47:56Z","Content":"\n\u003Cp\u003ESo it sounds like a solar flare may or may not damage radio equipment. I guess that\u0027s a matter of the flare\u0027s strength and maybe the fragility of the equipment. The plan for this film is for the flare to last a few days, which I understand is possible, but in the case of a short-duration flare, would electronic equipment on the night side of the Earth be safe?\u003C/p\u003E\n"}]}