{"TopicId":89956,"ForumId":32,"TopicTitle":"How to get someone started on KSP?","CreatedByName":"SpaceLaunchSystem","CreatedById":125698,"CreatedDateTime":"2014-11-10T22:46:39Z","PageNum":1,"Articles":[{"CreatedByName":"SpaceLaunchSystem","CreatedById":125698,"CreatedDateTime":"2014-11-10T22:46:39Z","Content":"\n\u003Cp\u003ESo, my friend wants to play KSP, but for him it seems very complicated. He\u0027s read the Walkthrough for Ye Complete Beginner on the Wiki, but it\u0027s written for the full version. (He\u0027s playing the demo) Any recommendations for getting him started?\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2014-11-10T22:47:24Z","Content":"\n\u003Cp\u003EIf only there were tutorials included in the game!\u003C/p\u003E\n"},{"CreatedByName":"SpaceLaunchSystem","CreatedById":125698,"CreatedDateTime":"2014-11-10T22:48:35Z","Content":"\n\u003Cp\u003EOk, I\u0027ll try that\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-11-10T22:52:00Z","Content":"\n\u003Cp\u003EAlso, don\u0027t forget online tutorials!\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-11-10T22:52:22Z","Content":"\n\u003Cp\u003EIf he\u0027s interested, the battle\u0027s already half-way won. The next best thing you can do is get him interested in specific \u003Cem\u003Egoals\u003C/em\u003E. Maybe show him some videos from Scott Manley or other streamers so he can see whats possible. \u003C/p\u003E\u003Cp\u003EI think I decided I was going \u0022all in\u0022 when I saw someone\u0027s video of a Jool tour in a star trek looking vessel (seriously wish I could remember the author...). I was like \u0022Okay, that\u0027s cool, I\u0027m in\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-11-10T22:55:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EIf he\u0027s interested, the battle\u0027s already half-way won. The next best thing you can do is get him interested in specific \u003Cem\u003Egoals\u003C/em\u003E. Maybe show him some videos from Scott Manley or other streamers so he can see whats possible. \u003Cp\u003EI think I decided I was going \u0022all in\u0022 when I saw someone\u0027s video of a Jool tour in a star trek looking vessel (seriously wish I could remember the author...). I was like \u0022Okay, that\u0027s cool, I\u0027m in\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd Brotoro\u0027s Laythe saga... ah, yeah, that\u0027s the very first KSP story I\u0027ve readed, back when I didn\u0027t even have the demo(my previous computer is unable for Kerballing)... Yeah, OP, I\u0027d suggest to link your friend to inspirating things as well.\u003C/p\u003E\n"},{"CreatedByName":"SpaceLaunchSystem","CreatedById":125698,"CreatedDateTime":"2014-11-10T22:56:00Z","Content":"\n\u003Cp\u003EHmmm... He doesn\u0027t seem all that interested. All I can do is hope and pray...\u003C/p\u003E\n"},{"CreatedByName":"SpaceLaunchSystem","CreatedById":125698,"CreatedDateTime":"2014-11-10T23:15:17Z","Content":"\n\u003Cp\u003EWait... He\u0027s looking a little interested after doing the in-game tutorials.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-11-11T00:40:19Z","Content":"\n\u003Cp\u003EI wasn\u0027t interested in KSP for the longest time until I downloaded the demo version and went through the tutorials.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Kamuchi","CreatedById":110857,"CreatedDateTime":"2014-11-11T00:44:52Z","Content":"\n\u003Cp\u003EPersonally it were all the Manley vids that sparked my interrest after seeing how the basic worked and that there are a \u003Cstrong\u003Eton\u003C/strong\u003E of mods available as the default parts were *abit* lacking for my taste of a space program.\u003C/p\u003E\u003Cp\u003EBought the game on steam once I had an idea how to launch a rocket and go from there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EShow him the vids and some of the mods, if he doesn\u0060t get hooked, he never will.\u003C/p\u003E\u003Cp\u003EThere is more then simplicity of a standard Kerbal \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ck5nq7G.png\u0022 alt=\u0022ck5nq7G.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Q7EBdhK.png\u0022 alt=\u0022Q7EBdhK.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-11T00:47:23Z\u0022 title=\u002211/11/2014 12:47  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 11, 2014\u003C/time\u003E by Kamuchi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-11-11T14:30:00Z","Content":"\n\u003Cp\u003EBaby-step challenges; challenge him to hit a certain height, then get him to try and beat it... or get to stable orbit and back down, then higher and higher Apoapsis until he can get an intercept with the Mun (think it\u0027s only Kerbin and Mun in the Demo, happy to be corrected though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-11T16:06:16Z","Content":"\n\u003Cp\u003EThe demo helps in a sense by having a much tighter set of parts.\u003C/p\u003E\u003Cp\u003EFirst real milestone is to get to space. Fly straight up and see how high you get. If you don\u0027t get above 70 km, make the rocket bigger and try again.\u003C/p\u003E\u003Cp\u003ENext is to get to orbit. For that he may need the pointer that he should pitch over.\u003C/p\u003E\u003Cp\u003EOnce in orbit with some fuel remaining he can start getting to grips with the map view and manouvre nodes. Setting up a Mun flyby or impact is pretty simple.\u003C/p\u003E\n"},{"CreatedByName":"AengorKerbow","CreatedById":127433,"CreatedDateTime":"2014-11-11T17:10:15Z","Content":"\n\u003Cp\u003EThe tutorial has some gaps. For instance maneuvers. It tells you to use them. It even gives you one. But it doesn\u0027t explain how to use them at all. It seems like straightforward stuff unless you are coming into the game completely fresh. I had no idea what direction I was supposed to burn for a maneuver. I was burning toward the prograde vector and wondering why it wasn\u0027t working. \u003C/p\u003E\u003Cp\u003EThen it has some stuff that is very misleading. It said at one point that you need to burn vertically to get above the atmosphere quickly, and it said to burn at apoapsis. Both true things, but when, where, and how it was said leads to some very poor results. I thought I had to burn vertically to get above the atmosphere, then kill the engine, wait until apoapsis, turn horizontal and burn to establish an orbit. It works, but it is incredibly inefficient. My first Mun rocket was this massive thing, because I was making it much more difficult on myself just getting into orbit. And it never talked about quicksaving during a mission, so on my Mun mission, landing with a rocket for the first time, I kept crashing. Every time I crashed I had to start over from takeoff.\u003C/p\u003E\u003Cp\u003EIt wasn\u0027t until watching the Scott Manley videos that it really clicked. The in-game tutorial is just not that good.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2014-11-11T17:59:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceLaunchSystem\u0022 data-cite=\u0022SpaceLaunchSystem\u0022\u003E\u003Cdiv\u003ESo, my friend wants to play KSP, but for him it seems very complicated. He\u0027s read the Walkthrough for Ye Complete Beginner on the Wiki, but it\u0027s written for the full version. (He\u0027s playing the demo) Any recommendations for getting him started?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust start playing and for now ignore those walkthrough/guides. Often they make it seem more complicated than it really is. I would rather if I was him check out a simple tutorial video on basic gravity turn and manouvering.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2014-11-14T23:32:34Z","Content":"\n\u003Cp\u003EI was going to say, being for some it can be somewhat confusing and difficult at first, sit down with him and build with him... there\u0027s plenty of fun stuff you can do with the demo version. If you\u0027re sitting right there to answer some of those \u0022How do I...\u0022 questions, it can help a lot. Once it clicks and kicks in however, he\u0027ll be teaching you lol.\u003C/p\u003E\n"},{"CreatedByName":"m1sz","CreatedById":93466,"CreatedDateTime":"2014-11-15T00:48:35Z","Content":"\n\u003Cp\u003Edoes he like star wars? :-)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=UUxl3h9uyHmel-GF7KCsYGiQ\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-11-15T00:51:47Z","Content":"\n\u003Cp\u003EBuy him the full version \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-11-15T00:55:19Z","Content":"\n\u003Cp\u003EHonestly, It depends on the persona of the person.. If they are the strict FPS gamer, they probably aren\u0027t going to like having to learn orbital mechanics etc. Some people like to just pick up a controller and go without having to learn the ins and outs of periapsis and apoapsis etc. I have to say KSp is about exploration, a sense of adventure, and a creative mind. If they don\u0027t have that, then they really have no hook.\u003C/p\u003E\n"},{"CreatedByName":"SaladFingers","CreatedById":129186,"CreatedDateTime":"2014-11-15T01:06:09Z","Content":"\n\u003Cp\u003EIf he is interested then he will learn very fast. I remember when I played for the first time I didn\u0027t know anything and after few hours of trying I learned to go in Kerbin orbit at any time, two days later I sent my first rover on the Duna and everything went well from the first try but also at that moment I didn\u0027t know about quick save so I was been prepearing a lot about all details and thinking and calculating in my head all factors and I did it from the first try \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2014-11-15T01:14:04Z","Content":"\n\u003Cp\u003ECall them every day and ask them if they\u0027re playing KSP.\u003C/p\u003E\u003Cp\u003EIf they say no, tell them to go play it.\u003C/p\u003E\u003Cp\u003ERepeat until they are addicted.\u003C/p\u003E\u003Cp\u003EProfit.\u003C/p\u003E\u003Cp\u003E???\u003C/p\u003E\n"}]}