{"TopicId":90110,"ForumId":44,"TopicTitle":"[MAJOR SPOILERS!] Newton\u0026#039;s Third Law (Interstellar Related)","CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-11-12T15:21:39Z","PageNum":1,"Articles":[{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-11-12T15:21:39Z","Content":"\n\u003Cp\u003ESo I watched Interstellar yesterday and near the end of the movie they are using the Black Hole to slingshot around in a powered gravity assist. This part doesn\u0027t bother me. What I\u0027m curious about, is during the burn they detach two smaller ships (One lander and one crew transfer vehicle) with the main character stating \u0022Newton\u0027s Third Law: Can\u0027t get anywhere without leaving something behind.\u0022\u003C/p\u003E\u003Cp\u003EThis bugs me because I fail to see how dropping the extra weight changes anything other than the dV of the remaining craft, which from the context of the scene is irrelevant since it is implied that they have enough fuel to get where they are going. Could someone please clarify this please?\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-11-12T15:31:56Z","Content":"\n\u003Cp\u003EThere\u0027s no explanation. It\u0027s not science, it\u0027s \u003Cem\u003Esciencey\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-11-12T15:36:38Z","Content":"\n\u003Cp\u003EI think it was implied they can only accelerate to a velocity for the slingshot to work by dropping the ranger and lander after their fuel is spent. they were used as liquid fuel boosters. Some unspecified reason prevents transferring fuel between main vessel and the two vessels I guess.\u003C/p\u003E\u003Cp\u003EAfter seeing the ranger fly around on the first planet I stopped paying attention to the space craft maneuvers as they were obviously not going for anything close to actuality.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-11-12T15:38:12Z","Content":"\n\u003Cp\u003EYou can\u0027t have a \u0027slingshot\u0027 from a stationary body anyway, not without breaking conservation of momentum.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-11-12T15:47:24Z","Content":"\n\u003Cp\u003Ethey were in decaying orbit around Mann\u0027s planet, then they manage to escape the planet, which puts them in orbit around gargantua; presumably in a position to do the slingshot maneuver around gargantua and end up on a trajectory toward Edmund\u0027s planet, with enough fuel to get into orbit over there, and do all the landings necessary to set up colony camp. it\u0027s a stretch, but doesn\u0027t seem impossible within the envelope of the movie.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-11-12T15:56:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003EI think it was implied they can only accelerate to a velocity for the slingshot to work by dropping the ranger and lander after their fuel is spent. they were used as liquid fuel boosters. Some unspecified reason prevents transferring fuel between main vessel and the two vessels I guess.\u003Cp\u003EAfter seeing the ranger fly around on the first planet I stopped paying attention to the space craft maneuvers as they were obviously not going for anything close to actuality.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis makes sense, I would assume that it would be easier to just dump the excess weight than to try and transfer the fuel.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2014-11-12T15:59:18Z","Content":"\n\u003Cp\u003EIt\u0027s acting like a multi staged vehicle, which means the energy from the Ranger and the Lander where given to the Endurance as a boost, which is why we call boosters \u0022boosters\u0022. That\u0027s exactly what they do. And then the Oberth effect takes hold near the black hole, and so the Endurance is capable of reaching Edmunds. Plus, scientific data from Gargantua was gained.\u003C/p\u003E\u003Cp\u003EHonestly though, the biggest problem is that the whole mission was pointless, because the mission only existed to get Cooper and TARS to the black hole.\u003C/p\u003E\u003Cp\u003EBtw, TARS said it, not Cooper.\u003C/p\u003E\u003Cp\u003EPlus, what\u0027s usually left behind is propellant, but on multi staged vehicles the stages are left behind, too. It\u0027s more efficient than single stages for things like getting into orbit.\u003C/p\u003E\n"},{"CreatedByName":"psychemist","CreatedById":123425,"CreatedDateTime":"2014-11-13T10:20:48Z","Content":"\n\u003Cp\u003ESaw this visual gem the other night in IMAX. The Newton\u0027s 3rd law line is my fave in the movie, next to another TARS line about slaves for a robot colony. The Newton line is a joke; TARS was already hopping off the ship to dive into the black hole - for data. His mass is obviously insignificant compared to the whole ship. TARS just needed to make a crack at Cooper one last time (before Cooper dropped himself in the black hole as well, unexpectedly).\u003C/p\u003E\u003Cp\u003EOverall, despite some Newton-y physics issues, the consultation of wormhole expert Dr. Kip Thorne for calculating (yes, \u003Ca href=\u0022http://www.wired.com/2014/10/astrophysics-interstellar-black-hole/\u0022 rel=\u0022external nofollow\u0022\u003Ecalculating\u003C/a\u003E) the visual appearance of the black hole and the wormhole was an excellent choice. The result is actually scientifically significant, as the two renderings are the most detailed and accurate models of their respective phenomena ever visualized. Neat, huh?\u003C/p\u003E\u003Cp\u003EBtw for those who do not know, the wormhole and black hole interior scenes are \u003Cstrong\u003Estrongly\u003C/strong\u003E reminiscent of the psychedelic experience. Any agreements?\u003C/p\u003E\u003Cp\u003EAT LEAST THERE WAS NO SOUND IN SPACE!!!!! That point alone is worth so much in sci-fi realism points, though a little less so nowadays.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-11-13T11:25:17Z","Content":"\n\u003Cp\u003EEnding of a movie is ......... Just move on.\u003C/p\u003E\u003Cp\u003E(BTW: You got one moment right, but there\u0027s another thing off with that scene: They turned off the engines, detached the ships, and.... ships flew backwards! hahahaha, it\u0027s more stupid than a scene in Gravity when they Bullock cuts off Clooney - that one at least can be explained with centrifugal force.)\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-11-13T18:25:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EEnding of a movie is ......... Just move on.\u003Cp\u003E(BTW: You got one moment right, but there\u0027s another thing off with that scene: They turned off the engines, detached the ships, and.... ships flew backwards! hahahaha, it\u0027s more stupid than a scene in Gravity when they Bullock cuts off Clooney - that one at least can be explained with centrifugal force.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe ships flew backwards because the main craft was still accelerating. The reference frame of the camera is attached to the main ship, so any motion in reference to that frame would be observed as moving away from that reference. \u003C/p\u003E\u003Cp\u003ETo use that scene specifically: The camera (And by extension the Explorer) are accelerating at a certain speed. The Ranger detaches and is no longer accelerating, but because the camera is moving away from the the Ranger it appears as if the Ranger is falling away from the Explorer.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-11-13T18:39:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003Ethe ships flew backwards because the main craft was still accelerating.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou want to tell me that they were dumping tons, asymmetrically, one by one, while still accelerating? And both of these dumped ships run out of fuel in exact same moment? I can\u0027t tell which one of these scenarios is more stupid: Ships flying backwards or them doing this.\u003C/p\u003E\u003Cp\u003E Which brings us to another, related issue with that scene: both ships detached ~30 seconds between each other entering the black hole within... minute (?) after that event... there can\u0027t possibly be any orbit that would allow slingshot around a black hole while at the same time dumping spacecraft right into the black hole.\u003C/p\u003E\u003Cp\u003EYou know what happened as far as I seen that scene? Typical Star Wars-level Sci-Fi:\u003C/p\u003E\u003Cp\u003E1. Mothership approaches black hole\u003C/p\u003E\u003Cp\u003E2. Mothership turns all the engines on\u003C/p\u003E\u003Cp\u003E3. Mothership turns the engines off, dumps smaller ships, they get sucked into black hole (remember: Star Wars-style black hole),\u003C/p\u003E\u003Cp\u003E4. Mothership flies away safe\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-11-13T19:21:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EYou want to tell me that they were dumping tons, asymmetrically, one by one, while still accelerating? And both of these dumped ships run out of fuel in exact same moment? I can\u0027t tell which one of these scenarios is more stupid: Ships flying backwards or them doing this.\u003Cp\u003E Which brings us to another, related issue with that scene: both ships detached ~30 seconds between each other entering the black hole within... minute (?) after that event... there can\u0027t possibly be any orbit that would allow slingshot around a black hole while at the same time dumping spacecraft right into the black hole.\u003C/p\u003E\u003Cp\u003EYou know what happened as far as I seen that scene? Typical Star Wars-level Sci-Fi:\u003C/p\u003E\u003Cp\u003E1. Mothership approaches black hole\u003C/p\u003E\u003Cp\u003E2. Mothership turns all the engines on\u003C/p\u003E\u003Cp\u003E3. Mothership turns the engines off, dumps smaller ships, they get sucked into black hole (remember: Star Wars-style black hole),\u003C/p\u003E\u003Cp\u003E4. Mothership flies away safe\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you\u0027re taking the timing too literally. Film is by necessity sequential, but the events depicted doesn\u0027t necessarily have to happen in the same sequence or over the same amount of time that it took for the film to roll through the projector. just because X-seconds elapsed between shots doesn\u0027t mean the events took the same amount of time. Remember the ship was already out of balance when Mann blew up a section of the ring when attempting to dock earlier. Sure the space ship maneuvering isn\u0027t close to \u0022real\u0022. A single ranger took two stages of boosting to get into (low, presumably) Earth orbit; but was able to land AND take off under it\u0027s own power (with nearly the same payload as taking off from Earth) on a planet that\u0027s 1.3x earth\u0027s gravity. Within the bounds of the film\u0027s reality, it\u0027s not impossible to imagine that one of the docked vessels, the remaining ranger or one or both of the landers, had to fire at less than full throttle to allow the entire thing to be controllable. which would result in sequential separations as one will necessarily run out of fuel sooner.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-13T19:26:30Z\u0022 title=\u002211/13/2014 07:26  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 13, 2014\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-11-13T19:34:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003EI think you\u0027re taking the timing too literally. Film is by necessity sequential, but the events depicted doesn\u0027t necessarily have to happen in the same sequence or over the same amount of time that it took for the film to roll through the projector. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re missing the point.\u003C/p\u003E\u003Cp\u003EThink about that: He had a small lander and (by some miracle) ended up on a decaying orbit to the black hole. I doubt anything he could possibly be on could last less than several months (and most likely we\u0027re talking about millenia here) before he\u0027d get anywhere past the event horizon. But in a movies it\u0027s a blink of an eye, no starvation, no problems with lack of water, no... anything. Simply put: this guy is dead long before reaching the black hole in that sequence.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003ERemember the ship was already out of balance when Mann blew up a section of the ring when attempting to dock earlier.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EShip was build to fly slightly imbalanced - these big boxes you see on a ring were suppose to be dropped to the orbit, so I assume it could at a very least lift it\u0027s orbit up while being slightly unbalanced, but dropping such weight while at maximum thrust is... as dumb as opening an airlock just like that. Every sane person would turn the engines off, drop both ships at a time, and slowly throttle up balancing the thrust to keep mothership stable.\u003C/p\u003E\u003Cp\u003E(by \u0022both ships at a time\u0022 I obviously mean before turning the engines back again. These two ships would be undocked one by one, not simultaneously)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003EA single ranger took two stages of boosting to get into (low, presumably) Earth orbit; but was able to land AND take off under it\u0027s own power (with nearly the same payload as taking off from Earth) on a planet that\u0027s 1.3x earth\u0027s gravity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet\u0027s not forget about reentry - full-on Star Wars style. Ship shakes ,bumps, and ends up on a surface. It\u0027s borderline identical to Luke Skywalker landing on Dagobah in an X-wing (it even ended up in water, just like crew of that shuttle from Interstellar! Though their shuttle did not sunk...).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003Ewhich would result in sequential separations as one will necessarily run out of fuel sooner.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is not what happened in the movie (in what I seen: they turned off the engines, said goodbye to each other (note: no more vibrations or noise from the engines) and then undocked just to be sucked into a black hole).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-13T20:16:34Z\u0022 title=\u002211/13/2014 08:16  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 13, 2014\u003C/time\u003E by Sky_walker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-11-13T19:46:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThink about that: He had a small lander and (by some miracle) ended up on a decaying orbit to the black hole. I doubt anything he could possibly be on could last less than several months (and most likely we\u0027re talking about millenia here) before he\u0027d get anywhere past the event horizon. But in a movies it\u0027s a blink of an eye, no starvation, no problems with lack of water, no... anything. Simply put: this guy is dead long before reaching the black hole in that sequence.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey were in a decaying orbit around Mann\u0027s planet that was a result of Mann blowing up part of the ship when attempting to dock. The lander docked, gained control, and then boosted out of orbit around Mann\u0027s Planet. Which puts them in a stable orbit around Gargantua. From there they planned and executed some dubious maneuver that throws what\u0027s left of the main ship on a trajectory to Edmund\u0027s planet (that turned out to be Mars). which required a long, and likely not continuous, burn. Afterall, the main ship is powered by plasma drive, the burn would take a long time, as you say, many years in earth\u0027s time. plenty time for the teary farewells. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EShip was build to fly slightly imbalanced - these big boxes you see on a ring were suppose to be dropped to the orbit, so I assume it could at a very least lift it\u0027s orbit up while being slightly unbalanced, but dropping such weight while at maximum thrust is... almost as dumb as opening an airlock just like that. Every sane person would turn the engines off, drop both ships at a time, and slowly throttle up balancing the thrust to keep mothership stable.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESlightly unbalanced, sure. It wasn\u0027t intended to drop cargo on all 3 planets. only one. So sure, the entire sequence of maneuvers is \u0022almost as dumb\u0022 as Mann blowing the airlock. But again, not impossible within the boundries of the film.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELet\u0027s not forget about reentry - full-on Star Wars style. Ship shakes ,bumps, and ends up on a surface. It\u0027s borderline identical to Luke Skywalker landing on Dagobah.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Ranger appears to be slightly more aerodynamically plausible than the X-Wing. Okay not really. but that\u0027s besides the point.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhich is not what happened in the movie (they clearly turned off the engines, said goodbye to each other and then undocked just to be sucked into a black hole.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ecall it artistic license, one of the last in a long series in the film. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-13T19:56:38Z\u0022 title=\u002211/13/2014 07:56  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 13, 2014\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-11-13T20:05:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003EThey were in a decaying orbit around Mann\u0027s planet that was a result of Mann blowing up part of the ship when attempting to dock. The lander docked, gained control, and then boosted out of orbit around Mann\u0027s Planet. Which puts them in a stable orbit around Gargantua. From there they planned and executed some dubious maneuver that throws what\u0027s left of the main ship on a trajectory to Edmund\u0027s planet (that turned out to be Mars). which required a long, and likely not continuous, burn. Afterall, the main ship is powered by plasma drive, the burn would take a long time, as you say, many years in earth\u0027s time. plenty time for the teary farewells. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHehehe, yea, which is another funny thing - so, they were sitting in their chairs shaking for all that time of burns? I presume some of them might have taken days if not more.... was this crew selected by it\u0027s bladder capacity? That would explain why none of the pilots in the whole US was better than a long-term farmer who flew last time years ago and was strapped onto the rocket just like that without years of training for such a super-complicated and demanding mission.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003EBut again, not impossible within the boundries of the film.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat excuse can be used for any sci-fi movie ever, no matter how much \u0022fi\u0022 is it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003EThe Ranger appears to be slightly more aerodynamically plausible than the X-Wing. Okay not really. but that\u0027s besides the point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was designed to be a boat. Which sort of makes sense considering the water planet, but doesn\u0027t make sense considering all that garbage talk about \u0022aerodynamics\u0022.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-13T20:17:35Z\u0022 title=\u002211/13/2014 08:17  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 13, 2014\u003C/time\u003E by Sky_walker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-11-13T20:11:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EHehehe, yea, which is another funny thing - so, they were sitting in their chairs shaking for all that time of burns? I presume some of them might have taken days if not more.... was this crew selected by it\u0027s bladder capacity? That would explain why none of the pilots in the whole US was better than a long-term farmer who flew last time years ago and was strapped onto the rocket just like that without years of training for such a super-complicated and demanding mission.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou forget the case of the astronaut driving for days non-stop on a revenge trip? they have diapers.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThat excuse can be used for any sci-fi movie ever, no matter how much \u0022fi\u0022 is it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eit IS the excuse for any sci-fi movie, no matter how much \u0022fi\u0022 is in it. Any film, strictly speaking, even documentaries.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-11-13T20:13:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003Eyou forget the case of the astronaut driving for days non-stop on a revenge trip? they have diapers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 alt=\u0022:sealed:\u0022\u003E You had to burn my joke!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003Eit IS the excuse for any sci-fi movie, no matter how much \u0022fi\u0022 is in it. Any film, strictly speaking, even documentaries.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHehehe, fair enough \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-11-13T20:19:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003ESo I watched Interstellar yesterday and near the end of the movie they are using the Black Hole to slingshot around in a powered gravity assist. This part doesn\u0027t bother me. What I\u0027m curious about, is during the burn they detach two smaller ships (One lander and one crew transfer vehicle) with the main character stating \u0022Newton\u0027s Third Law: Can\u0027t get anywhere without leaving something behind.\u0022\u003Cp\u003EThis bugs me because I fail to see how dropping the extra weight changes anything other than the dV of the remaining craft, which from the context of the scene is irrelevant since it is implied that they have enough fuel to get where they are going. Could someone please clarify this please?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen he detaches, he pushes against the craft to escape.\u003C/p\u003E\n"},{"CreatedByName":"yogi8ears","CreatedById":129369,"CreatedDateTime":"2014-11-16T21:32:20Z","Content":"\n\u003Cp\u003ECentrifugal force of the space station, it\u0027s actually several different masses exerting force in a centrifugal manner. Not a scientist, but not impossible.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-11-17T02:15:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EThat would explain why none of the pilots in the whole US was better than a long-term farmer who flew last time years ago and was strapped onto the rocket just like that without years of training for such a super-complicated and demanding mission.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo one else available had \u003Cem\u003Eany\u003C/em\u003E flight experience at all. Cooper objects that he\u0027s never been out of the stratosphere, and the old professor guy says \u0027the others have never been out of the simulator\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-11-17T10:50:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003ENo one else available had \u003Cem\u003Eany\u003C/em\u003E flight experience at all. Cooper objects that he\u0027s never been out of the stratosphere, and the old professor guy says \u0027the others have never been out of the simulator\u0027.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn entire US, a country that just build a mega-starship on the orbit using godawful powerful rockets, noone ever \u0022been out of the simulator\u0022? Yea, right, I call that: Total BS.\u003C/p\u003E\u003Cp\u003EJust like this thing with super heavy launch vehicles being launched in secret, secret NASA that noone knows about, an office with a moving wall opening right into the launch silo where they are still welding something to the engines, sending crew to the most risky mission in a human history where noone but one guy ever \u0022been out of the simulator\u0022, or the fact that they had to manually dock with the space station - station that obviously had it\u0027s assembly had to be done by people, as otherwise they\u0027d have automated docking systems for years, perfected enough to accomplish extremely complex and large scale orbital construction effort (automatic docking of a manned ship is a piece of cake comparing to automated assembly of something in that size on an orbit).\u003C/p\u003E\u003Cp\u003EJust put an X-wings there, and get over it. Or Star Trek teleportation devises. It\u0027d make more sense than this whole affair in the movie. Nothing makes sense there. It\u0027s nonsense on top of nonsense on top of nonsense. I liked this movie, I really did, but trying to call it as a masterpiece of realism like many people do (not you, but in general) makes me laugh.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-17T11:03:34Z\u0022 title=\u002211/17/2014 11:03  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 17, 2014\u003C/time\u003E by Sky_walker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2014-11-17T10:54:54Z","Content":"\n\u003Cp\u003EAside from someone magically save Cooper out of the black hole, which I doesn\u0027t understand at all, there is a very \u003Cem\u003Eslight\u003C/em\u003E possibility to use \u003Cem\u003Erotating\u003C/em\u003E black hole as an energy source:\u003C/p\u003E\u003Cp\u003EA rotating black hole might provide additional assistance, if its spin axis is aligned the right way. General relativity predicts that a large spinning mass produces frame-draggingÃ¢â‚¬â€close to the object, space itself is dragged around in the direction of the spin. Any ordinary rotating object produces this effect. Although attempts to measure frame dragging about the Sun have produced no clear evidence, experiments performed by Gravity Probe B have detected frame-dragging effects caused by Earth.[11] General relativity predicts that a spinning black hole is surrounded by a region of space, called the ergosphere, within which standing still (with respect to the black hole\u0027s spin) is impossible, because space itself is dragged at the speed of light in the same direction as the black hole\u0027s spin. The Penrose process may offer a way to gain energy from the ergosphere, although it would require the spaceship to dump some \u0022ballast\u0022 into the black hole, and the spaceship would have had to expend energy to carry the \u0022ballast\u0022 to the black hole.\u003C/p\u003E\u003Cp\u003EI don\u0027t know if this is right or not, its from here: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Gravity_assist\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Gravity_assist\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd of course the good old Oberth effect helps\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-11-20T18:32:03Z","Content":"\n\u003Cp\u003EYou guys might want to consider picking up a copy of Kip Thorne\u0027s \u0022The Science of Interstellar.\u0022\u003C/p\u003E\u003Cp\u003EWhile many of the things are physically possible, a LOT of it is a bit of a stretch. For instance, Miller\u0027s planet, in order to have the 1 hr = 7 year time dilation, would be in a tight orbit near the event horizon of Gargantua (even horizon is about the diameter of Earth\u0027s orbit). The orbital velocity is listed at 0.55c. 0.55c! 0.55c! Incidentally, that\u0027s a 95 minute \u0022year.\u0022\u003C/p\u003E\u003Cp\u003EThorne reconciles this with the use of gravitational sling-shots around unmentioned smaller black holes and (mentioned) neutron stars in orbit of Gargantua.\u003C/p\u003E\u003Cp\u003EAnyway, interesting read.\u003C/p\u003E\u003Cp\u003EThe stated reason for the giant lifter for the Ranger was to save the super efficient fuel for the other side. Keep it topped off.\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2014-11-20T19:48:25Z","Content":"\n\u003Cp\u003EThe \u0022third law\u0022 joke is actually practical. Say, you\u0027re making an oberth maneuver near Sun, then you want to escape, of course you need to dump things. Near a black hole it might be much more needed (because newtonian orbital mechanics would fairly fail out there.)\u003C/p\u003E\u003Cp\u003EWhat I can\u0027t still understand are those huge waves (they say it have a thing with frame dragging - but why aren\u0027t the solids of the planet being affected ?). Those ice block clouds (that\u0027s still flying apparently). Why there aren\u0027t any passing stars that should\u0027ve crippled the planetary system (if it\u0027s an SMBH I\u0027d suggest that, as locations are in the middle of galaxies). Where are the short wavelength radiations (expected around blackholes, no ? External sources maybe, for example other stellar remnants). Why does cooper still sees the displays while he says (or feels I\u0027d rather say) already entered the event horizon. Also, the film somewhat makes it that all blackholes are connected (but I can\u0027t really complaint this one - don\u0027t know the calculations myself regarding forms of spacetime, hence trying to understand tensors now).\u003C/p\u003E\u003Cp\u003EA bit of sad considering they had physicist within.\u003C/p\u003E\n"},{"CreatedByName":"Gardian of the Galixcey","CreatedById":140469,"CreatedDateTime":"2015-04-04T22:15:35Z","Content":"\n\u003Cp\u003ERegardless of the movies facts and half truths, it is a good movie. One of the things that many forget is modularization like the Space Station. The other thing I see here is the use of weight instead of mass. Weight is used here on Earth that already factors in Gravity. Force (F) is equal Mass (m) time acceleration (a), F=ma hence when the separation takes place it is the Mass of the object and not the weight. In space there is basically no weight (weightlessness) unless you consider the forces that are acting on each mass. Such as the gravity from the other planets or in this case the forces of the Black Hole. This is a great movie in helping people think of the possibilities. Cosmos is one of the series which helps to understand the way things work in a vacuum.\u003C/p\u003E\n"}]}