{"TopicId":90133,"ForumId":69,"TopicTitle":"Strange behaviour of craft.","CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2014-11-12T19:29:59Z","PageNum":1,"Articles":[{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2014-11-12T19:29:59Z","Content":"\n\u003Cp\u003ESince the last update, I have noticed some strange craft behaviour.\u003C/p\u003E\u003Cp\u003EFirst let me just point out that I am not a noob.\u003C/p\u003E\u003Cp\u003EI have over 3000 (three thousand) hours of ksp experience.\u003C/p\u003E\u003Cp\u003EI have made lots and LOTS of space-aeroplanes. I have visited every body in the system, landed, did science, returned and landed at the runway. several times.\u003C/p\u003E\u003Cp\u003EI know how to fuel my engines to keep COM stable.\u003C/p\u003E\u003Cp\u003EI am careful about symmetrical drag.\u003C/p\u003E\u003Cp\u003EI have begun to notice quirks. On launch, there is often a slight yaw to starboard making the heading 91 degrees. Some tenacity is then required to lock onto 90 degrees. I try to go for a good equatorial orbit right out of the gate.\u003C/p\u003E\u003Cp\u003EThat is just a niggle.\u003C/p\u003E\u003Cp\u003EWhat really bothers me is the re-entry. \u003C/p\u003E\u003Cp\u003EThe craft will be holding a course, re-entry burn is over, speed is way lower than the craft\u0027s max speed under propulsion. It seem slike it could, if left alone go all the way to the ground in this configuration. Seems solid.\u003C/p\u003E\u003Cp\u003EWhen I go to make a minor roll adjustment to improve my line-up on the runway, the craft will often yaw, usually to starboard and try to assume an engine first configuration. If the maneuver begins, it is impossible to correct. The only way I can save from this is to wait until airspeed drops with enough altitude to fire the engines, (If I have the fuel) and then regain control.\u003C/p\u003E\u003Cp\u003EI have no idea what causes the initial yaw but at this point trying to control it is like trying to fly an aeroplane which normally has two good wings with just one wing.\u003C/p\u003E\u003Cp\u003EUsually, but not always on larger craft, the space-aeroplane can be re entering at varying angles. I have landed some steep re-entries without losing control and in reality would have burned, broken or bounced off the atmosphere. I prefer a more shallow re-entry for realism. Takes a little longer but the final approach is more fun.\u003C/p\u003E\u003Cp\u003EI sometimes do the re-entry burn from the opposite side of Kerbin for a really shallow re-entry with an intact periapsis. Working out where to burn to still be able to reach home without overshooting is lots of fun. But even on these shallowest of re-entries I get the same glitch.\u003C/p\u003E\u003Cp\u003EIt happens on completely different craft.\u003C/p\u003E\u003Cp\u003EIt is almost like an air-brake switches on on the starboard side. As if something is causing a lot of drag. Yet the craft is symmetrical.\u003C/p\u003E\u003Cp\u003EI do know that I am having problems with types of craft that never used to give me any trouble. So I know that there is a glitch.\u003C/p\u003E\u003Cp\u003EIs it general knowledge?\u003C/p\u003E\n"}]}