{"TopicId":90151,"ForumId":34,"TopicTitle":"[1.1.2] Realism Overhaul v11.0.0 May 8","CreatedByName":"Felger","CreatedById":76828,"CreatedDateTime":"2014-11-13T00:02:09Z","PageNum":55,"Articles":[{"CreatedByName":"Aviator17","CreatedById":129803,"CreatedDateTime":"2015-03-24T21:07:51Z","Content":"\n\u003Cp\u003EI installed this via CKAN. It installed normally and as far as I can tell the Realism Overhaul aspect of the install works properly.\u003C/p\u003E\u003Cp\u003EI also reinstalled CSS (after having reinstalled KSP itself in order to get a fresh start on mods). Before downloading Realism Overhaul, my CSS was working properly and with no issues. I have noticed that Realism Overhaul automatically (from what I can tell) updated the fuel burn rates of the CSS so that it is able to obtain orbit.\u003C/p\u003E\u003Cp\u003EUnfortunately there is an issue with my install that is causing my CSS.craft file (and as far as I have noticed, all other .craft files) to not properly build. There are parts within other parts and it appears as tho it is a scaling issue in that the parts are attempting to connect to hardpoints from the original scaling. This is a minor problem that does not affect me too much because I was able to rebuild the CSS manually. However, if there is a fix for this, I would like to know it.\u003C/p\u003E\u003Cp\u003EThe bigger issue is that MechJeb2 does not appear to work with this mod (or series of mods rather). When I select the \u0022limit to terminal velocity\u0022 option, it is incapable of doing so. It does not even reduce the power setting. The shuttle also is unable to maintain a vertical attitude, and unless I use the in-game SAS, continues to nose down during the ascent. I checked the aerodynamic information of FAR and found that the CSS was encountering a series of \u0022minor stalls\u0022. I am not sure if the CSS is incompatible with FAR or if the issue is that my manual assembly is not \u0022perfect\u0022.\u003C/p\u003E\u003Cp\u003ETo sum this up I would like fixes (even if they are edits that I must make in my own files, or certain aspects of the mod that must be removed) for:\u003C/p\u003E\u003Cp\u003ECSS breaching terminal velocity\u003C/p\u003E\u003Cp\u003ECSS minor stalling/inability to maintain vertical\u003C/p\u003E\u003Cp\u003E.craft file clipping issue (due to scaling changes?)\u003C/p\u003E\u003Cp\u003EThank you, and otherwise, awesome mod collection!\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-03-24T21:51:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aviator17\u0022 data-cite=\u0022Aviator17\u0022\u003E\u003Cdiv\u003EHowever, if there is a fix for this, I would like to know it.\u003C/div\u003E\u003C/blockquote\u003ERO rescales pretty much every part it touches, stock craft files are not going to load correctly and should be rebuilt.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aviator17\u0022 data-cite=\u0022Aviator17\u0022\u003E\u003Cdiv\u003EThe bigger issue is that MechJeb2 does not appear to work with this mod (or series of mods rather).\u003C/div\u003E\u003C/blockquote\u003EStrange, I\u0027ve been told that you simply \u003Cem\u003Ecannot\u003C/em\u003E play RO without MechJeb2 (even though I do just that)...\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aviator17\u0022 data-cite=\u0022Aviator17\u0022\u003E\u003Cdiv\u003EWhen I select the \u0022limit to terminal velocity\u0022 option, it is incapable of doing so.\u003C/div\u003E\u003C/blockquote\u003EDoes the CSS ever reach terminal velocity?\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aviator17\u0022 data-cite=\u0022Aviator17\u0022\u003E\u003Cdiv\u003EThe shuttle also is unable to maintain a vertical attitude, and unless I use the in-game SAS, continues to nose down during the ascent.\u003C/div\u003E\u003C/blockquote\u003ESounds about right, generally you\u0027ll want the craft to do this during launch anyway. The Space Shuttle probably started nosing over fairly soon off the pad IRL, you might want to look up its ascent profile on the web. I generally start nosing any craft over at 100m/s in an RO install.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aviator17\u0022 data-cite=\u0022Aviator17\u0022\u003E\u003Cdiv\u003EI checked the aerodynamic information of FAR and found that the CSS was encountering a series of \u0022minor stalls\u0022.\u003C/div\u003E\u003C/blockquote\u003EThis should be fine for launch. Does it get to orbit?\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-24T21:55:31Z\u0022 title=\u002203/24/2015 09:55  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 24, 2015\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aviator17","CreatedById":129803,"CreatedDateTime":"2015-03-24T22:30:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EDoes the CSS ever reach terminal velocity?\u003Cp\u003ESounds about right, generally you\u0027ll want the craft to do this during launch anyway. The Space Shuttle probably started nosing over fairly soon off the pad IRL, you might want to look up its ascent profile on the web. I generally start nosing any craft over at 100m/s in an RO install.\u003C/p\u003E\u003Cp\u003EThis should be fine for launch. Does it get to orbit?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe CSS definitely reaches terminal velocity, it encounters aerodynamic heating (which thanks to deadly reentry, destroys the shuttle).\u003C/p\u003E\u003Cp\u003EYes the shuttle in real life climbs at a slightly nose low attitude (probably about 3 degrees), but it does not continue to pitch down further and further. In fact, in real life, the shuttle rotates to opposite its planned course and pitches up so that it is inverted. I am unable to keep the nose from lowering and as such don\u0027t have the ability to rotate it to opposite its planned course. I am not saying that it is pitching due to the planned course by mechjeb, as I have a lot of experience with mechjeb I know that this is not a maneuver that is under the control of mechjeb, but instead some unplanned pitching. My best guess is that the CSS is not compatible with FAR, so I will try uninstalling FAR. I will post after doing this to state whether or not this fixed the issue.\u003C/p\u003E\u003Cp\u003EAs a result of all of these issues, I have yet to get it to orbit (although using the in-game SAS I was able to escape the atmosphere, but was unable to maneuver it into orbit, because as soon as I turned SAS off the shuttle started rolling and pitching all over the place).\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-03-24T22:35:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aviator17\u0022 data-cite=\u0022Aviator17\u0022\u003E\u003Cdiv\u003EYes the shuttle in real life climbs at a slightly nose low attitude (probably about 3 degrees), but it does not continue to pitch down further and further. In fact, in real life, the shuttle rotates to opposite its planned course and pitches up so that it is inverted.\u003C/div\u003E\u003C/blockquote\u003EExcuse me for the lack of technicality, I used the term \u0022nose-over\u0022 to indicate an inclination towards the desired prograde vector.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aviator17\u0022 data-cite=\u0022Aviator17\u0022\u003E\u003Cdiv\u003EI am unable to keep the nose from lowering and as such don\u0027t have the ability to rotate it to opposite its planned course. I am not saying that it is pitching due to the planned course by mechjeb, as I have a lot of experience with mechjeb I know that this is not a maneuver that is under the control of mechjeb, but instead some unplanned pitching. My best guess is that the CSS is not compatible with FAR, so I will try uninstalling FAR.\u003C/div\u003E\u003C/blockquote\u003EYour install might be missing a plugin, maybe something to do with engine gimballing. Either that or the CSS isn\u0027t \u003Cem\u003Eentirely\u003C/em\u003E compatible. How much delta-V shows for the craft in the VAB? Does the TWR look correct? It might be light.\n"},{"CreatedByName":"Hattivat","CreatedById":110255,"CreatedDateTime":"2015-03-24T22:51:36Z","Content":"\n\u003Cp\u003EConsidering the \u0022limit to terminal velocity\u0022 thing, you can forget about that option. First of all, since 90%\u002B of large rocket engines in real life do not throttle, it will not work. The few that can throttle usually have a very limited range in which they can do that, for example the space shuttle main engines can throttle down to about 60% of maximum thrust IIRC, any lower and they flame out. Second, it would not be useful anyway, since terminal velocity is not really a limiting factor for real launches. You seem to be assuming that rockets burning up on ascent due to deadly reentry is right, and your inability to limit acceleration is wrong, while in reality the precise opposity is true - it is the deadly reentry that is the less realistic part here. Real rockets do not throttle (save a few exceptions), but they do not burn up on ascent either, even the ones with very high TWRs. If Deadly Reentry is making your rockets burn up on ascent, then it\u0027s wrong and needs to have its settings toned down.\u003C/p\u003E\u003Cp\u003EAs for uninstalling FAR - that is a horrible idea. First, because it is the corenerstone of the whole Realism Overhaul project and everything is configured with the assumption that you are using it, and second, because it will actually make things needlessly harder - with stock soupodynamics you will need more delta-v to achieve orbit and the reentries will likely be deadlier.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-03-24T23:05:19Z","Content":"\n\u003Cp\u003EIt\u0027s also worth noting that \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71360\u0022 rel=\u0022external nofollow\u0022\u003ECSS\u003C/a\u003E is marked as \u0022WIP\u0022 insofar as an RSS version is concerned. You might want to get ahold of Dragon01 to help the project out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-24T23:16:45Z\u0022 title=\u002203/24/2015 11:16  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 24, 2015\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aviator17","CreatedById":129803,"CreatedDateTime":"2015-03-24T23:34:01Z","Content":"\n\u003Cp\u003EI understand that not all rocket engines have the ability to throttle. I am speaking exclusively about the SSME\u0027s of the CSS. The speeds do not seem excessive from my knowledge of shuttle launches (max q at approx. 6km and 350m/s, however, when the shuttle reaches about 1,000 m/s (roughly 2,000 mph) it begins to \u0022burn up\u0022. The orange glow can be seen around the craft, which is definitely something that does not occur during a shuttle launch. Should I try limiting the acceleration to 3g instead of using limit to terminal velocity? Also, what could be causing the aerodynamic heating if the speeds are appropriate for real life?\u003C/p\u003E\u003Cp\u003ENote: this still does not correct the issue of a continuous nose over (arcs so badly that it does not get to \u0022second layer\u0022 of atmosphere before being at 0 degrees of pitch). If the cause of this is not FAR, then what could be causing it?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EIt\u0027s also worth noting that \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71360\u0022 rel=\u0022external nofollow\u0022\u003ECSS\u003C/a\u003E is marked as \u0022WIP\u0022 insofar as an RSS version is concerned. You might want to get ahold of Dragon01 to help the project out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you, I did not notice that. I saw it on the list of recommended additions and assumed (wrongly so) that it was all set. I will certainly do so.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EYour install might be missing a plugin, maybe something to do with engine gimballing. Either that or the CSS isn\u0027t \u003Cem\u003Eentirely\u003C/em\u003E compatible. How much delta-V shows for the craft in the VAB? Does the TWR look correct? It might be light.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe SSME\u0027s appear to be functioning properly, so it is most likely that CSS is not yet entirely compatible. I will get back to you on the accuracy of the figures.\u003C/p\u003E\u003Cp\u003EEDIT: The TWR is off by .2 at launch. The value should be approximately 1.5, but is 1.7 at launch. I am not sure what the rate of change is on this as the shuttle climbs, but the launch values are definitely off. I will just have to wait until CSS is fully compatible. Thanks for trying to help, regex.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-25T02:13:59Z\u0022 title=\u002203/25/2015 02:13  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 25, 2015\u003C/time\u003E by Aviator17\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2015-03-25T01:23:35Z","Content":"\n\u003Cp\u003EOK, this is beginning to get game breaking. I can\u0027t undock my lunar module \u003Cem\u003Eagain\u003C/em\u003E after returning it to the command module. Now, no matter how I edit the save file, my craft just explodes a few seconds after loading \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EDoes docking work OK in RO for anyone? Sorry, but I cannot believe that this is not related to RO. I had NO undocking bugs for the whole last six months of playing stock KSP, and now, my only two dockings/undockings in RO have both resulted in major bugs. I guess I will have to delete the entire lunar module from the save file in order to proceed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit- yea, deleting the lunar module saved the mission. Good thing I was able to edit the save file and undock without deleting the lunar module on the way \u003Cem\u003Edown\u003C/em\u003E. It\u0027s really gonna suck if all my undockings in RO have to be done via Notepad\u002B\u002B.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-25T01:31:11Z\u0022 title=\u002203/25/2015 01:31  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 25, 2015\u003C/time\u003E by |Velocity|\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-03-25T01:43:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022|Velocity|\u0022 data-cite=\u0022|Velocity|\u0022\u003E\u003Cdiv\u003EDoes docking work OK in RO for anyone?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, I noticed that you haven\u0027t really provided any information to this thread other than \u0022it doesn\u0027t work\u0022, which isn\u0027t helpful in the slightest. What docking parts are you using? Have you modified them? Do you have a log file from the time where it failed? Do you have a picture of the craft before and after? What OS and version of KSP are you using? Etc...\u003C/p\u003E\u003Cp\u003EPlease submit a support request in the appropriate forum following the guidelines posted \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-03-25T03:49:51Z","Content":"\n\u003Cp\u003EKitspace: Yes, I agree the engine did not change. The LR-91 provides roll control by gimbaling its turbopump exhaust nozzle, as I mentioned. Because that roll control was sufficient, (evidently) in practice verniers proved unecessary. The X-405 is the main engine used by Vanguard, and modeled in SXT.\u003C/p\u003E\u003Cp\u003EIf the RCS issue is purely visual, my understanding is that may be an issue with the model, not code.\u003C/p\u003E\u003Cp\u003EA_Burnt_Rodent: That perigee sounds too \u003Cem\u003Ehigh\u003C/em\u003E actually. Basically, if your initial perigee is too high, you will enter at a very shallow angle indeed and then bleed off speed, rapidly increasing your entry angle and increasing vertical velocity. Instead, try a perigee of around 60km if your apogee is 1-200km.\u003C/p\u003E\u003Cp\u003EOksbad: Unity does not support textures of higher resolution than 8192x8192. RVE (the visual enhancements mod for RSS) uses EVE Overhaul to apply detail textures to improve the look, however. That\u0027s about it for options. For contracts, RO does not support career mode at all, for that you need the submod for RO called RP-0.\u003C/p\u003E\u003Cp\u003Esisyphean: you need to launch when your launch site is in the same plane as the moon. Use KER or MJ to show the relative inclination between you and the Moon, and launch when it\u0027s \u0026lt; 1.0 degrees.\u003C/p\u003E\u003Cp\u003Eajones209: Because the FASA version of the LR-105 includes a sizable portion of Atlas tank with it (the \u0022tankbutt\u0022 that addon authors annoyingly add to their engines).\u003C/p\u003E\u003Cp\u003EAviator17: The thermal (visual) effects aren\u0027t necessarily tied to heating, they\u0027re just eyecandy. Unless parts start exploding, don\u0027t worry. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E|Velocity|: KJR release version has a docking bug. Get the development version from git (read the last few pages of the KJR thread for context).\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2015-03-25T06:30:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aviator17\u0022 data-cite=\u0022Aviator17\u0022\u003E\u003Cdiv\u003EI understand that not all rocket engines have the ability to throttle. I am speaking exclusively about the SSME\u0027s of the CSS. The speeds do not seem excessive from my knowledge of shuttle launches (max q at approx. 6km and 350m/s, however, when the shuttle reaches about 1,000 m/s (roughly 2,000 mph) it begins to \u0022burn up\u0022. The orange glow can be seen around the craft, which is definitely something that does not occur during a shuttle launch. Should I try limiting the acceleration to 3g instead of using limit to terminal velocity? Also, what could be causing the aerodynamic heating if the speeds are appropriate for real life?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEDIT: The TWR is off by .2 at launch. The value should be approximately 1.5, but is 1.7 at launch. I am not sure what the rate of change is on this as the shuttle climbs, but the launch values are definitely off. I will just have to wait until CSS is fully compatible. Thanks for trying to help, regex.\u003C/p\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2015-03-25T17:09:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ESo, I noticed that you haven\u0027t really provided any information to this thread other than \u0022it doesn\u0027t work\u0022, which isn\u0027t helpful in the slightest. What docking parts are you using? Have you modified them? Do you have a log file from the time where it failed? Do you have a picture of the craft before and after? What OS and version of KSP are you using? Etc...\u003Cp\u003EPlease submit a support request in the appropriate forum following the guidelines posted \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229-How-To-Get-Support-%28READ-FIRST%29\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, I didn\u0027t realize there was a support forum for modded installs, or that there was some kind of log file. And I did, in fact, provide significantly more information than just \u0022it doesn\u0027t work\u0022. See my earlier post. Additionally, it wastes a lot of my time to go through some extensive bug reporting process if the bug is already known. Which I why I asked first.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E|Velocity|: KJR release version has a docking bug. Get the development version from git (read the last few pages of the KJR thread for context).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! I\u0027ll try it out.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ELicenses complicate the issue you\u0027re trying to solve; you simply cannot reconcile GNU GPL vs. CC-SA. Furthermore, including GPL items into a BSD licensed codebase necessitates the change from BSD to GPL for the entire project (for instance). The fact is that people make parts not only for RO players but also for stock players, increasing their visibility (most mods are made for stock players to begin with). Then you have the issue of differing systems and who can run what, and how many mods. RO has a bug tracker and ongoing discussions on Github already; we\u0027re already well coordinated. The sad fact of the matter is that the entire situation is much more complicated than simply getting a few people into a room and having them make mods for you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, I didn\u0027t realize it was already so organized. That\u0027s great news!\u003C/p\u003E\n"},{"CreatedByName":"A_Burnt_Rodent","CreatedById":123884,"CreatedDateTime":"2015-03-26T07:56:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EA_Burnt_Rodent: That perigee sounds too \u003Cem\u003Ehigh\u003C/em\u003E actually. Basically, if your initial perigee is too high, you will enter at a very shallow angle indeed and then bleed off speed, rapidly increasing your entry angle and increasing vertical velocity. Instead, try a perigee of around 60km if your apogee is 1-200km.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell that seemed counter-intuitive to me, but clearly that\u0027s because I know Sweet F.A about how real space craft work. Thanks for your help.\u003C/p\u003E\n"},{"CreatedByName":"snipemanmike","CreatedById":84632,"CreatedDateTime":"2015-03-26T09:49:32Z","Content":"\n\u003Cp\u003EWhy am I missing the J58 engine. The sr71 one. I have every other one, including the british old ones, J57 and J85 but no J58? Please help!\u003C/p\u003E\n"},{"CreatedByName":"frisch","CreatedById":71659,"CreatedDateTime":"2015-03-27T02:23:47Z","Content":"\n\u003Cp\u003EI don\u0027t know if this is a RO issue or a Laz Tek issue. The super-draco engines seem to have much higher ISP in the game than I find listed in various online sources. Considering the high thrust to nozzle size ratio I would not expect these to be high Isp in vacuum\u003C/p\u003E\u003Cp\u003EThey do make landers easy - too easy .\u003C/p\u003E\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-03-27T23:33:57Z","Content":"\n\u003Cp\u003EI I\u0027m using FASA along with RO and I\u0027m finally to a point where I\u0027m ready to try and do Saturn V/Apollo launch. But I\u0027m having a little difficulty figuring out what all parts are supposed to be used. Is there a build list or something? Also, as far as I can tell there isn\u0027t a heat shield built into the Apollo Command Module but I also can\u0027t seem to find a \u0022generic\u0022 shield that works. They all seem to attach \u0022inside\u0022 the CM.\u003C/p\u003E\n"},{"CreatedByName":"sp1989","CreatedById":105359,"CreatedDateTime":"2015-03-27T23:46:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chrisl\u0022 data-cite=\u0022chrisl\u0022\u003E\u003Cdiv\u003EI I\u0027m using FASA along with RO and I\u0027m finally to a point where I\u0027m ready to try and do Saturn V/Apollo launch. But I\u0027m having a little difficulty figuring out what all parts are supposed to be used. Is there a build list or something? Also, as far as I can tell there isn\u0027t a heat shield built into the Apollo Command Module but I also can\u0027t seem to find a \u0022generic\u0022 shield that works. They all seem to attach \u0022inside\u0022 the CM.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAm I the only one that doesn\u0027t have any engine effects with the FASA engines?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sp1989\u0022 data-cite=\u0022sp1989\u0022\u003E\u003Cdiv\u003EAm I the only one that doesn\u0027t have any engine effects with the FASA engines?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEdit: totally overlooked the smokescreen dependency\u003C/p\u003E\n"},{"CreatedByName":"stratochief66","CreatedById":59541,"CreatedDateTime":"2015-03-28T02:20:42Z","Content":"\n\u003Cp\u003Ethat can be an issue, chrisl. there is one specifically for the Apollo that is in an unusual place (read: not with the other heatshields) that specifics it is for the Apollo. I will be posting some of my RO craft files this weekend, which should useful for those having trouble assembling them.\u003C/p\u003E\u003Cp\u003EI did a little digging, it is under \u0027Utility\u0027\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-28T02:43:01Z\u0022 title=\u002203/28/2015 02:43  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 28, 2015\u003C/time\u003E by stratochief66\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stratochief66","CreatedById":59541,"CreatedDateTime":"2015-03-29T05:01:50Z","Content":"\n\u003Cp\u003ECraft File incoming!\u003C/p\u003E\u003Cp\u003EThe FASA Saturn 5 with LEM installed.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://emailattachment.net/get/152640/8214e9d722bc30526a4e17ed3281fbb9\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://emailattachment.net/get/152640/8214e9d722bc30526a4e17ed3281fbb9\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd a video showing my own method for construction. Any omni-decoupling device under the LEM should do.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/-mlOiX5KP8M?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-29T16:09:55Z\u0022 title=\u002203/29/2015 04:09  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 29, 2015\u003C/time\u003E by stratochief66\u003C/strong\u003E\n\u003Cbr\u003EAddition of video\n\u003C/span\u003E\n"},{"CreatedByName":"Coga19000","CreatedById":125394,"CreatedDateTime":"2015-03-29T11:35:18Z","Content":"\n\u003Cp\u003EI like the mod itself a lot, but the engines are kinda lazily-made. Any realistic engines mods you advice?\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-03-29T11:56:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Coga19000\u0022 data-cite=\u0022Coga19000\u0022\u003E\u003Cdiv\u003EI like the mod itself a lot, but the engines are kinda lazily-made. Any realistic engines mods you advice?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe stock engines? Yes there just rescalled and configured to be the size and perform like real engines. But... My god man how can you miss the gigantic list of recommended mods in the OP? The Soviet engines for starters are really nice. You can also get Vens stock part revamp to pretty up the stock, rescalled parts. ( not in the op ).\u003C/p\u003E\u003Cp\u003E______________________________________\u003C/p\u003E\u003Cp\u003EQuestion. Now I don\u0027t think this warrants its own thread and it is realism related so... Is it at all possible to get rid of the fish eye lense effect ksp has? I can\u0027t stand my planets turning into eggs at the edge of my screen.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-29T11:59:59Z\u0022 title=\u002203/29/2015 11:59  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 29, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Coga19000","CreatedById":125394,"CreatedDateTime":"2015-03-29T12:06:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EThe stock engines? Yes there just rescalled and configured to be the size and perform like real engines. But... My god man how can you miss the gigantic list of recommended mods in the OP? The Soviet engines for starters are really nice. You can also get Vens stock part revamp to pretty up the stock, rescalled parts. ( not in the op ).\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeahh, I knew I should have clarified a bit more. My bad.\u003C/p\u003E\u003Cp\u003ESee, I have seen the Reccomended Mods list. However, I would actually want real-life engines, with eal Isp and thrust -and I\u0027m not sure how this works out with KW Rocketry, though I love it.\u003C/p\u003E\u003Cp\u003ENo, the Soviet ENgines Pack looks nice, but the engines are, well, Soviet. Unless the included engines are still used, I would prefer a bit more modern technology.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-03-29T12:16:25Z","Content":"\n\u003Cp\u003EAll engines in RO are configured to the exact statistics of real engines. ( isp/thrust/weight )real life engines. And the Soviet engines are more or less still used on rockets today.\u003C/p\u003E\n"},{"CreatedByName":"Coga19000","CreatedById":125394,"CreatedDateTime":"2015-03-29T12:17:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EAll engines in RO are configured to the exact statistics of real engines. ( isp/thrust/weight )real life engines. And the Soviet engines are more or less still used on rockets today.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeaaaaah, but the whole point is that I would prefer not to use THEM. And if they\u0027re still used, then I\u0027ll for sure use \u0027em.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-03-29T15:13:23Z","Content":"\n\u003Cp\u003ECoga I do appologise for my shortness earlier for what it counts. Now I\u0027d continue to help you out, but apparently I may or may not be stalking you. I\u0027m not sure I haven\u0027t figured it out yet. But I\u0027ll take a chance. \u003C/p\u003E\u003Cp\u003EMost part mods that RO uses and reconfigures contain engines that are indeed still in active use, engines that aren\u0027t and my favorite... Concept engines that never flew. \u003C/p\u003E\u003Cp\u003EFor instance FASA has the F1 engines that aren\u0027t in use anymore and the RL-10 which are in use.The Soviet pack has the RD180 which is still in use ( though it may be called RD170 in the soviet pack I forget ) Then there\u0027s the NK-33 upon which again I can\u0027t recal if the soviet pack has that or not. I know you can get the modern AJ36 version from the AerojetKerbodyne mod. ( The ones that just exploded the Antares months ago Iirc ) \u003C/p\u003E\u003Cp\u003EI imagine you could pluck the space shuttle main engines out of the component space shuttle mod as well. There not in active use, but they will be soon. Anything beyond that, well it\u0027s actually a good bit of work to go through each mod and say exactly what engines and variants of those engines are still in use. I recommend installing a mod pack. Then go through and see what engines you like and dont like. Simply remove the ones you don\u0027t want.\u003C/p\u003E\u003Cp\u003ENow someone please correct me if I\u0027m wrong, but most rockets today use soviet engines or variants of them.\u003C/p\u003E\n"}]}