{"TopicId":90151,"ForumId":34,"TopicTitle":"[1.1.2] Realism Overhaul v11.0.0 May 8","CreatedByName":"Felger","CreatedById":76828,"CreatedDateTime":"2014-11-13T00:02:09Z","PageNum":16,"Articles":[{"CreatedByName":"Briefmoment","CreatedById":48182,"CreatedDateTime":"2014-12-06T15:19:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ANWRocketMan\u0022 data-cite=\u0022ANWRocketMan\u0022\u003E\u003Cdiv\u003EUsually as a result of too high TWR at launch which leads to having to do a much more rapid gravity turn in order to be able to launch to a low enough orbit. Real rockets however sometimes do have such high TWR launches and lower ascent profiles. As far as I know, it\u0027s not even possible to do the Saturn V launches of the Apollo program properly without burning it up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suppose that is why DRE is not required as of now. I have launched before with 1.73 TWR rocket, and haven\u0027t neared burning up, or even going in a too high of an orbit? Either way, I will gladly embrace Realheat if they can get the Procedural Heat shields working properly! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Miximix","CreatedById":31835,"CreatedDateTime":"2014-12-06T17:33:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Briefmoment\u0022 data-cite=\u0022Briefmoment\u0022\u003E\u003Cdiv\u003EI suppose that is why DRE is not required as of now. I have launched before with 1.73 TWR rocket, and haven\u0027t neared burning up, or even going in a too high of an orbit? Either way, I will gladly embrace Realheat if they can get the Procedural Heat shields working properly! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETWR for my rocket is about 1.25 at sea level and it starts to burn up at about 13-15 km with 45 deg if pitch and 1000 m/s. (It worked fine for me several month ago, that;s why i\u0027m asking \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2014-12-06T17:58:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Miximix\u0022 data-cite=\u0022Miximix\u0022\u003E\u003Cdiv\u003ETWR for my rocket is about 1.25 at sea level and it starts to burn up at about 13-15 km with 45 deg if pitch and 1000 m/s. (It worked fine for me several month ago, that;s why i\u0027m asking \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are going too fast too low. Try to be above 20km and below 30km by the time you\u0027re travelling 1km/s.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-12-06T18:04:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ANWRocketMan\u0022 data-cite=\u0022ANWRocketMan\u0022\u003E\u003Cdiv\u003EUsually as a result of too high TWR at launch which leads to having to do a much more rapid gravity turn in order to be able to launch to a low enough orbit. Real rockets however sometimes do have such high TWR launches and lower ascent profiles. As far as I know, it\u0027s not even possible to do the Saturn V launches of the Apollo program properly without burning it up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Briefmoment\u0022 data-cite=\u0022Briefmoment\u0022\u003E\u003Cdiv\u003EI suppose that is why DRE is not required as of now. I have launched before with 1.73 TWR rocket, and haven\u0027t neared burning up, or even going in a too high of an orbit? Either way, I will gladly embrace Realheat if they can get the Procedural Heat shields working properly! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately there seems to be a fine balance between\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ENot burning up on ascent\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHaving \u003Cem\u003EDeadly\u003C/em\u003E Reentries.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMaybe I\u0027m wrong about this but I think the current issues with ascents stemmed from trying to make descent more deadly since people complained it wasn\u0027t hard enough. (then again they complain that it\u0027s too hard so I guess you really can\u0027t please everyone)\u003C/p\u003E\u003Cp\u003EI\u0027ve tried to tweak things a little in the beta so that ascent\u0027s aren\u0027t so hard but feedback is a little sporadic. I mean, I know that there\u0027s an issue with ascents but I don\u0027t experience it myself. I think it mostly affects you RO guys and I don\u0027t use RO myself. Not even the RO heat shields since as of the beta they are no longer a requirement for Real Solar System. \u003C/p\u003E\u003Cp\u003EIt would help if feedback on the subject happened in the DRE thread instead of just here which I only monitor sporadically. Unless the consensus is \u0027wait for RealHeat\u0027 in which case I can just worry about whether or not DRE works ok in Stock KSP, which it does. But I\u0027m open to feedback because I\u0027d like things to work for everyone, at least as much as is possible.\u003C/p\u003E\n"},{"CreatedByName":"darshiki","CreatedById":104828,"CreatedDateTime":"2014-12-06T18:45:36Z","Content":"\n\u003Cp\u003EHey I am having an issue and I can\u0027t seem to find mention of it elsewhere on the last few pages or in the FAQ. I installed RO using ckan via the command line, adding KW, RLA stock, soviet, Rocketdyne, Near Future and I put AIES and KER in manually. Took out a lot of the fuel tank and aerodynamic part files but other than that it\u0027s the same as ckan made it. I have made sure that everything is up to date with the update and list commands in ckan. I am using the default engine configs (not RFTS). The problem is some of my engines (specifically the Aerojet AJ10-118K, EADS Astrium Vulcain, and Rocketdyne RS-68A) are working fine when first launched but when they are reloaded, by going to the space center and then back to the rocket or loading it in space, the delta V is much lower and in a few cases the weight of the craft is much much higher. I don\u0027t know if they are the only engines doing this but I have different engines on my heavier rocket and I can reload them without change. I post this without a log or craft files because I am just asking to see if anyone else is aware or is having this problem. I will also say that I had to install KER to get the delta V to show correctly (in mech jeb) for the engines I was using so maybe this has something to do with the issue. I am going to try a few more things that come to mind. If the problem ends up being unknown I will go though the process of doing an error report. Thanks for any feedback given. Dars\u003C/p\u003E\u003Cp\u003EEdit: seemed to have found the problem, I used a scaled up decoupler from the DRE pack which changed it\u0027s weight after reloading.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-06T19:25:35Z\u0022 title=\u002212/06/2014 07:25  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 6, 2014\u003C/time\u003E by darshiki\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Adent","CreatedById":92980,"CreatedDateTime":"2014-12-06T19:50:48Z","Content":"\n\u003Cp\u003EHello, I am having a problem when undocking. When undocking one of the craft, either the station or ship for example, will start accelerating away from the other. If I switch to the error craft it displays the G-Limit warning and starts tearing itself apart. Looking at the map during this shows the orbit \u0022shifting\u0022 its center. Orbit stays circular but apogee raises as perigee decreases. I tried many installs, re-installs, new saves and have used both CKAN and the ole manual way. It always happens regardless of ship/ship, ship/station, ect... \u003C/p\u003E\u003Cp\u003EI use all the required and recommended mods plus KW engines and Laztec explore pack. For the manual installs connected living and orbital manip. were left out.\u003C/p\u003E\u003Cp\u003ESeems I am also having problems with decouplers not decoupling. All this seems to take effect after a save/load or exiting to spaceport and then back.\u003C/p\u003E\u003Cp\u003EI think the root of the problem is the game is not naming on of the disconnected crafts. I get a debris with no name at spaceport.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-07T01:42:27Z\u0022 title=\u002212/07/2014 01:42  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 7, 2014\u003C/time\u003E by Adent\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2014-12-06T19:56:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Briefmoment\u0022 data-cite=\u0022Briefmoment\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETransfer Window Planner: \u003Ca href=\u0022http://www.curse.com/ksp-mods/kerbal/224116-transfer-window-planner\u0022 rel=\u0022external nofollow\u0022\u003EHERE\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETrajectories: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/93685-0-24-0-25-Trajectories-v1-0-0-%282014-11-17%29-atmospheric-predictions-FAR-NEAR\u0022 rel=\u0022external nofollow\u0022\u003EHERE\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tried using Trajectories in RSS/RO initially but found that the velocity loss estimations were greatly under calculated. As in my actual landing point would be far shorter than shown, and more often than not an aerobraking maneuver would inadvertently turn into an aerocapture instead.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-12-06T20:09:28Z","Content":"\n\u003Cp\u003EThat is exactly what the mod author is talking about saying it is not compatible and that is what actually made me wonder about finding a solar system compatible tool.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-12-06T20:19:13Z","Content":"\n\u003Cp\u003ERocketMan and Hattivat what do you think of my latest post with the questions two pages ago?\u003C/p\u003E\u003Cp\u003EYour explanations are very helpfull and informative.\u003C/p\u003E\u003Cp\u003EThank you for all your kind responces!\u003C/p\u003E\n"},{"CreatedByName":"Briefmoment","CreatedById":48182,"CreatedDateTime":"2014-12-06T20:50:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yaivenov\u0022 data-cite=\u0022Yaivenov\u0022\u003E\u003Cdiv\u003EI tried using Trajectories in RSS/RO initially but found that the velocity loss estimations were greatly under calculated. As in my actual landing point would be far shorter than shown, and more often than not an aerobraking maneuver would inadvertently turn into an aerocapture instead.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESadly there is no exact tool for what you want :/ But that is the best so far and seems to work fine. The main reason that it is under calculated, is because it is supposed to work for stock KSP. not a scaled up, real solar system! xD Hopefully someday something can replace that! .-.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-12-06T21:29:29Z","Content":"\n\u003Cp\u003EBeduino: All parts that are not \u0022100% certified\u0022 for RO will have that tag. However, in many cases there is an RO config, it\u0027s just not entirely up to date or correct.\u003C/p\u003E\u003Cp\u003EKitspace:\u003C/p\u003E\u003Cp\u003ERoll control is usually achieved by one of five methods:\u003C/p\u003E\u003Cp\u003E1. Control fins (Redstone / Jupiter-C / Juno I did this).\u003C/p\u003E\u003Cp\u003E2. Multiple gimbaling engines (Titan did this).\u003C/p\u003E\u003Cp\u003E3. Gimbaled turbopump exhaust (Delta IV does this).\u003C/p\u003E\u003Cp\u003E4. Verniers (Atlas had these for when there\u0027s only the sustainer).\u003C/p\u003E\u003Cp\u003E5. Attitude thrusters (most upper stages do this, like Centaur or S-IVB).\u003C/p\u003E\u003Cp\u003EMethod 3 is unavailable to us right now, but all other methods work just fine in KSP.\u003C/p\u003E\u003Cp\u003ERegarding TWR, this sounds like either your stages are too large (use more stages) or that the dry mass of your stages is being underestimated. There\u0027s also the issue that RF doesn\u0027t simulate propellant residuals (usually about 0.5% of the propellants on a lower stage are left unburnt, and ~1% for uppers), which also adds to stage burnout mass and thus lowers TWR.\u003C/p\u003E\u003Cp\u003EAnother thing you can do is to use verniers, and cut out the main engine when you have only a few m/s of propellant left. Then you complete the burn on (low-G) vernier thrust alone. This is also very necessary for precise apogee adjustment (and, indeed, how early LVs managed precise apogees).\u003C/p\u003E\u003Cp\u003ERegarding different payloads, while CoM being kept centered is important, height-wise it\u0027s less so. Also, the solution to delta V shifting when payload mass differs was to under-load propellants to still have the desired deltaV from the stage.\u003C/p\u003E\u003Cp\u003E=======\u003C/p\u003E\u003Cp\u003EStarwaster, I think at this point probably the best answer is to just have a lower multiplier on RSS, and wait for RealHeat. I don\u0027t think DRE *can* be tuned to offer a deadly descent and a peaceful ascent on RSS, the math just won\u0027t easily allow it (due to how unrealistic DRE\u0027s [and KSP\u0027s] assumptions are).\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-12-06T21:46:33Z","Content":"\n\u003Cp\u003ECurrently with my game installation that already contains quite a lot of the supported engine part packs there are only two or three variants of the vernier thrusters. Obviously there are just two much restrictions on the thrust levels and the usable fuel mixtures.\u003C/p\u003E\u003Cp\u003EHow can I actually get around this problem?\u003C/p\u003E\u003Cp\u003EWhat is a common proper stage size for example in the matter of its delivered delta v?\u003C/p\u003E\u003Cp\u003EWhat exactly do you mean when saying that the stage dry weight is being underestimated? Is it compared to real life or to what would actually happen in flight in the game?\u003C/p\u003E\u003Cp\u003EIf the center of mass significantly moves vertically does not that affect the torque forces on the rocket greatly? If you both have a lighter payload and underload the propellants how do you deal with the thrust to weight ratio?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-06T22:02:18Z\u0022 title=\u002212/06/2014 10:02  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 6, 2014\u003C/time\u003E by Kitspace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hattivat","CreatedById":110255,"CreatedDateTime":"2014-12-06T22:54:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kitspace\u0022 data-cite=\u0022Kitspace\u0022\u003E\u003Cdiv\u003ERocketMan and Hattivat what do you think of my latest post with the questions two pages ago?\u003Cp\u003EYour explanations are very helpfull and informative.\u003C/p\u003E\u003Cp\u003EThank you for all your kind responces!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnswered your private message, combined with NathanKell\u0027s excellent explanation it should give you a good picture of how it\u0027s done.\u003C/p\u003E\u003Cp\u003EProper stage size to me would be about 4000-4500 m/s of delta-v for a first stage, certainly not more than 5k if I can avoid it.\u003C/p\u003E\n"},{"CreatedByName":"Bender222","CreatedById":128554,"CreatedDateTime":"2014-12-06T23:09:13Z","Content":"\n\u003Cp\u003ETrying my hand at rebiulding fasa .crafts and suddenly the game stops responding to camera controls. Both in the editor and in the space center. It hapened once when I was trying career too. any ideas?\u003C/p\u003E\n"},{"CreatedByName":"Bender222","CreatedById":128554,"CreatedDateTime":"2014-12-07T01:34:23Z","Content":"\n\u003Cp\u003ETo add to the conversation on DRE and ascent profiles I have found that I have to slowly gravity turn so that i hit 30 or so kms in altitude right at 45 degrees or I burn up.I am still not 100% sure on what to do next. Do I work my way towards 0 degrees as fast as I can yet stay within 5 degrees of prograde? I\u0027m not sure as when I do that my apo seems to be really high and I do not have enough fuel to raise the periapsis above 0 yet alone circularize.\u003C/p\u003E\n"},{"CreatedByName":"plasmeus","CreatedById":112078,"CreatedDateTime":"2014-12-07T01:45:16Z","Content":"\n\u003Cp\u003EI posted the FASA pod reentry issue on github, hopefully it will be fixed before the next update.\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2014-12-07T04:31:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kitspace\u0022 data-cite=\u0022Kitspace\u0022\u003E\u003Cdiv\u003ECurrently with my game installation that already contains quite a lot of the supported engine part packs there are only two or three variants of the vernier thrusters. Obviously there are just two much restrictions on the thrust levels and the usable fuel mixtures.\u003Cp\u003EHow can I actually get around this problem?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith the really big engines, like the F-1A, I actually use a medium sized engine of the same fuel type for the vernier, such as the H-1 for the F-1A, and the RJ-10 with the J-2S.\u003C/p\u003E\u003Cp\u003EP.S.: Gib J-2X plox. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2014-12-07T08:45:35Z","Content":"\n\u003Cp\u003EJust take careful note when using LFE engines as verniers, you\u0027re going to have to make sure the burn times of the verniers atch up with that of your main engine. This will require a fair amount of extra work to get just right, especially if they have different fuel ratios. An easy way would be to place down two tanks. One filled with the ratio for verniers and the other for the main engine. Resize the tanks until you get them matched up. Then add the respective amounts of fuel into the tank on the proper rocket.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-12-07T14:29:58Z","Content":"\n\u003Cp\u003EI am experiencing the editor crash issues again.\u003C/p\u003E\u003Cp\u003EIt usually happens suddenly after some time is spent in the editor most likely with a mouse click on anything around no matter whether editor was actively used or just left open during that waiting time. The time to wait for that to happen is somewhat random but it seems that it will not crash until anything is actively done by the user in the window.\u003C/p\u003E\u003Cp\u003EWhen the crash happens it is absolutely instant without any prior warning and looks like the game window just disappears with no sign that it was running a second ago.\u003C/p\u003E\u003Cp\u003EThis time I was able to get the logs.\u003C/p\u003E\u003Cp\u003EHere are the logs for the first kind of crash.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.filedropper.com/logs_4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/logs_4\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOnce it crashed in a different way. I entered the editor screen and the whole interface was screwed up with some elements misplaced and some missing. After clicking where the exit button would normally be the game froze for some time and then crashed.\u003C/p\u003E\u003Cp\u003EHere is the log for the second kind of crash.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.filedropper.com/log_1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/log_1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHelp please!\u003C/p\u003E\u003Cp\u003EHow to fix it as it spoils most of my rockets in the middle of the design process and the restart time is quite long in addition to that.\u003C/p\u003E\u003Cp\u003EIt is very annoying and practically prevents me from playing seriously.\u003C/p\u003E\u003Cp\u003EI very much hope it is solvable.\u003C/p\u003E\u003Cp\u003EThank you!\u003C/p\u003E\n"},{"CreatedByName":"Bender222","CreatedById":128554,"CreatedDateTime":"2014-12-07T15:49:53Z","Content":"\n\u003Cp\u003Eit seems that procedural parts are sometimes randomly stopping being able to be tweaked.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-12-07T16:10:30Z","Content":"\n\u003Cp\u003EWhy is that happening and how to fix it?\u003C/p\u003E\u003Cp\u003EIs it able to crash the whole game?\u003C/p\u003E\u003Cp\u003EWhat do the lines about a device being lost mean?\u003C/p\u003E\u003Cp\u003EAll these crashes do actually happen even when no procedural parts are in use at all.\u003C/p\u003E\u003Cp\u003EAlso I have noticed that somewhat about every second time the game is started a couple of random parts both in the editor and on the existing crafts load without any textures. They are just all plain white.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-12-07T16:35:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kitspace\u0022 data-cite=\u0022Kitspace\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhat do the lines about a device being lost mean?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou alt-tabbed away from the game. It can\u0027t render the screen if it was in fullscreen mode and you alt-tabbed away so it reports an error about it. It doesn\u0027t hurt anything. (I alt-Enter to switch out of fullscreen mode if I need to tab out)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso I have noticed that somewhat about every second time the game is started a couple of random parts both in the editor and on the existing crafts load without any textures. They are just all plain white.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome tga textures do that randomly.\u003C/p\u003E\n"},{"CreatedByName":"Bender222","CreatedById":128554,"CreatedDateTime":"2014-12-07T17:15:54Z","Content":"\n\u003Cp\u003Eon the first page there is a shortcut starting parameter that makes the game fullscreen without it being \u0022fullscreen\u0022. You can alt tab during startup aswell.\u003C/p\u003E\n"},{"CreatedByName":"Kitspace","CreatedById":109786,"CreatedDateTime":"2014-12-07T17:33:58Z","Content":"\n\u003Cp\u003EThank you for the screen render explanation.\u003C/p\u003E\u003Cp\u003EBut how to fix everything else?\u003C/p\u003E\u003Cp\u003ERegarding the textures I did not ever see this before. This is absolutely the first time it happens. It is quite annoying and it would be nice to understand what is happening and fix it.\u003C/p\u003E\u003Cp\u003EAnd regarding the crashes there has to be something wrong with it as it crashes really very very often.\u003C/p\u003E\u003Cp\u003EAlso it crashes every single time it goes from flight to editor and randomly crashes when going the other way round.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-12-07T18:33:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Felger\u0022 data-cite=\u0022Felger\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIf you\u0027re having RAM issues (game crashes unexpectedly, etc) there\u0027s a few things you can do:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EUse Procedural Parts for fuel tanks, and remove fuel tanks from your part packs.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EUse Procedural Fairings for fairings, and remove fairings from your part packs.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EUse Procedural Wings for wings, and remove wings from your part packs.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIs there a list of folders and/ or parts that are ok to remove? I have tried things like this in the past and have always wondered what ones are good to remove and which ones not, with this many mods it can get complex.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI am using KSP-win32. ( I wanted to use KSP win 64 but I did not want to take the time to remove all the win64 blocks and I would have had to install manually which with this is rather difficult, and does not always go right.)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI am most definitely hitting the max memory even with aggressive active texture management installed and forced OpenGL. I also turned off all non essential process in windows. The only optimizations I have not done are the part removal (which I am ok with doing if I can do so without removing, essential/ works best with, parts. The other optimization I did not do is turn off full screen which I am not willing to give up. Not running in full screen mode gives up too much quality for me.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAny help on this would be greatly appreciated.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}