{"TopicId":90205,"ForumId":39,"TopicTitle":"Project Arctic Film- Be Part Of Something Great","CreatedByName":"Vagani","CreatedById":112067,"CreatedDateTime":"2014-11-13T19:54:20Z","PageNum":17,"Articles":[{"CreatedByName":"Candlelight","CreatedById":203979,"CreatedDateTime":"2015-07-09T14:19:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vagani\u0022 data-cite=\u0022Vagani\u0022\u003E\u003Cdiv\u003Eaccepted, as usual i can\u0027t update the main post at this time because safari breaks it, so yes welcome XD\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo offensively offensive offense, but y u no use PC?\u003C/p\u003E\n"},{"CreatedByName":"Aquaman1125","CreatedById":131307,"CreatedDateTime":"2015-07-15T20:33:38Z","Content":"\n\u003Cp\u003EWell I\u0027m glad we are up and running again, I\u0027ll keep a close eye on this and when time comes you need a video editor ill be here\u003C/p\u003E\u003Cp\u003EEdit: Should i update the website or wait for the crew to finish sifting thru?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T20:36:04Z\u0022 title=\u002207/15/2015 08:36  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by Aquaman1125\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cwheels32","CreatedById":107219,"CreatedDateTime":"2015-07-16T11:50:11Z","Content":"\n\u003Cp\u003EWhat we need to get done is the script. We have a good start but we cannot do anything else without it being finished. We need at least 4 dedicated people to get it done. Any volunteers, I can help but i cant do it on my own.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-07-16T12:43:56Z","Content":"\n\u003Cp\u003EI\u0027m still bumbling around with craft ideas, but I\u0027ve been lazy since school got out (and the project had kind of died again at that point) and haven\u0027t taken the crafts I displayed on the google forum off the desktop and transferred them to my laptop to send them.\u003C/p\u003E\n"},{"CreatedByName":"Vagani","CreatedById":112067,"CreatedDateTime":"2015-07-17T17:21:22Z","Content":"\n\u003Cp\u003EYes, i think it may be time to close the project until further notice, the only thing that could help us would be dedicated script writers but unfortunately we don\u0027t have enough. I\u0027ll post further notices soon\u003C/p\u003E\n"},{"CreatedByName":"MoeKitsune","CreatedById":127670,"CreatedDateTime":"2015-07-17T21:42:35Z","Content":"\n\u003Cp\u003EI would help with the script, but I\u0027m not the best at writing. But I do have a bunch of free time usually.\u003C/p\u003E\n"},{"CreatedByName":"Fred Cop","CreatedById":146298,"CreatedDateTime":"2015-07-18T07:07:10Z","Content":"\n\u003Cp\u003EI could do a bit of script writing, I just need A. to know how far the script has gotten (in regards to the story summary) and B. a bit more in-depth information regarding the film\u0027s plot.\u003C/p\u003E\u003Cp\u003EI can\u0027t say I\u0027ll be dedicated, but I might be able to at least continue it for a bit until I lose interest.\u003C/p\u003E\n"},{"CreatedByName":"Vagani","CreatedById":112067,"CreatedDateTime":"2015-07-18T19:15:35Z","Content":"\n\u003Cp\u003EYou\u0027re both accepted, mistakes can be fixed later, and all info is on the google drive doc\u003C/p\u003E\n"},{"CreatedByName":"Fred Cop","CreatedById":146298,"CreatedDateTime":"2015-07-19T08:22:38Z","Content":"\n\u003Cp\u003EI know that I joined for the script, but has anyone made the set for the first half of Act 2?\u003C/p\u003E\u003Cp\u003EI know I did;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t1cCdtD.jpg\u0022 alt=\u0022t1cCdtD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBest part? Its small, and is enough to transport to space if you want to go that far;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YHASVRE.png\u0022 alt=\u0022YHASVRE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe \u0022craft\u0022 only uses two Custom Action Groups: \u00221\u0022 which toggles the Bay Doors and \u00222\u0022 which toggles Solar Panels that\u0027ll charge the lights inside the Bay.\u003C/p\u003E\u003Cp\u003EThat second image also shows the problem with this design...\u003C/p\u003E\u003Cp\u003E...its incredibly cramped, which\u0027ll make it hard, if not impossible to move around inside, plus if you are using the default chase camera whilst moving a Kerbal around, its more than likely the camera will clip through the Bay.\u003C/p\u003E\u003Cp\u003EAgain, I did assign for the script writing, but I thought if anyone hasn\u0027t done this set yet then might as well work on this when I\u0027m not working on the script...\u003C/p\u003E\u003Cp\u003E...unless someone has, and I\u0027ve just wasted time, ah well.\u003C/p\u003E\n"},{"CreatedByName":"Aquaman1125","CreatedById":131307,"CreatedDateTime":"2015-07-24T17:30:54Z","Content":"\n\u003Cp\u003EI think I\u0027m gonna go ahead and leave this project, I have a lot of things going on and I\u0027m just an editor, so I wont be of any help till near completion of this project witch hasn\u0027t gone anywhere sense I joined. that and I don\u0027t find myself welcomed on this thread ether, so I think it would be for the better if I just left see yall.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2015-09-05T06:13:16Z","Content":"\n\u003Cp\u003EFor those of you who still have this thread subscribed to, I am creating a cinematic of my own and doing a storyboarding stream/KSP chatroom tomorrow at 11:00am PST/2:00pm EST/4:00pm UTC. If you want to join in skype with me or make suggestions to my google doc please feel free to do so. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/avera9ejoe\u0022 rel=\u0022external nofollow\u0022\u003EAvera9eJoe - Twitch\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/document/d/1-ayuSHtHbq0TCImZCra8kEeaBM8U9TUIi6xr3PFP6EY/edit\u0022 rel=\u0022external nofollow\u0022\u003EGoogle Doc\u003C/a\u003E\u003C/p\u003E\n"}]}