{"TopicId":90258,"ForumId":16,"TopicTitle":"50% default throttle setting, Breaking my stuff...","CreatedByName":"Davion","CreatedById":129129,"CreatedDateTime":"2014-11-14T10:14:12Z","PageNum":1,"Articles":[{"CreatedByName":"Davion","CreatedById":129129,"CreatedDateTime":"2014-11-14T10:14:12Z","Content":"\n\u003Cp\u003EHi All,\u003C/p\u003E\u003Cp\u003EI seem to be having a problem with this 50% throttle setting, not the usual \u0022take-off\u0022 that most threads are talking about.\u003C/p\u003E\u003Cp\u003EBut for example when i dock to a space station my main engine is set to 0% and even most cases i will deactivate it.\u003C/p\u003E\u003Cp\u003EThe problem is when i switch from controlling the station to the spacecraft \u0022 [ or ] \u0022 it automatically resets the throttle to 50% and activates the engines.\u003C/p\u003E\u003Cp\u003EAnd whilst I\u0027m docked to the space station i have spent quite some time building, it looks like the old \u0022Throw the brick in a washing machine\u0022 until it turns into a million pieces, or I\u0027ve Alt\u002BF4 the game.....\u003C/p\u003E\u003Cp\u003EAnyone else had this or found a fix? \u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003EDavion\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-11-14T11:52:48Z","Content":"\n\u003Cp\u003EIf that\u0027s happening to you in the stock game, then it\u0027s definitely a bug, and it needs to be reported as such in the bug tracker or support forum. \u003C/p\u003E\u003Cp\u003EIf you have mods (especially multiple mods) installed then it\u0027s far more likely that one of the mods has a problem (or you have a synergistic failure) and you need to figure out which one it is, and report to the mod author. \u003C/p\u003E\u003Cp\u003EI have never seen a ship, other than one on the launch pad, go to anything other than 0% when switching to it.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-14T13:09:11Z","Content":"\n\u003Cp\u003EThe \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92076\u0022 rel=\u0022external nofollow\u0022\u003EDefaultThrottle mod\u003C/a\u003E allows you to change the default throttle setting to whatever you choose on load, I would think it would help with your vessel switching.\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2014-11-14T15:23:37Z","Content":"\n\u003Cp\u003EI don\u0027t suppose you have a joystick with throttle connected? it is possible that the current throttle setting on the stick is being applied. It happens to me frequently, although it is almost always that it is accidentally set to full throttle.\u003C/p\u003E\n"}]}