{"TopicId":90250,"ForumId":16,"TopicTitle":"Best way to Constuct IVA Base on Kerbin (Physics Wise)","CreatedByName":"KyleKidd","CreatedById":126939,"CreatedDateTime":"2014-11-14T08:07:57Z","PageNum":1,"Articles":[{"CreatedByName":"KyleKidd","CreatedById":126939,"CreatedDateTime":"2014-11-14T08:07:57Z","Content":"\n\u003Cp\u003EI\u0027m building a base on Kerbin to simulate an IVA of a large space ship. I\u0027m building it so I can shoot a fun little KSP video series, where the Kerbals can walk around the inside of the ship.\u003C/p\u003E\u003Cp\u003EAnyways, I\u0027d like to bounce some ideas around as to the best way to do this.\u003C/p\u003E\u003Cp\u003EMy first idea was to actually build the entire thing in Blender, then just plop the thing down through the VAB (almost like a mod). But I have almost no experience in Blender, and I think that may be over my head.\u003C/p\u003E\u003Cp\u003ESecond would be to build it and weld all the pieces together using a mod. Which I\u0027m probably going to do some tests with tomorrow to see how it works.\u003C/p\u003E\u003Cp\u003EI\u0027m mostly worried about plumitting framrates due to part count and light sources. Frame-rates will need to stay at 30fps or above; and while I have a good gaming computer, it\u0027s more of the unity engine\u0027s limitations which are going to be the problem.\u003C/p\u003E\u003Cp\u003EAny other suggestions or input from the community?\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-11-14T08:16:58Z","Content":"\n\u003Cp\u003EYou can take a look at Bob Fitch\u0027s (named felbourn here on the forums) youtube channel for some inspiration when it comes to welded parts and performance optimization. There are lost of infos there. I can also recommend the Duna One series on youtube by Vaos, when it comes to nice scene setup without using any mods. Good luck on your mission \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-11-14T11:26:51Z","Content":"\n\u003Cp\u003EI\u0027d been thinking of doing something like this for a vid I really want to make (just never seem to have the time for!). I wasn\u0027t going to go blender or anything fancy like that, just thinking of using hollow structures fro the craft. We\u0027re basically talking about \u0022how to fake a moon landing\u0022, so what we really need for that is a set, or at least a dark box to put it in so external light doesn\u0027t shine in. So I was thinking of putting the craft inside a large box made out of those large panels from B9 and obviously filming it at night. I think that will cut out most light, but it might cause other \u0027unforeseen consequences\u0027. It may be better to hyper-edit the film set onto the far side of Mun and wait for night fall, actually on reflection the box idea is dumb, this would be better.\u003C/p\u003E\u003Cp\u003EI\u0027m interested to see what you come up with in the end.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2014-11-14T15:19:25Z","Content":"\n\u003Cp\u003EThe Hollow Structures and Hulls mod does exactly what you want. It\u0027s out of date and might take while to get updated, though. If needed, there are alternative links on page 43.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29031-0-23-5-Hollow-Structures-Hulls-(Updated-2014-04-09)\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/29031-0-23-5-Hollow-Structures-Hulls-(Updated-2014-04-09)\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-11-14T19:43:17Z","Content":"\n\u003Cp\u003EYou could, alternately, build a contraption in Unity out of primitives (cubes / boxes, cylinders, etc.) and then use PartTools to make it into a KSP Part you can launch from the VAB. Then just HyperEdit it to wherever you deem appropriate.\u003C/p\u003E\n"},{"CreatedByName":"KyleKidd","CreatedById":126939,"CreatedDateTime":"2014-11-14T20:55:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temeter\u0022 data-cite=\u0022Temeter\u0022\u003E\u003Cdiv\u003EThe Hollow Structures and Hulls mod does exactly what you want. It\u0027s out of date and might take while to get updated, though. If needed, there are alternative links on page 43.\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29031-0-23-5-Hollow-Structures-Hulls-(Updated-2014-04-09)\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/29031-0-23-5-Hollow-Structures-Hulls-(Updated-2014-04-09)\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat seems pretty neat, but I cannot get the download to work, even with the links on page 43.\u003C/p\u003E\u003Cp\u003ELooking into building parts using unity now.\u003C/p\u003E\n"},{"CreatedByName":"KyleKidd","CreatedById":126939,"CreatedDateTime":"2014-11-14T20:56:49Z","Content":"\n\u003Cp\u003EI should add that I\u0027m willing to pick up another team member who is skilled with 3D models or building with unity. Just message me. I already have about 5 voice actors waiting for me to finish scripting and building the set.\u003C/p\u003E\n"},{"CreatedByName":"moon80","CreatedById":129239,"CreatedDateTime":"2014-11-15T11:37:56Z","Content":"\n\u003Cp\u003EI will try it.\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-11-15T16:41:27Z","Content":"\n\u003Cp\u003EI made a video like this but it was so much work I don\u0027t think I will do another. It\u0027s in my signature. I made all the interiors as separate \u0022crafts\u0022 to keep the framerates somewhat reasonable.\u003C/p\u003E\n"}]}