{"TopicId":90256,"ForumId":44,"TopicTitle":"Glue and Glue-like anchoring (strictly no harpoons, move along!!)","CreatedByName":"Andersenman","CreatedById":61273,"CreatedDateTime":"2014-11-14T09:50:41Z","PageNum":1,"Articles":[{"CreatedByName":"Andersenman","CreatedById":61273,"CreatedDateTime":"2014-11-14T09:50:41Z","Content":"\n\u003Cp\u003EHello, fellow forumnauts,\u003C/p\u003E\u003Cp\u003EFrom the 67P thread:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EWhat would you suggest? Superglue?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPros:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESpecifically, Cyanoacrylate binds with water, which the comet is known to have plenty of.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGlue is somewhat agnostic to ground structure. It can stick to hard rock as well as coagulate dust into anchoring clumps.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECan engage a large contact area.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECan be combined with other anchoring technology (glue lance/harpoon/screw)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMay employ local resources both chemically (like the superglue example) and physically (eg. simple melting and freezing)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAble to create bonds without requiring a (counter-) force, initially or permanently\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ECons:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESubstances unstable over longer periods of time\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAre there glues working at these temperatures?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOut-gassing, soil contamination (at least near the anchor points)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMechanical reliability solely dependent on soil wetted by the glue and the material in immediate contact\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENot instant\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESingle-use only\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOnce set, difficult/impossible to adjust. (You can tighten a screw simply by turning it more, you can\u0027t squeeze more glue from a set nozzle)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EModern glues have long evolved from their starch and egg yolk ancestors. May I hear your educated and/or wild guesses on application of glue or glue-like technology in spaceflight, please? Specifically, for landing and anchoring, as crazy as it may sound at first, but anything that fits \u003Cem\u003E\u0027after craft or person have left the protection of both homely atmosphere and something with 1g to stand on\u0027\u003C/em\u003E I\u0027d be very interested to hear your thoughts and knowledge about.\u003C/p\u003E\u003Cp\u003EMany thanks\u003C/p\u003E\u003Cp\u003EA.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-14T21:56:16Z\u0022 title=\u002211/14/2014 09:56  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 14, 2014\u003C/time\u003E by Andersenman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-11-14T09:56:27Z","Content":"\n\u003Cp\u003EGlue is great, until your target is covered by a thin layer of dust. Then it becomes useless real quick.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-11-14T12:27:05Z","Content":"\n\u003Cp\u003EYes the dust will kill the glue.\u003C/p\u003E\u003Cp\u003EBut maybe if you have several dozen kilometers of thin strong line..........I\u0027m thinking space cowboys and comets. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Andersenman","CreatedById":61273,"CreatedDateTime":"2014-11-14T12:59:29Z","Content":"\n\u003Cp\u003EYes, I am aware of the dust issue. A simple kitchen experiment, trying to glue something to a pile of flour, should demonstrate. Flour screens liquids from penetrating deeper because when it gets wet, the starch activates and expands into a gel, creating a barrier. However, I don\u0027t (yet) have reason to expect mineral dust to behave like starch, and with a wetting agent (say, soap) any prevalent Lotus effect should be overcome, if the glue or its solvent isn\u0027t already capable enough. But feel free to educate me otherwise. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-11-14T13:00:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EYes the dust will kill the glue.\u003Cp\u003EBut maybe if you have several dozen kilometers of thin strong line..........I\u0027m thinking space cowboys and comets. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe line idea is pretty smart for smaller bodies, think a KSP class E up to some hundred meters who make them a bit large to bag, probably be smarter to do it more like a net you close on top.\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-11-14T16:55:10Z","Content":"\n\u003Cp\u003EA potential problem I see is we don\u0027t know just how strong the comet\u0027s surface is. Doesn\u0027t matter how good your glue is if the thing it\u0027s stuck to just flakes off under modest pressure. Stakes (or harpoons) work very well to tie things down to something with a weak surface, which is why we use them to secure things to loose dirt on Earth.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-11-14T16:58:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Andersenman\u0022 data-cite=\u0022Andersenman\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECons:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESubstances unstable over longer periods of time \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENot instant \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt will not work for the reasons above. You can\u0027t replace harpoons with something that is not instant and we can tell from right on that won\u0027t survive 10 years in vacuum.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-11-14T17:03:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EThe line idea is pretty smart for smaller bodies, think a KSP class E up to some hundred meters who make them a bit large to bag, probably be smarter to do it more like a net you close on top.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith a slow enough approach, a multiple set of long lines and weights could \u0022clamp\u0022 the craft to the asteroid... I\u0027d say look at biology and how it does it. They kind of have with the thruster/drill/harpoon idea. It\u0027s just the strength of each, the size of the tool (penetration into the ground was not deep enough for such a dusty landing site) etc seem to have let the poor lander down.\u003C/p\u003E\u003Cp\u003EPerhaps a harpoon/drill/rod that expands once into the ground?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-11-14T17:10:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Technical Ben\u0022 data-cite=\u0022Technical Ben\u0022\u003E\u003Cdiv\u003EPerhaps a harpoon/drill/rod that expands once into the ground?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Philea ones already do.\u003C/p\u003E\n"},{"CreatedByName":"Andersenman","CreatedById":61273,"CreatedDateTime":"2014-11-14T19:05:45Z","Content":"\n\u003Cp\u003EGuys, guys, guys, hold it.\u003C/p\u003E\u003Cp\u003EThanks for your input so far, but please keep in mind that I wasn\u0027t implying glue to be an outright replacement for anything, have already acknowledged and addressed the issue with surface dust/flakiness, and, while purely \u0022macro-\u0022 mechanical means of attachment or anchoring alternatives are interesting to hear about, wasn\u0027t planning to have the subject changed to those. In this thread I would prefer to keep it to any substance or preparation, or in-situ generation and/or utilisation thereof, with the purpose of creating a viable anchor or attachment point in space or other extra-terrestrial environment by means of changing from a liquid to a solid by undergoing phase change and/or chemical reaction, their practical application, and solutions to make these substances or means of timely preparation spaceworthy. In other words: I listed the cons to learn thoughts for solutions, not to have my thread answered with what I already know.\u003C/p\u003E\u003Cp\u003EMany thanks\u003C/p\u003E\u003Cp\u003EA.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-11-14T19:16:47Z","Content":"\n\u003Cp\u003EI expect they might use a design like this for future missions to unpredictable environments.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.wired.com/2014/02/nasas-super-ball-bot-revolutionize-robotics/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.wired.com/2014/02/nasas-super-ball-bot-revolutionize-robotics/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t think the concept existed when Philae was designed, but it appears to offer many advantages over a traditional design. The most obvious being it\u0027s easily movable on terrain unsuitable for wheels. Obviously there\u0027s a big risk of it getting snagged on something....... but that\u0027s something they should be able to reduce using test-environments on earth.\u003C/p\u003E\u003Cp\u003EIf it contained experiments that require anchoring, I expect it\u0027s design could entail multiple anchoring methods and use whichever is deemed most suitable. Dust it a big problem for glue, but if the lander was able to move around and find a suitable surface..... maybe use a small can of gas to blow it clean..... I\u0027m sure it could be viable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-14T19:20:14Z\u0022 title=\u002211/14/2014 07:20  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 14, 2014\u003C/time\u003E by Moar Boosters\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GregA","CreatedById":126788,"CreatedDateTime":"2014-11-14T21:15:04Z","Content":"\n\u003Cp\u003EUse an explosive to fire a nail or piton into the rock or regolith. vent the explosive so it provides all the needed forces to set the nail. Small light and fail safe.\u003C/p\u003E\u003Cp\u003EThe problem they are having with Rosetta is that they designed it to land on a surface that is mostly water ice. If Rosetta had been launched after Deep Impact it would have informed their design choices. They would have known the surface of comets has no water ice, and is made of carbonaceous chondrite. They were working with the best information they had at the time,\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-11-14T21:34:55Z","Content":"\n\u003Cp\u003EThe problem is the harpoons never fired at all, and neither did the thruster. The screws alone would not be sufficent in any material.\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2014-11-14T22:46:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Andersenman\u0022 data-cite=\u0022Andersenman\u0022\u003E\u003Cdiv\u003EYes, I am aware of the dust issue. A simple kitchen experiment, trying to glue something to a pile of flour, should demonstrate. Flour screens liquids from penetrating deeper because when it gets wet, the starch activates and expands into a gel, creating a barrier. However, I don\u0027t (yet) have reason to expect mineral dust to behave like starch, and with a wetting agent (say, soap) any prevalent Lotus effect should be overcome, if the glue or its solvent isn\u0027t already capable enough. But feel free to educate me otherwise. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay. Buy some sand - as fine as possible - from your local hardware store and perform the same experiment. It will be a bit different from actual regolith because the grains will be rounded, but should still be a decent analog for determining whether glue will stick to the surface in a useful way.\u003C/p\u003E\n"},{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-11-17T02:52:05Z","Content":"\n\u003Cp\u003EI\u0027d worry about contamination. It would be hard to get a clean sample from the surface after then glue had set and out-gassed\u003C/p\u003E\n"},{"CreatedByName":"Aningaaq","CreatedById":99814,"CreatedDateTime":"2014-11-17T03:58:02Z","Content":"\n\u003Cp\u003ENot really glue but people have been looking at gecko feet for robots stability recently. \u003Ca href=\u0022http://www.washingtonpost.com/news/speaking-of-science/wp/2014/08/12/new-research-investigates-the-physics-of-sticky-gecko-feet/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.washingtonpost.com/news/speaking-of-science/wp/2014/08/12/new-research-investigates-the-physics-of-sticky-gecko-feet/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-11-17T09:57:55Z","Content":"\n\u003Cp\u003Eim having a hard time finding any information about the workings of the harpoons, i personally would have stuck it in a shotgun shell and fired it with a solenoid. im rather curious what they used.\u003C/p\u003E\u003Cp\u003Epowder actuated pitons might have been a better idea, thinking foot long rods of metal fired into the surface at diverging angles, this would also set off a powerful anti-recoil charge to keep the probe on the ground. \u003C/p\u003E\u003Cp\u003Eyou still want to use glue, take a laser and bore a hole a several cm deep, just a couple mm across. then insert a thin metal tube capped at the end and full of tiny perforations, insert it into the hole and inject an epoxy resin (vacuum would draw it out of its reservoir and you just need to turn on a couple solenoid/servo valves to activate). the epoxy would be mixed when injected into the tube, and would harden pretty fast. the laser bore would not be a perfect cylendrical tap because of focusing concerns, and this is perfect for creating a good bond with the tube, epoxy, and the surface material. small lasers are getting really good at puncturing through various materials, i think the best bet would be to use a 1MW pulse laser, firing a high powered pulse for a tiny fraction of a second, you would need to recharge the capacitors from the solar panels after each pulse, and it might take days to complete the bore. such lasers have been made very portable, for example \u003Ca href=\u0022http://hackaday.com/2011/03/10/youll-shoot-your-eye-out-with-a-1mw-laser-pulse-pistol/\u0022 rel=\u0022external nofollow\u0022\u003Ethis one\u003C/a\u003E, which can punch through sheet metal.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-11-17T10:35:32Z","Content":"\n\u003Cp\u003EProblem is epoxy needs to be very well mixed, and it also doesn\u0027t keep particularly well, particularly when there are extreme variations in temperature.\u003C/p\u003E\n"},{"CreatedByName":"heng","CreatedById":126869,"CreatedDateTime":"2014-11-17T12:28:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Andersenman\u0022 data-cite=\u0022Andersenman\u0022\u003E\u003Cdiv\u003EPros:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESpecifically, Cyanoacrylate binds with water, which the comet is known to have plenty of. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E Cons:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EMechanical reliability solely dependent on soil wetted by the glue and the material in immediate contact \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESingle-use only \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would suggest using a different material, if I may. Instead of using cyano-acrylates, which bond with water, try using UV curing adhesives. You can just release a blob of the stuff, adjust as necessary - take your time, then switch on the lamp for bonding. Basically glueing the UV lamp directly to the surface:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E######### -   surface\u003Cbr\u003E.#.#..#.. \u003Cbr\u003E......... -   adhesive\u003Cbr\u003E========= -   glas\u003Cbr\u003E=^^^^^^^=\u003Cbr\u003E=|||||||= -   UV light/heat lamp\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EPro: \u003C/p\u003E\u003Cp\u003E - more time to adjust to optimal position\u003C/p\u003E\u003Cp\u003E - bond can be released after use by using a heat lamp\u003C/p\u003E\u003Cp\u003E - not reliant on water\u003C/p\u003E\u003Cp\u003EThe other Pros and Cons are the same.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-11-17T12:44:58Z","Content":"\n\u003Cp\u003Eone problem that occurred to me is you are going to be releasing contaminants into the landing site, which might ruin your experiments. blobbing on adhesives might be a bad idea if you want soil samples.\u003C/p\u003E\n"},{"CreatedByName":"GregA","CreatedById":126788,"CreatedDateTime":"2014-11-17T12:52:36Z","Content":"\n\u003Cp\u003EWoah... If your target is made of nickle iron....\u003C/p\u003E\u003Cp\u003EJust a big old magnet on the bottom of your probe.\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2014-11-18T21:15:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregA\u0022 data-cite=\u0022GregA\u0022\u003E\u003Cdiv\u003EWoah... If your target is made of nickle iron....\u003Cp\u003EJust a big old magnet on the bottom of your probe.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat would require your target to have a magnetic field, which usually only planets have, since it is generated by a mantle and a solid core, which asteroids and comets dont have, and you wouldnt need a magnet on a planet since you have gravity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-18T21:18:01Z\u0022 title=\u002211/18/2014 09:18  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 18, 2014\u003C/time\u003E by Deadpangod3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Oscilllator","CreatedById":120732,"CreatedDateTime":"2014-11-24T11:12:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deadpangod3\u0022 data-cite=\u0022Deadpangod3\u0022\u003E\u003Cdiv\u003Ethat would require your target to have a magnetic field, which usually only planets have, since it is generated by a mantle and a solid core, which asteroids and comets dont have, and you wouldnt need a magnet on a planet since you have gravity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENoNo. The magnetism of a blob of Nickel/Iron is\u003Cstrong\u003E completely\u003C/strong\u003E separate from the the earths magnetic field. Magnets by definition have their own magnetic field, they don\u0027t need an external one to work.\u003C/p\u003E\u003Cp\u003EBack on topic though, nobody has mentioned a crucial drawback that is common to all glues - before they have time to set, they will evaporate! All glues are either based on polymerisation or the evaporation of a solvent such as water. Either way, an active component of the glue is quite volatile and as such will evaporate very quickly under the near-perfect vacuum of space. The most likely outcome of this is that the nozzle will be gummed up as soon as it is opened, and at best your glue will be very ineffective, having mostly evaporated before it had time to properly set.\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2014-11-24T12:17:45Z","Content":"\n\u003Cp\u003EWhat about something simpler?\u003C/p\u003E\u003Cp\u003EBefore landing shoot a net at a big rock. The net then wraps around it and tigthens itself (maybe with help of a winch). Even if the lander weights only 3 grams on a comet, a whole boulder weights at least a few kilos serving as an anchor.\u003C/p\u003E\u003Cp\u003EPros\u003C/p\u003E\u003Cp\u003E- easy mechanics\u003C/p\u003E\u003Cp\u003E- proven design\u003C/p\u003E\u003Cp\u003E- survives enviroment\u003C/p\u003E\u003Cp\u003E- allows integrated sensors if there\u0027s an application for them\u003C/p\u003E\u003Cp\u003ECons\u003C/p\u003E\u003Cp\u003E- propably size and mass\u003C/p\u003E\u003Cp\u003E- needs a fairly complex aiming system (cameras, computers, actuators)\u003C/p\u003E\u003Cp\u003E- needs a decent sized and shaped rock\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-24T12:21:07Z\u0022 title=\u002211/24/2014 12:21  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 24, 2014\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"}]}