{"TopicId":90297,"ForumId":18,"TopicTitle":"die Kerbal die","CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2014-11-14T19:52:30Z","PageNum":1,"Articles":[{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2014-11-14T19:52:30Z","Content":"\n\u003Cp\u003EWay back in 0.23, I started to discover KSP. Now the main game time is KSP. So realizing that KSP has totally removed my inclination to play Mount \u0026amp; Blade, I strolled over to \u003Ca href=\u0022https://www.taleworlds.com/en/Games/Bannerlord\u0022 rel=\u0022external nofollow\u0022\u003ETaleWorlds\u003C/a\u003E site and watched their video.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/obO5sbziqjM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThe work this team accomplshed back in 2008 was very decent. This latest work they have developed seems impressive, but, I really have little experiance with game engines, world textures and models. \u003C/p\u003E\u003Cp\u003EThey have created an in-house game engine and state the editor is professional and easy to use and will be available to modders. The mountain area mentioned covered 225 km\u003Csup\u003E2\u003C/sup\u003E, that seems large. They indicate how their game engine would improve graphics and animations without scaraficing preformance or gameplay. Just would like to tap into this communities knowledge for a review of their latest work.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JE094zl.png\u0022 alt=\u0022JE094zl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWho ever is responsible for this please identify. So I can give you some rep. This picture just cracked me up. It doesnt look like it is from M\u0026amp;B. Where is it from?\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-11-14T21:20:31Z","Content":"\n\u003Cp\u003EI believe it\u0027s just a kerbal head photoshopped onto some Warhammer 40,000 (fan?)art.\u003C/p\u003E\n"}]}