{"TopicId":90328,"ForumId":34,"TopicTitle":"[0.90] Regolith - an open ISRU and Resource framework [0.1.7 - 2015.02.26]","CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-11-15T02:52:52Z","PageNum":9,"Articles":[{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-11T16:20:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EI\u0027m basically just asking if we\u0027re going to see massive knife-cut cliffs in the resource distribution on biome borders. It might end up looking quite absurd and out of place in some cases. Interpolation is maybe not easy to do (I\u0027m an amateur at best when it comes to code), but I wanted to at least bring up the topic while the core systems are still pre-release, see whether you think it\u0027s an issue and stuff.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, you will potentially see knife edges at a biome\u0027s edge. That being said, I don\u0027t see it as an issue tbh.\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-12-11T16:29:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DivisionByZero\u0022 data-cite=\u0022DivisionByZero\u0022\u003E\u003Cdiv\u003EIt\u0027d be nice to maintain the ORSX existence since ORS support in ScanSAT was removed but the CRP KSPI stuff makes it work again. Just saying...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen CRP transitions from PNG maps to Regolith resource definitions and SCANsat transitions to Regolith, the current release of the integration pack will become obsolete.\u003C/p\u003E\u003Cp\u003EWith the PNGs that I\u0027d been sharing with ORS going away, I think the only way I can keep resource sharing happening will be to convert the scanning and extraction bits of KSPI from ORS to Regolith, at least for the resources that it makes sense to share.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-11T17:24:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EAsteroid analyzers work when you\u0027re connected up.\u003Cp\u003EPlanetary analyzers work the same way ORS-X does today, basically you can get a reading over the current lat/lon with an altitude restriction (like the K\u002B analyzer).\u003C/p\u003E\u003Cp\u003ESo pretty much the same experience as you have with ORS/ORSX today except there are no beach balls. Really no need, since your zones are biome based with some simplex nosie variance in that biome.\u003C/p\u003E\u003Cp\u003EGeneral pattern will be to either do a flyover or have a Kerbal drop onto a biome and see what\u0027s in it, and if you like it, find a nice spot in that biome. Some resources are more \u0027spikey\u0027 than others, so SCANSat helps in that regard. This is kinda why I needed all of the new biome data in 0.90 to make this work well. Oh - and I added a little biome scanner partmodule which will give you more detailed info including biome name \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to admit I don\u0027t know much about most USI mods. I haven\u0027t actually played the game much since 23.5 actually. I\u0027m not asking for game mechanics information. Just about your part modules that deal with resource detection and/if they trigger animations or not, just the visual stuff. your mods have almost as many acronyms as the DoD; Great for fluff text, terrible for people like me trying to integrate some 3rd party parts using your part modules. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E It\u0027s a beast navigating all the different DLLs at the moment. I\u0027m assuming that\u0027s one of the reasons for Regolith. \u003C/p\u003E\u003Cp\u003EAs far as I can tell, Analyzer modules (one asteroid, one planetary) from Regolith, are pretty much automatic, as long as the vessel is connected or landed in the right location. Easy enough. Now the K\u002B scanner looks like the animation is triggered separately, and isn\u0027t linked to the detection code at all, correct? it also uses ORSX_AnimationGroup module; is that going the way of dinosaurs with Regolith replacing ORS/ORSX? Karbonite\u0027s scanner uses ORSX_ResourceScanner, IIRC the animation on the detection array is always running. \u003C/p\u003E\u003Cp\u003EShould I assume all those different detector parts will be handled by USIAnimation (USITools) and Regolith\u0027s Analyzer module in the future?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-11T17:57:53Z\u0022 title=\u002212/11/2014 05:57  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 11, 2014\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"funk","CreatedById":118840,"CreatedDateTime":"2014-12-11T17:52:34Z","Content":"\n\u003Cp\u003EI\u0027m looking forward to the upcoming changes with regolith and 0.90. So far I\u0027ve been looking for hotspots of MKS resources and build my base near them using proxy logistics. Just as for Karbonite for converting it into fuel. \u003C/p\u003E\u003Cp\u003EBut if I understand correctly, it will be necessary to rebuild/relocate existing bases... perhaps having new bases each for another resource, because their concentration is based on biomes. So it might be the best to wait for update, before building new bases? Are the old maps somehow recognized for the new distribution?\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-11T17:57:30Z","Content":"\n\u003Cp\u003EHere are all of the Regolith Part Modules (working on API documentation now) - subject to change, but so far looking pretty good for release, unless I hit a bug or other issue in final testing:\u003C/p\u003E\u003Cp\u003EFor Asteroids:\u003C/p\u003E\u003Cp\u003EREGO_ModuleAnalysisResource (What resources are scannable? i.e. you could have stuff present that only exists when you drill)\u003C/p\u003E\u003Cp\u003EREGO_ModuleAsteroidAnalysis (This is the module that lets a part show asteroid composition)\u003C/p\u003E\u003Cp\u003EREGO_ModuleAsteroidDrill (an asteroid drill! Includes animations, and whether it has to be attached to the asteroid, raycasts, etc.)\u003C/p\u003E\u003Cp\u003EREGO_ModuleAsteroidInfo (All about asteroids - this is added to the PotatoRoid object automatically)\u003C/p\u003E\u003Cp\u003EREGO_ModuleAsteroidResource (Resources that may be present on an asteroid - not all have to be scannable)\u003C/p\u003E\u003Cp\u003EFor Planetary Resources:\u003C/p\u003E\u003Cp\u003EREGO_ModuleResourceHarvester (Drills, pumps, filters - atmospheric, crustal, oceanic, and interplanetary)\u003C/p\u003E\u003Cp\u003EREGO_ModuleResourceScanner (Scans for resources - very fine grained (resource plus location - atmo/crustal/etc.))\u003C/p\u003E\u003Cp\u003EREGO_ModuleBiomeScanner (Mostly for debugging, shows biome, lat-lon, etc.)\u003C/p\u003E\u003Cp\u003EFor Converters and Generators (note: all converters/generators work even when the ship is not focused and out of physics range):\u003C/p\u003E\u003Cp\u003EREGO_ModuleAnimatedConverter (If you want a part to animate while any converters are playing)\u003C/p\u003E\u003Cp\u003EREGO_ModuleTrickleCharger (Used for generators and such where you need variable power output - the Karbonite generator uses this)\u003C/p\u003E\u003Cp\u003EREGO_ModuleResourceConverter (Convert things from stuff into stuff. Can be animated with the AnimatedConverter above as well as AnimationGroup below.).\u003C/p\u003E\u003Cp\u003ECommon:\u003C/p\u003E\u003Cp\u003EREGO_ModuleAnimationGroup (Applies to any converter/generator/etc - includes modules for deployment (and disables all generators/converters when in a non-deployed state), etc.)\u003C/p\u003E\u003Cp\u003E[Edit for completeness]\u003C/p\u003E\u003Cp\u003EAnd a signature for a static method on the RegolithResourceMap class for extension and getting your resource info at a given lat/lon:\u003C/p\u003E\u003Cp\u003Epublic static float GetAbundance(double lat, double lon, string resourceName, int bodyId, int resourceType = 0, double altitude = 0)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-11T18:09:42Z\u0022 title=\u002212/11/2014 06:09  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 11, 2014\u003C/time\u003E by RoverDude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-11T17:59:51Z","Content":"\n\u003Cp\u003E@Funk - note that a biome may contain multiple resources, and a resource may be in multiple biomes, and that this can vary planet by planet. Old maps will not work at all as it\u0027s a completely different system (where we\u0027re going we need no maps!), so you may have to ship some resources in, etc.\u003C/p\u003E\u003Cp\u003EThat being said - bear in mind that with an MKS base, once you\u0027re done it is a 100% closed loop - i.e. you only need drills and such in construction. Your larger issue is that 0.90 will bring breaking changes, so you will have to evac your base anyway. So if you have not yet built one, I would recommend holding off a bit.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-11T18:02:51Z","Content":"\n\u003Cp\u003EJust wondering - I don\u0027t exactly understand how resource map works, but doesn\u0027t no map needed mean things like scansat would not be able to use it as an overlay over old map? Or will there be something that allow mapping mods to detect resources?\u003C/p\u003E\n"},{"CreatedByName":"ExavierMacbeth","CreatedById":110680,"CreatedDateTime":"2014-12-11T18:07:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022funk\u0022 data-cite=\u0022funk\u0022\u003E\u003Cdiv\u003EI\u0027m looking forward to the upcoming changes with regolith and 0.90. So far I\u0027ve been looking for hotspots of MKS resources and build my base near them using proxy logistics. Just as for Karbonite for converting it into fuel. \u003Cp\u003EBut if I understand correctly, it will be necessary to rebuild/relocate existing bases... perhaps having new bases each for another resource, because their concentration is based on biomes. So it might be the best to wait for update, before building new bases? Are the old maps somehow recognized for the new distribution?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConsidering its very possible the 0.90 update will mess with any saved games anyway, you may end up starting from scratch.\u003C/p\u003E\u003Cp\u003EBut to answer your question, It sounds like he is doing away completely with the old resource maps so at worse the concentrations around your current base location may shift. Keep in mind I think it still has a gradient based system (just configurable by biome as another layer) so your not likely to suddenly find yourself sitting on a spot that suddenly looses all resources... though the concentration may drop noticeably if the resources shift.\u003C/p\u003E\n"},{"CreatedByName":"ExavierMacbeth","CreatedById":110680,"CreatedDateTime":"2014-12-11T18:09:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EJust wondering - I don\u0027t exactly understand how resource map works, but doesn\u0027t no map needed mean things like scansat would not be able to use it as an overlay over old map? Or will there be something that allow mapping mods to detect resources?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERover has already mentioned he is working with Scansat to make sure it displays right. I\u0027m guessing that instead of a PNG style map that the gradients will be procedurally created (within the limits of the configs) and then saved for reference/display. So instead of texture files that kill memory it becomes a text map that scansat would translate into an overlay \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-11T18:13:13Z","Content":"\n\u003Cp\u003E@RainDreamer - All SCANSat needs is a way to get a concentration at a given lat/lon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I confirmed that my method signature (edited and added to the API list) works for DMagic, and I\u0027ll do a pull request for Cyrik\u0027s mod.\u003C/p\u003E\u003Cp\u003E@ExavierMachbeth - one diff is that right now, every planet has every resource - there will be slight chance in the new version that a planet is lacking in something. But yeah, given that I anticipate many mods breaking in 0.90 (and I\u0027ll use the opportunity to do my own save-breaking updates) it\u0027s probably a good reason to start a new save.\u003C/p\u003E\u003Cp\u003E[Edit]\u003C/p\u003E\u003Cp\u003EAnd a side note - RE knife-edge maps - we have this with Kethane today to no ill effect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-11T18:23:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EHere are all of the Regolith Part Modules (working on API documentation now) - subject to change, but so far looking pretty good for release, unless I hit a bug or other issue in final testing:\u003Cp\u003E...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! That\u0027s extremely helpful. Does ModuleAnimationGroup apply to Analyzer/Scanner? Doesn\u0027t appear to from what I saw yesterday on github. It makes sense not to as analyzer/scanners are basically automatic; but would nice if there is ON/OFF for analyzer/scanners. like KSPI\u0027s analyzers.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-11T18:25:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003EThanks! That\u0027s extremely helpful. Does ModuleAnimationGroup apply to Analyzer/Scanner? Doesn\u0027t appear to from what I saw yesterday on github. It makes sense not to as analyzer/scanners are basically automatic; but would nice if there is ON/OFF for analyzer/scanners. like KSPI\u0027s analyzers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does actually \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EA good example is the Karborundum scanner that has to be activated and the mast antenna extended before it works.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOh, and assume GitHub is full of bees. Doing a lot of mass conversions of mods right now so things will change, but those first part modules should give you a good idea of what\u0027s up.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-11T18:26:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EIt does actually \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EA good example is the Karborundum scanner that has to be activated and the mast antenna extended before it works.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOh, and assume GitHub is full of bees. Doing a lot of mass conversions of mods right now so things will change, but those first part modules should give you a good idea of what\u0027s up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuh, didn\u0027t guess that from the config file. Good to know!\u003C/p\u003E\n"},{"CreatedByName":"ExavierMacbeth","CreatedById":110680,"CreatedDateTime":"2014-12-11T18:34:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003E@ExavierMachbeth - one diff is that right now, every planet has every resource - there will be slight chance in the new version that a planet is lacking in something.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh that will make self sustaining bases an interesting prospect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-11T18:54:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ExavierMacbeth\u0022 data-cite=\u0022ExavierMacbeth\u0022\u003E\u003Cdiv\u003EOh that will make self sustaining bases an interesting prospect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGranted, more biomes means more odds of something being present. So your planets with lots of biomes have better diversity and better odds of having everything - but also likely not in the same spot.\u003C/p\u003E\n"},{"CreatedByName":"ExavierMacbeth","CreatedById":110680,"CreatedDateTime":"2014-12-11T19:58:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EGranted, more biomes means more odds of something being present. So your planets with lots of biomes have better diversity and better odds of having everything - but also likely not in the same spot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust a verification question since I don\u0027t know if there is a backend difference in the code... This will work with the Custom Biomes mod right?\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-11T20:22:39Z","Content":"\n\u003Cp\u003ENo idea to be honest. If it works exactly the same as stock biomes, then yes. If it does something different, then probably not.\u003C/p\u003E\n"},{"CreatedByName":"GrimT","CreatedById":119548,"CreatedDateTime":"2014-12-12T01:01:48Z","Content":"\n\u003Cp\u003ESoooooo see disappearing act below \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the VAB (designed to just grab and return asteroid to Kerbin SOI... no idea if it works)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1275.photobucket.com/albums/y444/GrimTrigger86/InVAB_zpsd800a4a5.png\u0022 alt=\u0022InVAB_zpsd800a4a5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn orbit..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1275.photobucket.com/albums/y444/GrimTrigger86/AfterLaunch_zps65dc2654.png\u0022 alt=\u0022AfterLaunch_zps65dc2654.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI only share because I wasnt sure if there was some voodoo with the larger grabber you released with Regolith, or if it was PEBKAC again. Doesnt break my game or anything but just strange, and I\u0027ll avoid using the large grabber if it replicates with all designs\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-12-12T16:03:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GrimT\u0022 data-cite=\u0022GrimT\u0022\u003E\u003Cdiv\u003ESoooooo see disappearing act below \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EIn the VAB (designed to just grab and return asteroid to Kerbin SOI... no idea if it works)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i1275.photobucket.com/albums/y444/GrimTrigger86/InVAB_zpsd800a4a5.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i1275.photobucket.com/albums/y444/GrimTrigger86/InVAB_zpsd800a4a5.png\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EIn orbit..\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i1275.photobucket.com/albums/y444/GrimTrigger86/AfterLaunch_zps65dc2654.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i1275.photobucket.com/albums/y444/GrimTrigger86/AfterLaunch_zps65dc2654.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI only share because I wasnt sure if there was some voodoo with the larger grabber you released with Regolith, or if it was PEBKAC again. Doesnt break my game or anything but just strange, and I\u0027ll avoid using the large grabber if it replicates with all designs\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf a PartModule throws an exception during vessel loading, the exception breaks out of a loop in Squad\u0027s code and prevents the parts later in the file from being processed. Some versions of kOS are famous for doing this.\u003C/p\u003E\u003Cp\u003EReplicate the issue and quit KSP with Alt\u002BF4 or Command\u002BQ so it\u0027s near the end of your output log, then share the log so we can see what module is throwing the exception. That will give us a better idea whether it\u0027s caused by an installation issue or a bug in the module.\u003C/p\u003E\n"},{"CreatedByName":"GrimT","CreatedById":119548,"CreatedDateTime":"2014-12-12T16:32:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022undercoveryankee\u0022 data-cite=\u0022undercoveryankee\u0022\u003E\u003Cdiv\u003EIf a PartModule throws an exception during vessel loading, the exception breaks out of a loop in Squad\u0027s code and prevents the parts later in the file from being processed. Some versions of kOS are famous for doing this.\u003Cp\u003EReplicate the issue and quit KSP with Alt\u002BF4 or Command\u002BQ so it\u0027s near the end of your output log, then share the log so we can see what module is throwing the exception. That will give us a better idea whether it\u0027s caused by an installation issue or a bug in the module.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI shall do so first opportunity I have sir. Thanks! I didn\u0027t have an opportunity last night to build another craft with the same part and an alternative configuration last night. I\u0027ll relaunch this one to replicate the issue in a log and attempt alternate build configs to see if maybe I stumbled across a wonky exception. If the latter is not the case I\u0027ll provide that log as well.\u003C/p\u003E\n"},{"CreatedByName":"GrimT","CreatedById":119548,"CreatedDateTime":"2014-12-12T23:37:17Z","Content":"\n\u003Cp\u003ESo here are my results.\u003C/p\u003E\u003Cp\u003EI loaded the same craft that experienced the issue before, removed the large grabber claw as being the Initial part i.e. first part you place (usually drone or cockpit) and replaced it with a large drone core, replaced the grabber claw on top. The craft was fine.\u003C/p\u003E\u003Cp\u003EI loaded the previously issued craft that had the large grabber claw as the drone part, attempted re-launch and I was able to reproduce the results...\u003C/p\u003E\u003Cp\u003Elong story short, it was a poor decision on my part, and I do not recommend attempting to use the claw as the core part. Not sure why it did what it did but I know how to avoid the issue. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Thank you for your time.\u003C/p\u003E\n"},{"CreatedByName":"temporalExile","CreatedById":127675,"CreatedDateTime":"2014-12-13T20:24:00Z","Content":"\n\u003Cp\u003EIs there any way to make a converter produce heat as it\u0027s running? (Actual heat, not a resource like WasteHeat)\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-13T20:26:56Z","Content":"\n\u003Cp\u003ENope, not something I have built in.\u003C/p\u003E\u003Cp\u003E(Longer term, I\u0027ll be collaborating with Nertea on a heat system, but it will be resource based).\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-14T16:49:12Z","Content":"\n\u003Cp\u003E(Cross post time)\u003C/p\u003E\u003Cp\u003EAn example of the Regolith generator in action. Works when the ship is not focused, handles EC pretty well (it works under warp, but has a hard cap to prevent insta-drain of batteries), handles dynamic loads very well, and also the concept of both required components on a linear scale (example would be MKS machinery) and can also support decreasing efficiency based on resource presence (so you can do fun things like clogged air filters, or reduce efficiency based on heat present, etc.)\u003C/p\u003E\u003Cp\u003EEnjoy!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yAwqZYG.png\u0022 alt=\u0022yAwqZYG.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2014-12-14T22:22:51Z","Content":"\n\u003Cp\u003EWhat\u0027s the plan for API documentation on this? I\u0027m kinda chomping at the bit some to use it for a project of my own - a more realistic ISRU mod. I \u003Cem\u003Ecan\u003C/em\u003E read source code, but if there\u0027s a plan to provide the info I want anyway, I figured I\u0027d ask. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}