{"TopicId":90571,"ForumId":70,"TopicTitle":"Possible bug in map view?","CreatedByName":"the_cheeky_badger","CreatedById":129458,"CreatedDateTime":"2014-11-17T20:58:39Z","PageNum":1,"Articles":[{"CreatedByName":"the_cheeky_badger","CreatedById":129458,"CreatedDateTime":"2014-11-17T20:58:39Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EHi,\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EI\u0027m not sure if this is a bug or not, but I\u0027d like to get your view on it. If I change the classification of my spacecraft in map view, I can\u0027t then see them from other classification of spacecraft.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003Efor example I launch a space station (which is actually a probe on launch) and once it\u0027s in space I change its classification to Space Station.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EThen when I launch the next modular section I cant see the original space station in orbit to target it? However, if I change the space station classification back, I can then see it.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EAny ideas?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EI can replicate this problem in a new game and existing game btw\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003EThanks\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2014-11-17T21:28:38Z","Content":"\n\u003Cp\u003EHow are you changing the ID is it in map mode and going to top of screen and selecting space station, probe, etc or are you right clicking on the command pod and changing it.\u003C/p\u003E\u003Cp\u003EIf you do the map version it doesn\u0027t change your ship class it just recruiters your map veiw\u003C/p\u003E\n"},{"CreatedByName":"the_cheeky_badger","CreatedById":129458,"CreatedDateTime":"2014-11-18T22:37:22Z","Content":"\n\u003Cp\u003EHi, \u003C/p\u003E\u003Cp\u003EI right click the probe control module and rename it, then I usually change the name and class together. I do this when controlling the ship, so not in map mode. \u003C/p\u003E\u003Cp\u003EIt\u0027s then when I change to map mode that I can no longer see the other types of craft? \u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2014-11-25T21:38:26Z","Content":"\n\u003Cp\u003EHave you checked the dropdown menu at the top all craft types should be white if not you\u0027ve turned that section off just click on the icon and it should reappear\u003C/p\u003E\n"},{"CreatedByName":"the_cheeky_badger","CreatedById":129458,"CreatedDateTime":"2014-11-25T21:51:32Z","Content":"\n\u003Cp\u003EI\u0027m not in the tracking station, I\u0027m on the orbit view map once your controlling your space craft, it works fine from tracking station\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-11-26T12:23:51Z","Content":"\n\u003Cp\u003E.. and have you checked the dropdown menu at the top (where the altimeter would be in flight view)? Made sure the class you changed your ship to is visible in map view (the icon is white)?\u003C/p\u003E\u003Cp\u003EHere\u0027s where screenshots would be a lot more helpful than descriptions..\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-11-26T12:27:48Z","Content":"\n\u003Cp\u003EFilters, it\u0027s your filters, like Obsessed says they are a drop down at the top of the screen in the map \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ETurn stations on.\u003C/p\u003E\n"},{"CreatedByName":"the_cheeky_badger","CreatedById":129458,"CreatedDateTime":"2014-11-26T21:28:28Z","Content":"\n\u003Cp\u003EHi guys,\u003C/p\u003E\u003Cp\u003EYou\u0027re absolutely right! I didn\u0027t realise the filters dropped down when you move the mouse to the top centre of the screen, thanks for you help!\u003C/p\u003E\n"}]}