{"TopicId":90672,"ForumId":55,"TopicTitle":"Orbital Decay","CreatedByName":"ximrm","CreatedById":111063,"CreatedDateTime":"2014-11-18T22:55:56Z","PageNum":1,"Articles":[{"CreatedByName":"ximrm","CreatedById":111063,"CreatedDateTime":"2014-11-18T22:55:56Z","Content":"\n\u003Cp\u003EIn real life, the ISS loses about 2km in altitude per month iirc.\u003C/p\u003E\u003Cp\u003EIt would be a nice(maybe optional for hard-mode) feature to have to revisit older satellites and stations that might get in trouble soon.\u003C/p\u003E\u003Cp\u003EMaybe forcing players to launch new satellites if it\u0027s not possible to dock because you forgot the docking port and the satellite having no thrusters.\u003C/p\u003E\u003Cp\u003EIt would also integrate a new mission type, similar to saving kerbals stranded in orbit, but instead of a deadline where nothing happens, and just ends, the deadline could indicate the final entry into the atmosphere.\u003C/p\u003E\u003Cp\u003EThe rate at which the decay happens should be slowed down of course.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-18T23:10:07Z\u0022 title=\u002211/18/2014 11:10  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 18, 2014\u003C/time\u003E by ximrm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2014-11-19T04:46:46Z","Content":"\n\u003Cp\u003Ealready suggested but i might as well talk about it....\u003C/p\u003E\u003Cp\u003Ei could see this happen along with the implementation of an alarm system that would signal if a station or satellite was in danger of being deorbited although it wold be a chore having to go back and check on those ships constantly, especially when booking a several year journey...\u003C/p\u003E\u003Cp\u003Ejust saying\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2014-11-19T04:56:24Z","Content":"\n\u003Cp\u003Ethis is on the already suggested sticky (always check it!). to see how that discussion went, see \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/42842-Thermospheres-Exospheres-for-Atmospheric-Planets\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\n"}]}