{"TopicId":90756,"ForumId":16,"TopicTitle":"Space junk, The Klaw, and recovering parts for Funds.","CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-11-19T23:40:43Z","PageNum":1,"Articles":[{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-11-19T23:40:43Z","Content":"\n\u003Cp\u003ESo. Today, I finally unlocked the Klaw, and then had an idea. A system for moving parts out in wierd Kerbin orbits back to LKO, and then recovering them to Kerbin.\u003C/p\u003E\u003Cp\u003ESpent stages, fuel tanks, stray probes, etc. The \u0027grabber\u0027 that hauls them back is basically a nuclear-engined fuel tank with a couple of Klaws and some infrastructure to keep it in orbit. The plan is to tank it up from fuel stations as needed.\u003C/p\u003E\u003Cp\u003EGetting them back to Kerbin is a job for the \u0027dropper\u0027; a set of Klaws and a load of parachutes, strapped to an engine for de-orbiting, intended to drop things off before landing safely.\u003C/p\u003E\u003Cp\u003EIs this viable? Would I be able to recover significant amounts of said junk (mostly large fuel tanks with expensive engines on) to cover the costs of actually launching the dropper on a rocket?\u003C/p\u003E\u003Cp\u003EIt literally only has to get into LKO, rendezvous with something, and then deorbit with it.\u003C/p\u003E\u003Cp\u003EWould a small spaceplane be a more economic method of retrieval? Maybe a set of chutes and a probe core attached to the Klaw module on the back of it, and send the plane back down on it\u0027s own.\u003C/p\u003E\u003Cp\u003EWill the Klaw even stay attached during the descent?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T10:18:04Z\u0022 title=\u002211/20/2014 10:18  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by Skorpychan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-19T23:52:27Z","Content":"\n\u003Cp\u003EIt\u0027s not cost effective. You will spend more doing it than you will recover in most cases. Unless you just dumped a ton of equipment up there, but most people have nothing but kicker engines and tanks up there.\u003C/p\u003E\u003Cp\u003EEven if you made the claw a resuable tool, you have to spend fuel to catch it, spend fuel to dock with it, spend fuel to deorbit it, and then spend fuel to re-orbit the claw tool and then spend fuel to refuel the claw tool. Not to mention the time you spend doing all that.\u003C/p\u003E\u003Cp\u003EIt\u0027s better to plan ahead. Build your craft so they either stage in an unstable orbit with chutes (Stage Recovery/Debrefund mods) or build them with probes at appropriate places to deorbit themselves. Even without mods, it\u0027s a good practice to keep your LKO clean.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-19T23:57:25Z\u0022 title=\u002211/19/2014 11:57  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 19, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-11-20T00:01:11Z","Content":"\n\u003Cp\u003EAssuming you have a lot of junk and want to maximize efficiency: I would recommend designing a spaceplane whose sole task is to deliver droppers to LKO*, and a spaceplane whose sole task is to refuel the stations. Spaceplanes are the most efficient way to get to LKO, but the aerodynamic surfaces, landing gear, etc, is just dead mass in space. Therefore, the most efficient way to do everything is to deliver orbital vehicles and resources in SSTO spaceplanes, and immediately return the spaceplanes. From there, it\u0027s a question of whether the costs are worth the recovery.\u003C/p\u003E\u003Cp\u003ECosts include: cost of bringing dropper to space, anything less than 100% recovery of dropper, cost of bringing grabber fuel to space, risk of losing SSTOs multiplied by cost of SSTOs.\u003C/p\u003E\u003Cp\u003E*For maximum efficiency, you would want to deliver each dropper straight to the orbital plane of its target piece of junk. Otherwise, either your dropper or your recovery vehicle\u0027s going to have to make a plane change. Also, I have never tried to use a Klaw to hold onto something during reentry: tests are called for.\u003C/p\u003E\u003Cp\u003EOf course, in terms of time efficiency, silly parts-test contracts probably get you more money per hour of game time, so a hyper-optimizer would just leave stuff in space. The real answer is \u0022Do you find this fun?\u0022\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-20T00:03:55Z","Content":"\n\u003Cp\u003EThe claw will hold during re-entry, it\u0027s really just a fancy docking port.\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-11-20T00:48:45Z","Content":"\n\u003Cp\u003EI landed an asteroid at the KSC with klaw and a bunch of chutes attached. Not a big asteroid but everything held together when the chutes opened.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-11-20T10:20:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starman4308\u0022 data-cite=\u0022Starman4308\u0022\u003E\u003Cdiv\u003EAssuming you have a lot of junk and want to maximize efficiency: I would recommend designing a spaceplane whose sole task is to deliver droppers to LKO*, and a spaceplane whose sole task is to refuel the stations. Spaceplanes are the most efficient way to get to LKO, but the aerodynamic surfaces, landing gear, etc, is just dead mass in space. Therefore, the most efficient way to do everything is to deliver orbital vehicles and resources in SSTO spaceplanes, and immediately return the spaceplanes. From there, it\u0027s a question of whether the costs are worth the recovery.\u003Cp\u003ECosts include: cost of bringing dropper to space, anything less than 100% recovery of dropper, cost of bringing grabber fuel to space, risk of losing SSTOs multiplied by cost of SSTOs.\u003C/p\u003E\u003Cp\u003E*For maximum efficiency, you would want to deliver each dropper straight to the orbital plane of its target piece of junk. Otherwise, either your dropper or your recovery vehicle\u0027s going to have to make a plane change. Also, I have never tried to use a Klaw to hold onto something during reentry: tests are called for.\u003C/p\u003E\u003Cp\u003EOf course, in terms of time efficiency, silly parts-test contracts probably get you more money per hour of game time, so a hyper-optimizer would just leave stuff in space. The real answer is \u0022Do you find this fun?\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETBH, it\u0027s more that I want to clear up LKO, and wanted to design stuff to do it. Then the dropper hit me as an idea.\u003C/p\u003E\u003Cp\u003EIf it\u0027s not going to make sense economically, I\u0027ll just save the Droppers for hooking onto asteroids I land. Grabbers can just serve their original purpose of shunting stuff sub-orbital before pushing back to an orbit themselves.\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2014-11-20T10:37:59Z","Content":"\n\u003Cp\u003EAnother two ways:\u003C/p\u003E\u003Cp\u003E1. An orbital thug with ion engine/solar battery. Comes to an object, grabs it, decreases their periapsis to, say, 50 km, releases, increases its own orbit.\u003C/p\u003E\u003Cp\u003E2. BahamutoD Armory or Romfarer Lazor System.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-11-20T11:30:50Z","Content":"\n\u003Cp\u003EThe Grabber is the orbital tug. Nuclear engine on a big fuel tank.\u003C/p\u003E\u003Cp\u003EXenons are actually a little impractical, because I\u0027m using Kethane. Rocket fuel is literally free, since I can just tap it off the Muns.\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2014-11-20T11:45:18Z","Content":"\n\u003Cp\u003EIon has better ISP, so is more efficient for this auxiliary job. LV-N is not much better than chemical ones. So, ion thug needs less supply flights to refuel.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-20T12:26:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EEven if you made the claw a resuable tool, you have to spend fuel to catch it, spend fuel to dock with it, spend fuel to deorbit it, and then spend fuel to re-orbit the claw tool and then spend fuel to refuel the claw tool.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA typical tank is like eight or ten times as expensive as the fuel that it holds. If the claws go up on a vessel that is itself 100% recoverable, this could be worthwhile.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003ENot to mention the time you spend doing all that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, that\u0027s a serious objection.\u003C/p\u003E\u003Cp\u003EAlso, about ion engines: Xenon is fiendishly expensive. It works out well for small vessels, but as mass increases, you pretty soon come to the point where LV-Ns or even ordinary engines are much more cost-efficient -- even if you backtrack all cost down to the launchpad.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-11-20T14:29:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso, about ion engines: Xenon is fiendishly expensive. It works out well for small vessels, but as mass increases, you pretty soon come to the point where LV-Ns or even ordinary engines are much more cost-efficient -- even if you backtrack all cost down to the launchpad.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, plus I\u0027d have to launch it all from Kerbin. With liquid fuel, I can just mine it on the Mun for free, and ship it from there. Then there\u0027s the time xenon burns take.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2014-11-20T19:33:59Z","Content":"\n\u003Cp\u003EI did something similar to your idea last week in order to de-orbit an obsolete station in LKO. Basically, a claw attached to a fuel tank with a 38-7s (the tiny engine) to push it around, and a bunch of chutes around the fuel tank.\u003C/p\u003E\u003Cp\u003EI detached a single module and sent it down with a De-Orbiter and it worked great. Very little damage to the station module, but not very cost effective. Fun, tho.\u003C/p\u003E\u003Cp\u003ENext I tried to bring down two modules while they were still attached. Brought it down to the atmosphere fine, started aerobraking fine, but when the chutes fully deployed at 500m, the weight of the station modules caused it to rip away from the claw and fall into the ocean, destroying all of it.\u003C/p\u003E\u003Cp\u003ESo basically, be careful, but it can be done.\u003C/p\u003E\n"}]}