{"TopicId":90923,"ForumId":70,"TopicTitle":"Can\u0026#039;t move back to fullscreen after Alt-Tab in force OpenGL mode","CreatedByName":"ebigunso","CreatedById":113229,"CreatedDateTime":"2014-11-21T22:32:36Z","PageNum":1,"Articles":[{"CreatedByName":"ebigunso","CreatedById":113229,"CreatedDateTime":"2014-11-21T22:32:36Z","Content":"\n\u003Cp\u003ESo as in the title, when I Alt-Tab out of the game which was running on full screen, it never lets me go back to fullscreen.\u003C/p\u003E\u003Cp\u003EWhat happens is, I Alt-Tab out and instead of the client completely minimizing, it goes into a windowed mode of the same resolution as when it was running fullscreen, then it never allows me to go back unless I go back to the main menu and toggle the fullscreen option from the graphics settings.\u003C/p\u003E\u003Cp\u003EWhen I did not force OpenGL it was all fine, with the client minimizing as it should and returning to fullscreen afterwards.\u003C/p\u003E\u003Cp\u003EAnybody got the same issue? or any way to fix this?\u003C/p\u003E\u003Cp\u003EJust a note: I can\u0027t run the game without forcing OpenGL now with so many mods, that it crashes the game on the second vehicle loading in the session if not. With ATM installed.\u003C/p\u003E\n"},{"CreatedByName":"biohazard15","CreatedById":91655,"CreatedDateTime":"2014-11-21T22:50:02Z","Content":"\n\u003Cp\u003ERun the game in borderless window (-popupwindow in shortcut properties); that would make your Alt-Tab experience essentially seamless.\u003C/p\u003E\u003Cp\u003EAnd yes, OpenGL has this bug on some systems, mine included.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-11-21T22:57:25Z","Content":"\n\u003Cp\u003EOpenGL isn\u0027t fully supported on Windows by Unity, but it\u0027s worth seeing if this issue has been reported on the Unity3D forums or issue tracker, maybe there\u0027s a workaround.\u003C/p\u003E\u003Cp\u003EOr, try -force-d3d11 instead of openGL \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ebigunso","CreatedById":113229,"CreatedDateTime":"2014-11-21T23:52:47Z","Content":"\n\u003Cp\u003Ethanks guys, now it works perfectly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}