{"TopicId":91207,"ForumId":20,"TopicTitle":"How important is IVA for you?","CreatedByName":"RaptorHunterMz","CreatedById":126564,"CreatedDateTime":"2014-11-25T04:47:52Z","PageNum":1,"Articles":[{"CreatedByName":"RaptorHunterMz","CreatedById":126564,"CreatedDateTime":"2014-11-25T04:47:52Z","Content":"\n\u003Cp\u003EHow do you classify the importance of IVAs?\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-11-25T04:59:11Z","Content":"\n\u003Cp\u003EI prefer IVA to external view, but it\u0027s totally impractical without RPM. Yet another mod that should be stockified ASAP.\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2014-11-25T05:01:11Z","Content":"\n\u003Cp\u003EThere are, of course, IVA purists and I can only consider them masochists at best but for the rest of us I think fully detailed pod environment is still important.\u003C/p\u003E\u003Cp\u003EIt has to be both functional and pleasing enough to the eye.\u003C/p\u003E\u003Cp\u003EI\u0027ve done three missions total 100% IVA and while it was certainly an \u003Cem\u003Einteresting\u003C/em\u003E experience, it\u0027s not something I\u0027d keep on doing for fun. BUt while I was doing those I really wished I had a more detailed interior. Airplanes are probably the only thing I spend flying with over 20% in IVA regularly.\u003C/p\u003E\u003Cp\u003EThank god for RPM.\u003C/p\u003E\u003Cp\u003EThat said, I don\u0027t think photorealism is warranted with IVA.\u003C/p\u003E\n"},{"CreatedByName":"RaptorHunterMz","CreatedById":126564,"CreatedDateTime":"2014-11-25T05:24:07Z","Content":"\n\u003Cp\u003EAnyone willing to create IVA meshes for my 3.75 6 Kerbals deep space pod?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IFO1WDs.jpg\u0022 alt=\u0022IFO1WDs.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2014-11-25T05:42:20Z","Content":"\n\u003Cp\u003EWas \u003Cem\u003Ethat\u003C/em\u003E the point of this thread? Should have asked right-off.\u003C/p\u003E\u003Cp\u003EYou\u0027d be better asking in Add-On Development or its sub forums.\u003C/p\u003E\n"},{"CreatedByName":"RaptorHunterMz","CreatedById":126564,"CreatedDateTime":"2014-11-25T05:53:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Axelord FTW\u0022 data-cite=\u0022Axelord FTW\u0022\u003E\u003Cdiv\u003EWas \u003Cem\u003Ethat\u003C/em\u003E the point of this thread? Should have asked right-off.\u003Cp\u003EYou\u0027d be better asking in Add-On Development or its sub forums.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a mod I want to publish so I wanted to know how much people care about IVAs. Although the sample so far is small I think people care about IVAs.\u003C/p\u003E\n"},{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2014-11-28T02:04:18Z","Content":"\n\u003Cp\u003EI like a nice IVA. I find it adds immersion to the game, but you don\u0027t really need one. If you\u0027ve got a good forward view some people may use it for docking, but it will always be a small segment of the total users and even people that like IVA don\u0027t use it all the time. Pretty much anything you can do from IVA you can do better from the external view. \u003C/p\u003E\u003Cp\u003EIf the rest of the model is done and working properly, (hatches, ladders, nodes, ect) I\u0027d say release it without the IVA. If people like it you should have an easier time finding someone to do the IVA for you. Or you could start working on building your own IVA and update the model when you get it done.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2014-11-28T02:25:51Z","Content":"\n\u003Cp\u003EFor me, there are enough stock parts without IVAs.. If a Kerbal-containing mod part doesn\u0027t have an IVA, it would have to provide something pretty darned significant for me to want to install it.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-11-28T08:21:20Z","Content":"\n\u003Cp\u003EFor me, I found IVA pointless and useless, it\u0027s just a costly (from memory point of view) eye candy.\u003C/p\u003E\u003Cp\u003EUseless cause in the mk1 cockpit for example, seat is ridiculously too low, you can do nothing except waching around so this is just for 5 mins enjoyment seeing stupid smiles of kebals or sticky notes.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-11-28T13:33:08Z","Content":"\n\u003Cp\u003EThe poll is poorly constructed. Of course out of the choices I\u0027d prefer one of the last 2. If the poll was instead:\u003C/p\u003E\u003Cp\u003E\u0022How often do you actually use IVAs\u0022 I\u0027d answer whatever was next after \u0022never.\u0022 Something like \u0022To take the occasional screenshot or read the post-its once or twice.\u0022\u003C/p\u003E\n"},{"CreatedByName":"thylordroot","CreatedById":115008,"CreatedDateTime":"2014-11-28T16:59:39Z","Content":"\n\u003Cp\u003EIVA view does have at least one perk to it (which is the radar altimeter). I used to use IVA mode for landing so that I had a reasonable idea when I should start braking. Now that I have KER, I find myself not doing this so often. I certainly don\u0027t complain when a mod author includes a cockpit in a command pod, but I don\u0027t use it all that much.\u003C/p\u003E\u003Cp\u003EI agree with 5thHorseman with respect to the poll, as it answers a subtly different question than the one you are asking. It instead asks, \u0022How detailed should IVA mode be?\u0022. Analogously, this is like trying to answer \u0022Do you like pizza?\u0022 by asking \u0022What toppings do you like on your pizza?\u0022, and then assuming that \u0022no toppings\u0022 might indicate that I do not like pizza. I think many of us have answered the question from the perspective that you were actually asking \u0022When IVA is implemented in command pods, what level of detail do you prefer?\u0022\u003C/p\u003E\u003Cp\u003EOf course there is also the argument that command pods have IVA by default, and as far as I know, this is an attribute that every command pod has. I can think of a few corner cases (like the lab module), but I do not think this is technically considered a command pod by the game. I think in this light, 5thHorseman\u0027s question could be simplified to \u0022What is the minimum level of effort you expect concerning IVA view in a command pod?\u0022, which seems to be the question you really want to know the answer to because you appear to be trying to find out whether or not implementing IVA is worth the effort for your part.\u003C/p\u003E\u003Cp\u003ETo that question, my answer is \u0022none\u0022. I don\u0027t complain when IVA mode is available, but considering that we are still less a cockpit in some stock parts, I think it\u0027s forgivable that IVA view on your new part is a secondary concern.\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-11-29T03:52:36Z","Content":"\n\u003Cp\u003EThis is in the wrong subforum.\u003C/p\u003E\n"},{"CreatedByName":"beabop","CreatedById":128715,"CreatedDateTime":"2014-11-29T04:28:39Z","Content":"\n\u003Cp\u003EI don\u0027t use IVAs often because I find them harder to use. In third person, I can glance down at the navball with my eyes. IVA, I have to hold right click, drag down, stabilize my view on the navball, look, drag up, stabilize my view again on the windows. Plus most have \u003Cem\u003Etiny\u003C/em\u003E windows.\u003C/p\u003E\u003Cp\u003EI would like IVAs that are as good as real cockpits - all the instruments you need (no vertical speed indicator in stock!), a HUD, and a decent view.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-11-29T04:51:15Z","Content":"\n\u003Cp\u003EStock IVAs and prop modules are half-baked at best. if it wasn\u0027t for RPM, I wouldn\u0027t bother making IVAs at all.\u003C/p\u003E\n"},{"CreatedByName":"RaptorHunterMz","CreatedById":126564,"CreatedDateTime":"2014-12-02T22:44:38Z","Content":"\n\u003Cp\u003ECommand Pod is done, with a simple IVA, almost all objects and props are from vanilla parts. Give it a try.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/101836-Raptor-AeroEspacial-Kerbal-Transportation-System?p=1574057#post1574057\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/101836-Raptor-AeroEspacial-Kerbal-Transportation-System?p=1574057#post1574057\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sli 41","CreatedById":129508,"CreatedDateTime":"2014-12-02T23:26:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003EStock IVAs and prop modules are half-baked at best. if it wasn\u0027t for RPM, I wouldn\u0027t bother making IVAs at all.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBasically this, RPM and external cameras RADICALLY change the IVA experience, but it\u0027s still not quite what it could be. I\u0027ll just say if there was a really easy way to play in first person, with fully functional IVAs I don\u0027t think I would go back to 3rd person. Right now third person is still a lot more convenient.\u003C/p\u003E\n"}]}