{"TopicId":91282,"ForumId":44,"TopicTitle":"For Questions That Don\u0026#039;t Merit Their Own Thread","CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-11-26T04:12:34Z","PageNum":326,"Articles":[{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-11-21T14:03:06Z","Content":"\n\u003Cp\u003E\nWi-fi missiles. They don\u0027t need physical lines to connect to the tank.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-11-21T15:03:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201079\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669039386\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n59 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWi-fi missiles. They don\u0027t need physical lines to connect to the tank.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPeople will still complain of bad connection\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-11-21T15:26:02Z","Content":"\n\u003Cp\u003E\nQuestion for the smart guys: \u003Cstrong\u003Ehow does something so diffuse as the gasses between galaxies have temperatures in the millions of degrees\u003C/strong\u003E?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#fafbfd;color:#000000;font-size:12px;\u0022\u003EThe Chandra data shows gas in the merging clusters with temperatures of millions of degrees. The optical data shows galaxies in the clusters and other, more distant, galaxies lying behind the clusters. Some of these background galaxies are highly distorted because of\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://chandra.harvard.edu/resources/illustrations/gravitational.html\u0022 rel=\u0022external nofollow\u0022 style=\u0022background-color:#fafbfd;color:#3673c8;font-size:12px;\u0022\u003Egravitational lensing\u003C/a\u003E\u003Cspan style=\u0022background-color:#fafbfd;color:#000000;font-size:12px;\u0022\u003E, the bending of light by massive objects. This effect can also magnify the light from these objects, enabling astronomers to study background galaxies that would otherwise be too faint to detect. Finally, the structures in the radio data trace enormous shock waves and turbulence. The shocks are similar to\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022http://hte.si.edu/waves.html\u0022 rel=\u0022external nofollow\u0022 style=\u0022background-color:#fafbfd;color:#3673c8;font-size:12px;\u0022\u003Esonic booms\u003C/a\u003E\u003Cspan style=\u0022background-color:#fafbfd;color:#000000;font-size:12px;\u0022\u003E, generated by the mergers of the clusters.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022frontier.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022432\u0022 width=\u0022864\u0022 src=\u0022https://chandra.harvard.edu/photo/2016/frontier/frontier.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://chandra.harvard.edu/photo/2016/frontier/\u0022 rel=\u0022external nofollow\u0022\u003EChandra :: Photo Album :: Frontier Fields Galaxy Clusters :: March 10, 2016 (harvard.edu)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57710-k2/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257710\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57710-k2/\u0022 rel=\u0022\u0022\u003E@K^2\u003C/a\u003E - you still here?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-21T16:19:19Z\u0022 title=\u002211/21/2022 04:19  PM\u0022 data-short=\u00221 yr\u0022\u003ENovember 21, 2022\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerwood Floyd","CreatedById":99768,"CreatedDateTime":"2022-11-21T16:19:00Z","Content":"\n\u003Cp\u003E\nI am far from a smart guy (I get the feeling you\u0027re smarter than I am) but . . .\n\u003C/p\u003E\n\u003Cp\u003E\nI think the secret is that temperature and heat are not exactly the same thing. I remember once reading a similar discussion wherein a smart guy pointed out that, while the average temperature of North Atlantic water is not much above freezing, it still contains a tremendous amount of heat energy. In a similar way, I think those interstellar clouds of gas contain very little heat energy while having a high temperature.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-11-22T19:04:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201106\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669044362\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/21/2022 at 10:26 AM, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nQuestion for the smart guys: \u003Cstrong\u003Ehow does something so diffuse as the gasses between galaxies have temperatures in the millions of degrees\u003C/strong\u003E?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://chandra.harvard.edu/photo/2016/frontier/frontier.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022frontier.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 data-ratio=\u002250.00\u0022 height=\u0022432\u0022 width=\u0022864\u0022 src=\u0022https://chandra.harvard.edu/photo/2016/frontier/frontier.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://chandra.harvard.edu/photo/2016/frontier/\u0022 rel=\u0022external nofollow\u0022\u003EChandra :: Photo Album :: Frontier Fields Galaxy Clusters :: March 10, 2016 (harvard.edu)\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, temperature and pressure are funny things. The temperature of a gas is really just a way of measuring the average kinetic energies of the molecules in the gas, and pressure is simply the average impulse per unit time produced by molecular collisions against a given internal area. Let\u0027s suppose the temperature in your room is 25°C. The individual air molecules you\u0027re breathing in and out right now are zipping around the room at around 500 m/s . . . some a little faster, some a little slower. For an average adult male, you\u0027re experiencing about 3.68e27 of these collisions every second. You feel these collisions and their kinetic energy as a combination of pressure and temperature.\n\u003C/p\u003E\n\u003Cp\u003E\nWe could, however, increase the temperature in the room while decreasing the pressure. When we do that, you\u0027ll have fewer collisions (so you feel less pressure), but each collision will deposit more thermal energy in you. Because there will be fewer collisions, you\u0027ll gain heat much more slowly, but you\u0027ll definitely feel yourself getting hotter.\n\u003C/p\u003E\n\u003Cp\u003E\nEventually, the oxygen partial pressure would be too low for you to maintain blood oxygenation, and you\u0027d suffocate (and roast) simultaneously. Not fun.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I have a box of gas with an internal heat source (let\u0027s say a thermostatic electrical resistance heater) and I begin to add thermal energy to it, those molecules gain kinetic energy and begin zipping around the inside of the box faster and faster. As long as that box remains closed, the molecules will pick up more and more speed as I add more and more energy to the box. As those molecules bounce around the inside of the box, inelastic collisions with the box transfer some of their kinetic energy to thermal energy in increasing the temperature of the box. Eventually, the temperature of the outside of the box will reach the same temperature as the resistance heater, and the system will be in equilibrium.*\n\u003C/p\u003E\n\u003Cp\u003E\nNote that this process is independent of the AMOUNT of gas inside the box. It will still work whether I only have 1 milligram of air molecules inside the box (about 2e19 physical molecules) or if I\u0027ve pumped 10 grams of air molecules inside the box (2e22 physical molecules). However, it won\u0027t work at the same \u003Cem\u003Erate\u003C/em\u003E. If there are more air molecules, there will be more frequent collisions, and so the thermal energy will propagate much faster. \n\u003C/p\u003E\n\u003Cp\u003E\nBut you can see here, again, that temperature is independent of pressure. The box with just 1 milligram of air molecules may have the exact same temperature (average molecular kinetic energy) as the box with 10 grams of air molecules, but the latter box will have a much higher internal pressure (because, again, pressure is simply the average impulse per unit time produced on a given internal area of the container, and there are 1000 times as many air molecules in the latter box, resulting in 1000 times as much pressure).\n\u003C/p\u003E\n\u003Cp\u003E\nWhat happens if we open those boxes? Well, assuming that the temperature inside both boxes is much higher than the temperature of the surroundings, that means the velocity of the air molecules is much higher inside. Those air molecules will all immediately zip off in every direction and be replaced by the slower-moving air molecules in the room. Granted, those high-speed air molecules will still be in the room, at least until they bounce into other air molecules a couple billion times and lose speed, but because the temperature within a gas is based on the average molecular kinetic energy within a volume, the actual temperature of the room will only increase slightly.\n\u003C/p\u003E\n\u003Cp\u003E\nThe gases between galaxies in dense galaxy clusters are very diffuse, but the molecules are moving extremely fast: on the order of 200 km/s or even higher. And while there\u0027s not much for them to bump into, everything else they\u0027re bumping into is ALSO moving at 200 km/s or higher, so it\u0027s not like they slow down. The gas cloud may be very diffuse, but it\u0027s still very, very hot. And inside a gravity cluster, local gravity keeps it from escaping, so. . .there you go.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Csub\u003E*Of course, it\u0027s not actually in equilibrium, because the box in turn will lose thermal energy to its surroundings. Even if the box is thermodynamically isolated from its surroundings, it will lose energy to blackbody radiation. But we\u0027re ignoring that for the time being.\u003C/sub\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-11-22T19:16:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201120\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669047540\u0022 data-ipsquote-userid=\u002299768\u0022 data-ipsquote-username=\u0022Kerwood Floyd\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/21/2022 at 11:19 AM, Kerwood Floyd said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI remember once reading a similar discussion wherein a smart guy pointed out that, while the average temperature of North Atlantic water is not much above freezing, it still contains a tremendous amount of heat energy. In a similar way, I think those interstellar clouds of gas contain very little heat energy while having a high temperature.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo in a sense you\u0027re correct, but probably not for the reason you\u0027re thinking. The North Atlantic is not much above freezing, but a difference of even one degree spread through 146 cubic kilometers of ocean water is 1.46e17 joules: almost as much as the blast yield of the Tsar Bomba hydrogen bomb. So that\u0027s not quite right.\n\u003C/p\u003E\n\u003Cp\u003E\nIntergalactic gas clouds in a galaxy cluster are at an extraordinarily high temperature. They also contain an extraordinary amount of heat energy. However, that energy is not concentrated because the clouds are very diffuse; 1 cubic meter of space may only contain about 1000 particles. A cubic meter of air at the surface of Earth contains 2.46e25 particles. So the heat energy per unit volume is low, but the temperature is extremely high and the total heat energy is extremely high.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that just because the density is very low does not mean that the \u0022pressure\u0022 is low. Because of their high molecular velocity, the intergalactic gas clouds in a galaxy cluster exert quite a bit of pressure on anything they hit. Not much by everyday standards here on Earth, but still significant. \n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-11-22T19:56:51Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/157695-sevenperforce/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022157695\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/157695-sevenperforce/\u0022 rel=\u0022\u0022\u003E@sevenperforce\u003C/a\u003E - thanks very much!\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s Interesting... I figured that being diffuse the gasses would very rapidly lose energy and cool to something similar to the background temperature of the vacuum... Of course I assumed that without thinking about the how.  Thinking about the pressure being more closely related to \u003Cem\u003Erate\u003C/em\u003E of heating /cooling did not come into my guesswork. \n\u003C/p\u003E\n\u003Cp\u003E\nIf I understand you correctly, the particles of gas in the box gain energy from either direct contact with the element or the thermal / infrared radiation given off by it.  Similarly, the gas particles constrained by gravity must be either hot from the emission sources (whatever star they were ejected from) or through absorbing thermal radiation from the stars of the galaxies in the cluster - which keeps them hot. \n\u003C/p\u003E\n\u003Cp\u003E\nSo in order to cool, the hot gas particles would have to either hit something else that is cooler (moving towards equalibrium) or cease receiving energy and be able to cool via emissions of their own thermal radiation.  (How\u0027m I doin?) \n\u003C/p\u003E\n\u003Cp\u003E\nThus because they are constrained by gravity in the region of a cluster, the particles are constantly receiving thermal energy radiation and stay hot. \n\u003C/p\u003E\n\u003Cp\u003E\nFurther guessing that whether a ship flying through that region would have to concern itself with the million degrees temperatures melting it would entirely depend on the speed of the craft (which directly affects the rate of collision with the hot particles). \n\u003C/p\u003E\n\u003Cp\u003E\nCool! \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for your time! \n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-11-22T20:41:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201479\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669147011\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI figured that being diffuse the gasses would very rapidly lose energy and cool to something similar to the background temperature of the vacuum... Of course I assumed that without thinking about the how.  Thinking about the pressure being more closely related to \u003Cem\u003Erate\u003C/em\u003E of heating /cooling did not come into my guesswork. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAn object will only lose energy via cooling if it can transfer its thermal energy to something cooler than itself. It can transfer thermal energy kinetically, through elastic collisions, or it can do so electromagnetically through blackbody radiation.\n\u003C/p\u003E\n\u003Cp\u003E\nFor intergalactic gases in a dense galaxy cluster, the gas cloud is doing both of these things. The reason we can see the gas clouds at all with the Chandra x-ray telescope is that the gas clouds are so hot that they\u0027re radiating in the x-ray spectrum. We are quite literally the electromagnetic heat sink for distant galaxies.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you had a dense hot gas cloud in otherwise-empty space, then the gas cloud would expand. If it was heavy enough to have meaningful self-gravitation, this expansion would also cool it, because the kinetic energy of its particles would be converted into gravitational potential energy.* But the gas between galaxies can\u0027t expand because it doesn\u0027t have anywhere to go; it is being squeezed together by the incredible inertia of multiple galaxies.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Csub\u003E*Counter-intuitively, expansion does NOT produce cooling unless the expansion performs some work. That work can be pushing a piston, displacing the gases in a lower-pressure environment, expanding through a de Laval nozzle to produce thrust, or in the case of a giant gas cloud, converting kinetic energy into gravitational potential energy. On the other hand, if I was to spacewalk outside of the ISS and pop a balloon filled with high-temperature, high-pressure gas, all those gas molecules would fly off in every direction with the same average velocity and thus maintain their \u0022temperature\u0022 indefinitely (although they would of course rapidly be lost among all the other diffuse molecules in outer space).  On the other hand, compression does always cause heating, because you cannot compress a gas without applying a force to it and thus performing work, which adds energy.\u003C/sub\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201479\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669147011\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf I understand you correctly, the particles of gas in the box gain energy from either direct contact with the element or the thermal / infrared radiation given off by it.  Similarly, the gas particles constrained by gravity must be either hot from the emission sources (whatever star they were ejected from) or through absorbing thermal radiation from the stars of the galaxies in the cluster - which keeps them hot.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, what\u0027s heating up the gas particles in this instance is the fact that they are being compressed by the inertia of the galaxies that are being dragged together by gravity.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022300px-Disco_lights_from_a_galaxy_cluster\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022300\u0022 width=\u0022300\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Disco_lights_from_a_galaxy_cluster.jpg/300px-Disco_lights_from_a_galaxy_cluster.jpg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere are four different galaxy clusters (or subclusters) presently colliding with each other in this image. Subcluster B is smashing into subclusters A, C, and D at a speed of approximately 3,000 kilometers per second. That is the incredible pressure which squoze (as far as I\u0027m concerned, that\u0027s the technical term) the gas between the galaxies to a temperature of 90 millionºC.\n\u003C/p\u003E\n\u003Cp\u003E\nThus the gas clouds in the cluster are much hotter and thus much greater emitters of light than the stars around them.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201479\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669147011\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nin order to cool, the hot gas particles would have to . . . cease receiving energy and be able to cool via emissions of their own thermal radiation.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHere\u0027s where it gets a little complicated. Individual molecules can\u0027t \u0022cool\u0022  by thermal radiation; their temperature is simply their velocity, and all velocities are relative, so they have no way of knowing how \u0022fast\u0022 they are going in the first place. In addition, because energy is quantized, they wouldn\u0027t be able to \u0022cool\u0022 gradually at all; atoms and molecules can only emit or absorb specific lights within specific wavelengths corresponding to their energy states.\n\u003C/p\u003E\n\u003Cp\u003E\nThermal radiation, more properly known as blackbody radiation, occurs on the order of macroscopic objects comprising many particles such that there are many many energy levels and atomic transitions and so the radiation they emit follows a certain distribution. The gas cloud as a whole is of course emitting a bunch of blackbody radiation, as noted above, but that blackbody radiation is a distribution of photons produced by innumerable collisions between individual gas molecules and atoms.\n\u003C/p\u003E\n\u003Cp\u003E\nIt should be noted that in this sort of a situation, there are no molecules to speak of. The temperature is far, far too high for covalent bonds; it\u0027s all a diffuse plasma. At lower temperatures, blackbody radiation can be produced by atomic transitions; two atoms smack into each other, raising the energy state of the electrons in both atoms, and as those electrons collapse back to their lowest energy, they release photons in frequencies corresponding to those different energy states. However, in this sort of extreme situation, the distribution of photons is dominated by the \u003Cem\u003EBremsstrahlung\u003C/em\u003E process, where a charged particle moving at high speed loses energy and releases a photon when it passes through an electric field.  The dominant luminous component in a galaxy cluster is thermal \u003Cem\u003Ebremsstrahlung\u003C/em\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\nNo matter how fast it is going, a particle cannot produce \u003Cem\u003Ebremmstrahlung\u003C/em\u003E radiation by itself. It has to interact with another particle.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201479\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669147011\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nguessing that whether a ship flying through that region would have to concern itself with the million degrees temperatures melting it would entirely depend on the speed of the craft\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nConsidering that this region is producing thermal x-rays visible at a distance of 5.4 billion light years, the \u0022temperature\u0022 of the cloud is not going to be the primary problem for your hypothetical spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\nThe thermal radiation transferred to the spaceship would melt it six times faster than if it was at the center of the sun.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-11-22T22:08:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201492\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669149704\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe thermal radiation transferred to the spaceship would melt it six times faster than if it was at the center of the sun.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLaughing *literally* out loud!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m learning a lot from what you\u0027ve written.  Thinking of a gas cloud as a \u0027body\u0027 and that the emissions we\u0027re reading from them are blackbody just flipped my brain a little bit.  (Can we even call it properly a \u0027gas\u0027 cloud?  Plasma cloud?)   If pressed I would have said we were seeing reflected emissions from the conglomeration of stars and BHs within the galaxies.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d also breezed past what Chandra was telling us - of course it\u0027s x-ray, and thus highly energetic.  Intergalactic space now seems a lot more dangerous than I\u0027d given it credit for!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201492\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669149704\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003EThe reason we can see the gas clouds at all with the Chandra x-ray telescope is that the gas clouds are so hot that they\u0027re radiating in the x-ray spectrum...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nConsidering that this region is producing thermal x-rays visible at a distance of 5.4 billion light years, the \u0022temperature\u0022 of the cloud is not going to be the primary problem for your hypothetical spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003EWe are quite literally the electromagnetic heat sink for distant galaxies.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\neep!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201492\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669149704\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHere\u0027s where it gets a little complicated. Individual molecules can\u0027t \u0022cool\u0022  by thermal radiation; their temperature is simply their velocity, and all velocities are relative, so they have no way of knowing how \u0022fast\u0022 they are going in the first place. In addition, because energy is quantized, they wouldn\u0027t be able to \u0022cool\u0022 gradually at all; atoms and molecules can only emit or absorb specific lights within specific wavelengths corresponding to their energy states.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis part I\u0027m gonna have to wrestle with a bit.  Because what you\u0027re describing is a lot like what I\u0027ve thought I understood about light.  You use the word molecule above - and I figured a hydrogen atom in a gas (skipping over the plasma part for now) would behave a lot more like regular matter than something like a photon.  Just as a rock can have a temperature, I figured the constituent atoms would have a fraction of that... but now as I type this I\u0027m remembering the phrase \u0027excited state\u0027 which I guess can be read as \u0027velocity\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if I have a hot gas in a balloon, I\u0027m guessing the temperature isn\u0027t measured in the atom itself, but rather by its velocity which is reflected by the hot gas expanding the balloon more than the same amount of cool gas - by kinetic force?  Thinking of the temperature of the gas as not something that is a combination of all of the individual molecule\u0027s temperature writ large, but rather as a function of the combined molecular velocity? [Mind blown emoji]\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s an unrelated question:  If a mix of gasses ejected from stars gets heated up to the point it all phases into a plasma... if that plasma cools, does it phase back into the original atoms?  \n\u003C/p\u003E\n\u003Cp\u003E\nSo when a star goes SN and creates a cloud of dust and gasses - if that cloud gets heated to such extremes that it phase changes into a plasma... how is the information retained of what it started as?  Can you say \u0027hydrogen plasma\u0027 and \u0027oxygen plasma\u0027 in any meaningful sense... or is plasma just plasma?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-22T22:09:12Z\u0022 title=\u002211/22/2022 10:09  PM\u0022 data-short=\u00221 yr\u0022\u003ENovember 22, 2022\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2022-11-23T14:14:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201508\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669154888\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHere\u0027s an unrelated question:  If a mix of gasses ejected from stars gets heated up to the point it all phases into a plasma... if that plasma cools, does it phase back into the original atoms?  \n\u003C/p\u003E\n\u003Cp\u003E\nSo when a star goes SN and creates a cloud of dust and gasses - if that cloud gets heated to such extremes that it phase changes into a plasma... how is the information retained of what it started as?  Can you say \u0027hydrogen plasma\u0027 and \u0027oxygen plasma\u0027 in any meaningful sense... or is plasma just plasma?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPlasma is when electrons and nuclei are disassociated, so while you can easily have an oxygen nucleus flying around without electrons, or a hydrogen nucleus flying around without an electron(ie a proton), you could not, for example, have a water nucleus flying around without electrons, as the atoms are held together by the electron interactions, and there are no electrons to hold them together.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, if I remember correctly, electrons are identical, so once the atoms regain the appropriate number of electrons, they are indistinguishable from their pre-plasma state(unless you ionized a more complex molecule, in which case the nuclei could easily swap around and end up paring with different nuclei when \u0027cool\u0027)\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-11-23T14:58:43Z","Content":"\n\u003Cp\u003E\nElectrons! You are ightweight! Your are sqrt(940/0.5) ~= forty times faster than those bulky ions!\n\u003C/p\u003E\n\u003Cp\u003E\nEscape and be free! Let them ions be a dull cloud of pure positiveness.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-11-23T17:21:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201508\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669154888\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201492\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669149704\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHere\u0027s where it gets a little complicated. Individual molecules can\u0027t \u0022cool\u0022  by thermal radiation; their temperature is simply their velocity, and all velocities are relative, so they have no way of knowing how \u0022fast\u0022 they are going in the first place. In addition, because energy is quantized, they wouldn\u0027t be able to \u0022cool\u0022 gradually at all; atoms and molecules can only emit or absorb specific lights within specific wavelengths corresponding to their energy states.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis part I\u0027m gonna have to wrestle with a bit.  Because what you\u0027re describing is a lot like what I\u0027ve thought I understood about light.  You use the word molecule above - and I figured a hydrogen atom in a gas (skipping over the plasma part for now) would behave a lot more like regular matter than something like a photon.  Just as a rock can have a temperature, I figured the constituent atoms would have a fraction of that... \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, for one thing, it\u0027s correct to think of individual atoms behaving more like photons than like clumps of matter. That\u0027s particle-wave duality for you.\n\u003C/p\u003E\n\u003Cp\u003E\nIt might seem counter-intuitive, but individual atoms zipping around freely in a gas can\u0027t have a \u0022temperature\u0022 at all. They\u0027re just particles with some velocity relative to their surroundings. You can think of it in terms of information, if you want: if an atom could have a \u0022temperature\u0022 then where would the information about its temperature be stored? It\u0027s literally just an atom.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201508\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669154888\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nnow as I type this I\u0027m remembering the phrase \u0027excited state\u0027 which I guess can be read as \u0027velocity\u0027.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s not quite right. An atom\u0027s kinetic energy comes from its velocity, which of course is relative to its surroundings. However, energy stored in an excitation state is intrinsic to the atom. The electrons of an atom have orbitals, discrete locations relative to the nucleus at which they can be located. When an atom absorbs energy (either from absorbing a photon of light or from an electromagnetic interaction with another atom during a collision), that \u0022pushes\u0022 the electron up into a higher orbital. The electron will then \u0022fall\u0022 back down to the ground-state orbit, releasing a photon with energy equivalent to the difference in potential energies between the two orbitals.\n\u003C/p\u003E\n\u003Cp\u003E\nA single hydrogen atom with a single electron has 6 different orbitals (n\u003Csub\u003E1\u003C/sub\u003E to n\u003Csub\u003E6\u003C/sub\u003E). When the electron \u0022falls\u0022 to n\u003Csub\u003E1\u003C/sub\u003E from n\u003Csub\u003E2\u003C/sub\u003E, n\u003Csub\u003E3\u003C/sub\u003E, or n\u003Csub\u003E4\u003C/sub\u003E, it releases an ultraviolet photon, when it falls to n\u003Csub\u003E2\u003C/sub\u003E from n\u003Csub\u003E3\u003C/sub\u003E, n\u003Csub\u003E4\u003C/sub\u003E, n\u003Csub\u003E5\u003C/sub\u003E, or n\u003Csub\u003E6\u003C/sub\u003E it releases a visible-light photon, and when it falls to n\u003Csub\u003E3\u003C/sub\u003E from n\u003Csub\u003E4\u003C/sub\u003E, n\u003Csub\u003E5\u003C/sub\u003E, or n\u003Csub\u003E6\u003C/sub\u003E it releases an infrared photon:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022comoving.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002296.93\u0022 height=\u0022632\u0022 width=\u0022652\u0022 src=\u0022https://i.postimg.cc/sDHbTVqW/comoving.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo an atom can store potential energy in excited states, and it can release that energy in the form of photons, but that\u0027s distinct from concepts of \u0022temperature\u0022 which depend only on relative velocity.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201508\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669154888\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThinking of the temperature of the gas as not something that is a combination of all of the individual molecule\u0027s temperature writ large, but rather as a function of the combined molecular velocity? [Mind blown emoji]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExactly right.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201508\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669154888\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf a mix of gasses ejected from stars gets heated up to the point it all phases into a plasma... if that plasma cools, does it phase back into the original atoms?  \n\u003C/p\u003E\n\u003Cp\u003E\nSo when a star goes SN and creates a cloud of dust and gasses - if that cloud gets heated to such extremes that it phase changes into a plasma... how is the information retained of what it started as?  Can you say \u0027hydrogen plasma\u0027 and \u0027oxygen plasma\u0027 in any meaningful sense... or is plasma just plasma?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPlasma isn\u0027t not-atoms. An oxygen plasma is made of oxygen atoms, a hydrogen plasma is made of hydrogen atoms, and a nitrogen plasma is made of nitrogen atoms. Plasma is still very much composed of atoms, they are just atoms which are missing one or more electrons.\n\u003C/p\u003E\n\u003Cp\u003E\nRemember hydrogen, up above? I showed what happens when you add energy to an atom up to the n\u003Csub\u003E6\u003C/sub\u003E orbital. However, if you give that electron enough energy, it will eventually break free of the atomic nucleus altogether, zipping off as a free electron. However, the static electrical charge of the electron and the atomic nucleus want to pull them back together, and so this new state of matter remains electrostatically neutral. Plasma is a state of matter in which at least some of the electrons which would normally be bound to their atomic nuclei have so much energy that they are bouncing around freely between atoms.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s one other issue, though: to be a plasma, you don\u0027t have to have complete electron disassociation. An oxygen atom may only lose a single atom and it would still be part of a plasma. And while \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/139655-terwin/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022139655\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/139655-terwin/\u0022 rel=\u0022\u0022\u003E@Terwin\u003C/a\u003E is correct that you couldn\u0027t have a \u0022water plasma\u0022 because you would first need to break the covalent electron-bonds before stripping off any electrons, that\u0027s not true of all molecules. Diatomic nitrogen\u0027s triple bond is extremely strong, and so you can absolutely have a N*\u003Csub\u003E2\u003C/sub\u003E ion in which the covalent bonds remain but a valence electron has been stripped away.\n\u003C/p\u003E\n\u003Cp\u003E\nIt should be noted that in a plasma-gas cloud that is 90 million degrees, you\u0027re going to have complete disassociation.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201694\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669212856\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nif I remember correctly, electrons are identical, so once the atoms regain the appropriate number of electrons, they are indistinguishable from their pre-plasma state\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep! All electrons are identical, so there\u0027s no difference if they get swapped around from atom to atom.\n\u003C/p\u003E\n"},{"CreatedByName":"Rutabaga22","CreatedById":221143,"CreatedDateTime":"2022-11-23T21:33:20Z","Content":"\n\u003Cp\u003E\n\u003Cimg data-ratio=\u0022109.35\u0022 width=\u0022214\u0022 alt=\u0022image.png\u0022 src=\u0022https://cdn.discordapp.com/attachments/997580829435895830/1045087762883297330/image.png\u0022\u003E\u003Cbr\u003E\nWhat is this on Perseverance? \n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2022-11-23T22:40:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201876\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669239200\u0022 data-ipsquote-userid=\u0022221143\u0022 data-ipsquote-username=\u0022Rutabaga22\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Rutabaga22 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://cdn.discordapp.com/attachments/997580829435895830/1045087762883297330/image.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022image.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u0022109.35\u0022 width=\u0022214\u0022 src=\u0022https://cdn.discordapp.com/attachments/997580829435895830/1045087762883297330/image.png\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\nWhat is this on Perseverance? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is the X-band high-gain steerable antenna used for most downlinks to transmit data back to Earth.\n\u003C/p\u003E\n"},{"CreatedByName":"Rutabaga22","CreatedById":221143,"CreatedDateTime":"2022-11-23T23:58:31Z","Content":"\n\u003Cp\u003E\nWhy is metallic hydrogen metastable? What does metastable even mean?\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2022-11-24T02:38:16Z","Content":"\n\u003Cp\u003E\n#puts on riot helmet and draws sword#\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOk you may proceed to answer that question. \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-11-24T05:10:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201927\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669247911\u0022 data-ipsquote-userid=\u0022221143\u0022 data-ipsquote-username=\u0022Rutabaga22\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Rutabaga22 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy is metallic hydrogen metastable?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt isn\u0027t.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201927\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669247911\u0022 data-ipsquote-userid=\u0022221143\u0022 data-ipsquote-username=\u0022Rutabaga22\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Rutabaga22 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat does metastable even mean?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou put a look on it, and it disappears under its weight.\n\u003C/p\u003E\n\u003Cp\u003E\n(Saying \u0022boo!\u0022 makes same effect.)\n\u003C/p\u003E\n\u003Cp\u003E\nP.S.\u003Cbr\u003E\nHistorically in late XX it was  a hope that if compress some amount of cold hydrogen very-very much under enormous-enormous pressure, a piece of it will stay metallic (and thus dense) even under just-enormous pressure.\n\u003C/p\u003E\n\u003Cp\u003E\nThis would allow to use such hydrogen icicle as an effective particle source to induce more effective fission or even pure fusion reactions, to use it in weapons or maybe later even in nuclear reactors engines.\n\u003C/p\u003E\n\u003Cp\u003E\nBut no further successful studies are known. Either because the idea failed, or vice versa because it succeeded so much that those who know better are either silent, or ever-silent.\n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2022-11-24T06:26:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201927\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669247911\u0022 data-ipsquote-userid=\u0022221143\u0022 data-ipsquote-username=\u0022Rutabaga22\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Rutabaga22 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy is metallic hydrogen metastable? What does metastable even mean?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWith regards to metallic hydrogen, that\u0027s more of a wish and a possibility.\n\u003C/p\u003E\n\u003Cp\u003E\nMetastability means the existence of an equilibrium point alternative to the system\u0027s ground state, so the system can retain potentially useful energy without extern containment. It liberates said energy once knocked out of that states. Ball rolls downhill. \u003Cspan\u003EWood burns. Bombs explode.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022800px-Meta-stability.svg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002258.25\u0022 height=\u0022466\u0022 width=\u0022800\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Meta-stability.svg/800px-Meta-stability.svg.png\u0022\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2022-11-24T12:40:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224201106\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669044362\u0022 data-ipsquote-userid=\u0022154477\u0022 data-ipsquote-username=\u0022JoeSchmuckatelli\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/21/2022 at 7:26 AM, JoeSchmuckatelli said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Ehow does something so diffuse as the gasses between galaxies have temperatures in the millions of degrees\u003C/strong\u003E?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s actually easier at low pressures. I know it sounds unintuitive, but there are two ways a gas molecule (atom, ion...) can lose thermal energy. It either emits a photon or it bumps into something. If the density is low enough, the collisions are going to be very rare. So we\u0027re looking primarily at losses to radiation, and the thing to keep in mind is that at frequencies where emission is high, so is absorption. If a photon is likely to be emitted, it\u0027s likely to be absorbed again, meaning the energy didn\u0027t leave the cloud. So despite potentially being fairly transparent in some wavelengths, the cloud has to be fairly opaque in wavelengths where it can lose energy to radiation, and so it\u0027s mostly going to be radiating from the surface. This is where the square-cube principle comes in, and it\u0027s a LOT of volume that has to lose heat from just the surface. So it shouldn\u0027t surprise you that it takes a very long time for any trapped heat to exit.\n\u003C/p\u003E\n\u003Cp\u003E\nVacuum is a great insulator, after all. We tend to think of that as a feature of something like a thermos bottle, but it\u0027s effectively the same principle for a giant cloud of gas in space, except stretched to interstellar distances.\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-11-24T22:42:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224202091\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669293623\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s actually easier at low pressures. I know it sounds unintuitive, but there are two ways a gas molecule (atom, ion...) can lose thermal energy. It either emits a photon or it bumps into something. If the density is low enough, the collisions are going to be very rare. So we\u0027re looking primarily at losses to radiation, and the thing to keep in mind is that at frequencies where emission is high, so is absorption. If a photon is likely to be emitted, it\u0027s likely to be absorbed again, meaning the energy didn\u0027t leave the cloud. So despite potentially being fairly transparent in some wavelengths, the cloud has to be fairly opaque in wavelengths where it can lose energy to radiation, and so it\u0027s mostly going to be radiating from the surface. This is where the square-cube principle comes in, and it\u0027s a LOT of volume that has to lose heat from just the surface. So it shouldn\u0027t surprise you that it takes a very long time for any trapped heat to exit.\n\u003C/p\u003E\n\u003Cp\u003E\nVacuum is a great insulator, after all. We tend to think of that as a feature of something like a thermos bottle, but it\u0027s effectively the same principle for a giant cloud of gas in space, except stretched to interstellar distances.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis has been a lot more informative of a Q\u0026amp;A than I anticipated.  Always think of the \u0027vacuum of space\u0027 as bitterly cold.  I also figured that we could see the nebular clouds/interstellar dust (what have you), either as backlit shadows, dust lit from within by new stars or reflected light... only. \n\u003C/p\u003E\n\u003Cp\u003E\nIt did not dawn on me to consider that they could be so hot.  To the extent that I would have recognized a temperature difference, I\u0027d have gone back to my knowledge of IR and FLIR systems; where what you can see is a temperature differential.  I can see a nebular cloud being warmer than the background of space... but by that amount?  Very eye opening.\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2022-11-25T00:47:08Z","Content":"\n\u003Cp\u003E\nIs there a term for a word, that when reversed, spells another word?  \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nie Time \u0026amp; Emit. \n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2022-11-25T01:48:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224202364\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669337228\u0022 data-ipsquote-userid=\u002264714\u0022 data-ipsquote-username=\u0022Gargamel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n59 minutes ago, Gargamel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there a term for a word, that when reversed, spells another word?  \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nie Time \u0026amp; Emit. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEmordnilap/semordnilap.\n\u003C/p\u003E\n\u003Cp\u003E\nI’m not even kidding \u003Ca href=\u0022https://savvy-writer.com/words-spelled-backwards-to-form-other-words/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://savvy-writer.com/words-spelled-backwards-to-form-other-words/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2022-11-25T04:13:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224202364\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669337228\u0022 data-ipsquote-userid=\u002264714\u0022 data-ipsquote-username=\u0022Gargamel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Gargamel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there a term for a word, that when reversed, spells another word?  \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nie Time \u0026amp; Emit. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Anadrome\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Anadrome\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2022-11-26T00:25:01Z","Content":"\n\u003Cp\u003E\nHow dependent was the development of spaceflight on German \u003Cem\u003Eresearch\u003C/em\u003E?\n\u003C/p\u003E\n\u003Cp\u003E\nI assume Von Braun and Co. themselves weren’t really necessary because Atlas the ICBM was developed without them.\n\u003C/p\u003E\n\u003Cp\u003E\nI ask as I am writing an alternate history where the US does not participate directly in WWII, and thus all of Germany comes under Soviet control as the war ends with the capture of a redoubt in western Germany rather than Berlin. That’s not to say the Soviets get Von Braun instead- he might still escape to France and his documents were well hidden- but none of the western Allies are getting his documents either.\n\u003C/p\u003E\n\u003Cp\u003E\nSo how would that affect postwar US rocket development?\n\u003C/p\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2022-11-26T03:39:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224202768\u0022 data-ipsquote-contentid=\u002291282\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221669422301\u0022 data-ipsquote-userid=\u0022206402\u0022 data-ipsquote-username=\u0022SunlitZelkova\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, SunlitZelkova said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow dependent was the development of spaceflight on German \u003Cem\u003Eresearch\u003C/em\u003E?\n\u003C/p\u003E\n\u003Cp\u003E\nI assume Von Braun and Co. themselves weren’t really necessary because Atlas the ICBM was developed without them.\n\u003C/p\u003E\n\u003Cp\u003E\nI ask as I am writing an alternate history where the US does not participate directly in WWII, and thus all of Germany comes under Soviet control as the war ends with the capture of a redoubt in western Germany rather than Berlin. That’s not to say the Soviets get Von Braun instead- he might still escape to France and his documents were well hidden- but none of the western Allies are getting his documents either.\n\u003C/p\u003E\n\u003Cp\u003E\nSo how would that affect postwar US rocket development?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t have the sources - but I\u0027ve heard we were \u003Cem\u003Every \u003C/em\u003Edependent upon the people: resident knowledge is \u003Cem\u003Epowerful\u003C/em\u003E.  There are TONS of little \u0027tricks of the trade\u0027 that never get written down.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said - when you know that something is possible, or you have a very good spy network you can figure stuff out or steal the know-how.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a present-day analog you might use to guide you.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-11-26T03:40:08Z\u0022 title=\u002211/26/2022 03:40  AM\u0022 data-short=\u00221 yr\u0022\u003ENovember 26, 2022\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"}]}