{"TopicId":91388,"ForumId":16,"TopicTitle":"What is wrong with this ship?","CreatedByName":"matt3526","CreatedById":72260,"CreatedDateTime":"2014-11-27T13:05:42Z","PageNum":1,"Articles":[{"CreatedByName":"matt3526","CreatedById":72260,"CreatedDateTime":"2014-11-27T13:05:42Z","Content":"\n\u003Cp\u003ETitle says it all really. I piggybacked this rover to Mun orbit. The rockets are to de orbit and land the rover, I then get rid of them when I land. for some reason though, the rockets do nothing. I can\u0027t change the orbit by even a little bit. Also worth mentioning is that when on the launchpad, the rockets have a TWR of about 4, but it won\u0027t take off either.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022\u0022 alt=\u0022\u0026lt;a  href=\u0022\u003E\u003Cimg src=\u0022%7Boption%7D\u0022 class=\u0022ipsImage\u0022 alt=\u0022%7Boption%7D\u0022\u003Ehttp://i.imgur.com/mPS6Lh5.jpg\u0027 alt=\u0027mPS6Lh5.jpg\u0027\u0026gt;\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-28T10:32:59Z\u0022 title=\u002211/28/2014 10:32  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 28, 2014\u003C/time\u003E by matt3526\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-11-27T13:10:55Z","Content":"\n\u003Cp\u003EPress Alt\u002BF2 to open the debug window, see all that damage being done to the cupola? That\u0027s your engines frying your Kerbal \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe thrust is hitting the craft and damaging it, and being blocked so you get nothing.\u003C/p\u003E\u003Cp\u003EAngle the engines or mount them further out and try again.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-11-27T13:11:15Z","Content":"\n\u003Cp\u003EYour thrust is being blocked by the coupala. You need to widen your skycrane.\u003C/p\u003E\u003Cp\u003EAlso, you don\u0027t need both a stack separator and a decoupler, just to turn the decoupler so that the red arrow faces the coupala.\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-11-27T13:12:32Z","Content":"\n\u003Cp\u003EThe rocket exhaust is hitting the structures underneath and being cancelled out.\u003C/p\u003E\u003Cp\u003ETry moving the engines further outboard, I\u0027d recommend modular girders.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-27T13:13:13Z","Content":"\n\u003Cp\u003ESimple: The rover is blocking the exhaust from the rockets! In KSP this results in no net thrust.\u003C/p\u003E\u003Cp\u003EYour options include moving the rockets further apart so their exhaust plumes go past the rover, raising them further up so the plumes spread out before hitting the rover (about the height of an orange tank should do it), or angling the rockets so the plumes go diagonally past the rover.\u003C/p\u003E\n"},{"CreatedByName":"Th3F3aR","CreatedById":124827,"CreatedDateTime":"2014-11-27T13:55:19Z","Content":"\n\u003Cp\u003EThis looks like a typical Kerbal Fry Rocket, it\u0027s Fry day!\u003C/p\u003E\u003Cp\u003EJokes aside, put the rockets in an angle or widen the skycrane, you are basically thrusting on your rover so you heat it up but dont get force to the ground as it is blocked by the rover.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-11-27T18:52:59Z","Content":"\n\u003Cp\u003EHaving solved the immediate problem of the rocket-blast hitting the cupola you should find that it works a little ... too well. Those are big engines for a Mun lander; you may want to change them for 909s, 48-7Ss or even LV-1®s.\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2014-11-27T19:11:39Z","Content":"\n\u003Cp\u003EAlso if I may point out, once you decouple that rover you will have no way of getting the rocket segment off the top of it because the rocket part seems to not have any probe core to it.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-11-27T19:14:42Z","Content":"\n\u003Cp\u003EJust leave them on enough throttle to take off without the rover attached \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-11-27T19:19:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00227499275\u0022 data-cite=\u00227499275\u0022\u003E\u003Cdiv\u003EAlso if I may point out, once you decouple that rover you will have no way of getting the rocket segment off the top of it because the rocket part seems to not have any probe core to it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell there\u0027s always the \u0022press Z, then spacebar really quickly\u0022 trick. It doesn\u0027t have to be guided to fly.\u003C/p\u003E\u003Cp\u003EMight not be practical with the current skycrane (too much thrust, might get too much height), but the skycrane could stand to lose some thrust anyways (or, more precisely, lose some excess engine mass).\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-27T21:10:58Z","Content":"\n\u003Cp\u003EOr just drive out and the skycrane will simply tumble off. Or get the Kerbal out and give it a shove.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-11-27T23:27:04Z","Content":"\n\u003Cp\u003EDon\u0027t forget that the cupola isn\u0027t exactly the lightest thing around, I wouldn\u0027t reduce thrust TOO much. Once you\u0027re down, you can probably just come to a hover or near-hover, trigger the decoupler, and watch that thing sail away (till it clears physics range, then it\u0027s coming right back down...)\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-11-28T00:30:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryxal\u0022 data-cite=\u0022Kryxal\u0022\u003E\u003Cdiv\u003EDon\u0027t forget that the cupola isn\u0027t exactly the lightest thing around...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was made considerably lighter in 0.25\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2014-11-28T00:44:40Z","Content":"\n\u003Cp\u003EI\u0027m not sure if it\u0027s mentioned before but the exhaust of the rockets is blocked by the cupola.\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2014-11-28T02:16:26Z","Content":"\n\u003Cp\u003EIt hasn\u0027t been mentioned yet (HOW?) but also you are going to have to turn the gimbals off on those rockets. Otherwise you will quickly lose control. That is because the COM is probably below them, or will be as you burn fuel. The controls will all be backwards.\u003C/p\u003E\n"},{"CreatedByName":"matt3526","CreatedById":72260,"CreatedDateTime":"2014-11-28T10:32:10Z","Content":"\n\u003Cp\u003EThanks for the suggestions everyone, moving the engines further out did the trick. To those wondering, I power up the engines and then separate them so that they fly off. Then I drive away. Also thanks Taki117 for the advice with the decoupler, that worked a treat \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}