{"TopicId":91427,"ForumId":70,"TopicTitle":"number of issues running KSP on Linux Ubuntu","CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2014-11-27T23:50:04Z","PageNum":1,"Articles":[{"CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2014-11-27T23:50:04Z","Content":"\n\u003Cp\u003EHello KSP community,\u003C/p\u003E\u003Cp\u003ESo I am a religious player of KSP, and after being fed up with the memory restrictions of KSP on Windows, I decided to install Ubuntu in dual boot on my PC just for KSP. Note, I am a IT professional of almost 10 years, I\u0027ve had formal education and training in UNIX, so I\u0027m very familiar with the environment, I just haven\u0027t dabbled with Linux in a good 5 years or so now. I should also mention, I have a very high end water cooled computer, so I am trying to get past the restrictions of windows/memory issues so I can fully enjoy this game with as many mods as I want. Anyway, for a quick breakdown, here are the issues I am currently having in KSP:\u003C/p\u003E\u003Cp\u003E1) \u003Cstrong\u003ECamera movement stuttering\u003C/strong\u003E - okay, so my game has a silky smooth framerate in terms of flying, maneuvering, and everything else. But I am having a problem, as soon as I move my camera, the game gets horrendous stuttering/framerate issues. I\u0027m not sure why, it only happens when I manually pan the camera around my ship using the right mouse button. Has anyone else had this issue yet? If I move it slow, it doesn\u0027t do it as bad. \u003C/p\u003E\u003Cp\u003E2) \u003Cstrong\u003EDelayed throttle\u003C/strong\u003E - like I said, my game appears to be running great, but sometimes my throttle up/down feels delayed, I think it might have something to do with the deltatime setting. Anyone else have this issue in Linux? This is a minor issue. My game doesn\u0027t seem to lag or anything so much as it feels like there is some kind of input delay.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3) Steam Overlay / alt-tab issues\u003C/strong\u003E - so something weird is going on with my KSP, and this is probably the biggest/annoying issue on Linux so far. Number one, my steam overlay isn\u0027t working correctly, I can\u0027t even take screenshots. When I try to load it or alt tab out of my game (including trying to put it in windows mode with alt \u002B enter), my game flickers in a pink screen and gets stuck on KSP. Basically, I cannot get out of KSP without completely shutting the game. Kind of annoying if I want to check an email quick or message someone on steam. Anyone have any issues minimizing KSP on Linux?\u003C/p\u003E\u003Cp\u003EI am running an AMD machine with an AMD Graphics card. To be exact, I am running the FX 8350 overclocked to 5Ghz and my graphics card is the Radeon HD 7950. I installed AMD\u0027s propreitary drivers for the GPU as I noticed my anti-aliasing wasn\u0027t working. Even after doing so, however, it still don\u0027t work. I now force my games to use AA via AMD catalyst control center. The steam and alt-tab problems didn\u0027t seem to occur before I installed the radeon / catalyst drivers, maybe that has something to do with it? Overall, things are getting better, I at least go to play the game for a bit. If I can just fix the camera stutter and possibly the alt-tab problem that would be great.\u003C/p\u003E\n"},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-11-28T18:07:58Z","Content":"\n\u003Cp\u003ECant help you much on the first two issues but i know a little about the last one. If i recall correctly after you press alt\u002Btab you can click in any other quadrant of the screen besides the one KSP is running in and switch to another workspace. Its hard to explain but i think it\u0027s one of many quirks with the proprietary drivers.\u003C/p\u003E\n"},{"CreatedByName":"Maars","CreatedById":125934,"CreatedDateTime":"2014-11-30T00:59:42Z","Content":"\n\u003Cp\u003Ethis is no help at all, just another voice that has the same problems, albeit with a twist: i have the same stuttering while moving the camera round yet i also have a big drop in framerate when i have the GUI visible, so when i press F2 and get rid of the GUI my framerate jumps to a smoother and playable ksp. have no idea what it is but it\u0027s the last thing that i need to iron out in order to achieve a seamless ksp experience\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-11-30T21:14:14Z","Content":"\n\u003Cp\u003EApparently the AMD drivers for Linux are abysmal, which is probably the root of some of your problems. Also, Steam forces KSP to launch with absurd, out-of-date libraries, so you want to launch KSP directly.\u003C/p\u003E\n"},{"CreatedByName":"nalitia","CreatedById":117727,"CreatedDateTime":"2014-11-30T22:37:39Z","Content":"\n\u003Cp\u003EI see the #1 problem on Linux x64 with many mods, with my nVidia card. It doesn\u0027t happen with an unmodded install. I removed a portion of my mods temporarily and saw the issue lessen, but not eliminated. The part count of a craft doesn\u0027t seem to affect the camera-related stutter. Everything renders fine when using the keys to move the camera. I\u0027m not sure if there\u0027s a single mod responsible for it or if it\u0027s just poor performance under high memory conditions on Linux with Unity.\u003C/p\u003E\n"},{"CreatedByName":"Maars","CreatedById":125934,"CreatedDateTime":"2014-12-01T15:17:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nalitia\u0022 data-cite=\u0022nalitia\u0022\u003E\u003Cdiv\u003EI see the #1 problem on Linux x64 with many mods, with my nVidia card. It doesn\u0027t happen with an unmodded install. I removed a portion of my mods temporarily and saw the issue lessen, but not eliminated. The part count of a craft doesn\u0027t seem to affect the camera-related stutter. Everything renders fine when using the keys to move the camera. I\u0027m not sure if there\u0027s a single mod responsible for it or if it\u0027s just poor performance under high memory conditions on Linux with Unity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat\u0027s exactly what\u0027s happening with my gtx750 NVidia. ok, time to go problem mod hunting tonight and bash out those mods one by one. ooooh, this is gonna take a loooong time and totally suck but I hope that I find a culprit... and hopefully it\u0027s not some essential mod like FAR or infernal or B9 or .. actually, almost every mod I have is \u0027essential\u0027. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E if I had to choose a mod to sacrifice it could be NavHud or maybe TAC self destruct. haha\u003C/p\u003E\n"},{"CreatedByName":"nalitia","CreatedById":117727,"CreatedDateTime":"2015-01-25T01:44:19Z","Content":"\n\u003Cp\u003EI noticed that camera stuttering was only happening when the UI was enabled. When I\u0027d hit F2 to shut it off for a screenshot, the framerate shot back up. Try cutting back on UI-related mods, and close windows when they aren\u0027t needed. I noticed that Contract Window\u002B slows everything to a crawl.\u003C/p\u003E\n"},{"CreatedByName":"BoJaN","CreatedById":28739,"CreatedDateTime":"2015-02-13T02:30:14Z","Content":"\n\u003Cp\u003EI\u0027m having the exact same issue as #1, I\u0027ve determined it\u0027s not a problem with the camera movement but a problem with clicking and dragging, Even a left mouse drag causes horrible stuttering. Rotating the camera with my PS3 controller is smooth and dragging windows around with left mouse kills the framerate, I think the problem is KSP is being bombarded with mouse move events and performing ui logic hundreds(or thousands?) of times a second.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-02-13T19:12:14Z","Content":"\n\u003Cp\u003EWhat is performance like with the open source driver for you? I hear it\u0027s better than the proprietary driver these days.\u003C/p\u003E\n"},{"CreatedByName":"Insanitic","CreatedById":121952,"CreatedDateTime":"2015-02-13T23:53:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EWhat is performance like with the open source driver for you? I hear it\u0027s better than the proprietary driver these days.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure about OP, but for me, when I use open source drivers, KSP is still slower/laggy/stuttery than on Windows or even Windows with Opengl. It\u0027s like everything is in molasses if you catch my meaning. Even when the camera is moving like in the VAB, it feels much slower (not really low fps slow, but slower in terms of speed) and sluggish. That\u0027s the only thing stopping me from transferring fully into the Linux bandwagon.\u003C/p\u003E\u003Cp\u003EOh and yes, the camera does stutter in-flight and the physics seems to go very slow also, in the yellow range, even when flying a ship with around 120 parts. Proprietary drivers make no difference.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-14T00:03:42Z\u0022 title=\u002202/14/2015 12:03  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 14, 2015\u003C/time\u003E by Insanitic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SolarSailor","CreatedById":62439,"CreatedDateTime":"2015-02-14T17:59:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sedativechunk\u0022 data-cite=\u0022sedativechunk\u0022\u003E\u003Cdiv\u003E1) \u003Cstrong\u003ECamera movement stuttering\u003C/strong\u003E - okay, so my game has a silky smooth framerate in terms of flying, maneuvering, and everything else. But I am having a problem, as soon as I move my camera, the game gets horrendous stuttering/framerate issues. I\u0027m not sure why, it only happens when I manually pan the camera around my ship using the right mouse button. Has anyone else had this issue yet? If I move it slow, it doesn\u0027t do it as bad. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee this thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94378\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/94378\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"D_U","CreatedById":142394,"CreatedDateTime":"2015-05-03T13:37:55Z","Content":"\n\u003Cp\u003EHello! \u003C/p\u003E\u003Cp\u003EI\u0027ve had the same problem (with KSP 0.90 as well as with KSP 1.0.x) and now I found the reason (and fix) for it, at least in my case:\u003C/p\u003E\u003Cp\u003EThe stutter was caused by the mouse-polling-rate (it was automatically set to 1000Hz on a Logitech G700s). Setting it to 125Hz completely removes the stutter when dragging the mouse right-clicked (I used the Logitech Tool in Windows 7 [Dual-boot] and saved it to the mouse internally). I have no idea how to change the polling rate in Linux without any Logitech driver available (for Archlinux \u003Ca href=\u0022https://wiki.archlinux.org/index.php/Mouse_polling_rate\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E may help and \u003Ca href=\u0022http://www.urbanterror.info/forums/topic/21844-howto-changing-mouse-polling-rate-on-ubuntu/\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E for Ubuntu, but these didn\u0027t work for me).\u003C/p\u003E\u003Cp\u003EI came along this solution simply because I play on a laptop with a touchpad. Using the G700s to move the camera or UI-elements (such as mod-buttons) some CPU-cores went up to 100%. The stutter didn\u0027t occur when using the pad, but as soon as I used the mouse again, it stuttered. The only difference between the two was the polling rate (80Hz for the touchpad and 1000 Hz, as said, for the G700s). So I changed that and *boom*, it worked....\u003C/p\u003E\u003Cp\u003EI commented on the \u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/4294\u0022 rel=\u0022external nofollow\u0022\u003Esquad-bugtracker\u003C/a\u003E (someone else filed this as a bug there without any idea what was causing it) with my system info available there.\u003C/p\u003E\u003Cp\u003EI hope I could help anybody experiencing the same issue (actually, it\u0027s my first post here). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jsartisohn","CreatedById":143101,"CreatedDateTime":"2015-05-05T11:33:32Z","Content":"\n\u003Cp\u003EJust confirming that it worked for me too.\u003C/p\u003E\u003Cp\u003EThanks D_U\u003C/p\u003E\n"}]}