{"TopicId":91426,"ForumId":24,"TopicTitle":"Hello from Tennessee (USA)","CreatedByName":"Sasami_TN","CreatedById":130310,"CreatedDateTime":"2014-11-27T23:49:58Z","PageNum":1,"Articles":[{"CreatedByName":"Sasami_TN","CreatedById":130310,"CreatedDateTime":"2014-11-27T23:49:58Z","Content":"\n\u003Cp\u003EI just recently was introduced to KSP and I really do enjoy being an astronaut vicariously through my astro-kerbal team. There are some things which I am still learning how to do, like return back to my earlier orbit to bring in a new module or part.. haven\u0027t figured that out but building in space there will always be a learning curve. I\u0027ve tried landing on the mun, through several crashed attempts sending quite a few kerbals to an untimely fate. Am thankful there is not a mob outside my bedroom demanding my head. ^^;;;\u003C/p\u003E\u003Cp\u003EIt\u0027s a wonderful game and perhaps we can contribute some creative idea\u0027s which NASA, European Space Agency, Japanese Rocket Program, or another space age country can utilize. That would be really neat. I\u0027ve seen some really amazing things (mods) being offered so far, so it\u0027s quite likely there are schematics already being drawn up in some science facility, somewhere. \u003C/p\u003E\u003Cp\u003EThank you all for reading this. \u003C/p\u003E\u003Cp\u003ESincerely, \u003C/p\u003E\u003Cp\u003E-Sasami\u003C/p\u003E\n"},{"CreatedByName":"DQB","CreatedById":43945,"CreatedDateTime":"2014-11-28T02:31:16Z","Content":"\n\u003Cp\u003EHello! have fun on the fourms!\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-11-28T02:56:35Z","Content":"\n\u003Cp\u003EHaha, good luck with taking anything from KSP into the real world XD jk welcome\u003C/p\u003E\n"},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-11-28T03:34:53Z","Content":"\n\u003Cp\u003EGreetings fellow Tennessean! Happy Thanksgiving as well!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-12-02T02:49:24Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Always nice to see another Tennesseean on the forum. Glad to hear you\u0027ve been enjoying the game.\u003C/p\u003E\n"}]}