{"TopicId":91443,"ForumId":16,"TopicTitle":"How to steer planes?","CreatedByName":"Skylab","CreatedById":123553,"CreatedDateTime":"2014-11-28T04:50:48Z","PageNum":1,"Articles":[{"CreatedByName":"Skylab","CreatedById":123553,"CreatedDateTime":"2014-11-28T04:50:48Z","Content":"\n\u003Cp\u003EI\u0027m just starting to fly my first planes, but I don\u0027t know how to steer. Can someone help me please?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-28T05:25:13Z\u0022 title=\u002211/28/2014 05:25  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 28, 2014\u003C/time\u003E by Skylab\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-11-28T05:04:12Z","Content":"\n\u003Cp\u003ESteering planes is simple. \u003C/p\u003E\u003Cp\u003EQ/E control the roll left and right\u003C/p\u003E\u003Cp\u003EW/S control pitch up and down.\u003C/p\u003E\u003Cp\u003EA/D control yaw left and right.\u003C/p\u003E\u003Cp\u003EPast that, you need to have control surfaces on the aircraft to have any control over it at all, or a lot of SAS modules.\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-11-28T05:09:49Z","Content":"\n\u003Cp\u003ERoll with Q or E to start turning left or right, then pitch up with W to increase turn rate. The other controls are only needed for fine tuning for the more advanced maneuvers like... landing.\u003C/p\u003E\u003Cp\u003EAlso, you may want to install \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/20451-0-23-Ferram-Aerospace-Research-v0-12-5-2-Aero-Fixes-For-Planes-Rockets-1-7-14\u0022 rel=\u0022external nofollow\u0022\u003EFAR\u003C/a\u003E or \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86419\u0022 rel=\u0022external nofollow\u0022\u003ENEAR\u003C/a\u003E, since stock aerodynamics makes no sense and SQUAD announced that the system will be replaced.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-11-28T05:10:24Z","Content":"\n\u003Cp\u003EI am no expert at flying things, but this is what I do: Roll your plane to whichever side you want to turn, then pitch up. Depending on how agile your plane is, the angle of the roll differ. Some can do 90 degree roll and turn super sharply. Most of the bigger planes gotta do it gradually with shallower angle turn.\u003C/p\u003E\n"},{"CreatedByName":"Zylark","CreatedById":101018,"CreatedDateTime":"2014-11-28T05:11:01Z","Content":"\n\u003Cp\u003EYou only use the rotate keys (pitch, roll and yaw) as opposed to the translation keys - and of course thrust. If you\u0027ve played any Flight Sim games, it is pretty easy, eventhough the aircraft in KSP don\u0027t behave anything like what you are used to in Flight Sims. Mostly due to the wonky drag and atmosphere model in the stock game I suspect. And flying around using keys rather than a stick.\u003C/p\u003E\u003Cp\u003EOne thing to keep in mind, is that in KSP, up and down pitch is reversed compared to how you\u0027d fly in a Flight Sim with a stick. You could of course reassign the keys, but that would also switch around how you pitch space-craft when using RCS and/or Reaction Wheel.\u003C/p\u003E\u003Cp\u003EYou could also assign a stick to rotate craft if you got one, making it easier and more intuitive to fly. Though I\u0027ve had a bit of a problem with mine. Pitch and roll is fine, but the game won\u0027t recognize my stick-twist handle for yaw.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-11-28T10:59:57Z","Content":"\n\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Controls\u0022 rel=\u0022external nofollow\u0022\u003EThe wiki\u003C/a\u003E may also help.\n"}]}