{"TopicId":91520,"ForumId":16,"TopicTitle":"How to get air-breathing engines balanced?","CreatedByName":"g00bd0g","CreatedById":74045,"CreatedDateTime":"2014-11-28T23:15:59Z","PageNum":1,"Articles":[{"CreatedByName":"g00bd0g","CreatedById":74045,"CreatedDateTime":"2014-11-28T23:15:59Z","Content":"\n\u003Cp\u003ESo I am trying to build a re-useable launch vehicle using Rapiers. I have built several successful ones, but as of late, I have been having big problems.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh4.googleusercontent.com/TwjM-gFKVSEl-vTBjaVrcTRA_3O1msun2HhUyKpQvyLNoRaS0-ny9p5nRSCv3h4iMIaOO7CKjhM=w926-h826\u0022 alt=\u0022TwjM-gFKVSEl-vTBjaVrcTRA_3O1msun2HhUyKpQvyLNoRaS0-ny9p5nRSCv3h4iMIaOO7CKjhM=w926-h826\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have yet to build a craft that \u0022balances\u0022 the air to the engines properly. i.e. I would like each successive \u0022ring\u0022 of engine to flame out together. Instead I usually end up with one \u0022arm\u0022 going 1st, but I have had crazy distributions with seemingly random flame outs across all engines.\u003C/p\u003E\u003Cp\u003ESee \u0022VTOL 7\u0022 for example.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0B4zLBUio4kInZlJ2Vy1CbWdVRXc/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/file/d/0B4zLBUio4kInZlJ2Vy1CbWdVRXc/view?usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOf course this results in an uncontrollable vehicle and subsequent death.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh3.googleusercontent.com/iQ-QU79b9dchR0lqXktIMRlIr2Qni5w3HbKDm0j1xuUH5B7_EN97opAxZXTEvEQSTtnERrSXdro=w926-h826\u0022 alt=\u0022iQ-QU79b9dchR0lqXktIMRlIr2Qni5w3HbKDm0j1xuUH5B7_EN97opAxZXTEvEQSTtnERrSXdro=w926-h826\u0022\u003E\u003C/p\u003E\u003Cp\u003EIs there a \u0022proper\u0022 way to built a craft like this? i.e. build out one \u0022arm\u0022 completely and then apply symmetry? Or apply symmetry to each part as I am building?\u003C/p\u003E\u003Cp\u003EAre there \u0022rules\u0022 to generating proper air distribution?\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2014-11-28T23:22:49Z","Content":"\n\u003Cp\u003EI do not think you can get them to flame out at the same time. Use action groups and change the propellant before they flame out.\u003C/p\u003E\n"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2014-11-28T23:24:04Z","Content":"\n\u003Cp\u003ESort of. Fuel flow rules are VERY VERY weird.\u003C/p\u003E\u003Cp\u003EAs seen in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64362-Fuel-Flow-Rules-%280-24-2%29\u0022 rel=\u0022external nofollow\u0022\u003Ethis post,\u003C/a\u003E the bottom section applies to jets.\u003C/p\u003E\u003Cp\u003EEssentially, symmetry doesn\u0027t matter in fuel flow rules.\u003C/p\u003E\u003Cp\u003EHere\u0027s the important bit:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe ship is scanned starting with first placed part and ending with last placed part.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf the part is an air intake, its contents is added to a pool of intake air available.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf the part is an air consuming engine, amount required by the engine is removed from the pool and given to the engine. If there is not enough air in the pool at the moment, the engine gets what is left in the pool.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf there is any intake air left in the pool after scanning all parts, the scan runs again starting from first part of the ship. In this second run, leftover air is distributed over engines which don\u0027t have their demands satisfied yet - again in order in which they were attached to the ship.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I remember correctly, this means that if you place your engine, then intake, then engine, each engine will last much longer before flaming out, and when they do, they do it all at once.\u003C/p\u003E\u003Cp\u003EAlso, if you point the engines at the CoM, flameouts wont matter. i.e if you set one thrust limiter to 0 and aim the other one with shift\u002BWASD until the CoT is pointing through the CoM.\u003C/p\u003E\n"},{"CreatedByName":"manni01","CreatedById":109903,"CreatedDateTime":"2014-11-28T23:28:15Z","Content":"\n\u003Cp\u003EFrom the top of my head, it definitely helps to place intakes induvidually (no symetry), and put a some torque on it (put 1 or 2 asas modules on the sstos) to counteract flame out and throttle decrease. I haven\u0027t checked your crafts out, but I\u0027m assuming you\u0027re using the SP\u002B parts, so just add some drone cores if you care about looks. I would know about this, i make sstos that reach orbital speeds in the upper atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-28T23:34:16Z","Content":"\n\u003Cp\u003EI wrote a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84217-Explaining-burnout-asymetry?p=1234436\u0026amp;viewfull=1#post1234436\u0022 rel=\u0022external nofollow\u0022\u003Epost with a fairly simple example\u003C/a\u003E of the ideal placement of air intakes and engines, based on the rules in the more detailed post linked above. It\u0027s not as detailed but can help with grasping the placement rules.\u003C/p\u003E\u003Cp\u003EThere\u0027s also a mod being developed that can optimize the intake/engine layout after building the craft, in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/100782-0-25-WIP-Synced-Jet-Flameouts-0-3\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ENote that using these techniques does not prevent asymmetric engine flameout, instead it merely delays it as long as possible. Careful monitoring of engine thrust and throttling back at the onset of air starvation is necessary to get the most out of airbreathers. You can also disable groups of engines via action group to make it easier to manage.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-28T23:37:45Z\u0022 title=\u002211/28/2014 11:37  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 28, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2014-11-29T02:58:50Z","Content":"\n\u003Cp\u003EThis script:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/numerobis/KSP-scripts/blob/master/reorder-jets.py\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/numerobis/KSP-scripts/blob/master/reorder-jets.py\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EReorders jets and intakes in a .craft file. It can only handle one kind of jet, and if the number of intakes isn\u0027t evenly divisible, I don\u0027t really know what happens. Also, it might mangle the output; I make it output into a second file just to be safe, but you must verify that things are working before you overwrite your first file.\u003C/p\u003E\u003Cp\u003EThis doesn\u0027t stop asymmetric flameout; it just means all the jets weaken at the same rate. What I\u0027ve been doing lately is building my plane with engines on the wing, run my script, load the new craft, and as a last step, add an engine on the tail. When the tail flames out, that means you\u0027ve got about 10km (IIRC -- or is it 5km?) before an asymmetric flameout. Turn off all the wing-mounted engines before that happens, at which point the tail engine will fire back up.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2014-11-29T04:17:02Z","Content":"\n\u003Cp\u003EYou can use mechjeb to prevent flameouts, or there is a seperate mod that makes flameouts happen symmetrically.\u003C/p\u003E\u003Cp\u003EEdit; the b9 engines switch over to LFO automatically, do the stock engines not do that? I\u0027ve never had the urge to try them myself\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-29T05:16:06Z\u0022 title=\u002211/29/2014 05:16  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 29, 2014\u003C/time\u003E by HoY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2014-12-01T10:23:53Z","Content":"\n\u003Cp\u003ERed Iron Crown already mentioned the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/100782-0-25-WIP-Synced-Jet-Flameouts-0-3\u0022 rel=\u0022external nofollow\u0022\u003Emod\u003C/a\u003E I am working on, it can already do the balancing of the intakes to engines pretty well. Seriously, go give it a try, I did not receive any testing feedback on it so far.\u003C/p\u003E\u003Cp\u003EWhat the mod can\u0027t do (and probably never will): cover several engine groups.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-01T10:50:37Z\u0022 title=\u002212/01/2014 10:50  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 1, 2014\u003C/time\u003E by LordFjord\u003C/strong\u003E\n\u003Cbr\u003Eremoved some advice that doesnt always work\n\u003C/span\u003E\n"}]}