{"TopicId":91697,"ForumId":18,"TopicTitle":"Sputnik as it really was","CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2014-12-01T03:07:09Z","PageNum":1,"Articles":[{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2014-12-01T03:07:09Z","Content":"\n\u003Cp\u003EI am attempting to recreate what I think was the real profile for the launch of sputnik 1. \u003C/p\u003E\u003Cp\u003EAm I correcting in thinking that the core stage of the R-7 made one continuous burn from pad to the 939km x 215km orbit? \u003C/p\u003E\u003Cp\u003EIf so I\u0027m having a devil of a time getting that orbit on a single burn in ksp and I\u0027m wondering if there are any suggestions? Low power burns make the rocket fly nose up, and ones with a higher TWR that give me \u0022straight\u0022 flight (I don\u0027t mean level, I mean the prograde marker stays near the nose) leave the Pe too low. \u003C/p\u003E\u003Cp\u003EI\u0027m using MechJeb and stock aerodynamics.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-01T03:12:25Z","Content":"\n\u003Cp\u003EOne continous burn, with constant thrust. Only change was booster separation.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-12-01T03:30:55Z","Content":"\n\u003Cp\u003EIt\u0027s funny, technically the core stage of Sputnik\u0027s launch vehicle was the first object to enter earth orbit. Followed shortly after by the two fairing panels, and \u003Cem\u003Ethen\u003C/em\u003E by Sputnik itself. People reporting seeing it from the ground were in fact seeing the core stage, 90% of the time.\u003C/p\u003E\u003Cp\u003EAnyway, on the thread\u0027s specific question, a constant-burn trajectory is more difficult in KSP than IRL given the planet \u0022curves away\u0022 from you much more quickly than earth, so you have to be more careful with it. I\u0027ve managed a few single-burn trajectories to orbit using RealSolarSystem, but only once or twice in stock KSP.\u003C/p\u003E\n"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2014-12-01T04:40:57Z","Content":"\n\u003Cp\u003EHence the booster being satno 00001 and Sputnik being 00002! But that would indicate the booster wasn\u0027t facing prograde when Sputnik was ejected wouldn\u0027t it? Just an interesting side note if true. \u003C/p\u003E\u003Cp\u003EOne big reason for my wanting to do one burn is that with the traditional coast to ap and burn to raise pe stayputnik looses it\u0027s charge....\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-12-01T04:47:20Z","Content":"\n\u003Cp\u003ENormal kerbin is way too small for stuff like this. Since playing on 6.4x Kerbin I\u0027ve had constant ascents without coasts to Ap longer than 10s.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-01T04:49:45Z","Content":"\n\u003Cp\u003EI\u0027ve done plenty of continous-burn trajectories in stock KSP, you just have to accept you probably won\u0027t be able to burn at the most efficient point.\u003C/p\u003E\n"}]}