{"TopicId":91806,"ForumId":34,"TopicTitle":"KSP Achievements (1.9.4.2) (KSP 1.4.1) 3/14/2018","CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-02T11:26:40Z","PageNum":1,"Articles":[{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-02T11:26:40Z","Content":"\n\u003Cp\u003E\nThis plugin was formally known as \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52535\u0022 rel=\u0022\u0022\u003EBlizzy\u0027s Achievements\u003C/a\u003E and is a continuation of that plugin with Blizzys Consent and permission. As requested license information has remained the same.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis Mod Is now Under New Management from linuxgurugamer.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022129964\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed6408154243\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/193073-18x-19x-achievements-updated/\u0026amp;do=embed\u0022 style=\u0022height:211px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#ff8c00;\u0022\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EI will not provide support if you don\u0027t \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83212-how-to-get-support-read-first/\u0022 rel=\u0022\u0022\u003Efollow these simple instructions\u003C/a\u003E.  To many mods out for KSP for me to be chasing things that might not be related to KSP Achievements.  \u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Li3Y3P4.png\u0022 src=\u0022http://i.imgur.com/Li3Y3P4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis plugin brings Kerbal Space Program a Steam Like Achievement System. Currently as of this release there are about 145 Achievements in the following categories.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003ECrew Operations\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EGeneral Flight\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EGround Operations\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003ELanding\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EResearch and Development\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003ESpaceFlight\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EContracts\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EFunds\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EReputation\u003C/strong\u003E\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis plugin uses Blizzy\u0027s Tool bar. The tool bar icon takes you to the Achievements window. This window shows you every single achievement available to you in the game. Achievements tracks your progress through the game and notifies you with a little chime and onscreen prompt when you accomplish one of the Achievements.. The Achievement window updates and shows you what you have accomplished and ones you still have to work on.\n\u003C/p\u003E\n\u003Cp\u003E\nAs I Learn more about how blizzy wrote the code for Achievements I will add many more Achievements to the system. As of this version I added the new contracts, funds, and reputation achievements. As I dig deeper into the code I will update and add more interesting things as time goes on.\n\u003C/p\u003E\n\u003Cp\u003E\nAll Achievements are saved to your Persistent file, and its recommended that you delete any old Achievement folder before updating to a new version. You will not lose your Achievements if you do this.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHow to Install.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n1. Download the zip file.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Open the zip file with whatever program you use to open compressed .zip files. (7Zip)\n\u003C/p\u003E\n\u003Cp\u003E\n3. Inside zip file find a folder called GameData. Place the folder in your C:\\kerbal\\ directory and your good to go.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Load up Kerbal Space Program and start unlocking those Achievements!\n\u003C/p\u003E\n\u003Cp\u003E\nThings to do.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cs\u003EOption for KSP ToolBar\u003C/s\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nSettings option to turn off sound if wish\n\u003C/li\u003E\n\u003Cli\u003E\nAdd more Achievements any ideas?\n\u003C/li\u003E\n\u003Cli\u003E\nupdate the UpdateChecker\n\u003C/li\u003E\n\u003Cli\u003E\nuse the API to add Mission Controller Contract Achievements.\n\u003C/li\u003E\n\u003Cli\u003E\nCheck to make sure the API for other mods can access this plugins still works as intended. (looks good so far)\n\u003C/li\u003E\n\u003Cli\u003E\nMany small updates as time goes on.\n\u003C/li\u003E\n\u003Cli\u003E\n \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Gx6sE4C.png\u0022 src=\u0022http://i.imgur.com/Gx6sE4C.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nChangeLog\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003E1.9.4.2\n1.Updated for KSP 1.4.1 Just to get it back up. \n2.Removed AVC for now.\n\nVersion 1.9.4\n1. Udpdate for KSP 1.2\n\nVersion 1.92 For KSP 1.12\n1. Recompiled for KSP 1.12 and AVC Updates.\n\nVersion 1.91 For KSP 1.11\n1. Fixed AVC version check for KSP 1.11.\n\nVersion 1.9 for KSP 1.1 Release.\nNo more dependency for Blizzy Tool bar.. Been wanting to transfer to default KSP tool bar for awhile now.\n2.Updated for 1.1 PreRelease.\n3.Added MiniAVC for version checking.\n\n\nVersion 1.8.0 Pre Release for KSP 1.1 PreRelease.\n1. No more dependency for Blizzy Tool bar.. Been wanting to transfer to default KSP tool bar for awhile now.\n2. Updated for 1.1 PreRelease.\n3. No longer has version checkers at this time.  Removed all code for this old code.\n\nVersion 1.8.0\n1. updated to KSP .90 Beta Than Ever\n2. Please note this is packed with a older version of ToolBar.  Seems to work fine in .90 so far.  When toolbar updates to .90 suggest updating it manually.\n\nVersion 1.7.1\n\n1. Fixed an issue where science, reputation, and refund checks would cause lots of debug spam in Non Campaign Games.  (Sandbox Safe now)\n\nVersion 1.7.0\n\n1. Updated for kerbal Space Program .25\n2. Added new Funds Achievements.\n3. Added new Contract Achievements.\n4. Added new Reputation Achievements.\n5. Malkuth took over project from Blizzy.\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n\u003Cs\u003EThis mod includes version checking using \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79745\u0022 rel=\u0022\u0022\u003EMiniAVC\u003C/a\u003E. If you opt-in, it will use the internet to check whether there is a new version available. Data is only read from the internet and no personal information is sent. For a more comprehensive version checking experience, please download the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79745\u0022 rel=\u0022\u0022\u003EKSP-AVC Plugin\u003C/a\u003E.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbal.curseforge.com/projects/ksp-achievements\u0022 rel=\u0022external nofollow\u0022\u003EDownload from Curse\u003C/a\u003E (Version 1.4.1 of KSP)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://github.com/malkuth1974/Achievements/releases\u0022 rel=\u0022external nofollow\u0022\u003EDownload\u003C/a\u003E From GitHub (Version 1.4.1 of KSP)\n\u003C/p\u003E\n\u003Cp\u003E\nThe Achievements Plugin is licensed under the GNU GPL v3.\n\u003C/p\u003E\n\u003Cp\u003E\nSource file located on my \u003Ca href=\u0022https://github.com/malkuth1974/Achievements\u0022 rel=\u0022external nofollow\u0022\u003EGitHub Page\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-21T16:57:34Z\u0022 title=\u002207/21/2020 04:57  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 21, 2020\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-02T11:36:33Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EFor Plugin Authors That Wish to add Achievements to their own mod.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EFrom Blizzy\u0027s Original Development Thread.\u003C/p\u003E\u003Cp\u003ERequirements\u003C/p\u003E\u003Cp\u003ETo contribute new achievements, you only need the Achievements.dll from the plugin, starting with version 1.4.6. You need to reference that in your project.\u003C/p\u003E\u003Cp\u003ENote that you probably don\u0027t want to make the Achievements.dll a direct dependency of your mod\u0027s DLL. Because of that, it is best to start a new DLL project that has dependencies on both your mod\u0027s DLL and the Achievements.dll. If the player doesn\u0027t have the Achievements Plugin installed, only your achievements DLL will fail to load, but your base mod DLL will run fine.\u003C/p\u003E\u003Cp\u003ECode\u003C/p\u003E\u003Cp\u003ETo add a new achievement, you need to write a bit of code. Don\u0027t worry, it\u0027s not that much. Most of it goes into checking for achievement requirements, such as \u0022is landed\u0022 or \u0022is in orbit\u0022, and things like that.\u003C/p\u003E\u003Cp\u003EPlease consider the following complete and annotated example. It should readily compile and be usable in the game.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENote: The following example source code is hereby placed into the public domain, for obvious reasons. Feel free to use it as you wish. I do not reserve any rights to it whatsoever.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eusing System;\u003Cbr\u003Eusing System.Collections.Generic;\u003Cbr\u003Eusing System.Linq;\u003Cbr\u003Eusing System.Text;\u003Cbr\u003Eusing UnityEngine;\u003Cbr\u003E\u003Cbr\u003E// This is an achievements factory. It is used to create actual achievement instances and to provide\u003Cbr\u003E// information about the category of those achievements.\u003Cbr\u003E//\u003Cbr\u003E// Achievements factory classes are searched for in all assemblies. When found, an achievements factory\u003Cbr\u003E// is instantiated automatically using its no-args constructor.\u003Cbr\u003E//\u003Cbr\u003E// You can have as many achievements factories as you like, but in general, you need at least one per\u003Cbr\u003E// category.\u003Cbr\u003Eclass NorthPoleFactory : AchievementFactory {\u003Cbr\u003E\t// Returns the actual achievements.\u003Cbr\u003E\tpublic IEnumerable\u0026lt;Achievement\u0026gt; getAchievements() {\u003Cbr\u003E\t\treturn new Achievement[] {\u003Cbr\u003E\t\t\tnew NorthPole()\u003Cbr\u003E\t\t};\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// Returns the category of the achievements returned by getAchievements().\u003Cbr\u003E\tpublic Category getCategory() {\u003Cbr\u003E\t\treturn Category.LANDING;\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E// An actual achievement.\u003Cbr\u003E//\u003Cbr\u003E// While achievements must only implement the Achievement interface, it is best to subclass from\u003Cbr\u003E// the AchievementBase class. This class provides several helper functions to register event\u003Cbr\u003E// callbacks.\u003Cbr\u003E//\u003Cbr\u003E// An achievement is basically a finite state machine. The main method being used is check(), which\u003Cbr\u003E// will be invoked in a specific interval. In this method, you should check for any requirements\u003Cbr\u003E// that your achievement has. If check() returns true, this means that the player has earned the\u003Cbr\u003E// achievement, and the method will never be invoked again. As long as it returns false, the method\u003Cbr\u003E// will be invoked again at a later time.\u003Cbr\u003E//\u003Cbr\u003E// Other interesting classes to look at (check the Achievement Plugin\u0027s source code):\u003Cbr\u003E//\u003Cbr\u003E// - Body (celestial bodies, also try Vessel.getCurrentBody() from Extensions)\u003Cbr\u003E// - Category (achievement categories)\u003Cbr\u003E// - CountingAchievement (base class for achievements that count up)\u003Cbr\u003E// - Extensions (various extension methods)\u003Cbr\u003E// - Location (surface locations)\u003Cbr\u003Eclass NorthPole : AchievementBase {\u003Cbr\u003E\t// You can register event callbacks in the constructor. Most of the time, this will be\u003Cbr\u003E\t// registerOnVesselChange() to reset achievement state when the player changes the vessel\u003Cbr\u003E\t// being actively controlled.\u003Cbr\u003E\t//\u003Cbr\u003E\t// See the AchievementBase class for other event handling methods.\u003Cbr\u003E\tpublic NorthPole() {\u003Cbr\u003E\t\tregisterOnVesselChange(onVesselChange);\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// While check() is invoked in specific intervals, update() will be invoked every frame.\u003Cbr\u003E\t// You can use this method to check for achievement requirements, too.\u003Cbr\u003E\t//\u003Cbr\u003E\t// USE ONLY IF check() DOESN\u0027T ABSOLUTELY MEET YOUR NEEDS.\u003Cbr\u003E\tpublic override void update() {\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// This is the main method to check for achievement requirements. If check() returns true,\u003Cbr\u003E\t// this means that the player has earned the achievement, and check() will never be invoked again.\u003Cbr\u003E\t//\u003Cbr\u003E\t// vessel is the actively controlled vessel. Note that this can be null, for instance if the\u003Cbr\u003E\t// player is in the tracking station. You should always check for null if you need the current\u003Cbr\u003E\t// vessel.\u003Cbr\u003E\tpublic override bool check(Vessel vessel) {\u003Cbr\u003E\t\treturn (vessel != null) \u0026amp;\u0026amp; vessel.isOnSurface() \u0026amp;\u0026amp; (vessel.horizontalSrfSpeed \u0026lt; 1d) \u0026amp;\u0026amp;\u003Cbr\u003E\t\t\tLocation.KERBIN_NORTH_POLE.isAtLocation(vessel);\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// The vessel change event callback that was registered in the constructor.\u003Cbr\u003E\tprivate void onVesselChange(Vessel vessel) {\u003Cbr\u003E\t\t// reset achievement state here\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// Initialize achievement state from the achievements save file, as saved earlier in save().\u003Cbr\u003E\t//\u003Cbr\u003E\t// node is a config node specific to this achievement. You can\u0027t accidentally interfere with\u003Cbr\u003E\t// other achievements.\u003Cbr\u003E\tpublic override void init(ConfigNode node) {\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// Save achievement state to the achievements save file. State can be loaded again in init().\u003Cbr\u003E\t//\u003Cbr\u003E\t// node is a config node specific to this achievement. You can\u0027t accidentally interfere with\u003Cbr\u003E\t// other achievements.\u003Cbr\u003E\t//\u003Cbr\u003E\t// Note that the config node values \u0022flight\u0022 and \u0022time\u0022 are reserved. If you set them, they will\u003Cbr\u003E\t// be overwritten.\u003Cbr\u003E\tpublic override void save(ConfigNode node) {\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// Returns this achievement\u0027s title. Keep short so that it fits into the \u0022toast\u0022 texture.\u003Cbr\u003E\t// Always use \u0022Headline Style\u0022.\u003Cbr\u003E\tpublic override string getTitle() {\u003Cbr\u003E\t\treturn \u0022North Pole Landing\u0022;\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// Returns this achievement\u0027s text. Keep short (two lines of text) so that it fits into the\u003Cbr\u003E\t// \u0022toast\u0022 texture.\u003Cbr\u003E\tpublic override string getText() {\u003Cbr\u003E\t\treturn \u0022Land at Kerbin\u0027s north pole.\u0022;\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\t// Returns this achievement\u0027s key. The key must be unique across all achievements.\u003Cbr\u003E\t//\u003Cbr\u003E\t// This key MUST NOT change once an achievement has been made public. It is used to check if\u003Cbr\u003E\t// the player has already earned the achievement. If the key changes, the achievement will need to\u003Cbr\u003E\t// be earned again by the player, which makes them unhappy.\u003Cbr\u003E\t//\u003Cbr\u003E\t// It is best to use some sort of ad-hoc categories, for example: landing.kerbin.surface.northPole\u003Cbr\u003E\tpublic override string getKey() {\u003Cbr\u003E\t\treturn \u0022landing.northPole\u0022;\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETitle and Text Guidelines\u003C/p\u003E\u003Cp\u003ETitles should always use \u0022Headline Style\u0022. Keep them rather short and memorable, preferably humorous, but related to the achievement and its text. If you can\u0027t come up with something neat, ask someone else! Most people will love to toss ideas at you.\u003C/p\u003E\u003Cp\u003E- Good example: I See What You Did There\u003C/p\u003E\u003Cp\u003E- Bad example: I see what you did there\u003C/p\u003E\u003Cp\u003EAchievement text must not exceed two lines of text, or it will be longer than the \u0022toast\u0022 texture. Always check with the achievements list in the game to see if your text is short enough.\u003C/p\u003E\u003Cp\u003EAlso, the text should not be too verbose. Try to keep the list of requirements short. You can leave out obvious requirements, even though your achievement code is checking for them.\u003C/p\u003E\u003Cp\u003ESpell out acronyms, such as \u0022Kerbal Space Center\u0022 instead of \u0022KSC\u0022.\u003C/p\u003E\u003Cp\u003ETo keep the player immersed, do not use real-world names and phrases. Bad example: Send a probe on a Voyager mission.\u003C/p\u003E\u003Cp\u003ENote that the Sun\u0027s name is not Kerbol in the game, is is \u0022Sun\u0022.\u003C/p\u003E\u003Cp\u003E- Good example: Land on the Kerbal Space Center runway from an altitude of at least 10000 m.\u003C/p\u003E\u003Cp\u003E- Bad example: Launch, get up to 10000 m, then land on the KSC runway, not crashing and no parts breaking off.\u003C/p\u003E\u003Cp\u003EHidden Achievements\u003C/p\u003E\u003Cp\u003EAchievements are usually visible in the achievements list window, even if the player has not earned them yet. But you can \u0022hide\u0022 an achievement, so that it remains hidden unless the player has earned it. After that, it will stay visible.\u003C/p\u003E\u003Cp\u003EPlease use hiding of achievements only sparingly, if at all. It should remain reserved for special \u0022surprise\u0022 achievements that are not obvious. For example, an achievement that is rewarded for extracting Kethane from the ground of another celestial body should not be hidden because the act of doing so is pretty obvious.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-02T11:39:10Z\u0022 title=\u002212/02/2014 11:39  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 2, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"hakan","CreatedById":92934,"CreatedDateTime":"2014-12-02T19:41:56Z","Content":"\n\u003Cp\u003EYou set the version on kerbalstuff to \u0022Version_1.7.0\u0022. Could I ask you to kindly change this to \u00221.7.0\u0022? Or ask the admins at kerbalstuff to do so for you if it is not possibly via the GUI?\u003C/p\u003E\u003Cp\u003EIt would make packaging via CKAN tremendously easier \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-02T20:02:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hakan\u0022 data-cite=\u0022hakan\u0022\u003E\u003Cdiv\u003EYou set the version on kerbalstuff to \u0022Version_1.7.0\u0022. Could I ask you to kindly change this to \u00221.7.0\u0022? Or ask the admins at kerbalstuff to do so for you if it is not possibly via the GUI?\u003Cp\u003EIt would make packaging via CKAN tremendously easier \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHope that helps. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Beetlecat","CreatedById":92207,"CreatedDateTime":"2014-12-02T21:40:10Z","Content":"\n\u003Cp\u003EHooray! Thanks for taking this on, Malkuth! It\u0027s always been one of my favorite \u0022useless\u0022 mods.\u003C/p\u003E\n"},{"CreatedByName":"hakan","CreatedById":92934,"CreatedDateTime":"2014-12-03T09:32:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022malkuth\u0022 data-cite=\u0022malkuth\u0022\u003E\u003Cdiv\u003EHope that helps. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you, just tested and it works perfectly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sidfu","CreatedById":70409,"CreatedDateTime":"2014-12-03T18:23:04Z","Content":"\n\u003Cp\u003Esince no one metioned it the ingame update button goes to the old thread.\u003C/p\u003E\n"},{"CreatedByName":"AlonzoTG","CreatedById":118178,"CreatedDateTime":"2014-12-04T02:48:30Z","Content":"\n\u003Cp\u003EPlanet factory sentience. \u003C/p\u003E\u003Cp\u003EOne of the issues I am having with your mod is that it seems to assume I have Joker installed. I don\u0027t for deep historical reasons relating to my install. I like Joker but I just don\u0027t have it installed right now. I do, however, have a dozen other planets installed... If the game could handle resources properly, I would cheerfully have three or four starsystems installed with fully functional suns and extensive planetary systems, etc... So your mod should do some checking around to see what is actually installed in the current game and has less than 5 Gs of gravity, escape velocity less than a large fraction of the speed of light, and then generate trophies accordingly.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-12-05T01:37:20Z","Content":"\n\u003Cp\u003Ethis throws a ton of continuous log spam when its run under Science Sandbox mode because it does a check for funds and reputation and comes up empty.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-05T01:59:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003Ethis throws a ton of continuous log spam when its run under Science Sandbox mode because it does a check for funds and reputation and comes up empty.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the info. I take a look at it for next version.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-05T02:14:29Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EVersion Update.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESince the above bug was pretty serious I released a small hotfix for it. Version 1.7.1.\u003C/p\u003E\u003Cp\u003E1. Fixed an issue where science, reputation, and refund checks would cause lots of debug spam in Non Campaign Games. (Sandbox Safe now)\u003C/p\u003E\u003Cp\u003EAvailable on front page.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-12-05T02:55:06Z","Content":"\n\u003Cp\u003Emany thanks!\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-05T03:28:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003Emany thanks!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour welcome. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"djnattyd","CreatedById":63737,"CreatedDateTime":"2014-12-05T12:03:44Z","Content":"\n\u003Cp\u003EI might be misremembering this but, didn\u0027t the original version use to give you science when you achieved something?\u003C/p\u003E\u003Cp\u003EDoesn\u0027t seem to be happening any more.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-05T13:23:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022djnattyd\u0022 data-cite=\u0022djnattyd\u0022\u003E\u003Cdiv\u003EI might be misremembering this but, didn\u0027t the original version use to give you science when you achieved something?\u003Cp\u003EDoesn\u0027t seem to be happening any more.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it did, it was removed long before I got my hands on it.\u003C/p\u003E\n"},{"CreatedByName":"djnattyd","CreatedById":63737,"CreatedDateTime":"2014-12-05T13:27:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022malkuth\u0022 data-cite=\u0022malkuth\u0022\u003E\u003Cdiv\u003EIf it did, it was removed long before I got my hands on it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI might be wrong, I\u0027ll have to look at my 0.24.2 install but I\u0027m sure it gave something as a reward.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-05T13:30:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022djnattyd\u0022 data-cite=\u0022djnattyd\u0022\u003E\u003Cdiv\u003EI might be wrong, I\u0027ll have to look at my 0.24.2 install but I\u0027m sure it gave something as a reward.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would not really support the idea anyway. If it did exist I\u0027m glad Blizzy Removed it. Science is already way to easy with the new Admin Building basically making it easy mode.\u003C/p\u003E\n"},{"CreatedByName":"djnattyd","CreatedById":63737,"CreatedDateTime":"2014-12-05T16:46:21Z","Content":"\n\u003Cp\u003EDon\u0027t get me wrong I\u0027m not asking for it to return, I just wasn\u0027t sure if I had a bad install.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-06T03:42:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022djnattyd\u0022 data-cite=\u0022djnattyd\u0022\u003E\u003Cdiv\u003EDon\u0027t get me wrong I\u0027m not asking for it to return, I just wasn\u0027t sure if I had a bad install.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHave not gone to deep into the code but I\u0027ll keep an eye out to see if I can see remnants of it someplace.\u003C/p\u003E\n"},{"CreatedByName":"Artophwar","CreatedById":65084,"CreatedDateTime":"2014-12-07T15:55:37Z","Content":"\n\u003Cp\u003EIs it normal not to be able to activate the toolbar button in the space center scene?? I can access it anywhere else but it doesnt show up on blizzys toolbar in the space center scene even though I have it selected to be visible.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-12-11T09:53:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022djnattyd\u0022 data-cite=\u0022djnattyd\u0022\u003E\u003Cdiv\u003EI might be misremembering this but, didn\u0027t the original version use to give you science when you achieved something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had changed it so that it would give reputation instead. Don\u0027t know if malkuth removed that, though.\u003C/p\u003E\n"},{"CreatedByName":"a__gun","CreatedById":83859,"CreatedDateTime":"2014-12-11T11:44:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EI had changed it so that it would give reputation instead. Don\u0027t know if malkuth removed that, though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat actually makes a lot more sense than rewarding funds\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-11T12:42:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EI had changed it so that it would give reputation instead. Don\u0027t know if malkuth removed that, though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat has not changed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-12-11T12:43:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Artophwar\u0022 data-cite=\u0022Artophwar\u0022\u003E\u003Cdiv\u003EIs it normal not to be able to activate the toolbar button in the space center scene?? I can access it anywhere else but it doesnt show up on blizzys toolbar in the space center scene even though I have it selected to be visible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, not sure why this is the case. Not asked blizzy about it yet.\u003C/p\u003E\u003Cp\u003EI might add it back and see what happens.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-12-12T16:04:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Artophwar\u0022 data-cite=\u0022Artophwar\u0022\u003E\u003Cdiv\u003EIs it normal not to be able to activate the toolbar button in the space center scene?? I can access it anywhere else but it doesnt show up on blizzys toolbar in the space center scene even though I have it selected to be visible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve removed it from the space center scene because the window would not behave there. Nothing to do with the Toolbar itself, though.\u003C/p\u003E\n"}]}