{"TopicId":91825,"ForumId":20,"TopicTitle":"*May already Exist* - Multisize docking port","CreatedByName":"falcon2000","CreatedById":7362,"CreatedDateTime":"2014-12-02T18:38:24Z","PageNum":1,"Articles":[{"CreatedByName":"falcon2000","CreatedById":7362,"CreatedDateTime":"2014-12-02T18:38:24Z","Content":"\n\u003Cp\u003EI remember several versions of KSP ago, there was some mod that had a dual connector. It was basically a Sr port, with a JR in the middle as well, that way the one port on say a station, could receive either a sr or std equipped ship. I\u0027m looking for either a new mod that accomplishes the same, or a reminder as to which mod it was. I believe the one that had it was a parts pack that would have included other parts as well, a standalone mod would be super and 1st preference. However if I can find the other one in the meantime\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-12-02T20:07:11Z","Content":"\n\u003Cp\u003EYou might give this a try. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/73005\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/73005\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"falcon2000","CreatedById":7362,"CreatedDateTime":"2014-12-03T04:15:18Z","Content":"\n\u003Cp\u003EAwesome, that\u0027s exactly what I was looking for - possibly even the one I had before. Thanks much!\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-03T08:22:31Z","Content":"\n\u003Cp\u003EUmmm, I never released this in a \u0022parts pack\u0022. Where did you get it from?\u003C/p\u003E\n"},{"CreatedByName":"falcon2000","CreatedById":7362,"CreatedDateTime":"2014-12-05T04:12:45Z","Content":"\n\u003Cp\u003EI don\u0027t remember - it may not have even been a parts pack. I thought it was, but I could easily be mistaken. After all - if I remembered where I got it, I wouldn\u0027t have posted a thread asking if such a thing still existed and where to get it. I would have simply searched for the prior source directly, whether directly your work or whatever other source I thought contained it. As it is, even searching through my prior saves (I have back through .23 on my drive in their own folders), and trying to find the parts via scouring the forums and google, I still was unable to arrive at what I am about 80% sure is what I had before until posting this thread. \u003C/p\u003E\u003Cp\u003ESecondly, as I stated in my first reply, it is \u0022possibly what I had before\u0022 - even at this point I\u0027m assuming since no other suggestions were forthcoming and your product matches the abilities (and look for that matter) of what I had, that it is most likely the same. That in and of itself may also be incorrect. \u003C/p\u003E\u003Cp\u003EI had thought, and I emphasize that this is very vaguely and without any degree of certainty whatsoever, that it was somehow associated with some Russian/Soviet parts, to work out compatibility between Rus/Sov and US/Stock Kerb. That said I don\u0027t believe the well-known mods for Soviet Parts actually include any such ports. They were one of the first things I looked at attempting to find what I was looking for prior to asking.\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t worry, I don\u0027t think my bad memory in this case is enough to justify being alarmed that someone is stealing your work - or perhaps worst case it\u0027s a pack that used to be around long ago and is no longer due to shenanigans such as stealing from other mod devs. In the meantime, your designs have delivered on my desires, and for that I thank you.\u003C/p\u003E\n"}]}