{"TopicId":91866,"ForumId":70,"TopicTitle":"Pre-emptive support for Linux selection.","CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2014-12-03T07:56:24Z","PageNum":1,"Articles":[{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2014-12-03T07:56:24Z","Content":"\n\u003Cp\u003EI decided to try 64 bit KSP on Linux. But it seems that there are huge amounts of distributions and even versions in distributions. I do not want to use several days to familiarize myself to them. Can you suggest something. I do not see any other significant use for Linux now than playing KSP. I have i7 3770K processor and Geforce 660 (maybe some letters) graphics card. It should install automatically (or easily) OS selection tool (last when I installed Linux Ubuntu it did). I allocated 250 GB partition from my data hard drive and Windows 7 is in separate SSD-disk. This time I am going to install Realism Overhaul and Real Solar system mods, and use as good graphics settings as possible, if it affects to Linux selection.\u003C/p\u003E\n"},{"CreatedByName":"gsarducci","CreatedById":98639,"CreatedDateTime":"2014-12-03T13:51:33Z","Content":"\n\u003Cp\u003EFor ease of installation, I used Ubuntu 14.04. About as easy as they come for installation.\u003C/p\u003E\u003Cp\u003ECan\u0027t intelligently comment on how KSP works on it though as I can\u0027t seem to get it to work with RSS and Realism Overhaul.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-12-03T14:39:52Z","Content":"\n\u003Cp\u003EUbuntu is typically the friendliest to newcomers. It would be my first suggestion but I\u0027m also partial to anything Debian based (which includes Ubuntu). My second suggestion would be Linux Mint. I\u0027ve not had as much success running KSP on linux as I have with windows, but I also haven\u0027t tried all that hard.\u003C/p\u003E\n"},{"CreatedByName":"Maars","CreatedById":125934,"CreatedDateTime":"2014-12-04T08:11:58Z","Content":"\n\u003Cp\u003EI swapped to Ubuntu 14.04 with a dual core cpu and nvidia gtx750 gpu and i don\u0027t have any crashes and it runs straight outta the box without any problems, although i use different mods other than RSS \u0026amp; Realism. BUT, the trade off for me is that even though win64 crashes and doesn\u0027t like essential mods, it runs like butter. On the flip side, on linux it doesn\u0027t crash, however it stutters and suffers low framerates because of mods like FAR and B9, at least on mine it does.\u003C/p\u003E\n"}]}