{"TopicId":91926,"ForumId":18,"TopicTitle":"What happens if an astronaut has a warrant for thier arrest?","CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2014-12-04T04:42:34Z","PageNum":1,"Articles":[{"CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2014-12-04T04:42:34Z","Content":"\n\u003Cp\u003EI was waiting for my 6 minutes to apoapsis and this though jumped into my mind. So what do you suppose would happen? Would thier be a police officer thrown in a Soyuz to go get Chris Hadfield or others and arrest them? Would the ISS not be bound to a certain countries laws? What about Mars trips? Do they just automatically become fugitives untill their splashdown in the Pacific? Can an astronaut refuse to leave the ISS? Im thinking the law is a tricky beast when it comes to space.\u003C/p\u003E\u003Cp\u003EDISCUSS!\u003C/p\u003E\n"},{"CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2014-12-04T05:00:56Z","Content":"\n\u003Cp\u003EThey send in the Space Police to get them.\u003C/p\u003E\u003Cp\u003EWhich then results in a high speed Space Chase.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2014-12-04T05:15:39Z","Content":"\n\u003Cp\u003EAside from spaceprograms being so expensive that they vet the crap out of everyting, accidents can happen of course (cue diapernaut).\u003C/p\u003E\u003Cp\u003EBut, let\u0027s focus on the purpose of the arrest: to secure the suspect and make sure you will have him/her in custody for a court case. Now, where would said astronaut go? It\u0027s not like they\u0027re a flight risk. You just request that he/she leaves with the first upcoming crew change (which was likely the schedule anyway) and problem solved.\u003C/p\u003E\u003Cp\u003EOf course there\u0027s the option that the suspect refuses to board the return craft. But people have to sleep. Can then be sedated. And duct-taped to their chair. I doubt it would ever be a real problem.\u003C/p\u003E\u003Cp\u003EArthur Clarke had a funny short story where the Brits on a joint Anglo-American-Soviet mission decided to stay one day later on the moon to clean up experiments, as it provided a loophole for a tax break. I guess that\u0027s as far as it\u0027ll go.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-12-04T05:33:16Z","Content":"\n\u003Cp\u003EI think NASA has a special procedure for restraining a crew member in extreme cases (with that sticky transparent paper thing, don\u0027t remember its name), so I guess something similar could be used to put somebody under \u0022arrest\u0022.\u003C/p\u003E\u003Cp\u003EThe whole idea is pretty stupid, though. The only case I see for this to be used is an astronaut going crazy and destroying ISS components.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-12-04T05:58:54Z","Content":"\n\u003Cp\u003ENot really. Remember, a crime doesn\u0027t have to be detected immediately. They might end up wanting him for something he\u0027s done before launch. That would be embarrassing, to say the least, I don\u0027t think there are clear procedures, and I\u0027d expect a political storm to start up, too.\u003C/p\u003E\u003Cp\u003EI think that a Mars traveller would be pretty much safe from persecution if the mission was a long term one. Once you\u0027re on a spacecraft to Mars (and not expecting to return for a few years or more), there\u0027s little anyone on Earth can do. I suppose that they could cut into his/her pay or try to make an arrest upon return, but that\u0027s all. On an one-way mission like Mars One, if the colony wouldn\u0027t be big enough to be able to maintain its own justice system, then the criminal would likely end up getting off scot-free.\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2014-12-04T06:37:46Z","Content":"\n\u003Cp\u003EYou\u0027re talking about the \u003Cem\u003Egovernment\u003C/em\u003E. There\u0027s procedures in place for just about anything. Some of them do involve duct tape if needed.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(You only hear about the crazy stuff \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ebecause\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E no one ever thought of it before it happened.)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wtR0I3h.jpg\u0022 alt=\u0022wtR0I3h.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, the crew had to file a Customs declaration to reenter the US. Not to mention stories about early shuttle astronauts carrying their passports just in case they landed somewhere else.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EIt\u0027s not like they\u0027re a flight risk.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf an astronaut is not involved in flights and risks, then it\u0027s not really an astronaut, now is it? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2014-12-04T06:48:15Z","Content":"\n\u003Cp\u003EAs we can know on good authority (i.e. Elite), the will send poilce Vipers and shoot down any Fugitive status guy.\u003C/p\u003E\n"},{"CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2014-12-04T07:03:51Z","Content":"\n\u003Cp\u003EIn about 60~ years of spaceflight, this has never happened. The ONLY time I heard of someone going mad in space was I think during a Mir mission one, where someone got threatened with a knife or something. Also during a long-duration training mission in isolation, two cosmonauts got in a bloody fist fight because one of them french kissed a female canadian astronaut that was part of the training mission. It was some kind of training mission to see how people would be on a 8 month voyage to Mars or something. This one wasn\u0027t actually in space but in a russian simulation room thing.\u003C/p\u003E\u003Cp\u003EOne of you mentioned the diaper chick too, that was Lisa Nowak. You got to admit... she was pretty HOT in her NASA days. She was cute with her astronaut outfits on, I\u0027m pretty sure I wouldn\u0027t want to be trapped in a spacecraft with her looks for an extended period of time! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E She was part of a love triangle and kidnapped the other women or something, I can\u0027t remember the exact details. Sad story though, a successful and decorated astronaut who got charged with attempted murder or something and is now a joke to the entire world. Love and relationships will make you do crazy things. I\u0027ve been traumatized by a women before and it definitely makes your brain flip. \u003C/p\u003E\u003Cp\u003EMoving back to the main topic, NASA and other space agencies are extremely critical with who they hire and put into space. I sincerely doubt any of them will ever be put on arrest while in space for something. They are given several mental evaluations and thorough background checks. But you have to wonder, if someone will ever put up a front and do something terrible in space. Kill several astronauts and potentially destroy a multi-billion dollar space station that two nearly two decades to build. It would be catastrophic and it would only take one sick, psychopath to try it. Look at James Holmes, someone who appeared totally normal and was a prosperous PhD student. Brains and track record aren\u0027t always a good thing.\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-12-04T07:04:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Special Agent Sigvan\u0022 data-cite=\u0022Special Agent Sigvan\u0022\u003E\u003Cdiv\u003EThey send in the Space Police to get them.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cem\u003EThese Guys? \u003C/em\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/en/8/8a/Spacepolicebyedguy.jpg\u0022 alt=\u0022Spacepolicebyedguy.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-12-04T11:29:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022razark\u0022 data-cite=\u0022razark\u0022\u003E\u003Cdiv\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was a joke. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.economist.com/blogs/gulliver/2011/10/space-travel\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.economist.com/blogs/gulliver/2011/10/space-travel\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.space.com/7044-moon-apollo-astronauts-customs.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.space.com/7044-moon-apollo-astronauts-customs.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2014-12-04T12:02:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EIt was a joke.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwww.... that\u0027s sad.\u003C/p\u003E\u003Cp\u003EAt least the Grumman invoice is real, though.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-12-04T13:21:47Z","Content":"\n\u003Cp\u003EIf the arrest warrant was to be issued by either the astronaut\u0027s country or the spacecraft\u0027s, I think it simply wouldn\u0027t be issued. The high-level government would lean on the police to quietly postpone it to avoid bad publicity and affecting the astronaut performance.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-12-04T13:47:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022razark\u0022 data-cite=\u0022razark\u0022\u003E\u003Cdiv\u003EAwww.... that\u0027s sad.\u003Cp\u003EAt least the Grumman invoice is real, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs real as the customs paper. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2014-12-04T17:33:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EAside from spaceprograms being so expensive that they vet the crap out of everyting, accidents can happen of course (cue diapernaut).\u003Cp\u003EBut, let\u0027s focus on the purpose of the arrest: to secure the suspect and make sure you will have him/her in custody for a court case. Now, where would said astronaut go? It\u0027s not like they\u0027re a flight risk. You just request that he/she leaves with the first upcoming crew change (which was likely the schedule anyway) and problem solved.\u003C/p\u003E\u003Cp\u003EOf course there\u0027s the option that the suspect refuses to board the return craft. But people have to sleep. Can then be sedated. And duct-taped to their chair. I doubt it would ever be a real problem.\u003C/p\u003E\u003Cp\u003EArthur Clarke had a funny short story where the Brits on a joint Anglo-American-Soviet mission decided to stay one day later on the moon to clean up experiments, as it provided a loophole for a tax break. I guess that\u0027s as far as it\u0027ll go.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course you\u0027re setting the people up who sedated and bound a person who is innocent until proven guilty for a lawsuit.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-12-05T00:09:54Z","Content":"\n\u003Cp\u003ESituation: Astronaut kills, like, seven innocent people before going to space. He seems just fine and dandy, nothing suspicious. Then they find that he\u0027s murdered the seven people. He doesn\u0027t have any intentions of killing his cremates or anything, but just in case the crew restrains him. They have a telecommunications court trial. Jury finds him guilty. Sentence: DEATH. This is good (as long as you are okay with the death penalty), because all they\u0027d do is lob him out the airlock. Suddenly there\u0027s more food, more air, and less mass to drag around the mission! Yay! First death in space!\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2014-12-05T00:18:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EAs real as the customs paper. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESheesh. Next you\u0027re going to tell me that they don\u0027t really sell satellites, right?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Satellites_For_Sale_-_GPN-2000-001036.jpg/800px-Satellites_For_Sale_-_GPN-2000-001036.jpg\u0022 alt=\u0022800px-Satellites_For_Sale_-_GPN-2000-001036.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-12-05T00:57:53Z","Content":"\n\u003Cp\u003EIf the guy (or gal) is in orbit, he\u0027s not exactly a flight risk. What\u0027s he gonna do, jump out of an airlock and make a run for it?\u003C/p\u003E\u003Cp\u003EArrest them after landing.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2014-12-05T05:11:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EThis is good (as long as you are okay with the death penalty), because all they\u0027d do is lob him out the airlock. \u003Cp\u003ESuddenly there\u0027s more food, more air, and less mass to drag around the mission! Yay! First death in space!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood?! Just loose about 70 kg of edible biomass?! No way! Use Life Support converters instead.\u003C/p\u003E\u003Cp\u003EBtw: why real maniacs almost never look as \u0022fine and dandy\u0022 as Dr. Lecter? Just degraded outsiders or full psychos.\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2014-12-05T05:18:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EFirst death in space!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Soyuz_11\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Soyuz_11\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2014-12-05T05:23:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kerbiloid\u0022 data-cite=\u0022kerbiloid\u0022\u003E\u003Cdiv\u003EGood?! Just loose about 70 kg of edible biomass?!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like the way you think!\u003C/p\u003E\n"},{"CreatedByName":"NASAHireMe","CreatedById":131205,"CreatedDateTime":"2014-12-08T04:12:41Z","Content":"\n\u003Cp\u003EA more interesting question is not HOW they get arrested, but IF. Specifically, how jurisdictional laws apply in space. I have a moderate background in international space law, enough to give a hastily-thought out answer, at least...\u003C/p\u003E\u003Cp\u003ESpace law derives primarily from, and has many parallels to, air law and sea law. Territorial sovereignty under air law extends ad coelum from their territory\u0027s surface to infinity. So if you\u0027re flying above Guinea and someone commits a murder, Guinea has the jurisdiction to prosecute you. But so does the country under which the plane is registered (similar to the flag of registration, for ships). And so does the country of the murderer, AND the country of the victim, if those countries decide to invoke the custom of extraterritorial jurisdiction. In practice, it usually defaults to the country of registration, but enough custom has occurred supporting the other jurisdictional claims that they are part of customary law.\u003C/p\u003E\u003Cp\u003ESpace obviously poses a unique jurisdictional question because spacecraft in orbit necessarily cross national boundaries thousands of times a day. The current corpus of space law (consisting mainly of the five outer space treaties) doesn\u0027t explicitly define a new jurisdictional regime. Fortunately, there have been so few incidents that the jurisdictional question has never fully been settled. Everyone has (more or less) acted responsibly in space, enough that some scholars argue a new customary tradition has been formed. But others argue, can space law really have \u0027widespread, commonly-accepted, time-tested practices\u0027 (which is the most common basis for customary law) when we\u0027ve only been space-faring as a species for less than 70 years? Especially when only a handful of countries have any sort of space capabilities at all?\u003C/p\u003E\u003Cp\u003EIn order to get around these jurisdictional issues in the handful of cases where it really matters (namely, international human spaceflight projects like the ISS, Mir, Space Shuttle, etc.), the criminal liability statutes are hard-wired into the Memoranda of Understanding\u0027s (MOUs) and international treaties like the 1998 ISS treaty. See an example here: \u003Ca href=\u0022http://web.archive.org/web/20060913194014/http://portal.unesco.org/shs/en/file_download.php/785db0eec4e0cdfc43e1923624154cccFarand.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://web.archive.org/web/20060913194014/http://portal.unesco.org/shs/en/file_download.php/785db0eec4e0cdfc43e1923624154cccFarand.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhether these hard-wired jurisdictional outlines are enough to constitute a \u0027custom\u0027 that will endure and be applied in other cases, is still unknown. \u003C/p\u003E\u003Cp\u003ETL;DR: space jurisdictional issues are in their infancy and unsolved; click the link to see how the ISS handles arrests.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-12-08T16:12:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sedativechunk\u0022 data-cite=\u0022sedativechunk\u0022\u003E\u003Cdiv\u003EIn about 60~ years of spaceflight, this has never happened. The ONLY time I heard of someone going mad in space was I think during a Mir mission one, where someone got threatened with a knife or something.\u003Cp\u003E.......\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESource?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FFFFFF;\u0022\u003ENot too short\u003C/span\u003E\u003C/p\u003E\n"}]}