{"TopicId":92005,"ForumId":16,"TopicTitle":"Problem welding B9 Aerospace Parts...","CreatedByName":"jessyager","CreatedById":100149,"CreatedDateTime":"2014-12-05T09:26:31Z","PageNum":1,"Articles":[{"CreatedByName":"jessyager","CreatedById":100149,"CreatedDateTime":"2014-12-05T09:26:31Z","Content":"\n\u003Cp\u003EI am trying to weld some parts together to bring the part count of one of my crafts down. Some of the parts I am welding are from the updated version of B9 Aerospace. The problem I am having is that on parts that have multiple model configurations or textures it is showing all of the models/textures simultaneously after the weld. Anyone else come across this and find a way to keep this from happening or how to edit the welded part config to fix the issue?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i9.photobucket.com/albums/a64/jessyager/Kerbal%20Space%20Program/screenshot11.png\u0022 alt=\u0022screenshot11.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Darren9","CreatedById":58062,"CreatedDateTime":"2014-12-05T17:06:40Z","Content":"\n\u003Cp\u003EI\u0027m not even sure the Firespitter mesh/texture switcher could deal with that, if it could though you\u0027d need to make your own config for it referencing which mesh/texture for every model. It would be a nightmare I think. It looks like most of the parts you\u0027re using are in the old B9 as separate parts without FS switch, I think I\u0027d use those instead of the new ones.\u003C/p\u003E\n"},{"CreatedByName":"jessyager","CreatedById":100149,"CreatedDateTime":"2014-12-05T21:22:44Z","Content":"\n\u003Cp\u003EThx I am running a mod heavy installation so I was trying to keep duplicate parts to a smaller degree. If anyone thinks there is another way without having to pull my hair out by pretty much writing my config file from scratch I would like to hear it. In the mean time I will try the old parts, thank you much \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\n"}]}