{"TopicId":92055,"ForumId":32,"TopicTitle":"Squadcast Summary (Updated 2014-12-13 - the 0.90 features video edition!)","CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-12-06T01:46:49Z","PageNum":5,"Articles":[{"CreatedByName":"kujuman","CreatedById":28299,"CreatedDateTime":"2014-12-07T10:33:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003EIt\u0027s still all pointless until Squad finds a way to fix the stopping of rotation during time warp though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEh, bothers rather than finds. It\u0027s super easy, but just not very high priority. There\u0027s at least one mod that does it.\u003C/p\u003E\u003Cp\u003EAnd no, it\u0027s not pointless. Landing without any SAS is tough, landing an asymmetric ship without SAS is very tough, and timewarp tricks won\u0027t help a whole lot very near the ground.\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2014-12-07T10:54:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kujuman\u0022 data-cite=\u0022kujuman\u0022\u003E\u003Cdiv\u003EEh, bothers rather than finds. It\u0027s super easy, but just not very high priority. There\u0027s at least one mod that does it.\u003Cp\u003EAnd no, it\u0027s not pointless. Landing without any SAS is tough, landing an asymmetric ship without SAS is very tough, and timewarp tricks won\u0027t help a whole lot very near the ground.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally? i\u0027ve never found it that hard to do without SAS, and the plugin you speak of, the last time I tried it it was super buggy and ended in the spinning destruction of several ships.\u003C/p\u003E\n"},{"CreatedByName":"kujuman","CreatedById":28299,"CreatedDateTime":"2014-12-07T12:06:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003EReally? i\u0027ve never found it that hard to do without SAS, and the plugin you speak of, the last time I tried it it was super buggy and ended in the spinning destruction of several ships.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETough != hard. Besides, your argument is then that SAS is useless (for you) anyway, not just with the existence of the timewarp rotation stopping. If landing isn\u0027t hard without SAS, then you probably don\u0027t need it at all. So for you it\u0027d be pointless to include SAS, just as it is to remove it. In which case, SQUAD should not be developing for you, but for the typical players, players for whom SAS is important (hence all of the backlash of SAS being removed).\u003C/p\u003E\u003Cp\u003EUsing \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/85990-0-23-5-Persistent-Momentum-1-0-%2814-July%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/85990-0-23-5-Persistent-Momentum-1-0-%2814-July%29\u003C/a\u003E or \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67821-Timewarp-Rotation-Fix\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/67821-Timewarp-Rotation-Fix\u003C/a\u003E ? They both work the same way, only slightly differently in how they save/load. Cybutek\u0027s mod seems to work bug free on 32-bit. No reason to believe SQUAD couldn\u0027t fix any residual bugs since they have the source.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-12-07T12:13:48Z","Content":"\n\u003Cp\u003EAgain a punch into the face of the sandbox Players that use pilots very rare because they are valuable... KXP is not my like the way it is described here.\u003C/p\u003E\u003Cp\u003EKSP seems to move from nice sandbox build rockets game to mainstream gamedesign by book, pretty sad.\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2014-12-07T12:16:06Z","Content":"\n\u003Cp\u003EObsessed with ksp, you wouldn\u0027t mind making this a regular thing, would you?\u003C/p\u003E\u003Cp\u003EI\u0027d give you rep!!\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-12-07T13:29:00Z","Content":"\n\u003Cp\u003EAbout part clipping: i was under the impression that intersecting collision meshes can cause phantom forces, with results varying from a tendency for the craft to go off-course, to ripping the craft apart. Is that a lie, or did Squad fix it, or do part clipping Kerbonauts just take their chances?\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-12-07T13:58:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alewx\u0022 data-cite=\u0022Alewx\u0022\u003E\u003Cdiv\u003EAgain a punch into the face of the sandbox Players that use pilots very rare because they are valuable... KXP is not my like the way it is described here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see how - sandbox players get fully functional buildings, highest level kerbals and top tier probes automatically. If anything, you get a better deal than career players because they have to work to earn the things you get at the start.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ikaneko\u0022 data-cite=\u0022Ikaneko\u0022\u003E\u003Cdiv\u003EObsessed with ksp, you wouldn\u0027t mind making this a regular thing, would you?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t do it for the rep, but I\u0027ll make it as regular as I can! I\u0027m definitely going to do next episode, for sure.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003EAbout part clipping: i was under the impression that intersecting collision meshes can cause phantom forces\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know the status of phantom forces. I personally haven\u0027t experienced any, despite my occasional heavy abuse of it but we\u0027ll see. One thing\u0027s for sure, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/93897-0-25-The-Colliders-Strike-Back-v1-0-1-Intra-vessel-part-collisions-are-back!\u0022 rel=\u0022external nofollow\u0022\u003ETCSB\u003C/a\u003E will be interesting!\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-12-07T14:37:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EI\u0027m wondering if Courage and Stupidity will have any influnce on the KXP system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m wondering if those values will even still exist. They were at one time described as placeholder stats. At least, I expect there to be more stats to compliment them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EAlso: an unmentioned feature of the part-count limit is that it should discourage the spamming of massless parts. I don\u0027t see that as a bad thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would prefer them giving those parts mass to discourage people from spamming them.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-12-07T15:17:50Z","Content":"\n\u003Cp\u003EBy the way guys, if you have any suggestions for how I can improve this thread (new one for each summary? Added to OP in spoiler tags? Replies to this thread and linked in OP?), feel free to tell me. This thread is for your benefit, after all. My thought is to have just the latest one in the OP with past ones as replies to this thread linked in the OP. This saves on clutter in the OP and ensures you can see the most recent info immediately.\u003C/p\u003E\u003Cp\u003EGlad this so many of you like this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2014-12-07T15:35:00Z","Content":"\n\u003Cp\u003EOk, a lot of people in this thread are getting upset over a misunderstanding. SAS is not being removed, they\u0027re simply adding functionality on top of it. Having a Pilot Class Kerbal will give you access to controls like Mechjeb\u0027s Smart A.S.S. -- you click a button and the pilot rotates the craft to prograde and hold there, for example. High level probes will also be able to do this. Lower level probes and Pilots will still be able to hold a heading, like the current SAS.\u003C/p\u003E\u003Cp\u003EThe way I see it, this finally makes the 3 kerbal pod useful. If you\u0027re making a solo flight, you\u0027ll generally take a Pilot. With 3 Kerbals, you have access to all 3 skill bonuses, which makes crew selection actually have a purpose.\u003C/p\u003E\u003Cp\u003EThanks for putting this together ObsessedWithKSP. I think some people would do well to follow the advice under your name.\u003C/p\u003E\n"},{"CreatedByName":"Bloody_looser","CreatedById":95664,"CreatedDateTime":"2014-12-07T15:45:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EBy the way guys, if you have any suggestions for how I can improve this thread\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAdding approximate time, when a certain feature is discussed in the Squadcast, would be really helpful.\u003C/p\u003E\u003Cp\u003EAnyway, great work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Toastie_Buns","CreatedById":75603,"CreatedDateTime":"2014-12-07T16:23:30Z","Content":"\n\u003Cp\u003EIt will be interesting to see if Kerbals have multiple specialisations. \u003C/p\u003E\u003Cp\u003ENaturally, it would make sense, since that\u0027s how astronaut training works; you spend hours learning aerodynamics, orbital mechanics, making and breaking computers and a helluva lotta geology. Better take a crash course in photography while you\u0027re at it, it would be a shame to get all that way and bring back fuzzy pictures. \u003C/p\u003E\u003Cp\u003EOh, you know geology? The rock you\u0027re holding is hard? Well, how hard? Time to revise that Mohs scale knowledge.\u003C/p\u003E\u003Cp\u003EIn short; Kerbals will need multiple skill sets, otherwise you\u0027re forced to bring more dudes. A pilot is great, but landing on the Mun is kinda pointless if you can\u0027t repair your broken antenna or know what to pick up in your soil sample. You brought an engineer? Great, the antenna is fixed but we still have no idea what to pick up. Oh, we brought a scientist? Then who\u0027s controlling the service mod- Oh crap.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-12-07T16:57:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EDid they seriously take the barn out? That upsets me. i was totally looking forward to starting in a barn! I absolutely loved the idea. It just made sense, especially when you consider that the US itself used old farms and barn silos as missile hangers. Enough people really griped about it enough that they scrapped it? That is a true loss to both historical references and for the kerbalness of it. Other than that, the rest of the update looks pretty cool.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat part of the post says this?\u003C/p\u003E\n"},{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2014-12-07T17:05:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EWhat part of the post says this?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot from squadcast, but apparently they took the barn out because people whinned too much....\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2014-12-07T17:16:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nemrav\u0022 data-cite=\u0022Nemrav\u0022\u003E\u003Cdiv\u003Ebut apparently they took the barn out...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey took it out so they could rework the model but insist that the silly thing will be put back in after they make it look better.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-12-07T17:31:36Z","Content":"\n\u003Cp\u003EWhile we\u0027re on the topic of things people gripe about, I\u0027m just seeing way too much negativity in this thread. I\u0027m no fanboy by any means, but come on. Despite what many people seem to think, Squad does, in fact, listen to its community. I\u0027d prefer to have them listening to \u003Cem\u003Econstructive\u003C/em\u003E criticism, rather than whining, and I\u0027m sure they would too.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-12-07T17:41:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EI don\u0027t see how - sandbox players get fully functional buildings, highest level kerbals and top tier probes automatically. If anything, you get a better deal than career players because they have to work to earn the things you get at the start.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERemote units do no longer get SAS, they kinda will have something like it in the highest tier, gut it is not recommended to use them, so what is their purpose then? It is the soft way to force the Player to use pilots.\u003C/p\u003E\u003Cp\u003EI watched the twitch today in total.\u003C/p\u003E\u003Cp\u003EDon\u0027t get me wrong here, for career it is totally ok, having to work up the whole way.\u003C/p\u003E\u003Cp\u003EBut in prespctive of Rosetta and Dragon, remoteunits do not only have SAS they are cappable of finding their own course. While in the game they are nerfed to be of no use.\u003C/p\u003E\u003Cp\u003EIn case I don\u0027t want to use kerbals because they are valuable to me, it is pretty hard to impossible to play, based on what MaxMaps said.\u003C/p\u003E\u003Cp\u003EMy normal workflow is to build a craft in LKO with remoteunits and then in the last stage, I send up some kerbals for the Mission, how should that then work?\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-12-07T17:43:45Z","Content":"\n\u003Cp\u003ESo can probes no longer use SAS at all?\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-12-07T17:46:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003ESo can probes no longer use SAS at all?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe way it was described by MaxMaps in the twitchstream no, the last one in the techtree will get somekind of miniSAS he was not really clear about that.\u003C/p\u003E\u003Cp\u003EBut in generall it sounded like probes no longer have SAS at all.\u003C/p\u003E\n"},{"CreatedByName":"andrew123","CreatedById":46719,"CreatedDateTime":"2014-12-07T17:47:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alewx\u0022 data-cite=\u0022Alewx\u0022\u003E\u003Cdiv\u003EThe way it was described by MaxMaps in the twitchstream no, the last one in the techtree will get somekind of miniSAS he was not really clear about that.\u003Cp\u003EBut in generall it sounded like probes no longer have SAS at all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E0_o I hope they don\u0027t nerf the mini sas.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-12-07T17:56:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alewx\u0022 data-cite=\u0022Alewx\u0022\u003E\u003Cdiv\u003EThe way it was described by MaxMaps in the twitchstream no, the last one in the techtree will get somekind of miniSAS he was not really clear about that.\u003Cp\u003E But in generall it sounded like probes no longer have SAS at all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s... ridiculous... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-12-07T17:56:40Z","Content":"\n\u003Cp\u003EGuys, probe cores have different pilots skills depending on the tech level. You can even combine probe cores together for more than one piloting ability.\u003C/p\u003E\u003Cp\u003EThe \u003Cem\u003Efirst\u003C/em\u003E probe cores have no SAS, true, but they are cheaper and lower tech.\u003C/p\u003E\n"},{"CreatedByName":"andrew123","CreatedById":46719,"CreatedDateTime":"2014-12-07T18:01:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EGuys, probe cores have different pilots skills depending on the tech level. You can even combine probe cores together for more than one piloting ability.\u003Cp\u003EThe \u003Cem\u003Efirst\u003C/em\u003E probe cores have no SAS, true, but they are cheaper and lower tech.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut which ones are the first probe cores? I want to see the tech tree. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-12-07T18:05:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EGuys, probe cores have different pilots skills depending on the tech level. You can even combine probe cores together for more than one piloting ability.\u003Cp\u003EThe \u003Cem\u003Efirst\u003C/em\u003E probe cores have no SAS, true, but they are cheaper and lower tech.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you need a 2,5m probe for every work that is done without kerbals?\u003C/p\u003E\u003Cp\u003EHaving to combine them is also not really clever as there is the problem with the different sizes.\u003C/p\u003E\u003Cp\u003EFor a simple sat sure there is no sas needed, there is torque and force enough but there is more where remoteunits are used.\u003C/p\u003E\u003Cp\u003EThe way the system is build is \u0022we have to improve career mode\u0022, which for itself is ok, but keeping such a limitation in sandbox is ridicioulus, I just hope there will be adjustments, otherwise I will have to abuse MM to add the function back into the probes.\u003C/p\u003E\n"},{"CreatedByName":"Bloody_looser","CreatedById":95664,"CreatedDateTime":"2014-12-07T18:14:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kujuman\u0022 data-cite=\u0022kujuman\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHave none of you memory of (not even that) old versions of KSP? It used to be that you had reaction wheels (SAS) and heading hold (ASAS) as separate parts. So if you wanted to have control, you needed to add an ASAS, otherwise it was manual flying (read: spin stabilization). The ASAS was pretty heavy, 800 kg, so you\u0027d typically have it on launchers and maybe landers, but not on the ascent stage, for both dV reasons and size. ASAS functionality was added to the pods in .21 when the SAS was rewritten, so not even that long ago. Ever wonder why the\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Advanced_S.A.S_Module,_Large\u0022 rel=\u0022external nofollow\u0022\u003E 2.5m ASAS unit\u003C/a\u003E doesn\u0027t have wheels modeled in it?\u003Ca href=\u0022https://en.wikipedia.org/wiki/Saturn_V_Instrument_Unit\u0022 rel=\u0022external nofollow\u0022\u003E Because it was just a computer when it was introduced in .18\u003C/a\u003E! But .21 made that redundant, so it got torque added.\u003C/p\u003E\u003Cp\u003EIt took something out of the \u0022game\u0022...we no longer had to balance having extra mass of an ASAS vs manually controlling the vessel, and there were times you\u0027d forgo the ASAS. Easy mode.\u003C/p\u003E\u003Cp\u003EIn sum, get off my lawn, suck it up, learn to fly manually (like many astronauts did in Mercury and Gemini and I assume early Soviet vehicles), and quit complaining \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt sounds like - \u0022Back in my days water was solid and we only had the Mun\u0022. Really, it\u0027s not an argument for scrapping SAS function.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GusTurbo\u0022 data-cite=\u0022GusTurbo\u0022\u003E\u003Cdiv\u003EOk, a lot of people in this thread are getting upset over a misunderstanding. SAS is not being removed, they\u0027re simply adding functionality on top of it. Having a Pilot Class Kerbal will give you access to controls like Mechjeb\u0027s Smart A.S.S. -- you click a button and the pilot rotates the craft to prograde and hold there, for example. High level probes will also be able to do this. Lower level probes and Pilots will still be able to hold a heading, like the current SAS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, I\u0027ve been reading devnotes as well. At first it sounded like this, but in the discussed stream Maxmaps states there will be no SAS without a pilot or some \u0022high-tier\u0022 unmanned core. Btw, it\u0027s around 21:30 in the video and sounds loud and clear. Or am I getting it wrong?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-07T19:07:08Z\u0022 title=\u002212/07/2014 07:07  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 7, 2014\u003C/time\u003E by Bloody_looser\u003C/strong\u003E\n\u003C/span\u003E\n"}]}