{"TopicId":92068,"ForumId":15,"TopicTitle":"My landing legs are so close to working, only one leg works at a time though.","CreatedByName":"Shryq","CreatedById":130095,"CreatedDateTime":"2014-12-06T06:14:31Z","PageNum":1,"Articles":[{"CreatedByName":"Shryq","CreatedById":130095,"CreatedDateTime":"2014-12-06T06:14:31Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/sh/h1g1yb5t84ysc34/AABs0JY2dcyOGgSS3caarYfha?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/sh/h1g1yb5t84ysc34/AABs0JY2dcyOGgSS3caarYfha?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAll the parts, blender, fbx, unity scene, output mbm and model files.\u003C/p\u003E\u003Cp\u003EThe part as it sits, only one of the legs can work at a time. I\u0027ve tried making two leg modules, but it doesn\u0027t work with two differently named wheelCollider objects (I couldn\u0027t get it to work at least).\u003C/p\u003E\u003Cp\u003EAlso, the animation only plays in one direction, and that out (the original animation basically). I was lead to believe that using a ModuleLandingLeg would allow it to play in both directions without anything extra needed.\u003C/p\u003E\u003Cp\u003EI got that from this thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/25135?p=551627\u0026amp;viewfull=1#post551627\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/25135?p=551627\u0026amp;viewfull=1#post551627\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI was following this tutorial: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/77991\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/77991\u003C/a\u003E , but things got a bit wacked out, because mine has a different structure, and has a telescoping piece, and his doesn\u0027t.\u003C/p\u003E\u003Cp\u003EAlso, I removed the suspension component through the process of trying to trouble shoot it. Can that be put back in and function with the other leg, when I was testing it, it made one of the legs do something really weird.\u003C/p\u003E\u003Cp\u003EWould it just be easier to make two separate parts instead of a double configuration, or is there a better way to do multiple legs?\u003C/p\u003E\u003Cp\u003EAnd while I\u0027m asking questions, is there a way to limit an engine\u0027s gimbal range to one specific axis, and then to specific \u002B/- values (for example limiting it to \u002B5 / -2 on the x axis only)?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-06T06:23:18Z\u0022 title=\u002212/06/2014 06:23  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 6, 2014\u003C/time\u003E by Shryq\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-06T06:40:43Z","Content":"\n\u003Cp\u003Elandingleg module has to be one module per part I think. without plugins you can get multiple legs in a single part, but no suspension. it would just be simple generic animation clip.\u003C/p\u003E\u003Cp\u003Estock gimbal module doesn\u0027t have axis separated. If you need separated axis gimbals, check B9\u0027s F119 engine for KMGimbal module settings.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-06T07:23:10Z","Content":"\n\u003Cp\u003EIs there a plugin that allows suspension for multiple legs?\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-06T07:35:51Z","Content":"\n\u003Cp\u003Enot that I know of. but I\u0027ve only been playing the game since 0.23. might be plugins from before.\u003C/p\u003E\n"},{"CreatedByName":"Shryq","CreatedById":130095,"CreatedDateTime":"2014-12-06T19:34:37Z","Content":"\n\u003Cp\u003ESo, I separated them into two pieces, but now the bounce like crazy, with or without the suspension element. I even tried upping the mass of the part, to no avail. Animation and everything else is fine.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-12-07T00:54:30Z","Content":"\n\u003Cp\u003EAre you setting them up with wheel colliders (like in the Bahamuto tutorial)? If so, make sure any mesh/box/capsule/sphere colliders that intersect the wheel collider are set to layer 26 WheelCollidersIgnore. Pretty sure that\u0027s what will be wrong there - had it many times with wheels when I\u0027ve forgotten.\u003C/p\u003E\n"},{"CreatedByName":"Shryq","CreatedById":130095,"CreatedDateTime":"2014-12-07T20:49:58Z","Content":"\n\u003Cp\u003EDoes that only apply to the part that the landing legs are on?\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-07T21:02:29Z","Content":"\n\u003Cp\u003Eit applies to any colliders the wheelCollider raycast has to pass through. looking at the file, looks like you do need to set the main wing piece on WheelCollidersIgnore layer, you\u0027ll need to use a child object for the collider object, the mesh will be invisible when set to WheelCollidersIgnore layer. That\u0027s how it\u0027s supposed to work anyway. I\u0027ve had some issues with it lately and ended up not having colliders in the path of the wheelCollider at all. not sure if it\u0027s something that changed in KSP or parttools or something I missed.\u003C/p\u003E\n"}]}