{"TopicId":92150,"ForumId":44,"TopicTitle":"Long March 4B launches in 3 hours","CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T00:14:20Z","PageNum":1,"Articles":[{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T00:14:20Z","Content":"\n\u003Cp\u003ELaunch is from the Taiyuan launch centre in northern China, carrying the Chinese-Brazilian CBERS-4 satellite for Brazil. CBERS-4 is an earth observation satellite intended to measure environmental conditions and changes in Brazilian territory (e.g. deforestation in the Amazon), and is a replacement for the identical CBERS-3 lost in a launch failure last year. The launch is to be streamed by INPE (the Brazilian space agency) \u003Ca href=\u0022http://www.lit.inpe.br/aovivo\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E; note the stream will only, as far as I can tell, work on internet explorer. \u003C/p\u003E\u003Cp\u003E Launch time is to be 3:23 UCT/GMT.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T03:07:48Z","Content":"\n\u003Cp\u003EStream is now live, showing countdown rather than looped video. Should have video soon. About twenty minutes to go.\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-12-07T03:11:17Z","Content":"\n\u003Cp\u003EThe launch time is 3:26 UTC, right? Anyways, somebody should record this obscure launch with a screen recorder. I\u0027m not sure if I can reliably do so on the first and only try (fullscreen issues with screen recorders, etc.) Whether this launch succeeds or (God forbid) fails, I\u0027m guessing there won\u0027t be much video of it released - China is fairly secretive, and I don\u0027t know much about Brazil\u0027s space program\u0027s online presence.\u003C/p\u003E\u003Cp\u003EAnyways, I have the stream running in Chrome with the VLC Media Player plugin. IE doesn\u0027t work for me with Windows Media Player, at least on Windows 8. (I have one of the newer versions of IE, IDK which one.)\u003C/p\u003E\u003Cp\u003EThe audio sounds jumbled when they talk. It was clear for a bit and now sounds all jumbled. You can tell that somebody is talking.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T03:13:07Z","Content":"\n\u003Cp\u003ELivestreams are rare, but China release video and images of most launches, including the failed CBERS-3 attempt. The CBERS program tends to get a lot of coverage in Brazil, and the site\u0027s already been knocked down by traffic once.\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2014-12-07T03:17:07Z","Content":"\n\u003Cp\u003E10 Minutes, I have garbled sound too but I don\u0027t think it will be an issue. I don\u0027t speak either language and I don\u0027t think the broadcast will be in English.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-12-07T03:19:38Z","Content":"\n\u003Cp\u003EI don\u0027t have a plugin to display that content \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E So please do record this launch.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T03:21:25Z","Content":"\n\u003Cp\u003EYou need to use internet explorer, or it won\u0027t work. ISRO have the same issue with their streams.\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2014-12-07T03:24:28Z","Content":"\n\u003Cp\u003EI am going to give it a try, but it will be my first time. So anyone else who can and is so inclined should.\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-12-07T03:27:05Z","Content":"\n\u003Cp\u003EIt seems to be an animation... showing the wrong type of Long March nonetheless.\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2014-12-07T03:27:53Z","Content":"\n\u003Cp\u003EIt is just an animation it looks like. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-12-07T03:28:49Z","Content":"\n\u003Cp\u003EIt has a \u0022sequence of events\u0022 to the left side... don\u0027t know if that\u0027s live or prerecorded and timed.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T03:29:33Z","Content":"\n\u003Cp\u003EI think I speak for us all when I say; what the f*** was that.\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-12-07T03:30:22Z","Content":"\n\u003Cp\u003EDouble post (EDIT - or not) for reasons of unrelated topic - they just showed booster jettison despite the fact that this rocket actually has no strap-on boosters AFAIK.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-07T03:32:54Z\u0022 title=\u002212/07/2014 03:32  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 7, 2014\u003C/time\u003E by GigaG\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-12-07T03:32:36Z","Content":"\n\u003Cp\u003EDouble post for update - Animation of core stage jettison (really first stage jettison, no boosters IRL) - the animation seems to be the wrong kind of rocket, but the event sequence matched up with the fairing so it might be synced. But is the event sequence for this rocket or the other variant of Long March in the animation? I can\u0027t read the text - it is probably Portugese which I don\u0027t know and the video is lower quality and barely legible at all - so I don\u0027t know if there are any references to boosters.\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2014-12-07T03:33:08Z","Content":"\n\u003Cp\u003EWell if the ESA showed us the right way to stream a launch, this would be the wrong way. NASA\u0027s suddenly looks pretty good.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T03:35:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GigaG\u0022 data-cite=\u0022GigaG\u0022\u003E\u003Cdiv\u003EDouble post for update - Animation of core stage jettison (really first stage jettison, no boosters IRL) - the animation seems to be the wrong kind of rocket, but the event sequence matched up with the fairing so it might be synced. But is the event sequence for this rocket or the other variant of Long March in the animation?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E The booster nosecones and overall shape don\u0027t match any flying model; it appears to a CZ-5, which isn\u0027t even supposed to fly until 2016. I\u0027m curious to see what\u0027ll be revealed when the fairing pops off; Chang\u0027e 5? The modular station core?\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-12-07T03:37:22Z","Content":"\n\u003Cp\u003EThe fairing popped off a while ago in the animation and seems to show some sort of satellite.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T03:41:22Z","Content":"\n\u003Cp\u003EI hope somebody was recording that. It will go down in history as the worst stream ever broadcast.\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2014-12-07T03:43:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EI hope somebody was recording that. It will go down in history as the worst stream ever broadcast.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI stopped, waste of HDD space. There is no way I am going to post that to my Youtube.\u003C/p\u003E\n"},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2014-12-07T03:54:52Z","Content":"\n\u003Cp\u003Edeleted 10chrs\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-07T04:13:13Z\u0022 title=\u002212/07/2014 04:13  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 7, 2014\u003C/time\u003E by Lohan2008\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2014-12-07T04:00:42Z","Content":"\n\u003Cp\u003EConfirmation from the Chinese side that CBERS has entered orbit, exactly as we didn\u0027t have last time. INAE declared success without the proper data, and ended up eating a lot of humble pie.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-12-07T10:05:45Z","Content":"\n\u003Cp\u003EHehe. Looks like i gained couple of hours of good sleep - and lost only couple of moments of \u0022what the huh?\u0022 Learn from yesterday\u0027s Ariane launch, China - that\u0027s how a stream should look in XXI century.\u003C/p\u003E\n"}]}