{"TopicId":92219,"ForumId":55,"TopicTitle":"Procedural Wings/other possible integration with stock?","CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2014-12-07T20:18:04Z","PageNum":1,"Articles":[{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2014-12-07T20:18:04Z","Content":"\n\u003Cp\u003EWell im pretty sure this was suggested some time before, but since i havent found any thread on 1st few pages, i suggest that procedural wings should be added to teh game.\u003C/p\u003E\u003Cp\u003EThe benefits are 2 fold:\u003C/p\u003E\u003Cp\u003EOne, lowers part count, since very large craft are nolonger required to be made of multiple wings ontop of wings.\u003C/p\u003E\u003Cp\u003ETwo, it allows much more customizability, especially when it comes to shape of a wing. Right now, the only way to get a particular wing shape is to clip 1-3 wings inside each other with each one becoming one of the sides you want. For more complex wing designs this becomes even more parts, that needlessly add part count and make it more harmful then good. \u003C/p\u003E\u003Cp\u003EI have heard that procedural fuel tanks will be implemented eventually, so hopfully the days of rediculous wobbly rockets of doom are over (ok i suck at rocket design, so maybee my designs do that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E). Id also like to see procedural structural plates, with teh ability to make them non square such as the procedural wings mod, this would make things liek capital ships/carriers/massive stations possible, with minimal strain on the system (i know unity5 update is coming out eventually which will hopefully fix that, but this would actually help as a easy temporary solution, that actually gives us more options in game).\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2014-12-07T23:48:30Z","Content":"\n\u003Cp\u003EThis used to be a relevant post. Now it\u0027s not anything.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-08T00:23:25Z\u0022 title=\u002212/08/2014 12:23  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 8, 2014\u003C/time\u003E by DuoDex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-12-08T00:18:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DuoDex\u0022 data-cite=\u0022DuoDex\u0022\u003E\u003Cdiv\u003EThis seems to pop up a lot. While Squad haven\u0027t specifically said they \u003Cem\u003Ewon\u0027t\u003C/em\u003E add procedural parts to the game, they haven\u0027t said that they \u003Cem\u003Ewill\u003C/em\u003E either.\u003Cp\u003EAlso, this is on the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EDO NOT SUGGEST LIST\u003C/span\u003E which it is highly advisable to read before posting here.\u003C/p\u003E\u003Cp\u003EFinally, dude, you need to git the spell-check. Seriously. And also...\u0022non square\u0022? Where I come from, we use words like \u0022hexagonal\u0022 and \u0022trapezoidal\u0022 or even \u0022triangular\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, this isn\u0027t on the What Not To Suggest list. It is, however, on the Already Suggested List (which is not the same), because it pops up a lot. It\u0027s generally better to post into one of the existing subject threads (if there is significant content to add) rather than starting a new one.\u003C/p\u003E\u003Cp\u003EThat being said, please refrain from being harsh. Some people who visit the forums might not speak English as their first language, or may have other impediments. Point outs are fine, but being harsh is not required.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-12-08T11:27:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EI have heard that procedural fuel tanks will be implemented eventually, so hopfully the days of rediculous wobbly rockets of doom are over\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have not heard this. Can you provide a citation link? \u003C/p\u003E\u003Cp\u003Elast I heard the devs were against procedural part creation, which I have come to accept. Although I agree, in the case of wings, they do infact allow for more variation in craft design. \u003C/p\u003E\u003Cp\u003EI\u0027m on the fence about this.\u003C/p\u003E\u003Cp\u003EI would like to see more examples of Procedural wing shapes that could not be achieved with stock wing parts.\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-12-08T12:34:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EWell im pretty sure this was suggested some time before, but since i havent found any thread on 1st few pages, i suggest that procedural wings should be added to teh game.\u003Cp\u003EThe benefits are 2 fold:\u003C/p\u003E\u003Cp\u003EOne, lowers part count, since very large craft are nolonger required to be made of multiple wings ontop of wings.\u003C/p\u003E\u003Cp\u003ETwo, it allows much more customizability, especially when it comes to shape of a wing. Right now, the only way to get a particular wing shape is to clip 1-3 wings inside each other with each one becoming one of the sides you want. For more complex wing designs this becomes even more parts, that needlessly add part count and make it more harmful then good. \u003C/p\u003E\u003Cp\u003EI have heard that procedural fuel tanks will be implemented eventually, so hopfully the days of rediculous wobbly rockets of doom are over (ok i suck at rocket design, so maybee my designs do that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E). Id also like to see procedural structural plates, with teh ability to make them non square such as the procedural wings mod, this would make things liek capital ships/carriers/massive stations possible, with minimal strain on the system (i know unity5 update is coming out eventually which will hopefully fix that, but this would actually help as a easy temporary solution, that actually gives us more options in game).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAdding new wing parts litterally would demolish all the work put into the new wings that came with the last update. Simply put we don\u0027t need procedual wings. Yes they would decrease part count, and simplify the game more. But it would take away from what most people think of as the cominality of KSP. A similar statement can be said for procedual generated planets and systems. \u003C/p\u003E\u003Cp\u003EThe fuel tanks im against more than the wings. For the most part I like the current setup of fuel tanks. Theres pretty much a fuel tank for any need, and if you want something a little more custom, theres always tweakables. \u003C/p\u003E\u003Cp\u003EKSP is still a realistic space simulator game, so making huge ships, carriers and massive stations is possible, but not the main goal. Such things can easily be left for mods to do better.\u003C/p\u003E\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2014-12-08T14:20:11Z","Content":"\n\u003Cp\u003EI am happy with the fuel tank system as it is. Sure I would like an lfo/lf tweakable for some mk2 parts and the oscar b is a shame \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E but the basic system is ok. In my opinion the discussion on wings is still too early. I expect the improved aerodynamics to put a couple of significant aspects in that are likely to change the way stability, maneuverability and drag work. Lets see how the current system works there, especially with struts, which I expext to be unavoidable and still not a decent solution. I would be fine if they don\u0027t add procedural wings, although I do admit that they are rly nice. But a couple of smaller and bigger (niche) wings would do the job as well (at least for me). The part count argument is still valid and would be the real benefit I think.\u003C/p\u003E\u003Cp\u003EI\u0027m more curious about how they are planimg to handle paiload fairings. Fixed sizes aren\u0027t the best option from my point of view as they might not be flexible enough for a lot of payloads, still add a significant amount of parts to the menues and increase the part count of ships\u003C/p\u003E\u003Cp\u003Emassively. My opinion is that this is the area that rly needs a discussion.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-12-08T16:48:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MKI\u0022 data-cite=\u0022MKI\u0022\u003E\u003Cdiv\u003EAdding new wing parts litterally would demolish all the work put into the new wings that came with the last update. Simply put we don\u0027t need procedual wings. Yes they would decrease part count, and simplify the game more.\u003Cstrong\u003E But it would take away from what most people think of as the cominality of KSP. A similar statement can be said for procedual generated planets and systems. \u003C/strong\u003E\u003Cp\u003EThe fuel tanks im against more than the wings. For the most part I like the current setup of fuel tanks. Theres pretty much a fuel tank for any need, and if you want something a little more custom, theres always tweakables. \u003C/p\u003E\u003Cp\u003EKSP is still a realistic space simulator game, so making huge ships, carriers and massive stations is possible, but not the main goal. Such things can easily be left for mods to do better.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf we keep the current system, then used an unchangeable seed across all copies of the game, we can have semi-random, proceduraly generated planets that are common and consistent for everyone.\u003C/p\u003E\u003Cp\u003EBack on topic: procedural parts are most likely not going to be implemented, since they would get rid of the main challenge of the game: to accomplish something with what is given to you. The only procedural parts that might just be considered would be procedural fairings, for when they add the new aerodynamics system. Even then, that would just be for simplicity\u0027s sake. Other than that, all bets are off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-08T16:50:13Z\u0022 title=\u002212/08/2014 04:50  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 8, 2014\u003C/time\u003E by awsumindyman\u003C/strong\u003E\n\u003C/span\u003E\n"}]}