{"TopicId":92260,"ForumId":15,"TopicTitle":"Breakable Solar Panels","CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-08T05:45:02Z","PageNum":1,"Articles":[{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-08T05:45:02Z","Content":"\n\u003Cp\u003EI am looking for help in making my solar panels breakable. I\u0027ve done maybe ~30 different solar panels so far and they all have the same problem. When the \u0022break\u0022 the entire panel just vanishes instead of falling into pieces. The forum seems devoid of information on this. I copied the stock hierarchy and names and it didn\u0027t make a difference. \u003C/p\u003E\u003Cp\u003EI\u0027ve looked at other mods panels that do break properly and copied their names and hierarchies and it also didn\u0027t make a difference. When the panels break the entire thing vanishes. On some o the panels the \u0022base\u0022 is left while others the base disappears. I\u0027m not sure if there is some special thing I need to do in unity to make them breakable. The \u0022isbreakable\u0022 flag in the cfg doesn\u0027t seem to make any difference, I\u0027m not sure if it is depreciated or not.\u003C/p\u003E\u003Cp\u003EHere is an example of one of the panels with the \u0022vanishing\u0022 problem when it breaks:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5E0yPRA.png\u0022 alt=\u00225E0yPRA.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-08T16:17:10Z","Content":"\n\u003Cp\u003Eonly difference I can see is it looks like you are using mover object with mesh as child. the stock panels are animating the mesh objects directly. I haven\u0027t made a solar panel part so can\u0027t say for sure.\u003C/p\u003E\n"},{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-09T06:35:28Z","Content":"\n\u003Cp\u003EThat is because the panel was showing one way in the VAB and then flipping around 180 degrees once on the pad. In order to not have to redo all the animations I just rotated the parts using a blank transform. I do have panels that are literally pan1\u0026gt;pan2\u0026gt;pan3 etc... and they also don\u0027t work.\u003C/p\u003E\n"}]}