{"TopicId":92293,"ForumId":18,"TopicTitle":"Ubuntu","CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2014-12-08T17:09:11Z","PageNum":1,"Articles":[{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2014-12-08T17:09:11Z","Content":"\n\u003Cp\u003ENow I have two hard drives for my computer, one was being used by windows and the other was mostly empty. I decided to put Ubuntu on the spare one (well my friend did it actually (not that im blaming him I did some of it as well)). Now Windows is displaying the \u0022Boot MGR missing\u0022 error....\u003C/p\u003E\u003Cp\u003ESo now until I can get my computer fixed I\u0027m stuck with using Ubuntu. It runs KSP at about 3FPS, dosen\u0027t run TF2 or minecraft or in fact any game I have bothered to try on Ubuntu. I\u0027m now faced with reinstalling windows and basically starting my computer from scratch.\u003C/p\u003E\u003Cp\u003EThe only upside is that I can backup all my files though Ubuntu onto an external hard drive...\u003C/p\u003E\n"},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-12-08T18:54:37Z","Content":"\n\u003Cp\u003ESorry Ubuntu isn\u0027t working out for you. If you\u0027d post a little more information about your computer we might be able to help you get KSP working better (and Minecraft runs totally fine on Ubuntu by the way). Are you trying to launch Windows through GRUB? I think your best bet is to find your friend as he will be able to troubleshoot your issue much faster then we can here.\u003C/p\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2014-12-08T19:20:39Z","Content":"\n\u003Cp\u003EEw, Ubuntu, i\u0027d go with something like Linux mint.\u003C/p\u003E\n"},{"CreatedByName":"SpaceXray","CreatedById":113396,"CreatedDateTime":"2014-12-08T19:36:48Z","Content":"\n\u003Cp\u003EIt is never advised to install Ubuntu together with Windows on the same machine. They have a high risk of conflicting each other. Every computer geek knows that.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2014-12-08T19:37:22Z","Content":"\n\u003Cp\u003EWhat version of Windows?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-12-08T19:39:12Z","Content":"\n\u003Cp\u003EAlways worked for me, as long as you install Ubuntu or any version of Linux second, as Windows does not play nice.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-12-08T19:39:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceXray\u0022 data-cite=\u0022SpaceXray\u0022\u003E\u003Cdiv\u003EIt is never advised to install Ubuntu together with Windows on the same machine. They have a high risk of conflicting each other. Every computer geek knows that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis one apparently doesn\u0027t, what \u0027conflicts\u0027 might those be then?\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2014-12-08T19:54:40Z","Content":"\n\u003Cp\u003EMy initial thought is that a Windows Recover disc will fix your problem... boot it, let it find your Win install and repair the boot manager. Then, if you want, you can try reinstalling Ubuntu the proper way, by letting it know you want a dual-boot option but with the Ubuntu system residing on that 2nd drive.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E*edit*\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EOh, and, do you actually have 2 \u003Cem\u003Ephysical \u003C/em\u003Edrives? Or is it one drive with 2 logical partitions?\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-12-08T20:03:31Z","Content":"\n\u003Cp\u003EWord of warning: Windows boot repair (or install for that matter) will overwrite the MBR on the first disk in the machine without prompting. If you have a non-MS OS on another disk, unplug it before doing a Windows boot \u0027repair\u0027.\u003C/p\u003E\u003Cp\u003EThe situation you are in now is probably fairly straightfoward to fix without reinstalling anything, but need to know disk/partition layout \u0026amp; where your bootloaders are/are supposed to be.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-08T20:08:29Z\u0022 title=\u002212/08/2014 08:08  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 8, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2014-12-08T20:07:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022steve_v\u0022 data-cite=\u0022steve_v\u0022\u003E\u003Cdiv\u003EWord of warning: Windows boot repair (or install for that matter) will overwrite the MBR on the first disk in the machine without prompting. If you have a non-MS OS on another disk, unplug it before doing a Windows \u0027boot repair\u0027.\u003Cp\u003EThe situation you are in now is probably fairly straightfoward to fix without reinstalling anything, but need to know disk/partition layout \u0026amp; where your bootloaders are/are supposed to be.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was thinking that, being he just installed Ubuntu, it wouldn\u0027t matter... he\u0027s not done anything with it yet (created data etc). But, yea that ^\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-12-08T20:14:26Z","Content":"\n\u003Cp\u003EWhat I\u0027m thinking is that if you installed Linux second, it tends to overwrite the MBR with a new one. If it\u0027s not bringing up a proper boot menu, try switching the default boot drive to the Linux one instead; it may have your windows boot data in that MBR as well.\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2014-12-09T12:23:54Z","Content":"\n\u003Cp\u003ENever mind, ill just reinstall windows. Its taught me a VERY VERY good lesson though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sndrtj","CreatedById":110589,"CreatedDateTime":"2014-12-09T22:12:47Z","Content":"\n\u003Cp\u003EThe windows boot manager is of absolutely no use when you want dual boot systems with Linux. It will only recognize itself. Did you install windows after you installed Ubuntu? Generally, you should do the opposite - installing Ubuntu after Windows - and the Ubuntu boot manager - GRUB - can detect any system, not just Linuxes. \u003C/p\u003E\u003Cp\u003ESo, to fix the problem: Boot Ubuntu (or any variety of distros) from a usb drive of liveCD. Then follow these instructions: \u003Ca href=\u0022http://howtoubuntu.org/how-to-repair-restore-reinstall-grub-2-with-a-ubuntu-live-cd\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://howtoubuntu.org/how-to-repair-restore-reinstall-grub-2-with-a-ubuntu-live-cd\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022montyben101\u0022 data-cite=\u0022montyben101\u0022\u003E\u003Cdiv\u003ENever mind, ill just reinstall windows. Its taught me a VERY VERY good lesson though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou DONT have to reinstall windows. That\u0027s quite a drastic measure for something quite simply. Just fix GRUB per last post.\u003C/p\u003E\n"},{"CreatedByName":"nukeboyt","CreatedById":68397,"CreatedDateTime":"2014-12-10T01:33:55Z","Content":"\n\u003Cp\u003EThe best solution for me was to install an extra hard drive. After first disconnecting the Windows drive, I then installed Kubuntu and got everything running. Then I reconnected the windows drive. Now all I have to do is tap to enter Bios on start-up and choose which hard disk to boot from. This way I didn\u0027t have to worry about any boot-loader conflicts.\u003C/p\u003E\n"}]}