{"TopicId":92381,"ForumId":16,"TopicTitle":"Newbie question \u0026quot;No comms devices\u0026quot;","CreatedByName":"pnc89","CreatedById":131421,"CreatedDateTime":"2014-12-09T17:19:21Z","PageNum":1,"Articles":[{"CreatedByName":"pnc89","CreatedById":131421,"CreatedDateTime":"2014-12-09T17:19:21Z","Content":"\n\u003Cp\u003ENo matter what I do, I continue to see \u0022No comms devices\u0022 messages when I try to send reports and surfaces samples back. I have 3 Communotron 16s on my ship, and I extend them before exiting my pod, but on the ground I still get the \u0022No comms devices\u0022 messages. What gives?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-12-09T17:24:31Z","Content":"\n\u003Cp\u003EAre you playing with any mods, RemoteTech in particular?\u003C/p\u003E\n"},{"CreatedByName":"pnc89","CreatedById":131421,"CreatedDateTime":"2014-12-09T17:35:49Z","Content":"\n\u003Cp\u003Enope, no mods at all\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-09T17:45:18Z","Content":"\n\u003Cp\u003EYou have to get back into the pod to transmit the data, if I understand what you\u0027re trying to do correctly.\u003C/p\u003E\u003Cp\u003EEdit: Also, welcome to the forums!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-09T17:55:54Z\u0022 title=\u002212/09/2014 05:55  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 9, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-09T17:54:55Z","Content":"\n\u003Cp\u003EUh, are you trying to transmit data from the kerbal while EVA? Because there are no antennas on the EVA suit, so you can\u0027t send EVA data back and it says you have no comms devices. Return inside the pod, the report will be available in the pod too for transmitting back to base.\u003C/p\u003E\n"},{"CreatedByName":"DrD","CreatedById":103953,"CreatedDateTime":"2014-12-10T00:59:39Z","Content":"\n\u003Cp\u003EI had this problem also, I can\u0027t remember exactly what I did but I think you have to right click on capsule, then click on review reports, then click on transmit from the window that opens. If you try to do it by right clicking on comm device and clicking on transmit data you get that message. I think it\u0027s a bug.\u003C/p\u003E\n"},{"CreatedByName":"Fr8monkey","CreatedById":76199,"CreatedDateTime":"2014-12-10T05:22:22Z","Content":"\n\u003Cp\u003EMake sure you have power. No juice... no transmit. ALWAYS have batteries and power generation on your ship.\u003C/p\u003E\n"},{"CreatedByName":"SukaiSky","CreatedById":123419,"CreatedDateTime":"2014-12-11T13:50:38Z","Content":"\n\u003Cp\u003ETry extending it while staying in the pod\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-12-11T16:51:28Z","Content":"\n\u003Cp\u003EI think Red Iron Crown has your answer. A kerbal on EVA cannot transmit on his own. You need to either store the science in the pod by right clicking on it and selecting \u0022store,\u0022 or get back in the capsule.\u003C/p\u003E\u003Cp\u003EYou can then transmit the science later by right clicking on the pod and reviewing data (you need a probe core or kerbal on board). Be careful about transmitting science from pods. You can end up sending all of it, including surface samples, if you aren\u0027t careful. If that isn\u0027t what you wanted to do, it would result in lost science (because some experiments have a transmission cap).\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"}]}