{"TopicId":92482,"ForumId":55,"TopicTitle":"Question about the Do\u0026#039;s and Don\u0026#039;t\u0026#039;s of Development Discussion","CreatedByName":"Baconation","CreatedById":122914,"CreatedDateTime":"2014-12-10T18:29:21Z","PageNum":1,"Articles":[{"CreatedByName":"Baconation","CreatedById":122914,"CreatedDateTime":"2014-12-10T18:29:21Z","Content":"\n\u003Cp\u003EJust wondering on what isn\u0027t allowed to be talked about. I was looking through some of the file folders in my installation of KSP and saw something that really alludes to a future feature about private contracting that I haven\u0027t seen any discussion about. Would talking about something like this be considered against the rules? Or would I be okay talking about it?\u003C/p\u003E\u003Cp\u003EEssentially, is talking about something that was data mined against the rules?\u003C/p\u003E\u003Cp\u003EWarning!!! Spoilers in this thread!!! ( I think)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-11T22:00:54Z\u0022 title=\u002212/11/2014 10:00  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 11, 2014\u003C/time\u003E by Baconation\u003C/strong\u003E\n\u003Cbr\u003Egiving warning for spoilers\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-12-10T19:19:47Z","Content":"\n\u003Cp\u003EDiscussion of the files should be acceptable, but you can\u0027t post any \u003Cem\u003Ecode\u003C/em\u003E you find in there.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-10T19:43:31Z","Content":"\n\u003Cp\u003EWhat did you find? Digging around files that are distributed with the game is fair, if it was meant to be hidden I\u0027d think it would have been obfuscated.\u003C/p\u003E\u003Cp\u003EAlso: Welcome to the forums!\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-12-10T20:30:38Z","Content":"\n\u003Cp\u003EI also see no reason why it\u0027d be against the rules. I have to say, I\u0027m intrigued now.\u003C/p\u003E\n"},{"CreatedByName":"Baconation","CreatedById":122914,"CreatedDateTime":"2014-12-11T21:49:32Z","Content":"\n\u003Cp\u003EFirstly, thanks for welcoming me to the forums. I\u0027ve been visiting here for a loooooong time, but never have had the opportunity to join in discussions and such. I actually didn\u0027t think that this thread was my first post \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOkay, so I saw that Agencies that offer contracts are going to have different mindsets, which will affect the types of contracts given by each agency.\u003C/p\u003E\u003Cp\u003EFor example... Commercial, Conglomerate, Hasty, Pioneering, Scientific, Kerbalminded.\u003C/p\u003E\u003Cp\u003EEach mindset seems to have a specific quality, like offering contracts specifically to do something that has never been done before, or setting up conditions against losing Kerbals, or even completing the mission in a \u0022Hasty\u0022 manner. \u003C/p\u003E\u003Cp\u003EAlso in there is a company that competes against companies we have a negative standing towards, and even companies that offer higher stake reputation gains or losses based on the success or failure of a mission.\u003C/p\u003E\u003Cp\u003ESo reputation will be specific to certain companies. You can be on the bad side of some, or the hero of others, and I think it will affect how much a contract from a company can provide if completed based on reputation with that specific company.\u003C/p\u003E\u003Cp\u003EIf this in anyway is a post not allowed, please forgive me being naÃƒÂ¯ve about the forum rules. I would not be offended of a moderator deleted this thread if it violates any sort of player/developer guidelines. Secondly, if this is being discussed elsewhere in the forums, just disregard this as a double post \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-11T22:24:19Z","Content":"\n\u003Cp\u003EEr, I think that\u0027s an already-implemented feature. Agencies are the companies that offer contracts, and they offer different ones based on your overall reputation and your history of completing contracts for them. I believe the different mindsets affects, as you suspect, the types of contracts offered.\u003C/p\u003E\n"},{"CreatedByName":"Baconation","CreatedById":122914,"CreatedDateTime":"2014-12-11T22:31:42Z","Content":"\n\u003Cp\u003EOkay, I wasn\u0027t sure if it was something that was fully realized within the game yet. I was thinking the interface may change within the system to be more emphasizing on those mentalities for each agency. Seeing as the contract generation stories each are based differently on the type of mentality of each agency. Gamedata/Squad/Agencies is where I found this information. I\u0027ve logged almost a thousand hours of playtime and had yet to see any elaboration in the game on those mentalities, or even something that mentions it in game on the UI, or within some sort of informative parameter. I think right now, the contract system is very basic, and with the implementation of the Fine Print mod, we will see a much more substantial contract system, that will hopefully include more information in-game about the mentalities of these agencies. I just think it may be too confusing for the player if it was something that was never visually implemented.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-11T22:36:17Z","Content":"\n\u003Cp\u003EYou could be right, they might be planning to make the underpinnings of the contract system more visible to the player. We\u0027ll have to wait and see, I guess.\u003C/p\u003E\n"},{"CreatedByName":"Baconation","CreatedById":122914,"CreatedDateTime":"2014-12-11T22:39:37Z","Content":"\n\u003Cp\u003EYep, much agreed that it\u0027s going to be a wait and see, but should be exciting to see if it is added or not. It should add a good feel to the whole contract system and really have the player focus on whether they want to be in good with certain companies and such. Just seems like it will create more of a personalization in each person\u0027s career save without really affecting craft files and such for sharing.\u003C/p\u003E\n"}]}