{"TopicId":92745,"ForumId":51,"TopicTitle":"Custom Difficulty 10% Rewards: Game Balance Test!","CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-12-13T20:28:21Z","PageNum":1,"Articles":[{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-12-13T20:28:21Z","Content":"\n\u003Cp\u003EI recently abandoned my custom difficulty career save on 20% contract rewards, as it was getting too easy and I felt I wasn\u0027t pushing myself hard enough. I started a new save on 10% contract rewards.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5WMTN8m.jpg\u0022 alt=\u00225WMTN8m.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote that I leave quickloading and reverting turned on in case I need to recover from bugs! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HPlezn4.jpg\u0022 alt=\u0022HPlezn4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0fBOicP.jpg\u0022 alt=\u00220fBOicP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI normally try to be cost effective by making all liquid fuelled stages re-useable and performing secondary contracts along the way. For example, I usually try to recover the second stage and perform other contracts such as rescuing a stranded kerbal. The example below is from an earlier save on 20% rewards.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/B2soHgS.jpg\u0022 alt=\u0022B2soHgS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ozACTPA.jpg\u0022 alt=\u0022ozACTPA.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6JHA6g0.jpg\u0022 alt=\u00226JHA6g0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECurrent career mode balance presents the player with an uphill struggle to complete the Explore The Mun contract, and becomes massively easier thereafter. I did some contract grinding to get enough money to build the rocket pictured below. Note the use of an all solid first stage to minimise cost. This time, I needed to go all out to complete the Explore The Mun contract. Funds saved through doing secondary contracts along the way, or through recovery, are worth nothing if I don\u0027t complete the primary mission. In addition, I have barely enough money to build the rocket, so I have nothing to spare to pay for any extra parts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/v9Ixo1p.jpg\u0022 alt=\u0022v9Ixo1p.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/r4FstkG.jpg\u0022 alt=\u0022r4FstkG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BTDzBBi.jpg\u0022 alt=\u0022BTDzBBi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI performed a minimum fuel landing by aiming for a Mun periapsis that grazes the Mun\u0027s surface from my injection burn in LKO. This means that I don\u0027t really know which part of the Mun I\u0027m going to end up landing on. As it turned out, I ended up landing in an area that was in sunset, but not yet in full darkness, so I was able to land safely.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qIs09Ei.jpg\u0022 alt=\u0022qIs09Ei.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LPAeYKR.jpg\u0022 alt=\u0022LPAeYKR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt this point, all that remains is to return home safely and recover my data to complete the contracts. From this point onwards, I can easily earn enough resources to perform whatever missions I want to undertake.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ETaxq2s.jpg\u0022 alt=\u0022ETaxq2s.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UhrXs6G.jpg\u0022 alt=\u0022UhrXs6G.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ey4IPcZ.jpg\u0022 alt=\u0022Ey4IPcZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y9L5Qs0.jpg\u0022 alt=\u0022y9L5Qs0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI wanted to prove to myself that I could crack Career Mode on 10% rewards before 0.90 was released. Job done! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-12-13T21:03:32Z","Content":"\n\u003Cp\u003EYeah, without building upgrades to worry about yet, you don\u0027t really feel much of a pinch even at 10% reward rates if you\u0027re a particularly skilled player. Once you have to drop a cumulative million or so Funds to get your space center from entry-level to top-tier, however, I think you\u0027ll find that 10% rewards turn the experience into a grindfest. Just my prediction.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-12-13T21:29:36Z","Content":"\n\u003Cp\u003EMoved this mission report to mission reports.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-12-13T21:36:35Z","Content":"\n\u003Cp\u003EI\u0027ve been testing the current implementation of Career Mode on progressively harder difficulty. I wanted to see how game balance and progression worked, and establish whether there was a point of no return, beyond which the game was too hard to be playable. It turns out that with careful ship design and mission planning, even a 10% rewards career is playable in 0.25.\u003C/p\u003E\u003Cp\u003EIn 0.25, the game starts out hard, but gets massively easier after the first Mun landing. When 0.90 is released, I\u0027ll be comparing how the difficulty curve is affected by the new features.\u003C/p\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-12-13T22:23:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EYeah, without building upgrades to worry about yet, you don\u0027t really feel much of a pinch even at 10% reward rates if you\u0027re a particularly skilled player. Once you have to drop a cumulative million or so Funds to get your space center from entry-level to top-tier, however, I think you\u0027ll find that 10% rewards turn the experience into a grindfest. Just my prediction.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis won\u0027t be the case I believe. I dropped it even lower than 10% and was unlocking things left and right, and still had a ton of cash. (THis was with the old \u0022fine-print\u0022) They\u0027ll have to rebalance fine-print before they add it, otherwise, it will be counterintuitive. (edit) with the cash--\u0026gt; science or Science--\u0026gt;cash setting available. It\u0027s almost easy mode regardless.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-13T22:27:01Z\u0022 title=\u002212/13/2014 10:27  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 13, 2014\u003C/time\u003E by Talavar\u003C/strong\u003E\n\u003C/span\u003E\n"}]}