{"TopicId":92914,"ForumId":32,"TopicTitle":"KSP 0.90 \u0026#039;Beta Than Ever\u0026#039; Grand Discussion Thread!","CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-12-15T13:22:29Z","PageNum":13,"Articles":[{"CreatedByName":"Ciechosz","CreatedById":18882,"CreatedDateTime":"2014-12-16T07:22:15Z","Content":"\n\u003Cp\u003EAnd we can have floating parts!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wHF1HhX.jpg\u0022 alt=\u0022wHF1HhX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThank you for the offset option!\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2014-12-16T07:23:37Z","Content":"\n\u003Cp\u003EI missed the hype?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI MISSED THE HYPE?\u003C/p\u003E\n"},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2014-12-16T07:33:33Z","Content":"\n\u003Cp\u003EMy thanks, KSP devs. Keep up the good work and may the Kraken not be with you.\u003C/p\u003E\u003Cp\u003EIf I don\u0027t count the science update (Guess it was .21? Totally changed the meaning of the game for me), this is the best update so far.\u003C/p\u003E\u003Cp\u003EEDIT: Wait... did you say ESA flag? KRosetta on the launchpad, launch in T - 10 s!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T07:35:38Z\u0022 title=\u002212/16/2014 07:35  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by InterCity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-12-16T07:42:54Z","Content":"\n\u003Cp\u003ELack of batteries is a big problem\u003C/p\u003E\n"},{"CreatedByName":"Fr8monkey","CreatedById":76199,"CreatedDateTime":"2014-12-16T07:43:57Z","Content":"\n\u003Cp\u003EI play on hard in .25, and do good. I play on hard in .90, and I am crying in the corner. It is tough.\u003C/p\u003E\u003Cp\u003EI think they should change \u0027Hard\u0027 mode to \u0027Scott Manley\u0027 Mode...\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-12-16T07:50:46Z","Content":"\n\u003Cp\u003ESeveral threads have been merged into this master thread. Let\u0027s please not scatter the feedback, reactions, and discussion across numerous places around the forum.\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2014-12-16T08:17:42Z","Content":"\n\u003Cp\u003EDefinitely harder than 0.25. Started an unmodded game on moderate difficulty, and am having a heck of a time getting enough money to upgrade my facilities. The rough runway certainly doesn\u0027t help early plane efforts.\u003C/p\u003E\u003Cp\u003EWhile it\u0027s definitely challenging, I\u0027m not sure if the fun quotient has increased at all. Jury is still out.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2014-12-16T08:19:54Z","Content":"\n\u003Cp\u003ER.I.P. My final exams\u003C/p\u003E\n"},{"CreatedByName":"Secuas","CreatedById":126000,"CreatedDateTime":"2014-12-16T08:23:17Z","Content":"\n\u003Cp\u003EUpdate feels good man.\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2014-12-16T08:34:46Z","Content":"\n\u003Cp\u003EYES YES YES!\u003C/p\u003E\u003Cp\u003ENow I can build really ugly cargo shuttles no deliver lots of modules to my bases! Great work on the update, Squad. I don\u0027t think there is any game better than Kerbal Space Program. I can\u0027t wait to check this out!\u003C/p\u003E\u003Cp\u003E[Edit]: EVERYONE CHECK OUT THE EASTER EGGS they might be back!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T08:58:07Z\u0022 title=\u002212/16/2014 08:58  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by DMSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"johnsonwax","CreatedById":79077,"CreatedDateTime":"2014-12-16T08:46:00Z","Content":"\n\u003Cp\u003EI have to agree with the above - this is a much different (and better) game. I agree that we need a tier between 2 and 3, and possibly two tiers in there with some tweaks.\u003C/p\u003E\u003Cp\u003E1) The current setup still favors rocketry a bit too much over planes (yes, I realize it\u0027s Kerbal SPACE Program) but you do have to get a bit far before you get a jet engine, and that really needs to be moved forward quite a lot.\u003C/p\u003E\u003Cp\u003E2) I\u0027d make the hangar/runway upgrades decently cheaper than the VAB/launchpad to encourage advancing there first. As noted above, getting jets going quickly really opens up science/funds through judicious selection of part testing and overflights. \u003C/p\u003E\u003Cp\u003E3) I think TAC or something to that effect is needed to get that tier between 2 and 3 for extraplanetary manned exploration. Delta-v to other planets for a capsule is not hard. Delta-v to other planets for a ship with enough space and food and water and such for 2 years is an entirely different proposition. That\u0027s also needed for Kerbin SOI stations/bases, and something more (resource extraction \u002B closed loop systems, even simple ones) for extraplanetary stations/bases.\u003C/p\u003E\u003Cp\u003E4) The building upgrades are a little too unobvious. Since you can enter each one, I\u0027d add a button/status indicator on the activity screens for each building. I can see a lot of people completely missing the upgrade functionality. \u003C/p\u003E\u003Cp\u003E5) The missions seem a bit unbalanced in that they offer up many missions that are effectively impossible to achieve, and with an early limit of 2, it\u0027s really easy to take missions you later realize you can\u0027t possibly upgrade to achieve. I\u0027m a pretty experienced player and I have to be extremely careful what to accept given the bounds of what I know is feasible with the science I\u0027ve unlocked and the parts I can afford. If I take that Kolniya orbit around Minmus with power and an antenna and a materials bay and goo container mission before I have solar and the 48-7S unlocked means that I\u0027ve burned half of my available mission slots and have to rack up 180 science on a single slot or face a failure penalty of half of my cash.\u003C/p\u003E\u003Cp\u003ETo put a finer point on 5) - the game as currently set up is actually much harder in the early stage than it will be in later stages, and that strikes me as a bit wrong toward getting new players on board. Perhaps the nature of the missions could be adjusted in accordance with the difficulty so that at the easiest settings you don\u0027t get any missions that you don\u0027t have the science/parts/limitations to do. That\u0027s not necessarily easy to sort out, but I think it\u0027s necessary toward balance. New players on easier settings shouldn\u0027t get caught up against nearly impossible missions with so few avenues to get out of them.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-16T08:48:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EPer kerbal. In other words, you can\u0027t simply launch your kerbal into a short Kerbin flight over and over to earn XP. You must give them new experiences.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOoh, this would works awesomely with final frontier mod.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-12-16T08:50:39Z","Content":"\n\u003Cp\u003ECan anybody already give a report about stability of the current 0.9 x64 version of KSP?\u003C/p\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2014-12-16T08:52:08Z","Content":"\n\u003Cp\u003EWOW Squad, this update is just.....WOW, the editor overhaul is just WOW, for the first time since i started playing this game i am at a loss of how to build things (in a good way that is), started building a ship and with all the tweaks i spent almost an hour just to make it look good with the new gizmos, the possibilities are limitless. Those fuel lines and struts are just WOW, the new autopilot assistance, just WOW the ships fly more straight than ever when pointed at a direction. This update is the best update ever, keep on the good job after a well Christmas rest, you deserve it. I\u0027ll just go now and hyperventilate somewhere quiet.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3w1ej.gif\u0022 alt=\u00223w1ej.gif\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2014-12-16T08:53:13Z","Content":"\n\u003Cp\u003ESo, for the precision landing issues, a recommendation. Create a Parachute Jet. Also takeoff/land off the runway if you\u0027re not used to it.\u003C/p\u003E\u003Cp\u003EParachute Jet has two Kerbals in it. A pilot for SAS, an Engineer for resetting your parachutes. Make sure your Engineer gets up to level 2 (where in the Astronaut center it says he can repack chutes). If you\u0027re not used to doing this (like I wasn\u0027t) make sure you bring expendable Kerbals. No reason to lose Jeb and Bill while you\u0027re getting yourself figured out.\u003C/p\u003E\u003Cp\u003EBasically, enough fuel to fly, two cockpits, some landing gear and wings. 4x parachutes. Spread \u0027em around the COM. Get to target like you\u0027re thinking about landing, turn on the brakes, pop the chutes. You CAN land on your engine under 10 m/s if you foul it up (which is why I now recommend spreading around your parachutes). Obviously try to avoid 70degree slopes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve recorded my run on hard so far, and am debating on youtubing it. Sounds like there might be interest, I\u0027ll try to get \u0027em post-production processed here tomorrow. Warning in case there is: I am NOT the best pilot out there, nor am I a rocket scientist. I do know how to do the dV equation though. I missed some targets, I\u0027ve killed poor Roger Kermin, and some poor soul is STILL stuck up in orbit. I\u0027m messing around trying to figure out the best approaches to these new missions. So it sure as heck ain\u0027t a Scott Manley perfection run. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E However, this is the version of KSP I\u0027ve been waiting for since 0.16 or so? I forget, it\u0027s been a WHILE... but either way, I love it.\u003C/p\u003E\u003Cp\u003EAs a note: A \u0022drop bomb\u0022 of an okto \u002B thermostat \u002B parachute does not work as hoped for getting into crappy LZ\u0027s... you pull out of 2.5k range far too quickly, particularly in mountains.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T08:56:02Z\u0022 title=\u002212/16/2014 08:56  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by WanderingKid\u003C/strong\u003E\n\u003Cbr\u003EWrong level on Engineer, sorry.\n\u003C/span\u003E\n"},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2014-12-16T08:59:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xavven\u0022 data-cite=\u0022Xavven\u0022\u003E\u003Cdiv\u003EOkay, now for my one piece of constructive criticism. There was only one boring lull during my campaign so far, and that was when I was doing Kerbin survey contacts while saving up for a launchpad. Satellite contracts would have been way more fun. Maybe satellite contracts should appear earlier in the game, at the same time as survey contracts once you\u0027ve proven you can make orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESatellite Contracts appear as soon as you can get access to electricity via Solar Panels and one of the Probe Cores. Until then you won\u0027t see them because you can\u0027t fulfill the requirements.\u003C/p\u003E\n"},{"CreatedByName":"Theoderich","CreatedById":111972,"CreatedDateTime":"2014-12-16T09:02:25Z","Content":"\n\u003Cp\u003EGreat update. The building system is nice, the new editor tools are really, really awesome, and kerbal xp is on a good way. \u003C/p\u003E\u003Cp\u003EBy that I mean that it could be made clearer ingame what gives, xp. And looking at the patch notes, also some more abilities for the highest ranks would be nice. Suicide burns for pilots come to mind here, or buffing engineers by giving them more readouts the higher they level, or decreased resource use. \u003C/p\u003E\u003Cp\u003EBut hey, it\u0027s a new system, doesn\u0027t need to be perfected already \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn order to not end the post on a slightly negative mood, let me just say again how much I love the new editor tools!\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2014-12-16T09:12:37Z","Content":"\n\u003Cp\u003EThank you, Squad! \u003C/p\u003E\u003Cp\u003ESleep loss now in progress.\u003C/p\u003E\n"},{"CreatedByName":"WWEdeadman","CreatedById":105591,"CreatedDateTime":"2014-12-16T09:19:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alewx\u0022 data-cite=\u0022Alewx\u0022\u003E\u003Cdiv\u003ECan anybody already give a report about stability of the current 0.9 x64 version of KSP?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlaying 0.\u003Cem\u003E90\u003C/em\u003E in 64 bit is pretty much pointless for career mode at the moment, since the buildings show as fully upgraded at the start, but don\u0027t function as fully upgraded, but as tier 1. This makes progrssion pretty much impossible, and career mode effectively unplayable on 64 bit. So, I guess almost no one will even bother using 64 bit at the moment.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-12-16T09:25:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WWEdeadman\u0022 data-cite=\u0022WWEdeadman\u0022\u003E\u003Cdiv\u003EPlaying 0.\u003Cem\u003E90\u003C/em\u003E in 64 bit is pretty much pointless for career mode at the moment, since the buildings show as fully upgraded at the start, but don\u0027t function as fully upgraded, but as tier 1. This makes progrssion pretty much impossible, and career mode effectively unplayable on 64 bit. So, I guess almost no one will even bother using 64 bit at the moment.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk then it was my mistake in the way I asked, I\u0027m about the sandbox, for constructing some pretty insane mega stuff.\u003C/p\u003E\u003Cp\u003ECarreer is nice but not really my part of the game.\u003C/p\u003E\n"},{"CreatedByName":"Avalon304","CreatedById":68304,"CreatedDateTime":"2014-12-16T09:27:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WWEdeadman\u0022 data-cite=\u0022WWEdeadman\u0022\u003E\u003Cdiv\u003EPlaying 0.\u003Cem\u003E90\u003C/em\u003E in 64 bit is pretty much pointless for career mode at the moment, since the buildings show as fully upgraded at the start, but don\u0027t function as fully upgraded, but as tier 1. This makes progrssion pretty much impossible, and career mode effectively unplayable on 64 bit. So, I guess almost no one will even bother using 64 bit at the moment.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat about in Sandbox mode? Is 64-bit stable now in Sandbox?\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-12-16T09:28:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avalon304\u0022 data-cite=\u0022Avalon304\u0022\u003E\u003Cdiv\u003EWhat about in Sandbox mode? Is 64-bit stable now in Sandbox?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore stable than 0.25, and somehow useable, would be enough for me.\u003C/p\u003E\u003Cp\u003EWelcome to the memory suffering group \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WWEdeadman","CreatedById":105591,"CreatedDateTime":"2014-12-16T09:29:13Z","Content":"\n\u003Cp\u003EIt\u0027s never been unstable to me, so I can\u0027t really say.\u003C/p\u003E\n"},{"CreatedByName":"Eskandare","CreatedById":62742,"CreatedDateTime":"2014-12-16T09:32:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WWEdeadman\u0022 data-cite=\u0022WWEdeadman\u0022\u003E\u003Cdiv\u003EPlaying 0.\u003Cem\u003E90\u003C/em\u003E in 64 bit is pretty much pointless for career mode at the moment, since the buildings show as fully upgraded at the start, but don\u0027t function as fully upgraded, but as tier 1. This makes progrssion pretty much impossible, and career mode effectively unplayable on 64 bit. So, I guess almost no one will even bother using 64 bit at the moment.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDespite not career working in x64 how it the general program stability? I guess time to very carefully decided what mods I\u0027m using plus what mods I\u0027m working on.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-12-16T09:32:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WWEdeadman\u0022 data-cite=\u0022WWEdeadman\u0022\u003E\u003Cdiv\u003EIt\u0027s never been unstable to me, so I can\u0027t really say.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you are Linux user? They never had the same problem as the windows.\u003C/p\u003E\n"}]}