{"TopicId":93102,"ForumId":69,"TopicTitle":"Overly long loading time.","CreatedByName":"Wyld Karde","CreatedById":55633,"CreatedDateTime":"2014-12-16T13:57:13Z","PageNum":1,"Articles":[{"CreatedByName":"Wyld Karde","CreatedById":55633,"CreatedDateTime":"2014-12-16T13:57:13Z","Content":"\n\u003Cp\u003ESo to celebrate the release of 0.90 I decided to start fresh. I uninstalled the game through Steam and deleted it\u0027s folder to make sure all mod files were cleared out, then reinstalled the game. Upon launch it\u0027s taking forever to load. Looking at the loading screen and my hard drive activity it seems as though the game is loading a single file, pausing for a second or so, then loading the next file, and so on. Anyone have any ideas why this is happening or how to fix it?\u003C/p\u003E\u003Cp\u003EI\u0027m running 32-bit KSP 0.90 on an Intel Core 2 Duo 2.4 under Windows 7 64 with 6GB of RAM and an Nvidia GeForce GTX 650.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-12-16T13:58:21Z","Content":"\n\u003Cp\u003EIf you\u0027re talking about more than 3-5 minutes to load the game it may be worth checking to see if you have any virtual network adapters installed, the most common one is called Hamachi. If you do have them, disable them before launching KSP.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-12-16T17:46:57Z","Content":"\n\u003Cp\u003EIt\u0027s usually what KasperVld said. But if you deleted everything, you might want to check your antivirus whitelist (or exceptions list) also.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"},{"CreatedByName":"Wyld Karde","CreatedById":55633,"CreatedDateTime":"2014-12-16T20:13:35Z","Content":"\n\u003Cp\u003ENo virtual network that I can find, and I\u0027ve whitelisted ksp.exe. Still taking an age to load. Do you have any further suggestions?\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2014-12-16T22:35:50Z","Content":"\n\u003Cp\u003EAs far as I know, the long loading times can occur with any unused network adapter, not just Hamachi.\u003C/p\u003E\u003Cp\u003EIf there\u0027s an ethernet (or anything else) adapter that\u0027s not currently being used for your internet connection, try disabling those too.\u003C/p\u003E\n"},{"CreatedByName":"Wyld Karde","CreatedById":55633,"CreatedDateTime":"2014-12-16T22:55:20Z","Content":"\n\u003Cp\u003EAfter a closer look, it turns out it \u003Cem\u003Ewas\u003C/em\u003E Hamachi. Slippery li\u0027l pain in the main thruster was hiding away until I ran a full uninstall on the program. KSP\u0027s loading fine now. So thanks everyone, and sorry I didn\u0027t catch it when it was first suggested. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"}]}