{"TopicId":93183,"ForumId":16,"TopicTitle":"dV calculate and dV actual are way off - where am I being stupid?","CreatedByName":"mjl1966","CreatedById":105019,"CreatedDateTime":"2014-12-16T21:07:24Z","PageNum":1,"Articles":[{"CreatedByName":"mjl1966","CreatedById":105019,"CreatedDateTime":"2014-12-16T21:07:24Z","Content":"\n\u003Cp\u003EOK, I\u0027m just trying to sort out how to use the in game parms to correctly plug into the rocket equation. Please help me understand where I went wrong.\u003C/p\u003E\u003Cp\u003ETEST VEHICLE:\u003C/p\u003E\u003Cp\u003EMKI\u003C/p\u003E\u003Cp\u003EFL-T400\u003C/p\u003E\u003Cp\u003ELV-T30\u003C/p\u003E\u003Cp\u003EMASS (dry, I think) Using the reported component mass sans fuel mass. \u003C/p\u003E\u003Cp\u003EM(mki) 0.84\u003C/p\u003E\u003Cp\u003EM(flt400) 2.25*\u003C/p\u003E\u003Cp\u003EM(lvt30)1.25\u003C/p\u003E\u003Cp\u003ESo, Mo = 4.34. (i box reports 4.3, so far so good)\u003C/p\u003E\u003Cp\u003EFUEL MASS\u003C/p\u003E\u003Cp\u003EProp 0.9\u003C/p\u003E\u003Cp\u003EOx 1.1\u003C/p\u003E\u003Cp\u003ESo, Mf = 2.0\u003C/p\u003E\u003Cp\u003EUsing the *BIG FAT SCIENTIFIC ASSUMPTION that the reported mass of the fuel tank (2.25) is its dry mass, we get\u003C/p\u003E\u003Cp\u003EMT=6.34\u003C/p\u003E\u003Cp\u003EIsp = 320.\u003C/p\u003E\u003Cp\u003EPlugging into tyranny equation: \u003C/p\u003E\u003Cp\u003EdV=320*9.82*ln(6.34/4.34) = 1190.\u003C/p\u003E\u003Cp\u003EEmperical vertical launch at 100% and 50% throttle only gets me to v=570\u003C/p\u003E\u003Cp\u003ESo, questions:\u003C/p\u003E\u003Cp\u003Ea.) Am I calculating this incorrectly? \u003C/p\u003E\u003Cp\u003Eb.) Does drag really suck up that much dV?\u003C/p\u003E\u003Cp\u003Ec.) all of the above?\u003C/p\u003E\u003Cp\u003E*Of note: assuming reported fuel tank mass includes fuel mass, the calculated dV is 1966, which is even more way off.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T01:35:41Z\u0022 title=\u002212/18/2014 01:35  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by mjl1966\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2014-12-16T22:23:33Z","Content":"\n\u003Cp\u003EThe calculated delta-v of a vehicle is what it would produce in the absence of gravity and drag. When you launch from Kerbin you are experiencing gravity and drag losses, so the actual velocity attained by your vehicle will be considerably lower than your calculated delta-v. For instance, if you are accelerating off the launch pad with a thrust-to-weight ratio of 1.5, then 2/3rd of you thrust is simply cancelling out gravity. You\u0027ll lift off the pad with an apparent acceleration of only 0.5 g.\u003C/p\u003E\u003Cp\u003EDoes this sound like your problem?\u003C/p\u003E\u003Cp\u003E(edited to add)\u003C/p\u003E\u003Cp\u003EThe solution is to over design you delta-v to account for the expected losses. For example, it is generally accepted that in the stock game it takes about 4500 m/s delta-v to reach low Kerbin orbit. However, actual orbital velocity is a little less than 2300 m/s. The difference is the gravity and drag losses.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T22:29:44Z\u0022 title=\u002212/16/2014 10:29  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by OhioBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2014-12-16T22:26:49Z","Content":"\n\u003Cp\u003EDid you launch in a vaccum far away from anything that produces gravity, or just from the launch pad at Kerbin?\u003C/p\u003E\u003Cp\u003EIf the latter, then you\u0027re losing velocity gradually to gravity and drag. The delta-V is the change in velocity when ABSENT of gravity and drag.\u003C/p\u003E\n"},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2014-12-16T23:08:49Z","Content":"\n\u003Cp\u003EDv with MK 1 command (0.84t), FL-T400 tank(2.25t wet, .25t dry), and TV-30 Engine (1.25t)\u003C/p\u003E\u003Cp\u003EWet mass: 4.34\u003C/p\u003E\u003Cp\u003EDry Mass: 2.34\u003C/p\u003E\u003Cp\u003EdV = 320 * 9.6 * ln( 4.34/2.34)\u003C/p\u003E\u003Cp\u003EdV = 3072 * ln( 1.86)\u003C/p\u003E\u003Cp\u003EdV = 3072 * .62461...\u003C/p\u003E\u003Cp\u003EdV = 1918.808 m/s\u003C/p\u003E\u003Cp\u003EThat\u0027s not really enough to get anywhere. \u003C/p\u003E\u003Cp\u003EHowever, TWR = Thrust / (m * g). You start with a TWR of 215 / ( 4.34 * 9.8) = 5.05. That\u0027s WAAAAAAYYY over what you need.\u003C/p\u003E\u003Cp\u003EMy guess is you need to seriously throttle back on that machine. You\u0027re probably dumping absolute tons of dV into drag against the Terminal Velocities. Keep in mind at 5k you only want to be doing ~165 m/s, and at 10k ~265 m/s. That\u0027s where you\u0027re most likely losing a lot of your expected value.\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-12-16T23:24:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mjl1966\u0022 data-cite=\u0022mjl1966\u0022\u003E\u003Cdiv\u003EUsing the *BIG FAT SCIENTIFIC ASSUMPTION that the reported mass of the fuel tank (2.25) is its dry mass\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. That\u0027s the mass with fuel. The dry mass of the FL-T400 is 0.25t. That\u0027s true of all fuel tanks: the listed mass is when filled with fuel.\u003C/p\u003E\u003Cp\u003EYou\u0027re also, as mentioned, losing giant quantities of velocity on launch. When launching straight up from KSC, you lose 9.8 m/s each second to gravity. You are also losing velocity to atmosphere, at a rate proportional to atmospheric density and the square of velocity.\u003C/p\u003E\u003Cp\u003EAs it works out, the most efficient way to do things is to ascend at terminal velocity: when gravity exactly matches atmosphere. This means that, for the first part of the ascent, the most efficient TWR is slightly greater than 2.0*: 1.0 to counter gravity, 1.0 to counter atmospheric drag, and a little bit left over to accelerate as terminal velocity increases (due to thinner atmosphere). As such, you generally design for 1.6-2.0 launch TWR: the advantage of going a bit less than 2.0 TWR is that you will burn fuel on the way up, and if you need to throttle down to stay at terminal velocity, it means you\u0027re carrying wasted engine mass.\u003C/p\u003E\u003Cp\u003E*If you use traditional staging, the most efficient launch TWR seems to be about 1.65: you\u0027ll burn fuel and increase your TWR on your way up. It\u0027ll be different for different staging schemes: something like asparagus, onion, or twisted candle can remain very close to optimal TWR by frequently staging off excess engines.\u003C/p\u003E\u003Cp\u003EPlease note that much of this advice gets thrown out the window if you install FAR or NEAR, which change aerodynamics significantly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T23:28:23Z\u0022 title=\u002212/16/2014 11:28  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by Starman4308\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2014-12-16T23:47:02Z","Content":"\n\u003Cp\u003EFirstly, the reported mass of a fuel tank is its dry mass \u002B mass of fuel, so the dry mass in this case is 0.25\u003C/p\u003E\u003Cp\u003ESecondly, Delta-V, isn\u0027t the speed you can obtain from Kerbin\u0027s surface. It\u0027s a property of a fueled rocket that, in general, tells you how far you can go.\u003C/p\u003E\u003Cp\u003EFrom the surface of Kerbin it takes around 4550m/s to get into orbit, but that is a measured, rather than calculated value, and is only applicable for an efficient ascent. Your orbital velocity at a low orbit will be around 2200m/s.\u003C/p\u003E\u003Cp\u003EAs a very (very, very) rough estimate, an efficient ascent to orbit will have a TWR of around 1.5-2. It would normally take 2000m/s to get to 10,000m, at which point you\u0027ll be travelling at around 260m/s and will want to pitch 45 degrees East, another 1500 to get your apoapsis to above 75km and another 1000, when you get to your apoapsis, to burn east parrallel to Kerbin\u0027s surface to reach orbit. This means that a LV-909 engine fully throttled would probably be a better choice for your rocket than a LV-T30 as it would have an initial TWR of 1.4, would use a more fuel efficient engine and would be cheaper. It would have between 2500 m/s and 3000 m/s delta-V.\u003C/p\u003E\u003Cp\u003EDelta-V as a concept makes more sense when you are in orbit. If you are travelling at 2300m/s and have 500m/s delta-V, then if you burn all of your fuel prograde, you will be travelling at 2800m/s and delta-V requirements can be calculated rather than estimated.\u003C/p\u003E\n"},{"CreatedByName":"mjl1966","CreatedById":105019,"CreatedDateTime":"2014-12-17T02:00:00Z","Content":"\n\u003Cp\u003EThanks to you all! You answered my question \u002B a whole lot more.\u003C/p\u003E\u003Cp\u003EAfter reading these responses, I did more experiments and found that a 5 tank single stack will give me 4375, which is juuust enough to establish an orbit at 70K peri. Actual net dV was ~2300 so it does seem that a whole herd of vees are being rounded up by Drag and Gravity and other members of the Great Rocket Tyranny.\u003C/p\u003E\u003Cp\u003EGreat stuff fellas. This really helped.\u003C/p\u003E\n"},{"CreatedByName":"Th3F3aR","CreatedById":124827,"CreatedDateTime":"2014-12-17T08:46:57Z","Content":"\n\u003Cp\u003EYou could \u0022simply\u0022 calculate your Drag by v0/APg where v0 is the m/s on your desired orbit ~2300m/s at 70km and APg is your a/g | a is calculated by g*(TWR-1)\u003C/p\u003E\u003Cp\u003Ethen you\u0027ll see at least how much dV you\u0027ll lose on fighting gravity.\u003C/p\u003E\u003Cp\u003ERemember it\u0027s a simple calculation not a 100% correct one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is another Drag equation : Sqrt(GM*(1/r2-1/r1)) where r1 is the 600km on Kerbin (sea level) and r2 your desired orbit\u003C/p\u003E\u003Cp\u003EPlease don\u0027t ask why this works, for a 70km orbit this basically gives 4555m/s(but actually you can\u0027t combine them :-). I am a little confused by those 2 equations cause they should both display gravitationalDrag according to the parameters but they spit out different results.\u003C/p\u003E\u003Cp\u003EBut i think the main reason why they spit out different results is cause the 1st displays gDrag according to your ascent speed and the 2nd does it by the planets gravitational field not regarding how fast you ascend.\u003C/p\u003E\u003Cp\u003ENevertheless, as the others have said, drag costs you a lot of dV, that is why some genius said that \u0022if you get to Orbit you are half way to everywhere\u0022.\u003C/p\u003E\n"},{"CreatedByName":"mjl1966","CreatedById":105019,"CreatedDateTime":"2014-12-17T22:58:30Z","Content":"\n\u003Cp\u003EHow do I change this ti \u0022ANSWERED\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-17T23:56:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mjl1966\u0022 data-cite=\u0022mjl1966\u0022\u003E\u003Cdiv\u003EHow do I change this ti \u0022ANSWERED\u0022?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEdit the original post, go advanced, the option to change the prefix should be there.\u003C/p\u003E\u003Cp\u003EAnother thing to note is that dV spent does not always end up as speed. If you imagine a circular orbit in which you perform a prograde burn, at the far end of the new, elliptical orbit your vessel will actually have \u003Cem\u003Eless\u003C/em\u003E speed. It is better to think of dV buying an energy change in the orbit, that 4500m/s of dV spent getting to LKO can be thought of as adding about 2300m/s of actual speed as well as adding the potential energy of another 70km or so of altitude (minus a small bit for gravity and drag losses).\u003C/p\u003E\u003Cp\u003EThis can be seen more clearly once in orbit. Do a prograde burn from LKO to raise Ap to 1000km and another to circularize when you get there, and you\u0027ll have far less speed than when you started even though nothing has been lost to gravity or aero drag. Instead, that dV expenditure has resulted in the vessel having much more potential energy in the form of additional altitude.\u003C/p\u003E\n"},{"CreatedByName":"Kesa","CreatedById":130333,"CreatedDateTime":"2014-12-18T02:28:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Th3F3aR\u0022 data-cite=\u0022Th3F3aR\u0022\u003E\u003Cdiv\u003EYou could \u0022simply\u0022 calculate your Drag by v0/APg where v0 is the m/s on your desired orbit ~2300m/s at 70km and APg is your a/g | a is calculated by g*(TWR-1)\u003Cp\u003Ethen you\u0027ll see at least how much dV you\u0027ll lose on fighting gravity.\u003C/p\u003E\u003Cp\u003ERemember it\u0027s a simple calculation not a 100% correct one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is another Drag equation : Sqrt(GM*(1/r2-1/r1)) where r1 is the 600km on Kerbin (sea level) and r2 your desired orbit\u003C/p\u003E\u003Cp\u003EPlease don\u0027t ask why this works, for a 70km orbit this basically gives 4555m/s(but actually you can\u0027t combine them :-). I am a little confused by those 2 equations cause they should both display gravitationalDrag according to the parameters but they spit out different results.\u003C/p\u003E\u003Cp\u003EBut i think the main reason why they spit out different results is cause the 1st displays gDrag according to your ascent speed and the 2nd does it by the planets gravitational field not regarding how fast you ascend.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe first equation give the exact dv requirement for achieving a speed of v0 for an upward acceleration in abscence of air, that\u0027s why it is a rough approximation for orbit. With TWR = ~1.6 and v0 ~2300m/s, it gives 4555m/s, which is, astonishely, the actual typical cost of orbiting with a typical TWR, because errors compensate them selves :\u003C/p\u003E\u003Cp\u003E(1) the atmospheric drag is not taken on account\u003C/p\u003E\u003Cp\u003E(2) the TWR often raise up to 2 or more in the 10 000 first meters, as the fuel of the first stage deplete (should reduce drag)\u003C/p\u003E\u003Cp\u003E(3) Though TWR of the mid and last stages are often significantly smaller than 1.6, accelerating horizontally saves alot compared to accelerating vertically\u003C/p\u003E\u003Cp\u003ESo it\u0027s not drag, it\u0027s drag \u002B desired v, but should be used with caution. I don\u0027t expect it to be true on any other body than Kerbin, and it is an over estimation for achieving orbit on an airless bodies, and a quite dramatic one if TWR is between 1 and 6.\u003C/p\u003E\u003Cp\u003ESince there is no TWR in it, I think the second is related to transfer cost, so is not related to ascent. This two equations does not describe the same gravity drag : the first one describe loss due to vertical trusting, where the second describes... Well, I don\u0027t know, I\u0027d be glad to know where it comes from. During transfer, you burn horizontally (prograde and retrograde), so no gravity loss like described by 1st equation or by some of it\u0027s refinements. However, it cost more to go from one circular orbit to an other one and then to athird one than to go from the first circular orbit directly to the third. That may be the kind of gravity loss described by the second equation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T02:31:19Z\u0022 title=\u002212/18/2014 02:31  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by Kesa\u003C/strong\u003E\n\u003C/span\u003E\n"}]}