{"TopicId":93293,"ForumId":36,"TopicTitle":"Part path/name changes .25 to .90?","CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-12-17T04:41:17Z","PageNum":1,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-12-17T04:41:17Z","Content":"\n\u003Cp\u003EAnyone have a list or chart? I have to go through almost all the ReStock .cfg files to change the paths all over again like I did going from .24 to .25.\u003C/p\u003E\u003Cp\u003ESome parts still show up without needing path changes. I\u0027ll have to try each one in the editor to see if any need additional tweaks to node locations and/or scale to make them fit and load correctly in old ships and saves. Will also have to see if any parts have been obsoleted by updated stock parts, as two were in .25.\u003C/p\u003E\u003Cp\u003EBut first, tracking down where Inventory has moved most of the parts bins! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI did fix one oops in the large 5-way RCS block for .25, and uploaded the archive with it. I\u0027d love some input on costs, tech levels, mass etc for all the parts, especially the aero stuff I haven\u0027t added any of that too.\u003C/p\u003E\n"},{"CreatedByName":"V2","CreatedById":28767,"CreatedDateTime":"2014-12-17T22:44:59Z","Content":"\n\u003Cp\u003EYeah I\u0027m interested in such a guide too. I\u0027m trying to do the inverse though, backporting the new Mk3 parts to 0.25 so I can actually use them. The new cockpit shows up fine if I put it in GameData\\Mk3\\Mk3Cockpit_Shuttle but the load screen hangs up without crashing on the 100LFO tank when I put it in GameData\\Squad\\Parts\\Mk3\\Mk3Fuselage. Placing it anywhere else will get KSP to load and run normally but, the new Mk3 fuselage parts are nowhere to be found. The cargo bays do work from GameData\\Squad\\Parts\\Mk3\\Mk3CargoBay so it\u0027s something peculiar to fuel tanks\u0027 cfg files. I\u0027m assuming those cool Mk3 adapters are also fuel tanks. I have no way of knowing myself right now because 0.90 is D.O.A. for me. I don\u0027t care though, without the new atmo dynamics I see little point to 0.90 beyond the Mk3 parts.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-12-18T00:15:54Z","Content":"\n\u003Cp\u003EPropulsion was split into FuelTank and Engines. Look in all the MK3 CFG files for those categories and change them to Propulsion.\u003C/p\u003E\u003Cp\u003EWhat would be an interesting and useful tool is a tree or some kind of chart tracking every part through all the versions of KSP, noting things like name and path changes, if a replacement directly superseded an old part, changes in mass, modules, format etc. Something interesting is that the add-on control flaps and most of the wing parts for SPP \u0022just work\u0022 in place of .24 and earlier parts so no changes were needed in crafts using them to work in .25.\u003C/p\u003E\u003Cp\u003EThat would be a very useful resource for modders and players. I hope that SQUAD is \u003Cem\u003Edone\u003C/em\u003E mucking around with changing the folder names and locations of parts.\u003C/p\u003E\n"},{"CreatedByName":"V2","CreatedById":28767,"CreatedDateTime":"2014-12-18T00:51:29Z","Content":"\n\u003Cp\u003EThanks, Galane. You\u0027ve saved Christmas (for me anyway). The adapter tanks didn\u0027t have textures at first but that\u0027s because they where dependent on the Mk3 cockpit being where it was supposed to be in the GameData\\Squad\\Parts\\Mk3 folder. I soon sorted that out by throwing everything in propulsion. I\u0027m a bit weak with my Kerbal-fu lately. I haven\u0027t really had time to mess with modding the game for a year and half. That\u0027s ancient history around here.\u003C/p\u003E\n"}]}