{"TopicId":93295,"ForumId":55,"TopicTitle":"Contract Categories","CreatedByName":"GateCrasherVI","CreatedById":59667,"CreatedDateTime":"2014-12-17T05:03:49Z","PageNum":1,"Articles":[{"CreatedByName":"GateCrasherVI","CreatedById":59667,"CreatedDateTime":"2014-12-17T05:03:49Z","Content":"\n\u003Cp\u003E\u003Cem\u003E[Checked if this was mentioned already in the \u0022Things Already Suggested\u0022 thread since missions have been a thing for a little while now but saw no evidence of it. If I missed it somewhere, I apologize.]\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI think contract goals could do with larger multi-part missions that involve activities from numerous of the currently available contracts. I think there is an impressive variety of things to do in there. Navigating through the contracts based on difficulty stars and part names feels a little tedious and obscure.Perhaps the interface for missions could categorize them into side-tabs like 0.90 uses for part categories in the assembly buildings.\u003C/p\u003E\u003Cp\u003ECategories something like this;\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cstrong\u003EScience \u0022Tasks\u0022 / \u0022Contracts\u0022\u003C/strong\u003E\u003C/div\u003E\u003Cstrong\u003E\u003C/strong\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cdiv\u003EVarious Data Collection\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EExploration Tasks\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003ERescue\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EExplore Area\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EFlag Planting\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEquipment Tasks\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EPart testing\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cstrong\u003ESpace Missions\u003C/strong\u003E\u003C/div\u003E\u003Cstrong\u003E\u003C/strong\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cdiv\u003EForward (Surface) Outpost\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cdiv\u003EExtra-Kerbin Satellites\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cdiv\u003ERover Deployment\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cdiv\u003ESpace Station\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI like the depth of some of the 2 and 3 star missions, but with the current difficulty indicators of 1, 2, and 3 stars the contract office UI feels a bit more like a grocery shopping-list than glorious \u0027asplodey space programs aspirations. \u003Cstrong\u003EMaybe even some color-coding of difficulties would help know whats what.\u003C/strong\u003E But things are already getting kinda \u003Cem\u003Ebusy\u003C/em\u003E in the icon department of KSP with all the new resources and currency.\u003C/p\u003E\u003Cp\u003EThese categories could give a more obviously rewarding long term goal as well as smaller tasks to keep you busy while you work your way up to the giant leaps. Maybe the larger Space Missions could have subcategories of contracts which effect the overall performance of the mission but don\u0027t dictate its success or failure.\u003C/p\u003E\n"}]}