{"TopicId":93373,"ForumId":55,"TopicTitle":"Bring Back the Barn!","CreatedByName":"pallyme","CreatedById":112894,"CreatedDateTime":"2014-12-17T16:19:42Z","PageNum":2,"Articles":[{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2014-12-18T01:46:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EEverything is centered around the VAB anyway. The runway, launchpad, admin building and SPH are disconnected but everything else\u0027s models could be shifted toward the VAB and make the space center look much more compact.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJohnson Space Center here is kind of sprawled out. There\u0027s a central campus that houses most of the facilities, but there are several clusters of buildings set away from the central area. When your R\u0026amp;D people are testing explosives or rocket engines, you don\u0027t do it in the middle of an office complex.\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2014-12-18T01:48:57Z","Content":"\n\u003Cp\u003EHomespun humor is all over the place, in the IVA\u0027s and every part description. KSP is \u0022sim lite\u0022 and meant to be equal parts fun (or funny) and educational. \u003C/p\u003E\u003Cp\u003EIt will probably not take long to start upgrading from the \u0022barn\u0022 tier, when it\u0027s finalized.\u003C/p\u003E\u003Cp\u003EFits perfectly with the can-do, carefree attitude of KerbalKind. \u003C/p\u003E\u003Cp\u003EThey started with duct tape and bailing wire, and never stopped trying \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2014-12-18T01:53:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYES. Everything is centered around the VAB anyway. The runway, launchpad, admin building and SPH are disconnected but everything else\u0027s models could be shifted toward the VAB and make the space center look much more compact.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECheck out the KSC\u002B\u002B mod, it adds a lot of extra buildings to KSC.\u003C/p\u003E\n"},{"CreatedByName":"Crimson Sunrise","CreatedById":132102,"CreatedDateTime":"2014-12-18T02:43:29Z","Content":"\n\u003Cp\u003EYou could probably build a real barn for the same price it takes to demand the barn\u0027s return in here...Except that it doesn\u0027t require you spending money on wood and stuff.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-12-18T05:42:35Z","Content":"\n\u003Cp\u003EI\u0027ve played about 8hrs of KSP since 0.25. It\u0027s mostly the art stuff that\u0027s killing my enjoyment of the game(Porkjet\u0027s wings being the worse offense). Squad needs to have a serious internal conversation about the art direction of the game because at the moment it\u0027s just a mishmash of dialogues, geometries and textures.\u003C/p\u003E\u003Cp\u003EI\u0027m talking about art direction, not graphic design. No attempt has been made to reconcile the models with their manufacturers and descriptions. For those who hate on the barn, where does Jebediah Kerman\u0027s Junkyard and Spacecraft Parts Co. fit into the high tech world of KSP? I know the barn graphic design, to put it politely, was a little rushed. But, where is the story of a space center built from humble beginnings to an interplanetary launch facility? Composition is the key word. The current attempt for beta tier one looks like a placeholder for the future, final tier KSC. That\u0027s far from organic.\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2014-12-18T05:55:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003E...where does Jebediah Kerman\u0027s Junkyard and Spacecraft Parts Co. fit into the high tech world of KSP?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt belongs in the past, when small rockets were being built out of junk. Not in the present, where the program is capable of launching a crewed vehicle.\u003C/p\u003E\u003Cp\u003EI am personally not a fan of the craptacular space program, and find it rather silly.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-12-18T06:33:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EI\u0027ve played about 8hrs of KSP since 0.25. It\u0027s mostly the art stuff that\u0027s killing my enjoyment of the game(Porkjet\u0027s wings being the worse offense). Squad needs to have a serious internal conversation about the art direction of the game because at the moment it\u0027s just a mishmash of dialogues, geometries and textures.\u003Cp\u003EI\u0027m talking about art direction, not graphic design. No attempt has been made to reconcile the models with their manufacturers and descriptions. For those who hate on the barn, where does Jebediah Kerman\u0027s Junkyard and Spacecraft Parts Co. fit into the high tech world of KSP? I know the barn graphic design, to put it politely, was a little rushed. But, where is the story of a space center built from humble beginnings to an interplanetary launch facility? Composition is the key word. The current attempt for beta tier one looks like a placeholder for the future, final tier KSC. That\u0027s far from organic.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it looks fine. Making something neat out of mismatched parts is part of the fun. Plus, the only parts that really look low tech are some of the X-200 tanks.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-18T11:37:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EThey\u0027re doing it twice anyway, as they already did it once and now they have to do it again. And then probalby do a final pass on THAT. So the griping caused them to do it 3 times.\u003Cp\u003ESo feel free to not understand my point of view. I\u0027ll voice it to Squad at every opportunity anyway.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWut?\u003C/p\u003E\u003Cp\u003EYou haven\u0027t really made an argument. What\u0027s the point? Bac9 didn\u0027t iterate his buildings, he just did them once, like a pro. This is soo weird. Why redo things? Squad did this with parts, and now with this. It\u0027s a waste of time..just because people are impatient? Come on..\u003C/p\u003E\u003Cp\u003Ebtw \u0022griping\u0022 is the word you chose to use, again, for seemingly no rational reason.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T11:40:02Z\u0022 title=\u002212/18/2014 11:40  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-12-18T11:40:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EWut?\u003Cp\u003EYou haven\u0027t really made an argument. What\u0027s the point? Bac9 didn\u0027t iterate his buildings, he just did them once, like a pro. This is soo weird. Why redo things? Squad did this with parts, and now with this. It\u0027s a waste of time..just because people are impatient? Come on..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELike I said. You don\u0027t understand my point of view and while I understand yours I don\u0027t agree with it. Nothing either of us says to the other will change either of our minds. I\u0027m just hoping that next time I\u0027ll be able to change Squad\u0027s.\u003C/p\u003E\u003Cp\u003EOr more accurately, convince Squad to NOT change theirs.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-12-18T11:47:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EPersonally, I sat on the sidelines during the whole barn thing. Squad showed us this thing, and tons of people jumped down their throat about it. I wanted to play in barns. I didn\u0027t care if the graphics weren\u0027t perfect. I didn\u0027t feel the need to voice my opinion and suddenly we weren\u0027t getting gameplay content.\u003Cp\u003EI\u0027ve decided from now on when people complain and whine and act like 3 year olds, that I\u0027ll state my opinion as well. I would have rather had the barns than not. I would have rather had 4 tiers of buildings than 3. I would have taken them with pure white textures. Or the textures they had. I don\u0027t care, because unlike so many here I know that they\u0027re going to get another pass, and I\u0027d rather have the game content now than have every single pixel be up to the high standards of our \u0022community.\u0022\u003C/p\u003E\u003Cp\u003ESo yeah. #BringBackTheBarn.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELots of this. The way it looked to me was that some hypercritical OCD people had major issues with minor flaws and created a big hoo-haw. I really liked it. I liked the idea of starting in a barn that Jeb worked in. I thought they looked good.\u003C/p\u003E\u003Cp\u003EA lot better then the ones we are playing with right now in 0.90 THAT NOBODY IS COMPLAINING ABOUT AT ALL.\u003C/p\u003E\u003Cp\u003EThey look terrible IMHO and I\u0060d rather have literally a 2D icon saying \u0060content due here\u0060...\u003C/p\u003E\u003Cp\u003EThe barn was ten times better.\u003C/p\u003E\u003Cp\u003ERemember, you can\u0060t please all the people all the time and the ones you are not pleasing will shout the loudest.\u003C/p\u003E\u003Cp\u003ESo yeah. #BringBackTheBarn. \u002B1\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-18T11:48:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003ELike I said. You don\u0027t understand my point of view and while I understand yours I don\u0027t agree with it. Nothing either of us says to the other will change either of our minds. I\u0027m just hoping that next time I\u0027ll be able to change Squad\u0027s.\u003Cp\u003EOr more accurately, convince Squad to NOT change theirs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou haven\u0027t said anything yet though. Do you hope to change Squad\u0027s mind with the same? People actually explained their reasons. You just said, \u0026lt;paraphrasing\u0026gt;I want it\u0026lt;/paraphrasing\u0026gt;.\u003C/p\u003E\u003Cp\u003EYou don\u0027t agree with what? Is there something not factual in my posts? Did my logic fail somewhere?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003Emajor issues with minor flaws\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. You just have very low expectations.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-12-18T12:21:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EI liked the idea of starting in a barn that Jeb worked in. I thought they looked good.\u003C/div\u003E\u003C/blockquote\u003E the barn idea wasn\u0027t strong. \u0022Barngate\u0022:sticktongue: proved that. BUT BUT BUT they could have pulled it off with better quality artwork. \u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EA lot better then the ones we are playing with right now in 0.90 THAT NOBODY IS COMPLAINING ABOUT AT ALL.\u003Cp\u003EThey look terrible IMHO and I\u0060d rather have literally a 2D icon saying \u0060content due here\u0060...\u003C/p\u003E\u003Cp\u003EThe barn was ten times better.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...well I\u0027ve been complaining about that too, but the barn was \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Enot\u003C/span\u003E better.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003ERemember, you can\u0060t please all the people all the time and the ones you are not pleasing will shout the loudest.\u003Cp\u003ESo yeah. #BringBackTheBarn. \u002B1\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think Cpt. Kipard summed this one up:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003ENo. You just have very low expectations.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI cant speak for everyone but its clear to me that many people have come to expect a certain standard of artwork from KSP. when this standard is not met, it is jarring and worrying and people are going complain. \u003C/p\u003E\u003Cp\u003EI guess what I\u0027m concerned about is when squad present low quality art, \u003Cstrong\u003Eit feels that squad are trying to rush KSP to the finish line.\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003EI don\u0027t want KSP v1.0 abandoned as a mishmash of broken features and varying visual quality.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T12:34:50Z\u0022 title=\u002212/18/2014 12:34  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by Capt Snuggler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-12-18T13:23:16Z","Content":"\n\u003Cp\u003EThe Barn\u0027s probably coming back, just much improved in quality.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-12-18T16:22:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EYou just have very low expectations.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have realistic expectations for models in a game which you hardly ever see close enough to distinguish the features at the level that other people are saying are game breakers...\u003C/p\u003E\u003Cp\u003ENow people can say that they think the barn was not better and that is fine, you are allowed your opinion, but I would appreciate less personal comments in return when I express my opinion Cpt Kipard....\u003C/p\u003E\u003Cp\u003EMyself I find that quite rude. It definitely does not persuade me of your argument.\u003C/p\u003E\u003Cp\u003EIn polite discussion, I say what I think and you say what you think and neither of us says what we think of each other and neither of us says \u0022What you think is invalid/wrong\u0022 on topics that are based on personal opinion like artwork.\u003C/p\u003E\u003Cp\u003EThis is what I think.\u003C/p\u003E\u003Cp\u003EI liked the barn idea. I think the barn was ten times better than the generic box type buildings we ended up having and I feel the backlash was counter productive in the long run and displayed a lack of foresight as to the actual effect it would have (no tier one at all in 0.90, thanks). I also think the modelling was good enough for the purpose which is not a first person shooter where the character stands next to and inside the building, it is for a space rocket game that needs to watch the amount of memory it uses on features, models and textures and balance the needs of one against the needs of the other hopefully leaving some left for mods.\u003C/p\u003E\u003Cp\u003ENo it was not the ultimate quality that Unity is capable of displaying but I reckon it was a good compromise for the system it had to operate under. It was the most fit for purpose.\u003C/p\u003E\n"},{"CreatedByName":"bdito","CreatedById":112760,"CreatedDateTime":"2014-12-18T16:38:08Z","Content":"\n\u003Cp\u003EI\u0027m not sure how the Unity system works in regards to memory management but wouldn\u0027t having higher detailed textures increase the memory usage and slow the game down, especially with a lot of mods? If that\u0027s the case you would definitely need to balance the tradeoff.\u003C/p\u003E\u003Cp\u003EObviously the best outcome would be for Unity to support multithreading and then they could have amazing textures and everything would be smoother and lag-free but we know that\u0027s very unlikely.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-18T16:58:16Z","Content":"\n\u003Cp\u003EAlright alright...\u003C/p\u003E\u003Cp\u003EI have nothing against the \u0022barn idea\u0022.\u003C/p\u003E\u003Cp\u003EI\u0027m complaining about the really poor quality of its execution.\u003C/p\u003E\u003Cp\u003EPeople seem to conflate these two issues. Your comment about minor issues and people over reacting speaks for itself. If I had said \u0022My standards are high\u0022, or \u0022My standards are in line with current technology\u0022 You wouldn\u0027t have complained. Temet nosce.\u003C/p\u003E\u003Cp\u003EI liked the trailer \u003Cem\u003Eidea\u003C/em\u003E actually, I liked the little telescope idea. But they sucked graphically. Squad have the final tier KSC and SP\u002B parts as their standard currently. That\u0027s all there is to it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T17:04:49Z\u0022 title=\u002212/18/2014 05:04  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ElJugador","CreatedById":18783,"CreatedDateTime":"2014-12-18T17:28:41Z","Content":"\n\u003Cp\u003EAgree with above. ^ Right on the mark.\u003C/p\u003E\u003Cp\u003EIn my own words:\u003C/p\u003E\u003Cp\u003EOkay. I know you #BringBacktheBarn folks liked the spirit of the images. So did I. The idea of starting out from a disused ... farm ... park place excited my imagination too. I didn\u0027t really mind the egregious modeling and texturing at first. But let\u0027s face facts - this T1 would have been abysmal. There was no coordination here at all - it\u0027s unclear what most buildings are supposed to be, and the variety of facilities depicted (a trailer park next to a .. fertilizer storage facility which is behind a ... I don\u0027t know... vaguely barn-looking thing?) really causes each facility to clash with the style of the next, making this KSP look like an amateurish mess. Lastly, that observatory... that Mission Control ... just _ugh_. Perhaps if they significantly reworked the style, making buildings look low-tech but not cobbled together (as some have suggested) and making the purpose of each clearer by the layout of each building according to the later tiers, it might just work. But for now, my personal and insignificant verdict is: #Don\u0027tBringBackTheBarn \u002B1\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2014-12-18T22:55:36Z","Content":"\n\u003Cp\u003EChrist. in. heaven. It was a sneak preview of work that was 20% complete. Can we please move on from the moaning about graphics? Nobody has played with the final result. No one has seen the final result. We\u0027re just discussing the merits of a thematic idea.\u003C/p\u003E\u003Cp\u003EThis is all a tempest in a teapot, but as a serious point, big part of KSP\u0027s charm is the way it lends an air of adventure and playfulness to the more serious business of rocket science. These are little green men recklessly launching themselves into space. Great! What was so exciting to us BringBacktheBarn folks was the hint at a real story there. Not some backstory lore on a wiki, but a real, played, experienced story that you live out with them from the humble beginnings rummaging for rocket parts in a junkyard to a legit cutting edge space program. It made the early stages feel fun! There was a real sense daring and charm about it. As you progress things could look more industrial and finally space aged. You could see a stylistic change and growth as Jeb and his buddies learned and refined and could afford bigger and better and glitzier things. Very deliberately the style of the early tier buildings should not fit with the tier 3 buildings. If they did there would be no sense of progress, no sense of \u0022yay! new things!\u0022. You have to start small to get that feeling. Otherwise you have what we see now, vaguely unobtrusive, uninspiring, bland boxes that sort of get bigger as you go. Im sure the guys at Squad are working on this, and they really just wanted to get the basic mechanics running so we can iron out all the kinks. Im just hoping in the end they dont go the boring, easy route. I hope there\u0027s a real story there, and that we can see it in the art.\u003C/p\u003E\n"},{"CreatedByName":"Geodude","CreatedById":132539,"CreatedDateTime":"2014-12-19T06:43:13Z","Content":"\n\u003Cp\u003EI condone in #BringBackTheBarn movement that roninpawn (\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/-70-nYsoHL0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E) made a point about. Its a great aspect and homely feeling to the game where you start in a rocket/aerospace enthusiast setting with trailers, sandbags, barns and silos on someones farm or property where they build small rockets/planes and try to make something of it. I was disappointed at the small-scale corporation buildings in this beta release for the tier 1 KSC. I like how it looked being a privately owned and operated KSC getting funding wherever possible with the idea that it grows into the prestigious operation that we saw in the 0.25 patch.\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2014-12-19T14:07:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022 data-cite=\u0022Pthigrivi\u0022\u003E\u003Cdiv\u003EChrist. in. heaven. It was a sneak preview of work that was 20% complete. Can we please move on from the moaning about graphics? Nobody has played with the final result. No one has seen the final result. We\u0027re just discussing the merits of a thematic idea.\u003Cp\u003EThis is all a tempest in a teapot, but as a serious point, big part of KSP\u0027s charm is the way it lends an air of adventure and playfulness to the more serious business of rocket science. These are little green men recklessly launching themselves into space. Great! What was so exciting to us BringBacktheBarn folks was the hint at a real story there. Not some backstory lore on a wiki, but a real, played, experienced story that you live out with them from the humble beginnings rummaging for rocket parts in a junkyard to a legit cutting edge space program. It made the early stages feel fun! There was a real sense daring and charm about it. As you progress things could look more industrial and finally space aged. You could see a stylistic change and growth as Jeb and his buddies learned and refined and could afford bigger and better and glitzier things. Very deliberately the style of the early tier buildings should not fit with the tier 3 buildings. If they did there would be no sense of progress, no sense of \u0022yay! new things!\u0022. You have to start small to get that feeling. Otherwise you have what we see now, vaguely unobtrusive, uninspiring, bland boxes that sort of get bigger as you go. Im sure the guys at Squad are working on this, and they really just wanted to get the basic mechanics running so we can iron out all the kinks. Im just hoping in the end they dont go the boring, easy route. I hope there\u0027s a real story there, and that we can see it in the art.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll we are really asking is consistency in quality and art direction. You seem convinced that people want boring buildings. I\u0027d be happy with a barn that was on par with B9\u0027s buildings in terms of quality. They don\u0027t even have to be as detailed, as far as I\u0027m concerned.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-12-19T19:49:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EAlright alright...\u003Cp\u003EI have nothing against the \u0022barn idea\u0022.\u003C/p\u003E\u003Cp\u003EI\u0027m complaining about the really poor quality of its execution.\u003C/p\u003E\u003Cp\u003EPeople seem to conflate these two issues. Your comment about minor issues and people over reacting speaks for itself. If I had said \u0022My standards are high\u0022, or \u0022My standards are in line with current technology\u0022 You wouldn\u0027t have complained. Temet nosce.\u003C/p\u003E\u003Cp\u003EI liked the trailer \u003Cem\u003Eidea\u003C/em\u003E actually, I liked the little telescope idea. But they sucked graphically. Squad have the final tier KSC and SP\u002B parts as their standard currently. That\u0027s all there is to it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen I think we are in general agreement. (If you had said the barn did not meet your standards then I wouldn\u0060t have taken it personally as you would have been commenting on yourself and what you think rather than me, apologies if I overreacted...) If you had said \u0022My standards are in line with current technology\u0022 I would have said that KSP itself is not in line with current technology and so the models in the game have to be at a suitable level to not stress the limited resources at the games disposal. I quite like the barn concept, the trailers and sandbags, while not the idea I had in my mind, match the feel of what I had in my mind and I totally see that it was not as finished as it should be for a final result. I still think the reaction from the community was a bit OTT and stopped the barn from seeing light of day in 0.90.0 at which point much more people would have a closer look at what it was exactly (and could make possibly better criticism)\u003C/p\u003E\u003Cp\u003EI reckon I have been conflating when people say how bad the execution of the idea was with people saying how bad they thought the idea was overall as there have been both positions being firmly put forward since \u0060raising a barn\u0060, sometimes by the same person.\u003C/p\u003E\u003Cp\u003EI\u0060m all up for SQUAD tidying up the barn, making edges meet, improving textures and making the feel match the overall feel of the game while retaining enough individuality so that you feel like you have upgraded instead of just having a larger model of the same building. That can only be a good thing.\u003C/p\u003E\u003Cp\u003EAlso, I don\u0060t think the barn is gone for good anyway, all signs are that it is being worked on to raise the quality to \u0060finished\u0060 before release (which ironically means that it will probably be fairly set and any remaining issues won\u0060t get fixed until after 1.0)\u003C/p\u003E\u003Cp\u003EMyself I call an issue minor when most people in normal play would not notice the difference if it was fixed. Other people may have a different definition and that is OK.\u003C/p\u003E\u003Cp\u003EBTW did people know that you can make explosive out of fertiliser? it should in theory be possible to make rocket fuel...\u003C/p\u003E\u003Cp\u003EHow would people feel about #improvethebarnandthenbringitback?\u003C/p\u003E\u003Cp\u003EIt would stop conflation...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GusTurbo\u0022 data-cite=\u0022GusTurbo\u0022\u003E\u003Cdiv\u003EAll we are really asking is consistency in quality and art direction. You seem convinced that people want boring buildings. I\u0027d be happy with a barn that was on par with B9\u0027s buildings in terms of quality. They don\u0027t even have to be as detailed, as far as I\u0027m concerned.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would also like this. I\u0060d rather have all the features at lower quality than less features that were very polished at this stage though, this stage (at the time) being Alpha. Now 0.90 is out and KSP *is* in Beta we should be looking at the feature complete game and pointing out things that could be expanded on within the existing systems (atmosphere model for example) or improved graphically (flame, clouds, smoke, buildings etc). It would be odd if the game did not have an \u0060art quality\u0060 pass at some point then a \u0060bugfixing pass\u0060 and so forth. It seems like the cart is before the horse on this one.\u003C/p\u003E\u003Cp\u003EI feel we have been offered a cake, some people moaned about the quality of the frosting so the whole cake was taken away for the frosting to be redone.\u003C/p\u003E\u003Cp\u003EI don\u0060t even like frosting that much, I was looking forward to the cake...\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-19T20:02:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003E#improvethebarnandthenbringitback?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol, alright \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the second time in a short while that we came to a compromise and an understanding. I wish everyone was as open minded.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-19T20:05:31Z\u0022 title=\u002212/19/2014 08:05  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 19, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-12-19T23:34:54Z","Content":"\n\u003Cp\u003ESadly, I did not see the barn as it was presented wherever it was presented. I do like the idea of starting out as a backyard rocket lab built on a farm though, it feels very Kerbal. Many of us here have been playing for so long we might think the barn idea is silly and we are past that, we\u0027ve all learned a lot about rockets and how to make them work in this game, or are rocket scientists already. But this is KERBAL Space Program, it\u0027s SUPPOSED to be silly. Way back when I started playing KSP I had the feeling of an amateur rocket enthusiast/crazy bomber because stuff just exploded all over the place. It spoke to the idea of who and what these little green dudes are: Crazy, Gung-Ho, not exceptionally bright, but still launching rockets! \u003C/p\u003E\u003Cp\u003EI say #Bringbackthebarn or #improvethebarnandthenbringitback. As it has been stated, and apparently overlooked, whatever was shown was only 20% complete. So, yes, the graphics were probably bad (again, I didn\u0027t see it), but they were INCOMPLETE! Whatever was seen would NOT have made it into 0.90.0. The models would have been finished, polished, adjusted, levelled, painted, etc. Now we don\u0027t know WHAT it would have looked like because people complained about the cake while it was still being baked.\u003C/p\u003E\u003Cp\u003EI love the barn idea, I think it fits the flavor of what KSP should be in the early game. I definitely want it to look nice too, as nice as a barn can look anyway. I think we should have that runway, even if it\u0027s just a dirt road that we take off and land on. A nice silo with a ladder/platform on it for air control it a good fit. Some trailers for the admin buildings, a Barn or two for the VAB and SPH. Tracking station could be a telescope, a laptop and some other instruments spread out on a card table. Think \u003Cem\u003EOctober Sky\u003C/em\u003E, but more haphazard and Kerballized.\u003C/p\u003E\u003Cp\u003EOf course, a re-worked Tech Tree to go along with it would be nice too. I want to build a crop-duster first... because I want to build planes first. Other people want probes first, and still more want to go full Kerbal and strap Jeb on top of a rocket for the maiden engine test.\u003C/p\u003E\u003Cp\u003ESo, I guess what I\u0027m saying is I agree with everyone to some extent. I love the barn idea, but the models should be up to (game-current) standards. Maybe Squad messed up in showing it to the public unfinished, but it sounds like a lot of really vocal people went a bit overboard in calling them out on it. It happened, oh well, let it go and look forward. Finish the barn, bring it back and lets see what doesn\u0027t explode when the engines light.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-12-20T02:46:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003ELol, alright \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EThis is the second time in a short while that we came to a compromise and an understanding. I wish everyone was as open minded.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe world is not black and white, it\u0060s all the crazy colours under the sun. Most people like colours...\u003C/p\u003E\u003Cp\u003EI generally come to an understanding with people that actually argue their point instead of attack and who carry on talking. Those two things generally lead to agreement or compromise eventually as the issues get worked out and common ground is found.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-12-20T02:52:18Z","Content":"\n\u003Cp\u003EThose who hate the barn: it is being reworked. \u003C/p\u003E\u003Cp\u003EThose who love the barn: it is coming back. \u003C/p\u003E\u003Cp\u003EEverybody: please remember other forum members are not your enemies, and keep these discussions civil.\u003C/p\u003E\n"}]}