{"TopicId":93546,"ForumId":32,"TopicTitle":"Science data from space around X contracts","CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2014-12-18T17:00:06Z","PageNum":1,"Articles":[{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2014-12-18T17:00:06Z","Content":"\n\u003Cp\u003EI\u0027m really glad that these are a bit more infrequent now in 0.90. I found them to be so prevalent in 0.25 that it was far too easy to get funds from just those contracts alone. In 0.90 they\u0027re still around, but you might have to zoom ahead 10-20 days before one shows up. They are still handy to take from time to time if you see them, because you can fulfill them with a probe or ship already in place.\u003C/p\u003E\u003Cp\u003EThis leads me to a couple handy tips:\u003C/p\u003E\u003Cp\u003E-- After you\u0027ve already completed the \u0022Explore X\u0022 for a body like the Mun or Minmus or whatever, it can still be good for science, XP, and fun to go back and land in other biomes. Take on a satellite contract for the same place to pay for the trip. It\u0027s pretty easy to add a tiny, simple probe to your lander/ship so that you can drop it off in the required orbit before you land. I\u0027ve started to design all of my landers to always include a tiny probe that I can deploy in orbit if I want. Since I\u0027ve also started taking 3 Kerbals on every voyage, the added mas of the probe is pretty small compared to the rest of the ship.\u003C/p\u003E\u003Cp\u003E-- For satellite contracts, if you use a docking port to deploy it instead of a decoupler, then you can retrieve the probe again after you get credit for the contract. Then you can take it and get some of the funds back when you return home, or maybe place it into an orbit more to your liking. I usually will drop it off in low orbit so that I will always be able to do those \u0022Science data from space around X\u0022 contracts later. You certainly don\u0027t need to leave the probe in space after the contract is complete, and it can help to avoid some clutter if you retrieve it.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2014-12-18T17:21:08Z","Content":"\n\u003Cp\u003EYeah. I haven\u0027t gotten to the Mun in 0.90.0 yet. I\u0027m going to later today. That and Minmus. I guess my StanSAT design could be placed on top of a lander, but I have no small docking parts....... So yeah. Man, 0.90 us taking forever... But it\u0027s fun too. I had to do the low-hanging fruit contracts earlier. Surveys and the like. I already have surveys on the Mun I have to do... And I haven\u0027t been there yet. Weird.\u003C/p\u003E\n"}]}