{"TopicId":93597,"ForumId":16,"TopicTitle":"Ship size and maneuver","CreatedByName":"Spody","CreatedById":132475,"CreatedDateTime":"2014-12-18T21:37:48Z","PageNum":1,"Articles":[{"CreatedByName":"Spody","CreatedById":132475,"CreatedDateTime":"2014-12-18T21:37:48Z","Content":"\n\u003Cp\u003EI am fairly new to the game, currently playing on version 0.90. The 2 things that i don\u0027t understand are: \u003C/p\u003E\u003Cp\u003E1. My rocket path displayed on the Map is always GRAY and i cannot place any maneuver nodes on it.\u003C/p\u003E\u003Cp\u003E2. I\u0027ve watched some videos and the players are building enormous rockets, while i am limited to 18t mass and 30 parts, i upgraded the launching pad to level 3 and yet that\u0027s the maximum.\u003C/p\u003E\u003Cp\u003EPlease help me and thanks in advance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-19T00:49:51Z\u0022 title=\u002212/19/2014 12:49  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 19, 2014\u003C/time\u003E by Spody\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"workerbee","CreatedById":131450,"CreatedDateTime":"2014-12-18T21:46:37Z","Content":"\n\u003Cp\u003EWith the new update, a lot of things are new and different in career mode. You have to unlock maneuver nodes. The limitations on mass and part count is designed to make career mode more of a grind, less easy, etc etc. The people building massive rockets are either in Sandbox or in a fully unlocked career game.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-12-18T21:47:45Z","Content":"\n\u003Cp\u003EWith 0.90, career has seen some changes. Now KSC buildings must be upgraded to unlock specific abilities, in particular:\u003C/p\u003E\u003Cp\u003E- to unlock maneuver nodes, need to upgrade Mission Control to tier 2;\u003C/p\u003E\u003Cp\u003E- to increase part count beyond 30 (to 255), you need to upgrade VAB and/or SPH to tier 2.\u003C/p\u003E\u003Cp\u003EThe limit of 18 tons should be changed to 140 tons with the runway/pad at tier 2; to unlimited at tier 3. If not, that would be an issue worth a report in support.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2014-12-18T21:47:51Z","Content":"\n\u003Cp\u003EYou have to upgrade the other buildings too. I think for the maneuver nodes you need a combo of both the mission control and tracking station buildings to be upgraded. Upgrade the VAB to have more parts on your rockets.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-12-18T22:49:44Z","Content":"\n\u003Cp\u003ELearn the game in sandbox mode.\u003C/p\u003E\u003Cp\u003ECareer mode \u0027helps\u0027 by removing the potentially-confusing number of parts when you start.\u003C/p\u003E\u003Cp\u003EIt then completely ruins any attempt at being a way to learn the game or provide a logical progression by i) having an insane tech-tree, ii) starting with manned missions, iii) requiring you to understand contracts, iv) making financial-management important, v) restricting what you can build/launch, vi) removing half the tools for flight-management, vii) crippling ship-operations until you \u0027train\u0027 crew (well, send them on long journeys anyway).\u003C/p\u003E\u003Cp\u003EAll of that is intended to make for a more challenging and complete \u0027game\u0027 but it\u0027s no way at all to learn how to build or fly spacecraft.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-12-18T22:58:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003ELearn the game in sandbox mode.\u003Cp\u003ECareer mode \u0027helps\u0027 by removing the potentially-confusing number of parts when you start.\u003C/p\u003E\u003Cp\u003EIt then completely ruins any attempt at being a way to learn the game or provide a logical progression by i) having an insane tech-tree, ii) starting with manned missions, iii) requiring you to understand contracts, iv) making financial-management important, v) restricting what you can build/launch, vi) removing half the tools for flight-management, vii) crippling ship-operations until you \u0027train\u0027 crew (well, send them on long journeys anyway).\u003C/p\u003E\u003Cp\u003EAll of that is intended to make for a more challenging and complete \u0027game\u0027 but it\u0027s no way at all to learn how to build or fly spacecraft.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA nice compromise is Science mode. Where you have the ease of not having lots of parts, without having to worry about money.\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-12-18T23:03:38Z","Content":"\n\u003Cp\u003ECareer mode was reasonable for new players back in 0.25: while contracts could be a bit confusing, and the absence of any starting probe core was silly, at least new players had all the tools they needed to understand what they were doing.\u003C/p\u003E\u003Cp\u003EWith 0.90, Squad decided new players didn\u0027t need confusing numbers like \u0022basic orbital information\u0022 or \u0022sphere-of-influence transitions\u0022. If all this stuff had come as a hard mode, it\u0027d be understandable, but they decided to take a baseball bat to career mode, and hardcode it so that it\u0027s impossible to mod.\u003C/p\u003E\n"},{"CreatedByName":"Spody","CreatedById":132475,"CreatedDateTime":"2014-12-19T00:48:27Z","Content":"\n\u003Cp\u003EThanks for the information, but when i first started career at medium it said that all of my buildings are fully upgraded at level 3 and yet i had the 18t and 30 parts limitations.\u003C/p\u003E\n"},{"CreatedByName":"Melcom","CreatedById":89393,"CreatedDateTime":"2014-12-19T01:57:07Z","Content":"\n\u003Cp\u003Ehmm?\u003C/p\u003E\u003Cp\u003ECareer means you start at zero and crawl up the ladder.\u003C/p\u003E\u003Cp\u003EIf you want to start full, try parts and features, just use Sandbox Mode.\u003C/p\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2014-12-19T02:02:24Z","Content":"\n\u003Cp\u003EIf you run the x64 version on windows there is a known issue where the building levels are \u0022borked\u0022 (yes thats the technical term) but the limits still apply somewhat. If you are running Win x64 I highly recommend (cant say how highly TBH) that you dont. It takes some tweaking/handholding and some people still cant get it to work after 3 months (due to Unity/not the people)\u003C/p\u003E\n"}]}