{"TopicId":93620,"ForumId":46,"TopicTitle":"Looking for suggestions on categories for KerbalStuff.com","CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2014-12-19T00:21:34Z","PageNum":1,"Articles":[{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2014-12-19T00:21:34Z","Content":"\n\u003Cp\u003EI\u0027ve been chatting with the Drew DeVault, author of the kerbalstuff.com site. While I think it is a great site and he has done a very professional job, I find that the lack of categories makes it less valuable than it otherwise would be.\u003C/p\u003E\u003Cp\u003EHe is open to merging changes to implement this feature of being able to filter by category.\u003C/p\u003E\u003Cp\u003EThe Curse site (\u003Ca href=\u0022http://www.curse.com/ksp-mods/kerbal\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.curse.com/ksp-mods/kerbal\u003C/a\u003E) has the following categories which seem very reasonable to me:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003ECommand \u0026amp; Control\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EGameplay\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EMiscellaneous\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EParts Pack\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EPhysics\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EPropulsion\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EResources\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EScience\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EShip Systems\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EStructural and Aerodynamic\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003ESub-assembly\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EUtility \u0026amp; Navigation\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo I have two questions:\u003C/p\u003E\u003Cp\u003E1. Would this be of interest to people?\u003C/p\u003E\u003Cp\u003E2. Right now there is a large mix of mods for 0.25 and 0.90, which I expect will quickly drop off as more mods get converted to 0.90. Would there be interest on being able to filter by KSP version?\u003C/p\u003E\u003Cp\u003EThanks in advance\u003C/p\u003E\u003Cp\u003ELinuxGuruGamer\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2014-12-19T15:40:12Z","Content":"\n\u003Cp\u003EOh; yes. I want categories, if only because it let\u0027s me know what\u0027s in a mod quickly, and if i\u0027m looking for, say, more engines, but not more wings, I can actually find things easier.\u003C/p\u003E\u003Cp\u003EKerbal Stuff is a great site, but to find something you\u0027re looking for, it\u0027s more like looking through a forest. Sure, it let\u0027s you stumble upon new mods easier, but for people who know what they\u0027re looking for, it\u0027s just annoying. (and it\u0027d be nice to get an \u0022at a glance\u0022 look at what a mod offers)\u003C/p\u003E\u003Cp\u003EKSP version filters would be nice as well.\u003C/p\u003E\n"}]}