{"TopicId":93714,"ForumId":55,"TopicTitle":"Kerbin Emergency Services","CreatedByName":"MCP520","CreatedById":132492,"CreatedDateTime":"2014-12-19T18:06:12Z","PageNum":1,"Articles":[{"CreatedByName":"MCP520","CreatedById":132492,"CreatedDateTime":"2014-12-19T18:06:12Z","Content":"\n\u003Cp\u003EI have been searching for months to find a mod or parts pack that will add parts related to fire, crash rescue, and EMS. I do a lot of public safety in real life (FD \u0026amp; EMS) and often will create my own fake missions in sandbox mode to recover crashed vessels and what not. The only thing I have found remotely close to this is KSO (which is awaiting compatibility with 0.90). \u003C/p\u003E\u003Cp\u003EIf anyone would like to create something or knows of something please let me know. The emergency lightbars in KSO are amazing but are only for those two rovers, as it is a single piece. Even just a mod or part pack that can have emergency light bars similar to those in KSO so I can add them to my other rovers and recovery ships would be awesome. \u003C/p\u003E\u003Cp\u003EMy apologies if this post is not in the correct place or this is not an authorized suggestion/request. I read the stickies and didn\u0027t see anything wrong with this. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-19T18:14:00Z","Content":"\n\u003Cp\u003ESeems like it might be okay as a mod, but I think a lot of players would find going to collect their crashed ships manually quite boring. There is a forum for requesting addons/mods though:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/19-General-Add-on-Affairs\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/forums/19-General-Add-on-Affairs\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"MCP520","CreatedById":132492,"CreatedDateTime":"2014-12-19T18:15:21Z","Content":"\n\u003Cp\u003Ethank you, I will post in there.\u003C/p\u003E\n"}]}