{"TopicId":93738,"ForumId":32,"TopicTitle":"Have Steam track modded KSP playtime","CreatedByName":"Hektos","CreatedById":84721,"CreatedDateTime":"2014-12-19T20:15:23Z","PageNum":1,"Articles":[{"CreatedByName":"Hektos","CreatedById":84721,"CreatedDateTime":"2014-12-19T20:15:23Z","Content":"\n\u003Cp\u003EHello fellow KSPers. I have been playing KSP on steam since last year and have been keeping my modded KSP installs on a separate HDD (so that updates do not break them). However, this causes Steam to not track my time played on any modded installs. I know this is a fairly trivial for some people, but I see my play time as a sort of \u0022badge of honor\u0022 for myself.\u003C/p\u003E\u003Cp\u003EWhat I want to know is, is there any way to keep my vanilla copy in the steam folder (for updating purposes) but also have Steam track the play time from my modded copy of KSP? I know I could switch the folders in and out of the SteamApps folder, but that creates a new problem when there is an update and can bork my modded installs (thank you Steam auto-update \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_dry.png\u0022 alt=\u0022\u0026lt;_\u0026lt;\u0022\u003E).\u003C/p\u003E\u003Cp\u003EIf anyone knows of any solutions that would be much appreciated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 alt=\u0022^_^\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kip336","CreatedById":131629,"CreatedDateTime":"2014-12-19T20:26:04Z","Content":"\n\u003Cp\u003EYou could leave your modded KSP in your steam folder, and turn auto updates off? That way, when there is a new update, steam will mention that in your game library.\u003C/p\u003E\u003Cp\u003EYou\u0027ll have to do a bit of copying and pasting files for each update though; Backup your modded KSP, update KSP, backup the update and then restore your mods, but that would work, and wouldn\u0027t require you to switch your folders every time you play.\u003C/p\u003E\n"},{"CreatedByName":"Hektos","CreatedById":84721,"CreatedDateTime":"2014-12-19T21:51:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kip336\u0022 data-cite=\u0022Kip336\u0022\u003E\u003Cdiv\u003EYou could leave your modded KSP in your steam folder, and turn auto updates off? That way, when there is a new update, steam will mention that in your game library.\u003Cp\u003EYou\u0027ll have to do a bit of copying and pasting files for each update though; Backup your modded KSP, update KSP, backup the update and then restore your mods, but that would work, and wouldn\u0027t require you to switch your folders every time you play.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had thought about that but (as far as I know) you can\u0027t disable auto-update completely and the game will still start an update when you go to launch.\u003C/p\u003E\u003Cp\u003EEDIT: I\u0027m an idiot! I totally forgot about the \u0022launch options\u0022 that Steam has. If you paste the location of your modded KSP into the set launch options of steam in quotes, followed by %command% it will launch KSP from a location other than SteamApps and still keep track of your play time.\u003C/p\u003E\u003Cp\u003EEx:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u0022D:\\Kerbal Space Program v0.25\\KSP.exe\u0022 %command%\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThere doesn\u0027t seem to be any adverse effects as far as I can tell (aside from a slightly longer startup time).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-19T21:59:39Z\u0022 title=\u002212/19/2014 09:59  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 19, 2014\u003C/time\u003E by Hektos\u003C/strong\u003E\n\u003C/span\u003E\n"}]}