{"TopicId":93773,"ForumId":51,"TopicTitle":"Matt\u0026#039;s beta career! (possibly informative too... with any luck)","CreatedByName":"mattihase","CreatedById":73161,"CreatedDateTime":"2014-12-20T00:04:17Z","PageNum":1,"Articles":[{"CreatedByName":"mattihase","CreatedById":73161,"CreatedDateTime":"2014-12-20T00:04:17Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003EHello and welcome to my sorta report thing where i tell you some of the things that i\u0027ve done and are hopefully entertained\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ei need to work on the title.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003Eso i guess you can work out the format of this: i fly a bunch of flights, pick out the highlights, pair that with a relevant screenshot and post em up here\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003Efirst things first a quick intro\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E0.90\u0027s been out for a few days (as of the time of writing) so i downloaded it and set up a game either yesterday or the day before,\u003C/p\u003E\u003Cp\u003Enow i\u0027m sure many people went and played around with the new parts and stuff in sandbox but i just dove in.\u003C/p\u003E\u003Cp\u003Ehere\u0027s some quick game info: i\u0027m running a 32 bit install on a 64 bit pc in 1920x1080 and have KAC installed (but not really in use at the moment) since the second time i loaded up the game.\u003C/p\u003E\u003Cp\u003Eand my career difficulty settings were pretty similar to hard but i messed around with them for the sake of messing. i have left revets and quicksaving/loading on for convenience sake.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003Epart 1: reaching for the skies, followed by some falling\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Efirst thing i did was... well the first thing i did was check out the t1 space centre but after that i went and accepted the first 2 contracts (launch a vessel and break 5000m)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AH66H5Z.png\u0022 alt=\u0022AH66H5Z.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ei tend to start career modes by simply strapping a pod onto a SRB. since a while ago i tried playing with deadly re-entry i ended up tweaking the SRB down to both 50% fuel and thrust. which still managed to get jeb up to around 10k.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/27zLpUy.png\u0022 alt=\u002227zLpUy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethe SRB sadly did not survive landing but the pod did so i went through the process of getting out and getting a surface sample from the space center and... huh no option for that. it turned out that scoops have to be unlocked by upgrading the labs. the pod and jeb were recovered and i had room for the next two contracts. i also had enough science for the first research node but another tradition of mine is making a liquid fuel rocket before getting that node\u003C/p\u003E\u003Cp\u003Eso i made this thing (i forgot to screenshot it in flight so here it is in the VAB)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6EugmP7.png\u0022 alt=\u00226EugmP7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethis little rocket, still flown by jeb, managed to get me up past the 11KMs altitude my next contract asked for (and maybe the 22km one that i have but i\u0027m not sure where from), \u003C/p\u003E\u003Cp\u003Eso seeing progress was climbing at a steady rate i grabbed the node and created this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KHQdlXW.png\u0022 alt=\u0022KHQdlXW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe space pioneer, coming in at 17.4 tons this vessel was a tight squeeze for the launch pad\u0027s then limit of 18t but as you\u0027ll see there has been some much tighter since.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RNbAnSP.png\u0022 alt=\u0022RNbAnSP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eit got it into space first time but something happened on the landing and it was eaten by the ocean so i reverted and tried the landing again, with more success. the goo canisters and the pod survived and i was able to reap the reward of \u0022flying at kerbin\u0022, \u0022upper atmosphere\u0022 and \u0022low orbit\u0022 science, even if i couldn\u0027t use the last goo as they had detached from the ship during landing. and the goo canister (or goo pod as i will now call them to save time) that was attached to the launch frame thing gave a few more sciences. \u003C/p\u003E\u003Cp\u003Efinally from this mission i completed the contracts \u0022use LV-T45 at pad\u0022 (the other reason for the launch frame) and \u0022leave the atmo\u0022.\u003C/p\u003E\u003Cp\u003Enext stop orbit!! or failure as it turned out.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hgxBCzZ.png\u0022 alt=\u0022hgxBCzZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Espace attainer managed to not get into orbit. it also has a bunch of fuel tweaked out of it so i could launch it so that might be why.\u003C/p\u003E\u003Cp\u003Enot deterred i built the mysterious \u0022orbit attainer\u0022, which could have been shown in any of the following images but i have no idea because its VAB file has been reduced to a single capsule. either i didn\u0027t save it or there were some bugs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o6sOniz.png\u0022 alt=\u0022o6sOniz.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QRGcKPK.png\u0022 alt=\u0022QRGcKPK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Esaying that i do know it managed to get above 240km for \u0022in space far above kerbin\u0022 science because next i sent this \u0022orbit conqueror\u0022 up to get material bay science from the above. actually the attainer probably looked like this but without the matbays and with goo pods\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YPJfnJw.png\u0022 alt=\u0022YPJfnJw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Especial mention to the lawn dart plane. it may have been front heavy to the point of nosediving but it is my first (and currently only) plane design.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2jLr0VM.png\u0022 alt=\u00222jLr0VM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Enext time: bigger launchpad and an orbital rescue leads to someone having to sleep on the couch.\u003C/p\u003E\u003Cp\u003Edisclaimer: if you don\u0027t like this font: tough, i do.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}