{"TopicId":9379,"ForumId":21,"TopicTitle":"CX-10 SpaceBlade","CreatedByName":"Jatizso","CreatedById":21720,"CreatedDateTime":"2012-04-09T16:09:00Z","PageNum":1,"Articles":[{"CreatedByName":"Jatizso","CreatedById":21720,"CreatedDateTime":"2012-04-09T16:09:00Z","Content":"\n\u003Cp\u003EHi guys, I recently tried making the fastest and most lightweight craft I could. So here\\\u0027s the result, the CX-10 SpaceBlade. The fastest horizontal surface speed she ever got to was 846 m/s. I don\\\u0027t know if it\\\u0027s great or not, but to me it\\\u0027s pretty impressive. the SpaceBlade is an Aerodynamic plane with 3 boosters and has a total mass of 8.29 kilos.\u003Cimg src=\u0022http://i.imgur.com/XjF6z.jpg\u0022 alt=\u0022XjF6z.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/4Vi2l.png\u0022 alt=\u00224Vi2l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFeel free to share your craft.\u003C/p\u003E\n"},{"CreatedByName":"sirguinea","CreatedById":17565,"CreatedDateTime":"2012-04-09T19:57:10Z","Content":"\n\u003Cp\u003ELooks great! How does it handle? \u003C/p\u003E\n"},{"CreatedByName":"Jatizso","CreatedById":21720,"CreatedDateTime":"2012-04-09T20:06:11Z","Content":"\n\u003Cp\u003EIt tends to spiral and stall ALOT in the first 30 seconds or so after take-off, but as soon as you start loosing altitude it gets a little better. When you try to turn it, you\\\u0027re always going to experience alot of crazy spinning and flipping. The only way to \u0027land\u0027 her with the kerbals still alive is by giving it a parachute, but even then half of it gets destroyed. I\\\u0027ll still be working on it further.\u003C/p\u003E\n"},{"CreatedByName":"sirguinea","CreatedById":17565,"CreatedDateTime":"2012-04-09T20:12:26Z","Content":"\n\u003Cp\u003EEven at low throttle? I understand it being a pain at your top speed but I\\\u0027m thinking you can kill the gas to make turns and such. Looks like it would be fun to stick onto a larger ship and detach at a higher altitude. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jatizso","CreatedById":21720,"CreatedDateTime":"2012-04-09T20:16:20Z","Content":"\n\u003Cp\u003EYeah, at low throttle it\\\u0027s fine, but the slowest I can get without stalling is 50 m/s. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E On another note, I have yet to try separating it from a larger ship. It would be relatively easy due to its size and weight.\u003C/p\u003E\n"},{"CreatedByName":"Jatizso","CreatedById":21720,"CreatedDateTime":"2012-04-09T21:18:21Z","Content":"\n\u003Cp\u003EI tried making a mothership to release the SpaceBlade, but the moment i launch it rises about 10 meters and noses down then hits the ground and explodes, all in less than 10 seconds... \u0026gt;\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/V5lVJ.png\u0022 alt=\u0022V5lVJ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jatizso","CreatedById":21720,"CreatedDateTime":"2012-04-09T21:30:07Z","Content":"\n\u003Cp\u003EActually I just put more canards on every single wing and winglet, and it kind of works... I\\\u0027m able to keep a good trajectory for about 10 seconds, giving me enough time to launch the SkyBlade which is asurprisingly smooth launch. I\\\u0027ll have to keep trying stuff out to really make the whole thing fly, though. I also fixed the SkyBlade itself a little, it is now able to effectively carry out smooth turns even at full speed. Both planes are surprisingly agile.\u003C/p\u003E\u003Cp\u003EEDIT: The mothership now fully works, minus the fact that it cannot go vertical, it can only stay horizontal no matter what, which means I can\\\u0027t take it into orbit as it is right now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tim_Barrett","CreatedById":3206,"CreatedDateTime":"2012-04-09T23:17:44Z","Content":"\n\u003Cp\u003EMove those two giant wings up further and it should fly fine.\u003C/p\u003E\n"},{"CreatedByName":"Jatizso","CreatedById":21720,"CreatedDateTime":"2012-04-10T01:20:08Z","Content":"\n\u003Cp\u003EThere we go. Flies like a bird ;D \u003C/p\u003E\n"}]}