{"TopicId":9383,"ForumId":34,"TopicTitle":"[0.22] ISA MapSat 4.0 Dev Build","CreatedByName":"Innsewerants","CreatedById":16461,"CreatedDateTime":"2012-04-09T16:41:21Z","PageNum":79,"Articles":[{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-11-26T22:34:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nebu\u0022 data-cite=\u0022Nebu\u0022\u003E\u003Cdiv\u003EAre you sure you installed the mod in the GameData folder? I had the same problem. I extracted the folders in the main directory at first and everything messed up like in the picture.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am officially an idiot! Cheers for creating an account to point that out to me, working properly now (except occasionally getting the \u0022ISA and Polar\u0022 issue)\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-11-27T16:17:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EI am officially an idiot! Cheers for creating an account to point that out to me, working properly now (except occasionally getting the \u0022ISA and Polar\u0022 issue)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDeleting the GPS part seemed to have solved things, until one of my craft was swallowed by the Kraken, and I quickloaded. I don\u0027t think the plugin liked that, and wouldn\u0027t show me my ISA and Polar maps any more. Oh dear!\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-11-27T18:42:45Z","Content":"\n\u003Cp\u003EOn ISA and POLAR MAPS not working.\u003C/p\u003E\u003Cp\u003ETo anybody who may find this useful: as another user who has experienced this problem (where ISA and POLAR maps are changed into a low definition blob, never getting updated anymore), I have tried what could be the cause of the issue starting with a clean install and a single MAP Satellite in orbit. A number of tests were conducted to find possible interference with other mods (I use to play with 40 mods installed), but none was found to have any effect.\u003C/p\u003E\u003Cp\u003EInstead, the problem immediately arises when the game is changed, it seems something gets corrupted with a different save (e.g. other than persistent.sfs or quicksave.sfs) not being recognized. \u003C/p\u003E\u003Cp\u003ETo revert the situation, the best way out is to delete the files \u0022*_ISA_topo.png\u0022 and \u0022*_Polar_topo.png\u0022 (those files will have shrunk to less than 1 KB when the problem occurred) and let the ISA MapSat plugin regenerate them from scratch at the next restart (takes some time with the game unresponsive).\u003C/p\u003E\u003Cp\u003EI observe that ISA Mapsat is (probably) the only mod to maintain data (the maps: *.png and *.csv) from a game within its own folder, instead of in the game folder (under GameData/saves), however there is no link with the save that originated the maps, and therefore it is susceptible to issues if data don\u0027t match.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T19:46:37Z\u0022 title=\u002211/27/2013 07:46  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by diomedea\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Romby","CreatedById":70744,"CreatedDateTime":"2013-11-27T22:56:17Z","Content":"\n\u003Cp\u003EHave a problem with mod. Every time i switch to a craft with a ISA Mapsat my used memory jumps up around 400-500 mb. As i leave craft (space station or other craft) memory usage doesnt go down again. If i then again switch to a craft with ISA Mapsat (same/or a new one) my used memory jumps 400-500 mb further up. So i can crash my game by swithing between mapsat crafts a couple of times.\u003C/p\u003E\u003Cp\u003ESure it is the mapsat parts. Since i tested it. First i switch to a lander can on runway a couple of time. Used memory went a bit up every time, but down again as went to spacecenter. Then i switched to landercan with mapsat on launchpad and what i described above happened.\u003C/p\u003E\u003Cp\u003EHave anyone tried this? Know a solution?\u003C/p\u003E\u003Cp\u003EEdit: Hmm just reverted a flight and mb went down again :/. Seems like only way i can leave a craft with increased used memory. but strange since switching betwen one craft with mapsat and space spation a couple of times keeps increasing used memory.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-27T23:00:47Z\u0022 title=\u002211/27/2013 11:00  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 27, 2013\u003C/time\u003E by Romby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nebu","CreatedById":94403,"CreatedDateTime":"2013-11-28T17:11:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EI am officially an idiot! Cheers for creating an account to point that out to me, working properly now (except occasionally getting the \u0022ISA and Polar\u0022 issue)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problem but this was not the only reason (-: \u003C/p\u003E\u003Cp\u003EI also wanted to post about the broken map bugs (polar and isa) but some people already did.\u003C/p\u003E\u003Cp\u003ENow I think we have to wait for a new version. It seems to happen randomly for me.\u003C/p\u003E\n"},{"CreatedByName":"razanon","CreatedById":94540,"CreatedDateTime":"2013-12-02T20:42:00Z","Content":"\n\u003Cp\u003Ejust installed \u0022Mapsat 4 devbuild 2\u0022 everything ok, i put the dish on my capsule, and on launchpad screen game freezes. if i quit that dish games goes normal\u003C/p\u003E\u003Cp\u003Ei had more mods (the must have ones)\u003C/p\u003E\u003Cp\u003Ei dont installed any previous versions, only file Mapsat 4 devbuild 2.zip\u003C/p\u003E\u003Cp\u003Eits ram related? cant use it with many mods? or i need to install something besides that zip file??\u003C/p\u003E\u003Cp\u003Ethx in advance\u003C/p\u003E\n"},{"CreatedByName":"Dix2lespace","CreatedById":95338,"CreatedDateTime":"2013-12-03T09:52:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EYeah, I have the exact same problem, not quite sure what it is, I\u0027ve tried deleting everything associated with the plugin and reinstalling. Strange! And a pity, because I love this mod!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei had the same problem, but now it\u0027s solved. It was a problem of location install: don\u0027t put the files (who are in the \u0022Innsewerants Space Agency\u0022) in KSP/Parts or KSP/ pluginData directly.\u003C/p\u003E\u003Cp\u003EPut the general file \u0022Innsewerants Space Agency\u0022 with all files inside in \u0022GameData\u0022.\u003C/p\u003E\u003Cp\u003EAfter that, there\u0027s normally no problem with the graphic interface of ISA MapSAT 4.\u003C/p\u003E\u003Cp\u003E(sorry for my bad english)\u003C/p\u003E\n"},{"CreatedByName":"LameFrog","CreatedById":75711,"CreatedDateTime":"2013-12-10T08:23:17Z","Content":"\n\u003Cp\u003EI want to explore Jool system and want to send some ISA mapsat dishs on separate command pods on one mother ship, but after launch button click game is glitching. Help, how i can deliver some mapsat dishs to Jool on one mother ship?\u003C/p\u003E\n"},{"CreatedByName":"Mr. Scruffy","CreatedById":38540,"CreatedDateTime":"2013-12-10T09:55:42Z","Content":"\n\u003Cp\u003EI am experiencing a problem with the topographic maps. They only seem to display a zoomed-in detail or something after having switched ships back and forth for a bit. I am also experiencing crashes from time to time (and didnt without IMS).\u003C/p\u003E\u003Cp\u003EISA MAP SAT is one of my fav mods for this game. ItÃ‚Â´s sort of a pity that the author seems to have too little time to keep it up and in shape with the progress the main game is doing. In its current state, iÃ‚Â´d not recommend using it, despite its potential awesomeness. I really wish, the author would pick a willing, able and trustworthy community member as his assistant coder. I mean the intention of the mod is obvious by now, so there is no Ã‚Â´visionÃ‚Â´ to be Ã‚Â´betrayedÃ‚Â´, or something like that. ItÃ‚Â´s all about implementation at this point...\u003C/p\u003E\n"},{"CreatedByName":"Cancanaja","CreatedById":96301,"CreatedDateTime":"2013-12-11T13:20:43Z","Content":"\n\u003Cp\u003EHi everybody\u003C/p\u003E\u003Cp\u003Ei\u0027m a Mac user and i\u0027m playing KSP on Steam. I can\u0027t figure out how to install it.\u003C/p\u003E\u003Cp\u003EAny help?\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2013-12-11T14:16:34Z","Content":"\n\u003Cp\u003EFor Those that like to map but find this mod is a ram hog you can try this 1 it works better \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-WIP-SCANsat-terrain-mapping\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-WIP-SCANsat-terrain-mapping\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr. Scruffy","CreatedById":38540,"CreatedDateTime":"2013-12-12T09:25:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MeCripp\u0022 data-cite=\u0022MeCripp\u0022\u003E\u003Cdiv\u003EFor Those that like to map but find this mod is a ram hog you can try this 1 it works better \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-WIP-SCANsat-terrain-mapping\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-WIP-SCANsat-terrain-mapping\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThx alot! \u003C/p\u003E\u003Cp\u003EThx alot also to the author of IMS (no cynism, really!), but i guess your work has been caught up on. I sincerely am grateful to the pioniering work of yours, but it seems a claim can only be held if its continiously worked on. In that sense, iÃ‚Â´d kindly ask you to not bicker with the devs of the other map-mod about Ã‚Â´rightsÃ‚Â´ or such. Though they (/he/she) could give you an honourable mention in theirs, even if they did not take a single line of code from you.\u003C/p\u003E\u003Cp\u003ELong story short: We got a working replacement, now, and i hope there wont be any fuzz about it.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-12T10:01:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr. Scruffy\u0022 data-cite=\u0022Mr. Scruffy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003ELong story short: We got a working replacement, now, and i hope there wont be any fuzz about it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI may have missed something, if that\u0027s the case, would ask you to clarify. I never found any reference to some claim from this mod author, even less to any bickering about rights or primogeniture of the idea. \u003C/p\u003E\u003Cp\u003EI concur with what you say, SCANSAT is now a more enjoyable mod and provides more functionality in a better GUI, while also being less intensive on RAM. Therefore, if I had to choose only one mapping mod, it would be SCANSAT. But I have the opportunity to use both, and both of them work in my install. I am still fascinated at the method used by this mod to conduct scanning in a very \u0022close-to-reality\u0022 way. Would not use it for systematic mapping, but like at times to see what it produces.\u003C/p\u003E\u003Cp\u003ECertainly this mod requires some work, I know it has bugs, must be optimized and improved in functionality. Unfortunately the author has not shown since Nov 11th.\u003C/p\u003E\n"},{"CreatedByName":"MainSailor","CreatedById":74050,"CreatedDateTime":"2013-12-12T12:42:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cancanaja\u0022 data-cite=\u0022Cancanaja\u0022\u003E\u003Cdiv\u003EHi everybody\u003Cp\u003Ei\u0027m a Mac user and i\u0027m playing KSP on Steam. I can\u0027t figure out how to install it.\u003C/p\u003E\u003Cp\u003EAny help?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey Cancanaja!\u003C/p\u003E\u003Cp\u003EThe Steam files are in \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003E/Users/\u0027yourusername\u0027/Library/Application Support/Steam/Steamapps/Common/Kerbal Space Program\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYou can navigate to this from Finder, or you can Command Shift G (go to folder shortcut) and type that path in there. Note you have to replace \u0027yourusername\u0027 with your actual user name. That\u0027s not a shortcut like %USERNAME% on Windows.\u003C/p\u003E\u003Cp\u003EOnce you\u0027re there you should be able to drag the folder into the GameData folder. You might want to make a shortcut (alias) on your desktop to GameData for easy access in installing other mods.\u003C/p\u003E\n"},{"CreatedByName":"Cancanaja","CreatedById":96301,"CreatedDateTime":"2013-12-12T16:32:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MainSailor\u0022 data-cite=\u0022MainSailor\u0022\u003E\u003Cdiv\u003EHey Cancanaja!\u003Cp\u003EThe Steam files are in \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003E/Users/\u0027yourusername\u0027/Library/Application Support/Steam/Steamapps/Common/Kerbal Space Program\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYou can navigate to this from Finder, or you can Command Shift G (go to folder shortcut) and type that path in there. Note you have to replace \u0027yourusername\u0027 with your actual user name. That\u0027s not a shortcut like %USERNAME% on Windows.\u003C/p\u003E\u003Cp\u003EOnce you\u0027re there you should be able to drag the folder into the GameData folder. You might want to make a shortcut (alias) on your desktop to GameData for easy access in installing other mods.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you very much MainSailor, \u003C/p\u003E\u003Cp\u003Ei knew where the folder was, but i couldn\u0027t get the mod operating.\u003C/p\u003E\u003Cp\u003EI realise that i had a \u0022don\u0027t know what\u0022 version of it with everything messed up.\u003C/p\u003E\u003Cp\u003EI downloaded the upgraded one and now everything works perfectly. I was wondering where to put the freaking PluginData folder.\u003C/p\u003E\u003Cp\u003EI don\u0027t know if this is the right place but i\u0027m using Scansat mod. Are there any differences?\u003C/p\u003E\n"},{"CreatedByName":"Lexif","CreatedById":65533,"CreatedDateTime":"2013-12-12T21:58:49Z","Content":"\n\u003Cp\u003EAll my display maps (so far for Kerbin and the Mun) are only 8x8 pixel in size. Meanwhile, the Biome maps are working fine, but have the smaller format of the old verstion. I\u0027m using the X2r4-version from the blog. I think it worked fine with the older dev build. Is this a known problem with a solution? I set the textures to half size in the KSP settings as my machine is not up to the task otherwise, if that might be a factor.\u003C/p\u003E\u003Cp\u003EI tried to search the thread, but it\u0027s kind of hard to find good search terms for this problem. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lexif","CreatedById":65533,"CreatedDateTime":"2013-12-12T22:05:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cancanaja\u0022 data-cite=\u0022Cancanaja\u0022\u003E\u003Cdiv\u003EI don\u0027t know if this is the right place but i\u0027m using Scansat mod. Are there any differences?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would use scansat as it has some awesome features, but the dealbreaker for me is that the scan width apparently doesn\u0027t depend on the orbit altitude. I like how you have to decide between speed and resolution with ISAmapsat, and the challenge of setting up a good mapping orbit.\u003C/p\u003E\n"},{"CreatedByName":"MainSailor","CreatedById":74050,"CreatedDateTime":"2013-12-13T13:31:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lexif\u0022 data-cite=\u0022Lexif\u0022\u003E\u003Cdiv\u003EI would use scansat as it has some awesome features, but the dealbreaker for me is that the scan width apparently doesn\u0027t depend on the orbit altitude. I like how you have to decide between speed and resolution with ISAmapsat, and the challenge of setting up a good mapping orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. The way I see it:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EISA MapSat:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPros:\u003C/strong\u003E Very detailed maps, parts are actually \u0027scanning\u0027, realistic orbit height versus scan resolution, takes much longer to scan large planets. Dumps data into tables for other types of visualization.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECons:\u003C/strong\u003E Extremely resource intensive (RAM) on your computer, orbits can be finicky to completely cover planets, takes a long time to scan (yes I mentioned this twice.) Still buggy in the .22 era, and seems to have been abandoned by mod creator. Physical scanning dish part can be buggy and hard to click on, only scans terrain, won\u0027t scan while vessel is not active.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EScanSat:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPros:\u003C/strong\u003E Doesn\u0027t use computer resources, scans quickly. All vessels with parts installed scan even when they\u0027re not the active vessel. Scans biomes, terrain, and anomalies, and shows you the data in different formats (color and B\u0026amp;W relief, slope, biome). Needs multiple parts and multiple orbit heights to scan different \u0027layers\u0027. Excellent \u0027aftermarket\u0027 antennae (by \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/49233-WIP-Parts-from-my-garden-shed-SCANsat-Antennae\u0022 rel=\u0022external nofollow\u0022\u003EMilkshakefiend\u003C/a\u003E). Throw it a reasonably high polar orbit and it yields excellent coverage.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECons:\u003C/strong\u003E Time acceleration can scan planets extremely (and unrealistically) quickly. SAR scanning is designed to scan in a high orbit, but given a low orbit will give you the same resolution and beam width, and scan faster. Negates the need to have the \u0027faster, low resolution\u0027 altimetry scanners when you can just send the SAR and multispectral and scan a whole planet with a few minutes of acceleration. Stock models are pretty basic and repetitive (although that\u0027s addressed in the Pros.) Doesn\u0027t (to the best of my knowledge) export data other than the color maps in PNG format.\u003C/p\u003E\n"},{"CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2013-12-14T00:56:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr. Scruffy\u0022 data-cite=\u0022Mr. Scruffy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThx alot also to the author of IMS (no cynism, really!), but i guess your work has been caught up on. I sincerely am grateful to the pioniering work of yours, but it seems a claim can only be held if its continiously worked on. In that sense, iÃ‚Â´d kindly ask you to not bicker with the devs of the other map-mod about Ã‚Â´rightsÃ‚Â´ or such. Though they (/he/she) could give you an honourable mention in theirs, even if they did not take a single line of code from you.\u003C/p\u003E\u003Cp\u003ELong story short: We got a working replacement, now, and i hope there wont be any fuzz about it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat the crap is this? \u003C/p\u003E\u003Cp\u003EA presumptuous, quasi-aggressive, backhanded complisult implying that Innsewerants has somehow been bested and is likely to become jealous and lash-out like a child?\u003C/p\u003E\u003Cp\u003EWas there some sort of an issue to warrant this comment, or is it as absurd and condescending as it sounds?\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2013-12-14T01:52:57Z","Content":"\n\u003Cp\u003EThankfully Innsewerants has never shown any predisposition to childish behaviour.\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2013-12-14T16:46:47Z","Content":"\n\u003Cp\u003Emissed a vandetta whoops, should\u0027nt have been away so long ....\u003C/p\u003E\u003Cp\u003Eregarding thoose kind of feature i m wondering if there not a way to simulate the process @ some point something like:\u003C/p\u003E\u003Cp\u003E@loading/leaving scene\u003C/p\u003E\u003Cp\u003E@docking/undocking\u003C/p\u003E\u003Cp\u003E@statusvesselmoving true/false (// stable orbit)\u003C/p\u003E\u003Cp\u003E@else (?)\u003C/p\u003E\u003Cp\u003Eget: current time/date when @modifier precalcul/update result via math in a minimalisitic log file \u002B show part/of precalculated result or alike\u003C/p\u003E\u003Cp\u003Enot yet looked deep in the plugins stuff but from what i have seen here and there so far seem an alternate approach for multiple scene / 2,5km limit simulating thing at some time stamps modifier insteed of always.\u003C/p\u003E\u003Cp\u003E(just a thought between others anyway)\u003C/p\u003E\u003Cp\u003Edefinetly need a terrain mapping feature/addon, (same with sat relay time realisitic or/and not)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-14T16:50:05Z\u0022 title=\u002212/14/2013 04:50  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 14, 2013\u003C/time\u003E by WinkAllKerb\u0026#39;\u0026#39;\u003C/strong\u003E\n\u003Cbr\u003Etoo much coffee typo \u002B low batt keyboard xD\n\u003C/span\u003E\n"},{"CreatedByName":"dronkit","CreatedById":67237,"CreatedDateTime":"2013-12-18T20:53:37Z","Content":"\n\u003Cp\u003EGuys! I updated to KSP 0.23 and Mapsat 4 devbuild 2. I can\u0027t find the Mapsat GPS in \u0022science\u0022 or \u0022utility\u0022 (?!!?) is it gone?!? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dronkit","CreatedById":67237,"CreatedDateTime":"2013-12-18T20:55:09Z","Content":"\n\u003Cp\u003Eoh, disabled \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-12-18T21:08:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022little square dot\u0022 data-cite=\u0022little square dot\u0022\u003E\u003Cdiv\u003EWas there some sort of an issue to warrant this comment, or is it as absurd and condescending as it sounds?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEasy there boy. His comment was a bit clumsy but pretty harmless, and by responding in such an offensive matter you are bound to drag it into conflict territory. Just leave it be and let\u0027s not make more out of it than it is.\u003C/p\u003E\n"},{"CreatedByName":"Dweller_Benthos","CreatedById":15418,"CreatedDateTime":"2013-12-18T21:14:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dronkit\u0022 data-cite=\u0022dronkit\u0022\u003E\u003Cdiv\u003EGuys! I updated to KSP 0.23 and Mapsat 4 devbuild 2. I can\u0027t find the Mapsat GPS in \u0022science\u0022 or \u0022utility\u0022 (?!!?) is it gone?!? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou should be able to edit the cfg file to allow it\u0027s use in the career mode, that is, if it\u0027s compatible with .23 at all.\u003C/p\u003E\n"}]}