{"TopicId":9383,"ForumId":34,"TopicTitle":"[0.22] ISA MapSat 4.0 Dev Build","CreatedByName":"Innsewerants","CreatedById":16461,"CreatedDateTime":"2012-04-09T16:41:21Z","PageNum":60,"Articles":[{"CreatedByName":"Mechrior","CreatedById":57987,"CreatedDateTime":"2013-06-26T07:26:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bloodbunny\u0022 data-cite=\u0022Bloodbunny\u0022\u003E\u003Cdiv\u003EEDIT: Yep, that\u0027s why a lot of people are having crashes, RAM spikes nearly a gig when going to the map thanks to mapsat. Even KW Rocketry doesn\u0027t put the crunch on the game the way this thing does.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewelp that means I cant use it on my modded save, shame though. come on KSP release 64bit compat!!!!\u003C/p\u003E\n"},{"CreatedByName":"KOCOUR","CreatedById":37749,"CreatedDateTime":"2013-06-26T07:52:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mechrior\u0022 data-cite=\u0022Mechrior\u0022\u003E\u003Cdiv\u003Ewelp that means I cant use it on my modded save, shame though. come on KSP release 64bit compat!!!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat? KSP isnt 64bit compatible?\u003C/p\u003E\n"},{"CreatedByName":"Bloodbunny","CreatedById":67274,"CreatedDateTime":"2013-06-26T08:22:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KOCOUR\u0022 data-cite=\u0022KOCOUR\u0022\u003E\u003Cdiv\u003EWhat? KSP isnt 64bit compatible?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it\u0027s a 32 bit program, which means the RAM use is limited to something like 3.5 gigs. A 64 bit program can use whatever you have.. 16 gigs? Ok, load up everything you want..\u003C/p\u003E\u003Cp\u003EI doubt KSP will ever be 64 bit though, as Squad has stated that it would require recoding the entire engine...don\u0027t hold your breath... Hopefully the heavy mods like KW and Mapsat will get some optimizations to reduce the footprint.. I know KW is working on it, Mapsat may be a bit more of a challenge though.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-06-26T10:14:36Z","Content":"\n\u003Cp\u003EI\u0027m hitting the memory wall too with version 4.0, I didn\u0027t have this issue with 3.3.1 though, at least not with the older KSP versions.\u003C/p\u003E\u003Cp\u003EI think I\u0027ll try and go back to the older Mapsat version and see how it behaves in 20.2.\u003C/p\u003E\u003Cp\u003EI wonder if running my computer in Turbo Boost mode would help any? It\u0027s supposed to kill some of the unnecessary programs running in the background and free up some memory.\u003C/p\u003E\n"},{"CreatedByName":"Castun","CreatedById":4581,"CreatedDateTime":"2013-06-26T10:59:32Z","Content":"\n\u003Cp\u003EWhat I just don\u0027t understand is WHY the dev version takes up so much memory. Each map image is only ~2.5MB, and the GUI icons total 1/5 of a MB, but even a fresh install with no planets mapped yet suffers from the same issue. There is literally nothing in this mod that should take up that insane amount of RAM on it\u0027s own.\u003C/p\u003E\n"},{"CreatedByName":"GavinZac","CreatedById":68719,"CreatedDateTime":"2013-06-26T14:29:29Z","Content":"\n\u003Cp\u003EOn disk, the files are stored as PNG which involves interpolation and compression. In memory, the images are handled pixel by pixel, essentially making them \u0027bitmap\u0027 in memory. Bitmaps are substantially fatter than other image types.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2013-06-27T01:58:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mechrior\u0022 data-cite=\u0022Mechrior\u0022\u003E\u003Cdiv\u003Ewelp that means I cant use it on my modded save, shame though. come on KSP release 64bit compat!!!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWill probably happen as soon as the idiots at Unity actually make their engine 64 bit / multithreaded. Who the hell knows when that will be though.\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2013-06-27T03:30:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Parkenev\u0022 data-cite=\u0022Parkenev\u0022\u003E\u003Cdiv\u003EHey, i am having problems with this\u003Cp\u003EI have installed ISA_MapSat Dev 4.0 but i can not see the button on the bottom left corner, and if i click the right place were is should be, the box comes up but without information, help?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Zip file structure isn\u0027t quite correct and I also had this issue. When you unzip the ISA-MapSatX4r1 file, you probably did what I did the first time and that was to copy/move the folder ISA_MapSat X4r1 into the GameData directory. This allowed the parts to load for me, but like you the map interface didn\u0027t display correctly. If you instead skip that folder and copy/move the Innswerants Space Agency folder into the GameData directory, then the interface displays correctly, but the dish turns black. So obviously there\u0027s some directory structure by the Dev that needs to be addressed. Hope this helps.\u003C/p\u003E\n"},{"CreatedByName":"johnnyhandsome","CreatedById":59580,"CreatedDateTime":"2013-06-28T13:45:03Z","Content":"\n\u003Cp\u003EHey, all the maps I generated in ISA MapSat 3.3.4 do not appear in the 4.0 developer version. How do I copy them over or some such? I don\u0027t have satellites around some of these bodies anymore, does this mean I have to send new satellites to those bodies?\u003C/p\u003E\n"},{"CreatedByName":"itsme86","CreatedById":59895,"CreatedDateTime":"2013-06-28T14:10:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022johnnyhandsome\u0022 data-cite=\u0022johnnyhandsome\u0022\u003E\u003Cdiv\u003EHey, all the maps I generated in ISA MapSat 3.3.4 do not appear in the 4.0 developer version. How do I copy them over or some such? I don\u0027t have satellites around some of these bodies anymore, does this mean I have to send new satellites to those bodies?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can\u0027t. The new maps are a different, higher resolution format. You\u0027ll have to remap everything or get the maps from someone that has already done the mapping for you in the new version.\u003C/p\u003E\n"},{"CreatedByName":"Castun","CreatedById":4581,"CreatedDateTime":"2013-06-28T15:11:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GavinZac\u0022 data-cite=\u0022GavinZac\u0022\u003E\u003Cdiv\u003EOn disk, the files are stored as PNG which involves interpolation and compression. In memory, the images are handled pixel by pixel, essentially making them \u0027bitmap\u0027 in memory. Bitmaps are substantially fatter than other image types.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd yet the large memory footprint persists even before any bodies are mapped?\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-06-28T15:56:15Z","Content":"\n\u003Cp\u003EA small suggestion: could a compatibility patch for the Figaro GPS be created? One that wouldn\u0027t tell you your location on the map if you didn\u0027t have a functioning GPS network yet. At the moment I just voluntarily avoid using it, but it\u0027d be neater if the two mods didn\u0027t interfere in function. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: On a different note, is there a strategy for mapping at 10x time warp without getting black dots all over the map? Even at an ideal orbit, mapping a planet like Kerbin can take many real-time hours.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-29T11:56:41Z\u0022 title=\u002206/29/2013 11:56  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 29, 2013\u003C/time\u003E by Kimberly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"davel23","CreatedById":72660,"CreatedDateTime":"2013-06-28T16:45:52Z","Content":"\n\u003Cp\u003EI\u0027m also having a problem with this plugin, I can mount the parts on my satellite and get it into orbit, but there\u0027s no button on the left side to open the interface. I\u0027ve looked for a solution but can\u0027t seem to find anything. Any suggestions?\u003C/p\u003E\n"},{"CreatedByName":"Tiff The Great","CreatedById":72771,"CreatedDateTime":"2013-06-29T18:25:26Z","Content":"\n\u003Cp\u003EHi, I\u0027ve installed the latest dev version, but nothing seems to have loaded into the game. I unzipped the zip folder and put the contents in a folder named ISA_mapsat, then put that folder under game data, like every other mod, but it doesn\u0027t load anything into the game. Is anyone else having this problem?\u003C/p\u003E\n"},{"CreatedByName":"Rocketman1994","CreatedById":66335,"CreatedDateTime":"2013-06-29T20:27:39Z","Content":"\n\u003Cp\u003EI have the problem of Mapsat as a menu, its kinda of frustrating...\u003C/p\u003E\n"},{"CreatedByName":"cardajowol","CreatedById":71101,"CreatedDateTime":"2013-06-29T22:33:46Z","Content":"\n\u003Cp\u003Edunno, annoying me too I can\u0027t send the probes I want out and its already caused me to remove stations I can\u0027t get to now because I had the Map Satellite on them etc. \u003C/p\u003E\u003Cp\u003ELooks like Innsewerants hasn\u0027t been around recently... =/\u003C/p\u003E\n"},{"CreatedByName":"GavinZac","CreatedById":68719,"CreatedDateTime":"2013-06-30T00:35:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Castun\u0022 data-cite=\u0022Castun\u0022\u003E\u003Cdiv\u003EAnd yet the large memory footprint persists even before any bodies are mapped?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBlack pixels require no less memory than green, red or blue pixels.\u003C/p\u003E\n"},{"CreatedByName":"cardajowol","CreatedById":71101,"CreatedDateTime":"2013-06-30T13:19:36Z","Content":"\n\u003Cp\u003EThis really needs to be fixed... can\u0027t even use the mod atm it just freezes the game... ={\u003C/p\u003E\n"},{"CreatedByName":"scottholio","CreatedById":67477,"CreatedDateTime":"2013-06-30T13:30:49Z","Content":"\n\u003Cp\u003EYeah, I gave up on using it too. I was seeing up to 1GB increase in RAM usage when going to the launchpad with an ISA dish on my rocket. So I basically can only run it in a Vanilla install.\u003C/p\u003E\n"},{"CreatedByName":"MmPMSFmM","CreatedById":56831,"CreatedDateTime":"2013-06-30T14:27:08Z","Content":"\n\u003Cp\u003EThe ISA stuff is appearing as an item under aerodynamics...\u003C/p\u003E\u003Cp\u003EBut they have no functions whatsoever.\u003C/p\u003E\n"},{"CreatedByName":"KevinTMC","CreatedById":28909,"CreatedDateTime":"2013-06-30T15:00:21Z","Content":"\n\u003Cp\u003EIt\u0027s working okay for me...just seems to need some optimization. There is lag (the game will repeatedly freeze for an instant or two on a fairly regular cycle, such as once every minute of mission time), and I\u0027m regularly running right at maximum memory use--I don\u0027t dare run ISA with more than a handful of other plugins.\u003C/p\u003E\u003Cp\u003EUsing just the GPS unit doesn\u0027t help with these issues; it lags and eats memory the same as the full module.\u003C/p\u003E\n"},{"CreatedByName":"ninjakids","CreatedById":70896,"CreatedDateTime":"2013-06-30T15:03:11Z","Content":"\n\u003Cp\u003EThis mod makes no sense! HOW DO YOU EVEN USE IT?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-30T15:24:22Z\u0022 title=\u002206/30/2013 03:24  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 30, 2013\u003C/time\u003E by ninjakids\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-06-30T15:39:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ninjakids\u0022 data-cite=\u0022ninjakids\u0022\u003E\u003Cdiv\u003EThis mod makes no sense! HOW DO YOU EVEN USE IT?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlace the special Mapsat satellite dish on your craft. Launch into orbit. In the lower-left corner, next to the vanilla GUI, you should see a button with the symbol of a pair of compasses. Click on it. A new window should pop up, with a black field on the left and a set of buttons on the right. Click the button labeled \u0022SCN\u0022. If your batteries aren\u0027t drained, then you should now start scanning the planet. Wait a few seconds, and you should see colored lines appear on the black field. You will progressively build up a map of the planet. Depending on your distance from the planet and the time warp you\u0027re using, you may have gaps between the lines or holes in the coverage, which means you\u0027ll need to scan the same area multiple times for a full map.\u003C/p\u003E\u003Cp\u003EAn equatorial orbit will only allow you to scan the equator. To scan the whole planet, you need a high orbit, preferably one that is close to polar. (An inclination of more than 80 degrees.) Because the planet rotates while you orbit, you\u0027ll pass over a different area with each orbit, allowing you to slowly scan (almost) the whole planet. If your orbit isn\u0027t perfectly polar, with an inclination of 90 degrees, you may not be able to scan the north and south poles. A perfectly polar orbit will typically make for slower scans than a near-polar one, though, so you may wish to launch one satellite into near-polar orbit and another one to do the poles. Scanning stops if you switch to another ship! For this reason, you may want to leave scans running overnight if your orbit makes for slow scanning.\u003C/p\u003E\u003Cp\u003EGo and try that out, and play with the other buttons a bit, if you like. Still with me? Then check out the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27999-ISA-Mapsat-Ideal-and-Non-Ideal-Altitudes\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E for someone\u0027s fancy calculations of good and bad orbits for map scanning. The concept is explained on the first page, and the orbits you should use in the latest version of Mapsat are on the second page. Hope I helped. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn a side note, many of the same principles apply to scanning for kethane in the Kethane Pack mod.\u003C/p\u003E\n"},{"CreatedByName":"ninjakids","CreatedById":70896,"CreatedDateTime":"2013-06-30T18:38:26Z","Content":"\n\u003Cp\u003EAh, there is no compass!\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-06-30T19:42:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ninjakids\u0022 data-cite=\u0022ninjakids\u0022\u003E\u003Cdiv\u003EAh, there is no compass!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like an installation issue, then.\u003C/p\u003E\n"}]}