{"TopicId":93859,"ForumId":55,"TopicTitle":"Building Upgrading Request","CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2014-12-20T15:50:23Z","PageNum":1,"Articles":[{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2014-12-20T15:50:23Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI find the research building too expensive for my tree. I am having to move some parts up to do missions to get more funds; $500,000 is way too much and I have a soultion.\u003C/p\u003E\u003Cp\u003EIn my tree my Science rates are \u0027non-linear\u0027 to gain nodes - 25-50-100-200 is linear...mine goes 25-50-100-250-500-1000 - I guess it is mostly linear and I need to go back and look.\u003C/p\u003E\u003Cp\u003EThe Science gains are fine and worked well in v25 I have plenty of Science but I have to move parts to get more missions to make more money.\u003C/p\u003E\u003Cp\u003EI suppose I could use the stock tree to test mission structure as I see some early missions give a big advance like 1mil; so that also may be messed up but I am solving that by cutting funding in half.\u003C/p\u003E\u003Cp\u003EA solution is to have \u00275\u0027 upgrades instead of \u00273\u0027 and cut the amounts for each appropriately as well as the node availabilities.\u003C/p\u003E\u003Cp\u003EMaybe like (in 1000\u0027s) 100, 250, 500, 1mil, 5mil where 250k gets you into General Construction; I dont use mission extender either.\u003C/p\u003E\u003Cp\u003EThen mission payouts should barely get you to each tier.\u003C/p\u003E\u003Cp\u003EProbly using the stock tree is easy and yes you can cut science gathering but it wouldnt be linear.\u003C/p\u003E\u003Cp\u003EThe Career Tree should be a somewhat non-linear progression in my opinion not like 25-50-100-200-400-800...I will figure my tree out eventually but it would be nice to have a little more variability in building upgrades - 5 instead of 3 maybe.\u003C/p\u003E\u003Cp\u003EZeta\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-20T15:54:03Z","Content":"\n\u003Cp\u003EMy first upgrade cost me 1,020,000 funds.... so I guess that must vary with difficulty setting. I agree it\u0027s a little too expensive, but it did force me to use some pretty interesting designs while I was saving up for it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-21T04:56:45Z\u0022 title=\u002212/21/2014 04:56  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 21, 2014\u003C/time\u003E by armagheddonsgw\u003C/strong\u003E\n\u003Cbr\u003EEdited to reflect the thread being moved to suggestions.\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-12-20T18:13:46Z","Content":"\n\u003Cp\u003EI don\u0027t understand the question. By the time I\u0027d completed my first mission, 43 minutes into the game, I\u0027d upgraded mission control, the tracking centre, launchpad and astronaut complex.\u003C/p\u003E\u003Cp\u003EIf you\u0027re using hard settings or mods and finding it too hard then, er, stop making it so hard for yourself ^^.\u003C/p\u003E\u003Cp\u003EApart from that, we already know there will be another, \u0022level 0\u0022, of buildings - that\u0027s the starter one that looked like a US trailer-park and farm buildings but was not re-modelled in time for 0.90. Expect it in the next update.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2014-12-20T20:23:40Z","Content":"\n\u003Cp\u003EI set my income gains down to just 30% and found it was still easily enough to build massive rockets, but far too little to upgrade the buildings. My guess is that the high cost of upgrades is supposed to help offset the high amounts of money you rake in during a game with normal settings.\u003C/p\u003E\u003Cp\u003EI think the upgrade cost of buildings should be altered based on your payout rate. It still makes the rockets more expensive. Or perhaps there should be a slider in the custom options to adjust upgrade costs.\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2014-12-21T00:16:55Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EMy tree is such that it worked fine in V24 and V25 and such that it takes ALOT of Science to gain nodes and planning is important.\u003C/p\u003E\u003Cp\u003EThe missions seem to suggest a way to plan how to use the Science making my tree impossible to win if you just go willy nilly on nodes.\u003C/p\u003E\u003Cp\u003EThe problem is that the Science upgrade is way too expensive - 500,000 - for \u0027MY\u0027 Science Tree !\u003C/p\u003E\u003Cp\u003EMy tree stops on the set of 3 nodes going down vertically as opposed to the Stock Tree where it stops 2 or so tiers up further allowing more things to be tested.\u003C/p\u003E\u003Cp\u003EI will look for the level 0 haha I read about that somewhere; that will be a game restart most likely.\u003C/p\u003E\u003Cp\u003EZeta\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-21T00:19:50Z","Content":"\n\u003Cp\u003EThe \u0022level 0\u0022 buildings won\u0027t be in until 0.91 most likely. Which means we\u0027ll probably be waiting a while \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-12-21T00:57:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cdr_Zeta\u0022 data-cite=\u0022Cdr_Zeta\u0022\u003E\u003Cdiv\u003EMy tree is such ... making my tree impossible ... 500,000 - for \u0027MY\u0027 Science Tree ... My tree ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd my point is that if you\u0027ve made things too hard for yourself with settings or mods the solution is for you to stop making it so hard for yourself, not for Squad to change the game for everyone else.\u003C/p\u003E\n"},{"CreatedByName":"KITTYONFYRE","CreatedById":95561,"CreatedDateTime":"2014-12-21T01:26:38Z","Content":"\n\u003Cp\u003EThat\u0027s not what linear means... Linear would be increasing y by the same number every time x goes up a set interval. You\u0027re not using it correctly.\u003C/p\u003E\u003Cp\u003ENot even sure what exactly you mean by \u0022linear\u0022 (what you must too the word for)\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-21T01:31:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KITTYONFYRE\u0022 data-cite=\u0022KITTYONFYRE\u0022\u003E\u003Cdiv\u003EThat\u0027s not what linear means... Linear would be increasing y by the same number every time x goes up a set interval. You\u0027re not using it correctly.\u003Cp\u003ENot even sure what exactly you mean by \u0022linear\u0022 (what you must too the word for)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAssuming I understand what you\u0027re asking, the correct word here is \u0022exponential\u0022 (it goes up by roughly a factor of 2 every time, though not exactly).\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-12-21T03:58:20Z","Content":"\n\u003Cp\u003EMoved to suggestions.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2014-12-21T05:40:27Z","Content":"\n\u003Cp\u003ELevel 0 should be some shacks. No, seriously. \u003C/p\u003E\u003Cp\u003EVAB/SPH: 5 parts\u003C/p\u003E\u003Cp\u003ELaunchpad/Runway: 12 tons\u003C/p\u003E\u003Cp\u003EMission Control: 1 contract\u003C/p\u003E\u003Cp\u003ETracking station: no orbit view at all\u003C/p\u003E\u003Cp\u003ER\u0026amp;D: 50 science max\u003C/p\u003E\u003Cp\u003EAdmin: None\u003C/p\u003E\u003Cp\u003EEDIT: Update name: 0.91.0 Welcome to Shackville!\u003C/p\u003E\n"},{"CreatedByName":"harlikwin","CreatedById":103213,"CreatedDateTime":"2014-12-22T17:51:49Z","Content":"\n\u003Cp\u003EI agree that there needs to be a bit more granularity in the buildings, particularly the science building and the VAB\u0027s. I think 5-6 levels aught to be about right and priced a bit better. \u003C/p\u003E\u003Cp\u003EI\u0027m playing in normal mode and at this point have gotten to the level 3 buildings, and the recurring theme with the science building is that I max out the tech tree right up to the point of needing to upgrade and then once I do I have hundreds or thousands of points of science saved depending on the level of the sci building so I can clear out the tech tree again almost immediately. \u003C/p\u003E\u003Cp\u003EI also find the first VAB and launch pad upgrades the most important as the 30 part 18t limits are very limiting. But beyond that I mainly updated to the L3 VAB/pad just because I had the funds. I suppose late game it makes more sense, but I never found myself to be cash strapped to buy those buildings to the L3 tier, just the science center.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-22T17:57:01Z","Content":"\n\u003Cp\u003EBill Phil: I think the current restrictions are about right for tier 0; tier 1 should be somewhere between that and tier 2... maybe for the launchpad move the current tier 2 up a little to say 200 tonnes; enough for quite a large rocket, but not enough for carrying seriously large payloads to orbit (e.g. some of the harder Mun bases required by contracts). Similarly for the other buildings.\u003C/p\u003E\n"}]}