{"TopicId":93905,"ForumId":44,"TopicTitle":"Nasa is considering a Manned Mission to Venus before Mars!","CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-12-20T21:38:24Z","PageNum":3,"Articles":[{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-12-22T16:34:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022King Arthur\u0022 data-cite=\u0022King Arthur\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI ultimately don\u0027t care where in particular we are going, be it the Moon, Mars, Venus, an asteroid, or god damn Alpha Centauri. I care about the fact that we \u003Cem\u003Eneed\u003C/em\u003E a long-term plan that \u003Cem\u003Ewe stick to\u003C/em\u003E for what we will be doing. The Space Race had a clear long-term plan for landing men on the Moon before the Soviets and we worked to accomplish that mandate, but today we have NASA and the US government who have a \u003Cstrong\u003Every\u003C/strong\u003E bad case of ADD not being able to decide on anything long-term and flinging out ideas left and right. \u0022We\u0027re going back to the Moo-- no we\u0027re going to Mar-- actually how about an asteroid in Lunar orbi-- seriously this idea about Venus is... wait, what were we sayin--OOOOOOOH SHINY\u0022.\u003C/p\u003E\u003Cp\u003EAnd now you expect me to take them seriously? Wake me up when we\u0027re actually serious about doing whatever it is we will be doing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou cannÃ‚Â´t blame NASA, this vision to sent humans at the Venus clouds is very recent for NASA, they never thoght about this possibility before. Of course soviets did since 1970, because they were the Venus masters. \u003C/p\u003E\u003Cp\u003EBut in the west, the first scientist who realized about this possibility was Geoffrey Landis few years back.\u003C/p\u003E\u003Cp\u003EIs a big change of perspective, but there is not much difference; we can go to a planet to float in some liquid, to be on ground, or to float in their atmosphere.\u003C/p\u003E\u003Cp\u003EI would love to also explore Jupiter with a hot \u0022air\u0022 ballon powered by a nuclear heater. \u003C/p\u003E\u003Cp\u003EWith this you can choose any altitude you want, it does not matter what gas you have inside your envelope, if you heated, it will be lighter than the surrounding.\u003C/p\u003E\u003Cp\u003ENasa knows that they need to plan a new manned mission to some place (not the moon) to capture again the attention of the world.\u003C/p\u003E\u003Cp\u003EBut mars is still too risky without ways to abort.\u003C/p\u003E\u003Cp\u003EThis mission is a lot shorted, 400 days VS a 600 to 900 days mars mission.\u003C/p\u003E\u003Cp\u003EAlso until you dont receive the money, you can present any different mission, only after you start to work hard in achieve that.\u003C/p\u003E\u003Cp\u003ESo there is no time lost here.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure we would die on Venus.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, that is kinda negative.. but more reason to watch it in TV!!\u003C/p\u003E\u003Cp\u003ETo be 100% honest. There is 3 robers in mars, and nobody gives a ****, I am not the exception.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aghanim\u0022 data-cite=\u0022Aghanim\u0022\u003E\u003Cdiv\u003ESome answers from NASA in the comment section:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, but I expect some extra info, this project it does not seems to have an official web page.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT: Albert, I will answer your post later.\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2014-12-22T16:45:44Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/missions/index.html#.VJhKI6AEAA\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/missions/index.html#.VJhKI6AEAA\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETell me if you see \u0022HAVOC\u0022 in the H category.\u003C/p\u003E\u003Cp\u003EI don\u0027t \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf NASA officially stated they were going to do something as extreme as this BEFORE Mars, there would at least be a TRACE of it on their site.\u003C/p\u003E\n"},{"CreatedByName":"billbobjebkirk","CreatedById":104713,"CreatedDateTime":"2014-12-22T17:16:00Z","Content":"\n\u003Cp\u003ERemember guys, the last two letters in the name stand for Operations Concept. they\u0027re just going over the idea to see if it can be done.\u003C/p\u003E\n"},{"CreatedByName":"MoeKitsune","CreatedById":127670,"CreatedDateTime":"2014-12-22T17:29:25Z","Content":"\n\u003Cp\u003EThank you! Thank you so much!\u003C/p\u003E\n"},{"CreatedByName":"TeMPOraL","CreatedById":131679,"CreatedDateTime":"2014-12-22T17:36:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022King Arthur\u0022 data-cite=\u0022King Arthur\u0022\u003E\u003Cdiv\u003EIf I see a headless chicken I\u0027m going to call it a headless chicken, not sugarcoat it and say that\u0027s a rooster of prime genetic heritage, and a headless chicken is precisely what NASA is right now with the lack of any solid long-term roadmap.\u003Cp\u003EI ultimately don\u0027t care where in particular we are going, be it the Moon, Mars, Venus, an asteroid, or god damn Alpha Centauri. I care about the fact that we \u003Cem\u003Eneed\u003C/em\u003E a long-term plan that \u003Cem\u003Ewe stick to\u003C/em\u003E for what we will be doing. The Space Race had a clear long-term plan for landing men on the Moon before the Soviets and we worked to accomplish that mandate, but today we have NASA and the US government who have a \u003Cstrong\u003Every\u003C/strong\u003E bad case of ADD not being able to decide on anything long-term and flinging out ideas left and right. \u0022We\u0027re going back to the Moo-- no we\u0027re going to Mar-- actually how about an asteroid in Lunar orbi-- seriously this idea about Venus is... wait, what were we sayin--OOOOOOOH SHINY\u0022.\u003C/p\u003E\u003Cp\u003EAnd now you expect me to take them seriously? Wake me up when we\u0027re actually serious about doing whatever it is we will be doing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, part of the reason there was a plan during Space Race was that there was a clear and somewhat stable political goal there - beating Soviets to anything was something everyone in the office could agree on. Now NASA has to work in a political hurricane, where things change every few years. I recall some NASA guys saying between the lines (in some article I can\u0027t find now, so forgive lack of citation) that they basically design everything around still having something useful surviving when some politician decides that this particular thing is not going to space today.\u003C/p\u003E\u003Cp\u003EThe cause for not being able to stick to anything long-term is external (and, ultimately, somewhat the responsibility of the public - it\u0027s one of the reasons NASA is investing so much in PR \u0026amp; media coverage lately; apart from inspiring a new generation of scientists and engineers, a potential mission that captures hearts and minds of many people will make it more difficult for some politician to cancel it because he can get more jobs in his district this way). With changing winds and unsure budget, it\u0027s really hard to have anything else than a very rough sketch for the future with \u003Cem\u003Elots\u003C/em\u003E of space to pivot.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-22T17:58:14Z","Content":"\n\u003Cp\u003ESo, put NASA aside for a bit. How about other space agencies in the world? ESA, JAXA, \u0022the Indian space agency that I forgot the name\u0022,etc, anyone know if they have anything fancy planned? NASA seems to get caught up with political games now. Maybe the others have less problems with this?\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-12-22T18:37:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EYes, I whole heartedly agree with Neil Degrasse Tyson(and anyone else) that we should should have manned space flight beyond LEO. \u003Cp\u003EIt\u0027s a disgrace to humanity that we put so little effort into it.\u003C/p\u003E\u003Cp\u003EBut that doesn\u0027t mean your road map needs to be as follow:\u003C/p\u003E\u003Cp\u003EFirst Humans in LEO, First Humans on the Moon, 42 years stuck in LEO and then Venus Airships.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy not? what is your next step then... Humans in GEO? \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWill Airships with a small habitable space and a Venusian Sunrise inspire people?\u003Cp\u003EOr will Human foot prints on Martian soil do that?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my case, if they go outside the airship at 52km height with just an oxygen mask, they will make my day and all my future days.\u003C/p\u003E\u003Cp\u003EMaybe that is too much to ask for the first month mission, but it will happen for sure for the next 1 year mission.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThey wont stick their heads out of the craft or sit on a patio, because there is no plan to do stuff like that(You know; droplets of sulfuric acid).\u003Cp\u003EOpposed to Mars were the astronauts can actually set their foots on the ground, explore and do experiments and actually take rock samples.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Emicro droplets you may said.. \u003C/p\u003E\u003Cp\u003EImagine the amount of water in our atmosphere, 40% of humidity (you get wet with that?), in the Venus case there is a 1% of water-sulfure acid humidity.\u003C/p\u003E\u003Cp\u003EYou can be naked outside by 1 min or more, and you will not feel absoluty nothing. Extra time and you might start to feel some ardor in the skin.\u003C/p\u003E\u003Cp\u003EAlso, nothing that any latex suit (with mask) can not counter.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWe are not clueless on what causes climate change, you should know that if your are pro-Venus-mission.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dont know other way to explain it.. Read the pdf.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EClouds? Really? We don\u0027t understand much about clouds? Hurricanes I can understand, it\u0027s hard to predict hurricanes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou think that I made it up? Not ask me, ask to the meteorologists.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI do agree that our understanding of climate is not complete and that it\u0027s a complex system. But we don\u0027t need manned airships on Venus to improve our knowledge.\u003C/div\u003E\u003C/blockquote\u003EOf course than several different missions to venus will collect more science that a single manned mission.\u003Cp\u003EBut we need a manned mission too, and right now a manned mars mission is too expensive and risky.\u003C/p\u003E\u003Cp\u003EMaybe this mission can encourage people interest to take the next step in mars.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOr we could find out if it has DNA or something else, how it works, come closer to knowing why life exists, etc. etc.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EFor a life search quest, I would preffer an unmanned mission to europa under ice lakes. More chance to find complex life there.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI don\u0027t get why you think that a manned Airship safe us from climate change. The only thing which will safe us is to stop putting gases in the atmosphere that cause the greenhouse effect.\u003Cp\u003EWe will be long gone before the Earth is anywhere close of resembling Venus.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause we dont know for certain what we put in motion burning already the 50% of fossil fuels who was storage over 1000 millions of years.\u003C/p\u003E\u003Cp\u003EWe know that some mass extintions happen before when similar amount of co2 was burn due massive volcan activity who burn huge carbon reservoirs plus forests.\u003C/p\u003E\u003Cp\u003ENow we have a chain reaction effect which extra co2 melt ice, then earth reflects less radiation, then methane reservoirs escape to atmosphere, temperature rise, more water vapor reach the atmosphere which rise even more the temperature.\u003C/p\u003E\u003Cp\u003EAnd right now we can not predict the right values of all these process. Because our climate understanding is basic.\u003C/p\u003E\u003Cp\u003EAlso understanding the climate, we can focus our resources in the best way to prevent this, maybe there is a better way than just cut our co2 emissions.\u003C/p\u003E\u003Cp\u003EThe biggest problem of humanity is global warming. (well in fact is the same huminity it self, the increase in poppulation) \u003C/p\u003E\u003Cp\u003E- Time delays and bandwidth are a non issue for observational experiments. \u003Cspan style=\u0022color:#FF0000;\u0022\u003Eyes they are.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E- We don\u0027t have meteorologist in Space to predict our weather, because sending the data down from satellites works just fine. \u003Cspan style=\u0022color:#FF0000;\u0022\u003Ewhy they will be in space? if the atmosphere is right here? lol\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E- CCD\u0027s on cameras(depending on their application) can see the whole electromagnetic spectrum, the human eye can only see visible light. So you would want to send those. \u003Cspan style=\u0022color:#FF0000;\u0022\u003Eyou have limit bandwidth, here you can go back with many terabytes of data.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E- Curiosity landed just fine with out the help direct human input and it\u0027s the most complex craft that landed on an other planet, deploying a few probes should be trivial in comparison. \u003Cspan style=\u0022color:#FF0000;\u0022\u003EI already said it, I am agree that is always cheap to sent a probe than a human.. But we need a manned mission too! Now.. in ten years, not in 30 years.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022michaelsteele3\u0022 data-cite=\u0022michaelsteele3\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://www.nasa.gov/missions/index.html#.VJhKI6AEAA\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/missions/index.html#.VJhKI6AEAA\u003C/a\u003E\u003Cp\u003EIf NASA officially stated they were going to do something as extreme as this BEFORE Mars, there would at least be a TRACE of it on their site.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf Nasa officially stated they were going to mars, then you will find a trace of that manned mission on their site \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022billbobjebkirk\u0022 data-cite=\u0022billbobjebkirk\u0022\u003E\u003Cdiv\u003ERemember guys, the last two letters in the name stand for Operations Concept. they\u0027re just going over the idea to see if it can be done.\u003C/div\u003E\u003C/blockquote\u003Eyeah of course. The topic tittle it said: \u0022they are considering\u0022\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-12-22T18:41:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003ESo, put NASA aside for a bit. How about other space agencies in the world? ESA, JAXA, \u0022the Indian space agency that I forgot the name\u0022,etc, anyone know if they have anything fancy planned? NASA seems to get caught up with political games now. Maybe the others have less problems with this?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethey should joint forces.. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TeMPOraL\u0022 data-cite=\u0022TeMPOraL\u0022\u003E\u003Cdiv\u003Esnip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyeah that.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-12-22T19:38:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EWhy not? what is your next step then... Humans in GEO?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMars, the Moon. How about some bases on those worlds.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIn my case, if they go outside the airship at 52km height with just an oxygen mask, they will make my day and all my future days.\u003Cp\u003EMaybe that is too much to ask for the first month mission, but it will happen for sure for the next 1 year mission.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey won\u0027t go outside, with the sulfuric acid and stuff.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Emicro droplets you may said.. \u003Cp\u003EImagine the amount of water in our atmosphere, 40% of humidity (you get wet with that?), in the Venus case there is a 1% of water-sulfure acid humidity.\u003C/p\u003E\u003Cp\u003EYou can be naked outside by 1 min or more, and you will not feel absoluty nothing. Extra time and you might start to feel some ardor in the skin.\u003C/p\u003E\u003Cp\u003EAlso, nothing that any latex suit (with mask) can not counter.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo we\u0027ve got a mission which costs an enormous amount of money, putting humans in a precarious situation, just to go outside for one minute?\u003C/p\u003E\u003Cp\u003EBecause you still haven\u0027t convinced me that you\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI dont know other way to explain it.. Read the pdf.\u003Cp\u003EYou think that I made it up? Not ask me, ask to the meteorologists.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo show me those meteorlogist who say we don\u0027t know much about clouds.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOf course than several different missions to venus will collect more science that a single manned mission.\u003Cp\u003EBut we need a manned mission too, and right now a manned mars mission is too expensive and risky.\u003C/p\u003E\u003Cp\u003EMaybe this mission can encourage people interest to take the next step in mars.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo what are the figures of this Venus mission? For example, the cost of Mars Directs is estimated at $30 to $50 billion.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EFor a life search quest, I would preffer an unmanned mission to europa under ice lakes. More chance to find complex life there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe ice crust on Europa is 20 Km thick, you don\u0027t just drill through that and look around. That mission is in a whole other ball park than a mission to Mars.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBecause we dont know for certain what we put in motion burning already the 50% of fossil fuels who was storage over 1000 millions of years.\u003C/p\u003E\u003Cp\u003EWe know that some mass extintions happen before when similar amount of co2 was burn due massive volcan activity who burn huge carbon reservoirs plus forests.\u003C/p\u003E\u003Cp\u003ENow we have a chain reaction effect which extra co2 melt ice, then earth reflects less radiation, then methane reservoirs escape to atmosphere, temperature rise, more water vapor reach the atmosphere which rise even more the temperature.\u003C/p\u003E\u003Cp\u003EAnd right now we can not predict the right values of all these process. Because our climate understanding is basic.\u003C/p\u003E\u003Cp\u003EAlso understanding the climate, we can focus our resources in the best way to prevent this, maybe there is a better way than just cut our co2 emissions.\u003C/p\u003E\u003Cp\u003EThe biggest problem of humanity is global warming. (well in fact is the same huminity it self, the increase in poppulation) \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes climate change is a huge problem, yes we don\u0027t understand it completely and yes I\u0027m all for doing science we ever we can.\u003C/p\u003E\u003Cp\u003EAnd I\u0027m sounding like a broken record again; the astronauts wouldn\u0027t have anything to do in such an airship.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E- Time delays and bandwidth are a non issue for observational experiments. \u003Cspan style=\u0022color:#FF0000;\u0022\u003Eyes they are.\u003C/span\u003E\u003Cp\u003E- We don\u0027t have meteorologist in Space to predict our weather, because sending the data down from satellites works just fine. \u003Cspan style=\u0022color:#FF0000;\u0022\u003Ewhy they will be in space? if the atmosphere is right here? lol\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E- CCD\u0027s on cameras(depending on their application) can see the whole electromagnetic spectrum, the human eye can only see visible light. So you would want to send those. \u003Cspan style=\u0022color:#FF0000;\u0022\u003Eyou have limit bandwidth, here you can go back with many terabytes of data.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E- Curiosity landed just fine with out the help direct human input and it\u0027s the most complex craft that landed on an other planet, deploying a few probes should be trivial in comparison. \u003Cspan style=\u0022color:#FF0000;\u0022\u003EI already said it, I am agree that is always cheap to sent a probe than a human.. But we need a manned mission too! Now.. in ten years, not in 30 years.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E- Come on, \u0022yes they are\u0022 isn\u0027t a valid reason.\u003C/p\u003E\u003Cp\u003E- What are you going to do with \u0022many terrabytes\u0022 of space? Cassini has sent close to 500 GB of data in it\u0027s whole 10 year mission. You think you the HAVOC mission is going to produce more than that in 30 days? \u003C/p\u003E\u003Cp\u003E That\u0027s more than 16 GB a day just to reach Casinni\u0027s amount. I highly doubt you\u0027ll even need more than 16 GB fore the whole 30 days.\u003C/p\u003E\u003Cp\u003E- But of all places, why Venus?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf Nasa officially stated they were going to mars, then you will find a trace of that manned mission on their site \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s true that NASA has no set in stone goal to go to Mars(like any other space agency in the world), but of all the world that are mention in where are we going to go next the Moon and Mars are always mentioned.\u003C/p\u003E\u003Cp\u003EI never heard them say \u0022To the Moon, Venus and beyond\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2014-12-22T21:12:10Z","Content":"\n\u003Cp\u003EThe primary reason for a piloted mission anywhere should not be to do planetary science, though they will be doing planetary science (because a piloted mission is hardly mass-sensitive to science equipment). In our situation, a neanderthal non-infrastructural space program, the \u003Cem\u003Eprimary \u003C/em\u003Ereason should be to prove technologies and operational doctrines that will one day enable permanent habitation. We spent many years flying people up in tiny Vostok, Voskhod, Mercury, and Gemini capsules figuring out how best to keep people alive on low Earth orbit, and testing actual mechanisms that would one day enable us to permanently inhabit low Earth orbit with Mir, and Space Station.\u003C/p\u003E\u003Cp\u003EIf we want to live anywhere else, we need the Venusian, Lunar, or Martian Vostok equivalent, and then the Salyut equivalent, and finally a permanently piloted Space Station equivalent. Powerpoints don\u0027t prove hardware will work - \u003Cem\u003Eonly\u003C/em\u003E flying that hardware will. Venus looks very favorable on paper, but we may figure out its harder than we thought to keep aerostats on stable wind currents, or maybe the atmospheric processor experiment didn\u0027t produce as much O2 as we thought it would, so next time we bring an improved version of the experiment, and then on Cloud City they use a really big atmospheric processor to make their O2, based on the same hardware. \u003C/p\u003E\u003Cp\u003EI\u0027m pretty sure we could\u0027t have figured out all the technologies to keep Space Station going by just sending probes. Before 1961 we didn\u0027t even know if astronauts in micro-gee environments could even work effectively.\u003C/p\u003E\n"},{"CreatedByName":"BFGfreak","CreatedById":57395,"CreatedDateTime":"2014-12-22T21:15:53Z","Content":"\n\u003Cp\u003EJust out of curiosity, is there any reason for us to have men in the ISS when all the experiments can be controlled remotely from the ground? I would imagine that it would be the same principle, largly PR in an environment where death is only a few centimeters away.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-12-23T00:28:31Z","Content":"\n\u003Cp\u003ESounds a lot like this thread:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/103713-Venusian-Airships%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/103713-Venusian-Airships%21\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-12-23T01:42:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BFGfreak\u0022 data-cite=\u0022BFGfreak\u0022\u003E\u003Cdiv\u003EJust out of curiosity, is there any reason for us to have men in the ISS when all the experiments can be controlled remotely from the ground? I would imagine that it would be the same principle, largly PR in an environment where death is only a few centimeters away.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point. Why do we have people on the ISS? There is a disproportionate amount of money spent on the ISS. Just a fraction of it would fund missions like \u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Europa_Jupiter_System_Mission\u0022 rel=\u0022external nofollow\u0022\u003EEJSM -Laplace\u003C/a\u003E, \u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Titan_Saturn_System_Mission\u0022 rel=\u0022external nofollow\u0022\u003ETSSM\u003C/a\u003E, etc. I can\u0027t help but think we\u0027d learn more from robotic missions like those than we do from flying people on the ISS.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-12-23T02:47:01Z","Content":"\n\u003Cp\u003EThe point of human spaceflight isn\u0027t purely science. Maybe not even mostly science. I think exploration has value as a \u003Cem\u003Ehuman\u003C/em\u003E activity beyond pure science.\u003C/p\u003E\u003Cp\u003EAnd I\u0027d argue that if there weren\u0027t humans in space, there would be much less human interest in space and thus less money for space science too. If there was no ISS, there\u0027s no realistic way politicians would spend all that money on science missions instead.\u003C/p\u003E\u003Cp\u003EI think one of the reason Mars gets more missions (disproportionately, according to some people) while Venus has relatively few is that we think of Mars, but not Venus, as a likely next destination for human exploration. If there was zero chance of humans ever going to Mars, there\u0027d probably be less interest (and thus eventually less money) for Mars science.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2014-12-23T02:52:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENasa knows that they need to plan a new manned mission to some place (not the moon) to capture again the attention of the world.\u003C/p\u003E\u003Cp\u003EBut mars is still too risky without ways to abort.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I would say \u0022NASA is too risk averse\u0022 rather than that going to Mars is too risky. I don\u0027t think it would be \u003Cem\u003Eunreasonably\u003C/em\u003E risky for exploring someplace totally new.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BFGfreak\u0022 data-cite=\u0022BFGfreak\u0022\u003E\u003Cdiv\u003EJust out of curiosity, is there any reason for us to have men in the ISS when all the experiments can be controlled remotely from the ground? I would imagine that it would be the same principle, largly PR in an environment where death is only a few centimeters away.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, yes. \u003C/p\u003E\u003Cp\u003EIIRC one of the main points of ISS is learning about long-term human spaceflight (theoretically as a preparation for Mars or whatever, though we don\u0027t really seem to be moving in that direction).\u003C/p\u003E\u003Cp\u003EThe other (probably \u003Cem\u003Ethe\u003C/em\u003E main point, at least for the politicians in charge of the funding) is as a demonstration of working together with other nations (especially US/Russia in the post-Cold War era). \u003C/p\u003E\u003Cp\u003EThe actual science experiments are kind of an afterthought AFAIK.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-12-23T04:54:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EMars, the Moon. How about some bases on those worlds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMoon again? after 46 years our biggest next step will be moon??\u003C/p\u003E\u003Cp\u003EAnd mars is out the question for the next decade, there are many issues which are not solvet yet.. too expensive and risky. But a previus mission to venus may help to push a mars mission. People tend to think that if you do one, you will not do the other. But not, is all about getting the people attention.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo we\u0027ve got a mission which costs an enormous amount of money, putting humans in a precarious situation, just to go outside for one minute?\u003Cp\u003EBecause you still haven\u0027t convinced me that you\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E????? who said that? try to focus in the discussion. If you make me a question I answer. But you need to take into account my other answers instead come out with these comments.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo show me those meteorlogist who say we don\u0027t know much about clouds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://ceres.larc.nasa.gov/documents/STM/2010-09/28_Bony_CERES_ScienceTeam_sep2010_final.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ceres.larc.nasa.gov/documents/STM/2010-09/28_Bony_CERES_ScienceTeam_sep2010_final.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EÃ¢â‚¬Å“... the modelling of time dependent clouds is perhaps the weakest aspect of the existing general circulation models and may be the most difficult task in constructing any reliable climate modelÃ¢â‚¬Â \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/General_Circulation_Model\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/General_Circulation_Model\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe effects of clouds are a significant area of uncertainty in climate models\u003C/p\u003E\u003Cp\u003EThe clouds of Venus are still a mystery, its effects are completely different from our predictions, solving that will inprove significantly our current models.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo what are the figures of this Venus mission? For example, the cost of Mars Directs is estimated at $30 to $50 billion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe dont know yet, but Mars direct (I am a zubrin fan) showed to be too risky, it fails to provide the minimum safety requirements, but I guess you already knew this.\u003C/p\u003E\u003Cp\u003EBut is not only that mission:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.wired.co.uk/news/archive/2013-05/31/getting-to-mars\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.wired.co.uk/news/archive/2013-05/31/getting-to-mars\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://rt.com/news/199240-space-...-mars-colonization/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://rt.com/news/199240-space-...-mars-colonization/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.extremetech.com/extreme/191862-the-first-mars-one-colonists-will-suffocate-starve-and-be-incinerated-according-to-mit\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.extremetech.com/extreme/191862-the-first-mars-one-colonists-will-suffocate-starve-and-be-incinerated-according-to-mit\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe ice crust on Europa is 20 Km thick, you don\u0027t just drill through that and look around. That mission is in a whole other ball park than a mission to Mars.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy you need to drill? You use the same Radioisotope Thermoelectric Generator to melt the ice all the way down.\u003C/p\u003E\u003Cp\u003EIt just need to be powerfull enoght. The ice that it melts will instant sublime due the lack of pressure, so you have a hole like the one you will make with a drill.\u003C/p\u003E\u003Cp\u003ESo you keep connection with the surface through a cable.\u003C/p\u003E\u003Cp\u003EAt least that is my idea.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYes climate change is a huge problem, yes we don\u0027t understand it completely and yes I\u0027m all for doing science we ever we can.\u003Cp\u003EAnd I\u0027m sounding like a broken record again; the astronauts wouldn\u0027t have anything to do in such an airship.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyes me too, because I said a lot of times all the reasons why we need to sent astronats, being the most important \u0022to inspire a new generation\u0022 and because we can not go to mars yet.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E- Come on, \u0022yes they are\u0022 isn\u0027t a valid reason.\u003C/span\u003Ebut I already answer this in previous post, and I was not the only one who answer this.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E- What are you going to do with \u0022many terrabytes\u0022 of space? Cassini has sent close to 500 GB of data in it\u0027s whole 10 year mission. You think you the HAVOC mission is going to produce more than that in 30 days? \u003C/span\u003E We dont have 10 years, and we can have 10 TB in just one month. It can record in full HD in all frequencys all the trip, Havoc in its whole journey will travel 285000 km, 7.5 laps around venus.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E- But of all places, why Venus?\u003C/span\u003E At 52 km, Is the place more similar to earth in the solar system. Also due all its advantages. I love it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt\u0027s true that NASA has no set in stone goal to go to Mars(like any other space agency in the world), but of all the world that are mention in where are we going to go next the Moon and Mars are always mentioned.\u003Cp\u003EI never heard them say \u0022To the Moon, Venus and beyond\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I said before, this is a new idea for NASA, they never realized of this possibility until now...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kibble\u0022 data-cite=\u0022Kibble\u0022\u003E\u003Cdiv\u003EVenus looks very favorable on paper, but we may figure out its harder than we thought to keep aerostats on stable wind currents, or maybe the atmospheric processor experiment didn\u0027t produce as much O2 as we thought it would, so next time we bring an improved version of the experiment, and then on Cloud City they use a really big atmospheric processor to make their O2, based on the same hardware. .\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EO2 is not the problem, that is too easy in Venus..\u003C/p\u003E\u003Cp\u003EWe need to figure out how hard is to get water from the atmosphere (the tiny sulfure rain).\u003C/p\u003E\u003Cp\u003EFrom the last probes, it seems that wind is not a problem, is too constant in the whole planet without turbulance.. of course we need to be sure.\u003C/p\u003E\u003Cp\u003EBut water its the biggest problem for colonize venus. There is 15000 km3 of water in the atmosphere, but the atmosphere is so thick, that is almost nothing in comparison.\u003C/p\u003E\u003Cp\u003EPeople see sulfure acid as a problem... but I would love if it will rain as at earth the same amount of acid there. Then it will be too good to be real, a perfect place to sustain a new civilization and economy. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BFGfreak\u0022 data-cite=\u0022BFGfreak\u0022\u003E\u003Cdiv\u003EJust out of curiosity, is there any reason for us to have men in the ISS when all the experiments can be controlled remotely from the ground? I would imagine that it would be the same principle, largly PR in an environment where death is only a few centimeters away.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, lets sit here to watch TV as in the Wall-e movie, meanwhile robots fill their lifes living all the adventures which we are too lazy and death to do it.\u003C/p\u003E\u003Cp\u003ELucky for us, robots still can not perform so well as the ISS astronauts do.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dispatcher\u0022 data-cite=\u0022Dispatcher\u0022\u003E\u003Cdiv\u003ESounds a lot like this thread:\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/103713-Venusian-Airships%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/103713-Venusian-Airships%21\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBefore post, I search for a similar topic, but I dint notice any.\u003C/p\u003E\u003Cp\u003EAlso I post it in the first second which gizmag publish it. So I dint imagine that it was a 2 day old news.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003E I think exploration has value as a \u003Cem\u003Ehuman\u003C/em\u003E activity beyond pure science.\u003Cp\u003EAnd I\u0027d argue that if there weren\u0027t humans in space, there would be much less human interest in space and thus less money for space science too. If there was no ISS, there\u0027s no realistic way politicians would spend all that money on science missions instead.\u003C/p\u003E\u003Cp\u003EIf there was zero chance of humans ever going to Mars, there\u0027d probably be less interest (and thus eventually less money) for Mars science.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgree.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-23T05:34:06Z\u0022 title=\u002212/23/2014 05:34  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 23, 2014\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2014-12-23T05:26:01Z","Content":"\n\u003Cp\u003EYou guys can\u0027t just gloss over the \u0022human\u0022 part of human space flight. The exploration of space by humans leads to us being Earth-independent, which at some point in the future that none of us (and hopefully not even our great-great grandchildren) will see will allow the human race to survive should it become impossible on Earth. Or even just as a means of expanding out into the universe even if Earth remains perfectly fine.\u003C/p\u003E\u003Cp\u003ELearning about whats in the rocks on Mars, or what is under the ice of a moon, or anything that robotic missions can do are very good things to know, but by far our biggest hurdle is learning how to live in space, or in other places. Long duration human spaceflight, and the science we gather from it is key to this. It\u0027s pretty much been the focus of the Russian space program (outside of other political considerations) and its been a huge part of NASA as well, not just in the early days of Mercury, Gemini, and Apollo, but with a lot of the shuttle missions as well. And its certainly the primary mission of the ISS. Someday the ISS will retire, and we might reach the limit of what we can learn from a station in orbit. The next step is almost surely Mars, and before that they\u0027ll prepare via orbital missions around the Moon and just maybe to some asteroid orbiting it (who knows, it could still happen)\u003C/p\u003E\u003Cp\u003ECertainly a Venusian airship sounds more exotic, but again the benefit of sending people would be learning more about surviving in different environments. You can predict how a person living in a Venusian airship will react, but until it happens, its just a prediction.\u003C/p\u003E\u003Cp\u003EWe aren\u0027t playing KSP here, where we\u0027re trying to get as many science points as possible in the smallest number of missions. There is no \u0022one\u0022 way to explore space\u003C/p\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-12-23T05:41:30Z","Content":"\n\u003Cp\u003ENASA can\u0027t even afford to launch their own rockets at the moment. Sadly, this is currently a pipe-dream at best..\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-12-23T05:42:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EAgree.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t. Look at how much attention Rosetta and Philae have received recently. And MSL. And Spirit \u0026amp; Opportunity. Hubble. Kepler. I grew up during the Voyager grand tour era. I wasn\u0027t the only one who was captivated by it. Every couple of years we were treated to beautiful new images of our solar system. Short of something going wrong, I don\u0027t recall the manned space program ever being as prominently in the spotlight as the robotic planetary science missions. \u003C/p\u003E\u003Cp\u003EAs I said above, missions like EJSM, TSSM, etc get canceled for lack of funding while missions like HORUS don\u0027t even proceed beyond the feasibility study stage. Don\u0027t tell me that a balloon and/or boat on Titan wouldn\u0027t captivate the public. Or that a mission to Jupiter\u0027s moons or an orbiter about Uranus wouldn\u0027t inspire kids. Likewise, a robotic balloon in Venus\u0027 clouds would send back photos to fire the imagination. These things are possible with a fraction of the funding that currently gets allocated to the ISS and an even smaller fraction of the money that would be needed to send people to Mars or Venus. \u003C/p\u003E\u003Cp\u003EIn an environment where budgets are tight, I would rather that money be spent where it yields the biggest PR and scientific ROI. That, to me, is clearly the robotic missions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-23T06:27:10Z\u0022 title=\u002212/23/2014 06:27  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 23, 2014\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003Cbr\u003EAdded Hubble and Kepler\n\u003C/span\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2014-12-23T06:43:25Z","Content":"\n\u003Cp\u003EThe biggest scientific ROI is the ISS, though if you roll all of the NASA Mars rovers as well as the orbiters together as one project its probably close.\u003C/p\u003E\u003Cp\u003EAs for PR, I\u0027d say Orion EFT-1 and the #ImOnboard campaign probably wins that pretty easily, and it was only an unmanned test flight for some future manned mission. There was just an insane anount of celebs and people involved all the way through 2014. I can\u0027t imagine how much it will expand when they actually launch people out of Earth orbit again\u003C/p\u003E\u003Cp\u003EThere is no waiting for manned missions to be more favorable. You either press on through budgetary issues and do them, or you don\u0027t and you don\u0027t progress human spaceflight, and we remain chained to Earth.\u003C/p\u003E\n"},{"CreatedByName":"EzinX","CreatedById":118288,"CreatedDateTime":"2014-12-23T06:46:40Z","Content":"\n\u003Cp\u003EIf Venus has 84% of the gravity of Earth, why is it practical for a SSTO to reach orbit from 52 kilometers on Venus? What\u0027s the delta-V requirement for that maneuver?\u003C/p\u003E\u003Cp\u003ERegardless of whether going to Venus is a good idea or not, I\u0027m just wondering how you get from your cloud city back to orbit without needing a spacecraft about the size of the one that got you from the ground on Earth to orbit. Balloon launchers have been proposed for Earth but they don\u0027t pass the pencil test.\u003C/p\u003E\u003Cp\u003EThis does make me wonder : suppose you wanted a long term cloud city. Could you send down robots by basically compressing the lift gas in the balloons they use so they fall to the surface slowly and gracefully? They would descend to the surface, mine it for resources, then ascend back up. Most of the robots would be made of systems that can take the pressure evenly across all the parts.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-12-23T08:39:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EMoon again? after 46 years our biggest next step will be moon??\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe have only just scratched the surface of the Moon. Having gone there in the past is irrelevant. Scott and Amundsen reached the South Pole over 100 years ago, yet there is now a thriving permanent base where 50 to 200 scientists are still doing research and returning science all year round.\u003C/p\u003E\u003Cp\u003EThere is a lot of scientific work that can be done on the Moon: astronomy, geology, biology. It\u0027s also a great place to test engineering solutions from dust mitigation to radiation shielding, ISRU, closed-loop life support, in vacuum and partial-gravity.\u003C/p\u003E\u003Cp\u003EAs you say yourself, we are not going to Mars in the next decade (and probably not in the next 20 years either). The Moon is far more achievable, only 3 days away. And building an infrastructure that allows (and requires) permanent access to the Moon is a much better way to secure funding and to make it economical than to keep on chasing dreams of Mars or Venus or Europa and not going anywhere for the next 47 years.\u003C/p\u003E\u003Cp\u003EBuilding a small semi-permanent outpost on the Moon is something we can realistically achieve. Cloud colonies on Venus or moisture farms on Mars are pipe dreams. I\u0027d rather see us achieve the smaller goals than keep on dreaming about stuff that won\u0027t happen.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-12-23T15:31:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EYou guys can\u0027t just gloss over the \u0022human\u0022 part of human space flight. The exploration of space by humans leads to us being Earth-independent, which at some point in the future that none of us (and hopefully not even our great-great grandchildren) will see will allow the human race to survive should it become impossible on Earth. Or even just as a means of expanding out into the universe even if Earth remains perfectly fine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah agree, and if this happen, I hope you make the mod \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E -Hooligan Labs is not real enoght.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EI don\u0027t. Look at how much attention Rosetta and Philae have received recently. And MSL. And Spirit \u0026amp; Opportunity. Hubble. Kepler. I grew up during the Voyager grand tour era. I wasn\u0027t the only one who was captivated by it. Every couple of years we were treated to beautiful new images of our solar system. Short of something going wrong, I don\u0027t recall the manned space program ever being as prominently in the spotlight as the robotic planetary science missions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, one social experiment for you, ask anyone in the street about space activities they may know.. they will mention when we go to the moon, ISS, and maybe hubble and voyayer. Maybe they hear about other missions, but they can not give any name or detail of those missions. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs I said above, missions like EJSM, TSSM, etc get canceled for lack of funding while missions like HORUS don\u0027t even proceed beyond the feasibility study stage. Don\u0027t tell me that a balloon and/or boat on Titan wouldn\u0027t captivate the public. Or that a mission to Jupiter\u0027s moons or an orbiter about Uranus wouldn\u0027t inspire kids. Likewise, a robotic balloon in Venus\u0027 clouds would send back photos to fire the imagination. These things are possible with a fraction of the funding that currently gets allocated to the ISS and an even smaller fraction of the money that would be needed to send people to Mars or Venus. \u003Cp\u003EIn an environment where budgets are tight, I would rather that money be spent where it yields the biggest PR and scientific ROI. That, to me, is clearly the robotic missions.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EThey already sent ballons to venus but without camera.. when they sent probes they dont care about the public, also they have so limited bandwith that is only enoght to get some science, but not much to show. \u003Cp\u003EThere was already a lot of mars rovers, yet even this is the only that people may see.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/hgk_ssiaFz4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EBORING is the word.\u003C/p\u003E\u003Cp\u003EYou think this is the way to get people attention? \u003C/p\u003E\u003Cp\u003ENobody really cares about these missions, taking into account that people are who paid for these missions, if you dont get their attention, you will have less money to invest in space.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI will show you how to get people attention:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHAVOC, The mission project to fly through the Venus clouds, destined to understand the earthÃ‚Â´s fate against the biggest problem that humanity even face, the climate change!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EJoin the crew in this risky journey since the apollo mission or colon, to solve some of the misteries hiden in our twin hell planet, to avoid make the same mistake here on earth.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EReal time pictures transmissions with brief resume at the end of each day.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPost documentary of 10 chapters showing all the trip odyssey with the 100 TB of data collected of all sensors and the 5 HD camera recording full time.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMerchandising of the mission, with RC blimps at scale, PC game including all missions phases (build your floating colony) and the movie.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThats is how you get in no time, the next huge budget for the next mission you want to do, at the same time people understand that the climate change problem is real, more if NASA get in so much trouble to find an answer. Without mention the prestige that NASA and goverment will get with this mission \u003C/strong\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EzinX\u0022 data-cite=\u0022EzinX\u0022\u003E\u003Cdiv\u003EIf Venus has 84% of the gravity of Earth, why is it practical for a SSTO to reach orbit from 52 kilometers on Venus? What\u0027s the delta-V requirement for that maneuver?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell the amount of atmosphere that you need to cross from that height is the same as earth, but the venus gravity and circunference is lower, So I will said 6500 to 7000m/s.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ERegardless of whether going to Venus is a good idea or not, I\u0027m just wondering how you get from your cloud city back to orbit without needing a spacecraft about the size of the one that got you from the ground on Earth to orbit. Balloon launchers have been proposed for Earth but they don\u0027t pass the pencil test.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA blimp in the venus atmosphere at 50km has 30% more lift than a blimp at earth surface.\u003C/p\u003E\u003Cp\u003EBut if you wanna launch a rocket from 10km of altitude with a blimp here on earth, you will need a hugeee blimp because the atmosphere at 10km is too thin.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThis does make me wonder : suppose you wanted a long term cloud city. Could you send down robots by basically compressing the lift gas in the balloons they use so they fall to the surface slowly and gracefully? They would descend to the surface, mine it for resources, then ascend back up. Most of the robots would be made of systems that can take the pressure evenly across all the parts.\u003C/div\u003E\u003C/blockquote\u003EIf you wanna take things from the surface if you have a cloud city, the best way is with a hot \u0022air\u0022 ballon, you just heat the gases inside your envelope to be more lighter than the surrounding, you need a nuclear heater instead combustion.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThere is a lot of scientific work that can be done on the Moon: astronomy, geology, biology. It\u0027s also a great place to test engineering solutions from dust mitigation to radiation shielding, ISRU, closed-loop life support, in vacuum and partial-gravity.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know, but is not the best place to get public attention right now.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs you say yourself, we are not going to Mars in the next decade (and probably not in the next 20 years either). The Moon is far more achievable, only 3 days away. And building an infrastructure that allows (and requires) permanent access to the Moon is a much better way to secure funding and to make it economical than to keep on chasing dreams of Mars or Venus or Europa and not going anywhere for the next 47 years.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA mission to Venus, which is much more expensive, you get some of that money back just because it has more marketing. And I am not saying you get the money from the media, you get the money because people get most interested in space, so they will not put excuses in the senate \u0022why we are going to the moon, we were already there, there is things more important to solve here\u0022.\u003C/p\u003E\u003Cp\u003EYour budget limit it does not depent much of the country condition, it depends on the public opinion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-23T17:32:58Z\u0022 title=\u002212/23/2014 05:32  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 23, 2014\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Charzy","CreatedById":440,"CreatedDateTime":"2014-12-23T15:43:31Z","Content":"\n\u003Cp\u003EYeah, instead of people going \u0022Why are we going to the moon, we were already there, there are things more important to solve here\u0022, people will be going \u0022What the hell are you people doing spending all our tax money on sending people to \u003Cem\u003EVenus\u003C/em\u003E when we could be doing something actually useful?!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2014-12-23T16:10:41Z","Content":"\n\u003Cp\u003ENASA is not an entertainment company. The PR is secondary, and you can put PR spin on any kind of mission.\u003C/p\u003E\u003Cp\u003ENASA\u0027s job is to advance space science and technology. \u0022Getting the public interested\u0022 is not part of its mandate. It needs money, but the money comes from Congress, not the public. Members of Congress are not elected on their space policy, they are elected on their political label and the electoral promises.\u003C/p\u003E\u003Cp\u003EPeople are not more \u0022inspired\u0022 by Mars or Venus than by the Moon. They are inspired by jobs, taxes, JayZ and Rihanna, and the latest smartphone. Most of them don\u0027t know that the ISS exists and think that NASA sucks up 25% of the US budget. Space exploration is way down on the average public\u0027s list, and swapping destinations between the Moon, Mars or an asteroid hardly even registers.\u003C/p\u003E\u003Cp\u003EThe best way to advance space science and technology is to select goals that are achievable, and achieve them. It isn\u0027t to distill PR spin on Mars and Venus when everybody knows that those goals are out of reach.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-23T16:16:13Z\u0022 title=\u002212/23/2014 04:16  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 23, 2014\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"}]}