{"TopicId":93995,"ForumId":20,"TopicTitle":"The mods I use(d) and why","CreatedByName":"jarmund","CreatedById":126888,"CreatedDateTime":"2014-12-21T14:25:58Z","PageNum":1,"Articles":[{"CreatedByName":"jarmund","CreatedById":126888,"CreatedDateTime":"2014-12-21T14:25:58Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EFirst things first: The purpose of this thread.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI am posting this hoping that it is somewhat informative for people looking to enhance their vanilla install. I had to spend quite some time figuring out which mods i should try out, so hopefully this will be helpful to relatively new players that want to dive into the realms of modded gameplay. In addition, someone might be able to suggest a mod that i might like based on this post. \u003C/p\u003E\u003Cp\u003EAnd ofcourse, others posting their \u0022which-and-why\u0022-list is encouraged.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESecondly: My stance on mods.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI am a big fan of enjoying a vanilla game for what it is, and therefore somewhat limit the amount of mods so that the overall gameplay doesn\u0027t change too much. I see mods something that should enhance a game and/or push the endgame further away, rather than change it completely. Sure, not everyone is of this opinion, but i thought i\u0027d include this so that my list is given a context of playstyle.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EFootnote: A mod that adds the bare minimum of parts is more likely to be used by me.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis list is what i use with 0.90, Science mode.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDisclaimer:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis post is primarily opinion based, and my endorsement of a mod, or lack thereof should not be considered any indication of quality, be it positive or negative. But to be frank, the mods i use are exceptionally well made. Cudos to the mod developers.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EDocking Port Alignment Indicator.\u003C/span\u003E I cannot remember who made it, but it\u0027s the same one that\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLYu7z3I8tdEmjsTPxZMAsU8_d30ctM1Hm\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. I am of the strong opinion that this mod is brilliant, a must-have, and all of those things. Basically, it makes docking a lot less \u0022Ram it, and hope it alignes\u0022, and more of a careful approach with continuous adjustments. Once you\u0027ve docked with it, you start wondering how you managed without it.\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ENavyfish enhanced navball.\u003C/span\u003E Almost as important as the above mod, this one makes your navball even better. Vectors that are not in the cone of view will show a ghost near the rim, so that you\u0027ll know where it is relative to your current heading, thus eliminating the need to pitch/yaw while searching for your pro- or retrograde. Also, it allows you to resize the navball, as well as move it around so that it doesn\u0027t obstruct the view as much.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EKerbal Alarm Clock.\u003C/span\u003E Also incredibly useful. Allows you to do other maneuvers and launches without the concern of forgetting about your probe\u0027s upcoming SOI change. It\u0027ll pop up a message for any alarms you set, as well as make sure to slow down any timewarp in time. It\u0027s also very useful for timing upcoming launch windows.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESelectRoot.\u003C/span\u003E This one allows you to change wich part of your ship is considered the root part, thus allowing you to pick almost any part of your contraption and dropping it on the subassembly menu. I used this a lot with 0.25, but as 0.90 seems to have some sort of selectable root built in, i haven\u0027t reinstalled this one after the upgrade.\u003C/p\u003E\u003Cp\u003EThe three above do not actually change the gameplay, but can be considered utility-mods, as they bring useful tools to the current game. A very conservative player can install these without any concern of it changing the gameplay at all.\u003C/p\u003E\u003Cp\u003ENow, the ones that actually do modify the gameplay somewhat:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EFerram Aerospace Research.\u003C/span\u003E Simply put: Realistic aerodynamics. The upsides are that all parts now have lift and drag applied to them in a realistic fasion. It makes flying harder in terms of stability, but the atmosphere is less like soup, so creating an aircraft based on actual aeronautic principles is now possible. Highly recommended. Nosecones are now actually useful, and rockets can now skip over the atmosphere during a fast and shallow reentry angle.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMechJeb.\u003C/span\u003E Some might scratch their heads when reading this, considering my stance on changing gameplay. Well, mechjeb gets a lot of grief from people claiming that it\u0027s the easy-button that takes away any need for actual piloting skill. But that all depends on the extent to which you use it. Basically, what it does is a lot of automation, such as ascent, landing, and docking autopilot, but it also has a lot of things that I find very useful.\u003C/p\u003E\u003Cp\u003E - Rover autopilot. Because i don\u0027t want to sit holding W for an entire evening just to drive my eve rover between biomes.\u003C/p\u003E\u003Cp\u003E - Maneuver node editor. Because the edit gizmos don\u0027t allow me to edit maneuvers acurate enough.\u003C/p\u003E\u003Cp\u003E - Smart A.S.S. I stopped using this with the release of 0.90, as there\u0027s now a vanilla component to this. Simply put, what it does is the same thing as the heading-hold features that one gets with a skilled pilot.\u003C/p\u003E\u003Cp\u003E - Maneuver node executor. Because of ion drives \u002B heavy ships. Enough said. I still do most of the piloting myself but for really tedious or repetitive stuff, this takes away a lot of boredom.\u003C/p\u003E\u003Cp\u003E - Custom Info windows. A very handy feature that easily allows you to create windows with data that you find important. Delta V-stats, orbit stats, predicted landing site, etc.\u003C/p\u003E\u003Cp\u003E - Allows you to switch between conics modes on the fly.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EKerbal Attachment System.\u003C/span\u003E I originally used this to retrofit a spacecraft with additional solar panels, but with time i\u0027ve grown fond of its other features as well. It allows you to add winches, grappling hooks, and all sorts of useful stuff, in addition to the great ability of allowing you to add additional struts after launch. Big mothership consisting of many individually launched launched segments? Well, EVA out and strut it together, and it won\u0027t wobble apart once you fire up your engine.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EInterstellar.\u003C/span\u003E This is perhaps the biggest gamechanger (in its literal sense) that i use. It\u0027s a nice way of adding more end-game stuff. Let\u0027s face it, the vanilla tech tree is a bit easy to unlock (sure, change the dificulty to hard, and grind contracts instead, but that\u0027s not for me). Rather than having to change the pace of the game to make it last longer, instead extend it. That\u0027s why i like interstellar: Thermal engines, plasma engines, nuclear plants, etc etc. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EKethane.\u003C/span\u003E I used this before I installed interstellar and its additional resources, so I haven\u0027t bothered installing this with 0.90 yet. It allows you to mine for fuel and thus allowing post-launch refueling. I used this to set up my minimus refuel-depot, which was fun as hell to play around with. It does not seem to support 0.90 yet.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ETAC Fuel balancer.\u003C/span\u003E This one allows for easier fuel tank management. Dump, Auto-balance, Pump In, Pump Out, etc. I used this because my fuel barge on minimus was impossible to fly without it, as it was hard to balance the fuel tanks that were on the sides. I use this with some restrictions, tho: I do not use it for tanks that aren\u0027t attached directly or via fuel pipes (Basically, this mod can render the fuel pipes obsolete)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMagic Smoke Industries Infernal Robotics.\u003C/span\u003E Motorized hinges, pistons, rotators and all sorts of fun. Great if combined with FAR, as it allows you to pack up your contraptions for launch, then have them deploy once in space. Also: Tilt-motors. Even better if combined with KAS, as you can then build proper cranes. Brilliant if combined with Interstellar or Remote Tech, as you then have a way of turning your antennae around, without having to turn the ship. Also, I\u0027ve seen people creating transformers with this mod. And worth pointing out: A docking port on a moving segment translates perfectly when maneuvering.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERemoteTech.\u003C/span\u003E I tried this one. It makes interplanetary communications more realistic, such as antenna range, signal blocked by a planet being in the way and all that. It\u0027s a good mod, and i recommend it if you want to add another aspect of realism to the game. It\u0027s just not for me as i do not feel like launching a myriad of comsats to get the same gameplay as vanilla. I still recommend it for people who want to expand game realism, tho.\u003C/p\u003E\u003Cp\u003ESo, that\u0027s it. As you can see, i do not use any of the beautification mods such as clouds, night lights and all that. I simply do not have a beefy enough computer to sacrifice performance for aesthetics. If i did, I\u0027d probably use them, but for now i will have to like without them.\u003C/p\u003E\u003Cp\u003EFeel free to suggest mods that work well with the mods i already use. In particular:\u003C/p\u003E\u003Cp\u003E- I would really like it if someone could recommend a good mod for fairings. I don\u0027t need more wings, engines, landing gears and cockpits (for now anyways), just a set of fairings that work well with FAR\u003C/p\u003E\u003Cp\u003E- Is there such a thing as \u0022the best\u0022 toolbar mod? I\u0027d like to get IR, Mechjeb, Docking Port, and FAR all on the same toolbar. Especially the docking port, as it has a tendency of placing itself almost in the middle of the screen.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-21T14:53:12Z\u0022 title=\u002212/21/2014 02:53  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 21, 2014\u003C/time\u003E by jarmund\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"madlemur","CreatedById":116597,"CreatedDateTime":"2014-12-21T17:28:09Z","Content":"\n\u003Cp\u003EReal Chutes. Deadly Reentry. SCANSat. Pretty much anything from RoverDude (I\u0027ve been having a blast with his sounding rockets).\u003C/p\u003E\u003Cp\u003EForgot the reason for the reply! Procedural Fairings.\u003C/p\u003E\n"},{"CreatedByName":"madlemur","CreatedById":116597,"CreatedDateTime":"2014-12-21T17:33:24Z","Content":"\n\u003Cp\u003EI\u0027d also suggest using CKAN (the thread is in the Tools and Accessories forum).\u003C/p\u003E\n"},{"CreatedByName":"SpaceLaunchSystem","CreatedById":125698,"CreatedDateTime":"2014-12-21T18:33:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022madlemur\u0022 data-cite=\u0022madlemur\u0022\u003E\u003Cdiv\u003EReal Chutes. Deadly Reentry. SCANSat. Pretty much anything from RoverDude (I\u0027ve been having a blast with his sounding rockets).\u003Cp\u003EForgot the reason for the reply! Procedural Fairings.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI also recommend RoverDude\u0027s sounding rockets. If you play career, the generate a lot of science.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-12-21T18:55:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jarmund\u0022 data-cite=\u0022jarmund\u0022\u003E\u003Cdiv\u003E- Is there such a thing as \u0022the best\u0022 toolbar mod? I\u0027d like to get IR, Mechjeb, Docking Port, and FAR all on the same toolbar. Especially the docking port, as it has a tendency of placing itself almost in the middle of the screen.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure calling it \u0022the best\u0022 as I believe it is the only toolbar mod, but you want to get \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60863-0-25-0-Toolbar-1-7-7-Common-API-for-draggable-resizable-buttons-toolbar\u0022 rel=\u0022external nofollow\u0022\u003EBlizzy\u0027s Toolbar\u003C/a\u003E. The thread says it is for 0.25 but it does work in 0.90 but does show a compatibility warning so you may want to wait until it is updated...\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2014-12-21T19:33:31Z","Content":"\n\u003Cp\u003EFAR -Better aerodynamics, added challenge but smaller rockets\u003C/p\u003E\u003Cp\u003EDRE -Added difficulty and realism\u003C/p\u003E\u003Cp\u003ETAC-LS -something that makes time actually matter, can\u0027t just leave a kerbal in solar orbit for 500 years.\u003C/p\u003E\u003Cp\u003EContract science remover -In stock contracts are usually better way of getting science than actual experiments...\u003C/p\u003E\u003Cp\u003ESane strategies -just to nerf the funds to science conversion\u003C/p\u003E\u003Cp\u003EAll using default settings of the mods combined with career on hard, difficult and very grindy.\u003C/p\u003E\u003Cp\u003EWould add an mod that makes the EVA fuel in capsules limited, but there isn\u0027t one for the newest version.\u003C/p\u003E\n"},{"CreatedByName":"NWDogg","CreatedById":118058,"CreatedDateTime":"2014-12-21T20:51:15Z","Content":"\n\u003Cp\u003EMy \u0027stock\u0027 install for .90 looks like this:\u003C/p\u003E\u003Cp\u003EFAR \u003C/p\u003E\u003Cp\u003EDeadly Reentry\u003C/p\u003E\u003Cp\u003EModular Rocket Systems --Adds several stock-alike parts that fills in the gaps not covered by stock parts.\u003C/p\u003E\u003Cp\u003ESpaceY Heavy Lifters --Throws in really nice 3.75 and 5m parts for heavy lifting, helping to reduce part count.\u003C/p\u003E\u003Cp\u003ERLA Stockalike --Adds in a bunch of sorely missing .625m parts that expand probe/small ship abilities.\u003C/p\u003E\u003Cp\u003EKerbal Engineer Redux --For necessary info...parts of this absolutely need to be stock, and I think most everyone would agree.\u003C/p\u003E\u003Cp\u003ETweakscale --Allows resizing of parts to curb the need to add in more part packs.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EZero-point Inline Fairings or Procedural Fairings\u003C/strong\u003E --Necessary with FAR...I keep switching these, they both have pros and cons that makes it hard to decide which to keep.\u003C/p\u003E\u003Cp\u003EKarbonite --We are getting some sort of resource harvesting in the future anyway, and I like this one slightly better than Kethane.\u003C/p\u003E\u003Cp\u003EDMagic\u0027s Orbital Science --I love these science parts. Makes the thermometer and accelerometer look like kids toys.\u003C/p\u003E\u003Cp\u003ESo yeah...my \u0027stock\u0027 KSP experience consists of no less than 10 mods \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E. Though I do believe that the majority of these mods have a place in stock KSP, mainly to fill in places that haven\u0027t been addressed yet by Squad.\u003C/p\u003E\n"},{"CreatedByName":"jarmund","CreatedById":126888,"CreatedDateTime":"2014-12-28T02:11:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022madlemur\u0022 data-cite=\u0022madlemur\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E(snip)\u003C/p\u003E\u003Cp\u003EForgot the reason for the reply! Procedural Fairings.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NWDogg\u0022 data-cite=\u0022NWDogg\u0022\u003E\u003Cdiv\u003EMy \u0027stock\u0027 install for .90 looks like this:\u003Cp\u003E(snip)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EZero-point Inline Fairings or Procedural Fairings\u003C/strong\u003E --Necessary with FAR...I keep switching these, they both have pros and cons that makes it hard to decide which to keep.\u003C/p\u003E\u003Cp\u003E(snip)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI ended up trying and loving both. Procedural for whenever i have something large at the end, and 0Point for when my rocket has something ugly (girders, KAS crates, strut points, etc) or something else worth covering up along the middle. Thanks to both of you.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003ENot sure calling it \u0022the best\u0022 as I believe it is the only toolbar mod, but you want to get \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60863-0-25-0-Toolbar-1-7-7-Common-API-for-draggable-resizable-buttons-toolbar\u0022 rel=\u0022external nofollow\u0022\u003EBlizzy\u0027s Toolbar\u003C/a\u003E. The thread says it is for 0.25 but it does work in 0.90 but does show a compatibility warning so you may want to wait until it is updated...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWorks like a charm. Cheers!\u003C/p\u003E\u003Cp\u003EI would also like to suplement my original post with this mod, which i just installed:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/74195\u0022 rel=\u0022external nofollow\u0022\u003EAction Groups Extended\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E...because a lander can not rely on setting up all of the action groups when launching my mothership segment by segment. I haven\u0027t had the chance to fully test it out yet, but if it works like advertised, then it\u0027s golden.\u003C/p\u003E\n"}]}