{"TopicId":94260,"ForumId":16,"TopicTitle":"Abrupt direction change when in new SOI and grav. assists?","CreatedByName":"ROXunreal","CreatedById":133129,"CreatedDateTime":"2014-12-23T17:31:01Z","PageNum":1,"Articles":[{"CreatedByName":"ROXunreal","CreatedById":133129,"CreatedDateTime":"2014-12-23T17:31:01Z","Content":"\n\u003Cp\u003EGreetings. I\u0027m three days new to the game but have a basic understanding of most of the astronomical concepts involved.\u003C/p\u003E\u003Cp\u003EOne thing I don\u0027t understand is that (as far as I know) because of the game mechanics, upon entering a new body\u0027s SOI the direction of your craft changes abruptly and unpredictably. I don\u0027t understand how I\u0027m supposed to \u0022aim\u0022 for third bodies during gravity assists in these circumstances, and I can\u0027t seem to find any relevant info on this in internet searches.\u003C/p\u003E\u003Cp\u003EThis is what I mean:\u003C/p\u003E\u003Cp\u003EThis is the plan.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Wqjd0ff.jpg\u0022 alt=\u0022Wqjd0ff.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooking good.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zgQFiZn.jpg\u0022 alt=\u0022zgQFiZn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESuddenly upon reaching the \u0022Mun encounter\u0022 node, THIS happens. Everything is changed. I\u0027m heading in a completely different direction that was not indicated in the flight path prediction?????\u003C/p\u003E\u003Cp\u003EI also don\u0027t get the broken flight path lines?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kXMPMcR.jpg\u0022 alt=\u0022kXMPMcR.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-24T01:13:01Z\u0022 title=\u002212/24/2014 01:13  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 24, 2014\u003C/time\u003E by ROXunreal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-12-23T17:39:48Z","Content":"\n\u003Cp\u003EWhat is happening here is very simple:\u003C/p\u003E\u003Cp\u003EWhen you have an orbit around Kerbin, your conics will display the orbit relative to Kerbin.\u003C/p\u003E\u003Cp\u003EWhich means that one orbit around MÃƒÂ¼n, relative to kerbin, will look nowhere near an elipse.\u003C/p\u003E\u003Cp\u003EBut after you enter MÃƒÂ¼n\u0027s SOI your orbit will be relative to the MÃƒÂ¼n.\u003C/p\u003E\u003Cp\u003EThat means that both orbits are pretty much the same, you just change your reference.\u003C/p\u003E\u003Cp\u003ESo, if you timewarp you will see that the MÃƒÂ¼n will move and your ship will move with it, and you will escape exactly like it\u0027s shown on the first orbit.\u003C/p\u003E\u003Cp\u003EYou can change the modes, and make it show like on the last picture all the times, you just need to go on settings.cfg and change:\u003C/p\u003E\u003Cp\u003ECONIC_PATCH_DRAW_MODE = 0\u003C/p\u003E\u003Cp\u003ESo it will display like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BRWfN8A.png\u0022 alt=\u0022BRWfN8A.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERight now you have:\u003C/p\u003E\u003Cp\u003ECONIC_PATCH_DRAW_MODE = 3\u003C/p\u003E\u003Cp\u003EWhich looks like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UhlYhKN.png\u0022 alt=\u0022UhlYhKN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBoth orbital paths are exactly the same.\u003C/p\u003E\u003Cp\u003EModes 1 and 2 shift the SOI entrance orbit to match with the SOI entrance and exit, respectivelly.\u003C/p\u003E\u003Cp\u003EEdit: If you focus on Kerbin and timewarp you will see that even though the orbit drawing changes, the relative ship motion is exactly the one shown on the first image you posted.\u003C/p\u003E\u003Cp\u003EThe \u0022broken path lines\u0022 are because on Mode 3, it always show the orbits relative to the lower SOI on the chain, so the same way your orbit will exit MÃƒÂ¼n further forward to start being relative to Kerbin again, it will also exit Kerbin a bit further forward and start being relative to the Sun.\u003C/p\u003E\u003Cp\u003EThis is just a matter of how these orbits are displayed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-23T17:47:09Z\u0022 title=\u002212/23/2014 05:47  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 23, 2014\u003C/time\u003E by tetryds\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2014-12-23T17:43:41Z","Content":"\n\u003Cp\u003EThis is a matter of perception. You are still moving on the lines indicated in the first picture. The first picture shows your actual path through space before, during, and after intercepts with the moon. What you aren\u0027t taking into account is the fact that the moon is moving. In the final picture it\u0027s showing your path \u003Cem\u003Erelative to the moon\u003C/em\u003E. You have to remember that the moon is also moving. So, by the time you orbit around the moon it will have moved forward and the blue line showing your \u0022Exit\u0022 path will reconnect with the other orbit and send you on your way. Also, recognize that the yellow line in the third picture is the same as the purple line in the second picture. There is now a new purple line in the third picture showing your exit from Kerbin\u0027s SOI.\u003C/p\u003E\u003Cp\u003E[Edit] In other words, just zoom the map out and watch as your time warp. You\u0027ll see the ship get pulled in and it\u0027s orbit follow along where it should have gone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-23T17:45:42Z\u0022 title=\u002212/23/2014 05:45  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 23, 2014\u003C/time\u003E by Ziff\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2014-12-23T17:46:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EWhat is happening here is very simple:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t say it\u0027s \u0022simple\u0022 but good explanation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EImportant thing for the OP is that if you just keep time warping and get out of Mun\u0027s SOI, the broken lines will merge at the point of escape, you\u0027ll be back on the original orbit you expected to be on. In fact, if you\u0027d focussed Mun in the middle screenshot, it should have showed you what the orbit would look like once you were in it\u0027s SOI. Your velocity isn\u0027t changing, but the way the game is displaying your movement is.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-12-23T17:50:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EI wouldn\u0027t say it\u0027s \u0022simple\u0022 but good explanation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha, maybe it isn\u0027t, but you get used to it.\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003EI tend to use Mode 0, often Mode 3 can become a mess and hard to fine tune maneuvers.\u003C/p\u003E\u003Cp\u003EBut Mode 3 makes it simpler to plan free return trajectories.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-23T17:54:27Z","Content":"\n\u003Cp\u003EAs has been explained this is just the patched conics system in a somewhat counter-intuitive configuration. However, it\u0027s worth adding that if you pass through an SoI switch while timewarping above say, 10x or 50x, quite often the orbit around say, Mun won\u0027t be what was predicted, sometimes with quite a large difference between them (e.g. periapsis can jump from 5km to 500km or inside the Mun at very high timewarp). \u003C/p\u003E\u003Cp\u003EYou can also see your encounter prediction relative to the Mun if you focus view on it, as opposed to the encounter relative to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"ROXunreal","CreatedById":133129,"CreatedDateTime":"2014-12-23T20:16:31Z","Content":"\n\u003Cp\u003EThanks for the fabulous answers. I tested and did notice that in the end if I followed through regardless of the apparent orbit change I get the same result. It was just rather confusing at first. Well, main thing is that it works.\u003C/p\u003E\n"},{"CreatedByName":"DrD","CreatedById":103953,"CreatedDateTime":"2014-12-23T22:09:21Z","Content":"\n\u003Cp\u003EThis confused me also but once I understood it actually helped me tremendously to understand orbital mechanics in general. So your orbit looks one way to someone standing on the Mun but another to someone standing on Kerbin and yet another to someone standing on the sun (Kerbol. I prefer to say sun to avoid confusing typos.))\u003C/p\u003E\u003Cp\u003EFor example when you thrust away from Kerbin to go to Duna it looks like you\u0027re blasting away from Kerbin to someone at the KSC but once you switch to sun SOI it\u0027s clear that Kerbin is orbiting away from you and you\u0027ve in fact slowed down relative to sun.\u003C/p\u003E\u003Cp\u003EYou\u0027ll also notice your speed changes when you enter a new SOI, it goes up quite a lot when entering sun SOI since you now have Kerbins\u0027 orbital velocity counted as well. \u003C/p\u003E\u003Cp\u003ENeat huh?\u003C/p\u003E\u003Cp\u003EAnd BTW if you don\u0027t know (I didn\u0027t for a long time) you can click on a body, say the Mun, and select focus, and then you right away see your pending orbit to that body like in Tetryds\u0027s picture but solid lines not dashed. To return focus to ship press backspace. Not sure if this is changed in 0.90, I\u0027m still early in my career in this latest version.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-23T22:17:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DrD\u0022 data-cite=\u0022DrD\u0022\u003E\u003Cdiv\u003Ethe sun (Kerbol. I prefer to say sun to avoid confusing typos.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrictly speaking, Squad never actually named it Kerbol - the fans did. I believe the official name is just \u0022the sun\u0022. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DrD\u0022 data-cite=\u0022DrD\u0022\u003E\u003Cdiv\u003EFor example when you thrust away from Kerbin to go to Duna it looks like you\u0027re blasting away from Kerbin to someone at the KSC but once you switch to sun SOI it\u0027s clear that Kerbin is orbiting away from you and you\u0027ve in fact slowed down relative to sun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you\u0027ve confused Duna with Eve here: you speed up relative to Kerbin\u0027s orbit to go to Duna, not slow down. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DrD\u0022 data-cite=\u0022DrD\u0022\u003E\u003Cdiv\u003ENot sure if this is changed in 0.90, I\u0027m still early in my career in this latest version.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENah it\u0027s still the same \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-12-24T00:41:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022armagheddonsgw\u0022 data-cite=\u0022armagheddonsgw\u0022\u003E\u003Cdiv\u003EI think you\u0027ve confused Duna with Eve here: you speed up relative to Kerbin\u0027s orbit to go to Duna, not slow down. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha, that caught you too.\u003C/p\u003E\u003Cp\u003EWhen you accelerate and make your AP higher you get slower as you orbit towards it.\u003C/p\u003E\u003Cp\u003EBut it\u0027s true that you only \u0022slow down\u0022 as you gain altitude, not at the exact escape moment.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-12-24T01:16:01Z","Content":"\n\u003Cp\u003EWhile we\u0027re on the subject, you can check \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/11322-Different-Conic-drawing-modes\u0022 rel=\u0022external nofollow\u0022\u003Ethis handy tutorial\u003C/a\u003E if you want more in-depth information on what each conic patching mode draws in reference to. It\u0027s an older one, but the information in there should still be valid.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-12-24T01:25:52Z","Content":"\n\u003Cp\u003EWell, I would argue that your premise:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ROXunreal\u0022 data-cite=\u0022ROXunreal\u0022\u003E\u003Cdiv\u003E... upon entering a new body\u0027s SOI the direction of your craft changes abruptly and unpredictably\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eis flawed since the change isn\u0027t \u0022abrupt\u0022: The trajectory is gently curved throughout the predicted track. The changes are more dramatic when the vessel is closer to the new body, but if \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ROXunreal\u0022 data-cite=\u0022ROXunreal\u0022\u003E\u003Cdiv\u003EI [...]have a basic understanding of most of the astronomical concepts involved.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eis true, then you\u0027ll understand why (in a word, \u0022gravitation\u0022).\u003C/p\u003E\u003Cp\u003EAs for:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ROXunreal\u0022 data-cite=\u0022ROXunreal\u0022\u003E\u003Cdiv\u003EI don\u0027t understand how I\u0027m supposed to \u0022aim\u0022 for third bodies during gravity assists in these circumstances\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, gravity assists are a major pain to set up. Not sure how else to say it. \u003C/p\u003E\u003Cp\u003EMany experienced players (myself included) believe that there are very few conditions where gravity assists are worth the hassle. Examples include slingshots off Eve to kill velocity for Moho approaches and Jool captures/escapes off Tylo. Other experienced players love them for all kinds of maneuvers.\u003C/p\u003E\u003Cp\u003EIf you\u0027re really set on using assists, then my best advice is the following three points:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EZero inclination approaches: Make sure you\u0027re approaching the body you want to slingshot off at almost a \u003Cem\u003Eperfect\u003C/em\u003E equitorial orbit. Doing so should largely eliminate that sigmoid shape you\u0027re seeing, or at least remove the inclination change as a reason you\u0027re seeing it. This should make your outcomes more \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENode planning: Set your original burn node to get you an AP/PE near your target slingshot body using the pro-/retrograde vectors, then rotate that node around your origin orbit until you get the slingshot result you like.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u0022Brute force\u0022 energy changes: Use gravity assists only when you\u0027re trying to make \u003Cstrong\u003Ebig\u003C/strong\u003E changes to your orbital energy where the exact AP or PE doesn\u0027t matter that much. Jool capture off Tylo would be a prime example of this. In other cases, you\u0027re sacrificing too much precision to make your slingshot worth it.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReally, if you\u0027re 3 days new to the game, don\u0027t worry about assists yet. Even if you\u0027re an astrophysicist, learn the basics for now. There\u0027s some practical skills for this game that you can only really get by playing it. When you can shoot yourself out to Jool or Moho with no problems, \u003Cem\u003Ethen\u003C/em\u003E start mucking around with the assists. You\u0027ll learn where to use them pretty quickly if you understand the orbital math.\u003C/p\u003E\u003Cp\u003EAnyway, hope that all helps. Clear skies and welcome to game.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETwo more points that I think \u003Cem\u003Emay\u003C/em\u003E be salient to the discussion:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EYou may also want to increase the number of SOI changes you\u0027re predicting into the future. That purple trajectory in your last image is your Kerbolar/Solar trajectory. it was there the whole time, it just wasn\u0027t getting rendered.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETake your SoI transitions at low timewarp speed (10x or lower). When you transition SoI\u0027s/patches, there\u0027s invariably some floating point and rounding errors. Thing is, those errors are dependent on the pre- and post- transition frames, which are, in turn, dependent on your time warp. Basically, high time-warp SoI changes can \u003Cem\u003Eseriously\u003C/em\u003E ruin your day.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-24T01:38:48Z\u0022 title=\u002212/24/2014 01:38  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 24, 2014\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003Cbr\u003EAddenda\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-12-24T01:28:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EWhile we\u0027re on the subject, you can check \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/11322-Different-Conic-drawing-modes\u0022 rel=\u0022external nofollow\u0022\u003Ethis handy tutorial\u003C/a\u003E if you want more in-depth information on what each conic patching mode draws in reference to. It\u0027s an older one, but the information in there should still be valid.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome resource.\u003C/p\u003E\u003Cp\u003ESo if this is \u0026gt; 2 years old, why in the frak is no way to adjust this ingame yet!?\u003C/p\u003E\n"}]}