{"TopicId":94359,"ForumId":70,"TopicTitle":"I think, my savegame got corrupted","CreatedByName":"Perry210174","CreatedById":120354,"CreatedDateTime":"2014-12-24T08:22:51Z","PageNum":1,"Articles":[{"CreatedByName":"Perry210174","CreatedById":120354,"CreatedDateTime":"2014-12-24T08:22:51Z","Content":"\n\u003Cp\u003EKSP/Windows: \u003C/p\u003E\u003Cp\u003EKSP 0.90 32 bit (steam version) \u003C/p\u003E\u003Cp\u003EWindows 7 home premium 64bit (german version)\u003C/p\u003E\u003Cp\u003E(more info in logfiles)\u003C/p\u003E\u003Cp\u003EProblem: \u003C/p\u003E\u003Cp\u003ECan not enter Tracking Station, VAB\u003C/p\u003E\u003Cp\u003ECan enter Astronaut Complex -\u0026gt; when exit: Astronaut-complex-music continues playing\u003C/p\u003E\u003Cp\u003ECan exit game pressing Alt\u002BF4 only.\u003C/p\u003E\u003Cp\u003E(Tried 2-3 Times to restart KSP and enter diffenrent Buildings. Lauchpad and Astronaut Complex can be entered, other buildings can not be entered).\u003C/p\u003E\u003Cp\u003EMods installed:\u003C/p\u003E\u003Cp\u003EKarbonite 0.5.0 (with fixed firespitter dll)\u003C/p\u003E\u003Cp\u003EKAS 0.4.10\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock 3.0.6.0\u003C/p\u003E\u003Cp\u003EMechJeb2 2.4.1.0\u003C/p\u003E\u003Cp\u003ESCANsat 8.1\u003C/p\u003E\u003Cp\u003EReproduction steps:\u003C/p\u003E\u003Cp\u003EStart KSP\u003C/p\u003E\u003Cp\u003ELoad Savegame\u003C/p\u003E\u003Cp\u003ELeftklick on Tracking Station\u003C/p\u003E\u003Cp\u003ELogs and Save:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://home.arcor.de/luecke_online/ksp/savegame_logfiles.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehome.arcor.de/luecke_online/ksp/savegame_logfiles.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI built a Spacecraft \u0022Ike Station 1\u0022 (it\u0027s saved in VAB directory) and flew it to Ike orbit, decoupled the lander and landed on Ike.\u003C/p\u003E\u003Cp\u003EDuring flight it was impossible to quicksave, it was impossible to switch to another ship on the map and it was impossible to go to Space Center.\u003C/p\u003E\u003Cp\u003EBut I continued the mission, landed on Ike, transmitted all Science.\u003C/p\u003E\u003Cp\u003EThen I tried to go to Space Center, it didn\u0027t work. I watched the debug-menu\u003C/p\u003E\u003Cp\u003EThe debug menu showed many, many \u0022NullReferenceException: Object reference not set to an instance of an object\u0022 errors.\u003C/p\u003E\u003Cp\u003EI quit the game via Alt\u002BF4.\u003C/p\u003E\u003Cp\u003EAfter reloading I couldn\u0027t continue the game (see above).\u003C/p\u003E\n"},{"CreatedByName":"Bob Jub","CreatedById":12104,"CreatedDateTime":"2014-12-27T05:47:03Z","Content":"\n\u003Cp\u003EI\u0027m having a very similar issue, I can\u0027t enter the VAB or SPH, whenever I enter any other building I am stuck there- I checked the debug output and I\u0027m seeing this error: [Error]: ScenarioModule is null. \u003C/p\u003E\u003Cp\u003EThis started when I created a ship and I got some error when I put it on the launch pad\u003C/p\u003E\n"},{"CreatedByName":"Entirago","CreatedById":134799,"CreatedDateTime":"2015-01-08T01:04:10Z","Content":"\n\u003Cp\u003EI am having what sounds like the same issue. On the launch of my first station, my persistent save becomes corrupted. If I manage to get back to KSC, I can enter the contracts or astronaut buildings, but cannot then to the KSC scene. I\u0027m using all of the mods you are, Perry, and then some, so I downloaded your save game hoping that there was a bugged part that we had in common. No such luck; all of the parts that we are both using are stock or MechJeb.\u003C/p\u003E\u003Cp\u003EI did, however, have the following successes:\u003C/p\u003E\u003Cp\u003E1) By pressing escape from the KSC scene, I managed to load your quicksave file. It is safe and uncorrupted. I\u0027ve noticed in my own game that the first sign of corruption is that I cannot quicksave, but I recommend backing this up anyway before proceeding.\u003C/p\u003E\u003Cp\u003E2) Having loaded the quicksave, I launched the Ike Station 1 craft and achieved a stable orbit. From there, I was able to return to KSC and enter buildings. I do not believe this ship is a problem.\u003C/p\u003E\u003Cp\u003ETo anyone else having this problem, I recommend loading your quicksave as I mentioned above, then rebuilding your craft.\u003C/p\u003E\n"}]}