{"TopicId":9439,"ForumId":32,"TopicTitle":"Fine throttle control","CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-11T00:37:40Z","PageNum":1,"Articles":[{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-11T00:37:40Z","Content":"\n\u003Cp\u003EHey all.\u003C/p\u003E\u003Cp\u003EI\\\u0027ve more or less perfected my HoveRover flight-capable rover design. It is sturdy, steady, and has a flight range (on the Mun) far greater than 50km, roving range of course is limited only to the amount of time you feel like putting into it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i43.tinypic.com/33maqaa.jpg\u0022 alt=\u002233maqaa.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOne problem I\\\u0027m running into is the inability to control the throttle position precisely. I\\\u0027m certain that there is a thrust level at which the rover would hover perfectly, neither rising nor falling, but I can\\\u0027t find it. Instead, I\\\u0027m left watching my vertical rate and babying the throttle to maintain an altitude. CAPSLOCK for precise control seems to only affect directional controls, not the throttle.\u003C/p\u003E\u003Cp\u003EIs there a solution to this, or is it simply a limitation of the game?\u003C/p\u003E\n"},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2012-04-11T00:42:50Z","Content":"\n\u003Cp\u003EMechJeb has a setting for holding altitude; have you tried it? It\\\u0027s pretty effective...\u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-11T00:44:48Z","Content":"\n\u003Cp\u003ENo, I haven\\\u0027t. It was recommended to me to solve another problem, and I looked into it. Feels too much like \u0027cheating,\u0027 to me. I suppose I\\\u0027ll need to get over it....\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2012-04-11T01:02:57Z","Content":"\n\u003Cp\u003EIf you tap the CTRL or SHIFT key rather than pushing it, you get a much smaller increment. I don\\\u0027t know if you knew this.\u003C/p\u003E\n"},{"CreatedByName":"Timmon26","CreatedById":1897,"CreatedDateTime":"2012-04-11T01:06:31Z","Content":"\n\u003Cp\u003ERemember that the weight of the vehicle is constantly lessening as you burn fuel. You\\\u0027ll need to keep throttling down slightly to hover at a given altitude.\u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-11T01:17:03Z","Content":"\n\u003Cp\u003Ere: tapping - Yes, that\\\u0027s what I\\\u0027m doing. I\\\u0027d estimate even the \u0027tap\u0027 is an increment of 5-10%, though.\u003C/p\u003E\u003Cp\u003Ere: fuel weight - I knew that instinctively, but have not been taking it into account during flight.\u003C/p\u003E\u003Cp\u003ESounds like MechJeb is the solution, just takes all the fun out of it.\u003C/p\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2012-04-11T01:22:43Z","Content":"\n\u003Cp\u003ESounds like it\\\u0027s time to get yourself a joystick. Problem solved.\u003C/p\u003E\u003Cp\u003EI know what you mean about not wanting to use MechJeb. I\\\u0027m sure it\\\u0027s a great program and tremendously useful for all sorts of things... but for me a large part of the fun in KSP comes from personally piloting all my vehicles. I don\\\u0027t want a program to do it for me.\u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-11T01:31:35Z","Content":"\n\u003Cp\u003EI\\\u0027ll be honest, White Owl. I actually went out and bought a joystick (or a keypad, or whatever the kids call them these days).\u003C/p\u003E\u003Cp\u003ETruth is, I can\\\u0027t wrap my brain around it. In traditional flight using a joystick, your main axis is horizontally oriented. In KSP, it\\\u0027s vertical. Or maybe I\\\u0027m not describing it right.\u003C/p\u003E\u003Cp\u003EAnyway, I have absolutely no idea why I can fly with a keyboard, but not a joystick.\u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-11T01:39:41Z","Content":"\n\u003Cp\u003EI wonder if the \u0027repeat delay\u0027 in Windows control panel / keyboard settings has any effect?\u003C/p\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2012-04-11T01:45:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\\\u0027ll be honest, White Owl. I actually went out and bought a joystick (or a keypad, or whatever the kids call them these days).\u003C/p\u003E\u003Cp\u003ETruth is, I can\\\u0027t wrap my brain around it. In traditional flight using a joystick, your main axis is horizontally oriented. In KSP, it\\\u0027s vertical. Or maybe I\\\u0027m not describing it right.\u003C/p\u003E\u003Cp\u003EAnyway, I have absolutely no idea why I can fly with a keyboard, but not a joystick.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know exactly what you mean. One tricky thing about using a joystick in KSP is you have to decide to assign either roll or yaw to lateral movement of the stick. Depending on what you\\\u0027re flying, and where, either roll or yaw will \u0027feel\u0027 more natural and correct. I started out flying my airplanes with rocket-style controls, but then switched to flying rockets with airplane-style controls. I would love to have an option to switch control schemes on the fly.\u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-11T04:59:14Z","Content":"\n\u003Cp\u003ECome to think of it, how useful would the MechJeb be in this situation?\u003C/p\u003E\u003Cp\u003EI\\\u0027m typically maintaining an altitude of roughly 150m off the munar surface. Given the variations of the geology of the Mun, will this plugin be able to \u0027look ahead\u0027 and anticipate the delta-V requirements for maintaining an altitude over varied terrain?\u003C/p\u003E\u003Cp\u003EI suspect not, as even as a human pilot, I find such tasks, well, taxing.\u003C/p\u003E\n"},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2012-04-11T09:00:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECome to think of it, how useful would the MechJeb be in this situation?\u003C/p\u003E\u003Cp\u003EI\\\u0027m typically maintaining an altitude of roughly 150m off the munar surface. Given the variations of the geology of the Mun, will this plugin be able to \u0027look ahead\u0027 and anticipate the delta-V requirements for maintaining an altitude over varied terrain?\u003C/p\u003E\u003Cp\u003EI suspect not, as even as a human pilot, I find such tasks, well, taxing.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you mean to keep a specific altitude above ground level or above \\\u0027sea level\\\u0027 (0m on the altimeter)?\u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-11T10:47:07Z","Content":"\n\u003Cp\u003EThe craft is designed for low-altitude munar observation. Its flight capabilities are intended to allow the pilot to easily move from feature to feature. Think of it as a munar helicopter.\u003C/p\u003E\u003Cp\u003ESo, while not specifically trying to hold any particular altitude above ground level (since I have no ground level radar), I would describe the intended flight characteristic as \u0027ground following,\u0027 primarily due to attempting to conserve energy. It flies nicely over ridges and down into craters, and I must admit that cruising through canyons is particularly fun.\u003C/p\u003E\n"},{"CreatedByName":"tncm","CreatedById":16384,"CreatedDateTime":"2012-04-11T23:11:56Z","Content":"\n\u003Cp\u003EIt looks like a very stable craft, and gratz on getting it to the moon.\u003C/p\u003E\u003Cp\u003EBut regarding the precise throttle control I couldn\\\u0027t agree more. Sometimes you need to even out Ap Pa without RCS and it can be incredibly hard. I would love precise control on throttle too. Maybe pressing TAB will lock it much like CAPS for controls. TAB should also be assigned to RCS, unlike the current CAPS.\u003C/p\u003E\n"},{"CreatedByName":"Bluejayek","CreatedById":18471,"CreatedDateTime":"2012-04-11T23:14:58Z","Content":"\n\u003Cp\u003Eit would be nice if there was another control that you could tap (that does not repeat) for 0.1 or 0.5% increments of throttle. For those of us who have a hate on for RCS thrusters but still want to do fine maneurvers like rendevous. \u003C/p\u003E\n"}]}