{"TopicId":9448,"ForumId":25,"TopicTitle":"Campaign: forum controlled KSP campaign: Space race to the Mun!!","CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-04-11T11:29:19Z","PageNum":12,"Articles":[{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2012-05-08T06:49:02Z","Content":"\n\u003Cp\u003EI would like some concrete rules about what we can and can\\\u0027t do with unmanned ships.\u003C/p\u003E\u003Cp\u003ERight now, the rule is that we can\\\u0027t land unmanned probes on the mun without at least 3 comsats in kerbin orbit and two in mun orbit but what about other stuff? Is it allowed to let a ship go out of radio contact if it is in a stable orbit or do we have to complete the mission before radio contact is lost?\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-08T07:49:18Z","Content":"\n\u003Cp\u003EThe 3/2 rule is conceptual only to help the governing of this campaign. In your game, you could fly all the way to the min and back without ANY satellite but for this campaign, a rule of 3/2 gives us the safe assumption that radio black outs are unlikely. We could extend this to min orbits but I don\\\u0027t know if you guys want to go that far.\u003C/p\u003E\u003Cp\u003E(min = mun. Stoopid auto-correct!)\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2012-05-08T13:09:58Z","Content":"\n\u003Cp\u003ESo we can send an unmanned craft to munar orbit without satellites or no?\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-08T13:27:36Z","Content":"\n\u003Cp\u003EYep. Keeping it simple. You only need wats for an unmanned landing.\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2012-05-08T16:07:57Z","Content":"\n\u003Cp\u003EI have a cheap craft that can become a munar satellite, but it will be almost no profit. (It must be the same thing DonLorenzo used for 11400000m)\u003C/p\u003E\u003Cp\u003ESo I decided to repeat my last turn.\u003C/p\u003E\u003Cp\u003EIt gets boring. Condemned pod \u002B large LFE \u002B several tanks can get almost anywhere without any real design challenge. And almost without any profit if that mission was not already claimed by something twice bigger \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-08T21:33:04Z","Content":"\n\u003Cp\u003EThis is important feedback Alchemist. What would you change to make the end-game more interesting?\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2012-05-08T23:59:33Z","Content":"\n\u003Cp\u003EMake people bring more weight on the missions. Like a pre-designed lander or something.\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2012-05-09T13:30:43Z","Content":"\n\u003Cp\u003EFirst, it could be done more rewarding for the top grade missions, if the reward was based on payload and delta v required. The base value could be proportional to these values (so that better tech would be required to actually compensate exponential craft size dependence from delta v). \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cbr\u003E[li]Note about the \u0027payload\u0027 - for just \u0027get there\u0027 and \u0027leave anything there\u0027 missions it can be just command pod, for specifically manned missions that could be pod \u002B ZO2 main, for deploying something specific it\\\u0027s the payload itself (\u002B maybe the pod if the payload doesn\\\u0027t include it)[/li]\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMaybe also add some duration multiplier for manned missions.\u003C/p\u003E\u003Cp\u003ESecond, there should be a system that makes repeating easy missions less profitable. I could propose a system where the reward consists of several components:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cbr\u003E[li]Prestige firsts - a nice bonus over the base for them who are fast enough (maybe extra 20-30%, except for some high-prestige missions): \u003Cbr\u003E If nobody has done it before, you get full reward (for some missions this can be extra large; if there are multiple entries each player could get \u003Cem\u003Efull/sqrt(N)\u003C/em\u003E. If you manage to complete higher level mission before/on the same turn as anybody completes lower level mission (like manned orbit before manned suborbital) you could also get 50% of the reward you would get if you had completed the lower grade mission this turn.\u003Cbr\u003EFor these \u0027second\u0027 that are 1 turn late to be first (but not for these that are repeating again the next turn) this reward could be not more than 50% of individual prestige reward for the firsts with total reward to them all not exceeding 75% of first turn total reward for this mission.\u003Cbr\u003E[/li]\u003Cbr\u003E[li]Individual firsts - if you do it first time in your career, you get this reward. If you jump over a mission you could get part of that mission reward. So that you can get nice reward for proving you can build a rocket that flies by reaching 16500 m, but repeating it won\\\u0027t give profit[/li]\u003Cbr\u003E[li]Limited-use practical - limited amount of experiments that don\\\u0027t need repeating. Partially accords to market laws. The reward after N completed missions could have multiplier X/(X\u002BN), where X may be different for different missions. Maybe can become 0 after N\u0026gt;5X[/li]\u003Cbr\u003E[li]Repeatable practical - this part of the reward remains constant independent of number of flights[/li]\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe repeatable (and limited with high X) part could be big for satellites and some types of probes (especially given payloads - so that it\\\u0027s like a contract with some corporations), but very small for the early atmospheric missions (that would have big individual first reward), so you can start with early missions an raise enough money for the next ones, but won\\\u0027t repeat these again and again.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-10T10:58:54Z","Content":"\n\u003Cp\u003EWelcome Saaur to the campaign. Saaur has taken his start up funds and embarked on the space adventure for fun and profit.\u003C/p\u003E\u003Cp\u003EI only got four submissions from our regulars so I replied to those four and will give the rest one more day to submit if they still wish to.\u003C/p\u003E\u003Cp\u003EThanks for that feedback Alchemist. In addition to your comments, I\\\u0027m beginning now to wish my depreciation curve was steeper so that \\\u0027old\\\u0027 missions became meaningless. Maybe I need a \\\u0027curve\\\u0027 for each player and a bonus for first - as you suggested. This would let our two new-comers to participate on an almost equal level - late - but on the same field.\u003C/p\u003E\u003Cp\u003EI\\\u0027m also thinking the tech levels are too expensive in the game end. Things are really slowing down as the cash cow is milked so the next tech level can be unlocked. Live and learn!\u003C/p\u003E\u003Cp\u003EWe had a \\\u0027first\\\u0027 this turn - STCatto managed to leave his unmanned probe in Mun orbit. He wasn\\\u0027t brave enough to attempt a landing as there is no reliable network coverage so he put the probe in \\\u0027park\\\u0027 and left it at that! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Two more corporations left space junk in Kerbin orbit. Kessler would be proud! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\\\u0027ll post the full mission report tomorrow in case some late comers wish to still submit. I\\\u0027ve emailed balances to those that got their turn in on time. Thx!!\u003C/p\u003E\n"},{"CreatedByName":"Crowzone","CreatedById":20194,"CreatedDateTime":"2012-05-10T18:00:33Z","Content":"\n\u003Cp\u003EI really enjoyed my run in this campaign but I\\\u0027m officially withdrawing until the next one. I agree with a lot of the assessments here - and feel that after my previous setback I\\\u0027ve fallen into a kind of middle ground with no hope of pulling out of. So one of you guys hurry up and land on the Mun and win this thing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy number one concern / reason for withdrawing is the cost/reward ratio - This particular campaign is working alright, but the way that rewards are paid out encourage ultra slim, fly by the seat of your pants, craft, and though there is definite skill involved in that, it means that there is very little differentiation between players as everyone ends up settled into one or two design choices for most missions. This kind of uber efficiency has a place, but my own enjoyment comes more from building neat ships to get the jobs done, not necessarily the cheapest one. This became exaggerated rapidly in this campaign after tech 4 which allowed people to drop the one craft requirement (ZOx) which drove ship prices down both in the cost of the component AND in the reduced weight not having to have that component meant. Basically once a few players got Tech4 they could accomplish new missions at much cheaper costs than people still at tech 3, and therefore drive rewards down for new missions. \u003C/p\u003E\u003Cp\u003EMy suggestion for pushing the campaign away from this always build the cheapest possible craft would be to make missions slightly more complicated. The ZOx requirement was a good idea and step in the correct direction, and should be added onto. \u003C/p\u003E\u003Cp\u003EFor Example:\u003C/p\u003E\u003Cp\u003EIncluded for ALL missions - a 1.5x multiplier if the mission is a Campaign First\u003C/p\u003E\u003Cp\u003EDepreciation for repeat missions is factored at 1 - 0.n X Reward where n=number of times a company has repeated the mission (0 for first time)\u003C/p\u003E\u003Cp\u003EFly to a minimum altitude of 70,000m (Reward 7500) \u003C/p\u003E\u003Cp\u003E - Include Multistage Design (Bonus 1000)\u003C/p\u003E\u003Cp\u003E - Detach some kind of atmospheric probe at apogee (Bonus 5000)\u003C/p\u003E\u003Cp\u003E - Return to Kerbin with a max G-Force experience of \u0026lt; 2.5 (Bonus 2500)\u003C/p\u003E\u003Cp\u003EBy including Optional objectives the missions become more diverse, and could be included in such a way that it is very unlikely that some could be accomplished right away (Example above is the atmospheric probe bonus - at low tech ranges you may not have access to a probe, therefore this mission would be valuable to revisit later for the 5000 bonus)\u003C/p\u003E\u003Cp\u003E**Note: Numbers are arbitrary in this example.\u003C/p\u003E\u003Cp\u003E**Edit: Accidentally submitted before finished.\u003C/p\u003E\n"},{"CreatedByName":"Saaur","CreatedById":4298,"CreatedDateTime":"2012-05-10T18:34:31Z","Content":"\n\u003Cp\u003EOne thing I\\\u0027m running into, especially at the low levels, is that decouplers of both variety are so expensive as to be useless. Which encourages stupid ship designs.\u003C/p\u003E\u003Cp\u003EEDIT: As an example, I have so little money after my first mission that if I buy tech 1 and 2 (tech 1 by itself is useless) I can\\\u0027t build a ship to use it. So I\\\u0027m probably going to have to re-enter my first turn ship again. I\\\u0027ll see if I can do anything interesting with a tricoupler and SRBs but it doesn\\\u0027t seem plausible, really.\u003C/p\u003E\u003Cp\u003ERE-EDIT: Can I buy tech 2 without getting tech 1 first?\u003C/p\u003E\n"},{"CreatedByName":"Crowzone","CreatedById":20194,"CreatedDateTime":"2012-05-10T19:10:54Z","Content":"\n\u003Cp\u003ENo, you have to buy the techs in order.. What you may not have discovered yet is that you CAN stage without decouplers by using your SRBs to intentionally overheat the one below it causing it to blow up - this is a trick that we all learned in the early campaign.\u003C/p\u003E\u003Cp\u003EIE - Put your capsule on top of a stack of 3 SRBs, and set stages for each SRB so they fire one at a time. Then as the first SRB is about to run out of fuel (You have to time it properly) activate the 2nd SRB which forces the first SRB to overheat and explode, effectively removing that dead weight.\u003C/p\u003E\n"},{"CreatedByName":"Crowzone","CreatedById":20194,"CreatedDateTime":"2012-05-10T19:23:23Z","Content":"\n\u003Cp\u003EI just had another thought regarding the costs of Tech Levels. \u003C/p\u003E\u003Cp\u003EWhat if, during a campaign, you made it such that once a tech level was purchased by someone - the next turn, the price of development for that tech level was halved, as were all tech levels below it.\u003C/p\u003E\u003Cp\u003EThis would mean that it would allow newcomers an easier time \u0027catching up\u0027 to front runners, and so reduction of the payouts for earlier missions wouldn\\\u0027t hurt them as much. It also makes a sort of logical sense - in the real world, once someone develops or engineers a technology, many other companies have an easier time reproducing said technology on their own.\u003C/p\u003E\u003Cp\u003EA company trying to stay on the bleeding edge of technology would pay that price, and more conservative companies could reap the benefits of being behind a turn but paying somewhat less. If multiple companies bought a tech level the same turn they would all pay the original price, and would be considered simultaneous discoveries.\u003C/p\u003E\u003Cp\u003EThis reduction in cost would happen EVERY time a new tech level was purchased:\u003C/p\u003E\u003Cp\u003EAfter Tech 1 is purchased, at 1000, it becomes only 500 from that turn on.\u003C/p\u003E\u003Cp\u003EOnce Tech 2 is purchased at 2000, it becomes 1000, and Tech 1 is halved again (as it is even more trivial now) to 250\u003C/p\u003E\u003Cp\u003EThen Tech 3 comes along at 4000, it becomes 2000, and Tech 2 is now 500, and Tech 1 becomes 125 (And so on and so forth) \u003C/p\u003E\u003Cp\u003EIf you played it out this way, you could PROBABLY increase the original costs of some of the earlier tech levels, though I feel like the later tech levels are priced appropriately.\u003C/p\u003E\n"},{"CreatedByName":"Saaur","CreatedById":4298,"CreatedDateTime":"2012-05-10T19:24:21Z","Content":"\n\u003Cp\u003EOh sure, I did that fors my first rocket. Problem is, I can\\\u0027t afford to do anything different for the second round unless I (maybe) stack an extra SRB under there. Which I don\\\u0027t think will get me to my next milestone. So I resubmit my same ship for the same result, get a little less money for it, and try again next round.\u003C/p\u003E\u003Cp\u003EUm, boring much?\u003C/p\u003E\n"},{"CreatedByName":"Lord Wasteland","CreatedById":14093,"CreatedDateTime":"2012-05-11T00:26:49Z","Content":"\n\u003Cp\u003ECan I possibly play?\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-11T00:38:25Z","Content":"\n\u003Cp\u003ESure - you\\\u0027d be the 3rd play to join mid-late game. You might find it challenging but this is all for learning and for improvement. If it\\\u0027s too hard - we need to know!! Read the first post and check the excel spreadsheet.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-11T23:36:27Z","Content":"\n\u003Cp\u003E[pre]\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Player | Balance | Spent | Income | NewBalance | Turn | Claimed | Profit |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Alchemist | 8514 | 3025 | 7257 | 12746 | 8 | Leave object in orbit | 4232 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Awaras | 7540 | 6275 | 8158 | 9423 | 8 | Leave object in Mun orbit | 1883 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| DonLorenzo | 9330 | 2575 | 7327 | 14082 | 8 | 16,500 meters up | 4752 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Rickenbacker | 6124 | 1000 | 0 | 5124 | 8 | Techlevel 1 | -1000 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Rickenbacker | 5124 | 4722 | 7327 | 7729 | 8 | 16,500 meters up | 2605 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Saaur | 5100 | 4722 | 7327 | 7705 | 8 | 16,500 meters up | 2605 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Sjwt | 18820 | 3700 | 7327 | 22447 | 8 | 16,500 meters up | 3627 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| STCatto | 6255 | 4250 | 7257 | 9262 | 8 | Leave object in orbit | 3007 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| UmbralRaptor | 8536 | 2575 | 6996 | 12957 | 8 | 35,000 meters up | 4421 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E[/pre]\u003C/p\u003E\u003Cp\u003EThere is a lot of fund raising going on in this turn and the last. Sjwt is distracted by real life (the shame!) and is amassing a lot of cash. I sense an important tech level unlock very soon! People have mentioned before that the unlock of tech for one should unlock the tech for the rest (after a time delay and different cost). I think that would speed this end game up.\u003C/p\u003E\u003Cp\u003EQuestion, should the Federal Government of Kerbin do a one time injection of cash to all corporations so all this wheel spinning is reduced?\u003C/p\u003E\u003Cp\u003ETurn 9 closes Tuesday morning in the USA.\u003C/p\u003E\n"},{"CreatedByName":"sjwt","CreatedById":9268,"CreatedDateTime":"2012-05-15T10:34:56Z","Content":"\n\u003Cp\u003EWoot I get to put a turn in this round!\u003C/p\u003E\u003Cp\u003EHEADLINE: SKRAM BACK IN THE GAME! - Ground braking penny pinching mission launched!\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-15T11:22:37Z","Content":"\n\u003Cp\u003ESo not a lot happened this turn. A few have dropped out and the 16.5 KM mission is plaguing the end game. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think at this rate, the campaign end is going to be a long way off and unexciting. I\\\u0027ll see how many people wish to continue into turn 10. If there aren\\\u0027t many then I\\\u0027ll call the campaign to an end and declare a winner. We can then compare notes and discuss what would have worked better.\u003C/p\u003E\u003Cp\u003E[pre]\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Player | Balance | Spent | Income | NewBalance | Turn | Claimed | Profit |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Awaras | 9423 | 2575 | 7327 | 14175 | 9 | 16,500 meters up | 4752 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| DonLorenzo | 14082 | 2575 | 7327 | 18834 | 9 | 16,500 meters up | 4752 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Saaur | 7705 | 4722 | 7327 | 10310 | 9 | 16,500 meters up | 2605 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Sjwt | 22447 | 8000 | 0 | 14447 | 9 | Tech level 4 | -8000 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| Sjwt | 14447 | 2500 | 7327 | 19274 | 9 | 16,500 meters up | 4827 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E| STCatto | 9262 | 2575 | 6836 | 13523 | 9 | 70000 meters | 4261 |\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan\u003E------------------------------------------------------------------------------------------------------------------------------------------------------------------\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E[/pre]\u003C/p\u003E\n"},{"CreatedByName":"DonLorenzo","CreatedById":13642,"CreatedDateTime":"2012-05-15T11:53:10Z","Content":"\n\u003Cp\u003EI\\\u0027ll soldier on, but you\\\u0027re right it\\\u0027s not very exciting going 16,5kms up time and again.\u003C/p\u003E\u003Cp\u003EI think, apart from the issues touched upon earlier in this thread one of the problems is that zox panels are unavailable, basically eliminating the possibility for extended orbit or deep space manned missions. The missions also don\\\u0027t have any \\\u0027beef\\\u0027 on them, the orbit missions require orbits at low altitudes and the satellite missions require only the one part to be left behind, together with the expensive decouplers this heavily favors SSTE (single stage to everything) craft which are also not very exciting. \u003C/p\u003E\u003Cp\u003EJust my thought.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2012-05-15T12:24:14Z","Content":"\n\u003Cp\u003EI also plan to continue the campaign, but to do anything meaningful (prolonged manned missions, signal relay satellites) we have to unlock tech level 5, which means saving up money, which means doing the most profitable thing, which means... 16.5... :\\\u0027(\u003C/p\u003E\u003Cp\u003EAlso, pretty much everyone uses mechjeb, which makes things like SAS, ASAS, winglets and the gimballed engine practically useless, which means that the only useful thing we get from tech level 4 is the unmanned pod, which we can\\\u0027t use to its full potential before we unlock the level 5 powersats, and then we also get the ZO2 solar panels which make unmanned pods (almost) unnecessary.\u003C/p\u003E\u003Cp\u003EI think that powersats should have been tech level 3 or 4 instead of 5. That might have made the campaign more dynamic. \u003C/p\u003E\u003Cp\u003EThe Kerbal press must really enjoy a fireworks show... In the real world, almost nobody watched the broadcasts of the Apollo 13 mission before the accident occurred because most people thought it was routine and boring. \u0027Another moon landing? Ho hum...\u0027\u003C/p\u003E\u003Cp\u003EIf I were you togfox, I would step in and announce that all suborbital flights have become uninteresting to the public and that they will not bring any more money from now on... That might shake things up a little. \u003C/p\u003E\n"},{"CreatedByName":"STCat","CreatedById":10468,"CreatedDateTime":"2012-05-15T14:22:31Z","Content":"\n\u003Cp\u003EGuys, i\\\u0027m leaving. Last night unidentified force had performed sudden strike to STCatto corporation, killing all staff and eliminating every material estates.\u003C/p\u003E\n"},{"CreatedByName":"Saaur","CreatedById":4298,"CreatedDateTime":"2012-05-15T22:41:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf I were you togfox, I would step in and announce that all suborbital flights have become uninteresting to the public and that they will not bring any more money from now on... That might shake things up a little.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept that it would totally hose anyone who got into the game late and CAN\\\u0027T get into orbit because of tech limitations.\u003C/p\u003E\n"},{"CreatedByName":"sjwt","CreatedById":9268,"CreatedDateTime":"2012-05-16T07:03:23Z","Content":"\n\u003Cp\u003ERather than cash injections or banning some flights, just increase the pay out for all orbital missions by say 3k, and Muner missions by 5k, if you do it for the current turn and extend the round time.. It will move us quite a bit forwards.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-17T08:43:14Z","Content":"\n\u003Cp\u003EOkay - how about we make Power sats tech level 4 instead of 5, effective immediately, and if anyone wishes to refly the current turn with this information then go for it. I\\\u0027m hoping this might get two or three sats into orbit - who knows. Also - how close are people to doing a manned landing on the Mun? The technology exists - are the cash balances too small?\u003C/p\u003E\u003Cp\u003EShould we close this turn in two days time? Saturday morning in the USA?\u003C/p\u003E\n"}]}