{"TopicId":94598,"ForumId":36,"TopicTitle":"[0.90] KSP Interstellar port maintance thread","CreatedByName":"Boris-Barboris","CreatedById":133181,"CreatedDateTime":"2014-12-26T19:38:57Z","PageNum":29,"Articles":[{"CreatedByName":"LividPumpkin","CreatedById":133424,"CreatedDateTime":"2015-05-21T14:23:26Z","Content":"\n\u003Cp\u003Ecan you be more \u003Cspan style=\u0022color:#333333;\u0022\u003Especific please ? what do you mean about the cfg which cfg should i tell to Active Texture Management to ignore ?\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2015-05-21T15:04:35Z","Content":"\n\u003Cp\u003EAdmins, please put a close on this tread, it is out of date\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-05-21T18:50:08Z","Content":"\n\u003Cp\u003EIs Boris not planning on coming back for this? Sorry I\u0027ve been so out-of-the loop: long hours at work, a lot of time sick, and a Duna mission I\u0027m trying to squeeze out in 0.90 before updating to 1.0 (which I\u0027ll be publishing to YouTube- which has also meant a lot of time spent on video editing and soundtrack-selection...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Reverend","CreatedById":108904,"CreatedDateTime":"2015-05-28T20:35:06Z","Content":"\n\u003Cp\u003ELast activity: 23rd May 2015 19:18\u003C/p\u003E\n"},{"CreatedByName":"Ozy","CreatedById":141985,"CreatedDateTime":"2015-05-30T12:43:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FreeThinker\u0022 data-cite=\u0022FreeThinker\u0022\u003E\u003Cdiv\u003EAdmins, please put a close on this tread, it is out of date\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis mod still works fine under 0.90. This thread isn\u0027t yours to close, just because you\u0027re developing a competitor.\u003C/p\u003E\n"},{"CreatedByName":"Shiolle","CreatedById":145306,"CreatedDateTime":"2015-05-30T17:11:07Z","Content":"\n\u003Cp\u003EI have a problem with Deuterium-Tritium Cryostat: both fuels are boiling off even though I have uninterrupted power supply for them. Here is how it looks like:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/7z351r5np/full/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s10.postimg.org/vdb4donl5/Tritium_Boiling_Off.png\u0022 alt=\u0022Tritium_Boiling_Off.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDescription in the VAB says it shouldn\u0027t boil off when powered. The power comes from KIWI reactor attached to electrical generator. Am I missing something here?\u003C/p\u003E\u003Cp\u003EI use KSP Interstellar maintenance 0.136 release with KSP 0.9.\u003C/p\u003E\n"},{"CreatedByName":"Murdabenne","CreatedById":142825,"CreatedDateTime":"2015-05-31T05:52:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ozy\u0022 data-cite=\u0022Ozy\u0022\u003E\u003Cdiv\u003EThis mod still works fine under 0.90. This thread isn\u0027t yours to close, just because you\u0027re developing a competitor.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe presence of this and the other mod sure is confusing to those of us using 1.02 and new to the game. I came in here after reading about KSPI, and thought it was for the version of the game I bought at regular release (1.0). But this doenst work with that, it is old and outdated from that point of view - as in 0.90 is using pre-release models for a lot of things and is a somewhat different game, as well as not being maintained anymore. Basically this is a legacy mod for a legacy program. And unless its being actively developed, the other author may have a point about closing the thread if the mod author is no longer active in this mod, to redirect effort over to the current release and the continuation/expansion of this.\u003C/p\u003E\u003Cp\u003ENow, all that being said, It would be nice to have this available and updated into 1.02 as an alternative - the more the merrier is the better attitude. Plus this seems to be less complex and more game-like than the KSPI-E which seems more Sim like. I do prefer the former, and am working my way through the many mods to find what I like best, and prune the bits I dont use, especially in career mode. Which means in the end, it would be nice to continue this thread for the right reasons.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-31T06:10:50Z\u0022 title=\u002205/31/2015 06:10  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 31, 2015\u003C/time\u003E by Murdabenne\u003C/strong\u003E\n\u003C/span\u003E\n"}]}