{"TopicId":94608,"ForumId":36,"TopicTitle":"Making a cockpit","CreatedByName":"Vectura","CreatedById":119212,"CreatedDateTime":"2014-12-26T20:35:53Z","PageNum":1,"Articles":[{"CreatedByName":"Vectura","CreatedById":119212,"CreatedDateTime":"2014-12-26T20:35:53Z","Content":"\n\u003Cp\u003EI have a few questions:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EWhat do I add in Unity to give it a useable hatch?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhat do I add in Unity to give it a useable ladder?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhen making the inside how do I get the seats to be the right size and shape? Can I just add them in from Unity like the control panel stuff?\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"artwhaley","CreatedById":118388,"CreatedDateTime":"2014-12-26T20:43:59Z","Content":"\n\u003Cp\u003EThis thread has the answers you need : \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94638-New-Mod-Development-Links-Compilation\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/94638-New-Mod-Development-Links-Compilation\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn particular, the video tutorials by nli2work are exactly what you want- step by steps on the whole cockpit process, including ladders and airlocks(hatches). There\u0027s also a text tutorial further down, under ladders. The short version is - you add box colliders in Unity that define the space a kerbal will be occupying when he\u0027s able to grab the hatch and the ladder, with the z axis pointing up, the way he\u0027d climb. You set these colliders as triggers, and put them in the correct layers. \u003C/p\u003E\u003Cp\u003EYes, making your seats as props and adding them in Unity at the same time as the control panel props is a great way to do it, because they remain moveable and resizeable during testing, whereas if you modelled them into the pod\u0027s interior model initially, you have to go all the way back to your 3d modelling step to move them if you see the kerbal\u0027s head clipping through something! I don\u0027t think the stock game comes with a seat prop, so you\u0027ll either have to model it yourself, then make it a prop (again, nli2work\u0027s tutorials show you how to make your own prop!) or use one already done (The ASET props pack has a great flight seat in it, along with other awesome cockpit gizmos!)\u003C/p\u003E\n"},{"CreatedByName":"Vectura","CreatedById":119212,"CreatedDateTime":"2014-12-26T20:48:48Z","Content":"\n\u003Cp\u003EThanks! Back to Blender then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}