{"TopicId":94882,"ForumId":69,"TopicTitle":"Crash when staging TR-38-D","CreatedByName":"GTHvidsten","CreatedById":67398,"CreatedDateTime":"2014-12-29T14:48:31Z","PageNum":1,"Articles":[{"CreatedByName":"GTHvidsten","CreatedById":67398,"CreatedDateTime":"2014-12-29T14:48:31Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EKSP Version:\u003C/strong\u003E v0.90.0.705 OSX 10.9.4\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat Happens:\u003C/strong\u003E Game crashes\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMods / Add-Ons:\u003C/strong\u003E All Stock\u003C/p\u003E\u003Cp\u003EI have built myself a rocket and it launches just fine, but when it is time for the first staging the game crashes.\u003C/p\u003E\u003Cp\u003EThis has started happening on 0.90 and I don\u0027t remember any of these crashes happening before.\u003C/p\u003E\u003Cp\u003EI have only one flight in progress (the one I\u0027m launching).\u003C/p\u003E\u003Cp\u003EThe complete error message as reported from OSX can be found in \u003Ca href=\u0022http://pastebin.com/uX351r5T\u0022 rel=\u0022external nofollow\u0022\u003Ethis pastebin\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m on a Mid 2010 MacBook Pro, 8GB RAM\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-30T18:31:55Z\u0022 title=\u002212/30/2014 06:31  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 30, 2014\u003C/time\u003E by GTHvidsten\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GTHvidsten","CreatedById":67398,"CreatedDateTime":"2014-12-30T16:52:00Z","Content":"\n\u003Cp\u003EUpdate:\u003C/p\u003E\u003Cp\u003EI created a new sandbox and recreated the rocket, and everything started working again.\u003C/p\u003E\u003Cp\u003EAfter having launched a variety of rockets I quit the game.\u003C/p\u003E\u003Cp\u003ENow, I just started it again, built another rocket and launched it. Everything worked just fine until I got to the staging where it once again crashed.\u003C/p\u003E\u003Cp\u003EThis most recent rocket first stage was with radial decouplers, which worked just fine, but when I decoupled the TR-38-D the game crashes.\u003C/p\u003E\u003Cp\u003EDecoupling the TR-38-D is the part that created problems for my first post (but it worked fine in the new sandbox up until it didn\u0027t).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pastebin.com/tUXPfMpd\u0022 rel=\u0022external nofollow\u0022\u003EPastebin of recent crash\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-12-30T19:03:49Z","Content":"\n\u003Cp\u003ETo confirm, this is with the TR-38 D only and if you use a smaller decouper there are no crashes? If so, I suspect that it\u0027s related to some weirdness in the TR-38 D\u0027s part.cfg file.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-12-30T19:48:30Z","Content":"\n\u003Cp\u003EWell, this was a broken thing a few versions ago but has since been fixed.\u003C/p\u003E\u003Cp\u003ESo I suppose what we would need is all the relevant info again. Log files are good, but if you have pictures of your craft (or the .craft file itself) that can help us replicate. As well as telling us what you were doing before launch. Or if you find a way to make it completely repeatable.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m less familiar with Mac, but that log file isn\u0027t usually the useful one. Can you see if this file exists?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMac OSX: Open Console, on the left side of the window there is a menu that says \u0027files\u0027. Scroll down the list and find the Unity drop down, under Unity there will be Player.log Aka Files\u0026gt;~/Library/Logs\u0026gt;Unity\u0026gt;Player.log\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"GTHvidsten","CreatedById":67398,"CreatedDateTime":"2014-12-30T20:33:09Z","Content":"\n\u003Cp\u003ESeeing as I can create a new (sandbox) game, create a rocket with a TR-38 D and launch it successfully, I doubt the problem is with the part.cfg file. Had that been the case it would always crash when separating with a TR-38 D.\u003C/p\u003E\n"},{"CreatedByName":"GTHvidsten","CreatedById":67398,"CreatedDateTime":"2014-12-30T20:45:32Z","Content":"\n\u003Cp\u003EI haven\u0027t found a reproducable way to reproduce this error, but here is the player.log and craft file.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pastebin.com/y0HvwEUT\u0022 rel=\u0022external nofollow\u0022\u003EUnity player.log\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0B0Tb9IAMpQUhWmdJTnl1bk1TSmc/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003ECraft file\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EApart from these files there\u0027s what is already described.\u003C/p\u003E\u003Cp\u003EI create a new sandbox, create a rocket and launch it. I create another rocket and launch it.\u003C/p\u003E\u003Cp\u003EI quit the game.\u003C/p\u003E\u003Cp\u003EI start the game and load the same sandbox.\u003C/p\u003E\u003Cp\u003ECreate a rocket, launch it, and it crashes on separating the TR-38-D.\u003C/p\u003E\u003Cp\u003EI don\u0027t know if quitting and restarting the game actually has any effect, but this is what I did before the game crashed.\u003C/p\u003E\n"}]}