{"TopicId":94921,"ForumId":20,"TopicTitle":"Use a single part from a mod","CreatedByName":"soifua","CreatedById":131991,"CreatedDateTime":"2014-12-29T22:20:26Z","PageNum":1,"Articles":[{"CreatedByName":"soifua","CreatedById":131991,"CreatedDateTime":"2014-12-29T22:20:26Z","Content":"\n\u003Cp\u003EI\u0027m sure this has been asked and answered, so I apologize for that, but I\u0027m a newb and I can\u0027t find it anywhere in the forum. \u003C/p\u003E\u003Cp\u003EIf I have a mod installed, how can I delete everything, but the parts that I want? I tried this with the FASA mod and failed. It\u0027s a beautiful mod, but I dont need the parts bogging me down, but I really want the geiger counter. I was able to find the part and delete everything else. The part shows up in the part list. I can add it to ships, but it is nonfunctional, so clearly I\u0027m missing something. I\u0027m guessing it\u0027s one of the .cfg files, but I don\u0027t know a) if that\u0027s right or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E which one it is and what to do with it. \u003C/p\u003E\u003Cp\u003EAll help appreciated. \u003C/p\u003E\u003Cp\u003Ethanks,\u003C/p\u003E\u003Cp\u003ESoifua\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-12-29T22:26:46Z","Content":"\n\u003Cp\u003EWell you can\u0027t delete everything hehe and some mods share alot of textures to save space but if that all you want let me look real quick.\u003C/p\u003E\u003Cp\u003EEDIT- You need the Resources folder and better when you do things like this if you keep the folder path the same.\u003C/p\u003E\u003Cp\u003EEDIT- You did keep the FASA_Probe_Parts folder.\u003C/p\u003E\u003Cp\u003EEDIT- If that all you want you need the FASA folder you can delete all but Resources and Probes and in the probe you can delete all but the FASA_Probe_Parts folder hope it helps.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T22:35:42Z\u0022 title=\u002212/29/2014 10:35  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by Mecripp2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-12-29T22:32:16Z","Content":"\n\u003Cp\u003EMost of the time you can simply delete the parts you don\u0027t need but you should keep all other files. Many mods come with their own plugins. With that file gone the parts won\u0027t function.\u003C/p\u003E\u003Cp\u003EAnd as Mecripp already said other mods might reply on the same plugins as well.\u003C/p\u003E\u003Cp\u003EBefore deleting parts \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EALWAYS\u003C/strong\u003E\u003C/span\u003E make a backup from your persistent.sfs. Craft with a missing part will be deleted without warning. (By the time you do get a warning it\u0027s already too late.)\u003C/p\u003E\u003Cp\u003EIf something goes wrong simply re-install the mod and revert to your backup.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T22:35:28Z\u0022 title=\u002212/29/2014 10:35  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by Tex_NL\u003C/strong\u003E\n\u003C/span\u003E\n"}]}