{"TopicId":94942,"ForumId":55,"TopicTitle":"Rearranging the KSC building layout","CreatedByName":"Cronicler","CreatedById":102724,"CreatedDateTime":"2014-12-30T00:46:31Z","PageNum":1,"Articles":[{"CreatedByName":"Cronicler","CreatedById":102724,"CreatedDateTime":"2014-12-30T00:46:31Z","Content":"\n\u003Cp\u003EWith the new KSC upgrade system going live, the way KSC buildings are placed has spawned a bit of an issue for the early game. As you are all aware, while the final / fully upgraded layout is extremely pleasing to the eye;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-xpa1/t31.0-8/p640x640/10903900_10153544782512814_4858968523994930232_o.jpg\u0022 alt=\u002210903900_10153544782512814_4858968523994930232_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe starting layout is a bit problematic:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://scontent-a-fra.xx.fbcdn.net/hphotos-xpa1/t31.0-8/p640x640/10866029_10153544782352814_8243328707692039577_o.jpg\u0022 alt=\u002210866029_10153544782352814_8243328707692039577_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Enow, the root of the problem stems from an actually right decision of not moving the clickable locations around with each upgrade and needlessly forcing the player to hunt for the moving building locations. Unfortunately, in the current layout, this creates a lot of empty spaces. \u003C/p\u003E\u003Cp\u003EI think the the solution to this might lie in the placements of the the tracking station, admin building and the launch pad. \u003C/p\u003E\u003Cp\u003EIf we crop these buildings from their current locations; \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://scontent-a-fra.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/10898020_10153544780807814_3418243978670606498_n.jpg?oh=8df7ec5b8f62f0aa23180d4356e61488\u0026amp;oe=5542B70F\u0022 alt=\u002210898020_10153544780807814_3418243978670606498_n.jpg?oh=8df7ec5b8f62f0aa23180d4356e61488\u0026amp;oe=5542B70F\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd move them like so;\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://scontent-b-fra.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/1503851_10153544780862814_6454937567043523733_n.jpg?oh=cc3a0eda243d410bab6d7931a97b4c55\u0026amp;oe=552C0575\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://scontent-b-fra.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/1503851_10153544780862814_6454937567043523733_n.jpg?oh=cc3a0eda243d410bab6d7931a97b4c55\u0026amp;oe=552C0575\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethe zones can be kept consistent with some creative usage of landscaping while the low level buildings can be moved closer to the S1\u0026amp;S4 building (as Flagpole is the focal point of KSC) in their respective areas, giving a tighter layout that would feel organically expanding as time goes on.\u003C/p\u003E\u003Cp\u003Ewhat are your thoughts on this and apologies for the paintshop job, I\u0027m not at home and don\u0027t have anything available on the old laptop I\u0027m using right now.\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2014-12-30T01:17:29Z","Content":"\n\u003Cp\u003EWouldn\u0027t moving the admin building so that it\u0027s forward of the science complex in the gap to the tracking station solve the problem just as well?\u003C/p\u003E\u003Cp\u003EBetter still allow us to not ever build the admin building and move contracts that gap.\u003C/p\u003E\u003Cp\u003EOh and remove any surplus roads while they are overhauling the models it\u0027s odd how some have strange ring roads from day one, while others develop sensible ring roads during the upgrade path. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cronicler","CreatedById":102724,"CreatedDateTime":"2014-12-30T01:36:48Z","Content":"\n\u003Cp\u003Emattinoz;\u003C/p\u003E\u003Cp\u003ENot really. The center of the yellow hexagon (the area between the flagpole and the kerbalnaut complex) is the focal point of the KSC. All of the buildings* need to be dragged as close as possible to that location so that as they grow in size and start sprawling, it feels more organic and plausible.\u003C/p\u003E\u003Cp\u003E*the only exception is the tracking station which needs clear LOS for it\u0027s tracking domes, when they are built. This can be achieved by moving it like this; \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://scontent-a-fra.xx.fbcdn.net/hphotos-xap1/v/t1.0-9/10898250_10153544917962814_2163466160674786430_n.jpg?oh=1104762b4f51882e9a258b426efd8de0\u0026amp;oe=54FDE90A\u0022 alt=\u002210898250_10153544917962814_2163466160674786430_n.jpg?oh=1104762b4f51882e9a258b426efd8de0\u0026amp;oe=54FDE90A\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe blue triangle area is the tier 0 / 1 tracking station (basically a combination of the island runway tower at the triangle,a cluster of a quonset hut or three southwest of the tower and a radio tower (similar to b9\u0027s suggestion) south of the blue triangle, at the location of t3 building.)\u003C/p\u003E\n"},{"CreatedByName":"Amahula","CreatedById":132959,"CreatedDateTime":"2014-12-30T13:41:07Z","Content":"\n\u003Cp\u003EI would support this. The current KSC looks kinda weird with the small buildings so far apart. This would look a lot better with the buildings initially closer together.\u003C/p\u003E\u003Cp\u003EBUT: I do want the barn. Not just the same buildings rearranged (but that\u0027s just my opinion)\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-30T14:14:38Z","Content":"\n\u003Cp\u003EMoving buildings closer to the runway and moving the launchpad closer to the buildings strike me as Bad Ideas. It\u0027s not clear to me what problem the proposed layout solves.\u003C/p\u003E\n"},{"CreatedByName":"Cronicler","CreatedById":102724,"CreatedDateTime":"2014-12-30T15:48:21Z","Content":"\n\u003Cp\u003ERed Iron Crown;\u003C/p\u003E\u003Cp\u003EI think we might have a slight miscommunication, I don\u0027t want to move the buildings closer to the runway or the launch pad. As you said, that is a patently bad idea.\u003C/p\u003E\u003Cp\u003EWhat Ã„Â± would like to see is eliminating the empty \u0022will be filled later on\u0022 spaces that can be observed in the initial building layout (the second picture) and the why is by keeping the kerbalnaut complex as the focal point and arranging the initial buildings (inside their own zones) closer to the kerbalnaut building and eliminating a very large chunk of the roads.\u003C/p\u003E\u003Cp\u003EWhen rearranged in such a manner, tracking station and the admin/contracts building are the only 2 buildings whose initial placement still feel a bit off. To solve this, I propose moving the admin building\u0027s zone to the west side of the ksc, to the north of the boundary between strategy office and kerbalnaut center.\u003C/p\u003E\u003Cp\u003EFor the tracking station, I thought, \u0022why would the kerbals put the initial station to such a far away location?\u0022 because there isn\u0027t any real LOS blockers (other than the Barn) that would prompt such a decision. So, going by the inevitable decision chain of startups, if taskmistress El Necessity wasn\u0027t the culprit, then her nieces, El laziness and El cheapness must be the cause: There must have been an existing building there !\u003C/p\u003E\u003Cp\u003Enow, if Squad had been going for a PeenemÃƒÂ¼nde style industrial look for the tier 0 stuff, I could have easily gone with: \u0022Oh, there were some tanks that used to hold the liquid waste products from the factory but they are all gone now.\u0022 and not have any problems with having the tracking station in it\u0027s original position but from what I\u0027ve been able to understand (an admittedly limited capability of mine, I\u0027ll freely admit, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ) Jeb and Co will be descending onto an abandoned farm so such an outbuilding cluster would be out of place.\u003C/p\u003E\u003Cp\u003EThat\u0027s why I turned my attention to the (south of) runway (,northeast of VAB) area. There, I could easily explain the existence of a pair or trio of existing buildings, which could have been augmented by a few quonset huts and turned into a makeshift tracking station. \u003C/p\u003E\u003Cp\u003EThe problem with that approach is, as you mentioned, putting it too close to the launch pad so I just moved the launch pad a south (and slightly west) near to the original location of the tracking center (and that part of the mspaint masterpiece is not really up to scale. Wrote that post and created the visuals on a coal powered laptop. Sorry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E ).\u003C/p\u003E\n"},{"CreatedByName":"Amahula","CreatedById":132959,"CreatedDateTime":"2014-12-30T15:50:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EMoving buildings closer to the runway and moving the launchpad closer to the buildings strike me as Bad Ideas. It\u0027s not clear to me what problem the proposed layout solves.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is that the buildings are too small and too far apart. It makes it look awkward in my opinion. By putting the buildings closer together and expanding outwards it doesn\u0027t look that weird in the beginning, while the buildings do not get closer together when you upgrade them.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-30T15:59:54Z","Content":"\n\u003Cp\u003EAh, it\u0027s an aesthetic thing. I don\u0027t really see the buildings getting much closer together in the proposed layout, only the admin building would be significantly affected.\u003C/p\u003E\u003Cp\u003EI agree that it\u0027s the roads that make it look odd moreso than the building spacing.\u003C/p\u003E\n"},{"CreatedByName":"Cronicler","CreatedById":102724,"CreatedDateTime":"2014-12-31T16:46:24Z","Content":"\n\u003Cp\u003ERed, my replies seem to be lost in the ether. I\u0027ll repost them again\u003C/p\u003E\n"}]}