{"TopicId":95045,"ForumId":69,"TopicTitle":"Symmetry Automatically Switching to \u0026quot;Radial\u0026quot; in SPH","CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-12-30T20:32:00Z","PageNum":1,"Articles":[{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-12-30T20:32:00Z","Content":"\n\u003Cp\u003EThere has been much joy over the new \u0022selectable symmetry\u0022 in 0.90. I, too, thought this would be a Good Thing. Sadly, KSP seems to have its own ideas about what symmetry I \u0022should\u0022 be using in the SPH--and that symmetry, apparently, is RADIAL. Whether that\u0027s what I think I \u0022should\u0022 want or not.\u003C/p\u003E\u003Cp\u003EThe design I have in mind uses FL-series LFO tanks, which admittedly are \u0022rocket\u0022 parts rather than \u0022plane\u0022 parts. This may be contributing to the issue. At any rate, during the build process there comes a point where KSP \u0022automagically\u0022 switches me over to radial symmetry with no action on my part...and then it becomes impossible to switch it back.\u003C/p\u003E\u003Cp\u003EI do know about the \u0022R\u0022 key binding to toggle symmetry. I can guarantee that I have NOT touched it when this happens.\u003C/p\u003E\u003Cp\u003EIf I hit the \u0022R\u0022 key after KSP auto-toggles to radial symmetry... No joy. Sure, it \u0022works\u0022 in that KSP gives me a \u0022Mirror symmetry\u0022 message and changes the symmetry icon from dot to square. All as expected and as it should be. However, the instant I try to attach a new part, *POOF* the icon changes back, the \u0022Radial symmetry\u0022 HUD message appears, and that\u0027s how the new part insists on attaching. And NOTHING after that seems to make any difference--I toggle back to Mirror symmetry, try to place a part, and the symmetry mode changes itself back to radial as soon as the new part attaches. (Grrrrr!)\u003C/p\u003E\u003Cp\u003EThe overall behavior is similar to the longstanding VAB behavior that once a \u0022core\u0022 part has something radially attached in, say, 4-fold symmetry, EVERYTHING radially attached to that part will have 4-fold radial symmetry. Except that I am certain I am not doing anything to \u0022set\u0022 anything on the craft to radial symmetry--KSP is doing that all by its lonesom.\u003C/p\u003E\u003Cp\u003EAs already noted, I am using FL-series \u0022rocket\u0022 LFO tanks (better mass fraction than Mk2 tanks, and fewer joint-stiffness issues than Mk3 tanks), and of course there are rocket engines involved (it\u0027s a spaceplane, after all; it needs to operate in orbit, y\u0027know). The issue MAY be initially appearing when I first attach a rocket engine to a FL tank; I have yet to stay calm enough while in the SPH to do the requisite experimentation. (If so, the obvious workaround would be to place the rocket engines last. Except that balancing the CoL vs CoM would seem to demand all engines be placed prior to finalizing the wing design/position...at least, that\u0027s the only way I\u0027ve ever had success with spaceplanes to date.)\u003C/p\u003E\u003Cp\u003ESo, three questions:\u003C/p\u003E\u003Cp\u003E1) Has anyone else seen this, or am I the first?\u003C/p\u003E\u003Cp\u003E2) Is this a \u0022bug\u0022, or is it a deliberate \u0022feature\u0022 for some (incomprehensible to me) reason?\u003C/p\u003E\u003Cp\u003E3) Is there a known fix/workaround?\u003C/p\u003E\u003Cp\u003EFor now, I\u0027m considering using Mk2 parts just to see what happens, despite their sucky fuel/structure mass ratio (and this is SUPPOSED to be a refueling tanker, so a less-than-ideal mass fraction is particularly irksome to me).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-30T21:47:24Z\u0022 title=\u002212/30/2014 09:47  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 30, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003Cbr\u003Ereworded for clarity\n\u003C/span\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-12-30T20:46:39Z","Content":"\n\u003Cp\u003EI\u0027ve only seen that happen when I load a craft started in the VAB into the SPH. sorry not much help.\u003C/p\u003E\n"},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2014-12-30T20:51:19Z","Content":"\n\u003Cp\u003EI saw this exact same thing myself when I tried to attach something with mirror symmetry to parts that were themselves attached to the core with radial symmetry. This was in VAB though, I haven\u0027t built much in SPH to date.\u003C/p\u003E\u003Cp\u003EI chalked that one up to technical reasons, i.e. the game is simply unable to mix symmetry modes in a single symmetric branch of the part tree. In my case the two boosters could have been placed with mirror symmetry just as well, but it did not occur to me at the time.\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-12-30T21:17:33Z","Content":"\n\u003Cp\u003EAfter a bit of further investigation:\u003C/p\u003E\u003Cp\u003EThe issue appears to be related to radially attaching a SUBASSEMBLY (subassembly in question is a stack of FL-T tanks; still don\u0027t know if that\u0027s a contributing factor) using symmetry. That operation works okay, but if anything is then attached to that subassembly (axially, at least), the auto-toggle to radial symmetry occurs.\u003C/p\u003E\u003Cp\u003EPotentially of note: the subassembly was also created in the SPH. There is no VAB \u0022contamination\u0022 anywhere in this build. (I did, however, call the subassembly \u0022Temp\u0022, which overwrote the previous \u0022Temp\u0022...which WAS built in the VAB. Again, no idea if that name retains its VAB connection somehow, or whether that is/isn\u0027t contributing to the issue.)\u003C/p\u003E\u003Cp\u003EWhen I directly attached a single FL-T tank (not subassembly) to the core, mirror symmetry was retained--and I could attach more parts to it without invoking \u0027radial symmetry auto-toggle\u0027.\u003C/p\u003E\u003Cp\u003E(I begin to think this is a bug. But I have yet to isolate what actually invokes it. Sneaking suspicion that the overwrite of the name \u0027Temp\u0027 did not clear the initial association with the VAB....)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EStarted a new virgin save, reproduced the above without ever setting foot in the VAB. The upshot appears to be that the \u0027radial symmetry auto-toggle\u0027 is invoked by attaching a part to a member of a subassembly which was itself attached using mirror symmetry. I cannot imagine this being anything other than a bug. Though, all things considered, probably not an immensely high priority bug. (No krakens are invoked, it doesn\u0027t screw up the behavior of a craft already \u0027in play\u0027, etc.)\u003C/p\u003E\u003Cp\u003ECould a mod move this discussion to Bug Reports, please?\u003C/p\u003E\n"},{"CreatedByName":"Faelucc","CreatedById":136938,"CreatedDateTime":"2015-01-30T07:47:50Z","Content":"\n\u003Cp\u003EHi!\u003C/p\u003E\u003Cp\u003EYou don\u0027t need to use \u0022subassembly\u0022 functionality to reproduce this bug : you only have to use the symmetry mode on a group of parts.\u003C/p\u003E\u003Cp\u003E1/ Put any part in the middle (let\u0027s say, Mk2 Inline Cockpit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003E2/ Attach another part (hmmm Small Hardpoint ?) to one side of the Cockpit\u003C/p\u003E\u003Cp\u003E3/ Attach a part to the Small Hardpoint (we aren\u0027t using any symmetry mode yet), a fuel tank for example...\u003C/p\u003E\u003Cp\u003E4/ Switch to mirror symmetry mode, take the Small Hardpoint and attach it again... and we have nod a symetric \u0022plane\u0022\u003C/p\u003E\u003Cp\u003E5/ Now, try to attach in mirror symmetry mode to the fuel tank... hmmm.... a fuel line? (good luck \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003EI\u0027ve tested with a rocket fuel tank, a jet fuel tank, some structural parts... same result : can\u0027t attach anything to them using mirror symmetry mode once i\u0027ve \u0022duplicated\u0022 them this way.\u003C/p\u003E\u003Cp\u003EWhen you select a root part of a group of parts and use mirror symmetry mode, all the child parts doesn\u0027t switch themselves recursively to mirror symmetry mode (and still use their default symmetry mode... radial?). Yep, sound like a bug \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E (or it\u0027s the strangest feature ever \u0026gt;\u0026lt;)\u003C/p\u003E\u003Cp\u003EWorkaround: If you have this bug, re-attach each part of the group in mirror symmetry mode, root part of the group first, then his children, ect... (\u0022recursively\u0022, as the game should do)\u003C/p\u003E\u003Cp\u003EYou should avoid to build your plane by attaching the parts on one side only and using the mirror symmetry mode to duplicate them (until the bug is fixed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\n"},{"CreatedByName":"DILLSN0OB","CreatedById":137647,"CreatedDateTime":"2015-02-08T20:23:04Z","Content":"\n\u003Cp\u003EI have found a way. While holding the object, hit R and then X. This will switch to mirror and hitting X will toggle the symmetry and fix it. If this didnt help, pm me and I can try to be more helpful.\u003C/p\u003E\n"},{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2015-02-13T14:37:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Faelucc\u0022 data-cite=\u0022Faelucc\u0022\u003E\u003Cdiv\u003EHi!\u003Cp\u003EYou don\u0027t need to use \u0022subassembly\u0022 functionality to reproduce this bug : you only have to use the symmetry mode on a group of parts.\u003C/p\u003E\u003Cp\u003E1/ Put any part in the middle (let\u0027s say, Mk2 Inline Cockpit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003E2/ Attach another part (hmmm Small Hardpoint ?) to one side of the Cockpit\u003C/p\u003E\u003Cp\u003E3/ Attach a part to the Small Hardpoint (we aren\u0027t using any symmetry mode yet), a fuel tank for example...\u003C/p\u003E\u003Cp\u003E4/ Switch to mirror symmetry mode, take the Small Hardpoint and attach it again... and we have nod a symetric \u0022plane\u0022\u003C/p\u003E\u003Cp\u003E5/ Now, try to attach in mirror symmetry mode to the fuel tank... hmmm.... a fuel line? (good luck \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003EI\u0027ve tested with a rocket fuel tank, a jet fuel tank, some structural parts... same result : can\u0027t attach anything to them using mirror symmetry mode once i\u0027ve \u0022duplicated\u0022 them this way.\u003C/p\u003E\u003Cp\u003EWhen you select a root part of a group of parts and use mirror symmetry mode, all the child parts doesn\u0027t switch themselves recursively to mirror symmetry mode (and still use their default symmetry mode... radial?). Yep, sound like a bug \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E (or it\u0027s the strangest feature ever \u0026gt;\u0026lt;)\u003C/p\u003E\u003Cp\u003EWorkaround: If you have this bug, re-attach each part of the group in mirror symmetry mode, root part of the group first, then his children, ect... (\u0022recursively\u0022, as the game should do)\u003C/p\u003E\u003Cp\u003EYou should avoid to build your plane by attaching the parts on one side only and using the mirror symmetry mode to duplicate them (until the bug is fixed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with Faelucc.\u003C/p\u003E\u003Cp\u003EI\u0027ve had the same problem in the same way but by taking off a wing hitting X and replacing it to get the mirror.\u003C/p\u003E\u003Cp\u003EWhen trying to attach anything to the wing symmetry auto-switches to radial.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-09T13:34:44Z","Content":"\n\u003Cp\u003EI get this all the time and it\u0027s incredibly annoying.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-09T14:24:27Z","Content":"\n\u003Cp\u003EI get it usually after using one of the offset tools. Agreed, ridiculously annoying.\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-04-09T14:39:10Z","Content":"\n\u003Cp\u003EI have the same issue. Whenever I attach wing segments to each other instead of on the fuselage itself, it switches to radial when I attach things under the wing.\u003C/p\u003E\u003Cp\u003EIt\u0027s starting to really get me frustrated.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-10T14:26:33Z","Content":"\n\u003Cp\u003EOK, I actually can\u0027t finish something now because of this bug. Something I\u0027ve been working on for a week. If I had a physical copy of the game I\u0027d be hurling it out a window \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-11T09:41:10Z","Content":"\n\u003Cp\u003EFurther experience suggests this often seems to be related to the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/42566-Connection-Nodes-Disappearing-in-VAB-21-1/page2\u0022 rel=\u0022external nofollow\u0022\u003EConnection nodes disappearing\u003C/a\u003E bug.\u003C/p\u003E\n"},{"CreatedByName":"r_loewe","CreatedById":159561,"CreatedDateTime":"2016-04-18T21:13:32Z","Content":"\n\u003Cp\u003E\nugh squad just gets me so annoyed SQUAD GET YOUR FRICKIN\u0027 ACT TOGETHER!!!\n\u003C/p\u003E\n"},{"CreatedByName":"Overland","CreatedById":119812,"CreatedDateTime":"2016-04-21T21:13:34Z","Content":"\n\u003Cp\u003E\nTHIS!!! Bloody horrible bug!!\n\u003C/p\u003E\n\u003Cp\u003E\nAt first I thought im pressing a button wrong until I realised that it wasnt a button at all but the game\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBuild a nice plane.come back from a flight and go to add or modify wing placement..landing gear..fuel tanks and youll get the mirror opposite with the wings wanting to do either a swastika shape or turn into a starwars 3 winged shuttle..no way in hell of getting it back without exiting SPH and going back in\n\u003C/p\u003E\n\u003Cp\u003E\nWant to place landing gear in another spot? NO SOUP FOR YOU!\u0027\n\u003C/p\u003E\n\u003Cp\u003E\nHere have one wheel up in the air and one on the ground..\n\u003C/p\u003E\n\u003Cp\u003E\nAbsolutely horrible!! \n\u003C/p\u003E\n\u003Cp\u003E\nFix it please.. Ive been with this game for a long time building trains and aircraft... This bug kills all of that\n\u003C/p\u003E\n"},{"CreatedByName":"luckyindiana525","CreatedById":173126,"CreatedDateTime":"2017-01-01T03:43:09Z","Content":"\n\u003Cp\u003E\nI\u0027ve been having the same problem with my X-Wing I have been building, I know this is hard but try placing it without Symmetry mode it might help\n\u003C/p\u003E\n"}]}