{"TopicId":95169,"ForumId":16,"TopicTitle":"Any way to know which craft belongs to which contract?","CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2014-12-31T20:04:33Z","PageNum":1,"Articles":[{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2014-12-31T20:04:33Z","Content":"\n\u003Cp\u003EI was about to launch a rocket to the MÃƒÂ¼n to fulfill a contract for a satellite and when I went to the tracking station to see the orbit I found a rocket there, suspiciously positioned in a good position... I\u0027m not sure if I put it there in the orbit it should be for another contract or if I was going to fulfill this one contract but went to bed and left the last part of the mission for the next day...\u003C/p\u003E\u003Cp\u003ESo..., since all my sats are named \u0022sat4\u0022... (yeah I know, I should use better names, but), is there a way to know if the craft belongs to a contract already done? Date of launch is of no use, fuel seems to be a little low for the stage of the mission, but then again I kind of remember botching the orbit and having to burn a lot to change direction... or maybe not, I have been sending a lot of sats lately.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-12-31T20:11:24Z","Content":"\n\u003Cp\u003EI always name my craft with the name of the test or requirement. So I have craft with simplistic names such as Launch, 5K, 22K, 56K, Orbit, LVN Orbit 85K to 94K, 909 Splash, Turbo 8K to 12K 250 MPS, etc. But they do the job.\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-12-31T21:41:31Z","Content":"\n\u003Cp\u003EI use the same basic strategy as Dispatcher (i.e., I name the satellite appropriately). I also tend to delete satellites after the contract has been fulfilled, unless I have some additional use in mind for it, so there\u0027s not so many old vehicles in orbit, pointlessly cluttering up the Map View and Tracking Station.\u003C/p\u003E\n"}]}