{"TopicId":95164,"ForumId":32,"TopicTitle":"KSP Pet Peeves","CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2014-12-31T19:39:51Z","PageNum":4,"Articles":[{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2015-01-07T21:27:41Z","Content":"\n\u003Cp\u003EMy pet peeve is IVA\u0027s. The mk1 and cupola and mk1 can have quite decent ones (yet nothing like ALCOR), but what about mk3? And for all, WHERE ARE ALL THE COOL BUTTONS, DIALS AND DISPLAYS? RPM shows that it\u0027s possible, so y u no in stock?\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2015-01-07T22:58:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StormKat\u0022 data-cite=\u0022StormKat\u0022\u003E\u003Cdiv\u003E1. Build a rocket.\u003Cp\u003E2. Launch rocket.\u003C/p\u003E\u003Cp\u003E3. Press M for map mode.\u003C/p\u003E\u003Cp\u003E4. Press Esc and click on either of the revert options.\u003C/p\u003E\u003Cp\u003E5. Attempt to launch again.\u003C/p\u003E\u003Cp\u003ENotice anything? Are you zoomed way out?\u003C/p\u003E\u003Cp\u003EPress M for map mode. Press M again to return to normal mode and your view should return to normal.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EHow you tell your guy to hold, say, retrograde. He does so for you for a while and you hit \u0022T\u0022 to turn off SAS for a while. You move the ship around, get it all situated, and hit T again to lock your heading.\u003Cp\u003E...and your Kerbal dutifully starts aiming retrograde again.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoh! That just happened to me recently. When SAS is turned off, the SAS mode should immediately switch to \u0022stabilize\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbal.curseforge.com/ksp-mods/226817-resetsas\u0022 rel=\u0022external nofollow\u0022\u003EHere you go\u003C/a\u003E (\u003Ca href=\u0022http://greenoctagon.co.uk/ResetSAS.zip\u0022 rel=\u0022external nofollow\u0022\u003Ealternate\u003C/a\u003E). It took me a little while to poke about with VesselAutopilotUI, there was a fiddly problem with multiple buttons lighting up at once, but it\u0027s not like you need to know that. Install that mod in the usual way, and SAS will flick to stability-assist mode when you enable it. License is MIT and included in the zip. Source is on github and linked in the Curseforge project page.\u003C/p\u003E\u003Cp\u003EEdit: Forum thread \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/106487\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. Direct any bug reports, hate mail or worshipful adoration in that direction.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-07T23:16:20Z\u0022 title=\u002201/07/2015 11:16  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 7, 2015\u003C/time\u003E by technicalfool\u003C/strong\u003E\n\u003Cbr\u003EThread link added.\n\u003C/span\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2015-01-07T23:41:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deadpangod3\u0022 data-cite=\u0022Deadpangod3\u0022\u003E\u003Cdiv\u003Ealot of complaints i see in here are unfixable/ not ksp\u0027s fault\u003Cp\u003Ejittering orbits:\u003C/p\u003E\u003Cp\u003Ecomputers can only simulate physics so far, when you get to a point of smallness and accuracy theres going to be errors, hence why its called \u0022floating point errors\u0022\u003C/p\u003E\u003Cp\u003Eyou pack a supercomputer into a tiny home computer and then come back, even then it might not be completely solved, remember, NASA landed on the Moon with a supercomputer of the time that has less processing power then your iphone, we\u0027ve come a long way, but we still have a ways to go before we can simulate physics on a home computer perfectly.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course there\u0027s a limit to the accuracy of orbit predictions, but don\u0027t tell me there\u0027s no possible fix for jittering orbits. You could filter/average results, slow down or limit recalculation for certain distances or velocity changes, or even allow the user to pause recalculation for a little while while planning a maneuver. Someone smarter than me could come up with all sorts of clever solutions to stop them oscillating all over the place; squad just hasn\u0027t taken the time to do it. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Eno axial tilt:\u003C/p\u003E\u003Cp\u003Elimitation of Unity, talk to them and stop whining here.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not whining, and RSS would like to have a word with you. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Erocket orientation:\u003C/p\u003E\u003Cp\u003Ethe way it is in the VAB is how it will be on the launchpad, if thats not good enough, look out the open VAB door and picture your rocket on the launchpad out there in its current orientation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust because it\u0027s possible to figure out doesn\u0027t make it good UI design. It would not be difficult to indicate more clearly to the user how the rocket\u0027s going to end up on the launchpad. \u003C/p\u003E\u003Cp\u003EMy own pet peeves: \u003C/p\u003E\u003Cp\u003E- Maneuver nodes in general. They ignore clicks, sometimes you can\u0027t even create one when and where you\u0027d like, it\u0027s really easy to accidentally scroll on an indicator (and then there\u0027s no undo/reset optoin), half the time you accidentally delete them and the other half you can\u0027t select them to delete them, there\u0027s no clear indication of what the different components of the burn are, attempting to drag a node forward or back in time is a laughable nightmare, and fine tuning a maneuver is very fiddly. I don\u0027t know how people play without precisenode. \u003C/p\u003E\u003Cp\u003E-Close approaches not showing in places that make sense, especially when 2 orbits are similar but not identical. I want to be able to see where the target will be when I cross its orbit, not 3/4 of the way around because that happens to be the next closest approach by straight line. \u003C/p\u003E\u003Cp\u003E-The bug that causes my orbit line to mostly disappear when intersecting a different SOI in conics mode 0 (which is the only one that\u0027s actually useful). It\u0027s been present for every version I\u0027ve played (since .21) and it usually hits when fine tuning a close approach. \u003C/p\u003E\u003Cp\u003E-When using landing legs, I have to click the gear button twice because they start out of sync. (Yes, I know it\u0027s because of spaceplanes.) \u003C/p\u003E\u003Cp\u003E-Crew state (manned/unmanned) doesn\u0027t save when building ships (may have been fixed in .90, I haven\u0027t messed with it). \u003C/p\u003E\u003Cp\u003E-Only tangentially related-- the game\u0027s aerodynamics being so laughably bad that people go around calling something a \u0022gravity turn\u0022 when it\u0027s really just a regular turn.\u003C/p\u003E\u003Cp\u003E-Curse, and Squad\u0027s use of it.\u003C/p\u003E\u003Cp\u003E-Physicsless parts that have no business being so.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EOh yeah! Also the very first menu you see when you open the game. Why does it exist? \u003C/p\u003E\u003Cp\u003EAnother thing is that you have to click through several menus, a loading screen, and a couple animations to quit out of the game. We should be able to do it from the pause menu.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-08T01:15:53Z\u0022 title=\u002201/08/2015 01:15  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 8, 2015\u003C/time\u003E by Traches\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Johnny Wishbone","CreatedById":118096,"CreatedDateTime":"2015-01-08T13:00:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sof\u0022 data-cite=\u0022Sof\u0022\u003E\u003Cdiv\u003EIf you\u0027re getting excessive sideways G-forces, you\u0027re probably weren\u0027t going to space anyway. \u003Cp\u003EBut I guess I\u0027ve never thought of it like that. They are flying sideways into space. I don\u0027t think you\u0027d notice it as an astronaut though. I mean, the space shuttle is upside down on the way up. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, KSP is oriented and launching correct (at least as far as \u0022real life\u0022 goes). \u003C/p\u003E\u003Cp\u003ETake a look at most NASA manned launches, even going back to Apollo. Shortly after the rocket clears the pad, a roll program is initiated by the flight computer to rotate the Saturn V/Shuttle by 90 degrees so the crew launches \u0022forwards\u0022 not \u0022sideways\u0022. This is even stated in the movie \u0022Apollo 13\u0022; when the crew launches for the moon, Tom Hanks character says the line \u0022Roll complete. We are pitching!\u0022 He\u0027s telling Houston mission control that the rocket has completed the roll program (90 degree rotation anti-clockwise) and has begun to pitch over to start the gravity turn. So, when you launch your rocket in KSP, if you\u0027re concerned about sideways G forces, you should roll your rocket just like they do in \u0022real life\u0022.\u003C/p\u003E\u003Cp\u003EThis leads to one of my KSP forum pet-peeves, which is when people say to start your gravity turn by \u0022pitching over at X altitude\u0022. If you didn\u0027t roll first, technically, you\u0027re \u0027yawing\u0027 over at X altitude, not pitching. Based on the rocket orientation on the pad, and the fact that nobody ever rolls their rocket after launch, if you \u0022pitch\u0022 over without rolling first, you\u0027d be heading south, not east.\u003C/p\u003E\u003Cp\u003EYes, I\u0027m being pedantic. But that\u0027s what makes it a pet peeve. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-01-08T13:22:52Z","Content":"\n\u003Cp\u003EOn a sidenote, why did they need to do a roll program like that. I kind of get it with the Shuttle, that\u0027s all asymmetric and stuff, but the Saturn V was pretty much symmetrical, why not put it on the pad the right way round?\u003C/p\u003E\n"},{"CreatedByName":"Johnny Wishbone","CreatedById":118096,"CreatedDateTime":"2015-01-08T14:34:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EOn a sidenote, why did they need to do a roll program like that. I kind of get it with the Shuttle, that\u0027s all asymmetric and stuff, but the Saturn V was pretty much symmetrical, why not put it on the pad the right way round?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.collectspace.com/ubb/Forum29/HTML/000805.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.collectspace.com/ubb/Forum29/HTML/000805.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2015-01-08T18:34:29Z","Content":"\n\u003Cp\u003EJust remembered my most hated peeve. It rarely happens but when it does, it tickles my hate gland [snip - keep it clean guys]. \u003C/p\u003E\u003Cp\u003Eunable to stage in map view. You think I would learn by now but when I hear an engine cut out and I instinctively hit spacebar to stage and nothing but the sigh of despair as I remember, yet again, to come out of map view, stage, then get back to it.\u003C/p\u003E\u003Cp\u003EOh how I find it ever so slightly irksome\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-08T22:34:53Z\u0022 title=\u002201/08/2015 10:34  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 8, 2015\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rithsom","CreatedById":114646,"CreatedDateTime":"2015-01-08T18:41:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vetrox\u0022 data-cite=\u0022vetrox\u0022\u003E\u003Cdiv\u003EJust remembered my most hated peeve. It rarely happens but when it does, it tickles my hate gland [more snip] \u003Cp\u003Eunable to stage in map view. You think I would learn by now but when I hear an engine cut out and I instinctively hit spacebar to stage and nothing but the sigh of despair as I remember, yet again, to come out of map view, stage, then get back to it\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat actually saved a couple of my missions (I play with quicksaving off). I accidentally hit the space bar while in map view, freaked out because I thought I jettisoned a stage, but when I got out of map view everything was okay.\u003C/p\u003E\u003Cp\u003EBut yes, I would still prefer being able to stage in map view than not.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-08T22:35:12Z\u0022 title=\u002201/08/2015 10:35  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 8, 2015\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketScientistsSon","CreatedById":83151,"CreatedDateTime":"2015-01-08T19:26:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Traches\u0022 data-cite=\u0022Traches\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnother thing is that you have to click through several menus, a loading screen, and a couple animations to quit out of the game. We should be able to do it from the pause menu.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis has gotten me in trouble with the wife sooooo many times! It takes FOREVER to quit the game.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-01-08T19:52:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketScientistsSon\u0022 data-cite=\u0022RocketScientistsSon\u0022\u003E\u003Cdiv\u003EThis has gotten me in trouble with the wife sooooo many times! It takes FOREVER to quit the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile ALT\u002BF4 does not cause issues as the save file is persistent, that still does not feel right and I agree.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2015-01-08T20:19:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EWhile ALT\u002BF4 does not cause issues as the save file is persistent, that still does not feel right and I agree.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I have to force-quit a game, that usually means I\u0027m playing a terrible console port. \u003C/p\u003E\u003Cp\u003EThat said, I\u0027ve played terrible console ports that were better optimized than KSP, so I suppose I\u0027m setting the bar a little high.\u003C/p\u003E\n"},{"CreatedByName":"Jonboy","CreatedById":134111,"CreatedDateTime":"2015-01-08T22:02:36Z","Content":"\n\u003Cp\u003EUsed to be when you accidentally double-click on a planet in map view and switch focus. For the longest time I never realized that you just need to hit backspace to reset focus to your vessel.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-08T22:12:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vetrox\u0022 data-cite=\u0022vetrox\u0022\u003E\u003Cdiv\u003Eunable to stage in map view.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI hated this one too. It\u0027s actually the main reason I installed the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60227-\u0022 rel=\u0022external nofollow\u0022\u003EAlternate Resource Panel\u003C/a\u003E mod (though the actual purpose of the mod is also great).\u003C/p\u003E\n"},{"CreatedByName":"redsh","CreatedById":118322,"CreatedDateTime":"2015-01-09T16:56:00Z","Content":"\n\u003Cp\u003E\u002B1 for jittering orbits and disappearing intercepts/approach markers. I can take up floating point errors, but KSP frequently loses even precise Jool or Eve intercept.\u003C/p\u003E\u003Cp\u003EAlso I\u0027m not happy with \u0022flights in progress\u0022 counter that includes flags. SQUAD does not want to fix even a such little thing.\u003C/p\u003E\n"},{"CreatedByName":"marcushouse","CreatedById":134845,"CreatedDateTime":"2015-01-10T10:33:47Z","Content":"\n\u003Cp\u003EAwesome game... but can always use work.\u003C/p\u003E\u003Cp\u003E- Lack of bigger solid rocket parts. Apart from wrapping the Kerbodyne Solid rockets with tiny Solids. Lets put in some big Solids to go with it all.\u003C/p\u003E\u003Cp\u003E- Some form of part scale (Like tweakScale perhaps, but restricted to be sensible / realistic). Perhaps this would solve problem 1 as well if we could make the booster rockets 1-2-3-4-5 metres in diamater etc. Then you wouldnt need to put in multiple parts that all do the same thing (just smaller of bigger).\u003C/p\u003E\u003Cp\u003E- Lack of things to spend science on.... I\u0027ve done a bunch of Kerbin, Mun and Minimus missions, haven\u0027t even been out of Kerbin yet. I\u0027ve unlocked everything and have 3000 science points I cant do anything with. How about adding many more things to keep unlocking (perhaps even go into futuristic (but realistic) parts, fusion engines, much better ion systems, much better power systems (light solar sails, etc etc). Give us more reason to keep unlocking things with science that is my entire motivation behind planing.. unlocking the next great part.\u003C/p\u003E\u003Cp\u003E- Needing to unlock Action Groups should be removed. If they can make landing gear or lights come on from day 1, why would the technology of extending solar panels be any different.\u003C/p\u003E\u003Cp\u003E- Needing to unlock manuver nodes seemed a bit strange (at least needs to be explained better as I had no idea why I didn\u0027t have them any more). Perhaps make it so that when you attempt to place one a message says (requires unlock) just so it is obvious). Also, because I hadn\u0027t unlocked them yet, I couldn\u0027t see them in tutorials that really needed them either.\u003C/p\u003E\u003Cp\u003E- Please put in better docking systems like \u003Ca href=\u0022http://www.curse.com/ksp-mods/kerbal/220299-docking-port-alignment-indicator-version-5-0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.curse.com/ksp-mods/kerbal/220299-docking-port-alignment-indicator-version-5-0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- Instead of rescuing a Kerbal in orbit (seems odd... how the heck did he get there)... put him in a little failed ship (e.g. another competing space company sent him up), perhaps an engineer could fix the ship.\u003C/p\u003E\u003Cp\u003E- Depending on angle and distance from your camera, when rotation around trying to place accurate nodes, the camera snaps in big increments (making it difficult to line things up or get the perspective you need to set the node correctly). The further away from your focal object, the worse it is. Try accurately setting a node on the opposite side of the sun. Panning your camera results in huge incremental snaps. Surely the further the distance from the object the more fine the camera could be moved when panning around? Or is this some kind of floating point problem?\u003C/p\u003E\u003Cp\u003E- Adding parts to mine asteroids. It would be awesome to bring a big asteroids into earth orbit and set up a huge refuelling station there. Perhaps any rare metals (gold etc) could be returned for some $$$ \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-01-10T12:01:24Z","Content":"\n\u003Cp\u003EIt\u0027s another small thing, but...\u003C/p\u003E\u003Cp\u003EMouse click transparency. In the VAB when working on large craft and I go to change the staging, I often end up inadvertently selecting and detaching the part \u0027behind\u0027 the staging icon I\u0027m trying to click on.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-10T12:36:17Z\u0022 title=\u002201/10/2015 12:36  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 10, 2015\u003C/time\u003E by Starhawk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2015-01-10T15:01:35Z","Content":"\n\u003Cp\u003EWhile I really like the music used in KSP (including the Credits music), now that its in Beta, I\u0027d like even more music added to the stock music rotation (without adding it myself). We\u0027ve already seen visual and aural improvements in the way of new parts, textures, pyrotechnics and space center building iterations; I think the music could be expanded in a similar fashion and involves little additional coding; only someone willing to listen to and legal acquire the additional tunes. Perhaps Squad could even hold a forum contest to which members could contribute their own appropriate music, or links to appropriate royalty free music. New KSP music could be introduced to the game from this pool of winners in a similar way as was done with the KSP company logo/ flag artwork.\u003C/p\u003E\n"},{"CreatedByName":"hellblazer","CreatedById":131384,"CreatedDateTime":"2015-01-18T02:36:52Z","Content":"\n\u003Cp\u003EPeople not adjusting the brightness on their lights (70% is much better). It looks bleached out when they post pics of their station and rockets. Maybe its just me.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2015-01-18T03:02:15Z","Content":"\n\u003Cp\u003EOh, this is a big can of worms for me regarding KSP 0.90.\u003C/p\u003E\u003Cp\u003EOne: I hate the lack of a Lock Symmetry Mode button in the SPH/VAB hybrid. The number of times that I\u0027ve encountered an automatic switch and had to tear apart a bit of assembly work I spent hours building because it\u0027s decided my wing needs Radial symmetry, not Mirror symmetry...\u003C/p\u003E\u003Cp\u003ETwo: What\u0027s with the bloody camera? Spawning at different heights to the parts, plus the weird \u0022I dropped the camera\u0022 views when trying to do top-down view (Hey, I used to use the top down view to make sure I had everything just how I wanted it, so this is a big one for me.) is annoying.\u003C/p\u003E\u003Cp\u003EThree: Why use the VAB controls in the SPH?! Why? I got used to the SPH controls, and now I\u0027ve got to relearn the whole mess because my camera controls aren\u0027t working the same, my rotation controls are all screwed up, and on top of that, pressing Shift seems to make the parts go wonky.\u003C/p\u003E\u003Cp\u003EFour: The new menus aren\u0027t something I like at all. Sure, I get it, the ordered lists are nice. I could put up with that. Now either give us a search box, or at the very least, give us back the ability to click on the tab and return to page one, like we had before.\u003C/p\u003E\u003Cp\u003EFive: Despite the awesome new MK3 parts, a few flaws came up there. One is the lack of any definitive \u0022super heavy\u0022 wing sets. Two, the one-size-fits-everything landing wheel needs an update. Three, the MK2 - I\u0027m sorry, the MK1 Inline - cockpit needs an IVA still. Four, the MK3 Cockpit has no IVA.\u003C/p\u003E\u003Cp\u003EAnd last, but not least, Six: Despite the last two updates being \u0022Space-plane Oriented,\u0022 I feel the parts haven\u0027t been given their full justice. Sure, the MK2 and MK3 got an overhaul. The MK1 still looks like MK0.5 and there\u0027s still a lot of unfinished business regarding plane parts. The MK1 Cockpit has an IVA that is at least usable, though visibility to the sides is lacking. The MK1 Inline might as well be as dark as the MK3, because neither can be flown from inside without having supernatural piloting ability. The only tail-boom in game is that... thing, the one that doesn\u0027t fit with the color scheme, and there\u0027s a distinct lack of small jet parts.\u003C/p\u003E\u003Cp\u003ENot to mention I could gripe for hours about the lack of useful rover parts.\u003C/p\u003E\n"},{"CreatedByName":"Kethevin","CreatedById":64466,"CreatedDateTime":"2015-01-18T04:17:58Z","Content":"\n\u003Cp\u003E1. No option to have it default to free camera.\u003C/p\u003E\u003Cp\u003E2. Starting with 50% throttle.\u003C/p\u003E\u003Cp\u003E3. Not being able to change my Kerbal\u0027s names without it also changing their vocation.\u003C/p\u003E\u003Cp\u003E4. The persistent bug that causes the default flag to frequently show at the launch pad.\u003C/p\u003E\n"},{"CreatedByName":"KerBlam","CreatedById":134309,"CreatedDateTime":"2015-01-18T04:37:46Z","Content":"\n\u003Cp\u003EWhen scrolling through vessels in the tracking centre and it zooms the view in and out... This bugs me more than it probably should.\u003C/p\u003E\u003Cp\u003ESome GUI text being unreadable if the background is a bit busy (maybe a semi-transparent box or a box with adjustable transparency around text would be good)\u003C/p\u003E\u003Cp\u003EClicking on the \u0027description\u0027 window under the vessel name in the VAB/SPH (among other things) and it grabs a part of the ship!!!\u003C/p\u003E\u003Cp\u003EGrabbing the wrong control on a transfer node, because the one you want is close to/behind it. \u003C/p\u003E\u003Cp\u003E50% throttle on Launch... What\u0027s it for?\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-01-19T09:44:49Z","Content":"\n\u003Cp\u003EOn-rails orbits changing for non-focussed vessels.\u003C/p\u003E\u003Cp\u003ESeriously, finding out that my Eve encounter is no longer an encounter, after many hours of play time have passed since launch, that just grates. Don\u0027t give a hoof about whether this is \u0027because of SOI changes at high timewarp\u0027 as we keep getting told - it is a massive, game breaking, horrible bug, and it needs to be resolved. Until then I shall keep using the infinite fuel cheat, or HyperEdit, to put things back where they should be at the time they said they would be. But I shouldn\u0027t \u003Cem\u003Ehave to\u003C/em\u003EÃ¢â‚¬â€¹.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-19T14:29:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EOn-rails orbits changing for non-focussed vessels.\u003Cp\u003ESeriously, finding out that my Eve encounter is no longer an encounter, after many hours of play time have passed since launch, that just grates. Don\u0027t give a hoof about whether this is \u0027because of SOI changes at high timewarp\u0027 as we keep getting told - it is a massive, game breaking, horrible bug, and it needs to be resolved. Until then I shall keep using the infinite fuel cheat, or HyperEdit, to put things back where they should be at the time they said they would be. But I shouldn\u0027t \u003Cem\u003Ehave to\u003C/em\u003EÃ¢â‚¬â€¹.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI normally don\u0027t like to suggest mods to fix in the stock things but you mentioned mods yourself... Check out Kerbal Alarm Clock. You and not only set it up to slow the game down and alert you on SOI changes an maneuver nodes (and dozens of other things), but you can set it up to do so AUTOMATICALLY. Once you set it up, you will never miss a major event unless you specifically told it to ignore it.\u003C/p\u003E\n"},{"CreatedByName":"Charley575","CreatedById":132132,"CreatedDateTime":"2015-01-19T22:17:40Z","Content":"\n\u003Cp\u003ELack of effective Nav Aides is a real problem for me, particularly in EVA, where there are no Nav Aides. I find it frustrating to land close to a survey area and have no idea if I\u0027m walking in the right direction. Also, having the Nav markers on the Nav Ball is not the best idea when the marker is below the horizon of the Nav ball. This happens when the destination is on the opposite side of the globe but is particularly troublesome when landing a vertical lander. Could we have some kind of HUD-Style visual cue to call out these locations on the terrain?\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-01-20T02:11:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Charley575\u0022 data-cite=\u0022Charley575\u0022\u003E\u003Cdiv\u003ELack of effective Nav Aides is a real problem for me, particularly in EVA, where there are no Nav Aides. I find it frustrating to land close to a survey area and have no idea if I\u0027m walking in the right direction. Also, having the Nav markers on the Nav Ball is not the best idea when the marker is below the horizon of the Nav ball. This happens when the destination is on the opposite side of the globe but is particularly troublesome when landing a vertical lander. Could we have some kind of HUD-Style visual cue to call out these locations on the terrain?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104758\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/104758\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMods my friend, mods.\u003C/p\u003E\n"}]}