{"TopicId":95219,"ForumId":32,"TopicTitle":"How Important is Kerbal Safety to You?","CreatedByName":"TheHockeyPlayer","CreatedById":73665,"CreatedDateTime":"2015-01-01T04:07:37Z","PageNum":5,"Articles":[{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2015-01-20T10:32:56Z","Content":"\n\u003Cp\u003E\u003Cem\u003EI go out of my way to ensure my Kerbals don\u0027t die.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ELike revert or reload. But I also like to own my mistakes. I love the Apollo 13 moments in this game. So I\u0027ve killed a couple. but mostly I just get them stranded someplace (like in a spacesuit in Duna orbit for a year and a half) \u003C/p\u003E\u003Cp\u003EA third of the ships I deploy have \u0022Rescue\u0022 in their name.\u003C/p\u003E\u003Cp\u003EEdit: Notice all the rescue plus marks in my ribbons. (also just launched a rescue mission to Moho. Bob\u0027s been working on his tan there for two years.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-20T10:40:23Z\u0022 title=\u002201/20/2015 10:40  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 20, 2015\u003C/time\u003E by Brainlord Mesomorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EndOfTheEarth","CreatedById":24503,"CreatedDateTime":"2015-01-21T01:48:25Z","Content":"\n\u003Cp\u003EMy family has a bad history with manned spaceflight. Challenger blew up on my dad\u0027s birthday, Vladamir Kormarov had his chute fail about forty years before my brother was born, and Columbia broke up right before my younger sister\u0027s birthday. As a result, astronaut deaths come up as a discussion topic once every month and a half in my house.\u003C/p\u003E\u003Cp\u003ENeedless to say, I move heaven and earth to make sure that my Kerbals come home safely, even if that means losing half of a real-life day duplicating earlier feats to bring extra fuel to missions stranded out by Jool.\u003C/p\u003E\n"}]}