{"TopicId":95231,"ForumId":25,"TopicTitle":"[Mod 0.90] KD Recon","CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2015-01-01T06:31:09Z","PageNum":1,"Articles":[{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2015-01-01T06:31:09Z","Content":"\n\u003Cp\u003EOK, here\u0027s the idea: perform an IVA recon of any Easter Egg artifact on Kerbin *except*: KSC, KSC Monolith, Island KSC. Basically you have a choice between four Monoliths, a temple and a flying saucer. If you don\u0027t know where any of these are, better to send out a Googlebot to hunt them down. Easter eggs haven\u0027t changed in several revisions of the game. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe lower the pass the better (and the higher the score).\u003C/p\u003E\u003Cp\u003EHOWEVER:\u003C/p\u003E\u003Cp\u003EYou must perform the capture while flying *supersonic*.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHow to tell if you\u0027re flying supersonic\u003C/strong\u003E?\u003C/p\u003E\u003Cp\u003EThere is still as yet no way to tell in stock KSP. From reading around I\u0027ve managed to determine the closest I can get to a guess, and conclude that the assumption is 345m/s at sea level (surprisingly, the same as it is on Earth). Aerodynamic mods seem to agree with this value, at which point values relative to altitude diverge dramatically. I will say, therefore, that whether you use stock or FAR/NEAR or whatever aero mod, the speed of sound for the purposes of this challenge will be 345m/s at all altitudes up to 10km.\u003C/p\u003E\u003Cp\u003ERULES:\u003C/p\u003E\u003Cp\u003E - Aircraft must be manned.\u003C/p\u003E\u003Cp\u003E - ANY part or mod valid.\u003C/p\u003E\u003Cp\u003E - Challenge ceiling is 10km.\u003C/p\u003E\u003Cp\u003E - Capture is valid only if the artifact is captured in IVA mode and at (or near, as in partly within) the centre ninth of the frame. Terrain altitude (most mod flight aids will have this, if not: not to worry, I may have to plant flags at the various artifacts and determine base altitudes) and airspeed *must* be shown in the same frame (for scoring purposes).\u003C/p\u003E\u003Cp\u003EScoring:\u003C/p\u003E\u003Cp\u003EFor each metre above terrain: -1pt\u003C/p\u003E\u003Cp\u003EFor each m/s above 345m/s: \u002B1pt\u003C/p\u003E\u003Cp\u003EExample: 100m above terrain at 345m/s scores -100. 100m above terrain at 445m/s scores 0. 100m above terrain at 545m/s scores 100.\u003C/p\u003E\n"}]}