{"TopicId":95279,"ForumId":16,"TopicTitle":"Most efficient speed for jets?","CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-01-01T17:51:50Z","PageNum":1,"Articles":[{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-01-01T17:51:50Z","Content":"\n\u003Cp\u003EIs there an engine setting which is most efficient to fly at, and how can it be determined? In the real world, aircraft don\u0027t cruise at engine redline for a number of aerodynamic and engine-performance reasons, and to allow flexibility for maneuvers. Is there a way to estimate the most efficient cruising speed for a jet in KSP?\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-01-01T17:58:44Z","Content":"\n\u003Cp\u003EIf you are running FAR and AJE you wouldnt cruise at 100%. Most of the time I cruise at 40-50% throttle in FAR when I am not trying to go into space.\u003C/p\u003E\u003Cp\u003ESometimes I don\u0027t even have that much throttle, on some of my combat fighter designs I cruise at 25% throttle because that will keep them at mach 1.5 pretty easily.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-01-02T07:52:08Z","Content":"\n\u003Cp\u003EUnder stock KSP aero model:\u003C/p\u003E\u003Cp\u003EEach jet engine type, and to a somewhat lesser extent each plane implementation of them, has a different optimal speed *and altitude* for best efficiency.\u003C/p\u003E\u003Cp\u003E(efficiency defined here as most distance per fuel)\u003C/p\u003E\u003Cp\u003EBased on recent experience with doing career temp/report missions all over Kerbin, using basic jet engines..\u003C/p\u003E\u003Cp\u003EWith heavy fuel load, optimal range was with TWR of about 0.4, at altitude of 8000m. Speed about 220m/s\u003C/p\u003E\u003Cp\u003EWith very low fuel load, optimal range was with TWR of about 0.25, at altitude of 10500m. speed about 315m/s\u003C/p\u003E\u003Cp\u003EAnything under 6000m forces you to fly so slow that you may go grey before completing your mission.\u003C/p\u003E\u003Cp\u003EAnything over ~16000m snuffs a basic jet. Actually, over 12000m they suffer bad ISP losses.\u003C/p\u003E\u003Cp\u003EIn short: Fly slower than terminal velocity, to reduce drag. Slower is more efficient, as long as you are using wing lift not vectored thrust to stay up.\u003C/p\u003E\u003Cp\u003EFly as high as your engines are comfortable, to reduce drag.\u003C/p\u003E\u003Cp\u003EUse as low a throttle setting as you can possibly manage, and still maintain your altitude.\u003C/p\u003E\u003Cp\u003ETake each of these to an extreme, and you end up with something that cruises at 12000m, at 35m/s, capable of circling the word 5 or more times.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-01-02T08:51:31Z","Content":"\n\u003Cp\u003EFirst off, some data sheets:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/82157-A-detailed-look-at-Kerbal-s-jet-engines\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/82157-A-detailed-look-at-Kerbal-s-jet-engines\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDue to the peculiarities of stock aero, the most fuel-efficient way of moving about is always as fast as possible, as high as possible. You may burn twice as much fuel per second at 15km compared to 5km, but you\u0027ll also move at least three times as fast.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-01-02T09:46:26Z","Content":"\n\u003Cp\u003Eflying at 2,000 m/s at 50km is basically in orbit, and you can go very very far with no fuel use.\u003C/p\u003E\u003Cp\u003EKSP turbojets are most efficient at 1,000 m/s, due ot their velocity curve. They produce 2x as much thrust for the same fuel consumption relative to a velocity of 0.\u003C/p\u003E\u003Cp\u003ENext is the ISP curve for atmosphere.... at low altitude, they have a horrible 800 ISP, going up to about 2500 ISP at something like 5 km, then back down to 1200 ISP as the air pressure decreases to vacuum conditions.\u003C/p\u003E\u003Cp\u003E.... so the engine itslef is most efficient at 1,000 m/s at 5km... but the drag losses at that speed are extreme.\u003C/p\u003E\u003Cp\u003EIts worth nothing that in Real Life - Lift/Drag remains relatively constant as velocity changes (until you get into higher mach numbers). This also means that L/D is pretty much constant across different air densities, as a lower air density just means you must travel faster. So for a given angle of attack and wing shape, your efficiency is the same regardless of what speed you travel at (but AoA changes do affect this, so to travel faster at the same AoA would require a different design with a higher wing loading - so for the same mass, just smaller wings)\u003C/p\u003E\u003Cp\u003E - but not so in stock KSP aerodynamics, L/D gets arbitrarily low as velocity gets aribtrarily high, as drag follows a V^2 relationship, but lift is proprotional to V (not V^2).\u003C/p\u003E\u003Cp\u003EDouble your velocity, halve your L/D.\u003C/p\u003E\u003Cp\u003EHowever, as I noted at the start... often, you don\u0027t really need much lift, because due to the small radius of Kerbin, you get very close to orbital velocity, and you don\u0027t need to generate that much lift at all.\u003C/p\u003E\u003Cp\u003Eie, the karman line \u003Ca href=\u0022https://en.wikipedia.org/wiki/K%C3%A1rm%C3%A1n_line\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/K%C3%A1rm%C3%A1n_line\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eis quite low:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Earound this altitude, the atmosphere becomes too thin to support aeronautical flight, because a vehicle at this altitude would have to travel faster than orbital velocity to derive sufficient aerodynamic lift to support itself (neglecting centrifugal force).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince we can actually fly near this line in KSP (airbreathing engines don\u0027t work at those speeds and altitudes in real life), its actually most efficient to fly up around there.\u003C/p\u003E\u003Cp\u003EBut thats like saying the most fly efficient way to fly in terms of cumulative distance travelled, is to go into orbit. \u003C/p\u003E\u003Cp\u003EBut in KSP, for flights where \u0022centrifugal force\u0022 does not significantly reduce the amount of lift needed, then the most efficient way to fly is to fly as slowly as possible because of the funky lift equation, which means you want the basic jet, and it will take absurdly long to get anywhere like that.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-01-02T16:39:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E - but not so in stock KSP aerodynamics, L/D gets arbitrarily low as velocity gets aribtrarily high, as drag follows a V^2 relationship, but lift is proprotional to V (not V^2).\u003C/p\u003E\u003Cp\u003EDouble your velocity, halve your L/D.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile true, your lift:drag ratio is greater than 1 for all wings, for all speeds below escape velocity.\u003C/p\u003E\u003Cp\u003EI may spend lunch calculating, for a given plane:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Efor each altitude,\u003Cbr\u003E for each angle of attack,\u003Cbr\u003E  for each throttle setting,\u003Cbr\u003E   find the speed we reach at equilibrium between drag and thrust.\u003Cbr\u003E   is vertical velocity zero under those conditions?  If so, store this data point.\u003Cbr\u003Eamong all data points we stored, which one has the least fuel consumption per distance?\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMy gut is that the best cruising altitude will be high and fast, even for basic jets. And it will increase as you burn off fuel.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-01-04T06:13:05Z","Content":"\n\u003Cp\u003EIt took me longer than lunch, but I implemented the pseudocode above. So now I can write the following incantation -- and you can too if you download the \u003Ca href=\u0022https://github.com/numerobis/KSP-scripts/blob/master/planeDesigner.py\u0022 rel=\u0022external nofollow\u0022\u003EKSP-scripts\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Efrom planeDesigner import plane, part\u003Cbr\u003Eimport lift, jets\u003Cbr\u003Ep = plane(   \u003Cbr\u003E        # cockpit\u003Cbr\u003E        part(None, Cd=0.008, extraMass = 1),  \u003Cbr\u003E        # two short fuel tanks, two-thirds empty (1.5t capacity each)\u003Cbr\u003E        part(lift.mk2FuselageShort, n=2, extraMass = 0.5),\u003Cbr\u003E        # intake and jet\u003Cbr\u003E        part(jets.ramAirIntake), \u003Cbr\u003E        part(jets.turbojet),\u003Cbr\u003E        # wings and control surfaces\u003Cbr\u003E        part(lift.deltaDeluxe, 2),\u003Cbr\u003E        part(lift.avr8, 2),\u003Cbr\u003E        part(lift.deltaDeluxe, 2, AoAdegrees = 60),\u003Cbr\u003E        # vertical stabilizer; it\u0027s a delta-deluxe but edge-on, so there\u0027s no lift or drag\u003Cbr\u003E        part(None, Cd = 0, extraMass = lift.deltaDeluxe.mass),\u003Cbr\u003E        )\u003Cbr\u003Ep.optimizeFuelConsumption(verbose = True)\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAll but the last line are about defining my plane: two short Mk2 fuselages with fuel (here I look at how the plane works when it\u0027s consumed two thirds of its fuel), the lowest-drag cockpit, a ram air intake up front and a turbojet in the back. I use a pair of AV-R8 for elevators at the back, a pair of delta-deluxe at the center of mass for roll, and a second pair of delta-deluxe at the top of the fuselage, tilted to have a 60-degree angle of attack so they generate a lot of lift. Then there\u0027s a delta-deluxe for a vertical stabilizer (I turn off all its controls).\u003C/p\u003E\u003Cp\u003EThe last line recommends what altitude, pitch, and throttle setting to fly at. My code ensures that the plane will be level with those settings (i.e. net forces are zero), and it chooses the combination that minimizes fuel consumption per distance.\u003C/p\u003E\u003Cp\u003EWhat it looks like is a long computation that slowly spits out lines one by one, such as:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ETesting altitude 8000, best so far is 6000 with (28, 0.05438232421875, 88.11264038085938, 0.000353374694661201)\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis line says that the best solution it\u0027s found so far is to fly at 6,000m at a pitch of 28 degrees with throttle at 5.4%. Then you\u0027ll be going 88 m/s and you\u0027ll consume 0.000 kg per m you travel. It helps to rewrite it as something like 35 kg per 100 km.\u003C/p\u003E\u003Cp\u003EAfter crunching for a while it will output something more legible like:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFly at 25500 m altitude, pitch 46 degrees, throttle 0.146, to achieve 1192.61 m/s using 0.0286144 U/km\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo there you go -- with turbojets you should fly high and steep. At that altitude, I think 14.6% is full throttle.\u003C/p\u003E\u003Cp\u003EWhat\u0027s interesting with the turbojet planes I\u0027ve tried is that there\u0027s an ideal point around 6km to 6.5km at very low throttle, then performance falls until about 15km. After that, performance rises again, and basically it\u0027s all about going as high as you possibly can, even if it requires pitching up steeply to maintain that altitude.\u003C/p\u003E\u003Cp\u003EMy code assumes you want to stay level. I\u0027m doubtful that\u0027s this is actually optimal -- instead, you could bob up and down. That way you put out a lot of thrust at low altitude with marginally better Isp, then you punch through to high altitude where the air is thin. But it\u0027s certainly more restful to just stay at a fixed altitude.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOh, and if you replace the turbojet with a basicjet you get the advice:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EFly at 3000 m altitude, pitch 30 degrees, throttle 0.020, to achieve 46.91 m/s using 0.0417307 U/km\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo the basic jet is much slower *and* burns rather more fuel -- at least on this plane.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-01-04T06:15:57Z","Content":"\n\u003Cp\u003Enumberobis: A possibly more efficient strategy with turbojets (particularly with a small, high TWR plane) is to launch the plane out of the atmosphere into a suborbital hop to cover very large distances (using the turbos). It\u0027s not \u003Cem\u003Equite\u003C/em\u003E what OP was after, but in my experience it uses way less fuel than flying through the atmosphere to get there, although admittedly precision\u0027s a bit of a tricky issue because of the spin up/down times on the jets.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-01-04T06:18:03Z","Content":"\n\u003Cp\u003EThe forum merged my update for the basic jets, which obscures my last paragraph that says basically that -- level flight is what my code assumes, but that isn\u0027t necessarily the most efficient.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-01-04T06:20:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EThe forum merged my update for the basic jets, which obscures my last paragraph that says basically that -- level flight is what my code assumes, but that isn\u0027t necessarily the most efficient.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh I did see that, it\u0027s just that your suggestion was a little different; I\u0027m saying you should (in my experience) punch through not only to high altitude, but completely out of the atmosphere (i.e. \u0026gt; 70km)\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-01-04T06:36:32Z","Content":"\n\u003Cp\u003EAh, OK, sure. I\u0027m sure there\u0027s an analyzable tradeoff between the energy to push yourself way high versus the savings from the lack of air.\u003C/p\u003E\u003Cp\u003EFor the OP: if you want to fly level, seems that the most efficient at low altitude is very low throttle -- just enough to just barely stay aloft. This makes you go agonizingly slowly. On the plus side, that makes you very maneuverable.\u003C/p\u003E\u003Cp\u003EFor turbojets, you do better yet by flying as high and fast as possible. You\u0027re still at low throttle, but that\u0027s because you\u0027re low on air. But then your turning radius gets huge.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-01-04T06:54:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EFor turbojets, you do better yet by flying as high and fast as possible. You\u0027re still at low throttle, but that\u0027s because you\u0027re low on air. But then your turning radius gets huge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor OP\u0027s sake it\u0027s worth mentioning that with a pretty reasonable number of intakes (more than in your code) you can fly quite a bit higher than 25km while maintaining (actual) full throttle. My cargo plane has 10 of the structural ones per engine (not terribly efficient, but it\u0027s meant to look good) and it lasts until about 35km before it needs to start throttling back - but by then you usually want to be using the engines in rocket mode (rapiers for easy design...) to get out of the atmosphere quickly anyway.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-01-04T07:02:23Z","Content":"\n\u003Cp\u003EYeah, I\u0027ll need to track down exactly the specifics of how the air-starved engines work. You get more thrust by being at full throttle and air-starved, but you can stave off flame-out by throttle back; it\u0027s confusing to me.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-01-04T07:07:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EYeah, I\u0027ll need to track down exactly the specifics of how the air-starved engines work. You get more thrust by being at full throttle and air-starved, but you can stave off flame-out by throttle back; it\u0027s confusing to me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGoing by KER\u0027s readout (for one engine - it derps badly for multiple ones), turbojets hit flameout at 1000% intake air usage - that is, trying to use 10 times more than is actually available; for rapiers it\u0027s more like 350%. Not sure if that helps at all. Usually my designs are very close to the speed limit of both engines before they actually reach those figures though, so naturally the thrust readouts can\u0027t really be compared in any useful way without knowing exactly how speed (at a fixed altitude) maps to thrust :/. Not to mention KER\u0027s thrust readout for jets is way off at high altitude.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-01-04T07:18:21Z","Content":"\n\u003Cp\u003EAt full throttle and full thrust limiter, flameout occurs at 0.1 for turbojets, meaning they\u0027re getting 10% of the air they request (it\u0027s in the cfg file). That\u0027s about the only thing I understand.\u003C/p\u003E\u003Cp\u003EIt\u0027s the interaction between the throttle, thrust limiter, and air availability that confuses me. What happens when you pull back throttle *and* you don\u0027t have enough air to be at full throttle? How should you set things up to have maximum thrust? Those aren\u0027t clear to me.\u003C/p\u003E\u003Cp\u003EThe \u0027throttle\u0027 that my simulation talks about is based on a simpler model: what fraction of maximum fuel flow should you aim for? Then it\u0027s up to you how to do that with the throttle and thrust limiter.\u003C/p\u003E\u003Cp\u003EAnyway, to answer your question I added two radial scoops to my example and got the following readout:\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFly at 28000 m altitude, pitch 59 degrees, throttle 0.147, to achieve 1265.70 m/s using 0.0273117 U/km\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReally does seem to be that turbojets are all about flying high and steep. Can you imagine if your airliner was pitched up 60 degrees?\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-01-04T07:24:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EReally does seem to be that turbojets are all about flying high and steep. Can you imagine if your airliner was pitched up 60 degrees?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn fairness, (RL) airliners don\u0027t fly at mach 15 (~half orbital velocity) either \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Or mach 3 for that matter, though I think concord might have been able to back in the day.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-01-04T19:58:08Z","Content":"\n\u003Cp\u003EIndeed. I wrote most of this code while bumbling about at 10km at about 300 m/s. If only I could have been going 1200 m/s instead. I\u0027d have been home in time to catch the bus rather than needing to hail a cab from the airport!\u003C/p\u003E\u003Cp\u003EThat does remind me that I assumed you\u0027re at the equator going due East -- unlike what was the case with my flight. Any other latitude and heading will have less of a boost from sidereal rotation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-04T20:01:16Z\u0022 title=\u002201/04/2015 08:01  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 4, 2015\u003C/time\u003E by numerobis\u003C/strong\u003E\n\u003C/span\u003E\n"}]}