{"TopicId":95415,"ForumId":16,"TopicTitle":"Contracts: How to (efficiently) adjust your LAN/Arg of Pe?","CreatedByName":"Mad Vlad","CreatedById":76470,"CreatedDateTime":"2015-01-02T19:59:31Z","PageNum":1,"Articles":[{"CreatedByName":"Mad Vlad","CreatedById":76470,"CreatedDateTime":"2015-01-02T19:59:31Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003ESomething that\u0027s been making me avoid the relatively moneyspinning contracts for putting satellites into very specific orbits is that I don\u0027t really know how to adjust my Longitude of Ascending Node and Argument of Periapsis with any certainty. I use MechJeb for telemetry readout only and would like to know what is the most efficient way of adjusting these two parameters. I\u0027ve tried having a play about with this, but in all honesty, I\u0027ve just turned decent orbits into highly eccentric sub-orbital abortions and ran out of delta V. \u003C/p\u003E\u003Cp\u003EMy thoughts have been that I need to burn Nml\u002B to fix the LAN (but how can I tell when this point should be? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E) Then once I fix the LAN, I then need to do something to change the Arg Pe, but I have no idea how to do that. After those have been fixed, I then adjust my Ap/Pe as normal burning Pro/Ret as necessary. It\u0027s those two sticking points that I\u0027m struggling with (and of course, how to elegantly do this without having to burn thousands of m/s of dV would be awesome).\u003C/p\u003E\u003Cp\u003EHelp please? Thanks in advance!\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-01-02T20:26:13Z","Content":"\n\u003Cp\u003EMoving from one orbit to another:\u003C/p\u003E\u003Cp\u003EIf the orbital planes are within about 30 degrees of each other, adjust directly from one to the other, as you describe.\u003C/p\u003E\u003Cp\u003Erough guide to technique:\u003C/p\u003E\u003Cp\u003E* Look at where the two orbits cross, when facing directly at the planet. There will be two such crossings. Pick the one where you are furthest from the planet. Here, and only here, is where you want to change your plane.\u003C/p\u003E\u003Cp\u003E* Now change your perigee to exactly match the new orbit. Using fancy footwork you can do this combined with the step above, but it gets non-obvious very quickly.\u003C/p\u003E\u003Cp\u003E* Now change your apogee to match.\u003C/p\u003E\u003Cp\u003EIf the two orbit differ by more than 30 degrees (in *any* direction), you would be better off by extending your current orbit out to almost infinity, doing a nearly cost-free plane change there, and joining the second orbit.\u003C/p\u003E\u003Cp\u003E*Same as the above case, but first pick the crossing where you are *closest* to the planet, and burn prograde to extent your apogee waaaaaaay out.\u003C/p\u003E\u003Cp\u003E*now, treat it as a normal plane-\u0026gt;Apogee-\u0026gt;perigee matching set of maneuvers\u003C/p\u003E\u003Cp\u003EBy first heading far out, you actually reduce the total delta-v needed.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-02T20:49:08Z","Content":"\n\u003Cp\u003EI literally ignore those numbers. I do everything by eye in map mode. I also don\u0027t bother aligning the orbits first, though it\u0027s a valid approach if it works for you.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EGet your trajectory touching the target orbit trajectory. MAKE SURE YOU\u0027RE GOING THE RIGHT WAY. Also, the closer you can get to \u0022kissing\u0022 the oribit the better. What I mean, is, touching it without crossing it inward to outward, or at a crazy angle. Just come in, touch, and back off.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECreate a maneuver node at that point and fiddle with it until your resultant orbit matches that orbit.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDo that burn.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EProfit! Literally. You will generate profit from this.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2015-01-03T06:25:50Z","Content":"\n\u003Cp\u003EInstall Precise Node mod - adjust orbit with number pad.\u003C/p\u003E\u003Cp\u003EMy usual tactic is:\u003C/p\u003E\u003Cp\u003E- Use 5/8 and 7/9 to adjust inclination while keeping the dotted line inside the colored line boundary, without putting the Pe inside the orbital body. Do the inclination burn.\u003C/p\u003E\u003Cp\u003E- Switch to a top-down view, use 5/8 and 4/6 and 1/3 to move the hula hoop around into the proper position.\u003C/p\u003E\u003Cp\u003EIf you have DV to spare, you can match up most orbits within 2-3 burns.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-01-03T12:52:47Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EWhat 5thHorseman said.\u003C/strong\u003E It is really that simple. It is very much like a rendezvous: you have to come across the target trajectory, and at the moment you cross it, you \u0022match velocities\u0022 so that you stay on that trajectory. The only difference is that there\u0027s no other ship to meet, so you are at liberty to touch and match whenever you like.\u003C/p\u003E\u003Cp\u003EAs you\u0027re using Mechjeb, I suggest you try the Node Editor. Even if only to display the numbers. I like to start with normal until the plane sits, then prograde until the size is about right, then radial to shift Apo/Peri around.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-01-03T16:17:35Z","Content":"\n\u003Cp\u003EMarvinKitFox and 5thHorseman have covered all the basics here.\u003C/p\u003E\u003Cp\u003E I recommend completing satellite contracts whenever possible. I\u0027ve built pretty much my entire career executing these. Orbits around Kerbin, Mun and Minmus are cheap, quick, easy, and net you lots of cash and science. \u003C/p\u003E\u003Cp\u003EMaybe we should put up a tutorial on this?\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Jimbimbibble","CreatedById":77859,"CreatedDateTime":"2015-01-03T17:47:28Z","Content":"\n\u003Cp\u003EYou can also launch almost into the target orbit. Wait until the space center is directly below the target orbit, then launch and turn the rocket to the desired inclination. Remember that a heading of 90 degrees is 0 inclination and you may have to turn north or south depending on whether you\u0027re launching at an ascending or descending node. If you do this right you can get within 1-2 degrees of the target.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-03T19:20:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EMaybe we should put up a tutorial on this?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m hoping to have a video up before Monday dawns \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-05T03:40:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EI\u0027m hoping to have a video up before Monday dawns \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve just posted the first of what will be at least a 4-video series. In the first video I show you a $6,800 satellite that can complete any Kerbin, Mun, or Minmus satellite contract. I then show you how to use that rocket to complete a simple equatorial orbit without paying attention to any of the numbers on the screen.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/DH-Jii4PhzU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIn video 2 I\u0027ll be doing a tougher Kerbin orbit (Either a Kolniya orbit or one that goes mostly backwards, or at least one that\u0027s crazy tilted), and videos 3 and 4 will detail Mun and Minmus encounters even though they\u0027re very similar.\u003C/p\u003E\n"},{"CreatedByName":"Spheniscine","CreatedById":125755,"CreatedDateTime":"2015-01-05T11:05:38Z","Content":"\n\u003Cp\u003EI also have written a tutorial for satellites here: \u003Ca href=\u0022http://www.lets-play-sphen.com/?p=509\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.lets-play-sphen.com/?p=509\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-01-05T13:52:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EI\u0027ve just posted the first of what will be at least a 4-video series. In the first video I show you a $6,800 satellite that can complete any Kerbin, Mun, or Minmus satellite contract. I then show you how to use that rocket to complete a simple equatorial orbit without paying attention to any of the numbers on the screen.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice guide, should help out a lot of folks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Have you ever considered using FAR and getting into spaceplanes? Can\u0027t recall seeing you fly any, but you might enjoy the cost efficiency of getting satellites to LKO with a plane that\u0027ll come back for 100% refund. Couple of nodes down the tree, a little Rockomax engine can give you a tiny probe with 3300 delta-v; probably get out to Duna or Eve if you\u0027re adventurous with aerobraking! That and you can fit 2-3 satellites of this size into one cargo bay \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAdmittedly solid boosters and 909s are pretty durn cheap, but you know, principles! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MoridinUK","CreatedById":110633,"CreatedDateTime":"2015-01-05T21:01:35Z","Content":"\n\u003Cp\u003ENice advice, but I need some delt-v advice. The orbit I need for my equatorial sat is an Ap of 30,792,903 m and a Pe of 25,581,614. I\u0027m thikning I\u0027m gonna need a couple of 2k delta v for this one? The other sat contract is for mun, but with an incline orbit of some 141 degrees... I\u0027ve not explored Mun yet, in fact I got a little upset I couldn\u0027t do an eva for each biomove in high orbit over kerbin!\u003C/p\u003E\n"},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2015-01-05T23:56:49Z","Content":"\n\u003Cp\u003EMinimus/Mun contracts can be handled by pretty much anything that makes it to LKO with 1500\u002B DV left in the tank. LV-909 \u002B a T400 fuel tank payload fits that bill. If you have 2500\u002B DV in the tank, you can handle multiple contracts, even multiple severe inclination changes around Mun/Minimus.\u003C/p\u003E\u003Cp\u003E25Mm-31Mm is about the distance to Minimus, so you\u0027ll need about 1000-1200 DV. But I\u0027d pack 2000 DV just to make sure you have enough to play with.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-06T01:32:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MoridinUK\u0022 data-cite=\u0022MoridinUK\u0022\u003E\u003Cdiv\u003ENice advice, but I need some delt-v advice. The orbit I need for my equatorial sat is an Ap of 30,792,903 m and a Pe of 25,581,614. I\u0027m thikning I\u0027m gonna need a couple of 2k delta v for this one? The other sat contract is for mun, but with an incline orbit of some 141 degrees... I\u0027ve not explored Mun yet, in fact I got a little upset I couldn\u0027t do an eva for each biomove in high orbit over kerbin!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I say in my video, the ship I make (and the much smaller ship that Spheniscine made that requires you having unlocked the 48-7S) can complete ANY contract in Kerbin\u0027s SOI, Mun\u0027s SOI, or Minmus\u0027 SOI. The small difference in dV required, coupled with the graininess of the parts available, means you\u0027ll usually either have too much or too little fuel for your task assuming you fill your tanks full before launch. So, I built my ship with enough dV to do the most dV-intensive contracts and found that you don\u0027t really waste that much just using the same one for the low-dV contracts.\u003C/p\u003E\n"},{"CreatedByName":"MoridinUK","CreatedById":110633,"CreatedDateTime":"2015-01-06T08:39:58Z","Content":"\n\u003Cp\u003EWell I messed it all up, I took a contract to test the LV-1 engine, so I strapped one to a sat (stayputnik, baterries, raction wheel, panels and antenna) fired it into space to discover I had like 4500 delta V to play with. So I played with putting it in the right orbits for the currently available contracts to get a more perfect idea of the delta V I\u0027d need. But the contracts had vanished! This wasn\u0027t really fair, I understand them going if I\u0027ve achieved them already, but I did so only with an experimental part I certainly can\u0027t lock! I just lost 700k worth of contracts.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E (I\u0027m a wimp playing in normal)\u003C/p\u003E\n"},{"CreatedByName":"MacroNova","CreatedById":126611,"CreatedDateTime":"2015-01-06T17:42:40Z","Content":"\n\u003Cp\u003EFor a while I was really frustrated by the Kerbin Tundra orbit contracts. Waiting for the planet to rotate so the KSC was underneath the orbital path, and launching at an inclination made a huge difference.\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2015-01-06T18:19:43Z","Content":"\n\u003Cp\u003EI don\u0027t get it. Seriously, I don\u0027t.\u003C/p\u003E\u003Cp\u003EI\u0027m seeing tons of threads of people having trouble with fine tuning of orbits while I complete satellite contracts by the dozen by simply eyeballing orbits (or using KER data for Mission Controller contracts) without even being so precise about it.\u003C/p\u003E\u003Cp\u003EIs there a rising degree of precision I\u0027m not aware of?\u003C/p\u003E\u003Cp\u003EI miss the tricky part of contract orbits,really.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-06T23:18:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Janos1986\u0022 data-cite=\u0022Janos1986\u0022\u003E\u003Cdiv\u003EI don\u0027t get it. Seriously, I don\u0027t.\u003Cp\u003EI\u0027m seeing tons of threads of people having trouble with fine tuning of orbits while I complete satellite contracts by the dozen by simply eyeballing orbits (or using KER data for Mission Controller contracts) without even being so precise about it.\u003C/p\u003E\u003Cp\u003EIs there a rising degree of precision I\u0027m not aware of?\u003C/p\u003E\u003Cp\u003EI miss the tricky part of contract orbits,really.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re not missing anything. The descriptions of the contracts imply you need to place your periapsis at a certain place, and your apoapsis at a certain place, and have them be all exact. The player gets out into space and trying to tweak all these things together is like a Rubik\u0027s Hypercube. You can\u0027t even figure out how to change one thing and by trying to do it, end up messing up all the other things.\u003C/p\u003E\u003Cp\u003EEyeballing the orbits and just making a maneuver node to get close is 100% assured to work and 1000% easier than even GLANCING at the particulars in the contracts window.\u003C/p\u003E\n"},{"CreatedByName":"MoridinUK","CreatedById":110633,"CreatedDateTime":"2015-01-07T12:36:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EAs I say in my video, the ship I make (and the much smaller ship that Spheniscine made that requires you having unlocked the 48-7S) can complete ANY contract in Kerbin\u0027s SOI, Mun\u0027s SOI, or Minmus\u0027 SOI. The small difference in dV required, coupled with the graininess of the parts available, means you\u0027ll usually either have too much or too little fuel for your task assuming you fill your tanks full before launch. So, I built my ship with enough dV to do the most dV-intensive contracts and found that you don\u0027t really waste that much just using the same one for the low-dV contracts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour video is out of date \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E the isp for the engines have changed, so you don\u0027t get near as much Dv on this build now.. it is still very useful though..\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-07T12:53:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MoridinUK\u0022 data-cite=\u0022MoridinUK\u0022\u003E\u003Cdiv\u003EYour video is out of date \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E the isp for the engines have changed, so you don\u0027t get near as much Dv on this build now.. it is still very useful though..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOut of date!? I uploaded it 3 days ago! It\u0027s in 0.90 in an almost completely stock build. The only mods I have are there to make the visuals better (And Kerbal Engineer to show the stats in the VAB).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-07T13:10:22Z\u0022 title=\u002201/07/2015 01:10  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 7, 2015\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MacroNova","CreatedById":126611,"CreatedDateTime":"2015-01-07T15:53:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EYou\u0027re not missing anything. The descriptions of the contracts imply you need to place your periapsis at a certain place, and your apoapsis at a certain place, and have them be all exact. The player gets out into space and trying to tweak all these things together is like a Rubik\u0027s Hypercube. You can\u0027t even figure out how to change one thing and by trying to do it, end up messing up all the other things.\u003Cp\u003EEyeballing the orbits and just making a maneuver node to get close is 100% assured to work and 1000% easier than even GLANCING at the particulars in the contracts window.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s how I do it too. The original FinePrint mod gave a percentage deviation instead of using cryptic terms like \u0022moderate\u0022 or \u0022minimal.\u0022 When the apoapsis is 8,000,000m, a 3% deviation ends up being a pretty generous amount, and smart players will recognize that right away. Shoot, I remember getting credit for contracts when I felt like I was still pretty far off; while I was setting up my maneuver node I got the notification.\u003C/p\u003E\n"},{"CreatedByName":"MoridinUK","CreatedById":110633,"CreatedDateTime":"2015-01-08T22:03:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EOut of date!? I uploaded it 3 days ago! It\u0027s in 0.90 in an almost completely stock build. The only mods I have are there to make the visuals better (And Kerbal Engineer to show the stats in the VAB).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have nothing but kerbal engineer installed, as you did and you also had the enhanced nav ball on. I noticed that your lv-909 engines have 390 isp, mine read 300 and the boosters have 240 where as mine are just 225. Unless I\u0027ve missed something else? My deltaV read out isn\u0027t nearly as high as your own, and the rocket struggles to maintain speed after the first lv-909 starts at about 11k up. (I\u0027m playing normal mode and your video you said it was on easy? Could that be it or could I have miss something else?) I did not mean to offend or anger you.\u003C/p\u003E\u003Cp\u003EEdit: I have it, I had kerbal engineer with the atmosphere up, and perhaps you had it set to a vacuum? I guess my problems flying are all my own! Sorry..\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-08T22:05:59Z\u0022 title=\u002201/08/2015 10:05  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 8, 2015\u003C/time\u003E by MoridinUK\u003C/strong\u003E\n\u003C/span\u003E\n"}]}