{"TopicId":955,"ForumId":21,"TopicTitle":"Sol Mk.1","CreatedByName":"WernherVonKerman","CreatedById":2862,"CreatedDateTime":"2011-07-24T01:20:39Z","PageNum":1,"Articles":[{"CreatedByName":"WernherVonKerman","CreatedById":2862,"CreatedDateTime":"2011-07-24T01:20:39Z","Content":"\n\u003Cp\u003EThis is by far the steadiest and most reliable design for a heavy lift I have gotten so far. The first one I am ready to share. I am currently working on a version of this design that will double the payload put into orbit with some success. Will post it here when i get it to the reliability of the Mk.1\u003C/p\u003E\u003Cp\u003EAnd here she is...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1135.photobucket.com/albums/m631/RandulfJ/screenshot57.jpg\u0022 alt=\u0022screenshot57.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i1135.photobucket.com/albums/m631/RandulfJ/screenshot59.jpg\u0022 alt=\u0022screenshot59.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFirst stage is 12 LFEs fed by two tanks each, with an additional 8 SRBs for initial liftoff. After SRBs burn out you will lose about 10m/s velocity before it will begin to accelerate again. First stage burns out at 15km with a speed ~250m/s. Full throttle all the way.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i1135.photobucket.com/albums/m631/RandulfJ/screenshot62.jpg\u0022 alt=\u0022screenshot62.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESecond stage is 4 LFEs fed by 3 tanks each. Until a reliable retro is developed a few seconds will have to be given before igniting second stage or explosions result. I find slowing to around 190m/s gives enough distance without the losing to much. After ignition maintain vertical flight to around 25km before rolling to horizontal, lock STS to about 20 degrees above horizon and continue burn through till tanks are empty. Throttle may have to be adjusted a little as the tanks empty to keep it steady. Second stage should burn out with a velocity just under orbit speed. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i1135.photobucket.com/albums/m631/RandulfJ/screenshot63.jpg\u0022 alt=\u0022screenshot63.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThird stage is an orbital maneuvering stage. With very little fuel needed from this stage to level out initial orbit you have nearly 3 full tanks to do any orbital testing. This is more than enough to do several transfers and have also used my preliminary design of this craft to reach escape velocity and a distance of 32000K before returning. The Sol Mk. 1 is the result of these missions. \u003C/p\u003E\u003Cp\u003EFinal stage is for re-entry with more then enough fuel for several orbital adjustments to bring the CnC module home safely should anything bad happen to the orbital stage. (Like accidentally clicking spacebar instead of ctrl at 500km up. \u0026gt;.\u0026lt; )\u003C/p\u003E\u003Cp\u003EDesign uses all stock engines, fuel tanks, and SRBs. \u003C/p\u003E\u003Cp\u003E2 Add-on couplers where used.. \u003C/p\u003E\u003Cp\u003EThe Lateral Couplers from Sunday Punchs Wobbly rocket pack: \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=79.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=79.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Red Stripes Advanced Decoupler(only cause I hadn\u0027t seen the yellow one yet.) From Quabit: \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=537.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=537.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit: after going over to make sure I didn\u0027t miss anything.. I found that I did. \u0026gt;.\u0026lt;\u003C/p\u003E\u003Cp\u003EYou will also need Quadbits original sheath decouplers found in this link: \u003Ca href=\u0022https://dl.dropbox.com/u/6228295/quabits_ksp_parts.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://dl.dropbox.com/u/6228295/quabits_ksp_parts.zip\u003C/a\u003E\u003C/p\u003E\n"}]}