{"TopicId":95636,"ForumId":44,"TopicTitle":"Temperature difference at aphelion/perihelion","CreatedByName":"livefree75","CreatedById":111756,"CreatedDateTime":"2015-01-04T16:16:15Z","PageNum":1,"Articles":[{"CreatedByName":"livefree75","CreatedById":111756,"CreatedDateTime":"2015-01-04T16:16:15Z","Content":"\n\u003Cp\u003EI was wondering what the average temperature difference on Earth is between its aphelion and perihelion. \u003C/p\u003E\u003Cp\u003EIn other words, does the Earth\u0027s distance from the Sun add to the seasonal effects caused by the Earth\u0027s tilt? Since perihelion occurs in the winter in the Northern Hemisphere, and aphelion happens in the summer, does that mean that the average Northern winter is slightly warmer than the average Southern winter, and the average Northern summer is slightly cooler than the average Southern summer?\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2015-01-04T16:43:58Z","Content":"\n\u003Cp\u003EThe affect of orbit on heat is minimal\u003C/p\u003E\n"},{"CreatedByName":"Brenok","CreatedById":49609,"CreatedDateTime":"2015-01-04T17:53:10Z","Content":"\n\u003Cp\u003EAs said, the effect of the distance to the Sun is praticaally negligible. The fact that the northern hemisphere has more land area and the southern is mostly sea should be a much more significative influence.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2015-01-04T19:09:30Z","Content":"\n\u003Cp\u003EThere\u0027s only a difference of like 5 million km\u0027s. Not even a percent of solar flux radiation difference.\u003C/p\u003E\u003Cp\u003EHowever:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Milutin_Milankovi%C4%87\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Milutin_Milankovi%C4%87\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-01-04T23:31:03Z","Content":"\n\u003Cp\u003ETemperature difference when it comes to radiation is proportional to energy input to the fourth power, T ~= P^4. With a variation of 5 million km in roughly 150, solar flux would vary only around 7%, leaving temperature to vary by less than 2%, and that being if earth\u0027s temperature had sufficient time to actually catch up. It would be worth 6 degrees maximum if it could stabilise, but temperature is still dropping and rising on earth long after solstice, as ocean\u0027s latent heat keeps temperature in line far more than the sun\u0027s different heat could. Angle is far more important to the amount of heat a hemisphere experiences - at 50 degrees or so, solar energy simply due to angle nearly doubles between winter and summer - probably more when accounting for the length of days and nights. A 7% difference in distance is likely to affect weather patterns at a level such that weather forecasting must account for it, but there are far more significant effects for the layperson to take note of.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-01-05T04:19:15Z","Content":"\n\u003Cp\u003ETemperature difference is minimal, but due to higher orbital speed at perihelion winter in northern hemisphere is shorter than in southern. Summer is of course longer too.\u003C/p\u003E\n"}]}