{"TopicId":95978,"ForumId":24,"TopicTitle":"Hello, Fellow Explorers.","CreatedByName":"RetroJay","CreatedById":134637,"CreatedDateTime":"2015-01-08T01:42:11Z","PageNum":1,"Articles":[{"CreatedByName":"RetroJay","CreatedById":134637,"CreatedDateTime":"2015-01-08T01:42:11Z","Content":"\n\u003Cp\u003EGreetings to one and all.\u003C/p\u003E\u003Cp\u003EI only signed up last night but have been playing for a couple of months now. (not that I am doing very well.)\u003C/p\u003E\u003Cp\u003ESo far I have, finally, designed and built a fairly good craft that has managed to get Jeb, Bill and Bob Kerman onto Mun.\u003C/p\u003E\u003Cp\u003EThey arrived all in one piece and the lander, with science module, touched down upon Muns surface with expert handling of the controls... Cough!... cough!\u003C/p\u003E\u003Cp\u003EOk so things got a bit hairy for a moment or two but no damage was sustained.\u003C/p\u003E\u003Cp\u003EThe only problem is that the hapless trio are now marooned as the lander came down on fumes and the rockets only have enough fuel to make them burp.\u003C/p\u003E\u003Cp\u003EI have been trying to mount a rescue mission, without success, and have killed off so many Kerbals that they must see me as a mass murderer!\u003C/p\u003E\u003Cp\u003EWhat I would like to do is get a Rover and some extra fuel to them.\u003C/p\u003E\u003Cp\u003EThe reason I want the Rover is to find an interesting Arch of rock I saw whilst on one of my orbits (Looks kind of alien.) \u003C/p\u003E\u003Cp\u003EWhat is the best method of achieving this?\u003C/p\u003E\u003Cp\u003EI absolutely love... love... love KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EYours.\u003C/p\u003E\u003Cp\u003EJay.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-01-08T01:50:59Z","Content":"\n\u003Cp\u003EWhat kind of parts do you have, or are you playing sandbox? \u003C/p\u003E\u003Cp\u003EIf you have the claw on the rover, you can grab the stranded vessel and pump fuel into it by right-clicking on its tank, alt-right-clicking on the ship\u0027s tanks, and telling it to transfer fuel. \u003C/p\u003E\u003Cp\u003EBut actually, it might be easier to just fly another ship there to give them a ride. Unless you land very nearby, driving across Mun in a rover always takes much longer than you think it will, and that\u0027s assuming you don\u0027t crash long the way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RetroJay","CreatedById":134637,"CreatedDateTime":"2015-01-08T02:07:03Z","Content":"\n\u003Cp\u003EHi Vanamonde.\u003C/p\u003E\u003Cp\u003EI am playing sandbox, at the moment. I thought it best to try a few things before I embark on career mode.\u003C/p\u003E\u003Cp\u003EThat\u0027s a handy tip though the claw on the rover idea. Only problem with that is my tank is quite a long way up. (my lander resembles a multi-storey car park on legs.)\u003C/p\u003E\u003Cp\u003EYeah... I think I might just launch another ship, the same one that got them there but with extra fuel to get them home.\u003C/p\u003E\u003Cp\u003EIt\u0027s a shame because I really wanted to check out that Arch I saw. Oh well, maybe another day.\u003C/p\u003E\n"},{"CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2015-01-08T02:09:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EBut actually, it might be easier to just fly another ship there to give them a ride. Unless you land very nearby, driving across Mun in a rover always takes much longer than you think it will, and that\u0027s assuming you don\u0027t crash long the way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is one of the best pieces of advice to give! Don\u0027t waste you\u0027re time driving.\u003C/p\u003E\n"}]}