{"TopicId":96040,"ForumId":69,"TopicTitle":"Attachmentrules issue on some parts","CreatedByName":"aradapilot","CreatedById":88559,"CreatedDateTime":"2015-01-08T19:32:23Z","PageNum":1,"Articles":[{"CreatedByName":"aradapilot","CreatedById":88559,"CreatedDateTime":"2015-01-08T19:32:23Z","Content":"\n\u003Cp\u003ENeither probe cores nor batteries can be attached radially with stock attachmentrules, making it impossible to build a ship that deploys probes without their own fuel tanks. You can stack them vertically, but only if the top and bottom surfaces are free, and those would normally be used for science equipment or antennas. I don\u0027t see any reason to prevent attachment like this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://zeropride.com/trey/screenshot.png\u0022 alt=\u0022screenshot.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis also precludes use of such probes in the new cargo bay, though the bay is designed for only vertical payloads (would be nice to attach stuff to the internal surface without needing a long adapter spun around from the outside, but that might be a bigger engineering project than changing some attachmentrules).\u003C/p\u003E\u003Cp\u003ELinux x64 0.90, but this is a part config issue, so it would be global\u003C/p\u003E\n"},{"CreatedByName":"wibou","CreatedById":134135,"CreatedDateTime":"2015-01-08T21:44:38Z","Content":"\n\u003Cp\u003EYou can add girders radially either by themselves or over decoupler. Then add horizontal girders over those. It would look ugly but it would work. \u003C/p\u003E\u003Cp\u003EOr, again using girder, you could use the hexagonal girder and then build up some \u0022arm\u0022 on this... slightly less ugly and you wouldn\u0027t block the top surface.\u003C/p\u003E\u003Cp\u003EMake sure you don\u0027t put too much weight on those, however.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-08T21:45:34Z\u0022 title=\u002201/08/2015 09:45  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 8, 2015\u003C/time\u003E by wibou\u003C/strong\u003E\n\u003Cbr\u003Efixed typos\n\u003C/span\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-01-08T23:01:50Z","Content":"\n\u003Cp\u003EI\u0027ve had \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78348-WIP-SurfaceNodes-Make-part-placement-make-sense-v0-2\u0022 rel=\u0022external nofollow\u0022\u003ESurfaceNodes\u003C/a\u003E installed for so long, I keep forgetting you guys can\u0027t radially attach batteries and reaction wheels. Completely agree - make this stock.\u003C/p\u003E\n"}]}