{"TopicId":96078,"ForumId":32,"TopicTitle":"Maybe the joints between parts are a little Too strong...","CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-01-09T02:54:33Z","PageNum":1,"Articles":[{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-01-09T02:54:33Z","Content":"\n\u003Cp\u003EStill wobbly, but the joints just don\u0027t want to let go...\u003C/p\u003E\u003Cp\u003E\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 width=\u0022640\u0022 height=\u0022360\u0022\u003E\u003C/iframe\u003E\u003C/p\u003E\n"},{"CreatedByName":"toric5","CreatedById":58046,"CreatedDateTime":"2015-01-09T03:05:27Z","Content":"\n\u003Cp\u003Ethey aren\u0027t usually that strong. they are that wobbly. serves you right for supporting a 2.5m stack with a bunch of .675m parts.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-01-09T03:11:37Z","Content":"\n\u003Cp\u003EIt wasn\u0027t planned, I just wanted to use up the leftover fuel in the tanks after docking. I didn\u0027t expect it to hold together that long.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-01-09T03:26:22Z","Content":"\n\u003Cp\u003EThe problem is that they are too flexible. They should be less wobbly, but maybe break more easily.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2015-01-09T04:43:04Z","Content":"\n\u003Cp\u003EHmm, yeah. Pretty sure once the bend is past 90 degrees it should break!\u003C/p\u003E\u003Cp\u003ESeen that happen on a re-entry that went bad but no... Nothing broke.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-01-09T04:52:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022 data-cite=\u0022StrandedonEarth\u0022\u003E\u003Cdiv\u003EStill wobbly, but the joints just don\u0027t want to let go...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, when the ARM update came, part links were made much stronger, but not much stiffer.\u003C/p\u003E\u003Cp\u003EThe ARM update was supposed to allow stiffness and strength to be set separately -- apparently this isn\u0027t true or the wrong choice was taken~\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-01-09T14:21:29Z","Content":"\n\u003Cp\u003EThat was spectacular \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E And I thought \u003Ca href=\u0022https://flic.kr/p/nkQMcx\u0022 rel=\u0022external nofollow\u0022\u003Ethis case\u003C/a\u003E (which could have stayed there forever) was bad. The strength-stiffness ratio is seriously out of whack. A degree of bend is desirable to make things visible to the player before they snap, but not full 180 degree springs.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-01-09T14:23:36Z","Content":"\n\u003Cp\u003EI\u0027ve had the front end of my asteroid grabbers do that before. Large masses and a small attachment point can yield some ridiculous results like that.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2015-01-09T14:35:50Z","Content":"\n\u003Cp\u003EUsing The Cars as a soundtrack was genius. You get some rep just for that touch ...\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2015-01-09T15:01:46Z","Content":"\n\u003Cp\u003EI think they\u0027re definitely too strong. Building giant rockets has lots much of it\u0027s challenge because everything sticks together so easily these days. \u003C/p\u003E\u003Cp\u003EIt should be refined as a feature. Different parts already seem to have different attachment strengths, and the stats should be listed in the game.\u003C/p\u003E\u003Cp\u003E It\u0027s something that your Kerbals should progress with in career mode, with rockets starting off flimsy as hell and getting better through time. It\u0027d give more use for structural parts as things like pylons would have stronger attatchments, and IMO it\u0027d be a more \u0022fun\u0022 restriction than some of existing ones in career mode. \u003C/p\u003E\u003Cp\u003ECurrently at the beginning of career mode we\u0027re limited by 30 parts and 18 tons. There\u0027s not really much \u0022fun\u0022 to be generated from such restrictions. All they generate is annoyance when you build your perfect craft and it turns out to be 18.1 tons or needs 31 parts.\u003C/p\u003E\u003Cp\u003EJoint strength limitations would be fun, and more in the Kerbal spirit. You can \u003Cem\u003Etry\u003C/em\u003E and build a moon rocket whilst your kerbals are still using the basic spit and chewing-gum joints, but it\u0027d probably be advisable to upgrade to school-glue or crazy-glue attachments before attempting a rocket so big.\u003C/p\u003E\u003Cp\u003ETo stop us wasting money in career mode with rockets falling apart on the launchpad, there could be a simulate stress button in the VAB which would turn all the attachment points different colors depending on the stress levels on the joints. It\u0027d be a very valuable tool for the players to assess the riskiness of their launch vehicles before setting them on the pad.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-09T15:06:55Z\u0022 title=\u002201/09/2015 03:06  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 9, 2015\u003C/time\u003E by Moar Boosters\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2015-01-09T15:27:40Z","Content":"\n\u003Cp\u003ELooks too much fun, to be taken out of the game... i now want too wobble my ship too!!!!\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-09T15:34:33Z","Content":"\n\u003Cp\u003EEspecially with low mass parts, the connection can be so flexible that under certain circumstances a large gap can emerge between two connected parts, without the connection breaking.\u003C/p\u003E\n"},{"CreatedByName":"KotDemopan","CreatedById":98561,"CreatedDateTime":"2015-01-09T15:37:21Z","Content":"\n\u003Cp\u003EJoints too strong? i think you haven\u0027t attempted to land a Mk3 Plane yet. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-01-09T19:13:55Z","Content":"\n\u003Cp\u003EOn the one hand, don\u0027t jinx it! We\u0027ve come a long way since the days of even small rockets wobbling themselves to death on the launchpad!\u003C/p\u003E\u003Cp\u003EOn the other, part connections could stand to trade a little bit of tensile strength for rigidity. In the meantime, I prescribe struts.\u003C/p\u003E\n"},{"CreatedByName":"WWEdeadman","CreatedById":105591,"CreatedDateTime":"2015-01-09T20:37:58Z","Content":"\n\u003Cp\u003EWell, looking at your video I\u0027d say yes. Then again, I softly land a plane made of MK III parts, and it falls to individual pieces. I\u0027d say they\u0027re just very inconsistent in their stability.\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2015-01-09T21:00:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moar Boosters\u0022 data-cite=\u0022Moar Boosters\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECurrently at the beginning of career mode we\u0027re limited by 30 parts and 18 tons. There\u0027s not really much \u0022fun\u0022 to be generated from such restrictions. All they generate is annoyance when you build your perfect craft and it turns out to be 18.1 tons or needs 31 parts.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile i don\u0027t object to the rest of the stuff you said I will dispute that the current restrictions of early career mode don\u0027t generate \u0022fun\u0022.\u003C/p\u003E\u003Cp\u003EThe craft below was built and perfected as a direct result of having to work with mass and part-count restrictions, and getting it to work as it needed to was many hours of fun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sE1DeKkl.png\u0022 alt=\u0022sE1DeKkl.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ODC7v21l.png\u0022 alt=\u0022ODC7v21l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d7hsypAl.png\u0022 alt=\u0022d7hsypAl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPersonally I would balance this aspect of career mode by adding more building tiers.\u003C/p\u003E\u003Cp\u003ESorry for the digression\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-01-09T22:04:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SofusRud\u0022 data-cite=\u0022SofusRud\u0022\u003E\u003Cdiv\u003EWhile i don\u0027t object to the rest of the stuff you said I will dispute that the current restrictions of early career mode don\u0027t generate \u0022fun\u0022.\u003Cp\u003EThe craft below was built and perfected as a direct result of having to work with mass and part-count restrictions, and getting it to work as it needed to was many hours of fun.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with this ; the mass/part restrictions are fun (well, the first to second tier jump is way too big, there needs to be a first-and-a-half tier building set with like 60t/90 parts or thereabouts). However, I\u0027d also like to see Moar Booster\u0027s concept of strength upgrades - no reason why we couldn\u0027t have both!\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-01-10T00:04:31Z","Content":"\n\u003Cp\u003EOf course, that rocket did finally fail when the tanks collided...\u003C/p\u003E\u003Cp\u003EThis is the satellite in question that had so much flex to it:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/edolcvG.jpg\u0022 alt=\u0022edolcvG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou may notice that that staging needs correcting. When I launched it, it fell on the pad and destroyed it before the engines lit and the rocket successfully flew to orbit\u003C/p\u003E\u003Cp\u003EAnd in 0.25 I had this plane that I forgot to to strut \u003Cem\u003Earound\u003C/em\u003E the payload. Once I released the payload it got rather... flappy.... But it held together until it hit the ground.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4hz4iHT.png\u0022 alt=\u00224hz4iHT.png\u0022\u003E\u003C/p\u003E\n"}]}