{"TopicId":96284,"ForumId":25,"TopicTitle":"Recover Every Part","CreatedByName":"ttnarg","CreatedById":91776,"CreatedDateTime":"2015-01-10T22:17:20Z","PageNum":1,"Articles":[{"CreatedByName":"ttnarg","CreatedById":91776,"CreatedDateTime":"2015-01-10T22:17:20Z","Content":"\n\u003Cp\u003ERules:\u003C/p\u003E\u003Cp\u003EPlay on career (The difficulty is up to you but will be noted)\u003C/p\u003E\u003Cp\u003EAll parts must be recovered on land.\u003C/p\u003E\u003Cp\u003EAll parts must be recovered at or close to the KSC (any where on the flat ground around the KSC is fine).\u003C/p\u003E\u003Cp\u003EAll stages of the flight must be recoved.\u003C/p\u003E\u003Cp\u003EIf any part is destroyed in flight you have failed the Challenge, reload or try again.\u003C/p\u003E\u003Cp\u003EAs there is the risk of instance fail, you may back up your save files.\u003C/p\u003E\u003Cp\u003EIf you play on Custom you must start with 0 Science. This challenge is about start with the basics and not about jumping right away to SSTO.\u003C/p\u003E\u003Cp\u003ECompletion:\u003C/p\u003E\u003Cp\u003EWhen you can build crafts in orbit by docking parts together you will of matered this challenge. But I would love to see what sort of mission you can do once you got to this point and still recover every part. Feel free to show off.\u003C/p\u003E\u003Cp\u003EMods:\u003C/p\u003E\u003Cp\u003EThis can be done stock, its hard getting to orbit at low teck levels but can be done. I encorage you to do this stock but if you want to use mod you can please list them.\u003C/p\u003E\u003Cp\u003EProof: \u003C/p\u003E\u003Cp\u003EScreen shots of key missions would be nice but basicly just you word that you done it should be fine. Be sure to say what difficulty you\u0027re playing on.\u003C/p\u003E\u003Cp\u003EI\u0027m playing on ModerateRules:\u003C/p\u003E\u003Cp\u003EPlay on career (The difficulty is up to you but will be noted*.)\u003C/p\u003E\u003Cp\u003EAll parts must be recovered on land.\u003C/p\u003E\u003Cp\u003EAll parts must be recovered at or close to the KSC (any where on the flat ground around the KSC is fine).\u003C/p\u003E\u003Cp\u003EAll stages of the flight must be recoved.\u003C/p\u003E\u003Cp\u003EIf any part is destroyed in flight you have failed the Challenge, reload or try again.\u003C/p\u003E\u003Cp\u003EAs there is the risk of instance fail, you may back up your save files.\u003C/p\u003E\u003Cp\u003EIf you play on Custom you most start with 0 Science. This challenge is about start with the basics and not about jumping right away to SSTO.\u003C/p\u003E\u003Cp\u003E*dont play it on Custom with the setting harder then hard. If you want to show off, show us what planets/moons you can land on and still recover every part.\u003C/p\u003E\u003Cp\u003ECompletion:\u003C/p\u003E\u003Cp\u003EWhen you can build crafts in orbit by docking parts together you will of matered this challenge. But I would love to see what sort of mission you can do once you got to this point and still recover every part. Feel free to show off.\u003C/p\u003E\u003Cp\u003EMods:\u003C/p\u003E\u003Cp\u003EThis can be done stock, its hard getting to orbit at low teck levels but can be done. I encorage you to do this stock but if you want to use mod you can please list them.\u003C/p\u003E\u003Cp\u003EProof: \u003C/p\u003E\u003Cp\u003EScreen shots of key missions would be nice but basicly just you word that you done it should be fine. Be sure to say what difficulty you\u0027re playing on.\u003C/p\u003E\u003Cp\u003EI\u0027m playing on Moderate, here a screen shot after I got jeb in to orbit for the first time. (This was the first stage)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dtfHrZT.jpg\u0022 alt=\u0022dtfHrZT.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-01-11T16:44:26Z","Content":"\n\u003Cp\u003EAt low tech, the only viable method is pure-vertical launch, to allow parachute recovery of first stage, followed by easy but inefficient second-stage-to-orbit.\u003C/p\u003E\u003Cp\u003EThe only real concern is getting the first stage\u0027s apogee high enough to allow you time to enter orbit with second stage, *before* the first stage falls back to 22km alt and vanishes in a puff of logic.\u003C/p\u003E\n"}]}