{"TopicId":96390,"ForumId":16,"TopicTitle":"Many questions about SSTO\u0026#039;s, Shuttles and spaceplanes in general.","CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2015-01-11T18:35:10Z","PageNum":1,"Articles":[{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2015-01-11T18:35:10Z","Content":"\n\u003Cp\u003EActually there\u0027s one big question. \u0022HOW.\u0022\u003C/p\u003E\u003Cp\u003EI\u0027ve been trying for about the last week using 0.90. I\u0027ve tried using mostly stock, I\u0027ve tried copying designs seen in the exchange, I\u0027ve tried turbojets, rapiers and traditional rocket engines, combinations, Solid-state-booster assisted combinations... and I\u0027ve come to one inescapable conclusion.\u003C/p\u003E\u003Cp\u003EIT IS (CENSORED) (CENSORED) (REALLY CENSORED) IMPOSSIBLE. Shuttle launch style craft freehweel like they\u0027re high-divers showing off before a big splash, things launched from the runway barely get off the ground or run clean out of power by the time they hit 25km, or just hit the ground like lawn darts.\u003C/p\u003E\u003Cp\u003EAm I insane or is there some magic trick I\u0027m missing here?\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-11T18:46:42Z","Content":"\n\u003Cp\u003ESSTOs - vertical-launch rockets are easiest but least efficient, vertical-launch jets are most efficient if you can land them, spaceplanes are hardest to build and fly.\u003C/p\u003E\u003Cp\u003EShuttles - just don\u0027t, as has been said in many, many threads. The US \u0027space-shuttle\u0027 design is a very difficult, inefficient design in KSP that performs worse than almost any other way of doing things. It isn\u0027t a SSTO either!\u003C/p\u003E\u003Cp\u003ESpaceplanes - are a pain in the arse. Some people even take them to other moons and planets, which just shows how little they care about efficiency. Lots of tutorials around.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-11T19:59:14Z\u0022 title=\u002201/11/2015 07:59  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 11, 2015\u003C/time\u003E by Pecan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2015-01-11T19:02:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003ESSTOs - vertical-launch rockets are easiest but leat efficient, vertical-launch jets are most efficient if you can land them, spaceplanes are hardest to build and fly.\u003Cp\u003EShuttles - just don\u0027t, as has been said in many, many threads. The US \u0027space-shuttle\u0027 design is a very difficult, inefficient design in KSP that performs worse than almost any other way of doing things. It isn\u0027t a SSTO either!\u003C/p\u003E\u003Cp\u003ESpaceplanes - are a pain in the arse. Some people even take them to other moons and planets, which just shows how little they care about efficiency. Lots of tutorials around.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo what, the best I can hope for my station is Soyuz style craft? I\u0027ve tried vertical launch jets and they just do the \u0027summersaulting high-diver\u0027 after 25km.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-01-11T19:05:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tassyr\u0022 data-cite=\u0022Tassyr\u0022\u003E\u003Cdiv\u003EActually there\u0027s one big question. \u0022HOW.\u0022\u003Cp\u003EI\u0027ve been trying for about the last week using 0.90. I\u0027ve tried using mostly stock, I\u0027ve tried copying designs seen in the exchange, I\u0027ve tried turbojets, rapiers and traditional rocket engines, combinations, Solid-state-booster assisted combinations... and I\u0027ve come to one inescapable conclusion.\u003C/p\u003E\u003Cp\u003EIT IS (CENSORED) (CENSORED) (REALLY CENSORED) IMPOSSIBLE. Shuttle launch style craft freehweel like they\u0027re high-divers showing off before a big splash, things launched from the runway barely get off the ground or run clean out of power by the time they hit 25km, or just hit the ground like lawn darts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAm I insane or is there some magic trick I\u0027m missing here?\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENeither. You\u0027re just not building according to the requirements. There are a lot of specialized engineering principles involved in SSTOs (especially spaceplanes) and a lot of specialized piloting principles (especially jet powered VTVL). \u003C/p\u003E\u003Cp\u003E They are not difficult to master, but you have to follow them if you want a successful SSTO.\u003C/p\u003E\u003Cp\u003E As Pecan said, there are lots of tutorials around.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2015-01-11T19:18:55Z","Content":"\n\u003Cp\u003EThis is the smallest version of my Kerbooster stack shuttle. I use it for satellite contracts on my hardcore custom difficulty save.\u003C/p\u003E\u003Cp\u003EIt\u0027s part of my family of fly-back boosters that I use in place of shuttles. It\u0027s two stage to orbit, but the only parts that are expended are \u0022trash bins full of boom\u0022 SRBs, which are dirt cheap, and are worth next to nothing when empty anyway.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/krRFM5P.jpg\u0022 alt=\u0022krRFM5P.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fdgAuva.jpg\u0022 alt=\u0022fdgAuva.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/L3efQwq.jpg\u0022 alt=\u0022L3efQwq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7f2UvwR.jpg\u0022 alt=\u00227f2UvwR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/K3xa1HA.jpg\u0022 alt=\u0022K3xa1HA.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FobnDZj.jpg\u0022 alt=\u0022FobnDZj.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-11T19:57:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tassyr\u0022 data-cite=\u0022Tassyr\u0022\u003E\u003Cdiv\u003ESo what, the best I can hope for my station is Soyuz style craft? I\u0027ve tried vertical launch jets and they just do the \u0027summersaulting high-diver\u0027 after 25km.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs usual, Slashy and I are on the same page here.\u003C/p\u003E\u003Cp\u003EThe \u003Cem\u003Eeasiest\u003C/em\u003E, but not the best, you can hope for is what SpaceX hasn\u0027t quite managed yet - so we start ahead of the curve :-)\u003C/p\u003E\u003Cp\u003EThat is - launch a rocket; make sure it\u0027s got a probe-core, a couple of drogue parachutes and 200 - 500m/s more dV than needed to get to orbit (I aim for 4,900m/s). Decouple your payload in orbit, use ~200m/s to de-orbit, ~300m/s to perform a drogue-assisted powered landing. Practice and you can get back to KSC for 98% recovery almost every time.\u003C/p\u003E\u003Cp\u003EIf the same thing with jets somersaults at higher altitudes it\u0027s likely you\u0027ve got your intakes creating drag ahead of the CoM. There\u0027s nothing particularly difficult about jets without wings, because you don\u0027t have to care much about balance - you do need to care a bit about drag though, because you\u0027re going to be spending so much time in atmosphere. Pictures of craft you\u0027re having trouble with always help.\u003C/p\u003E\u003Cp\u003EFor spaceplanes much has been written and, sorry, but I can only say that like docking or those other specialised skills it will \u0027click\u0027 if you read and practice enough and you go from not being able to get off the ground to being able to put almost anything into orbit. It\u0027s tough, but that\u0027s the way it goes :-(\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-11T19:59:45Z\u0022 title=\u002201/11/2015 07:59  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 11, 2015\u003C/time\u003E by Pecan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2015-01-11T20:10:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tassyr\u0022 data-cite=\u0022Tassyr\u0022\u003E\u003Cdiv\u003EActually there\u0027s one big question. \u0022HOW.\u0022\u003Cp\u003EI\u0027ve been trying for about the last week using 0.90. I\u0027ve tried using mostly stock, I\u0027ve tried copying designs seen in the exchange, I\u0027ve tried turbojets, rapiers and traditional rocket engines, combinations, Solid-state-booster assisted combinations... and I\u0027ve come to one inescapable conclusion.\u003C/p\u003E\u003Cp\u003EIT IS (CENSORED) (CENSORED) (REALLY CENSORED) IMPOSSIBLE. Shuttle launch style craft freehweel like they\u0027re high-divers showing off before a big splash, things launched from the runway barely get off the ground or run clean out of power by the time they hit 25km, or just hit the ground like lawn darts.\u003C/p\u003E\u003Cp\u003EAm I insane or is there some magic trick I\u0027m missing here?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, I prefer spaceplane SSTOs for reusable vehicles, so that\u0027s what all my advice is going to focus on. I only use horizontal take-off and landing aircraft. \u003C/p\u003E\u003Cp\u003EFirst bit of advice I would give is to get FAR. The stock aerodynamic model is... developmentally challenged. FAR improves the way vessels fly and gives you some nice in-flight tools.\u003C/p\u003E\u003Cp\u003ESecond piece of advice, read \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52080-Basic-Aircraft-Design-Explained-Simply-With-Pictures\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E. Best advice for aircraft design in KSP I\u0027ve ever seen.\u003C/p\u003E\u003Cp\u003EFinally, I would recommend you build regular aircraft before you start working on aircraft that can even \u003Cem\u003Esub-\u003C/em\u003Eorbital trajectories (entering space, but not an orbit). Get used to taking off and landing. Figure out how to build vessels that perform well in the lower atmosphere, then figure out high atmosphere, \u003Cem\u003Ethen\u003C/em\u003E figure out how to get to orbit. Each is going to build on the other, and you need to tackle each step in turn. The \u003Cem\u003Eworst\u003C/em\u003E thing I see players do is go straight to large, complex vessels before they get a handle on simpler, necessary fundamentals.\u003C/p\u003E\u003Cp\u003EAlso, learn all this in a sandbox game before you start doing it in a career game. It\u0027ll just be easier to \u003Cem\u003Elearn\u003C/em\u003E with all the parts before you start spending funds on the jets/planes.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003ESSTOs - vertical-launch rockets are easiest but leat efficient, vertical-launch jets are most efficient if you can land them, spaceplanes are hardest to build and fly.\u003Cp\u003EShuttles - just don\u0027t, as has been said in many, many threads. The US \u0027space-shuttle\u0027 design is a very difficult, inefficient design in KSP that performs worse than almost any other way of doing things. It isn\u0027t a SSTO either!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESpaceplanes - are a pain in the arse.\u003C/strong\u003E Some people even take them to other moons and planets, which just shows how little they care about efficiency. Lots of tutorials around.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEmphasized part is pretty dismissive of very valid design strategy.\u003C/p\u003E\u003Cp\u003ESpaceplanes are moderately difficult to learn, but not that bad when you find a design that works for your play style. They\u0027re \u003Cem\u003Emost\u003C/em\u003E efficient when used as surface-to-orbit ferries, but given how disgustingly inefficient some players build rockets, it\u0027s hard to criticize players for building single-stage vessels that go beyond LKO...\u003C/p\u003E\u003Cp\u003EIMO, Shuttles are a total nightmare, though. Much worse to design than spaceplanes due to the offset thrust and asymmetric design. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tassyr\u0022 data-cite=\u0022Tassyr\u0022\u003E\u003Cdiv\u003ESo what, the best I can hope for my station is Soyuz style craft? I\u0027ve tried vertical launch jets and they just do the \u0027summersaulting high-diver\u0027 after 25km.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, you can do cool stuff with spaceplanes. It takes work though. I tried and quit a handful of times before getting a handle on it. Try the advice above, figure out where you\u0027re having trouble and come on back with more specific questions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-11T20:17:46Z\u0022 title=\u002201/11/2015 08:17  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 11, 2015\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-01-11T22:24:26Z","Content":"\n\u003Cp\u003EGood plan to be able to build normal aircraft first - but remember spaceplanes don\u0027t need to be aerobatic, even just turning is fairly optional if you use a simple up-orbit-reentry profile. Obviously you\u0027ll need to be able to change direction slightly to line up, and if you miss the first attempt turning is handy for going around again... good pitch control on the other hand is vital. Spaceplanes also change mass in a way normal aircraft generally don\u0027t, given the relatively huge amount of fuel burned.\u003C/p\u003E\u003Cp\u003EIf it\u0027s a craft to launch small probes or bunches of satellites it doesn\u0027t even need to be an orbiter, so no need for RCS or fuel for a re-entry burn - just has to be out of atmo long enough to detach payloads \u0026amp; get *those* into basic orbits, then you can just glide back to the runway. I have a 50k-ish craft that\u0027ll lift several tons of sats to 90-100km AP, with a shallow ascent that\u0027s plenty of time to get them stabilized - and must have done 20\u002B missions in the same ship by now for just the cost of some fuel. I\u0027ll work out exactly what the fuel use is sometime but there\u0027s no way it\u0027s anything near a full vertical launcher\u0027s worth.\u003C/p\u003E\n"},{"CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2015-01-11T22:35:37Z","Content":"\n\u003Cp\u003EOne thing I\u0027ve found with spaceplanes is that you have to watch the balance as fuel is consumed. As you use up fuel from the forward tanks, the COM moves further back and eventually the control surfaces can\u0027t compensate for the pitch-up tendency. Gradually move fuel from aft tanks forward as the flight progresses.\u003C/p\u003E\u003Cp\u003EThe trick with spaceplanes is to fly a profile that allows you to build up speed in the atmosphere. Ideally you can get a suborbital trajectory before the jets run out of air, coast to apoapsis, and circularise the orbit with a small amount of rocket fuel. If you reduce the throttle at high altitudes you should be able to keep the jets running just enough at 40km or more. As Van Disaster mentioned, if you\u0027re using it to launch a satellite or probe you don\u0027t even need the rockets- just get it nearly to orbit with the jets, separate the payload at apoapsis and use its engines to complete the orbit.\u003C/p\u003E\u003Cp\u003EVertical SSTOs are less efficient, but simpler. Essentially you\u0027re building a rocket with jet engines on the side and lots of intakes. With these you want to skim along sideways to build up as much speed as possible before the jets die. Switch over to rockets and carry on to orbit.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-01-11T23:57:12Z","Content":"\n\u003Cp\u003ESpaceplanes \u003Cem\u003EARE \u003C/em\u003Ehard - reality still doesn\u0027t have a HOTOL orbiter \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E NASA style shuttles are \u003Cem\u003Enearly\u003C/em\u003E impossible in KSP due to the asymmetry of them. You\u0027d need angled engines to push through the centre of mass of the shuttle and (orange) fuel tank, and they\u0027d need to adjust as the fuel emptied. With the tank detached, you\u0027d need to swivel them back into alignment with the orbiter. Infernal Robotics \u003Cem\u003Emight\u003C/em\u003E be able to help, but it would be hard.\u003C/p\u003E\u003Cp\u003EIf you aren\u0027t using FAR, that will help a lot, since plane shaped stuff will actually start to fly like a plane, rather than a brick. Check out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/90747-Kerbodyne-SSTO-Division-Omnibus-Thread\u0022 rel=\u0022external nofollow\u0022\u003EWanderfound\u0027s thread\u003C/a\u003E for a lot of great design ideas that work with this!\u003C/p\u003E\u003Cp\u003EOh, and getting rapier engines just simplifies everything. You can make something with over 1.2 TWR on air at sea level, and it\u0027ll just fly like a rocket with wings, right up to orbit. Not efficient or long range, but a good LKO delivery system. Prior to rapiers, it\u0027s really hard to make a decent HOTOL SSTO that can haul cargo.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-12T00:12:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003E...Emphasized part [spaceplanes - are a pain in the arse] is pretty dismissive of very valid design strategy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are right. My intention was not to dismiss but indicate that they require a whole new(ish) set of skills to design, build and fly.\u003C/p\u003E\u003Cp\u003EThe rest of your comments are spot on and your final line:\u003C/p\u003E\u003Cp\u003E\u0022...you can do cool stuff with spaceplanes. It takes work though. I tried and quit a handful of times before getting a handle on it.\u0022 is what I meant.\u003C/p\u003E\u003Cp\u003E[Different subject] It is amusing though that people who think \u0027spaceplane\u0027 is \u003Cem\u003Ethe\u003C/em\u003E way to do things are amongst the most strident about stock aerodynamic woes. \u0022Realism counts\u0022 ... except there\u0027s never been a real spaceplane, as eddiew points out. What I find most interesting here is that the Kerbal \u003Cstrong\u003ESpace\u003C/strong\u003E Program is, perhaps, most attractive to flight-sim fans and the strength of opinions offered about the atmospheric flight-model often outweighs that for, well, space. There\u0027s no right or wrong way to have fun, of course, but it\u0027s no wonder Squad didn\u0027t expect the \u0027flight\u0027 part to be quite so important. I think it\u0027s a noteworthy point about end-objectives not necessarily being what you expected them to be when you started (RAD FTW!).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-12T00:22:28Z\u0022 title=\u002201/12/2015 12:22  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 12, 2015\u003C/time\u003E by Pecan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"WyDavies","CreatedById":116800,"CreatedDateTime":"2015-01-12T00:46:00Z","Content":"\n\u003Cp\u003EIf you are trying for a spaceplane, first try to make a plane that can fly up to 30,000 metres. Then swap the jet fuel tanks for rocket fuel tanks and swap the jets for RAPIERs. An alternative is to add just a little bit of rocket fuel and add an atomic rocket engine. This is much trickier as you need to get up to at least 40,000 metres and 2000 m/s before switching to the rocket (atomic rockets have very poor thrust and work poorly in the atmosphere).\u003C/p\u003E\u003Cp\u003ETip: start small. The bigger a SSTO is the bigger a pain in the butt it is.\u003C/p\u003E\u003Cp\u003EStephen Hirst impressed me mightily with a small buggy that was also a VTOL jet and could also go into orbit.\u003C/p\u003E\u003Cp\u003EIn the following video he demonstrates the exact technique for getting into orbit - \u003Ca href=\u0022https://youtu.be/cu2pVvMehi4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/cu2pVvMehi4\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve got a youtube video of flying a vehicle inspired by his that is a little bit bigger and has an atomic rocket - \u003Ca href=\u0022https://youtu.be/h0cOAJof1jo\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/h0cOAJof1jo\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETwo jet engines are a pain as the thrust gets uneven as the air runs out.\u003C/p\u003E\u003Cp\u003EAs to the question - why did I make a buggy that could fly into space? Because everything is better with wheels! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-12T00:50:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WyDavies\u0022 data-cite=\u0022WyDavies\u0022\u003E\u003Cdiv\u003E...Tip: start small. The bigger a SSTO is the bigger a pain in the butt it is...\u003Cp\u003EStephen Hirst impressed me mightily with a small buggy that was also a VTOL jet and could also go into orbit...\u003C/p\u003E\u003Cp\u003EAs to the question - why did I make a buggy that could fly into space? Because everything is better with wheels! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely, about all of it but ... oooh! ... Slashy\u0027s going to give us his VTOL SSTO rover to (all sorts of places I can\u0027t rememer) again; it\u0027s just too good a cue to miss, I\u0027m sure ...\u003C/p\u003E\u003Cp\u003E(LOL)\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-12T00:55:18Z","Content":"\n\u003Cp\u003EWith regards to the spaceplanes are a pain in the arse comment, it\u0027s absolutely true. People that build spaceplanes do so for the challenge, not necessarily the practicality or ease. So really you have to ask yourself if you are interested in such a thing first. It\u0027s certainly not for everyone.\u003C/p\u003E\u003Cp\u003EI enjoy the art of building planes more than even going to other planets in this game, just my preference, but it takes a lot of practice to build and especially land (unless you cheat and add parachutes to land vertically... ok not really cheating, it is a sandbox game I guess)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-12T01:00:21Z\u0022 title=\u002201/12/2015 01:00  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 12, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2015-01-12T00:56:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003E[Different subject] It is amusing though that people who think \u0027spaceplane\u0027 is \u003Cem\u003Ethe\u003C/em\u003E way to do things are amongst the most strident about stock aerodynamic woes. \u0022Realism counts\u0022 ... except there\u0027s never been a real spaceplane, as eddiew points out. What I find most interesting here is that the Kerbal \u003Cstrong\u003ESpace\u003C/strong\u003E Program is, perhaps, most attractive to flight-sim fans and the strength of opinions offered about the atmospheric flight-model often outweighs that for, well, space. There\u0027s no right or wrong way to have fun, of course, but it\u0027s no wonder Squad didn\u0027t expect the \u0027flight\u0027 part to be quite so important. I think it\u0027s a noteworthy point about end-objectives not necessarily being what you expected them to be when you started (RAD FTW!).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I guess I\u0027m glad we amuse you...\u003C/p\u003E\u003Cp\u003EI don\u0027t see how the lack of IRL spaceplanes somehow makes the stock aero/drag model (based on mass, instead of cross-section, shape, or skin area) \u003Cem\u003Enot\u003C/em\u003E stupid... The only thing \u0027realism\u0027 has to do with anything is the frame of reference of the player: If planes \u003Cem\u003Eactually\u003C/em\u003E fly like planes and rockets \u003Cem\u003Eactually\u003C/em\u003E fly like rockets, it\u0027s a lot easier to play the game. FAR fixes that. Trust me, if the rocket equation didn\u0027t work for rockets in space, I\u0027d complain about that too. There are very few problems with how vessels behave in space, and serious issues with how they behave in the atmosphere.\u003C/p\u003E\u003Cp\u003EOn that matter, I\u0027d prefer stock KSP to hold I\u003Csub\u003Esp\u003C/sub\u003E constant and varied thrust based on atmospheric density, like it does in real-life. I guess I need to complain about that more...\u003C/p\u003E\u003Cp\u003EFurther, you\u0027re quoting me, but I never said \u0022spaceplane is \u003Cem\u003Ethe\u003C/em\u003E way to do things\u0022. It\u0027s \u003Cem\u003Eone\u003C/em\u003E way to do things. It\u0027s \u003Cem\u003Eone\u003C/em\u003E way \u003Cem\u003EI\u003C/em\u003E do things that I\u0027m familiar enough to provide advise to other players.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-01-12T03:37:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EAbsolutely, about all of it but ... oooh! ... Slashy\u0027s going to give us his VTOL SSTO rover to (all sorts of places I can\u0027t rememer) again; it\u0027s just too good a cue to miss, I\u0027m sure ...\u003Cp\u003E(LOL)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, Sir \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E While the Tylo Rover *is* IMHO an awesome tool, it\u0027s not really relevant to this discussion. At least not in *that* way.\u003C/p\u003E\u003Cp\u003E Laziness is the mother of invention, and I am a very lazy man. I\u0027m all about using whatever designs will make the job easiest, and each of these designs makes specific jobs ridiculously easy. \u003C/p\u003E\u003Cp\u003E SSTO spaceplanes are great for getting supplies and kerbals into LKO. Vertical SSTOs are awesome for heavy loads and bulky structures. And yes, Tylo rovers are awesome for constructing bases on other bodies.\u003C/p\u003E\u003Cp\u003EAbout all you\u0027ll get out of me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EWith regards to the spaceplanes are a pain in the arse comment, it\u0027s absolutely true. People that build spaceplanes do so for the challenge, not necessarily the practicality or ease. So really you have to ask yourself if you are interested in such a thing first. It\u0027s certainly not for everyone.\u003Cp\u003EI enjoy the art of building planes more than even going to other planets in this game, just my preference, but it takes a lot of practice to build and especially land (unless you cheat and add parachutes to land vertically... ok not really cheating, it is a sandbox game I guess)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpeak for yourself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E I use spaceplanes \u003Cem\u003Ebecause\u003C/em\u003E of their practicality and ease. They are really the best thing going... *for the job that they are best at*.\u003C/p\u003E\u003Cp\u003E The engineering and piloting ramps up a bit for them, but it\u0027s really not beyond the abilities of most KSP players to attain. \u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-01-12T04:23:40Z","Content":"\n\u003Cp\u003EOnce you\u0027ve built a bunch spaceplanes are by far the easiest way to throw regular stuff in orbit - real life might not yet have any but then real life atmosphere doesn\u0027t end at ~70km with a 2400ish m/s orbital velocity either. If we ever do get a genuine spaceplane operational IRL then I suspect there would be appropriate savings there too. One of mine can lift over it\u0027s fuelled mass ( ~270t ) of up to 3m width cargo to 250-300km orbit, and it\u0027s not terribly concerned about balancing or any of the other issues that\u0027d turn up with a custom rocket lifter, just drop the payload in the cargo bay, tweak the fuel load and off it flies. Of course it\u0027s 375k or so to buy ( a fuelled ) one but it pays fairly quickly - not sure what a 280t payload disposable rocket launcher would cost but I would imagine you can\u0027t buy too many for 375k.\u003C/p\u003E\u003Cp\u003EChecked my sub-orbital launcher - I run FAR so it does need multi-mode engines, just no RCS or other orbital maneuvering systems - fuel cost is about 600 kerbucks to fill it, so the payload strutting is a significant chunk of the launch cost \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. I have a roughly equivalent ( SSTO and technically reusable, or at least landable for near complete recovery ) rocket which uses more like 9k in fuel. Admittedly probably not the most efficient either given it\u0027s not a bespoke multistage launcher and it\u0027s got things you don\u0027t find on disposable rockets like airbrakes/parachutes/airbags and even sizeable wings, but the fuel cost of 5 launches of that would pay for the equivalent spaceplane outright. When you start discarding hardware then it skews the situation even more towards spaceplanes. If it\u0027s conveniently tankable, or conveniently shaped then I\u0027ll launch in a spaceplane. If it\u0027s huge or awkward then I\u0027ll build it in space and fly components or EPL rocketparts up to orbit. I tend to build rocket launchers ( as opposed to tugs ) as something different to do every now and then.\u003C/p\u003E\u003Cp\u003ELethaldose - Ferram\u0027s KIDS mod can be run in just an ISP scaling mode, does exactly what you\u0027re asking for. Confuses all the dV/TWR calcs somewhat so you have to get a bit used to that, but works fine.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-12T04:26:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EWell, I guess I\u0027m glad we amuse you...\u003Cp\u003EFurther, you\u0027re quoting me...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m glad you\u0027re glad.\u003C/p\u003E\u003Cp\u003EAll I said was Squad probably never expected their space-sim to be such an attractive flight-sim, things often evolve in surprising ways (which is why waterfall software development never works).\u003C/p\u003E\u003Cp\u003EWhile the first part quoted you so people could see what my first comment referred to the \u0022[Different Subject]\u0022 was meant to be a hint that I was talking about something else thereafter and, no, I wasn\u0027t attributing any views to you in that second part.\u003C/p\u003E\u003Cp\u003ESo Alshain say, he is an example of someone who prefers atmosphere work in exactly this way. Consensus, which I think you would also agree with, is that spaceplanes take more (or perhaps just different) work than rockets/tail-sitter jets, they all have their uses if you want to do them but regardless of how anyone does anything building a \u0027US space-shuttle\u0027 style vehicle is a nightmare in KSP.\u003C/p\u003E\u003Cp\u003E@All: Incidentally, is it \u0027more\u0027 or \u0027different\u0027 work? Anyone come straight into KSP to build \u0027planes and then found rockets hard?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2015-01-12T06:48:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EI\u0027m glad you\u0027re glad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyeah... don\u0027t be...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003ESo Alshain say, he is an example of someone who prefers atmosphere work in exactly this way. Consensus, which I think you would also agree with, is that \u003Cstrong\u003Espaceplanes take more (or perhaps just different) work than rockets/tail-sitter jets,\u003C/strong\u003E they all have their uses if you want to do them but regardless of how anyone does anything building a \u0027US space-shuttle\u0027 style vehicle is a nightmare in KSP.\u003Cp\u003E@All: Incidentally, is it \u0027more\u0027 or \u0027different\u0027 work? Anyone come straight into KSP to build \u0027planes and then found rockets hard?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you say \u0022rockets/tail-sitter jets\u0022, you could mean a ton of of things. I\u0027m going to answer to the best of my understand of what you\u0027re asking, but, based on how you\u0027ve used terminology before, I could be way off.\u003C/p\u003E\u003Cp\u003EIMO, SSTO VTOL rockets and jets for LKO operations that aren\u0027t re-usable are absurd and inefficient (I feel Tsiolkovsky adequately explains this viewpoint for me), and re-usable SSTO VTOL rockets and jets for LKO operations require nearly, if not fully, as much work to develop properly as spaceplanes. \u003C/p\u003E\u003Cp\u003EThe key word/phrase there is \u0022develop \u003Cem\u003Eproperly\u003C/em\u003E\u0022, because if I\u0027m going to spend the time, effort and funds to build an SSTO, you can be frakking sure I\u0027m going to want it to be reusable. In my experience, designing reusable SSTO VTOL rockets-style vessels to get \u003Cem\u003Einto\u003C/em\u003E orbit and flying them is slightly easier than spaceplanes, but getting them \u003Cem\u003Eback\u003C/em\u003E from orbit and landing at the KSC is a \u003Cem\u003Evastly\u003C/em\u003E greater engineering and piloting task for me. Scott Manley has done this in his interstellar videos, but I\u0027m not Manley and I don\u0027t use the interstellar mod, which seems to have a ton of propulsion systems better suited for both HTOL and VTOL SSTOs.\u003C/p\u003E\u003Cp\u003EThe planes are just easier and safer \u003Cem\u003Efor me\u003C/em\u003E to land than tail-sitters. Admittedly, I haven\u0027t \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ewasted\u003C/span\u003E spent tons of time on them, but I think the quantity and quality of work required to make tail-sitters work is comparable to spaceplanes.\u003C/p\u003E\u003Cp\u003ESpaceplanes are great for ferrying small structural (e.g. probes) and moderately-sized non-structural (resources, kerbals, science, etc.) to and from LKO. For larger payloads, expendable launch vehicles (ELVs) are my chosen solution. Haven\u0027t done anything with the new Mk3 parts yet... frankly not sure what use I\u0027ll have for them.\u003C/p\u003E\u003Cp\u003EBut, Pecan, you\u0027ve made it clear you don\u0027t think reusability or pin-point landing are important qualities for SSTOs to have, so I guess my view-points are simply invalid to your discussion, if what I said had anything to do with it to begin with.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Van Disaster\u0022 data-cite=\u0022Van Disaster\u0022\u003E\u003Cdiv\u003ELethaldose - Ferram\u0027s KIDS mod can be run in just an ISP scaling mode, does exactly what you\u0027re asking for. Confuses all the dV/TWR calcs somewhat so you have to get a bit used to that, but works fine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will have to look into that, though I brought that up primarily to make the point that there are things about how rockets fly in space that bug me. It\u0027s not just the aero model. Though once again, it seems Ferram comes through like a champ.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-12T06:58:35Z\u0022 title=\u002201/12/2015 06:58  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 12, 2015\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-01-12T07:03:51Z","Content":"\n\u003Cp\u003ERather than get into an argument about how the game \u003Cem\u003Eshould \u003C/em\u003Ework and what other players \u003Cem\u003Eshould\u003C/em\u003E want to do, please give OP advice about what \u003Cem\u003Ehe/she\u003C/em\u003E wants to do in the \u003Cem\u003Ecurrent \u003C/em\u003Eversion of the way the game works.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2015-01-12T07:13:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003ERather than get into an argument about how the game \u003Cem\u003Eshould \u003C/em\u003Ework and what other players \u003Cem\u003Eshould\u003C/em\u003E want to do, please give OP advice about what \u003Cem\u003Ehe/she\u003C/em\u003E wants to do in the \u003Cem\u003Ecurrent \u003C/em\u003Eversion of the way the game works.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure which posts these are aimed at, but if it\u0027s mine, I\u0027d simply summarize the previous post as:\u003C/p\u003E\u003Cp\u003E\u0022Spaceplanes \u0026gt;\u0026gt;\u0026gt; tail-sitters because the are former way easier to land precisely (at KSC or elsewhere)\u0022\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-12T07:24:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003E...But, Pecan, you\u0027ve made it clear you don\u0027t think reusability or pin-point landing are important qualities for SSTOs to have, so I guess my view-points are simply invalid to your discussion, if what I said had anything to do with it to begin with...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve always agreed that a disposable SSTO is pointlessly inefficient versus staging, except where a single tiny engine and fuel tank are all that\u0027s required (ie; just putting up a Stayputnik or similar) and there\u0027s nothing to sub-divide. You are right, however, that I don\u0027t consider pin-point landing important. \u0027Within a kilometer\u0027 is fairly easy by hand, if I need \u0027within a few metres\u0027 I use MJ. Treat yourself to a mainsail, probe-core, battery, solar panel, 2 drogues and 10t payload some time. Enough fuel for 4,900m/s dV or so and you\u0027ll be surprised how easy it is to do a drogue-assisted powered landing at KSC :-) A KR-2L can SSTO 25t to the same spec.\u003C/p\u003E\u003Cp\u003EThe only point here really is that while all types of SSTO have their uses for different people, \u0027Space-Shuttle\u0027 designs aren\u0027t SSTOs but are hard to make/fly and inefficient in KSP.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-12T07:40:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tassyr\u0022 data-cite=\u0022Tassyr\u0022\u003E\u003Cdiv\u003EActually there\u0027s one big question. \u0022HOW.\u0022\u003Cp\u003EI\u0027ve been trying for about the last week using 0.90. I\u0027ve tried using mostly stock, I\u0027ve tried copying designs seen in the exchange, I\u0027ve tried turbojets, rapiers and traditional rocket engines, combinations, Solid-state-booster assisted combinations... and I\u0027ve come to one inescapable conclusion.\u003C/p\u003E\u003Cp\u003EIT IS (CENSORED) (CENSORED) (REALLY CENSORED) IMPOSSIBLE. Shuttle launch style craft freehweel like they\u0027re high-divers showing off before a big splash, things launched from the runway barely get off the ground or run clean out of power by the time they hit 25km, or just hit the ground like lawn darts.\u003C/p\u003E\u003Cp\u003EAm I insane or is there some magic trick I\u0027m missing here?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA simple and easy stock design that works: \u003Ca href=\u0022https://www.dropbox.com/s/lbnz9s8k9h7gwgb/Kerbodyne%20Benchmark%20StockAir.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/lbnz9s8k9h7gwgb/Kerbodyne%20Benchmark%20StockAir.craft?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGive that a shot and report back; it will help us figure out if the problem is in design or piloting.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2015-01-12T08:29:26Z","Content":"\n\u003Cp\u003ESpaceplanes are hard, expensive and arguably inefficient for interplanetary travel. So why do people (and me) build them?\u003C/p\u003E\u003Cp\u003E- a challenge, especially when you go beyond LKO\u003C/p\u003E\u003Cp\u003E- some might say reusability, see \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69358-An-Affordable-Space-Program-making-the-reusable-spacecraft-pay-off\u0022 rel=\u0022external nofollow\u0022\u003Ethis old awesome challenge\u003C/a\u003E. Seriously, I learned so much from that thread.\u003C/p\u003E\u003Cp\u003E- I like them because I never hit KSC spot on when returning, so I can fly the remaining way back\u003C/p\u003E\u003Cp\u003E- and finally: style, because why goto space in a tincan if you can go there in a Ferrari?\u003C/p\u003E\u003Cp\u003EGive Wanderfound\u0027s bird a try and let us know how it went.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-01-12T09:00:41Z","Content":"\n\u003Cp\u003ERight so a lot of people have already linked you a lot of stuff. I\u0027ll simply say that the link LethalDose provided in post #7 tp the \u0022basic aircraft design\u0022 thread is what jumpstarted my aircraft design and what allowed me to go from crash-on-runway to interplanetary SSTO\u0027s that never refuel.\u003C/p\u003E\u003Cp\u003Ea few extra pointers:\u003C/p\u003E\u003Cp\u003E- always make sure center of mass and center of thrust are aligned. Ideally, the center of lift orb should never be fully seperate from the center of mass orb. You can check this by emptying the fuel tanks in the spaceplane hangar and seeing how the CoM moves as you do so. I also have begun using the \u0022RCS build aid\u0022 mod recently which shows you the \u0022dry\u0022 CoM (all fuel tanks drained) as well as the normal \u0022wet\u0022 one.\u003C/p\u003E\u003Cp\u003E- As many have said beofre, shuttle design the way NASA did it is an incredible pain in the ass in KSP due to its asymmetric design. It\u0027s possible and many people have done it before, but it\u0027s not easy and usually requires a ton of reaction control engines (vernor engines at the top of the fuel tank to offset the thrust is an often used solution)\u003C/p\u003E\u003Cp\u003E- airbreathing SSTO spaceplanes are great as cargo haulers to carry stuff to LKO (Low Kerbin Orbit) and for use on Laythe. I would advise against using them for much else. I have some experience with interplanetary SSTO spaceplanes and I can tell you: they\u0027re not worth the trouble. They take a ton of design effort, are stupidly big and heavy, are generally less efficient than purely rocket-powered ships and can\u0027t really do anything other than the specific task they were designed to do. They may be somewhat cheaper because you don\u0027t discard any hardware, but the small cost saving is not worth it.\u003C/p\u003E\u003Cp\u003ETLDR: use the \u0022basic aircraft design\u0022 thread Lethaldose linked you in post #7, use SSTO spaceplanes to haul cargo and kerbals to LKO and nothing else (unless you want to do it purely for the challenge)\u003C/p\u003E\n"}]}