{"TopicId":96455,"ForumId":55,"TopicTitle":"An Observation on Crowd-sourced Game Development: And Advice to SQUAD","CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2015-01-12T13:36:53Z","PageNum":1,"Articles":[{"CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2015-01-12T13:36:53Z","Content":"\n\u003Cp\u003EI\u0027ve been playing a number of crowd-sourced games recently; Prison Architect, KSP, The Forest and a few more.\u003C/p\u003E\u003Cp\u003EWhat I\u0027ve noticed is that in general the development of these games seems to stall or become distorted after the initial buzz around the games\u0027 release.\u003C/p\u003E\u003Cp\u003ETo take an example, The Forest was pitched as a SP immersive survival game and it was clear from the beginning that the developers had no plans for multiplayer. However several releases later multiplayer is taking the majority of development time. On the one hand this is what sells; a multiplayer sandbox like Day Z is easy to hit the market, but as a result the original vision, that immersive oculus-rift SP experience, has been lost.\u003C/p\u003E\u003Cp\u003EHence when I see people asking for multiplayer development on KSP my heart sinks a little at the idea that the original game might almost be \u0027abandoned\u0027.\u003C/p\u003E\u003Cp\u003ENow let\u0027s look at Prison Architect. The Kickstarter model of funding where players could become prisoners in game is great, no doubt about it. But the last few updates of PA has focused on adding new features including snitches, logic circuits and mod support. Now logic circuits was primarily pushed by some Minecraft players, but its inclusion in the game is sloppy and doesn\u0027t fit with the simple premise of Prison Architect. Snitches seemed unnecessary as well. Overall the focus on these crowd-developed games is on new features to satisfy a bored playerbase, rather than polishing a game.\u003C/p\u003E\u003Cp\u003EThere are advantages and disadvantages to these additions. Let\u0027s look at mod inclusion. Mods are a great way to revive a bland game or keep players (investors!) interested, but they don\u0027t actually impact on quality of the game you are selling. Some mods break the game or render it completely different. Each mod appeals to different players giving you choice but also no consistent \u0022KSP experience.\u0022 KSP has a very mod-friendly sandbox type physics model and the modding community is healthy for the game\u0027s survival but not for its overall development as a product. As a modder I can tell you some games are easy to mode, like those using Quake engines. But the original games were the cause of their success not the modding utility, which was largely accidental. I\u0027m thinking of games like Jedi Outcast, Max Payne, Grand Theft Auto. There are exceptions like Halflife 2 which was largely successful due to the modding community. Is this the direction that games are taking? Is it good or bad?\u003C/p\u003E\u003Cp\u003EMy request for SQUAD is to focus on fixing what is there before working on new features. The career mode needs work and I\u0027ve detailed some ideas in another thread, and there are loads of ideas about improving the gameplay. I was very pleased with the SAS fixes but the textures of the sky for example are grossly outdated and the music could do with work. Multiplayer is a bad idea to respond to the multiplayer thread, and I don\u0027t think \u0022there\u0027s a mod for that\u0022 is the proper response to problems. So I am a little disheartened when I read about resources and new systems, when the basic career and the overall game (textures, parts) needs so much work. \u003C/p\u003E\u003Cp\u003EThose are my observations anyway I\u0027d like to know what the community thinks.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-12T14:11:56Z","Content":"\n\u003Cp\u003EIf you take a look through previous devnotes in the Daily Kerbal section, you\u0027ll see two things:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E(more recent) the game is currently labelled as \u0022beta\u0022, meaning all major features intended to be 1.0 are completed, and they\u0027re working on refining them and bugfixing.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E(probably a fair ways back now) multiplayer, while having been assigned to a single developer for now (though I\u0027m not sure what happened to him, I don\u0027t think we\u0027ve heard from him in a while), is not planned until after feature-complete, hopefully mostly-bug-free v1.0.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI hear your worries, but don\u0027t for a moment think that Squad will be scrambling to implement multiplayer in a hurry just because some people are asking for it again -- they\u0027ve been asking for it for as long as I\u0027ve been here... and I\u0027ve been here for a \u003Cem\u003Every\u003C/em\u003E long time. There\u0027s no reason for them not to take their time with it, and if the past is anything to learn from, they aren\u0027t likely to change that anytime soon. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf the most recent devnotes are anything to go by, 0.91 will focus mainly on going over the game\u0027s aerodynamic modelling, which should hopefully fix (at the very least) the persistent infiniglide glitch that has existed even before spaceplane parts existed in the stock game, if I recall correctly. Beyond that, they\u0027ve been reluctant to share too much about what is going to be worked on ahead of time (mainly because this community can get somewhat fractious if some things announced do not come to fruition, on occasion), but I believe the whole point of announcing 0.90 as the first Beta version was to indicate the intent to get cracking down on the incomplete features and the bugs. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tuareg","CreatedById":84241,"CreatedDateTime":"2015-01-12T17:56:41Z","Content":"\n\u003Cp\u003Eyou want to say ksp is feature ready? what a shame... the sandbox havent got anything in the past 2 years and so many nice \u0022promises\u0022 have failed to make in. but well, i\u0027ve told 2 years ago that this will happen, not surprised at all...\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2015-01-12T22:24:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tuareg\u0022 data-cite=\u0022Tuareg\u0022\u003E\u003Cdiv\u003Eyou want to say ksp is feature ready? what a shame... the sandbox havent got anything in the past 2 years and so many nice \u0022promises\u0022 have failed to make in. but well, i\u0027ve told 2 years ago that this will happen, not surprised at all...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think from what the developers have said it\u0027s more \u0022System Ready\u0022 more than \u0022feature\u0022 ready. I\u0027d imagine the next few releases will bring more and more features on top of those systems in order to scope complete the game.\u003C/p\u003E\n"},{"CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2015-02-06T16:16:59Z","Content":"\n\u003Cp\u003EWell it looks like Squad is going ahead with Multiplayer and choosing the route of entertaining the market over producing a good niche product.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-02-06T16:33:10Z","Content":"\n\u003Cp\u003EHow are you getting the impression that Squad is focusing on multiplayer? From my perspective, it seems quite a ways down on their list of priorities.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-02-06T22:16:06Z","Content":"\n\u003Cp\u003EThey\u0027ve not once said anything about focusing on multiplayer. It\u0027s on the cards, but by all accounts it\u0027s not coming for a while yet.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-06T22:51:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mattinoz\u0022 data-cite=\u0022mattinoz\u0022\u003E\u003Cdiv\u003EI think from what the developers have said it\u0027s more \u0022System Ready\u0022 more than \u0022feature\u0022 ready. I\u0027d imagine the next few releases will bring more and more features on top of those systems in order to scope complete the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou know \u0022system ready\u0022 is scope complete, right?\u003C/p\u003E\u003Cp\u003EIn 0.90 KSP turned scope complete, with everything there but not finished.\u003C/p\u003E\n"},{"CreatedByName":"longbyte1","CreatedById":17521,"CreatedDateTime":"2015-02-06T23:26:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klgraham1013\u0022 data-cite=\u0022klgraham1013\u0022\u003E\u003Cdiv\u003EHow are you getting the impression that Squad is focusing on multiplayer? From my perspective, it seems quite a ways down on their list of priorities.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI doubt they will even do multiplayer at this stage, unless they take some of godarklight\u0027s code and hack it in. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ELikewise, a modding API was announced for Minecraft a very long time ago, but was never followed up on. So no modding API.\u003C/p\u003E\n"}]}