{"TopicId":96554,"ForumId":24,"TopicTitle":"A good day to all!","CreatedByName":"Merandix","CreatedById":135352,"CreatedDateTime":"2015-01-13T10:47:18Z","PageNum":1,"Articles":[{"CreatedByName":"Merandix","CreatedById":135352,"CreatedDateTime":"2015-01-13T10:47:18Z","Content":"\n\u003Cp\u003EHiya, I\u0027m Merandix... sort of new-ish to the game, but most certainly to the forum. I guess this game has officially made me a flying dutchman. Though I prefer Flying Frisian. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ELoving the game so far and I can\u0027t wait for all the goodness Squad still has in store for us (aerodynamics update would make this Frisian fly a bit easier probably \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E). \u003C/p\u003E\u003Cp\u003EI\u0027m coming from the Kerbal way of doing things (\u0022Ehhh, I\u0027ll just eyeball it\u0022) to actually starting to think about what the heck I am doing. I\u0027ll always remember the Kerbal ways though: *KABOOM* ... \u0022nope... that doesn\u0027t work\u0022.\u003C/p\u003E\u003Cp\u003EBut actually seeing stuff work is fun in it\u0027s own way (though the kerbal way usually ends up having sufficient successes too). \u003C/p\u003E\u003Cp\u003EAnyway, I\u0027ll be lurking about and perhaps posting some much needed cries for advice here and there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-01-13T12:06:44Z","Content":"\n\u003Cp\u003EWelcome to the forums!\u003C/p\u003E\u003Cp\u003EOne of the things I loved since I started is the \u0027fly by the seat of your pants\u0027 feel of the game. As you are saying, there\u0027s so much more to it than that, but I always have a strong affinity to \u0027the Kerbal way\u0027.\u003C/p\u003E\u003Cp\u003ELots of great people, advice and tutorials are here.\u003C/p\u003E\u003Cp\u003EGlad you joined the forums!\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-01-13T16:00:27Z","Content":"\n\u003Cp\u003EWelcome aboard! If you ever need advice, there is no better place than right here on the forums. We\u0027re glad to help!\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-01-13T16:19:36Z","Content":"\n\u003Cp\u003EWelcome to the KSP community!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2015-01-14T01:11:20Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESince you\u0027re starting to take a little more time to think things through rather than just wing it the \u0022kerbal way,\u0022 you might want to take a look at the Drawing Board, which is conveniently linked through my signature below. It has a lot of interesting and useful tutorials and other player aids that are designed to help users get the most out of their game and have fun doing it. Feel free to ask questions if you get stuck on anything in particular, or to share your achievements as you complete bigger and bolder missions.\u003C/p\u003E\u003Cp\u003EHope this helps, and happy landings!\u003C/p\u003E\n"}]}