{"TopicId":96699,"ForumId":32,"TopicTitle":"Quick route to Duna","CreatedByName":"ftunk70","CreatedById":109881,"CreatedDateTime":"2015-01-14T21:15:58Z","PageNum":1,"Articles":[{"CreatedByName":"ftunk70","CreatedById":109881,"CreatedDateTime":"2015-01-14T21:15:58Z","Content":"\n\u003Cp\u003EI tried to find a quick route to Duna because I hate to wait for the launch window back to Kerbin. Going to Duna using Hohmann transfer orbits takes forever. First, it takes 0.7y just to get there. Then you have to wait for Kerbin to realign, which takes another 1.5y. Then you need to go home taking 0.7y, which totals about 2.9y. However, I just realized there is another way:\u003C/p\u003E\u003Cp\u003EIf you do your ejection burn out of Kerbin to get your Duna encounter just under 90 degrees ahead, you end up on a big elliptic orbit with periaps at Kerbin and apoaps at roughly 45 Gm, beyond Dres. This orbit takes 0.25 y to get to Duna, so when you arrive Kerbin is just overtaking Duna on the inside. This means you can use the same orbit, but mirrored, to get back to Kerbin in another 0.25 y without further await. \u003C/p\u003E\u003Cp\u003ESo the total round trip time is half a year! Only one sixth food and oxygen required! You\u0027ll be back at Kerbin before the Hohmann dude has even arrived at Duna! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Kerbin ejection burn requires roughly 1200 m/s delta-v over the Hohmann ejection burn, and you burn so that your exit vector is along the Kerbin orbit around the sun, as usual. When returning from Duna however, you must burn straight towards the sun and the required delta-v is over 3000 m/s .\u003C/p\u003E\u003Cp\u003ENow, this route is clearly not optimal, the assymetric ejection burns tells me. But there could be a route requiring about 3000 total extra delta-v compared to Hohmann transfer that takes about 0.5 y and does not require waiting at Duna.\u003C/p\u003E\u003Cp\u003EWhat do you think? I\u0027m sure someone knows more about this\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-01-14T21:31:46Z","Content":"\n\u003Cp\u003EI think this is an useful thing for roleplaying/playing with mods, I also hope there would be a reason in the stock game to care about transfer times. (upkeep cost for missions/the space center or life support?)\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-01-14T21:39:12Z","Content":"\n\u003Cp\u003ETwo days ago, i managed to pull beautiful slingshot maneuver using Mun as help in Kerbin - Duna transfer. Circa 900 m\\s dV to get Mun encounter, then another 240 m\\s at periapsis resulted in immediate Duna encounter in 280 days. No correction maneuver half-way needed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E I\u0027m so proud of myself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E If only i could be sure i\u0027ve packed enough parachutes on the lander...aerobraking in that thin atmosphere can be tricky.\u003C/p\u003E\n"},{"CreatedByName":"PLAD","CreatedById":104158,"CreatedDateTime":"2015-01-15T01:00:51Z","Content":"\n\u003Cp\u003ETry running an opposition-class mission using a flyby of Eve to minimize the time waiting on Duna. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79177-An-Opposition-Class-Mission-to-Duna-with-Eve-Flyby\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s an example\u003C/a\u003E I ran some time ago. I use the 365-day year/24-hour day system so you\u0027ll have to translate the numbers to the 426/6 system you are using.\u003C/p\u003E\u003Cp\u003E For about 1000m/s more than a Hohmann mission (assuming you aerobrake at Duna) you can get to Duna and back in just a few days over 1 Kerbin year with the right flyby if you spend only 1 day on Duna. I\u0027ll give an example in 365/24 format and then 426/6 format so you can catch if I make a mistake in translation:\u003C/p\u003E\u003Cp\u003ELeave Kerbin year 1 day 58 at 1288m/s from a 75x75km orbit, arrive at Duna Y1 day 94. Land, take off. Leave Duna Y1 day 95 at 1270m/s from a 75km orbit, flyby Eve on Y1 D146, arrive at Kerbin Y1 D166.\u003C/p\u003E\u003Cp\u003EI think in 426/6 that\u0027s Kerbin Y1 D232 - Duna Y1 D376. Duna Y1 D380, flyby Eve Y2 D158, arrive Kerbin Y2 D238.\u003C/p\u003E\u003Cp\u003EI never did try flying by Eve on the way \u003Cstrong\u003Eto\u003C/strong\u003E Duna. That might save d-V.\u003C/p\u003E\n"},{"CreatedByName":"ftunk70","CreatedById":109881,"CreatedDateTime":"2015-01-15T08:04:47Z","Content":"\n\u003Cp\u003EInteresting idea, PLAD. I hadn\u0027t thought about Eve flybys (since it\u0027s kind of the other way). I would think a proper Eve gravity assist on the way to Duna might take you to a position in Duna\u0027s orbit wherefrom it is easy to go back to Kerbin. Using Eve on the way back seems hard to plan, since you must know where all three planets will be?\u003C/p\u003E\u003Cp\u003EScotius, well done! I thought Mun gravity assists don\u0027t work because Oberth, but it\u0027s nice when it works out like that.\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-01-15T17:35:10Z","Content":"\n\u003Cp\u003ELaunch windows are for weenies. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I launched a Duna probe immediately after accepting the explore Duna \u0026amp; Ike contracts. After leaving the Kerbin system I did a correction burn to increase the eccentricity of my transfer. I think it took about 140 days (about 0.3 of a year). I did two more minor corrections to adjust my Duna orbital plane before aerobraking at about 11,000km.\u003C/p\u003E\u003Cp\u003EI hate leaving my Kerbals stranded in space for long periods of time without living space - I guess that\u0027s my own personal role-playing. But I also don\u0027t launch monstrous ships like some folks and I haven\u0027t visited many of the other planets yet... I\u0027ll probably have to pay more attention to launch windows in the future.\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2015-01-15T17:57:09Z","Content":"\n\u003Cp\u003EA nice bi-elliptic transfer can be very efficient... it must not always be a Hohmann transfer.\u003C/p\u003E\n"}]}