{"TopicId":96779,"ForumId":20,"TopicTitle":"Time Vs Space: Getting back into KSP","CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2015-01-15T17:50:33Z","PageNum":1,"Articles":[{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2015-01-15T17:50:33Z","Content":"\n\u003Cp\u003ERight off the bat I want to say what this is about cause I tend to meander in my posts: I am having a hard time finding the time to play KSP due to the number of mods available. Personal issue right? Why am I posting here in General Add-on Affairs? If you care to know, I will explain myself.\u003C/p\u003E\u003Cp\u003EThe primary issue for getting back into KSP is the mods. Obviously I could play vanilla KSP and it is fun to do so. But when I know I could make an ultimate battle cruiser and supporting Mun base using B9, NFT, nearly everything from roverdude then vanilla gets old quick. And you just can\u0027t go without Firespitter and of course Hooligan labs and KAE for messing around in the planets atmosphere. If you are building anything from B9 on the ground you need Snjo\u0027s hanger extender. Can\u0027t forget Novapunch and KW rocketry. Did I mention all the space station mods? Annnnd I just passed the ram limit for windows so time to set up a linux install. While I am at it I find about ten other mods I just have to have and install those too.\u003C/p\u003E\u003Cp\u003EI am not saying the Mods are a bad thing. I love them (too much, it might seem) as I pointed out above. However, both when I first started playing with mods and currently as I am trying to get back into the game I find myself tweaking and installing more then I am actually playing and it is not an enjoyable thing. I am not advocating for an easier way to install or find Mods. That has been done to death here, no one wants to hear about it and some good projects are currently active and addressing these issues. I suppose I just want to play more and install less. Obviously that would mean stop looking for and installing mods. However, that would also mean missing out on some cool stuff like Roverdude\u0027s Alcubierre Warp Drive that I just found a few moments ago. How do you guys handle \u0022Mod Overload\u0022 if you suffer from this condition and are there any suggestions to help me play more and tweak mods less?\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-01-15T17:58:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheAlmightyOS\u0022 data-cite=\u0022TheAlmightyOS\u0022\u003E\u003Cdiv\u003EHow do you guys handle \u0022Mod Overload\u0022 if you suffer from this condition and are there any suggestions to help me play more and tweak mods less?\u003C/div\u003E\u003C/blockquote\u003EInstall and tweak less. Seriously.\u003Cp\u003ERight now I\u0027m running a \u0022stock-FAR\u0022 install with RSS to correct for reduced delta-V (I made the config a long time ago) and a few mods that I can\u0027t live without: TacFB, Engineer, PWings, PFairings, DRE, KAS, KAX, RealChute, Stock Revamp, Universal Storage. I haven\u0027t tweaked any of those mods. Considering how much time I\u0027ve put into playing and modding this game over the last year and a half, that\u0027s about as crazy as I want to get for the moment, although I\u0027m certain I\u0027ll put together a proper RO install at some point.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-01-15T18:09:50Z","Content":"\n\u003Cp\u003EWell, I have been getting your problem as I learn more about module manager and personalize my mods even more, and sometimes I spend a day just writing MM cfg for KSP instead of actually playing.\u003C/p\u003E\u003Cp\u003ESo I tell myself, well, what do I \u003Cem\u003Ereally\u003C/em\u003E want to do with my stuff? Once I got an answer, I get right on it instead and start building. A mun base? Time to pull out those MKS parts. A satellite network? lets launch a bunch of satellites with RT2 dishes. If you let yourself wander around with all the mods, you would be overwhelmed by it and not getting things done. So start something, make that design concrete. Tell yourself you can upgrade it later with new mods, and launch things up to space.\u003C/p\u003E\u003Cp\u003EAnother thing that would help, is make an actual list of mods you use the most, that you can\u0027t play without, then start playing with just those mods first. More interesting things can be added later on. Also would help with troubleshooting when you have a list of mods (preferbly with versions number) when things go wrong.\u003C/p\u003E\n"},{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2015-01-15T18:31:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EInstall and tweak less. Seriously.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is true and I suppose I knew it before I even pressed the submit button for this thread. I just don\u0027t have the discipline that you have. If I did, I would not have this problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. May I ask what you mean by \u0022RO\u0022 Install?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EWell, I have been getting your problem as I learn more about module manager and personalize my mods even more, and sometimes I spend a day just writing MM cfg for KSP instead of actually playing.\u003Cp\u003ESo I tell myself, well, what do I \u003Cem\u003Ereally\u003C/em\u003E want to do with my stuff? Once I got an answer, I get right on it instead and start building. A mun base? Time to pull out those MKS parts. A satellite network? lets launch a bunch of satellites with RT2 dishes. If you let yourself wander around with all the mods, you would be overwhelmed by it and not getting things done. So start something, make that design concrete. Tell yourself you can upgrade it later with new mods, and launch things up to space.\u003C/p\u003E\u003Cp\u003EAnother thing that would help, is make an actual list of mods you use the most, that you can\u0027t play without, then start playing with just those mods first. More interesting things can be added later on. Also would help with troubleshooting when you have a list of mods (preferbly with versions number) when things go wrong.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat you say makes a lot of sense. Especially about choosing what you want to do. Before I took a break from KSP I was doing the same as you: making MM cfg\u0027s and creating my own fuel mod (electroplasma). Seemed I spent more time retrofitting parts to accept the new fuel type and engines to use it than actually playing. Never got a single ship into space that wasn\u0027t for testing the new engines / generators. However, I think choosing a goal, planing out the actual missions and deciding what mods are needed for those missions one at a time then it becomes less cumbersome and focused on gameplay. Thank you for the advice.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-01-15T18:45:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheAlmightyOS\u0022 data-cite=\u0022TheAlmightyOS\u0022\u003E\u003Cdiv\u003EThis is true and I suppose I knew it before I even pressed the submit button for this thread. I just don\u0027t have the discipline that you have. If I did, I would not have this problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. May I ask what you mean by \u0022RO\u0022 Install?\u003C/div\u003E\u003C/blockquote\u003EA full \u0022Realism Overhaul\u0022 install. There are a lot of mods involved.\n"},{"CreatedByName":"TheAlmightyOS","CreatedById":105590,"CreatedDateTime":"2015-01-15T18:52:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EA full \u0022Realism Overhaul\u0022 install. There are a lot of mods involved.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI could imagine. Seems you and I are on different paths. While you are going for realism I am trying to live out my sci-fi daydreams.\u003C/p\u003E\n"}]}