{"TopicId":97089,"ForumId":55,"TopicTitle":"Flatten the MK 1 runway","CreatedByName":"Alias72","CreatedById":111778,"CreatedDateTime":"2015-01-18T19:46:23Z","PageNum":1,"Articles":[{"CreatedByName":"Alias72","CreatedById":111778,"CreatedDateTime":"2015-01-18T19:46:23Z","Content":"\n\u003Cp\u003Ehello. Recently I tried to launch a simple small aircraft from the mk 1 runway. BIG mistake, there were no survivors. the runway\u0027s appearance is fine but its surface should still be flat. ALL runways, even dirt ones, provide a completely, or near completely, flat surface. The slightest divet can catch a landing gear and flip an aircraft. The Bumpiness you hear of is merely small pebbles causing vibration in the landing gears, not massive holes in the surface. As it stands you are better off using the grass as a launch platform, the runway is a no go zone so far as aircraft is concerned.\u003C/p\u003E\u003Cp\u003Efor examples please google dirt runway under images. all the examples are flat and smooth.\u003C/p\u003E\u003Cp\u003EAnother point I would like to make is about grass. Non compacted soil has a lot of give to it. Wheels dig into the ground if they are not designed for it. the Grass surrounding KSP should have a higher friction, this would make it more dangerous to use the grass as a runway as you may flip the aircraft. Dry dirt poses less of a risk so sandy rocky areas may be okay assuming there are no actual rocks in the way of your aircraft.\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-01-18T20:17:03Z","Content":"\n\u003Cp\u003EI agree with this. Currently the grass around the space centre is flatter than the tier 1 runway so you may aswell just turn around and take off on the grass. if they made the grass surrounding the KSC a little bit bumpy, some what like the tier 1 runway is now then people would have incentive to use the runway. I think that the upgrades for the runway should increase weight of vehicle, length and width of the runway.\u003C/p\u003E\n"},{"CreatedByName":"ghpstage","CreatedById":129622,"CreatedDateTime":"2015-01-18T20:26:07Z","Content":"\n\u003Cp\u003EIt is mad to have it so bumpy.\u003C/p\u003E\u003Cp\u003EBut with the current power of basic jets, and late appearance of landing gears, your going to be best off launching early aircraft vertically most of the time.\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2015-01-18T21:43:25Z","Content":"\n\u003Cp\u003EI once visited a small island of Papua New Guinea for work, their dirt runway was in far better condition than the starting runway at KSP.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-01-19T12:34:52Z","Content":"\n\u003Cp\u003EAnother \u002B1. The starting runway is worse than useless, it is outright hazardous because it makes you \u003Cem\u003Ethink\u003C/em\u003E you can use it for horizontal take off, when in fact you can\u0027t. Frankly I still get the odd jostle with tier 2, but for the most part heavier planes just ride out the bumps and survive. Little single-seaters can still get caught in that big pothole near the beginning though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-01-19T14:30:32Z","Content":"\n\u003Cp\u003EAdd discardable SRBs to the sides to make a VTOL \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-01-19T15:13:11Z","Content":"\n\u003Cp\u003EYes please.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-19T16:18:39Z","Content":"\n\u003Cp\u003EMaking the opening runway a bit bumpy was a good idea.\u003C/p\u003E\u003Cp\u003EMaking the runway more bumpy than the paddock surrounding it, not such a good idea.\u003C/p\u003E\u003Cp\u003EMaking the runway bumpy enough to be lethal to all but the best pilots, very much not a good idea.\u003C/p\u003E\u003Cp\u003EThe paddock around KSC should be about as bumpy as the current level 1 runway. The level 1 runway should be about as bumpy as the current level 2 runway.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-19T16:20:53Z","Content":"\n\u003Cp\u003EI just don\u0027t think KSP is capable of simulating a \u0022bumpy\u0022 runway properly.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-01-19T16:27:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMaking the runway more bumpy than the paddock surrounding it, not such a good idea.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, this is the biggest problem in my mind. It\u0027s really extra-useless if it\u0027s less smooth than the surrounding terrain, since people will just roll off of it and use said terrain instead. An especially big bugaboo there is that the raised shoulders of the runway are actually significantly smoother than the runway itself.\u003C/p\u003E\u003Cp\u003EOr, phrased differently, If KSC were in a field of instant-death spikey doom lava, then the nearly-suicide runway would actually be a good place to land...relatively speaking.\u003C/p\u003E\n"},{"CreatedByName":"ceauke","CreatedById":67898,"CreatedDateTime":"2015-01-19T16:49:05Z","Content":"\n\u003Cp\u003EI completely agree. \u003C/p\u003E\u003Cp\u003EAll non-runways should probably have a level or drag (sand) and bumpiness. The grass next to the MK1 runways MUST be worse than the runway itself. \u003C/p\u003E\u003Cp\u003ESounds like two fixes required:\u003C/p\u003E\u003Cp\u003E1. Runway smoother (must be already doable)\u003C/p\u003E\u003Cp\u003E2. All surfaces on all planets (maybe by biome) should have something making it less smooth (I\u0027m not sure if anything is in here except the actual gradient of textures). And maybe different types of wheels should give you bonusses. E.g. those small jet wheels may not help much in sand, but the larger ones give -1.5 on sand drag and -0.5 bonus on bumpiness.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-01-19T16:56:34Z","Content":"\n\u003Cp\u003ETurns out the KSC landscapers are better at their job then whoever they got to do the runway.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-19T17:23:03Z","Content":"\n\u003Cp\u003EThe problem with making the area around KSC bumpy is it discourages new pilots. When I was learning to land, there was no way I was going to do it on the runway, the grass around KSC is big and forgiving. Runway landing came later when I became able to get the plane on the ground in the first place.\u003C/p\u003E\u003Cp\u003EI\u0027d hate to mess with the learning curve there.\u003C/p\u003E\n"}]}