{"TopicId":9724,"ForumId":16,"TopicTitle":"Caught by Mun gravity","CreatedByName":"Maraz","CreatedById":22308,"CreatedDateTime":"2012-04-20T10:47:07Z","PageNum":1,"Articles":[{"CreatedByName":"Maraz","CreatedById":22308,"CreatedDateTime":"2012-04-20T10:47:07Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI am practicing missions to the Mun; more than often, where I am caught by the Mun gravity, my new hyperbolic orbit leads me to a direct crash on the Mun surface (Peryapsis is below the Mun surface). At that time I could try a direct descent, and I have done that. But, assuming that I want to enter a Mun orbit, what is the most safe and fuel-efficient manoeuvre I can do? I have tried burning prograde, but if the Periapsis is very close to the Mun\\\u0027s center, it does not work and surely doesnt look efficient.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003Cp\u003EMaraz.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-04-20T11:09:22Z","Content":"\n\u003Cp\u003EHi Maraz\u003C/p\u003E\u003Cp\u003EMy preferred method is to only raise my Apoapsis to about 10,400,000 meters, when the Mun catches up to me my trajectory becomes a counter clockwise orbit that can escape Kerbin, but I can easily correct this with a burn it Periapsis, this then allows me to get into an easterly orbit around the Mun.\u003C/p\u003E\u003Cp\u003EI have recently seen Munar approaches where the Apoapsis is 12,400,000, from there you can get into a westerly Munar orbit.\u003C/p\u003E\u003Cp\u003EIf you find yourself heading for a Munar collision still though, use the purple markers as a quick guide on where to burn to move your trajectory out of the Mun, they point towards and away from the space center.\u003C/p\u003E\u003Cp\u003EHope this helps you.\u003C/p\u003E\n"},{"CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2012-04-20T12:18:10Z","Content":"\n\u003Cp\u003EMy strategy is rather odd. I launch the apogee to 11,000,000 meters, coast to the apogee, and the bring the perigee out to 11,000,000 meters, and then I catch up to the mun, and land.\u003C/p\u003E\u003Cp\u003EEdit: this puts you in a stable orbit around the mun. 8)\u003C/p\u003E\n"},{"CreatedByName":"Newman","CreatedById":11547,"CreatedDateTime":"2012-04-20T13:39:16Z","Content":"\n\u003Cp\u003EA good way to get a feel for it is to experiment. Quicksave, set your throttle to a low setting, go to map mode, turn your craft around and see what it does to the orbital path. But to answer your question, once you find yourself on a collision course with the Mun, imagine drawing a line from your position towards the flight direction vector. Now imagine a line that is at 90 degrees angle on that one - direction really depends on which side you\\\u0027re approaching the Mun from. Experiment in map mode.\u003C/p\u003E\u003Cp\u003EOr you could avoid having collision courses at all. When doing your TMI burn, make sure that your apoapsis is a bit further than Mun orbit. If it\\\u0027s far enough you\\\u0027ll end up on a Mun flyby with a periapsis above it\\\u0027s surface. Again, experiment in map mode, now that they\\\u0027ve added the possibility to control your craft in it it\\\u0027s never been easier to figure stuff out.\u003C/p\u003E\n"},{"CreatedByName":"fremen","CreatedById":22236,"CreatedDateTime":"2012-04-20T14:29:16Z","Content":"\n\u003Cp\u003EFg - gravity force of the moon.\u003C/p\u003E\u003Cp\u003EFe - directon you sould burn (direction of front of the ship)\u003C/p\u003E\u003Cp\u003EEm - direction you move in respect to the moon. \u003C/p\u003E\u003Cp\u003EIts easy, than you burn as long as your orbit moves in save zone. Its fule consuming so as soon as you are clear of the planet leave it and correct on the apex point of orbit.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-04-20T16:38:15Z","Content":"\n\u003Cp\u003EIf you do this early, immediately upon entering Mun SOI, then the fuel cost is small because you have time and momentum on your side. Later, as your speed increases, it is more difficult to change direction.\u003C/p\u003E\u003Cp\u003EAlso, this diagram is similar to changing inclination as you approach Mun. (Adapt the diagram by rotating your mind 90 degrees.) Burn north or south and a bit inwards to make your Munar orbit inclined, or even polar if you want to. Also handy for correcting when the inclination is accidental, just do the opposite.\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2012-04-20T19:54:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fremen\u0022 data-cite=\u0022fremen\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFg - gravity force of the moon.\u003C/p\u003E\u003Cp\u003EFe - directon you sould burn (direction of front of the ship)\u003C/p\u003E\u003Cp\u003EEm - direction you move in respect to the moon. \u003C/p\u003E\u003Cp\u003EIts easy, than you burn as long as your orbit moves in save zone. Its fule consuming so as soon as you are clear of the planet leave it and correct on the apex point of orbit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\\\u0027t understand that diagram. Why is the new orbit drawn through the tip of the resultant force vector? It should be drawn through the craft\\\u0027s position.\u003C/p\u003E\u003Cp\u003EThe easiest way to raise periapsis is to burn 90Â° from your velocity vector in the \u0027skyward\u0027 direction. If you have a specific periapsis in mind, you can do the calculations for a little more efficient burn.\u003C/p\u003E\n"},{"CreatedByName":"Maraz","CreatedById":22308,"CreatedDateTime":"2012-04-22T12:49:16Z","Content":"\n\u003Cp\u003EThanks for all clarifications!\u003C/p\u003E\u003Cp\u003EMaraz\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2012-04-22T15:29:54Z","Content":"\n\u003Cp\u003EThe most efficient way to raise your orbit, if you are heading straight into a collision course with the Mun, is to burn radially, ie: point your craft opposite to the the central point of your orbital ellipse. This comes with a pretty hefty fuel penalty, which is why it is much better to have a nice periapsis as you enter the Mun\\\u0027s influence.\u003C/p\u003E\u003Cp\u003EI usually fire my TLI burn from Kerbin orbit:\u003C/p\u003E\u003Cp\u003E- At the moment the Mun rises over Kerbin\\\u0027s\u003C/p\u003E\u003Cp\u003E- Aiming for a 10.4 Mm apoapsis, which is slightly short, but usually attracts you into a nice 50 to 200km periapsis around the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-04-23T04:39:25Z","Content":"\n\u003Cp\u003EBurning radially raises your orbit only if your motion is nearly horizontal. In which case, it is the same as \u002790Â° from your velocity vector in the \u0027skyward\u0027 direction\u0027, as Kosmo-not said. But in the case of a collision course with Mun, the correction would be done far away, while the radial direction is close to retrograde. Very hefty fuel penalty indeed.\u003C/p\u003E\n"},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2012-04-23T05:00:58Z","Content":"\n\u003Cp\u003ERadial to the orbit does mean 90 degrees skyward/groundward from prograde, I\\\u0027m pretty sure.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-04-23T06:02:10Z","Content":"\n\u003Cp\u003ERadial is in reference to the planet. Right? No? It\\\u0027s in reference to the velocity vector? Oh, that would explain a few recent crashes. :-[\u003C/p\u003E\n"}]}