{"TopicId":97308,"ForumId":69,"TopicTitle":"Solar Panel Help.","CreatedByName":"Bauks","CreatedById":136119,"CreatedDateTime":"2015-01-20T22:40:21Z","PageNum":1,"Articles":[{"CreatedByName":"Bauks","CreatedById":136119,"CreatedDateTime":"2015-01-20T22:40:21Z","Content":"\n\u003Cp\u003EI cannot activate my solar panels. I know you are supposed to simply right click and deploy, but for the last few days right clicking does absolutely nothing and it seems to be just for the various solar panels. If I open the action groups and click on them it will show them and the option but still not let me open them. Any help in the right Direction would be appreciated. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-12T20:07:24Z\u0022 title=\u002202/12/2015 08:07  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 12, 2015\u003C/time\u003E by Bauks\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-21T00:02:41Z","Content":"\n\u003Cp\u003EWell, it\u0027d be a good idea to check that you\u0027ve not already run out of electricity, for one -- look at the resources display in the widget at the top right. If you have, you\u0027re a bit stuck!\u003C/p\u003E\u003Cp\u003EIf that is the case -- always pack additional batteries (the small amount of charge in probe cores is insufficient even to last a short time without engines running), and always have one small spare battery somewhere that you\u0027ve disabled as an emergency battery (so that it doesn\u0027t get used at all until you really need it); while you can\u0027t extend solar panels without power, you \u003Cem\u003Ecan\u003C/em\u003E enable and disable batteries and a few other things.\u003C/p\u003E\u003Cp\u003EIt\u0027s also a very good idea to pack a couple of static solar panels that don\u0027t need to be extended to function. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bauks","CreatedById":136119,"CreatedDateTime":"2015-01-21T04:27:52Z","Content":"\n\u003Cp\u003EYes I do Have power. I have tried all of the arrays that extend, both in the rocket assembly building, and in flight. Nothing seems to work. I had been using them just fine up till a few days ago when I noticed this problem. On the upside the regular panels work just fine as they don\u0027t have to be deployed so that\u0027s what I have been using as of late. If I\u0027m the only one having this problem I may just reinstall the game but really don\u0027t want to with all the hours I\u0027ve put into the career mode.\u003C/p\u003E\n"},{"CreatedByName":"cantrbe","CreatedById":17450,"CreatedDateTime":"2015-01-23T08:11:52Z","Content":"\n\u003Cp\u003EReinstalling is probably the easist fix,and you dont have to lose your saves over it! Just navigate to your KSP directory, open the folder named \u0027Saves\u0027 and just copy your save folder (folder is called whatever your ingame save is) and copy and paste it into your newly downloaded KSP\u0027s \u0027Saves\u0027 folder.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-01-23T12:32:39Z","Content":"\n\u003Cp\u003ESome systems are more prone to the right-click bug than others. Are you running OSX?\u003C/p\u003E\u003Cp\u003EI\u0027d say that no matter the system, that is what you are experiencing. I don\u0027t know the fix, though. Maybe someone else could help?\u003C/p\u003E\u003Cp\u003E(\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E 1,500 posts!)\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-23T12:52:59Z","Content":"\n\u003Cp\u003EOh, I see what you mean. Often if the right-click menus aren\u0027t working I\u0027ll just furiously click until they appear. However, I\u0027ve found that it\u0027s most effective to simply double click in these instances. It\u0027ll get it to appear within a few tries.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-01-23T14:26:35Z","Content":"\n\u003Cp\u003EThere is a button bug on the 64bit release. It prevents buttons from being pressed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bauks","CreatedById":136119,"CreatedDateTime":"2015-02-12T19:20:29Z","Content":"\n\u003Cp\u003EYa this seems to be what I\u0027m experiencing. I am running x64 bit windows 7. I have tried for several weeks to open any solar panel I could to no avail. I have uninstalled and reinstalled. Used steam to check the integrity of the games files. I can see the Panels in the action groups selection screen when I click on it . It gives me the actions of the panel but again won\u0027t let me do anything with them. I could just use the Simple panels that don\u0027t need to be extended but really ruins a lot of designs for me. Any help would be ..well helpful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-12T20:07:12Z\u0022 title=\u002202/12/2015 08:07  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 12, 2015\u003C/time\u003E by Bauks\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-02-12T19:42:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bauks\u0022 data-cite=\u0022Bauks\u0022\u003E\u003Cdiv\u003EYa this seems to be what I\u0027m experiencing. I am running x64 bit windows 7. I have tried for several weeks to open any solar panel I could to no avail. I have uninstalled and reinstalled. Used steam to check the integrity of the games files. I can see the Panels in the action groups selection screen when I click on it . It gives me the actions of the panel but again won\u0027t let me for anything with them. I could just use the Simple panels that don\u0027t need to be extended but really ruins a lot of designs for me. Any help would be ..well helpful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you on Windows x64, or on 64-bit KSP?\u003C/p\u003E\n"},{"CreatedByName":"Bauks","CreatedById":136119,"CreatedDateTime":"2015-02-12T20:04:05Z","Content":"\n\u003Cp\u003EYes Windows 7 64 bit. And running KSP x64 as well.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-02-12T20:42:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bauks\u0022 data-cite=\u0022Bauks\u0022\u003E\u003Cdiv\u003EYes Windows 7 64 bit. And running KSP x64 as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Win64 version of KSP is notoriously buggy. You could try it on a Win32 install (saves can move right over, generally). Unless you are running an absolute ton of mods you\u0027ll be better served with the Win32 version.\u003C/p\u003E\n"},{"CreatedByName":"JebTheKerbal","CreatedById":186356,"CreatedDateTime":"2018-03-18T20:31:52Z","Content":"\n\u003Cp\u003E\nI have the same problem, But in 1.4.1\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}