{"TopicId":97346,"ForumId":55,"TopicTitle":"There should be a \u0026quot;grand tour\u0026quot; planetary alignment in the first years of the game.","CreatedByName":"Iron4venger","CreatedById":89812,"CreatedDateTime":"2015-01-21T12:13:56Z","PageNum":1,"Articles":[{"CreatedByName":"Iron4venger","CreatedById":89812,"CreatedDateTime":"2015-01-21T12:13:56Z","Content":"\n\u003Cp\u003EHi guyz.\u003C/p\u003E\u003Cp\u003EAs Kerbal is getting closer and closer to \u0022complete\u0022 state. I think is time for me to raise this argument.\u003C/p\u003E\u003Cp\u003EI\u0027m a probe fan, and I can tell you, if you didn\u0027t know already, is that probes needs a lot of gravity jukes to get anywhere, probably they are the most demaning missions on Kerbal regarding calculation and planing beforehand.\u003C/p\u003E\u003Cp\u003EAnyway, since the first day of me playing this game, \u003Ca href=\u0022https://docs.google.com/spreadsheet/ccc?key=0ArG0gPniUDzNdEpQcnBmUXVGdFU2a2c3akE3bmtXT\u0022 rel=\u0022external nofollow\u0022\u003EI tried super-hard to found a \u0022Gran Tour\u0022 of Kerbol to replicate the Voyager missions\u003C/a\u003E, with no success. And as people developed math programs to calculate gravity assist, It become clear that there\u0027s no such thing in Kerbal. No grand tour mission is possible. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/cTIGOe5ckj0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ESo, I went as far as moving the planets with Hyper Edit to build my own, but then the question arises Ã‚Â¿Why is not there? Ã‚Â¿Why a Grand Tour by default is not present?. Let\u0027s say you start anew and as time goes on then you can do it. IDK about career and other parts of the game because I only send probes on sandbox xD So idk if you can do a contract around this or whatever. But I think is a valid choice.\u003C/p\u003E\u003Cp\u003EIt would be a great adition to the game I think, it would help people to acomplish a nice mission if they choose to do so (either manned or unmanned), and a great educational tool because you can teach kids what it is, and how awesome Voyager was, doing all that planet stuff with no fuel at all.\u003C/p\u003E\u003Cp\u003ESo, my asking to developers, is to change the planetary starting points, so, as time progresses, this gran tour alignment happens.\u003C/p\u003E\u003Cp\u003ECheers. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2015-01-21T12:18:39Z","Content":"\n\u003Cp\u003EI like it.\u003C/p\u003E\u003Cp\u003Epoint: why do you feel like probe missions are harder?\u003C/p\u003E\u003Cp\u003EUnless you play with Remote Tech, I think they are MUCH easier since probe missions are much lighter.\u003C/p\u003E\u003Cp\u003EIn any case, I think successive versions of KSP should not start with the planets at the same locations. It would spice things up if they weren\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"Iron4venger","CreatedById":89812,"CreatedDateTime":"2015-01-21T12:31:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Axelord FTW\u0022 data-cite=\u0022Axelord FTW\u0022\u003E\u003Cdiv\u003EI like it.\u003Cp\u003Epoint: why do you feel like probe missions are harder?\u003C/p\u003E\u003Cp\u003EUnless you play with Remote Tech, I think they are MUCH easier since probe missions are much lighter.\u003C/p\u003E\u003Cp\u003EIn any case, I think successive versions of KSP should not start with the planets at the same locations. It would spice things up if they weren\u0027t.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eofc i play RemoteTech xD, and a buch of other plugins, like realistic RTGs and stuff. And I do think probes needs a lot of overhaul so, they become important exploring tools for you, and you can save on \u0022expedable\u0022 crew memebers.\u003C/p\u003E\u003Cp\u003EAnyway not the point.\u003C/p\u003E\u003Cp\u003EFor you suggestion of planets starting randomly, but with a grand tour alignment available, one possible solution it would be: Let\u0027s say the Gran tour alignment is time 0. Then randomly start the game away from that point in time (1, 2, 3 years...). And add a contract to alert you when it gonna happen again as you get close to date (6 months in advance or so).\u003C/p\u003E\u003Cp\u003EI can tell you that would make me play career as hell. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-21T12:36:10Z\u0022 title=\u002201/21/2015 12:36  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 21, 2015\u003C/time\u003E by Iron4venger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-01-21T12:31:57Z","Content":"\n\u003Cp\u003Emy problem is when i enter a new SOI, the periapsis changes. I\u0027ll have a perfect aerobrake set up for duna just as I leave kerbin, but when I cross into the duna SOI, it is off by hundreds of thousands of meters. Is there a fix for this?\u003C/p\u003E\u003Cp\u003Eedit: and no its not ike interference, i\u0027ve tested.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-21T12:38:32Z\u0022 title=\u002201/21/2015 12:38  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 21, 2015\u003C/time\u003E by r4pt0r\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-21T12:54:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003Emy problem is when i enter a new SOI, the periapsis changes. I\u0027ll have a perfect aerobrake set up for duna just as I leave kerbin, but when I cross into the duna SOI, it is off by hundreds of thousands of meters. Is there a fix for this?\u003Cp\u003Eedit: and no its not ike interference, i\u0027ve tested.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure what this has to do with the OP but the problem is you\u0027re going though the SOI at a time warp greater than 1. 5, 10, and even 50 will only set you off by a few meters (Maybe a couple dozen for 50x) but higher than that it can get crazy.\u003C/p\u003E\u003Cp\u003EThe stock solution is to slow down manually as you get close to SOIs, and wait for this \u0022warp to\u0022 thing HarvesteR is talking about. The \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ecorrect\u003C/span\u003E modded solution is to use Kerbal Alarm Clock and set automatic SOI changes so every single ship, every single SOI change, you get an alert for.\u003C/p\u003E\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2015-01-21T13:19:31Z","Content":"\n\u003Cp\u003EHe seems to not rly refer to the unmanned aspect of probe missions. I think he means extensive use of gravity assists/slingshots.\u003C/p\u003E\u003Cp\u003EI would like to see this aswell. I would also like to have a better tool to plan maneuver nodes, so I don\u0027t need to install a mod for it\u003C/p\u003E\u003Cp\u003EEdit: \u002B1 on kerbal alarm clock\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-01-21T13:23:21Z","Content":"\n\u003Cp\u003EThis is a great idea! Maybe not the first year but once in 10 years? In career mode i doubt many people would attempt a grand tour with most of the tech tree locked. (Scott is the exception)\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-01-21T13:58:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003ENot sure what this has to do with the OP but the problem is you\u0027re going though the SOI at a time warp greater than 1. 5, 10, and even 50 will only set you off by a few meters (Maybe a couple dozen for 50x) but higher than that it can get crazy.\u003Cp\u003EThe stock solution is to slow down manually as you get close to SOIs, and wait for this \u0022warp to\u0022 thing HarvesteR is talking about. The \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ecorrect\u003C/span\u003E modded solution is to use Kerbal Alarm Clock and set automatic SOI changes so every single ship, every single SOI change, you get an alert for.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was recently pointed out to me that it is best to cross the SoI border at the lowest on-rails time warp setting rather than at 1x. The reason is that the off-rail physics use 32-bit calculations while the on-rails trajectories use 64-bit, so the floating point errors are much smaller. I haven\u0027t had a chance to test this empirically yet, but it makes sense to me.\u003C/p\u003E\u003Cp\u003EEdit: Also, moving this to Suggestions and Development as it\u0027s pretty clearly a suggestion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-21T14:21:13Z\u0022 title=\u002201/21/2015 02:21  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 21, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Iron4venger","CreatedById":89812,"CreatedDateTime":"2015-01-21T18:40:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022worir4\u0022 data-cite=\u0022worir4\u0022\u003E\u003Cdiv\u003EThis is a great idea! Maybe not the first year but once in 10 years? In career mode i doubt many people would attempt a grand tour with most of the tech tree locked. (Scott is the exception)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf implemented, I don\u0027t know about the period when all the planets would align again (maybe never) but I believe it would be more than 10 years if it happens xD\u003C/p\u003E\u003Cp\u003EI only need the alignment once, really. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd I think is significant you arise the tech tree lock, Voyagers managed to provide most of what we know (and saw thru photo) about the outward solar system even \u003Cem\u003Etoday\u003C/em\u003E. The best photos of Neptune you can see, are from Voyager 2 1989 fly-by. So, I think as long as you can provide a little more Dv than needed to reach Duna, you should be fine (probably) reaching Dres Jool and Eeloo. What I mean is, no matter how locked is your tech tree (unless is ridiculous small), a mission such this still would provide a ton of science points, even if you miss it halfway. And all those Gravs. should made it somewhat easier. If not, still a pretty decent challege to tackle xD\u003C/p\u003E\u003Cp\u003ENow that I mention it, yes, a grand tour should include all the planets, and that includes the inners, Eve and moho. (So you can do both directions)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-21T18:53:09Z\u0022 title=\u002201/21/2015 06:53  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 21, 2015\u003C/time\u003E by Iron4venger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-01-22T01:11:01Z","Content":"\n\u003Cp\u003Esorry, I was unclear earlier. What I tried to do was plan a voyager style mission, but when I warped into a new SOI, my carefully placed periapsis changed and did not slingshot me to the next planet as I had intended. thats how my post related to this thread lol.\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2015-01-22T05:02:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Iron4venger\u0022 data-cite=\u0022Iron4venger\u0022\u003E\u003Cdiv\u003Eofc i play RemoteTech xD, and a buch of other plugins, like realistic RTGs and stuff. And I do think probes needs a lot of overhaul so, they become important exploring tools for you, and you can save on \u0022expendable\u0022 crew members.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI play with RT now too and I wouldn\u0027t drop it for a millionth of all the gold in the world. It really makes you think hard on how you tackle each missions.\u003C/p\u003E\u003Cp\u003EI\u0027d love to see something like it making Stock status one day.\u003C/p\u003E\n"}]}