{"TopicId":97473,"ForumId":16,"TopicTitle":"Bring a \u0026quot;newly discovered\u0026quot; asteroid...","CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-01-22T20:31:27Z","PageNum":1,"Articles":[{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-01-22T20:31:27Z","Content":"\n\u003Cp\u003E...refers to what exactly?\u003C/p\u003E\u003Cp\u003Ea.) asteroid must have spawned as an unidentified object after the contract was accepted\u003C/p\u003E\u003Cp\u003Eb.) asteroid must be tracked for the first time after the contract was accepted\u003C/p\u003E\u003Cp\u003Ec.) asteroid must be approached (loaded into physics) for the first time after the contract was accepted\u003C/p\u003E\u003Cp\u003EThanks in advance for your assistance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-01-22T20:34:06Z","Content":"\n\u003Cp\u003EAs yet, I\u0027ve not found any asteroids that don\u0027t count for this... perhaps because I don\u0027t tend to put long term trackers on them unless I have a contract and can see it will interact with Kerbin in the near future.\u003C/p\u003E\u003Cp\u003EI suspect it\u0027s more akin to \u0022un-visited\u0022 asteroid, rather than newly discovered - so option C from your list \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-01-23T10:18:01Z","Content":"\n\u003Cp\u003EOkay, thanks. That\u0027s one vote for C... which is actually the one I expected least.\u003C/p\u003E\u003Cp\u003EAnyone else who can share experiences on this topic? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2015-01-23T10:32:19Z","Content":"\n\u003Cp\u003EI completed one of these recently on the basis that it was \u0027b\u0027\u003C/p\u003E\u003Cp\u003EBefore accepting, I checked that there were plenty of options nearby at the right size category, then I accepted the mission, and started tracking them all to see which one was best to intercept and move into a Munar orbit. \u003C/p\u003E\u003Cp\u003EThe mission completed as expected, and paid out a tidy sum. Decent amount of science too iirc. And it was good fun, something different from the usual science grind.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-01-23T13:02:17Z","Content":"\n\u003Cp\u003EBut did you track them once before, or were they all still unknown objects until after you accepted the mission?\u003C/p\u003E\u003Cp\u003ESo far it seems pretty clear that A is ruled out, but I can\u0027t yet conclusively say whether it\u0027s B or C just yet.\u003C/p\u003E\u003Cp\u003EIf only it wasn\u0027t so extremely time-consuming to test...\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2015-01-23T13:56:19Z","Content":"\n\u003Cp\u003ENo I didn\u0027t start tracking them until after I had accepted the mission. I figured that was what it meant by newly discovered. It is kind of ambiguous wording.\u003C/p\u003E\n"},{"CreatedByName":"Clancy","CreatedById":167425,"CreatedDateTime":"2016-08-05T12:50:15Z","Content":"\n\u003Cp\u003E\nAnyone have an answer for this? I\u0027m still trying to figure it out. To me it\u0027s C or maybe something looser. Here\u0027s what I did: I accepted a contract to put a \u0022newly discovered\u0022 class B Asteroid in Kerbin Orbit. So I found one in the tracking station and started tracking it. While waiting the 100 days or so for it to get closer I accepted a new contract to put a \u0022newly discovered\u0022 class B asteroid in Mun orbit. When I finally got to the Asteroid, green check boxes lit up for both contracts. I put the Asteroid in Kerbin Orbit. Waited my ten seconds (plus several days to line up the intercepts) and brought it to the Mun and accomplished both contracts with one asteroid. So previously tracked Asteroids still count as \u0022Newly Discovered\u0022 Which raises the question: what else counts? I just accepted a couple of new asteroid contracts, so I\u0027ll do some experimentation. \n\u003C/p\u003E\n"}]}