{"TopicId":97475,"ForumId":16,"TopicTitle":"Sharing a space station like a craft file?","CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-01-22T20:44:40Z","PageNum":1,"Articles":[{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-01-22T20:44:40Z","Content":"\n\u003Cp\u003EI have plans for a new, really big space station that I\u0027m going to build. When I\u0027m done, I was going to post it on the forums to see if people like it.\u003C/p\u003E\u003Cp\u003EI know that .craft files can easily be shared, but is there any way to do something similar with a space station, assembled in orbit? Or would I just share the entire save file?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-23T01:38:40Z\u0022 title=\u002201/23/2015 01:38  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 23, 2015\u003C/time\u003E by Nikola7007\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2015-01-22T20:47:45Z","Content":"\n\u003Cp\u003EYou can either share the entire persistent save file or find the space station in the persistent file and copy the lines for only the station into another persistent. I don\u0027t know if it would work, but I don\u0027t see why not.\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2015-01-22T20:53:38Z","Content":"\n\u003Cp\u003EWhen sharing large projects, it is nice to have one assembled craftfile to see what to do and then all the parts needed as subassemblies or as packages including launchers.\u003C/p\u003E\n"},{"CreatedByName":"StormKat","CreatedById":126927,"CreatedDateTime":"2015-01-22T21:03:14Z","Content":"\n\u003Cp\u003EWill you be using KerbalX to share your .craft file(s)?\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-01-23T00:57:16Z","Content":"\n\u003Cp\u003EI\u0027ve made a utility (called InflightShipSave) that you can use to save an in-flight vessel back out to a .craft file. It doesn\u0027t function fully for docked vessels yet. It will let you save them, but the .craft file needs some touch up by hand. In the next iteration, it should have full docking port support.\u003C/p\u003E\u003Cp\u003EYou can find it buried in my bug fix / utilities page here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/97285-KSP-v0-90-Stock-Bug-Fix-Modules-%28Release-v0-1-7d-6-Jan-15%29-Misc-Utilities-%2818-Jan-15%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/97285-KSP-v0-90-Stock-Bug-Fix-Modules-%28Release-v0-1-7d-6-Jan-15%29-Misc-Utilities-%2818-Jan-15%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe only problem with this method is that, while you can share the assembled .craft, there probably won\u0027t be much people can do with it from the editor (except take it apart and see how it\u0027s built). Assuming it wasn\u0027t launched in a single launch...\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-01-23T01:38:27Z","Content":"\n\u003Cp\u003EThe more I think about it, the more it makes sense to just have a separate save for it. If people want to get it into a .craft file from there, then let them do so.\u003C/p\u003E\u003Cp\u003EThe idea was to use it a a \u0022station core\u0022 with a lot of area for docking/expansion, and then allow downloaders to assemble their own space stations once they have the core, but I doubt anyone will care enough to do that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks anyways guys!\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2015-01-23T11:49:57Z","Content":"\n\u003Cp\u003EYou had to loft it. (in pieces I assume)\u003C/p\u003E\u003Cp\u003EWhy not just share the launch vehicles (and provide assembly instructions)\u003C/p\u003E\u003Cp\u003EI think the fun part of space stations is all the orbital assembly.\u003C/p\u003E\n"}]}