{"TopicId":97609,"ForumId":55,"TopicTitle":"Do you feel KSP is ready for 1.0?","CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2015-01-24T02:37:39Z","PageNum":29,"Articles":[{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-01-27T20:44:36Z","Content":"\n\u003Cp\u003EI do wonder if Squad is having a bad case of \u0022\u003Ca href=\u0022https://en.wikipedia.org/wiki/Go_fever\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EGo Fever\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E\u0022. To which I say, it\u0027s the players that should be experiencing that! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-01-27T20:46:11Z","Content":"\n\u003Cp\u003EThey could at least give me weekly builds to see if I can safely sleep. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-01-27T20:49:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003EThis thread has slowed down, everyone is trembling in anticipation of the dev notes...\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EI don\u0027t know about you but my knees are knocking and my nerves are frayed, what could they say this week do you think?\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThe update following 1.0 will be 2.0.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003EThey\u0027re going to skip 2.0, no need for it. Straight on to 3.0!\u003C/div\u003E\u003C/blockquote\u003ENot a bad idea, Windows didn\u0027t really take off until v3 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\n"},{"CreatedByName":"skyace65","CreatedById":71431,"CreatedDateTime":"2015-01-27T21:25:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003EThey\u0027re going to skip 2.0, no need for it. Straight on to 3.0!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s what Microsoft\u0027s counting team would recomend\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-01-27T21:35:27Z","Content":"\n\u003Cp\u003Ethe point is that every one who has invested in the early access program has a bit of feeling of investment in the overall outcome of any 1.0 perceptions. We all want 1.0 to be the best that it can be. \u003C/p\u003E\u003Cp\u003EThat said, there seems to be a disconnect between the Devs and the community on this. I think this is a symptom of internal discontinuity between the community management process and design requirements management. Early access assumes a balance between original design requirements and external community feedback. Our beloved Devs have now moved to \u0022Beta\u0022 which might well assume no further input from the community. I hope not.\u003C/p\u003E\u003Cp\u003EIt would be nice to get come dev feedback on this.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-01-27T21:45:15Z","Content":"\n\u003Cp\u003EAs much as hate to say this, it really isnt ready to be considered fully developed until the performance is improved.\u003C/p\u003E\u003Cp\u003EWhile i dont technically consider ANY game that is still being patched in any way whatsoever developed, i guess most of the features squad invisioned in the game are included.\u003C/p\u003E\u003Cp\u003EThere are a few bugs here and there (im looking at you claw, or should i say instant kraken in a bottle). And the game does crash once in a rare while. But overall its fairly stable if you dont include a couple parts and or clipping (clipping still causes its share of explosions/phantom forces). Biggest problem is when part count goes above 500 in any one spot. This can cause anywhere from minor to heavy lag, and when parts go above 8-900, the game becomes more or less impossible to play, docking is not possible at that point due to the lag time between controls, ect. Aside from performance, i will say its a great game in every way, and even supports some form of MP, despite that mod being rather buggy in some situations (ive had at least 10 cases of kraken attacks within a week).\u003C/p\u003E\u003Cp\u003EAnyways, until im able to run at least 1000 parts on a gaming rig (i have quadcore i7, 8gb ram, gt770m gpu), i cant say this game is truly developed. Yes its a laptop, but its able to bloody run most anything even metro2033 (which is way more graphics/cpu intensive then this).\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-01-27T22:15:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EYes its a laptop, but its able to bloody run most anything even metro2033 (which is way more graphics/cpu intensive then this).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMetro 2033 is way, way less CPU-intensive than KSP. I\u0027m afraid you\u0027re going to be disappointed about being able to run 1000-part ships smoothly, even if multithreaded physics become possible.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-01-27T22:25:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EAnyways, until im able to run at least 1000 parts on a gaming rig (i have quadcore i7, 8gb ram, gt770m gpu), i cant say this game is truly developed. Yes its a laptop, but its able to bloody run most anything even metro2033 (which is way more graphics/cpu intensive then this).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I really don\u0027t think that comparing a game that calculates physics on a per part basis for arbitrary player-designed vessels to a largely fixed-environment FPS is at all a fair comparison. That kind of flexibility comes at a heavy performance cost, and one of the reasons free-form destructability of environments is such a big deal in FPS games is because it prevents a lot of the more traditional optimization techniques from being applied, that rely on a largely static environment where you can perform a lot of precomputation to speed things along at run time. The less you know about your data set ahead of time, the less of that you can do, and I can almost guarantee that Metro relies on an at least partially static environment to run at a reasonable frame rate.\u003C/p\u003E\u003Cp\u003EIn other words: player freedom comes at a heavy performance cost, and KSP has an awful lot of player freedom.\u003C/p\u003E\u003Cp\u003EIt\u0027s a similar situation to how people complain about the performance of Minecraft when it\u0027s so graphically simple in comparison to other games, and claim that\u0027s because of poor code or what have you. What they\u0027re neglecting there is that you\u0027re talking about an entirely free-form world where pretty much everything is dynamic and can be manipulated by the player. Some of the optimizations in the code to make that a possibility were actually quite brilliant at the time, and were a part of why that game was a first of its kind in a lot of ways.\u003C/p\u003E\u003Cp\u003EDo I think there\u0027s room for performance improvements in KSP? Almost inevitably. But it\u0027s really not fair to Squad to compare apples and oranges in making that point.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-27T22:53:00Z\u0022 title=\u002201/27/2015 10:53  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 27, 2015\u003C/time\u003E by FlowerChild\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-01-27T22:56:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wallygator\u0022 data-cite=\u0022Wallygator\u0022\u003E\u003Cdiv\u003EIt would be nice to get come dev feedback on this.\u003C/div\u003E\u003C/blockquote\u003EWe have it. Here is a link to Maxmaps \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108318-Do-you-feel-KSP-is-ready-for-1-0?p=1691253#post1691253\u0022 rel=\u0022external nofollow\u0022\u003Etweets \u003C/a\u003Eand \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108318-Do-you-feel-KSP-is-ready-for-1-0?p=1691315#post1691315\u0022 rel=\u0022external nofollow\u0022\u003Ecomments \u003C/a\u003Eearlier in this thread.\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-01-27T23:52:27Z","Content":"\n\u003Cp\u003ESo Squad looked out the window... saw the clouds passing by, and said \u0022we are leaving the atmosphere, we are about to get into space!\u0022 and then pulled up their sleeves and got ready to leave BETA and enter release 1.0.\u003C/p\u003E\u003Cp\u003ESo all good! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-01-27T23:56:31Z","Content":"\n\u003Cp\u003EWait wait wait...\u003C/p\u003E\u003Cp\u003EReentry heat?\u003C/p\u003E\u003Cp\u003EClouds?\u003C/p\u003E\u003Cp\u003EHL3?\u003C/p\u003E\u003Cp\u003EWe need to know, are they confirmed?\u003C/p\u003E\n"},{"CreatedByName":"Broax","CreatedById":109333,"CreatedDateTime":"2015-01-28T00:19:35Z","Content":"\n\u003Cp\u003EClouds? Did I miss something?\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-01-28T00:26:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Broax\u0022 data-cite=\u0022Broax\u0022\u003E\u003Cdiv\u003EClouds? Did I miss something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t think so... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-01-28T00:27:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Broax\u0022 data-cite=\u0022Broax\u0022\u003E\u003Cdiv\u003EClouds? Did I miss something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s one of the features some people believe should be added before 1.0.\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2015-01-28T01:52:15Z","Content":"\n\u003Cp\u003EWell, today\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108783-Devnote-Tuesdays-The-Really-Hot-Edition\u0022 rel=\u0022external nofollow\u0022\u003EDevnote Tuesday\u003C/a\u003E is out. And the only references to calling the next version \u00221.0\u0022 was using that as the label for the next version. Not a word about that 3/4 of their player base think \u00221.0\u0022 is a bad idea and for well-thought reasons about how it will impact Squad and KSP.\u003C/p\u003E\u003Cp\u003EObviously Squad is ignoring this issue and hopes it just will go away. That\u0027s sad.\u003C/p\u003E\u003Cp\u003EOn second thought, maybe Devnote Tuesday would be the wrong place for such a statement. That statement would be difficult too.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-28T01:59:09Z\u0022 title=\u002201/28/2015 01:59  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 28, 2015\u003C/time\u003E by Jacke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-01-28T01:55:26Z","Content":"\n\u003Cp\u003ESo will there be a disk version at 1.0 release? Because I want.\u003C/p\u003E\n"},{"CreatedByName":"asheft","CreatedById":112588,"CreatedDateTime":"2015-01-28T02:08:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jacke\u0022 data-cite=\u0022Jacke\u0022\u003E\u003Cdiv\u003EWell, today\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108783-Devnote-Tuesdays-The-Really-Hot-Edition\u0022 rel=\u0022external nofollow\u0022\u003EDevnote Tuesday\u003C/a\u003E is out. And the only references to calling the next version \u00221.0\u0022 was using that as the label for the next version. Not a word about that 3/4 of their player base think \u00221.0\u0022 is a bad idea and for well-thought reasons about how it will impact Squad and KSP.\u003Cp\u003EObviously Squad is ignoring this issue and hopes it just will go away. That\u0027s sad.\u003C/p\u003E\u003Cp\u003EOn second thought, maybe Devnote Tuesday would be the wrong place for such a statement. That statement would be difficult too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy thoughts exactly. I was hoping they would at least address the issue in some way... I guess KasperVld did say he was listening to the discussions, but I personally thought that the impression he gave was that he was merely observing them, and not really passing on the arguments to Squad to consider. I really hope that they have a good reason for this...\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-01-28T02:15:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jacke\u0022 data-cite=\u0022Jacke\u0022\u003E\u003Cdiv\u003EWell, today\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108783-Devnote-Tuesdays-The-Really-Hot-Edition\u0022 rel=\u0022external nofollow\u0022\u003EDevnote Tuesday\u003C/a\u003E is out. And the only references to calling the next version \u00221.0\u0022 was using that as the label for the next version. Not a word about that 3/4 of their player base think \u00221.0\u0022 is a bad idea and for well-thought reasons about how it will impact Squad and KSP.\u003Cp\u003EObviously Squad is ignoring this issue and hopes it just will go away. That\u0027s sad.\u003C/p\u003E\u003Cp\u003EOn second thought, maybe Devnote Tuesday would be the wrong place for such a statement. That statement would be difficult too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMax will probably make a statement on Reddit.\u003C/p\u003E\n"},{"CreatedByName":"KerBlam","CreatedById":134309,"CreatedDateTime":"2015-01-28T02:26:14Z","Content":"\n\u003Cp\u003EIt seems to me that they have noted the concerns of the community, and are going ahead with the release anyway. Whatever their reasons are, they obviously believe that they are ready, or they wouldn\u0027t be doing it. \u003C/p\u003E\u003Cp\u003EI think this thread has hashed over every concern that the community has had, repeatedly... If there was a good enough reason for SQUAD to delay the release and spend a bit more time in Beta, I think that\u0027s what they would be doing. These are smart guys... I think we should give them the benefit of the doubt. After all, even if the release isn\u0027t AAA standard, and full of bugs, it\u0027s not going to stop me playing KSP. I\u0027ll just be loading up my 0.90 game and love it all the same.\u003C/p\u003E\u003Cp\u003EI can\u0027t tell how well the mainstream gaming community is going to pick up KSP... If I\u0027m honest I\u0027d say that a majority won\u0027t have the patience for the learning curve, and go back to playing Call of Duty. Hardcore gamers won\u0027t be impressed with performance on their x64 gaming rigs.\u003C/p\u003E\u003Cp\u003E I think the Linux gaming community will take to it the most enthusiastically, and that\u0027s a reasonably small percentage of the market.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-01-28T02:31:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jacke\u0022 data-cite=\u0022Jacke\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EObviously Squad is ignoring this issue and hopes it just will go away. That\u0027s sad.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, it may not be incorrect either. One key point about the 75% figure is \u0022and dropping\u0022. Was 80% a couple of days ago, and the longer this goes on, I suspect the smaller that number will get. I\u0027ve been watching it rather closely and there\u0027s a steady downward trend there. My personal theory is that the longer it goes on, it slowly shifts from being dominated by the more hardcore forum goers that follow issues like this closely, to extend out into the more casual audience that may not feel as passionately about something like this and may not understand what all the hooplah is about in the first place.\u003C/p\u003E\u003Cp\u003EI also eagerly scanned over the dev notes to see if there was any mention of this, and while I was disappointed there wasn\u0027t any, I wasn\u0027t entirely surprised either. They may not be able to answer these concerns at this time, beyond what they\u0027ve already said. They may want to think it over longer before committing to any particular course of action. They may think the answers they\u0027ve given are already sufficient and addressing it further will only serve to stir the kettle and focus people on it even more.\u003C/p\u003E\u003Cp\u003EWe just don\u0027t know right now.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-01-28T02:37:51Z","Content":"\n\u003Cp\u003ETo me, it seems like they\u0027re moving forward to 1.0 simply because they don\u0027t like being labeled \u0022early access.\u0022 It\u0027s the same reason janitors are now sanitation engineers and home ec. is now...I don\u0027t know. My nephew told me what home ec. is now, and it\u0027s ridiculous.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlowerChild\u0022 data-cite=\u0022FlowerChild\u0022\u003E\u003Cdiv\u003EUnfortunately, it may not be incorrect either. One key point about the 75% figure is \u0022and dropping\u0022. Was 80% a couple of days ago, and the longer this goes on, I suspect the smaller that number will get. I\u0027ve been watching it rather closely and there\u0027s a steady downward trend there. My personal theory is that the longer it goes on, it slowly shifts from being dominated by the more hardcore forum goers that follow issues like this closely, to extend out into the more casual audience that may not feel as passionately about something like this and may not understand what all the hooplah is about in the first place.\u003Cp\u003EI also eagerly scanned over the dev notes to see if there was any mention of this, and while I was disappointed there wasn\u0027t any, I wasn\u0027t entirely surprised either. They may not be able to answer these concerns at this time, beyond what they\u0027ve already said. They may want to think it over longer before committing to any particular course of action. They may think the answers they\u0027ve given are already sufficient and addressing it further will only serve to stir the kettle and focus people on it even more.\u003C/p\u003E\u003Cp\u003EWe just don\u0027t know right now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven if it sways to 60% in favor. That\u0027s still \u003Cstrong\u003E40%\u003C/strong\u003E of people who think it\u0027s a bad idea. As of this moment, 73.27% think it\u0027s a bad idea.\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-01-28T02:45:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klgraham1013\u0022 data-cite=\u0022klgraham1013\u0022\u003E\u003Cdiv\u003EMax will probably make a statement on Reddit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was thinking twitter.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-01-28T02:46:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klgraham1013\u0022 data-cite=\u0022klgraham1013\u0022\u003E\u003Cdiv\u003EEven if it sways to 60% in favor. That\u0027s still \u003Cstrong\u003E40%\u003C/strong\u003E of people who think it\u0027s a bad idea. As of this moment, 73.27% think it\u0027s a bad idea.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it would be very hard to predict how low the percentage could possibly go. I think all we really know is that just over 500 of what are probably some of the most hardcore forum goers/players that make up the overall KSP player base think it\u0027s not ready for release, and while I have no idea how many copies KSP has actually sold, I\u0027d be willing to bet that\u0027s probably a rather small fraction of the overall number of players.\u003C/p\u003E\u003Cp\u003EStatistics collected from polls are very funny things and are highly dependent on the context in which a question is asked and who winds up responding as a result. Even choosing to respond to a poll in the first place indicates a person has a particular interest in the topic at hand...or just really likes answering polls \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-28T02:51:19Z\u0022 title=\u002201/28/2015 02:51  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 28, 2015\u003C/time\u003E by FlowerChild\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2015-01-28T02:51:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlowerChild\u0022 data-cite=\u0022FlowerChild\u0022\u003E\u003Cdiv\u003EUnfortunately, it may not be incorrect either. One key point about the 75% figure is \u0022and dropping\u0022. Was 80% a couple of days ago, and the longer this goes on, I suspect the smaller that number will get. I\u0027ve been watching it rather closely and there\u0027s a steady downward trend there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile the \u0022No\u0022 percentage has been dropping, the statistical significance of the result may be increasing. For example, an 80% result with 100 votes may be less significant than a 73% result with 750 votes.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-01-28T03:06:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gus\u0022 data-cite=\u0022Gus\u0022\u003E\u003Cdiv\u003EWhile the \u0022No\u0022 percentage has been dropping, the statistical significance of the result may be increasing. For example, an 80% result with 100 votes may be less significant than a 73% result with 750 votes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue enough. Don\u0027t get me wrong, I still very much think making the next version the release version (unless additional modifications are made to the release process to provide mass testing) is a terrible idea, and I\u0027ve probably been one of the most vocally opposed to it. However, I\u0027d probably be just as vocally opposed to it, and just as convinced of it, if I were the only one that had that point of view. Minority of one and all that.\u003C/p\u003E\u003Cp\u003EI just don\u0027t think that stats alone make a very compelling argument for anything, and that ultimately Squad will either hear the reasoning behind some of the arguments here and potentially modify their plan as a result, or they won\u0027t, and even if they do hear them, it\u0027s no guarantee they\u0027ll choose to respond to them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-28T03:10:02Z\u0022 title=\u002201/28/2015 03:10  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 28, 2015\u003C/time\u003E by FlowerChild\u003C/strong\u003E\n\u003C/span\u003E\n"}]}