{"TopicId":97672,"ForumId":55,"TopicTitle":"Squad have stopped caring","CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2015-01-24T17:03:32Z","PageNum":1,"Articles":[{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2015-01-24T17:03:32Z","Content":"\n\u003Cp\u003EI\u0027ve been playing since 0.16. In that time I\u0027ve seen KSP evolve from a brilliant prototype into a bit of a mess. Back then, Squad could churn out a massive update (like 0.17 or 0.18) in a third of the time, and the updates were brilliant. KSP is one of my favorite games but its pretty bad when Squad have more community mangers than developers. The latest updates have taken massively longer than the earlier ones and were pretty much dead on arrival, I appreciate that the newer updates were more complex, but at least bugfix better. And don\u0027t get me started on 64-bit version. Instead of shoving a few more buggy and broken features onto the pile and shouting \u0022Done!\u0022 take some time out to make the current features better. As it stands what KSP needs is a few good optomization updates and making the 64 bit version playable. \u003C/p\u003E\u003Cp\u003ELeave new features (at the moment) to modders who can accomplish far more in a fraction of the time \u003Cem\u003Eas a hobby\u003C/em\u003E no less, and with far more polish. \u003C/p\u003E\u003Cp\u003Ebefore people shout \u0022Judge the game, not the developers\u0022, the game is linked to the developers. Their practices affect the game.\u003C/p\u003E\u003Cp\u003EI love KSP, but it seems the developers don\u0027t, and I want this to change.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Einb4lock\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-01-24T17:08:47Z","Content":"\n\u003Cp\u003EIf you know what you\u0027re posting is going to cause a lock, don\u0027t post it. I\u0027m not saying you can\u0027t think what you think, or express what you think, but doing it like this is just bad form.\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2015-01-24T17:13:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jovus\u0022 data-cite=\u0022Jovus\u0022\u003E\u003Cdiv\u003EIf you know what you\u0027re posting is going to cause a lock, don\u0027t post it. I\u0027m not saying you can\u0027t think what you think, or express what you think, but doing it like this is just bad form.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you are getting annoyed about the inb4lock bit, than you have pretty much missed the point of the post. I am criticizing Squad as developers. That largely exists to make any overzealous mods think before silencing any dissent in their echo chamber.\u003C/p\u003E\n"},{"CreatedByName":"NFUN","CreatedById":78715,"CreatedDateTime":"2015-01-24T17:19:12Z","Content":"\n\u003Cp\u003EI don\u0027t think [most] of the community managers are paid. Who cares if they make a bunch of mods to patrol the forums, it isn\u0027t costing Squad any time or effort. The next update is also supposed to have lots of optimization, though I would prefer that they take it a bit slower.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-01-24T17:27:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI love KSP, but it seems the developers don\u0027t, and I want this to change.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWoah. I agree that there\u0027s a legion of issues (if I made a post about everything wrong with KSP and Squad, it would probably have to be split into about ten different messages due to the length limit), but I would \u003Cstrong\u003E\u003Cem\u003Enever\u003C/em\u003E\u003C/strong\u003E doubt Squad\u0027s commitment to, and love for, this game.\u003C/p\u003E\u003Cp\u003ESquad is totally devoted to making KSP the best game they can. They\u0027re just a bit inexperienced and have \u003Cem\u003Estrange\u003C/em\u003E priorities. And thought C# was a good idea. And Unity. And they don\u0027t understand specific impulse.\u003C/p\u003E\u003Cp\u003ESigned,\u003C/p\u003E\u003Cp\u003E 9.82IsWrong\u003C/p\u003E\n"},{"CreatedByName":"Damien_The_Unbeliever","CreatedById":129715,"CreatedDateTime":"2015-01-24T17:27:27Z","Content":"\n\u003Cp\u003ELast I checked, we\u0027ve all gotten what we\u0027ve (officially) paid for. If Squad had stopped caring, they would just stop. Full stop. Shut down the website and forums and walk away.\u003C/p\u003E\u003Cp\u003EFrom what I can see, that\u0027s not what they\u0027re doing. They\u0027re continuing to create.\u003C/p\u003E\u003Cp\u003EI\u0027m also almost certain that just about every seasoned player will have at least one aspect of 1.0 that they hate or don\u0027t think time should have been spent on. That\u0027s to be expected but it\u0027s almost certain that 100% of seasoned players won\u0027t agree on *which* features should have been done differently.\u003C/p\u003E\n"},{"CreatedByName":"iFlyAllTheTime","CreatedById":111190,"CreatedDateTime":"2015-01-24T17:28:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI love KSP, but it seems the developers don\u0027t, and I want this to change.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I can see that you\u0027re pretty upset by the latest announcement, in my opinion, I don\u0027t think that the developers have stopped caring.\u003C/p\u003E\u003Cp\u003EThis is squad\u0027s game, akin to harvester\u0027s baby. I wouldn\u0027t go as far as saying they don\u0027t care about the game.\u003C/p\u003E\u003Cp\u003EAlthough, I\u0027m with you when you say you\u0027d like to see this change.\u003C/p\u003E\u003Cp\u003EI was hoping for a couple, if not more, releases before the game could be called a polished and well optimized product. I was sort of expecting it to take a good part of 2015 to get there and see the 1.0 release by the end of the year.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure of the reason for a sudden rush to get to 1.\u003C/p\u003E\u003Cp\u003ELet\u0027s hope squad comes through and delivers.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-01-24T17:30:21Z","Content":"\n\u003Cp\u003EEarlier updates may have seemed faster and better, but it\u0027s always easier to pick the low-hanging fruit. Once they started getting into the more complicated features, it takes longer to do and more can go wrong. As for 64-bit, that\u0027s the Unity engine, not Squad. Squad only put out a 64bit version because some modders found a way to force it to run in 64bit, but forcing something to happen is always asking for trouble.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-01-24T17:32:42Z","Content":"\n\u003Cimg src=\u0022http://i.imgur.com/jl7EBTq.jpg\u0022 alt=\u0022jl7EBTq.jpg\u0022\u003E\n"},{"CreatedByName":"Hanuman","CreatedById":116709,"CreatedDateTime":"2015-01-24T17:34:14Z","Content":"\n\u003Cp\u003EThis forum has a reputation for not putting this kind of behavior on full display. They\u0027ve stopped caring about their creation? Really? Nobody, and I mean \u003Cstrong\u003Eno-freaking-body\u003C/strong\u003E believes that in the slightest. To suggest otherwise is utterly misguided at best, and just a flat out made up butthurt accusation at worst.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-01-24T17:35:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iFlyAllTheTime\u0022 data-cite=\u0022iFlyAllTheTime\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m not sure of the reason for a sudden rush to get to 1.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure it\u0027s ready for 1.0 either, but I can imagine a fair bit of pressure from higher up that after 4 years of develpoment, it\u0027s time to (in the words of Alan Shepard) \u0022Light this candle!\u0022 I\u0027m not saying it\u0027s right, but it\u0027s certainly understandable.\u003C/p\u003E\u003Cp\u003EEdit: It\u0027s not like they\u0027re going to destroy hundreds of millions of dollars worth of real-world hardware by having \u0022Go Fever\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T17:37:53Z\u0022 title=\u002201/24/2015 05:37  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by StrandedonEarth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-01-24T17:39:36Z","Content":"\n\u003Cp\u003ESoo...you got a suggestion? Anything to contribute? Something that somehow either clarify problems and maybe even some ideas for a solution? An actual sample of a bugfix patch, even? I am just seeing an opinion. And anyone has their own opinions. Which kind of make it not worth a lot.\u003C/p\u003E\u003Cp\u003EIndeed, free speech is a wonderful thing. But to exercise it without thinking, to simply give a statement of condescension from just looking at the end result of a complicate process and from there reading the very thoughts of a group of people, it is kind of a waste of free speech.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2015-01-24T17:39:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003EI\u0027ve been playing since 0.16. In that time I\u0027ve seen KSP evolve from a brilliant prototype into a bit of a mess. Back then, Squad could churn out a massive update (like 0.17 or 0.18) in a third of the time, and the updates were brilliant. KSP is one of my favorite games but its pretty bad when Squad have more community mangers than developers. The latest updates have taken massively longer than the earlier ones and were pretty much dead on arrival, I appreciate that the newer updates were more complex, but at least bugfix better. And don\u0027t get me started on 64-bit version. Instead of shoving a few more buggy and broken features onto the pile and shouting \u0022Done!\u0022 take some time out to make the current features better. As it stands what KSP needs is a few good optomization updates and making the 64 bit version playable. \u003Cp\u003ELeave new features (at the moment) to modders who can accomplish far more in a fraction of the time \u003Cem\u003Eas a hobby\u003C/em\u003E no less, and with far more polish. \u003C/p\u003E\u003Cp\u003Ebefore people shout \u0022Judge the game, not the developers\u0022, the game is linked to the developers. Their practices affect the game.\u003C/p\u003E\u003Cp\u003EI love KSP, but it seems the developers don\u0027t, and I want this to change.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Einb4lock\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESometimes i really have to wonder about some posts. At some point the house is complete and building the floors is completed. When this happens the only thing left to do on your housebuilding are cosmetical changes. The same applies to programming games. It is absolutely normal that as more the game nears completion the impact of the updates become less. At the end there will be only cosmetical stuff to fix.\u003C/p\u003E\u003Cp\u003EAlso the statement \u0022Squad have stopped caring\u0022 is pretty much a baseless one. If they have stopped caring there wouldn\u0027t have been any update since a long time ago. They last update was in December and it changed so much stuff. The next update will be the biggest update ever and yet you are saying they stopped caring?\u003C/p\u003E\u003Cp\u003EI strongly suggest that you think your statements over and do a reality check for your own sake.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-01-24T17:42:27Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003ELocking for cleanup, will reopen in a minute.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EReopened. Please refrain from resorting to personal attacks when discussing. Further personal attacks will be met with more severe official action. Discuss the post, not the poster, please.\u003C/p\u003E\u003Cp\u003EAlso, moving this discussion of KSP\u0027s development to the development forum.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T17:47:53Z\u0022 title=\u002201/24/2015 05:47  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scoundrel","CreatedById":15369,"CreatedDateTime":"2015-01-24T17:50:05Z","Content":"\n\u003Cp\u003EI think it is a bit premature to condemn Squad before seeing what 1.0 ends up looking like. I won\u0027t argue that the game is in desperate need of a polish, and that the trial-and-error nature of KSP\u0027s development (I\u0027m not going to comment on the mismanagement and backlash regarding \u0022project V\u0022) has many of us concerned that the game will never meet its potential. That isn\u0027t up for debate.\u003C/p\u003E\u003Cp\u003EHowever, I do believe that concluding that 1.0 won\u0027t be any different that 0.9 is pure speculation, and even if it was, Squad has not indicated that they will simply wash their hands of KSP once it is released, as they have stated on multiple occasions their commitment to continuing to work on the project well beyond 1.0. Apparently people do not believe Squad is capable of producing a finished, professional product despite KSP being the only software they have ever developed.\u003C/p\u003E\u003Cp\u003EThus the only conclusion one can come to is that threads such as these, which will, like a star, burn brightly for the first bit before fading into the red dwarf of cyclical white knighting and criticasting, is a result of a chronic PR issue that Squad has never really addressed.\u003C/p\u003E\u003Cp\u003ESo, before we step onto that treadmill, perhaps we could examine what Squad could do to fix that problem before we get another community meltdown.\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2015-01-24T17:53:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022 data-cite=\u0022StrandedonEarth\u0022\u003E\u003Cdiv\u003EEarlier updates may have seemed faster and better, but it\u0027s always easier to pick the low-hanging fruit. Once they started getting into the more complicated features, it takes longer to do and more can go wrong. As for 64-bit, that\u0027s the Unity engine, not Squad. Squad only put out a 64bit version because some modders found a way to force it to run in 64bit, but forcing something to happen is always asking for trouble.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESquad put it in their game. If the game is released and it crashes when a reasonable number of mods, then it\u0027s their responsibility to fix it. When its released, and reviewer is reviewing it and it isn\u0027t working, they\u0027ll tear it a new one. Either wait for Unity 5 (which I would recommend) or begin fixing it (which i also recommend)\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-01-24T17:58:14Z","Content":"\n\u003Cp\u003EHonestly, I expect there to be no Win64 version for 1.0 (opinion, I have no inside info about it). Until Unity gets Win64 support working well, there\u0027s little Squad can do about it, and it does reflect poorly on a game no longer in early access.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2015-01-24T17:59:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003ESquad put it in their game. If the game is released and it crashes when a reasonable number of mods, then it\u0027s their responsibility to fix it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo it\u0027s not, imagine General Motors beeing responsible for the car YOU broke by modding it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003E When its released, and reviewer is reviewing it and it isn\u0027t working, they\u0027ll tear it a new one. Either wait for Unity 5 (which I would recommend) or begin fixing it (which i also recommend)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know when they release it will be perfectly fine. That\u0027s what the testers are here for.\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-01-24T18:05:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003ESquad put it in their game. If the game is released and it crashes when a reasonable number of mods, then it\u0027s their responsibility to fix it. When its released, and reviewer is reviewing it and it isn\u0027t working, they\u0027ll tear it a new one. Either wait for Unity 5 (which I would recommend) or begin fixing it (which i also recommend)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you think reviewers are going to install a bunch of mods to review the game?\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2015-01-24T18:08:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003ENo it\u0027s not, imagine General Motors beeing responsible for the car YOU broke by modding it.\u003Cp\u003EI know when they release it will be perfectly fine. That\u0027s what the testers are here for.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose testers weren\u0027t very good when .21 and .22 both rocked up pretty much unplayable because of the bugs\u003C/p\u003E\n"},{"CreatedByName":"Melfice","CreatedById":3143,"CreatedDateTime":"2015-01-24T18:15:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003EThose testers weren\u0027t very good when .21 and .22 both rocked up pretty much unplayable because of the bugs\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E... define unplayable.\u003C/p\u003E\u003Cp\u003EI played just fine. There was an occasional issue, but it wasn\u0027t unplayable.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-01-24T18:15:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003ENo it\u0027s not, imagine General Motors beeing responsible for the car YOU broke by modding it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESometimes I wonder if SQUAD wants to say something with all these \u0022Warranty void if...\u0022 warning with their parts.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-01-24T18:16:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003EThose testers weren\u0027t very good when .21 and .22 both rocked up pretty much unplayable because of the bugs\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewhat are you talking about? I started playing in .21, and I have had a CTD only twice since ive gotten ksp. I have had 3 craft destroyed due to the claw, but aside from that the game runs fine.\u003C/p\u003E\u003Cp\u003EEdit: Stock btw, I play the game squad actually made. any mod issues are not their fault.\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2015-01-24T18:17:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003EThose testers weren\u0027t very good when .21 and .22 both rocked up pretty much unplayable because of the bugs\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was playing this versions also and at no point there where gamebreaking bugs. Also there are no mentioning of gamebreaking bugs in the whole forum for that versions.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-01-24T18:51:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GusTurbo\u0022 data-cite=\u0022GusTurbo\u0022\u003E\u003Cdiv\u003EDo you think reviewers are going to install a bunch of mods to review the game?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would honestly believe that a lot of the \u0022review institutions\u0022 would already have a large amount of people familiar with KSP at this point. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt kinda has a way of being contagious.\u003C/p\u003E\u003Cp\u003EWhich way it would color the review is debatable of course, and depends on a lot of things, but I\u0027m pretty certain that the reviewers are at the very least likely to read the various warnings stating the issues with the 64-bit build if they do decide to test it. For some reason. And with all the things available in the game now, and things that will be available in the next update(s), I honestly doubt the average new player will feel a \u003Cem\u003Eneed\u003C/em\u003E for mods from the outset.\u003C/p\u003E\u003Cp\u003EThe only problem I\u0027m seeing is that they\u0027re declaring the \u003Cem\u003Enext\u003C/em\u003E release the 1.0 release. Instead of the 1.0RC. I really, really think they should bring back the public experimentals for just this once. If they want to catch as many odd bugs as they can before the release day, they should get the broadest possible tester base.\u003C/p\u003E\n"}]}