{"TopicId":97698,"ForumId":39,"TopicTitle":"\u0026quot;Monolith\u0026quot; [CREEPYPASTA]","CreatedByName":"Souper","CreatedById":86003,"CreatedDateTime":"2015-01-24T19:35:49Z","PageNum":1,"Articles":[{"CreatedByName":"Souper","CreatedById":86003,"CreatedDateTime":"2015-01-24T19:35:49Z","Content":"\n\u003Cp\u003ETony stood there, trying to recognize what the black rectangle off in the distance was. He hadn\u0027t slept in 5 days, he wondered if it could be a hallucination.\u003C/p\u003E\u003Cp\u003EMike walked over to him, he and Tony wrapped their arms around their shoulders. Their helmets bumped together, the vacuum denying them of any external noise save for the radio headset.\u003C/p\u003E\u003Cp\u003ETony: Please, PLEASE tell me it\u0027s not another one.\u003C/p\u003E\u003Cp\u003EMike: It is. I...see it too.\u003C/p\u003E\u003Cp\u003ETony: Oh. Oh no.\u003C/p\u003E\u003Cp\u003ETony became enraged, dropping to the ground and pounding at the lunar soil in rage. He got back up and tossed a rock at the anomaly.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003EBad\u003C/strong\u003E\u003C/em\u003E move.\u003C/p\u003E\u003Cp\u003EThe monolith flew closer, hovering ever-silently. It stopped only a few feet away from the duo. Both had horrified expressions on them, but their yellow-tinted visors didn\u0027t show that.\u003C/p\u003E\u003Cp\u003ETony was levitated into the air while mike couldn\u0027t move. Mike could only stand and watch as tony\u0027s helmet was removed as the monolith began twisting and distorting tony\u0027s face beyond all recognition. He was then dropped to the ground, limp.\u003C/p\u003E\u003Cp\u003EMike looked down and saw that tony\u0027s face was completely inhuman; having had his eyes replaces with long tendrils; his mouth seemingly welded shut; his ears cut off and numerous horns jutting out of his neck.\u003C/p\u003E\u003Cp\u003EMike fell to his knees in horror, looking behind him to see the Monolith was gone with no trace.\u003C/p\u003E\u003Cp\u003EMike: Tony...I\u0027m sorry. I\u0027m so sor-\u003C/p\u003E\u003Cp\u003ETony decapitated mike with the cleaving blades that had grown on his hands. He got back up, shambling on the lunar surface, knowing only that he must feed. The monoliths are GODS. He must obey them, for they created the universe. They are his MASTER! Sure, here in the year 2078 they want to enslave humanity just as they had so many numerous other races, but that didn\u0027t change the fact THEY ARE GODS.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T19:39:22Z\u0022 title=\u002201/24/2015 07:39  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by Souper\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2015-01-25T20:00:27Z","Content":"\n\u003Cp\u003Egreat short story!\u003C/p\u003E\u003Cp\u003Ethe end seems a little sudden and it would be better if there was more leadup but great nonetheless\u003C/p\u003E\n"}]}