{"TopicId":97834,"ForumId":69,"TopicTitle":"Reaction wheels that don\u0026#039;t stop","CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2015-01-26T01:35:51Z","PageNum":1,"Articles":[{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2015-01-26T01:35:51Z","Content":"\n\u003Cp\u003EAnother random issue, that\u0027s probly un-replicable, but its happened more than once, so here goes..\u003C/p\u003E\u003Cp\u003ESeems that when doing positioning with sas and then time warping, vessels may get reaction wheels that turn continuously in the last direction you told it to before the time-warp, unless you manually fight it by inputting the opposite torque or time-warp again to stop physics or toggle all the reaction wheels off. But you can\u0027t use the hold vessel direction, be sas on or off.\u003C/p\u003E\u003Cp\u003EThe debug menu showed no errors or even warnings..\u003C/p\u003E\u003Cp\u003Eedit: no joysticks, never use trim, happens in space exclusively, occurs after excessive time warping and sas (and apllying torque at the same time as hitting warp) things like that tend to cause it\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-26T21:27:28Z\u0022 title=\u002201/26/2015 09:27  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 26, 2015\u003C/time\u003E by Nemrav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-26T01:40:46Z","Content":"\n\u003Cp\u003EIf you could at least attempt to put together a brief set of reproduction steps, we might be able to look into it. As-is, there\u0027s very little to go on here. We need data to be able to do anything.\u003C/p\u003E\u003Cp\u003EAlso, do you use a joystick, or even just have one plugged in? Is this a completely stock install? Can you provide craft files/save files for this occurrence?\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-01-26T01:45:59Z","Content":"\n\u003Cp\u003ECould be the trim. It\u0027s happened to me before.\u003C/p\u003E\n"}]}