{"TopicId":97933,"ForumId":38,"TopicTitle":"The Stanley Thread","CreatedByName":"IcarusBen","CreatedById":173604,"CreatedDateTime":"2015-01-26T23:57:08Z","PageNum":3,"Articles":[{"CreatedByName":"jake9039","CreatedById":122602,"CreatedDateTime":"2015-03-23T19:14:50Z","Content":"\n\u003Cp\u003Estanley follows the blue line.\u003C/p\u003E\n"},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-03-23T23:37:56Z","Content":"\n\u003Cp\u003ENarrator: now stanly the blue line leads to death so follow the red line please\u003C/p\u003E\n"},{"CreatedByName":"Prof. Endwalker","CreatedById":83020,"CreatedDateTime":"2015-03-25T12:24:40Z","Content":"\n\u003Cp\u003EStanley continues down the red line\u003C/p\u003E\u003Cp\u003ENarrator: Thank you! Finally Stanley follows the story for once. I am still very dissapointed in you, Stanley. Now, take the door on the left.\u003C/p\u003E\u003Cp\u003EStanley goes through the centre door.\u003C/p\u003E\u003Cp\u003ENarrator: Stanley, Stanley, Stanley... You never seem to listen, don\u0027t you?\u003C/p\u003E\n"},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-03-25T13:17:44Z","Content":"\n\u003Cp\u003ENarrator: stanly now that you have opened that door I will have to shoot you in less you go back\u003C/p\u003E\n"},{"CreatedByName":"jake9039","CreatedById":122602,"CreatedDateTime":"2015-03-28T04:41:42Z","Content":"\n\u003Cp\u003Estanly finds the blue line again and follows it some more.\u003C/p\u003E\n"},{"CreatedByName":"victory143","CreatedById":80787,"CreatedDateTime":"2015-06-01T15:49:50Z","Content":"\n\u003Cp\u003E\u0022Oh that\u0027s better. Now Stanley, all you have to do is follow the blue line, PAST the death. I did say past, not in too... Stanley!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Mr_Brain","CreatedById":33487,"CreatedDateTime":"2015-06-01T16:09:28Z","Content":"\n\u003Cp\u003EStanley decides to have a good look at the vial of death stored on a shelf next to the blue line, and then continues on the path.\u003C/p\u003E\u003Cp\u003ESoon after, he comes to a set of 3 open doors.\u003C/p\u003E\n"},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-06-01T19:02:28Z","Content":"\n\u003Cp\u003Ehe goes into the door on the left only to find THE LINEtm\u003C/p\u003E\n"},{"CreatedByName":"Astrofox","CreatedById":135785,"CreatedDateTime":"2015-06-02T00:14:44Z","Content":"\n\u003Cp\u003EStanley wonders at the very crudely drawn line, and starts to reconsider his \u0022choice.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-02T03:25:51Z","Content":"\n\u003Cp\u003EFeeling a tad confused, he decided to head back to explore the alternative before making a genuine choice.\u003C/p\u003E\n"},{"CreatedByName":"UnionPacific1983WP","CreatedById":140982,"CreatedDateTime":"2015-06-02T03:55:49Z","Content":"\n\u003Cp\u003ENarrator: Suddenly, a train smashes through the wall. Stanley boards the train.\u003C/p\u003E\n"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-06-02T04:39:23Z","Content":"\n\u003Cp\u003EStanley does not board the train, as he can see that in the process of smashing through the wall, the train has been rendered inoperable. (plus there are no tracks)\u003C/p\u003E\u003Cp\u003EWalking to the other side, he finds a small puppy.\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-02T14:35:41Z","Content":"\n\u003Cp\u003EOkay, Stanley, I think we\u0027re getting off on the wrong foot here. You\u0027re supposed to go find a puppy. It\u0027s not a difficult task.\u003C/p\u003E\u003Cp\u003EOkay, take the second door on your left to get back on track.\u003C/p\u003E\n"},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-06-02T14:41:52Z","Content":"\n\u003Cp\u003Estanly walks through the trap door below him\u003C/p\u003E\n"},{"CreatedByName":"Blueshark109","CreatedById":143076,"CreatedDateTime":"2015-07-21T18:39:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ethanadams\u0022 data-cite=\u0022Ethanadams\u0022\u003E\u003Cdiv\u003Estanly walks through the trap door below him\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStanley falls to a big armoury with the words on a sign \u003Cstrong\u003EDO NOT ENTER\u003C/strong\u003E and Stanley entered.\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-07-22T08:51:05Z","Content":"\n\u003Cp\u003EStanley turned around and left. Stanley did not pick up the nuclear detonation key. Stanley.. Stanley. why must you do this Stanley?\u003C/p\u003E\n"},{"CreatedByName":"UnionPacific1983WP","CreatedById":140982,"CreatedDateTime":"2015-07-22T16:40:07Z","Content":"\n\u003Cp\u003EStanley did not pick up the nuclear detonation key.\u003C/p\u003E\u003Cp\u003EStanley played KSP for the first time in two months.\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-03T08:45:58Z","Content":"\n\u003Cp\u003EStanley did not realise that by plugging in the nuclear detonation key, he had converted KSP to control the nuke. Stanley realised just in time, so before he crashed it into an orphanage, he... why, Stanley? why do you never listen to m?\u003C/p\u003E\n"},{"CreatedByName":"ComradeWolfe","CreatedById":142254,"CreatedDateTime":"2015-08-05T17:16:10Z","Content":"\n\u003Cp\u003EPuppies? Orphanages? Nuclear keys? Perhaps Stanley was losing his mind... Yes, that\u0027s it. The disjointed, inconsistent narrator which guided him through this journey was merely a figment of his imagination!\u003C/p\u003E\u003Cp\u003EStanley walked past the orphans, out on to the street, and towards his his office -- intent on returning to his job at pushing buttons.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EWait, that\u0027s not right. Why was Stanley in an orphanage? Had he chased the nukes? Obviously, these delusions were more pronounced than he had thought. \u0022This is too much\u0022 thought Stanley; \u0022I\u0027m going mad.\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-05T17:18:29Z\u0022 title=\u002208/05/2015 05:18  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 5, 2015\u003C/time\u003E by ComradeWolfe\u003C/strong\u003E\n\u003Cbr\u003EMisread post above, edited for plot consistancy.\n\u003C/span\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-06T08:03:57Z","Content":"\n\u003Cp\u003EStanley saw the sun. only then he realised that he had really nuked the orphanage. Stanley then decided to punish himself for kill said orphans.\u003C/p\u003E\n"},{"CreatedByName":"cziken20","CreatedById":95907,"CreatedDateTime":"2015-08-07T15:19:26Z","Content":"\n\u003Cp\u003E\u003Cem\u003EI feel oddly happy about killing all the orphans. Theres jsut something so appealing in killing so many inncoent lives.\u003C/em\u003E - said Stanley, as he then quickly proceeded to find some sausage to satisfy his hunger.\u003C/p\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2015-08-09T21:05:00Z","Content":"\n\u003Cp\u003EStanley finds a sausage, but forgets to chew and starts suffocating in it.\u003C/p\u003E\n"},{"CreatedByName":"ComradeWolfe","CreatedById":142254,"CreatedDateTime":"2015-08-10T13:04:30Z","Content":"\n\u003Cp\u003EHis life vanishing before his eyes, Stanley thought long and hard about the significance of it all. The meaning of life, and how he had come to share the same inevitable fate as the orphans, for whom he had accelerated the end\u0027s arrival. Would they be there when the last of his oxygen was depleted -- would they \u003Cem\u003Ejudge\u003C/em\u003E him for killing them all so carelessly?\u003C/p\u003E\u003Cp\u003EStanley\u0027s vision began to fade at the edges and his legs began to buckle... As luck would have it, the impact of falling limply to the ground dislodged the sausage. It was then that his vision returned and he noticed that he had fallen on a trap door.\u003C/p\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2015-08-10T14:33:28Z","Content":"\n\u003Cp\u003E\u0022But there must be a second trapdoor!\u0022, Stanley thought, \u0022In the very beginning there were two, so I could have a choice. The narrator MUST have given me a choice here too! I MUST find the other trapdoor, and then follow the narrators directions.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Noname117","CreatedById":53624,"CreatedDateTime":"2015-08-16T22:15:27Z","Content":"\n\u003Cp\u003EStanley found the trapdoor, but decided to go through the one he landed on. Go on now Stanley, there aren\u0027t any surprises waiting in there.\u003C/p\u003E\n"}]}