{"TopicId":97934,"ForumId":55,"TopicTitle":"Air Flow display for air-breathing engines","CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-01-27T00:17:15Z","PageNum":1,"Articles":[{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-01-27T00:17:15Z","Content":"\n\u003Cp\u003EWhen you view the expanded info panel for any air-breathing engine in the VAB or SPH it shows a flameout %. Once you are in flight though, there is no way to see exactly how much air flow an engine is getting. You can right click on any intakes that you have and see their numbers, but if you right click on a jet engine it does not show anything pertaining to air flow at all. It does show fuel flow, but not air flow. The interactions between multiple air intakes and any given engine can be complex, so it would be nice to see this info when right clicking on a specific air-breathing engine.\u003C/p\u003E\u003Cp\u003EI suggest you add a simple line on the right click engine tooltip display right above or below the \u0022fuel flow\u0022 line that shows \u0022air flow\u0022 and the numeric amount that is currently being received by the engine.\u003C/p\u003E\u003Cp\u003EIt would also be good to show that value as a percent too, so that we would be able to see at a glance how close that engine is to having a flameout. Something like this: \u0022\u003Cstrong\u003EAir Flow = 0.012U (25%)\u003C/strong\u003E\u0022. (I made up those numbers as an example, and I don\u0027t know if the unit of measurement is the same).\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-01-27T01:24:41Z","Content":"\n\u003Cp\u003EBoth KER and MJ have that information, although MJ doesn\u0027t display it by default - you need to customize a menu.\u003C/p\u003E\u003Cp\u003EI guess you mean to add it in stock. Considering that we don\u0027t even have delta-v readouts while in flight, I don\u0027t think Squad will do it.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-01-27T01:43:26Z","Content":"\n\u003Cp\u003EThey already have fuel flow showing in stock. And you can see numbers when you click on air intakes. This doesn\u0027t seem far fetched to me based on what is already in place.\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2015-01-27T01:45:08Z","Content":"\n\u003Cp\u003ESTOCK SOLUTION:\u003C/p\u003E\u003Cp\u003EFor a few versions, jets have autothrottled down when they get starved for air. That flameout is (i think) 10% (of max, or current max thrust?) for a turbojet? I right-click on my engines, and watch to see when the thrust gets close to 22.5kN. I start manually throttling down at that point.\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-01-29T03:37:06Z","Content":"\n\u003Cp\u003EAuto throttle would need a means to turn it off. And be off by default. I combine engine types and depend on manually changing stuff to leave orbit. That could be a nightmare.\u003C/p\u003E\n"}]}