{"TopicId":98115,"ForumId":55,"TopicTitle":"Kerbals should get paid","CreatedByName":"Baenki","CreatedById":67219,"CreatedDateTime":"2015-01-29T00:14:22Z","PageNum":1,"Articles":[{"CreatedByName":"Baenki","CreatedById":67219,"CreatedDateTime":"2015-01-29T00:14:22Z","Content":"\n\u003Cp\u003E???As I understand it we get paying space tourists in 1.0.???\u003C/p\u003E\u003Cp\u003EI actually can not find the source anymore. Maybe it was wishful thinking.\u003C/p\u003E\u003Cp\u003ESo it may be time to also give payment to the Kerbonauts to add to the money management in career.\u003C/p\u003E\u003Cp\u003EMy idea is to give them wages depending on their experience/skill level.\u003C/p\u003E\u003Cp\u003EMaybe an option of promoting Kerbals if they collected enough XP. Wages will rise.\u003C/p\u003E\u003Cp\u003EA lvl 3 Pilot should earn more than a lvl 1 pilot.\u003C/p\u003E\u003Cp\u003EMaybe add the option of hiring higher level Crew, with a higher initial pay than Kerbals you trained yourself, from the astronaut complex if the player passes a certain reputation threshold.\u003C/p\u003E\u003Cp\u003EAdditional suggestion: Bonus for the Kerbal if signing an employment contract (sth. like an entry purchase)\u003C/p\u003E\u003Cp\u003E(Wages/month, week or other time unit \u002B bonus for time on missions.\u003C/p\u003E\u003Cp\u003EA regular wage makes sense because your crew that doesn\u0027t fly at the moment is still employed and \u0022training\u0022.)\u003C/p\u003E\u003Cp\u003EEdit: Maybe a per mission approach is better because of time warp.\u003C/p\u003E\u003Cp\u003EI think something like this should be in a Tycoon-ish career game.\u003C/p\u003E\u003Cp\u003EAlso: I checked the what not to suggest/ already suggested lists and searched the forums dor similiar suggestions (I\u0027m not very good at that).\u003C/p\u003E\u003Cp\u003EIf this was discussed before, feel free to close or remove this thread.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-29T01:37:48Z\u0022 title=\u002201/29/2015 01:37  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 29, 2015\u003C/time\u003E by Baenki\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-01-29T00:18:18Z","Content":"\n\u003Cp\u003EMay cause problems when heavy timewarp is used... But that can be solved if there\u0027s an annual budget a la NASA.\u003C/p\u003E\u003Cp\u003EAlso, I think we should choose where to put the VAB and the other buildings like in a Tycoon game.\u003C/p\u003E\n"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2015-01-29T00:55:23Z","Content":"\n\u003Cp\u003EThey got payed once when being hired, that will works.\u003C/p\u003E\u003Cp\u003EHowever these changes need Squad reconsidering whether ksp is a fligh simulator or a program manager simulator.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2015-01-29T00:57:43Z","Content":"\n\u003Cp\u003ESpace tourism? I missed that, where did you read it?\u003C/p\u003E\u003Cp\u003EThe problem with this suggestion is the same problem with all time baised drain things. Parts of the game involve timewarping for big stretches of time. Like if you want to play with your Duna lander NOW.\u003C/p\u003E\u003Cp\u003EWhile there are people who don\u0027t like to timewarp for longer than a few weeks at a time, there are also people that do. A time based drain on any recourse would limit the way you can play this game, forcing you to interupt timewarp every month or so to do grind contracts that achieve nothing\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2015-01-29T01:11:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003ESpace tourism? I missed that, where did you read it?\u003Cp\u003EThe problem with this suggestion is the same problem with all time baised drain things. Parts of the game involve timewarping for big stretches of time. Like if you want to play with your Duna lander NOW.\u003C/p\u003E\u003Cp\u003EWhile there are people who don\u0027t like to timewarp for longer than a few weeks at a time, there are also people that do. A time based drain on any recourse would limit the way you can play this game, forcing you to interupt timewarp every month or so to do grind contracts that achieve nothing\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe make it so Kerbals are paid per mission, instead of it being time-based? The fee could increase depending on what they actually do on the mission; for example, going to Duna and back would merit a higher commission than, say, orbiting Kerbin for a few days. You could have their salary increase the longer they\u0027re on a mission, but put an upper limit on it, so even if you timewarp for a year you\u0027re not going to go bankrupt by accident. They get paid when they safely return to kerbin or when they die (in this case you could say that the money is going to their relatives, or something. It\u0027s just there to discourage killing off kerbals at the end of a mission).\u003C/p\u003E\u003Cp\u003EYou could even put it a new strategy that can reduce/remove kerbal wages at the cost of reputation.\u003C/p\u003E\n"},{"CreatedByName":"Baenki","CreatedById":67219,"CreatedDateTime":"2015-01-29T01:31:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003ESpace tourism? I missed that, where did you read it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI searched it again and didn\u0027t find it. I was actually sure I read it somewhere, but it seems it was wishful thinking... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E----------\u003C/p\u003E\u003Cp\u003EYes maybe a per mission payment \u002B entry payment \u002B fixed bonuses are better than a time based approach.\u003C/p\u003E\n"},{"CreatedByName":"Louella","CreatedById":89561,"CreatedDateTime":"2015-01-29T02:33:10Z","Content":"\n\u003Cp\u003Espace tourism was mentioned in the recent squadcast for stuff that should be coming in the next version, according to this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108305-Squadcast-Summary-%2824-01-2015%29-The-Valentina-Edition\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/108305-Squadcast-Summary-%2824-01-2015%29-The-Valentina-Edition\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wabbit","CreatedById":110502,"CreatedDateTime":"2015-01-29T03:23:20Z","Content":"\n\u003Cp\u003EAn interesting mechanic! I also think Jeb will be happy to have some money pushed his way from all these years of constant death.\u003C/p\u003E\n"},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2015-01-29T03:36:46Z","Content":"\n\u003Cp\u003ETo my knowledge, the cost of paying astronauts is trivial compared to the cost of launching rockets. It may have such a slight impact (if it\u0027s done realistically) that it just isn\u0027t worth implementing.\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-01-29T05:11:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vaporo\u0022 data-cite=\u0022Vaporo\u0022\u003E\u003Cdiv\u003ETo my knowledge, the cost of paying astronauts is trivial compared to the cost of launching rockets. It may have such a slight impact (if it\u0027s done realistically) that it just isn\u0027t worth implementing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERealistically, the costs would skyrocket the instant you break Kerbin\u0027s orbit. Fewer and fewer people would actually be willing to go into deep space with only sporadic contact with other people (aside from the crew mates, and I would imagine almost no one would want to take a journey alone).\u003C/p\u003E\u003Cp\u003EOf course, no one really wants to play \u0022Kerbal Probe Program\u0022 so ignoring the costs of sending a single kerbal, alone, to the edge of the universe is probably for the best. We don\u0027t want to question his mental state when... IF he comes back.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-01-29T06:01:59Z","Content":"\n\u003Cp\u003EI think it would be an good addition if the cost is low enough that interplanetary missions (even to Eeloo) aren\u0027t impractical.\u003C/p\u003E\u003Cp\u003EHaving a reason to use the faster methods of transfer sometimes would be good. (life support would work too.)\u003C/p\u003E\n"},{"CreatedByName":"Baenki","CreatedById":67219,"CreatedDateTime":"2015-01-29T12:48:56Z","Content":"\n\u003Cp\u003EI actually don\u0027t mean it that way that a single interplanetary flight would cost you half your budget.\u003C/p\u003E\u003Cp\u003EThe idea is to take money away in a way it\u0027s recognisable but not programme crippling. I just have the feeling that something is missing if you can have umlimited Kerbals employed without noticing it somehow.\u003C/p\u003E\u003Cp\u003EIf it would be combined with leveling the Kerbal yourself, if enough XP is reached instead of auto-leveling, it also could have an impact on your strategy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-29T12:54:50Z\u0022 title=\u002201/29/2015 12:54  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 29, 2015\u003C/time\u003E by Baenki\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-29T13:00:14Z","Content":"\n\u003Cp\u003EWithout something for Kerbals to spend their money on, what would be the point?\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2015-01-29T13:15:19Z","Content":"\n\u003Cp\u003Ethe Kerbals are clearly in need of some kind of economic stimulus. their entire planet is completely bare...\u003C/p\u003E\n"}]}