{"TopicId":98142,"ForumId":32,"TopicTitle":"Do ANY females/girl gamers play KSP?","CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2015-01-29T08:25:48Z","PageNum":7,"Articles":[{"CreatedByName":"RocketBlam","CreatedById":103420,"CreatedDateTime":"2015-01-30T22:18:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003ETopic of gender and gaming tends to send things into a downward spiral these days. I say we just step back and continue playing the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. I could not be more sick of these fake, manufactured controversies.\u003C/p\u003E\n"},{"CreatedByName":"moronwrocket","CreatedById":134908,"CreatedDateTime":"2015-01-30T22:44:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ENo, what I am saying is that the game should be appealing and \u003Cem\u003Einclusive\u003C/em\u003E to everyone who is predisposed to play it. Adding a flower garden or dinosaurs to KSP doesn\u0027t make it more appealing to anyone, it waters down the experience and tries to make it something it isn\u0027t. Adding female Kerbals is \u003Cem\u003Einclusive\u003C/em\u003E, paying homage to a history of women in science and spaceflight, while not watering down the experience. Some people are not scientifically inclined or interested in spaceflight and that\u0027s okay, they don\u0027t have to be nor does KSP have to appeal to them. This is what getting girls/women into STEM fields is about, removing traditional gender barriers and being inclusive, not making it \u0022cutesy\u0022 trying to appeal to people who wouldn\u0027t really be interested the field in the first place.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that the pool of players who would love to play KSP is larger than the pool who are predisposed to play it. I guess I am trying to go beyond inclusive to enticing, and you are against that. Fair enough. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Vlad\u0022 data-cite=\u0022Captain Vlad\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI gotta disagree with part of this point; If there were like, giant whales in Laythe\u0027s ocean you could follow around and study, or something in that vein, I don\u0027t see that as going against the whole \u0027spirit of discovery\u0027 thing KSP has as part of it\u0027s appeal. I do see what you mean, but I think there\u0027s often ways to fit such things into games that might seem at odds with the concept in such a way that it adds to the overall experience.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETHIS. Thanks for saying what I meant better than I could Captain Vlad.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WOODY01\u0022 data-cite=\u0022WOODY01\u0022\u003E\u003Cdiv\u003EIn the US women statistically earn less then men. I have no doubt that there are still times women do not get hired, promoted, or as large a raise because of their gender.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy wife and I are both computer engineers, no longer at the same company but we did start together. Years after we left, she was told by another woman engineer that the boss they had both worked for gave the women less raises than men \u0022Because they already had an earner in their family.\u0022 It\u0027s only now, after being in industry 18 years and working 5x as hard as me, that she\u0027s reached close to salary parity. She prefers playing Candy Crush Saga though to whatever my son and I are playing because she gets tired of our constant talking about it. Haven\u0027t been able to convince her that time playing KSP with us is family time yet. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-01-30T23:13:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketBlam\u0022 data-cite=\u0022RocketBlam\u0022\u003E\u003Cdiv\u003EThis. I could not be more sick of these fake, manufactured controversies.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is not a fake or manufactored. Ex: Gamersgate. A woman harassed by a gaming community because of her gender. \u003C/p\u003E\u003Cp\u003EJudging by some post this thread is not just about how many women play KSP for many people. But to why they may be reluctant to reveal themselves, reasons for the deviation, and equality in general. All relate to real issues that effect people in their day to day lives that exist.\u003C/p\u003E\u003Cp\u003EYour belief in that it is a manufactured issue leads me to believe one of two things:\u003C/p\u003E\u003Cp\u003E1. You do not judge people based on ... and it is hard for you imagine that others do.\u003C/p\u003E\u003Cp\u003E2. This is an non-issue to you because you do not care one way or the other and would rather just enjoy playing KSP.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LambertStrether","CreatedById":125256,"CreatedDateTime":"2015-01-30T23:58:38Z","Content":"\n\u003Cp\u003EIn the discussion on the 1.0 announcement I saw an educator with two daughters make a comment about how the lack of female kerbals turned his daughters and students away from the game. It makes a difference, and I think it\u0027s a great addition to the game, especially when you consider KSP\u0027s potential as an educational tool. It\u0027s also a step toward realism; since, you know, there are plenty of women who work for NASA.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-30T23:59:10Z\u0022 title=\u002201/30/2015 11:59  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 30, 2015\u003C/time\u003E by LambertStrether\u003C/strong\u003E\n\u003Cbr\u003EClarification\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2015-01-31T10:38:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WOODY01\u0022 data-cite=\u0022WOODY01\u0022\u003E\u003Cdiv\u003EIt is not a fake or manufactored. Ex: Gamersgate.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t think of anything more fake or manufactured than the media narrative surrounding #gamergate.\u003C/p\u003E\n"},{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-01-31T11:36:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceGremlin\u0022 data-cite=\u0022SpaceGremlin\u0022\u003E\u003Cdiv\u003EI can\u0027t think of anything more fake or manufactured than the media narrative surrounding #gamergate.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you are saying that there were not over a million tweets showing support and ones against ranging from just name calling to death threats? \u003C/p\u003E\u003Cp\u003EWebsite forums did not ban the topic and start closing threads?\u003C/p\u003E\u003Cp\u003EAnita Sakraseen did not recieve death and .... threats for her dicussing how woman or portrayed in video games or not included?\u003C/p\u003E\u003Cp\u003EZoe Quinn and Brianna Woo did not recieve similar threats?\u003C/p\u003E\u003Cp\u003EThese women did not have accounts hacked and personal information posted?\u003C/p\u003E\u003Cp\u003EThese things happened and they happened because some gamers thought a game got an higher review then it should because the creator slept with one reviewer. It escalated because a woman decided to make a video discussing women and gaming around the same time.\u003C/p\u003E\u003Cp\u003EI am not sure what of the above is fake or manufactored. You may have some inside information and know what really happened. According to Police agencies and the FBI the threats and other harassment happened.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2015-01-31T11:37:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceGremlin\u0022 data-cite=\u0022SpaceGremlin\u0022\u003E\u003Cdiv\u003EI can\u0027t think of anything more fake or manufactured than the media narrative surrounding #gamergate.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is still very much real for the people harrassed by it.\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2015-01-31T12:30:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EIt is still very much real for the people harrassed by it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo gamergate supporters who have never harassed anyone have to eat the blame for every troll on twitter? Yet when gamergate supporters are doxxed and harassed there is deafening silence from the games media? Why are only the harassers signal boosted at every turn by journalists rather than the people in gamergate who actually want to have a discussion about journalistic integrity?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-01-31T12:45:25Z","Content":"\n\u003Cp\u003EMuch as the discussion of ethics in gaming journalism is interesting, it\u0027s not one that\u0027s appropriate for the forum here. Please let the Gamergate topic drop.\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-01-31T14:51:42Z","Content":"\n\u003Cp\u003ENot going to talk about Gamergate. But to say that this \u0022controversy\u0022 over whether female kerbals are an important addition is manufactured is pretty insulting to those who sincerely believe that it is important. It\u0027s not some sort of put-on meant to satisfy some idea of political correctness. Is it so hard to try to imagine why others would have different values?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-31T14:58:03Z\u0022 title=\u002201/31/2015 02:58  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 31, 2015\u003C/time\u003E by GusTurbo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-01-31T14:57:30Z","Content":"\n\u003Cp\u003EMan I really hope there are 3 new female orange suits. Given how long its taken really getting parity there would be a huge boost for almost no extra work. Has there been any word on this or is it just Valentina at the moment?\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-01-31T15:33:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022 data-cite=\u0022Pthigrivi\u0022\u003E\u003Cdiv\u003EMan I really hope there are 3 new female orange suits. Given how long its taken really getting parity there would be a huge boost for almost no extra work. Has there been any word on this or is it just Valentina at the moment?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy guess is that they\u0027re adding female random kerbals with a female name-generator, and a Valentina character for KSC. I\u0027d love to see a second set of orange suits, but I\u0027m not holding my breath. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-01-31T15:37:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NecroBones\u0022 data-cite=\u0022NecroBones\u0022\u003E\u003Cdiv\u003EMy guess is that they\u0027re adding female random kerbals with a female name-generator, and a Valentina character for KSC. I\u0027d love to see a second set of orange suits, but I\u0027m not holding my breath. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy guess is that Valentina Kerman will be another starting kerbal, my guess is a Pilot.\u003C/p\u003E\u003Cp\u003EThere\u0027s no official SQUAD-made \u0022Gene Kerman\u0022 account, after all.\u003C/p\u003E\n"},{"CreatedByName":"Moonfrog","CreatedById":76295,"CreatedDateTime":"2015-01-31T15:37:48Z","Content":"\n\u003Cp\u003Esimple way to do this without really changing anything int he game. Just add a variety of skins u can add to your rockets etc, doesn\u0027t change functionality. Then u ccould have pink unicorn coloured ships and components, so when engines fire, they poop out rainbows for thrust.\u003C/p\u003E\u003Cp\u003EInstead of parachutes a bubble is blown around the ship to slowly let it descend to the ground. Why don\u0027t we also add Santas reindeer as a propoulsion systme as a christmas special with a sleigh.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-01-31T15:46:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norpo\u0022 data-cite=\u0022Norpo\u0022\u003E\u003Cdiv\u003EMy guess is that Valentina Kerman will be another starting kerbal, my guess is a Pilot.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually that\u0027s a good point. Valentina could be the new \u0022orange suit\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-01-31T16:55:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moonfrog\u0022 data-cite=\u0022Moonfrog\u0022\u003E\u003Cdiv\u003Esimple way to do this without really changing anything int he game. Just add a variety of skins u can add to your rockets etc, doesn\u0027t change functionality. Then u ccould have pink unicorn coloured ships and components, so when engines fire, they poop out rainbows for thrust.\u003Cp\u003E Instead of parachutes a bubble is blown around the ship to slowly let it descend to the ground. Why don\u0027t we also add Santas reindeer as a propoulsion systme as a christmas special with a sleigh.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t even have the words...\u003C/p\u003E\u003Cp\u003EThings don\u0027t have to be pink and covered in rainbows / unicorns to appeal to girls.\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-01-31T17:04:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003EI don\u0027t even have the words...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think he/she was being sarcastic.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EI hope.\u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-31T17:09:44Z\u0022 title=\u002201/31/2015 05:09  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 31, 2015\u003C/time\u003E by Norpo\u003C/strong\u003E\n\u003Cbr\u003Echanged quote to have less chance of me being perceived as an @$$@*^\u0026amp;$ accidentally\n\u003C/span\u003E\n"},{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-01-31T21:36:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moonfrog\u0022 data-cite=\u0022Moonfrog\u0022\u003E\u003Cdiv\u003Esimple way to do this without really changing anything int he game. Just add a variety of skins u can add to your rockets etc, doesn\u0027t change functionality. Then u ccould have pink unicorn coloured ships and components, so when engines fire, they poop out rainbows for thrust.\u003Cp\u003EInstead of parachutes a bubble is blown around the ship to slowly let it descend to the ground. Why don\u0027t we also add Santas reindeer as a propoulsion systme as a christmas special with a sleigh.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am assuming this is satire. If not, I am curious what upsets you about the inclusion of female Kerbils.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-02-01T02:17:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI don\u0027t get why this is even a question as it really doesn\u0027t matter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt only matters in a discussion about demographic targeting of games, but then the question occurs, why don\u0027t women enjoy this kind of stuff more. I\u0027ll never understand, probably because the answers are not forthcoming from anywhere.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2015-02-01T03:36:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EIt only matters in a discussion about demographic targeting of games, but then the question occurs, why don\u0027t women enjoy this kind of stuff more. I\u0027ll never understand, probably because the answers are not forthcoming from anywhere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would however assume it\u0027s not because of the (current) lack of female character models, I don\u0027t believe that type of thing does make a huge difference for this type of game.\u003C/p\u003E\u003Cp\u003EThere are genuine physiological differences between \u0022male\u0022 and \u0022female\u0022 in our species, I think the assumption that each gender should represent \u002250%\u0022 of any activity or game, or class, or whatever is, perhaps well intentioned, but likely not a realistic assumption.\u003C/p\u003E\u003Cp\u003EEquality is about choices, not being shoehorned in to any specific roles, so the assumption I have previously presented is actually stifling anyhow because it is simply yet another attempt to push people in to certain \u0022roles\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Lhathron the Elf","CreatedById":118706,"CreatedDateTime":"2015-02-01T03:40:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EIt only matters in a discussion about demographic targeting of games, but then the question occurs, why don\u0027t women enjoy this kind of stuff more. I\u0027ll never understand, probably because the answers are not forthcoming from anywhere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo respond to this, a post I made earlier:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lhathron the Elf\u0022 data-cite=\u0022Lhathron the Elf\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIt\u0027s offensive to assume there are no women playing KSP because of some irrational belief that they are just \u0022not into science\u0022 or something like that. Of course there are women who play, maybe they just don\u0027t show up often or have better things to do. \u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAlthough another certainly possible but \u003C/span\u003E\u003Cem\u003Ehorrible \u003C/em\u003E\u003Cem\u003Ereason that there are few women on here is the simple fact that there are people in today\u0027s society trying to suppress women from doing things like being engineers and scientists and pilots (no pun intended), and try to drive them towards more \u0022womanly\u0022 things, or rather, those things that society deems more suitable for women. Even when they are children, they may be expected to do things like that. For example, rather than working on some carpentry project, they might be encouraged to help out with cooking or cleaning. It\u0027s terrible, but it\u0027s sadly true.\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2015-02-01T03:44:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lhathron the Elf\u0022 data-cite=\u0022Lhathron the Elf\u0022\u003E\u003Cdiv\u003EAlthough another certainly possible but horrible reason that there are few women on here is the simple fact that there are people in today\u0027s society trying to suppress women from doing things like being engineers and scientists and pilots (no pun intended), and try to drive them towards more \u0022womanly\u0022 things, or rather, those things that society deems more suitable for women. Even when they are children, they may be expected to do things like that. For example, rather than working on some carpentry project, they might be encouraged to help out with cooking or cleaning. It\u0027s terrible, but it\u0027s sadly true.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do not actually believe this is true, there are a minority of people trying to do such things, but this whole \u0022patriarchy\u0022 idea needs to die, it distracts from the real problems.\u003C/p\u003E\u003Cp\u003EThere is no real, large scale conspiracy to suppress women.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-02-01T04:19:23Z","Content":"\n\u003Cp\u003ELet\u0027s not get into real world gender politics, please. That subject is far too big for our game forum, and is one of the things which seems to invariably result in rage posts, infractions, and threads getting locked. \u003C/p\u003E\u003Cp\u003EOn-topic: so far, 20% of poll respondents have identified themselves as female.\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2015-02-01T04:20:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vanamonde\u0022 data-cite=\u0022vanamonde\u0022\u003E\u003Cdiv\u003Eon-topic: So far, 20% of poll respondents have identified themselves as female.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E20/265 = 7.55% \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-02-01T05:18:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EI do not actually believe this is true, there are a minority of people trying to do such things, but this whole \u0022patriarchy\u0022 idea needs to die, it distracts from the real problems.\u003Cp\u003EThere is no real, large scale conspiracy to suppress women.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESexism doesn\u0027t require an overt conspiracy to suppress women, only that peoples\u0027 choices, made consciously or unconsciously, in aggregate lead to women being disadvantaged. \u003C/p\u003E\u003Cp\u003EAnyway, I don\u0027t think adding female Kerbals will suddenly bring masses of girls to the game. But if just one young girl takes up the game, sees that spaceflight isn\u0027t just a boys\u0027 club, and gets into science as a result, I think it would be worth it. I think this game has great potential to show kids, boys and girls, how cool science can be.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-01T05:21:10Z\u0022 title=\u002202/01/2015 05:21  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 1, 2015\u003C/time\u003E by GusTurbo\u003C/strong\u003E\n\u003C/span\u003E\n"}]}