{"TopicId":98405,"ForumId":18,"TopicTitle":"\u0026quot;Frau im Mond\u0026quot; (\u0026quot;Woman in the Moon\u0026quot;), a 1929 German sci-fi movie by Fritz Lang and Hermann Oberth.","CreatedByName":"Kerbas_ad_astra","CreatedById":126593,"CreatedDateTime":"2015-01-31T21:48:16Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbas_ad_astra","CreatedById":126593,"CreatedDateTime":"2015-01-31T21:48:16Z","Content":"\n\u003Cp\u003EI first saw a snippet of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Woman_in_the_Moon\u0022 rel=\u0022external nofollow\u0022\u003EFrau im Mond\u003C/a\u003E in the Seattle Museum of Flight, in a brief exhibit talking about early visions of what space travel was like. The score got stuck in my head, so I sought out more of it.\u003C/p\u003E\u003Cp\u003EThe story goes that Wolf Helius is trying to get people to the Moon. After an early unmanned test flight reveals the presence of gold on the Moon, a bunch of businessmen who control the gold market approach him. They\u0027ll finance his mission, but only if one of their agents rides along -- otherwise, they\u0027ll put a stop to it for good. Helius reluctantly agrees.\u003C/p\u003E\u003Cp\u003EThis is where Hermann Oberth\u0027s involvement as technical advisor shows itself. If Metropolis (also by Fritz Lang) was one of the first serious sci-fi movies to have a robot, Frau im Mond is the same way with space travel (no cannons or moon-men to be found here). The rocket, \u003Cem\u003EFriede\u003C/em\u003E (\u0022Peace\u0022), has two stages powered by liquid hydrogen and oxygen, and reference is made to the Earth escape velocity of 11.2 km/sec. It is built in a vehicle assembly building and rolled out to a launchpad (on rails and lowered into water), and when the time to launch approaches, we witness the first-ever recorded countdown. Fritz Lang invented the countdown to increase the tension prior to launch (compare to the \u0022count-up\u0022 to 40 in From the Earth to the Moon) -- check out his own words on the matter here: \u003Ca href=\u0022http://www.spektrum.de/quiz/was-verdankt-die-raumfahrt-dem-stummfilm-die-frau-im-mond-1929-von-fritz-lang/636420\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.spektrum.de/quiz/was-verdankt-die-raumfahrt-dem-stummfilm-die-frau-im-mond-1929-von-fritz-lang/636420\u003C/a\u003E. Translated to English, he\u0027s saying \u0022If I count one, two, three, four, ten, fifty, a hundred, the public won\u0027t know when the rocket gets going. But, if I count backwards: [...] three, two, one, ZERO! -- then they\u0027ll understand.\u0022\u003C/p\u003E\u003Cp\u003EDuring the flight itself, Lang shows what life in microgravity may be like, with the difficulty of moving and of pouring liquids (see the \u0022Landing\u0022 segment).\u003C/p\u003E\u003Cp\u003ETo give you an idea of how visionary this film was, the German government confiscated every copy and prop they could get their hands on during WWII because of its similarity to their V-2 program (headed by Wernher von Braun, Oberth\u0027s student).\u003C/p\u003E\u003Cp\u003EThere\u0027s some more action and romance, but who cares about that? We wanna see the rocket! Fortunately, \u0022Manferot\u0022 on YouTube has most of the parts featuring the rocket (the most important parts, of course) on his channel. The score is a modern addition (from some modern remastering/release), but I still think it\u0027s really cool:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/x5iqJUrgwbM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/-EXFQg0SqQU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/cJvkUHgIjs0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThe actual takeoff happens in here the \u0022Launch\u0022 video, at 3:16: \u003Ca href=\u0022https://youtu.be/I8gu1p939a4?t=3m16s\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/I8gu1p939a4?t=3m16s\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/I8gu1p939a4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/nkiRCNMq_Es?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EFor the other videos (I\u0027ve omitted two, since a post can only have five videos in it), check out \u003Ca href=\u0022https://www.youtube.com/user/manferot/search?query=woman\u002Bmoon\u0022 rel=\u0022external nofollow\u0022\u003EManferot\u0027s channel\u003C/a\u003E. (Look for \u0022The Rocket\u0022 and \u0022Stowaway\u0022.)\u003C/p\u003E\u003Cp\u003EWhat do you all think?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-31T22:24:22Z\u0022 title=\u002201/31/2015 10:24  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 31, 2015\u003C/time\u003E by Kerbas_ad_astra\u003C/strong\u003E\n\u003Cbr\u003EHelius isn\u0026#039;t a professor. Oops!\n\u003C/span\u003E\n"},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-02-01T05:02:53Z","Content":"\n\u003Cp\u003EI watched this a while ago. Certainly an interesting film. It reminded me a bit of \u003Cem\u003EThe Twilight Zone\u003C/em\u003E, (I shan\u0027t give away the ending, but those who have seen it may see what I mean).\u003C/p\u003E\u003Cp\u003EAnd I thought that Mannfeldt (or some other scientist) had concluded the presence of the gold rather a bit earlier, to be laughed at by other astronomers. Some years later Helius was convinced to pursue launching a ship there.\u003C/p\u003E\u003Cp\u003EI also liked some of the special effects, though some of them (even considering the date of production) looked a tad silly. Mannfeldt also had what looked like a textured relief globe of the Moon.\u003C/p\u003E\n"},{"CreatedByName":"Kerbas_ad_astra","CreatedById":126593,"CreatedDateTime":"2015-02-02T18:32:26Z","Content":"\n\u003Cp\u003EYou\u0027re right about Manfeldt (1 \u0022n\u0022), but I don\u0027t think the gold was Helius\u0027s motivation -- he seemed more interested in figuring out how to get there and the exploration itself (and possibly to vindicate the professor -- the other astronomers were total jerks to him, though saying things like \u0022laughter is the first response of fools with calcified brains\u0022 probably didn\u0027t win him any friends). Helius also was not the first to attempt to reach the moon, since we see a memorial to other would-be spacefarers, but I guess it\u0027s never said why they tried.\u003C/p\u003E\u003Cp\u003ERelated to your comment on the ending, I guess I should mention (to everyone else -- you obviously know this already) that there was one major concession to reality: the far side of the moon is depicted as having an atmosphere (and more). I don\u0027t think too many people seriously suspected this to be the case by the time of the movie\u0027s production (though nobody really knew for sure, and some serious astronomers really did think that it might be so), but silent films depend heavily on the actors\u0027 body and facial language (there are several parts where quite a bit of conversation is happening, but only sparsely populated by text cards -- we\u0027re meant to fill in the rest from the action and music ourselves), so spacesuits are only briefly depicted before they turn out to be unnecessary.\u003C/p\u003E\u003Cp\u003EI get where your comparison to the Twilight Zone comes from, but in retrospect, I think the movie is also very much like some Kerbal Space Program experiences we\u0027ve all had.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EThe data made it back to Earth, and Helius left the note asking for a rescue.\u003C/p\u003E\u003C/blockquote\u003E\n"}]}