{"TopicId":98479,"ForumId":20,"TopicTitle":"Novaskilso\u0026#039;s Planets!","CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2015-02-01T18:36:48Z","PageNum":1,"Articles":[{"CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2015-02-01T18:36:48Z","Content":"\n\u003Cp\u003EDoes anyone remember way back when Novaskilso was still with SQUAD, and he was discussing adding some new planets to the game?\u003C/p\u003E\u003Cp\u003EWell, i\u0027d like to Request that those planets be made.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHADREA: \u003C/strong\u003E(just a made up name from me, as i don\u0027t think the planet was ever given a name) It is a blue, ringed gas giant that is 9000 kilometers in diameter, and orbits kerbol a little farther away than jool.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEeloo:\u003C/strong\u003E Planned to orbit the new planet, NovaSilisko has stated that there will be geysers on it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDaphy:\u003C/strong\u003E A very small asteroid covered in \u0022Fluff\u0022. It may or may not be in the rings themselves.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPotatus:\u003C/strong\u003E Another small moon. It will have a high inclination relative to GP2. NovaSilisko has claimed that it will rotate extremely fast, stretching it into an oblate spheroid.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFonso:\u003C/strong\u003E Will be about 300KM across, and will be the second moon to hold an atmosphere, which will be two atmospheres dense. The extremely mountainous surface will have peaks that stretch into the vacuum.\u003C/p\u003E\u003Cp\u003EIf somebody could make this, that would be awesome!\u003C/p\u003E\n"},{"CreatedByName":"Candlelight","CreatedById":203979,"CreatedDateTime":"2015-02-01T21:24:58Z","Content":"\n\u003Cp\u003EWell, this could be made into planets with Kopernicus.If you would like me to do that for you.\u003C/p\u003E\u003Cp\u003EBut what i need from you is to send me the color map, bump map and normal map of Daphy, Potatus, Fonso and Hadrea(it\u0027s a gas giant, so only send me her color map).\u003C/p\u003E\n"}]}