{"TopicId":98495,"ForumId":44,"TopicTitle":"With is better Diesel vs Gasoline?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-02-01T21:21:50Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-02-01T21:21:50Z","Content":"\n\u003Cp\u003EI do not mean not about cost but effective.\u003C/p\u003E\u003Cp\u003EI have to write a paper on the economics of information, I write an economic analysis of selected industry in my country (Poland), I chose the road transport industries, as in the past, I went to post-secondary study of transport and forwarding profile. The purpose of this course is to use the skills acquired in the Library Science, it is the search and acquisition of data in business.\u003C/p\u003E\u003Cp\u003EThe professor says that after completing the library science does not have to work in the library, you can be broker information and work as an analyst or even in the intelligence agencies:-)\u003C/p\u003E\u003Cp\u003EMy professor told us to imagine situation that some filthy rich guy come to us with back full of Euros, USD or GBP, and want to start business in our country, for example transport company, bank, coffe chain, fitness salon (we was forbidden to chose of book stories industry due our Library Science expertise with would be to easy and spoil the fun :-) ) \u003C/p\u003E\u003Cp\u003EI intentionally thinking about starting rocket producing business, but it would to silly in Poland ;-) \u003C/p\u003E\u003Cp\u003ETIR trucks, known in America as a 18-wheeler, I was always interested me, almost as much as the big planes;-)\u003C/p\u003E\u003Cp\u003EThe data that I found shows that Poland has the cheapest petrol in the EU, it costs 1.23 Euro per liter, but in Luxembourg is the cheapest diesel, also 1.23 euros per liter, but there is a petrol costs 1.34 euros per liter .\u003C/p\u003E\u003Cp\u003EAn additional problem is the data, those to whom I got are from 2011, I would like to find something with a 2013 or 2014 but I can not:-(\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-01T21:42:40Z","Content":"\n\u003Cp\u003EDepends on the job being done...\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-02-01T21:48:12Z","Content":"\n\u003Cp\u003EWell i dont know about the whole economics of it. But there are some very strong reasons why diesel is the main fuel for transporting goods across countries.\u003C/p\u003E\u003Cp\u003EFirst of all, diesel engines are a bit more efficient than gasoline engines. (Higher compression) Diesel has more energy per gallon than gasoline. Also at least from my experience in the US, since you can get x gasoline from a barrel of crude and y diesel, might as well use both of them in applications rather than wasting 1. \u003C/p\u003E\u003Cp\u003EOn other notes however.\u003C/p\u003E\u003Cp\u003EDiesel engines are often much higher torque, and lower rpm than gasoline engines of equal power. Lower rpm means less wear and tear in the engine, and transmission. \u003C/p\u003E\u003Cp\u003EAlso diesel engines do not require a spark, and all the equipment required for 1 in a gasoline engine. If you lose the alternator in your diesel truck, the batteries can probably keep the fuel pump running long enough to make it to a repair stop. Gasoline cars that lose the alternator will drain the batteries at a significantly higher rate.\u003C/p\u003E\u003Cp\u003ELots of deep water fishing boats (and many container ships, tankers and all) rely on diesel engines partially for this reason. I know that my dads boat, even after having a complete electrical failure, were able to trawl the 40mi back to shore since the engines are gravity fed with fuel, and will just keep running. Kinda sucked not having lights, but it was manageable. Gas boat, wed have had to call in the coast guard.\u003C/p\u003E\u003Cp\u003EAlso in extremely high power applications, there are even more efficient diesel engines out there, called opposed piston, engines.\u003C/p\u003E\u003Cp\u003EAs far as i know, they are only built extremely large, i think fairbanks morse is 1 of the manufactures. dont remember how efficient they had gotten them. I think some regular diesel engines out there are pushing into the 40-50% thermal efficiency range nowadays. And several groups are planning on making a truck sized version of an opposed piston design, which may push the efficiency up into the 60% range. J think some of the big engines for ships are even into the upper 60s (and when you are talking a 50khp engine, every .1% counts)\u003C/p\u003E\u003Cp\u003EAlthough dont take this all at face value. My numbers may be off a bit, and i am on my phone and cant really look them up super well.\u003C/p\u003E\u003Cp\u003EWhen i get on later perhaps i could link you some articles supporting my statements.\u003C/p\u003E\n"},{"CreatedByName":"Raven.","CreatedById":99340,"CreatedDateTime":"2015-02-01T22:02:15Z","Content":"\n\u003Cp\u003EDepends on what you\u0027re doing. A truck with a gasoline engine, such as the Toyota Tundra that I drive every day, will have better acceleration and speed when the truck is at what\u0027s called the \u0022curb weight,\u0022 meaning there is no payload and no tow. Also, a gasoline pickup will perform better, at least to my knowledge, in off road conditions. Also, gas here in Arkansas is $1.79/gallon while diesel is still around three bucks a gallon.\u003C/p\u003E\u003Cp\u003EHowever, the efficiency of my gasoline Tundra will decrease exponentially with more weight that I load. What this means is that my truck will perform very poorly with heavy payloads or tows, and gas mileage will be even poorer. For one, my truck is not meant to tow. If I want to tow more than 5,000 lbs, then what I need to do is to go get a diesel truck (I prefer Ford, like an F-250 or F-350 for this), of which has greater torque at the crank shaft and will hold its efficiency and gas mileage at higher payloads/tows. This is the reason why American freight runs on diesel, and not gasoline or any other fuel for that matter.\u003C/p\u003E\n"},{"CreatedByName":"orcman","CreatedById":70442,"CreatedDateTime":"2015-02-02T01:37:12Z","Content":"\n\u003Cp\u003EIt really depends on whether you need torque (pulling power) or acceleration : \u003Ca href=\u0022http://www.dummies.com/how-to/content/the-pros-and-cons-of-diesel-engines.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.dummies.com/how-to/content/the-pros-and-cons-of-diesel-engines.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eas for prices, a 10 sec google search gave: \u003Ca href=\u0022http://www.fuel-prices-europe.info/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.fuel-prices-europe.info/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E2 mins more search gave: \u003Ca href=\u0022http://autotraveler.ru/en/spravka/old/fuel-price-in-europe-12_2-2014.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://autotraveler.ru/en/spravka/old/fuel-price-in-europe-12_2-2014.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAside: not being nasty but has anyone else thought that they should teach efficient googling skills in schools?\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-02-02T02:25:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022orcman\u0022 data-cite=\u0022orcman\u0022\u003E\u003Cdiv\u003EIt really depends on whether you need torque (pulling power) or acceleration : \u003Ca href=\u0022http://www.dummies.com/how-to/content/the-pros-and-cons-of-diesel-engines.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.dummies.com/how-to/content/the-pros-and-cons-of-diesel-engines.html\u003C/a\u003E\u003Cp\u003Eas for prices, a 10 sec google search gave: \u003Ca href=\u0022http://www.fuel-prices-europe.info/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.fuel-prices-europe.info/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E2 mins more search gave: \u003Ca href=\u0022http://autotraveler.ru/en/spravka/old/fuel-price-in-europe-12_2-2014.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://autotraveler.ru/en/spravka/old/fuel-price-in-europe-12_2-2014.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAside: not being nasty but has anyone else thought that they should teach efficient googling skills in schools?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo not really. I usually rather enjoy telling people stuff. Take pride in it rather. But hey everyones got smartphones now, so everytime someone asks me something, maybe i should just tell them to google it.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-02-02T08:41:44Z","Content":"\n\u003Cp\u003EIt also depends on where you\u0027re doing the job. In Europe, at least 50% of cars are diesel powered because the taxes are typically much lower. In some countries, it goes up to 70%. If you are buying a family car or anything bigger than a Renault Clio, you\u0027ll have trouble finding one with a petrol engine (except in sports cars and some niches of the market). \u003C/p\u003E\u003Cp\u003EThis doesn\u0027t mean they are sluggish. Because they are so widespread, there has been a lot more R\u0026amp;D done on diesel engines in Europe than in petrol engines. Modern diesel engines are nifty, and the torque translates directly into acceleration. The torque also allows manufacturers to fit smaller engines.\u003C/p\u003E\u003Cp\u003EMy last car was a Renault Megane Estate, with a puny 80hp dCI engine. It sounds underpowered, and indeed an 80hp petrol engine would be, but with a modern diesel it had rather impressive performance for its size and consumption. It did less than 5l/100km on average, which is really good.\u003C/p\u003E\u003Cp\u003EDiesel fuel is now getting much closer to the price of petrol, but you still get better mileage out of it.\u003C/p\u003E\u003Cp\u003EBut at this stage, electric vehicles are starting to look better. They have better acceleration than any internal combustion engine and are starting to be perfectly adequate for the daily commute. I have several coworkers who use them on a daily basis and they\u0027re really happy with them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-02T08:47:49Z\u0022 title=\u002202/02/2015 08:47  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 2, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zuqq","CreatedById":133985,"CreatedDateTime":"2015-02-02T13:56:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E-snippity-\u003Cp\u003EBut at this stage, electric vehicles are starting to look better. They have better acceleration than any internal combustion engine and are starting to be perfectly adequate for the daily commute. I have several coworkers who use them on a daily basis and they\u0027re really happy with them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll have to agree that electric is becoming a powerful contender but a small nitpick: they don\u0027t accelerate faster - they just have near instant torque curves. This can translate to faster acceleration but not independently. \u003C/p\u003E\u003Cp\u003EI personally think that a diesel generator powering an electric engine is the way to go. Similar to the McLaren P1. The diesel generator powers up when the elecric batteries need a top up, or when the extra power is required. Its fairly expensive to do now but with some research and optimization I think it\u0027s the way to go. But thats a bit off of the OPs question. If its just between diesel and gas, for transport, I would say there has to be a reason the majority use diesel.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-02-02T13:59:58Z","Content":"\n\u003Cp\u003EThe Otto Cycle, which petrol engines run off, is in theory a more efficient cycle, because the combustion occurs at a constant volume.\u003C/p\u003E\u003Cp\u003EThe Diesel cycle is less efficient because the combusion occurs at constant pressure.\u003C/p\u003E\u003Cp\u003EIn practice, spark ignition engines running on the Otto cycle cannot compress the fuel-air mixture very much, because as you compress something, you heat it up, and eventually, it will ignite. If this happens too early, ignition will happen early, before the piston is in the right place. You get what is called \u0022knocking\u0022, and this is really bad for both your engine life and efficiency. Diesel engines get around this by only injecting the fuel when it is needed (but this takes time).\u003C/p\u003E\u003Cp\u003ESo essentially, petrol engines have a high theoretical efficiency, but they can\u0027t get very close to this in practice. Diesel engines have a lower theoretical efficiency, but they get a lot closer to it, because they can run at higher compression ratios, usually resulting in better MPG for your vehicle.\u003C/p\u003E\u003Cp\u003ESo why don\u0027t we all just use diesel engines for everything? Well, one of the biggest reasons is that, to handle that bigger pressure ratio, you need a heavier engine, a bigger block, sturdier pistons, and so on. This also makes the engine slower to respond to acceleration, so if you have a motorbike, or a light aircraft, or a sports car, where you want to save weight and accelerate our engine quickly, you normally go for petrol. If you have a train, a big ship, a heavy truck, or a family car, diesel is probably the way to go, because weight and acceleration aren\u0027t your primary design considerations.\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-02-02T14:19:45Z","Content":"\n\u003Cp\u003EThis might interest you.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo \u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/pzFiRsJQvqc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2015-02-02T15:16:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo why don\u0027t we all just use diesel engines for everything? Well, one of the biggest reasons is that, to handle that bigger pressure ratio, you need a heavier engine, a bigger block, sturdier pistons, and so on. This also makes the engine slower to respond to acceleration, so if you have a motorbike, or a light aircraft, or a sports car, where you want to save weight and accelerate our engine quickly, you normally go for petrol. If you have a train, a big ship, a heavy truck, or a family car, diesel is probably the way to go, because weight and acceleration aren\u0027t your primary design considerations.\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty much what I was going to say.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-02-02T16:59:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo why don\u0027t we all just use diesel engines for everything? Well, one of the biggest reasons is that, to handle that bigger pressure ratio, you need a heavier engine, a bigger block, sturdier pistons, and so on. This also makes the engine slower to respond to acceleration, so if you have a motorbike, or a light aircraft, or a sports car, where you want to save weight and accelerate our engine quickly, you normally go for petrol. If you have a train, a big ship, a heavy truck, or a family car, diesel is probably the way to go, because weight and acceleration aren\u0027t your primary design considerations.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain, this isn\u0027t necessarily true. It\u0027s got to a point where the performance is similar and the extra torque gives an advantage. A couple of examples:\u003C/p\u003E\u003Cp\u003EBMW 320i (petrol): 0-100km/h in 7.3 seconds - 80-120km/h in 7.4 seconds - top speed: 235km/h - torque@rpm: 270@1250-4500\u003C/p\u003E\u003Cp\u003EBMW 320d (diesel): 0-100km/h in 7.4 seconds - 80-120km/h in 5.9 seconds - top speed: 235km/h - torque Nm@rpm: 380@1750-2750\u003C/p\u003E\u003Cp\u003ERenault MÃƒÂ©gane TCe 130 (petrol): 0-100km/h in 10.7 seconds - top speed: 200km/h - torque Nm: 205\u003C/p\u003E\u003Cp\u003ERenault MÃƒÂ©gane DCi 130 (petrol): 0-100km/h in 9.8 seconds - top speed: 200km/h - torque Nm: 320\u003C/p\u003E\u003Cp\u003EAnd of course, fuel efficiency of the diesel engines is much better. In the European market, the petrol engined versions are strictly for the entry-level models because of the cheap price point, but in the mid-range and above the diesel models sell more.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-02T17:02:50Z\u0022 title=\u002202/02/2015 05:02  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 2, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2015-02-02T17:47:14Z","Content":"\n\u003Cp\u003EDiesel vehicles smell. Also they pollute the enviroment more (soot production). Why the taxes in Europe are lower for them is a real mystery for me.\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-02-02T18:36:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EDiesel vehicles smell. Also they pollute the enviroment more (soot production). Why the taxes in Europe are lower for them is a real mystery for me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually not so anymore. Actually i know for a fact that running a modern truck, aside from the CO2, you actually end up cleaning the air of other stuff as you drive. Soot production is a real problem with older trucks, especially when forced down to low rpms. But at the same time. A properly working engine shouldnt make too much if you see soot production, you are probably looking at an older engine thats not getting quite as much compression as it should.\u003C/p\u003E\u003Cp\u003Emodern engines sooting up is a pretty big problem because its usually accompanied by a sharp drop in power.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-02-02T18:55:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EDiesel vehicles smell. Also they pollute the enviroment more (soot production). Why the taxes in Europe are lower for them is a real mystery for me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are some areas of the world (valley areas of California where pollution tends to settle for example) where the exhaust from a modern diesel engine, say a Detroit DD13 with diesel particulate filter technology on the exhaust, is cleaner than the air that went in the intake filter. Some places(like scrap yards with lots of mud and dust) much,much cleaner. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.demanddetroit.com/images/splash/splash-engines-dd13.jpg\u0022 alt=\u0022splash-engines-dd13.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://image.dieselpowermag.com/f/tech/1301dp_diesel_engine_spotters_guide/41360729/1301dp_06-diesel_engine_spotters_guide-diesel_particulate_filter.jpg\u0022 alt=\u00221301dp_06-diesel_engine_spotters_guide-diesel_particulate_filter.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2015-02-02T19:14:00Z","Content":"\n\u003Cp\u003EI think Pedar nailed a lot of it. The main, and perhaps only, advantage I would give to a gasoline engine is that they can be built lighter. They are burning their fuel in a wave rather than exploding it (knocking, which is what diesels do full time), allowing the use of much lighter pistons and driving rods. I\u0027d also peg gasoline engines as being quieter (that is, it\u0027s easier to muffle the noise for vehicle occupants) since they are burning instead of exploding their fuel. By contrast, a nice big heavy diesel engine is capable of withstanding considerable abuse. Their higher torque is also of considerable benefit for heavier vehicles.\u003C/p\u003E\u003Cp\u003EThis isn\u0027t to say gasoline engines can\u0027t be built tough. Marine engines for example are designed to operate at full capacity for extended periods of time.\u003C/p\u003E\u003Cp\u003ERunning society exclusively on one or the other though doesn\u0027t make much sense. There is no way to totally control the quantities of outputs when you refine crude oil. You \u003Cem\u003Ecan\u003C/em\u003E steer it a bit, but you are still going to end up with considerable amounts of both gasoline and diesel, so from an economic point of view your optimum case will always be some mixture of fuels.\u003C/p\u003E\u003Cp\u003EWhen talking about one or the other being cleaner, it\u0027s always worth considering what the definition of clean is. Diesels were considered cleaner for a long time because they were held to the same standard as gasoline engines, which completely ignored particulates of a certain size that were the primary output of diesel engines. When it comes to places like california, I\u0027d be interested to see if the regulations focus only on particulates that would settle, or if they focus on gasses as well. Also, do they regulate the replacement of the filtration systems? Diesels in particular have a problem where they can intake more fuel than they can burn, which is where you get the sooty black exhaust. It\u0027s form incomplete combustion, and it creates a whole lot of nasty stuff, including considerable particulate matter. That\u0027s why I ask about replacing the filters, since I would imagine that trying to capture all that particulate matter would actually clog up the filters within a couple years tops.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-02T19:20:23Z\u0022 title=\u002202/02/2015 07:20  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 2, 2015\u003C/time\u003E by Randox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-02-02T20:19:10Z","Content":"\n\u003Cp\u003EThe biggest advantage gasoline has is that there\u0027s not much competition for that part of the distillate. Diesel is used in all manner of applications, from home heating to power generation, in addition to automotive use. Gasoline is basically only used in vehicles (and was once considered a useless byproduct that was discarded).\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-02-02T20:55:51Z","Content":"\n\u003Cp\u003EAnother thing to note is fire safety.\u003C/p\u003E\u003Cp\u003EGasoline is extremely volatile, and easy to ignite.\u003C/p\u003E\u003Cp\u003EDiesel on the other hand is actually pretty hard to burn without an extreme level of oxidizer, or extreme heat.\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2015-02-03T07:46:50Z","Content":"\n\u003Cp\u003EWhy do diesel engine cannot use gasoline? If the engine can ignite heavy fuels why it can\u0027t accept lighter fuels?\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2015-02-03T08:10:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aghanim\u0022 data-cite=\u0022Aghanim\u0022\u003E\u003Cdiv\u003EWhy do diesel engine cannot use gasoline? If the engine can ignite heavy fuels why it can\u0027t accept lighter fuels?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause diesel ignites using the compression of the piston, gasoline ignites using a spark plug, therefore diesel engines do not contain spark plugs and cannot burn regular gasoline.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-02-03T11:23:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveofDefeat\u0022 data-cite=\u0022DaveofDefeat\u0022\u003E\u003Cdiv\u003EBecause diesel ignites using the compression of the piston, gasoline ignites using a spark plug, therefore diesel engines do not contain spark plugs and cannot burn regular gasoline.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn fact, diesel engines can run on pretty much anything. There\u0027s an episode of Mythbusters where they filter used cooking fat, and put it straight into the fuel tank of a diesel car, which runs without a bother. There is no reason why injecting petrol into a diesel cylinder at the end of the compression stroke wouldn\u0027t ignite the fuel.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/QEX1YFXYTdI?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2015-02-03T11:40:06Z","Content":"\n\u003Cp\u003EI once accidentally fueled regular gasoline in a diesel car, actually the engine runs without problems as long there is no load on it. You loose all the torque. But maybe with some modifications like tweaking the injection point would fix this.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-02-03T11:48:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gpisic\u0022 data-cite=\u0022gpisic\u0022\u003E\u003Cdiv\u003EI once accidentally fueled regular gasoline in a diesel car, actually the engine runs without problems as long there is no load on it. You loose all the torque. But maybe with some modifications like tweaking the injection point would fix this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been looking at this from a thermodynamic point of view, and petrol in a diesel is fine for that.\u003C/p\u003E\u003Cp\u003EAfter doing a bit of reading, petrol in a real-life diesel engine is actually quite bad for other parts of the system, like the pump seals that were not designed to work with it. You could easily design a compression ignition system that would run on petrol, but on an existing system, it is not good.\u003C/p\u003E\u003Cp\u003EDiesel in a petrol engine simply won\u0027t start most of the time, the flash point of the fuel is too high for the smaller compression rations to cause ignition, even with the help of a spark plug.\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-02-03T17:21:05Z","Content":"\n\u003Cp\u003EMost diesel engines can usually run on mixes of diesel and other stuff. You can run on vegetable oils and animal fats just fine, as long as you can keep them thin enough (heating coil in the tank. Or mix it with some diesel. I dont recommend doing this in the winter though)\u003C/p\u003E\u003Cp\u003EHeck Ive got a 100kw caterpillar generator sitting in my garage with some extra fuel filters, and a goofy triangular tank, made to run straight off of crude. (So you can run it in an oil field, without needing to transport fuel to it)\u003C/p\u003E\n"},{"CreatedByName":"marach","CreatedById":72245,"CreatedDateTime":"2015-02-03T18:20:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Randox\u0022 data-cite=\u0022Randox\u0022\u003E\u003Cdiv\u003EThat\u0027s why I ask about replacing the filters, since I would imagine that trying to capture all that particulate matter would actually clog up the filters within a couple years tops.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E The filtration systems are mostly catalytic in modern diesels, my new car for example needs 20 minutes at motorway speeds(60-70mph) once a month or I\u0027m facing a Ã‚Â£300 replacement (particulate filter) after a year. The urea injectors usually hold enough for ~18 months/35k miles and are refilled as part of the standard yearly/25k mile service.\u003C/p\u003E\n"}]}