{"TopicId":98539,"ForumId":32,"TopicTitle":"tips for a refueling station?","CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-02-02T08:00:09Z","PageNum":1,"Articles":[{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-02-02T08:00:09Z","Content":"\n\u003Cp\u003EI made a long one and attempted to send it to Eve, but it started shaking so much I could have sworn Elvis was in there. would be nice if I sent something to Eve in the future if I could refuel whatever I sent after that. Could have left it in LKO, but eh, don\u0027t wanna do that. hehe\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2015-02-02T08:10:36Z","Content":"\n\u003Cp\u003ESo, do you want tips about wobbly rockets or about how to refuel?\u003C/p\u003E\u003Cp\u003EIn the first case, you could try a puller design (engines in front, aimed alongside (parallel) to the craft\u0027s.\u003C/p\u003E\u003Cp\u003EIn the second, learn to \u003Cstrong\u003ELOVE\u003C/strong\u003E rendez-vous-ing and docking (I can\u0027t help you much there. I am really inefficient when it comes to doing rendez-vous and I am only passable at docking)\u003C/p\u003E\u003Cp\u003EMinmus is a good place for in-situ fuel production. Low gravity and small-ish world makes for easy to lift and possibly huge tankers (anything with less \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Rockomax_Jumbo-64_Fuel_Tank\u0022 rel=\u0022external nofollow\u0022\u003Ea big orange tank\u003C/a\u003E worth of fuel to give is a shameful craft). You can even drop the ship down to kerbin and use the oberth effect for a good energy boost toward an interplanetary target.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-02T12:17:17Z\u0022 title=\u002202/02/2015 12:17  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 2, 2015\u003C/time\u003E by Axelord FTW\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-02-02T20:25:24Z","Content":"\n\u003Cp\u003EStruts!\u003C/p\u003E\u003Cp\u003EAfter that..\u003C/p\u003E\u003Cp\u003EMore Struts!\u003C/p\u003E\u003Cp\u003ENot the scaffolding looking things (well, you can use those too) but the small ones that you can place anywhere. I should know what they are called, since they usually make up a third of my rockets part counts, but I can\u0027t recall. Something strut.\u003C/p\u003E\n"},{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2015-02-02T20:46:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Axelord FTW\u0022 data-cite=\u0022Axelord FTW\u0022\u003E\u003Cdiv\u003ESo, do you want tips about wobbly rockets or about how to refuel?\u003Cp\u003EIn the first case, you could try a puller design (engines in front, aimed alongside (parallel) to the craft\u0027s.\u003C/p\u003E\u003Cp\u003EIn the second, learn to \u003Cstrong\u003ELOVE\u003C/strong\u003E rendez-vous-ing and docking (I can\u0027t help you much there. I am really inefficient when it comes to doing rendez-vous and I am only passable at docking)\u003C/p\u003E\u003Cp\u003EMinmus is a good place for in-situ fuel production. Low gravity and small-ish world makes for easy to lift and possibly huge tankers (anything with less \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Rockomax_Jumbo-64_Fuel_Tank\u0022 rel=\u0022external nofollow\u0022\u003Ea big orange tank\u003C/a\u003E worth of fuel to give is a shameful craft). You can even drop the ship down to kerbin and use the oberth effect for a good energy boost toward an interplanetary target.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats a very good tips, probably could not have said it better myself. Although i do have one tip for you: create refuelling stations for seperate stages along the way so you can refuel your refuelling station to get it where it needs to be.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-02-03T01:03:20Z","Content":"\n\u003Cp\u003E2.5 meter docking ports. Do not build too long. Disable reaction wheels far from center, reaction wheels far from center tend to generates a lot of problems. \u003C/p\u003E\u003Cp\u003EDownload KAS, it give you the option of adding struts by EVA kerbals, this kind of solves the issue.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-02-03T03:04:56Z","Content":"\n\u003Cp\u003EGuys, every thing you say is valid, but you are forgetting the main thing for good gameplay: since you\u0027ll be flying other stuff to it, \u003Cem\u003Ekeep part count low\u003C/em\u003E. Try to put as little aesthetic fluff as you can, and know that apparently docking port contribute to lag (I ignore that rule a lot myself). This station, for example, is 75 parts for the monolithic core, plus 11 for each Big Red docked to it. The Drive pods and Klaw pods to move stuff (and itself) around are also 11 parts, so a minimally useful station is around 100 parts, (the one in the picture is about 150).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/s1VMK7W\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/s1VMK7W.png\u0022 alt=\u0022s1VMK7W.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERune. If you build smartly, you can still do awesome stuff with few parts.\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-02-03T03:21:01Z","Content":"\n\u003Cp\u003EI\u0027m not entirely sure about this, but it seems like large crafts shaking (especially when composed of several big pieces assembled with docking ports) is a result of SAS. I find that if I turn off SAS, my giant modular tanker doesn\u0027t shake... but it does gradually veer towards one direction, which becomes a significant problem for long maneuver burns. The solution I finally found was to use autopilot to point it towards the correct direction for the maneuver, then turn off SAS completely and start it spinning (Q/E) while still pointing in the right direction, then open up the throttle. The spin keeps it pointed in the right direction without any need for SAS.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAnd as Rune pointed out, use as few parts as possible. Kerbodyne tanks can help with this \u003Cem\u003Eimmensely.\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2015-02-03T05:04:42Z","Content":"\n\u003Cp\u003ELight your docking ports up. Personally I don\u0027t want to dock anything to an invisible port in the dark.\u003C/p\u003E\n"},{"CreatedByName":"Jarardo1","CreatedById":130234,"CreatedDateTime":"2015-02-03T05:21:18Z","Content":"\n\u003Cp\u003ETotally agree with the low part count, and spiffy looking station Rune. If you really intend to dock with it a lot then keep it low. \u003C/p\u003E\u003Cp\u003EThese are both with MKS and Interstellar. 1 is a heavy lander with a logistics hub inside. It can land on Laythe and produce LFO/Argon, plus water/minerals etc. There are flying drones in the logistics module that transport any resources to any other ship in the same sphere of influence for a cost of fuel.\u003C/p\u003E\u003Cp\u003EThe other is a science/fuel ship to accompany a lander so the lander can have it\u0027s experiments cleaned and refuel in 1 dock.\u003C/p\u003E\u003Cp\u003EI try to keep the vessels just designed for space shorter and fatter, instead of something really long that can start wobbling.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/NG71a\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-03T05:24:36Z\u0022 title=\u002202/03/2015 05:24  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 3, 2015\u003C/time\u003E by Jarardo1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-02-03T22:18:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EThe Drive pods and Klaw pods to move stuff (and itself) around are also 11 parts, so a minimally useful station is around 100 parts, (the one in the picture is about 150).\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s definitely a neat looking station, but 100-150 parts is kinda scary.\u003C/p\u003E\u003Cp\u003EIf you just want to refuel regular fuel types, this is all you really need:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://alpha.renegrade.net/images/Stock-FuelDepot.jpg\u0022 alt=\u0022Stock-FuelDepot.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E- Fuel and RCS topper-offer\u003C/p\u003E\u003Cp\u003E- Minor energy fill capabilities\u003C/p\u003E\u003Cp\u003E- RCS quads for stationkeeping / orbital fixups (also my Horrible Nerf nerfs reaction wheels to heck and back so..)\u003C/p\u003E\u003Cp\u003E- Axially mounted docking ports allow for craft to provide thrust for more serious boost operations (there\u0027s one on the bottom too, not pictured)\u003C/p\u003E\u003Cp\u003E- Single light on each docking port provides illumination even on the dark side of Kerbin\u003C/p\u003E\u003Cp\u003E- Probe core (under top docking port) allows for autonomous operation\u003C/p\u003E\u003Cp\u003EPart count: 22.\u003C/p\u003E\u003Cp\u003ENote that if you \u003Cem\u003Ereally\u003C/em\u003E want to save on part count, you could strip it down to just the RCS tank, Jumbo64 and a docking port, and rename it from \u0022Debris\u0022 to \u0022Station\u0022 via the Tracking Center. It would still operate as a fuel depot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2015-02-03T22:26:57Z","Content":"\n\u003Cp\u003EI would say having fuel is pretty high on the agenda.\u003C/p\u003E\n"},{"CreatedByName":"EndOfTheEarth","CreatedById":24503,"CreatedDateTime":"2015-02-03T23:12:11Z","Content":"\n\u003Cp\u003Ethis isn\u0027t a traditional fuel station, but the method that I\u0027ve been using is to design my spacecraft tugs to be able to dock to itself while remaining docked to another payload. This way, I know that my fuel will reach its destination, along with a fuel margin representing what the original payload was. Using this method, I have saved fuel-hungry ships orbiting Duna, Laythe, and Bop without ever having to waste time worrying about station construction.\u003C/p\u003E\u003Cp\u003EThat said, pre-positioning one of these tugs around a planet could also act as a fuel cache. It\u0027s all in how you interpret it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NfeRXRb.png\u0022 alt=\u0022NfeRXRb.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SorryDave","CreatedById":119474,"CreatedDateTime":"2015-02-04T00:32:16Z","Content":"\n\u003Cp\u003EAn equatorial orbit is petered for missions that require interplanetary docking, especially if you need to land and take off again.\u003C/p\u003E\u003Cp\u003EI usually set one up with the following steps: \u003C/p\u003E\u003Cp\u003E1. Set up a transfer that has a SOI intercept\u003C/p\u003E\u003Cp\u003E2. Select the target body in map view and \u0022set view\u0022 to see the predicted entry\u003C/p\u003E\u003Cp\u003E3. Adjust predicted tragectory by slightly accelerating in different headings until perapsis is nearly at the equator and you are heading the right direction.\u003C/p\u003E\u003Cp\u003E4. When at the target, burn retrograde just enough to create a orbit with a high apogee\u003C/p\u003E\u003Cp\u003E5. At apogee fix inclination\u003C/p\u003E\u003Cp\u003E6. Circularize orbit\u003C/p\u003E\u003Cp\u003EEffective staging is the best method for getting fuel there, but you have to deal with solar orbit debris, something I struggle with due to my broken mental process.\u003C/p\u003E\n"},{"CreatedByName":"Admac","CreatedById":126280,"CreatedDateTime":"2015-02-04T00:57:37Z","Content":"\n\u003Cp\u003EI used to have a big 500T HKO Fuel station (3 MM orbit) to fuel up my big interplanetary operations, and loaded up on fuel from a Karbonite mine on Minimus. Worked well but it was always a bit finicky to dock two vessels that were over 300 tons and didn\u0027t have quite balanced RCS in all axis. My new system is a lot more fun, and building on my goal of recoverable stages. I launch the mission ship into a 75km orbit empty of all fuel then deorbit and recover the launch vehicle. I come in with my boost tanker, dock in (The Boost tanker is perfectly balanced for RCS maneuvers), boost it to it\u0027s final vector(gliding towards Duna or whatever) Transfer over the fuel to fill all the mission ship tanks, undock and then do a braking burn on my nearly empty Boost tanker to get it back into Munar orbit where it can be filled up from my fuel mining operations on the surface, based on what the next boost mission requires.\u003C/p\u003E\u003Cp\u003EOnly one docking maneuver per mission still, and I can build MUCH smaller mission ships since they only need to do a course correction and circularize an orbit, often just 1000 M/S of DV is fine for one way trips.\u003C/p\u003E\u003Cp\u003EAnd launching a smaller ship with no fuel allows me to use much smaller launch vehicles, driving down the price even further yet.\u003C/p\u003E\u003Cp\u003EAlso most missions are basically one way trips, since the first thing bigger than a probe I send to most systems is a surface fuel refinery.\u003C/p\u003E\n"},{"CreatedByName":"ScottWright","CreatedById":134197,"CreatedDateTime":"2015-02-04T01:04:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Renegrade\u0022 data-cite=\u0022Renegrade\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Ca href=\u0022http://alpha.renegrade.net/images/Stock-FuelDepot.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alpha.renegrade.net/images/Stock-FuelDepot.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust a tip, put your RCS thrusters farther from the center of mass. It would take about 1/4 of the monoprop to rotate that if they were on each side. Of course, translation would still cost the same.\u003C/p\u003E\n"},{"CreatedByName":"Tanner Rawlings","CreatedById":58414,"CreatedDateTime":"2015-02-04T01:09:31Z","Content":"\n\u003Cp\u003Emy favorite way is to attach a fuel line to your station and at the other end attach it to the VAB, no need for that silly rendezvous stuff, in all seriousness, if refueling around another planet is what you want, i usually send about 2-3 tankers at different times on long trips to meet with the interplanetary craft when it reaches the planets i decided to send the fuel to (if i plan it out right, the probes can land and do science while the mother ship meets up with the refueling craft)\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-02-04T01:28:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ScottWright\u0022 data-cite=\u0022ScottWright\u0022\u003E\u003Cdiv\u003EJust a tip, put your RCS thrusters farther from the center of mass. It would take about 1/4 of the monoprop to rotate that if they were on each side. Of course, translation would still cost the same.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I know -- I\u0027m a seasoned BTSM player and I get by with RCS that\u0027s little better than a cold gas system on vessels that are much heavier -- but that would unbalance the craft if only one ring was used, and add to part count and cost if two were used. To save on RCS fuel, I just turn off SAS and use a short RCS burst and wait a bit longer. It\u0027s not a lander afterall, fast, decisive maneuvers are not required \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith their middle position (they\u0027re about halfway between the full CoM and half-full CoM), they have a commanding control of roll (since Squad\u0027s RCS code falls a bit short on roll logic, it can probably out-roll a two ring design, and can definitely out-roll an offset one-ring design), which is important for stationkeeping. I usually keep it pointed north-south like that, and correct any docking-based orbit perturbations with the ijkl keys after rolling it so that one of the short axis is pointed at the prograde/retrograde marker.\u003C/p\u003E\u003Cp\u003EI\u0027m sending up a Minmus ground base right now (yay free money!), and it has a similar shape (it\u0027s a stack of hitchhiker pods basically), but I\u0027ve put RCS quads on a ring at either end so that it can perform more aggressive, rapid movements during the landing phase.\u003C/p\u003E\n"},{"CreatedByName":"hellblazer","CreatedById":131384,"CreatedDateTime":"2015-02-04T01:56:09Z","Content":"\n\u003Cp\u003EMy tips for a \u0022refueling station\u0022 not to be confused with a refueling ship.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Esenior docking ports (can always make a senior to junior adapter if needed) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eplenty of lights \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Einfernal robotics for rotatrons. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Efat tanks \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI launch with no fuel and transport it empty as well. I use efficient refueling ships (probe cores) to top up the tanks after I place it in my desired orbit. You will waste tons of fuel literally trying to move it. \u003C/p\u003E\u003Cp\u003EThis is my refueling station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Z5oSXw6.jpg\u0022 alt=\u0022Z5oSXw6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Asr3C6N.jpg\u0022 alt=\u0022Asr3C6N.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-04T03:27:17Z\u0022 title=\u002202/04/2015 03:27  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 4, 2015\u003C/time\u003E by hellblazer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-02-04T03:11:41Z","Content":"\n\u003Cp\u003EBest tip i can give for a refueling station is to bring fuel, and enough fuel in the booster stage to get it wherever you want with full tanks.\u003C/p\u003E\u003Cp\u003ECant tell you how many times i ended up eating roughly 90% of the fuel station\u0027s primary fuel trying to get said station to laythe\u003C/p\u003E\n"},{"CreatedByName":"vixr","CreatedById":133940,"CreatedDateTime":"2015-02-04T04:30:54Z","Content":"\n\u003Cp\u003EHere is a couple of stations I built...\u003C/p\u003E\u003Cp\u003EMun orbit...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i105.photobucket.com/albums/m236/vixr/screenshot4%202_zpsbmnue3xp.png\u0022 alt=\u0022screenshot4%202_zpsbmnue3xp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i105.photobucket.com/albums/m236/vixr/screenshot117_zpsqc6yghmq.png\u0022 alt=\u0022screenshot117_zpsqc6yghmq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i105.photobucket.com/albums/m236/vixr/screenshot122_zpskehspczu.png\u0022 alt=\u0022screenshot122_zpskehspczu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd LKO...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i105.photobucket.com/albums/m236/vixr/screenshot33%202_zpsni9f8fmn.png\u0022 alt=\u0022screenshot33%202_zpsni9f8fmn.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-04T04:33:25Z\u0022 title=\u002202/04/2015 04:33  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 4, 2015\u003C/time\u003E by vixr\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-02-04T04:52:03Z","Content":"\n\u003Cp\u003EPeople are very Gigantor-happy. You know you can pretty much do anything in stock except ion drives* with a single ox-stat, right? (Obviously some mods require high degree of power, particularly Interstellar)\u003C/p\u003E\u003Cp\u003E* Well, ion drives that run continually. You can battery your way through many ion applications, especially if you get abusive with Z-400s. :/\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-02-04T16:01:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Draconiator\u0022 data-cite=\u0022Draconiator\u0022\u003E\u003Cdiv\u003EI made a long one and attempted to send it to Eve, but it started shaking so much I could have sworn Elvis was in there.\u003C/div\u003E\u003C/blockquote\u003EWell, the short answer is don\u0027t build an over-long ship. Build outwards instead. A central tank, with four or six tanks round it, will do well.\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-02-04T16:08:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Renegrade\u0022 data-cite=\u0022Renegrade\u0022\u003E\u003Cdiv\u003EPeople are very Gigantor-happy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that\u0027s because they look \u003Cem\u003Ereally cool,\u003C/em\u003E or they might think they need them because the ISS has HUGE solar panels, but that\u0027s different.\u003C/p\u003E\u003Cp\u003EBut yeah, efficiency-wise, you\u0027re right. I normally just put 1 or 2 auto-tracker solar panels on my ships, maybe an RTG if I have to plan for it being out of sunlight for a long period of time.\u003C/p\u003E\u003Cp\u003EAnyways, something I\u0027ve found is that to make your refueling stations effective, you have to plan your ships accordingly. It doesn\u0027t matter if your refueling stations have a Jumbo-64, if you build huge ships one refuel will make it space debris. Therefore, when refueling, plan your missions accordingly, make your ships as fuel-efficient as possible. The smaller your ships, the more uses you can get out of a refueling station.\u003C/p\u003E\u003Cp\u003ERefueling encourages this anyways, when you refuel, naturally you need to take less fuel with you to begin with.\u003C/p\u003E\n"},{"CreatedByName":"vixr","CreatedById":133940,"CreatedDateTime":"2015-02-04T16:41:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Renegrade\u0022 data-cite=\u0022Renegrade\u0022\u003E\u003Cdiv\u003EPeople are very Gigantor-happy...\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can see the orientation of my target (station) from a mile away and plan my approach accordingly.\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-02-04T20:38:21Z","Content":"\n\u003Cp\u003EI usually retract all of a station\u0027s solar panel arrays before even approaching it with another craft, because I\u0027m terrified that I might bump into them and break them. It\u0027d be nice if there were some way for high-level engineers to repair broken solar arrays.\u003C/p\u003E\n"}]}