{"TopicId":98591,"ForumId":55,"TopicTitle":"Career Mode late-game Farming still an issue","CreatedByName":"NeoIvan17","CreatedById":107060,"CreatedDateTime":"2015-02-02T20:25:05Z","PageNum":1,"Articles":[{"CreatedByName":"NeoIvan17","CreatedById":107060,"CreatedDateTime":"2015-02-02T20:25:05Z","Content":"\n\u003Cp\u003EHi there. First thing is if someone has already posted something similar to what I posted below, please inform me so I can delete this. Essentially, this is a topic of grinding and farming both contracts and science before you get out into the rest of the Kerbol system. What my issue is here, is that that while I grind on those contracts to get the 3.1 million funds to upgrade the R\u0026amp;D building to it\u0027s final level the amount of science I will get from the Mun and Minmus will allow me to be able to unlock those nodes really quickly once I get the funds; I think that defeats the purpose of going out towards the other celestial bodies as far as game progression goes.\u003C/p\u003E\u003Cp\u003EI\u0027ve been playing Kerbal Space Program for over a year now and I really love the changes from .23 to .90. So much has been added and improved, but I have to make a suggestion for the developers before the game gets released to version 1.0.\u003C/p\u003E\u003Cp\u003ESome context on where I am coming from is in order. Before .90 we didn\u0027t have to worry about upgrading buildings. Instead we just needed the science points to unlock the Tech nodes. With the implementation of building upgrades the game got far more challenging and more fun to me and I\u0027m sure many others agree here. I am currently stuck on contracts that do not pay enough money to rapidly upgrade the building to level 3. That is fine. I don\u0027t mind that as it has forced me to learn about Rovers and base-building to fulfill certain contracts like Seismic readings and such. Challenges I enjoy and add so much more depth to the game, once you figure out how to get the requirements fulfilled anyway. \u003C/p\u003E\u003Cp\u003EWhere I am currently in game is I\u0027m approaching the first launch window for a Duna expedition. It\u0027s around 12-15 (Earth) days away. I have 2.4 million funds and over 1200 science. The science requirement on each of the last tech nodes is 550. That\u0027s two nodes unlocked when I eventually upgrade the building. I think if I spend 2-3 missions going to Minmus and 5-6 going to the Mun (Landing and taking science from the untouched Biomes) I believe I can get an additional 1-2k in science points. More so if I bring rovers that have science equipment on them. That would be an additional 2-4 nodes unlocked, which would be almost half(?) or more of the final tech tree nodes. \u003C/p\u003E\u003Cp\u003EThe suggestion I\u0027d like to make here would be to prevent or limit the farming of science points. It revolves around making the last 2 tech tree levels more science point expensive. Second to last should be 50% more expensive (From 300 to 450) and the final level should be doubled (550 to 1100). This will prevent the farming from being a viable thing to do and since going out of the Kerbin SOI will yield more science points, it will make the journey out there more worth it for the Late game of KSP in terms of actual gameplay progression.\u003C/p\u003E\u003Cp\u003EAgain, if someone has already done this in regards to the .90 Career Mode please let me know so I can take this thread down. Thank you for your time.\u003C/p\u003E\n"}]}