{"TopicId":98653,"ForumId":44,"TopicTitle":"Ariane reusable boosters being designed?","CreatedByName":"Poynting","CreatedById":103397,"CreatedDateTime":"2015-02-03T12:36:24Z","PageNum":1,"Articles":[{"CreatedByName":"Poynting","CreatedById":103397,"CreatedDateTime":"2015-02-03T12:36:24Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.esa.int/spaceinvideos/Videos/2015/01/IXV_technologies_tested\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.esa.int/spaceinvideos/Videos/2015/01/IXV_technologies_tested\u003C/a\u003E \u003C/p\u003E\u003Cp\u003ERight at the end look at the CAD model they show. How will they work? propulsive landing or runway? Will it be able to compete with spacex?\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-02-03T14:21:15Z","Content":"\n\u003Cp\u003EConceptual study only. None of that technology is going into Ariane.\u003C/p\u003E\u003Cp\u003EFlyback boosters are not a new idea. There have been dozens of studies like that, including Energia, Baikal (Angara) and Lockheed Martin. There have been concepts designed for the Shuttle and even for SLS. The idea is for them to glide back to a runway, but nobody has done it yet.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2015-02-03T15:24:17Z","Content":"\n\u003Cp\u003EHere\u0027s a picture of those Baikal boosters:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.russianspaceweb.com/maks2013/images/space_lv_mrkn_jpg.jpg\u0022 alt=\u0022space_lv_mrkn_jpg.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-02-03T16:31:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EConceptual study only. None of that technology is going into Ariane.\u003Cp\u003EFlyback boosters are not a new idea. There have been dozens of studies like that, including Energia, Baikal (Angara) and Lockheed Martin. There have been concepts designed for the Shuttle and even for SLS. The idea is for them to glide back to a runway, but nobody has done it yet.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, first this is not an flyback booster but looks more like an reentry pod, reminds me of dreamchaser however it don\u0027t looks like it has enough wings to land on runways.\u003C/p\u003E\u003Cp\u003EAnd most previous designs for soft landing boosters involved wings and runways with a few exceptions. I think using the engine for braking would be smarter at least if you can avoid the boostback.\u003C/p\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-02-03T17:26:53Z","Content":"\n\u003Cp\u003ENothing new I guess \u003Ca href=\u0022http://www.buran-energia.com/energia/energia-consti-1eretage.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.buran-energia.com/energia/energia-consti-1eretage.php\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.buran-energia.net/img/block%20a-animation.gif\u0022 alt=\u0022block%20a-animation.gif\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-02-03T17:36:30Z","Content":"\n\u003Cp\u003E@magnemoe\u003C/p\u003E\u003Cp\u003EThe OP was not talking about the IXV, but abiut the CAD rocket design visible in the last few seconds of the video \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis specific design shows boosters with control fins and flyback engines.\u003C/p\u003E\u003Cp\u003EAnother interesting point of this concept would be that those boosters use methalox engines - there\u0027s not a lot of infos on ESA\u0027s research on methalox engines.\u003C/p\u003E\u003Cp\u003EAlthough an old paper do tell they are doing researches on it, alongside staged combustion cycles.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.esa.int/Our_Activities/Launchers/First_hot_firing_of_European_staged-combustion_demonstration_engine/%28print%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.esa.int/Our_Activities/Launchers/First_hot_firing_of_European_staged-combustion_demonstration_engine/%28print%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-02-04T18:59:42Z","Content":"\n\u003Cp\u003EAgreed that it is not a new idea, but it is a great sign that so many space organizations are now really looking into reusabilility. As to whether or not it is superior to propulsive is something that takes a lot of study, as it is just going to come down to mass and performance: is it more efficient to carry big heavy wings up with you so you can use all or most of your propellant on ascent, or is it more efficient to save a little fuel for boost-back burns. Here are some other cool flyback concepts:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://jdwaggoner.files.wordpress.com/2011/12/booster_photo_4.jpg\u0022 alt=\u0022booster_photo_4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://forum.nasaspaceflight.com/index.php?action=dlattach;topic=27468.0;attach=342390;image\u0022 alt=\u0022index.php?action=dlattach;topic=27468.0;attach=342390;image\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://forum.nasaspaceflight.com/index.php?action=dlattach;topic=16860.0;attach=129269;image\u0022 alt=\u0022index.php?action=dlattach;topic=16860.0;attach=129269;image\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://mix.msfc.nasa.gov/IMAGES/MEDIUM/0001720.jpg\u0022 alt=\u00220001720.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-02-05T09:50:07Z","Content":"\n\u003Cp\u003EIt\u0027s not a matter of which is more efficient by mass, as if you\u0027re reusing the booster that means very little. However, the major difference comes in functionality - propulsive landers can land on little more fuel than would have been spare anyway, but they can only land in a very small area near their initial ballistic landing site. Landing any distance back towards land requires a huge fuel addition, plus as they are only lifted actively, would not be allowed near any populated area to begin with. Gliders, however, can fly a very long distance back on their own, and may be able to RTLS using only their spare fuel, or no fuel at all, depending on the design.\u003C/p\u003E\u003Cp\u003EThis allows the booster to return itself to its reuse point with no additional operational cost, and as it can glide, it is allowed near minor population centres, as it has the ability to avoid them without relying on engines that may or may not restart. It is assumed the controls will continue working, as they had to operate to begin with to turn the booster around. A gliding booster is then also sitting on wheels, ready to be dragged very cheaply back to the VAB or equivalent for whatever refurbishment is required, as well as leaving it in a more convenient configuration for most maintenance tasks (horizontal, rather than vertical).\u003C/p\u003E\u003Cp\u003EThe end result is that a glide-back booster may be more complex to design, but could quite likely be a lot cheaper operationally, faster to reuse, and face less wear, as its engines only face a single firing per launch. As boosters themselves are very light once dry, the wings would not have to be a significant mass penalty - they do not have to provide lift during launch, and airliner wings (that are much longer and heavier than usually proposed for boosters) are only around 10% of their maximum load mass - which would be negligible compared to a fully fuelled booster. For reference, this would be under 2 tonnes to make the Falcon 9 first stage a flyback booster - and it can be assumed that the additional mass for landing gear and such would fit in the excess from the 10% estimate, in addition to the removal of its vertical landing equipment. SpaceX may prefer to try a vertical approach for its relative development simplicity, as a conventional rocket can theoretically achieve it, but even on their own booster wings may be more effective.\u003C/p\u003E\n"},{"CreatedByName":"Launch Director","CreatedById":211443,"CreatedDateTime":"2021-05-02T16:36:26Z","Content":"\n\u003Cp\u003E\ni hope someone will make a mod for this it\u0027s looking epic\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}