{"TopicId":98826,"ForumId":44,"TopicTitle":"Fundamental basics of lift","CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2015-02-05T11:08:49Z","PageNum":1,"Articles":[{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2015-02-05T11:08:49Z","Content":"\n\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EAfter further looking into the ratio between the forces created by the Bernoulli Principle and Newtons Laws (something I should have done before posting, bad Dodgey) I have found that that it is wrong to try and look at them as two separate explanations in competition with each other. I have not been able to find any information about the difference in ratio of total lift created by the two explanations, instead I have found that the best way is to use a combination of both. I am crossing out where I made the distinction to hopefully fix that. (subscript indicates wrong part)\u003C/p\u003E\u003Cp\u003ESo apparently schools are still teaching the over simplified version of lift which basically attributes it to Bernoulli\u0027s Principle.\u003C/p\u003E\u003Cp\u003EBernoulli\u0027s Principle basically says that as a non-compressible fluid (water or air at subsonic velocities) travels through a constriction the velocity increases where as the pressure (in the constriction) decreases. (See image below)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cdxetextbook.com/images/bernoulliprinciple.gif\u0022 alt=\u0022bernoulliprinciple.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis occurs to a wing in flight as well, as the air flows over the top of the wing it is accelerated because it constricted between the wing and the air above it (which tends not to be compressible at subsonic speeds). Due to the shape of the wing (as shown below) there is less space over the top of the wing then there is below it (on a typical wing), the air tends to be accelerated over the top more than it is accelerated under the bottom of the wing, causing an area of relative low pressure to created on the top of the wing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.formula1-dictionary.net/Images/coanda_lift_wing.gif\u0022 alt=\u0022coanda_lift_wing.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe difference in pressure causes a force which tends to push the wing upwards.\u003C/p\u003E\u003Cp\u003EAs I said this is the over simplified model presented in most schools today. While it isn\u0027t false it doesn\u0027t cover the entire story.\u003C/p\u003E\u003Cp\u003EBefore I go any further I think that it is best that I define some terms.\u003C/p\u003E\u003Cp\u003EChord: A line that connects the leading edge and trailing edge of a wing.\u003C/p\u003E\u003Cp\u003ERelative airflow: The airflow that hits the wing as seen from the perspective of the wing.\u003C/p\u003E\u003Cp\u003EAngle of attack: The angle between the chord line and the relative airflow.\u003C/p\u003E\u003Cp\u003ESo what else is happening, \u003Csub\u003Ewell the main function of a wing isn\u0027t to create a difference in pressure that pushes the wing upwards, instead the main function is to \u003C/sub\u003Enot only does the acceleration of the air create a low pressure area above the wing, it also accelerates the air downwards, taking advantage of Newtons third law (for every action there is an equal and opposite reaction), as the wing accelerates the air down it in turn is accelerated upwards. This is a good image showing how the air is directed downwards. This is what causes the downwash of air trailing behind the wing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://electron9.phys.utk.edu/balls/images/lift_a1.gif\u0022 alt=\u0022lift_a1.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you want a more animated demonstration of this in action then have a look at\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/dfY5ZQDzC5s?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E at about 20 seconds in, 1:12, 2:30, 3:10 and 5:30. The rest of the video shows either vortices of the tips of flaps or wings, or air condensing over the top of a wing due to the decrease in pressure.\u003Cp\u003ENow what about wings that are symmetrical, or what about planes that can fly upside down I hear you asking. Now this is where the angle of attack comes into play. On a symmetrical wing the shape allows air to flow smoothly over up to about 15 degrees angle of attack. Typically once the wing passes 15 degrees it stalls, that is it the air stops flowing smoothly over the top of the wing which drastically reduces the lift. Here is an image of a symmetrical wing deflecting air downwards (producing lift).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://1.bp.blogspot.com/_fuYFqFOuPc4/Sr3kkEcRYEI/AAAAAAAAA_g/_0b3-kNTfNM/s320/aero\u002B3a.jpg\u0022 alt=\u0022aero\u002B3a.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJust as a note stalling a wing is the function of spoilers on an aircraft, these are the panels which pop up on the top of the wing once it has landed. They are not air breaks. All they do is reduce the lift so that the wheels can get enough force on them so that they down go into a skid once the breaks are applied.\u003C/p\u003E\u003Cp\u003ESo that\u0027s the basic fundamentals as I think of it. The main reason for me writing this is that with the new aerodynamics announced there seems to be a few misconceptions on how wings actually work.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T13:51:43Z\u0022 title=\u002202/05/2015 01:51  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by Dodgey\u003C/strong\u003E\n\u003Cbr\u003ERevision after further study\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-05T13:02:26Z","Content":"\n\u003Cp\u003EThe density of air is far too small for the main purpose of a wing to push it down. It wouldn\u0027t provide much force compared to what the Bernoulli Effect provides.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-02-05T13:28:45Z","Content":"\n\u003Cp\u003EWell, I guess KSP forum is one of the places where I can casually go from threads about playing games to serious discussions about science. Gotta say I learn a lot of new things everyday here.\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-02-05T13:40:32Z","Content":"\n\u003Cp\u003EThanks for this, I am only in high school and I only learned Bernoulli\u0027s principle until now:)\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-02-05T13:48:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EThe density of air is far too small for the main purpose of a wing to push it down. It wouldn\u0027t provide much force compared to what the Bernoulli Effect provides.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECompletely wrong.\u003C/p\u003E\u003Cp\u003EIf this were true, the maximum pressure differential between the top and the bottom of the wing could only be 1 atmosphere.\u003C/p\u003E\u003Cp\u003EI think you\u0027ll have a hard time explaining a V^2 relationship between velocity and lift by bernoillis principle.\u003C/p\u003E\u003Cp\u003EYou\u0027ll also have a hard time(ie, you can\u0027t do it) arriving at the correct lift consiering the AoA.\u003C/p\u003E\u003Cp\u003EMoreover, if this were right, flight characteristics would mainly depend on the atmospheric pressure, not atmospheric density.\u003C/p\u003E\u003Cp\u003EAny pilot fit to fly can tell you that stall speed increases on hot days relative to cold days.\u003C/p\u003E\u003Cp\u003EHot, less dense air provides less lift than colder, denser air, even if the air pressure is the same.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T13:56:04Z\u0022 title=\u002202/05/2015 01:56  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-05T13:56:22Z","Content":"\n\u003Cp\u003ESo your saying that enormous drag is ALWAYS acting on a wing? Accelerating the air at 151 m/s^2? Yeah... No.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2015-02-05T13:58:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EThe density of air is far too small for the main purpose of a wing to push it down. It wouldn\u0027t provide much force compared to what the Bernoulli Effect provides.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you have any sources for this, \u003Ca href=\u0022http://www.grc.nasa.gov/WWW/k-12/airplane/bernnew.html\u0022 rel=\u0022external nofollow\u0022\u003Ethis page\u003C/a\u003E from NASA has both being acceptable explanations (as well as giving a good debunking to other misconceptions as well), and I haven\u0027t been able to find any numbers which show the difference in lift generated by using either Bernoullis Principle or Newtons Laws (as noted in my edit), only ever showing the lift equation.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003ESo your saying that enormous drag is ALWAYS acting on a wing? Accelerating the air at 151 m/s^2? Yeah... No.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy does the air have to be accelerated up to the velocity of the aircraft? The important part is the vertical acceleration which is imparted to the air, you can see that in the video I posted. As far as I can tell the air stays relatively still in the horizontal axis, mostly being accelerated downwards.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T14:02:22Z\u0022 title=\u002202/05/2015 02:02  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by Dodgey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-05T14:11:45Z","Content":"\n\u003Cp\u003E151 m/s^2 downwards. It\u0027s the acceleration required to equal the wing loading of a P-51 mustang. It\u0027s not accelerating the air downwards that much at all. According to you it would have to. This would impart large forces of drag. \u003C/p\u003E\u003Cp\u003EWings also compress air beneath, not as much as the expansion above, but it is happening.\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-02-05T14:23:46Z","Content":"\n\u003Cp\u003ESaying that the Bernoulli Principle doesn\u0027t work at all isn\u0027t right though either. But saying that it\u0027s the only thing in work is equally wrong.\u003C/p\u003E\u003Cp\u003ETwo force came into play actually :\u003C/p\u003E\u003Cp\u003E1. Newton\u0027s 3rd Law. The wings does deflects air downward a bit. But, on a minimal pitch and no camber wings (consider aerobatic planes), this doesn\u0027t account for all the lift...\u003C/p\u003E\u003Cp\u003E2. Pressure difference due to Bernoulli Principle. The wing compresses the air below a bit - which means slower speed, greater pressure. And on the top, air expands to follow the curve of the wing a bit - low pressure, faster air. Note that it need not that the air masses approaches the end of the wing at the same time. The faster (and more angled) upper winds also cause the lower wind to bend again a bit more.\u003C/p\u003E\u003Cp\u003EThis animation might help, gave me more insight too.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/9/99/Karman_trefftz.gif\u0022 alt=\u0022Karman_trefftz.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe main problem is, most likely you\u0027ll need to master CFD (or R-CFD).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T14:28:13Z\u0022 title=\u002202/05/2015 02:28  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by YNM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2015-02-05T14:36:16Z","Content":"\n\u003Cp\u003EBill Phil, can you please explain how you got to that number?\u003C/p\u003E\n"},{"CreatedByName":"Bryce Ring","CreatedById":129673,"CreatedDateTime":"2015-02-05T14:38:14Z","Content":"\n\u003Cp\u003EWhat is 151 m/s^2 ?\u003C/p\u003E\u003Cp\u003EEnormous drag is always acting on the wing. this is the total reaction force. though, it is usually broken up into two vector quantities, being desired and undesired.\u003C/p\u003E\u003Cp\u003Ethe wing is to be designed to withstand this total reaction force, in all possible vectors. and all possible quantities. if it is not able to withstand these, it should be marked and conveyed to the pilot these are the limitations.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022YNM\u0022 data-cite=\u0022YNM\u0022\u003E\u003Cdiv\u003ESaying that the Bernoulli Principle doesn\u0027t work at all isn\u0027t right though either. But saying that it\u0027s the only thing in work is equally wrong.\u003Cp\u003ETwo force came into play actually :\u003C/p\u003E\u003Cp\u003E1. Newton\u0027s 3rd Law. The wings does deflects air downward a bit. But, on a minimal pitch and no camber wings (consider aerobatic planes), this doesn\u0027t account for all the lift...\u003C/p\u003E\u003Cp\u003E2. \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EPressure difference\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E due to Bernoulli Principle. The wing compresses the air below a bit - which means slower speed, greater pressure. And on the top, air expands to follow the curve of the wing a bit - low pressure, faster air. Note that it need not that the air masses approaches the end of the wing at the same time. The faster (and more angled) upper winds also cause the lower wind to bend again a bit more.\u003C/p\u003E\u003Cp\u003EThis animation might help, gave me more insight too.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/9/99/Karman_trefftz.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/9/99/Karman_trefftz.gif\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E The main problem is, most likely you\u0027ll need to master CFD (or R-CFD).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethere is the gold.....\u003C/p\u003E\u003Cp\u003Esuper sonic flight sees letters being sent, Dear Daniel ...........\u003C/p\u003E\u003Cp\u003Esub sonic\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/_RkXaxQLXDY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003Esee letters being sent, Dear Isaac\u003Cp\u003Eboth letters get returned, What the ! I never said.... and I still don\u0027t believe it \u0022Men can fly now ????\u0022 Leonardo was right ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T14:59:07Z\u0022 title=\u002202/05/2015 02:59  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by Bryce Ring\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lincourtl","CreatedById":72218,"CreatedDateTime":"2015-02-05T14:42:58Z","Content":"\n\u003Cp\u003ESome people might find this article easy to follow.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EA Physical Description of Flight (pdf)\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDavid Anderson, Fermi National Accelerator Laboratory, Ret.\u003C/p\u003E\u003Cp\u003EScott Eberhardt, Dept. of Aeronautics and Astronautics, University of Washington\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.evernote.com/shard/s203/sh/118b9c30-313d-49b5-b8f8-ce77b0019e7b/990691c5fdaaca44\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.evernote.com/shard/s203/sh/118b9c30-313d-49b5-b8f8-ce77b0019e7b/990691c5fdaaca44\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-02-05T15:01:45Z","Content":"\n\u003Cp\u003ECorrect me if I\u0027m wrong. My understanding after I read this post is somewhat shattered.\u003C/p\u003E\u003Cp\u003EI tried my best to express my beliefs of why airplanes fly in MS Paint (forget my madskillz), but I always thought that lifting force is produced by this (not to scale):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://dumpt.com/img/files/1bh326a81s51ecwsyw1g.png\u0022 alt=\u00221bh326a81s51ecwsyw1g.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHave I been wrong all along?\u003C/p\u003E\n"},{"CreatedByName":"Bryce Ring","CreatedById":129673,"CreatedDateTime":"2015-02-05T15:40:41Z","Content":"\n\u003Cp\u003ESadly yes. the shooting bullets at a wing action reaction is not all there is to it. there is an element to that theory that is close to what is happening but the major effect that causes lift is the pressure differential between top and bottom.\u003C/p\u003E\u003Cp\u003E this thought you showed can touch on how air pressure below the wing can be higher than the un effected air at same height but you need to include viscosity in the thoughts to get a better understanding of how the high pressure is created. but it is not the greater of the two. the greater cause for the differential air pressure is the low air pressure region above the wing.\u003C/p\u003E\u003Cp\u003E remember its not because the air accelerated that the air pressure was lowered. it was because the air had some where to go with less resistance that its path appeared to have changed and this is the acceleration. the effect of a low pressure region caused lift and acceleration. not the acceleration causing low pressure and lift.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T15:45:38Z\u0022 title=\u002202/05/2015 03:45  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by Bryce Ring\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-02-05T16:13:34Z","Content":"\n\u003Cp\u003EP51 empty weight: ~3500 kg\u003C/p\u003E\u003Cp\u003ESo, one needs to generate about 35 kN of force to counteract gravity.\u003C/p\u003E\u003Cp\u003EAir density = 1.225 kg/m^3\u003C/p\u003E\u003Cp\u003EP51 wing area ~22 m^2\u003C/p\u003E\u003Cp\u003EWingspan ~11.3 meters\u003C/p\u003E\u003Cp\u003EAverage chord is thus ~ 0.5 meters\u003C/p\u003E\u003Cp\u003ELets assume a 10 degree angle of attack... then the wing has a frontal area of with 11.3 *0.5sin(10) = ~0.4 square meters at an AoA of 10 degrees (I dont know what the critical AoA is, so its a guess)\u003C/p\u003E\u003Cp\u003ENow, when we double speed, we roughly double the velocity that it is deflected downward, and we double the mass of air that is deflected downward per second, to generate 2^2 more lift. The V^2 relationship is explained.\u003C/p\u003E\u003Cp\u003EIf we assume all the air is deflected at the same angle as the wing (not sure that is a good measure) - 10 degrees down. Then the velocity that is get directed down would be v*sin(10).\u003C/p\u003E\u003Cp\u003EThe mass of air deflected per second would be v*0.4*1.225kg\u003C/p\u003E\u003Cp\u003EIt would thus deflect v^2 * 0.4 *1.225 kg*m/s/s\u003C/p\u003E\u003Cp\u003Eie v^2 * 0.5N\u003C/p\u003E\u003Cp\u003EWe need 35,000 N....... 70,000= v^2 V= 264 m/s ..... hmmmm thats way too high.... there must be something else going on.\u003C/p\u003E\u003Cp\u003ELets assume elastic collisions, perfectly parallel airflow, 20 degree AoA... individual particles are then deflected down at 40 degrees (something tells me this is more descriptive of supersonic flow)\u003C/p\u003E\u003Cp\u003EThe frontal area is 11.3 * 0.5 sin (20)= 1.93 m^2\u003C/p\u003E\u003Cp\u003EWe deflect 1.93V m^3/second, and its deflected down at v*sin 40= 0.6427V m/s\u003C/p\u003E\u003Cp\u003EThus the air deflected downwards is 1.93 *0.643 * 1.225 * V^2\u003C/p\u003E\u003Cp\u003E1.52 V^2 = 35,000....... yea, this isn\u0027t going to work... 151 m/s is needed\u003C/p\u003E\u003Cp\u003E1 atmosphere = 101.1 kN per M^2\u003C/p\u003E\u003Cp\u003E22 square meters, 35 kN needed...\u003C/p\u003E\u003Cp\u003E1.6 kN needs to be generated per square meter, this is roughly a 0.015 atm pressure difference.... hmmm.... well, so far I can\u0027t see any glaring reason to declare you wrong... I\u0027ve just heard that the Bernoulli stuff they\u0027re teaching is BS.... but I\u0027m going to have to sit this one out and let someone else argue against it... I\u0027m a bit stumped.\u003C/p\u003E\n"},{"CreatedByName":"Bryce Ring","CreatedById":129673,"CreatedDateTime":"2015-02-05T16:42:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENow, when we double speed, we roughly double the velocity that it is deflected downward, and we double the mass of air that is deflected downward per second, to generate 2^2 more lift. The V^2 relationship is explained.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have never heard this so well put. I have always understood that there is a V^2 component to force, but I never really understood with such great mental pictures as to why, I had always Just accepted it as magic lol.\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003EPS I was curious as to the 151m/s being expressed as 151m/s^2 was that just a mistype ? the ^2 part on the end bit ?\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-02-05T17:16:25Z","Content":"\n\u003Cp\u003EI don\u0027t know, I didn\u0027t write the 151m/s^2....\u003C/p\u003E\u003Cp\u003EI\u0027m very surprised we both ended up with the number 151... since I was rounding and somewhat randomly picking/guessing reasonable numbers....\u003C/p\u003E\u003Cp\u003EI don\u0027t know his calculations, I think its a coincidence.\u003C/p\u003E\u003Cp\u003EAs to the V^2 relationship... thats how I understand it... the force is due to the mass that is deflected * the velocity it is deflected, and both are proportional to the velocity of the air, so V^2 comes out\u003C/p\u003E\n"},{"CreatedByName":"Bryce Ring","CreatedById":129673,"CreatedDateTime":"2015-02-05T17:35:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003Enot only does the acceleration of the air create a low pressure area above the wing, it also accelerates the air downwards, taking advantage of Newtons third law (for every action there is an equal and opposite reaction), as the wing accelerates the air down it in turn is accelerated upwards. This is a good image showing how the air is directed downwards. This is what causes the downwash of air trailing behind the wing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethis part needs to be addressed.\u003C/p\u003E\u003Cp\u003Eair accelerates as a consequence to the pressure gradient.\u003C/p\u003E\u003Cp\u003Ea pressure gradient can be created by different means, but as for a wing it is the appearance of a void on the top side that causes it.\u003C/p\u003E\u003Cp\u003Ethe air is accelerated downwards as a consequence to the pressure gradient.\u003C/p\u003E\u003Cp\u003Eits hard to measure the amount of force absent from the top side of the wing by looking at the amount of air that was caused to accelerate downwards due to the height of the area effected and the differences velocity change with height.\u003C/p\u003E\u003Cp\u003E air accelerates as a consequence to the pressure gradient.\u003C/p\u003E\u003Cp\u003E the pressure differences on the wing result in lift, the pressure differences around the wing change the velocity of the air. but if that air above the wing did not come down the lift would still be there, IE if you flew a wing inches from a ceiling you would have no air from above to accelerate down, but you would actually have more lift.\u003C/p\u003E\u003Cp\u003E this is in response to the above clip of you post. My possibly wrong assumption is that the whole paragraph is talking about the air above and its acceleration downwards. I was thinking you are suggesting that because the air above the wing accelerated downwards the Newtonian action reaction principle could be applied.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EI don\u0027t know, I didn\u0027t write the 151m/s^2....\u003Cp\u003E I\u0027m very surprised we both ended up with the number 151... since I was rounding and somewhat randomly picking/guessing reasonable numbers....\u003C/p\u003E\u003Cp\u003E I don\u0027t know his calculations, I think its a coincidence.\u003C/p\u003E\u003Cp\u003E As to the V^2 relationship... thats how I understand it... the force is due to the mass that is deflected * the velocity it is deflected, and both are proportional to the velocity of the air, so V^2 comes out\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E yes you are right. lol I did not check who the 151 figure was coming from in the first instance. It was actually from Bill Phil \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/109651-Fundamental-basics-of-lift?p=1716268\u0026amp;viewfull=1#post1716268\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/...=1#post1716268\u003C/a\u003E my mistake.\u003C/p\u003E\u003Cp\u003E Getting tired now. I will think more about the V^2 relationship\u003C/p\u003E\u003Cp\u003E Maybe K^2 knows how to explain it to the simple minded such as me ...\u003C/p\u003E\u003Cp\u003E I will probably be thinking all day tomorrow about lead balls dropping at different heights into Clay.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T17:39:11Z\u0022 title=\u002202/05/2015 05:39  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by Bryce Ring\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-02-05T17:53:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003ESo what else is happening, \u003Csub\u003Ewell the main function of a wing isn\u0027t to create a difference in pressure that pushes the wing upwards, instead the main function is to \u003C/sub\u003Enot only does the acceleration of the air create a low pressure area above the wing, it also accelerates the air downwards, taking advantage of Newtons third law (for every action there is an equal and opposite reaction), as the wing accelerates the air down it in turn is accelerated upwards.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA question that you should consider in context of your explanation: How does an airfoil test section that spans the full width of a wind tunnel (from wall to wall) produce lift? There is no downwash from an infinite aspect ratio wing (as approximated by an airfoil test section that spans the full width of a wind tunnel). A finite aspect ratio wing that generates a downwash actually produces less lift per unit span than an infinite span wing that doesn\u0027t. How is this possible given your explanation? Does this point to an error in your understanding or can you reconcile the difference?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EIf this were true, the maximum pressure differential between the top and the bottom of the wing could only be 1 atmosphere.\u003Cp\u003EI think you\u0027ll have a hard time explaining a V^2 relationship between velocity and lift by bernoillis principle.\u003C/p\u003E\u003Cp\u003EYou\u0027ll also have a hard time(ie, you can\u0027t do it) arriving at the correct lift consiering the AoA.\u003C/p\u003E\u003Cp\u003EMoreover, if this were right, flight characteristics would mainly depend on the atmospheric pressure, not atmospheric density.\u003C/p\u003E\u003Cp\u003EAny pilot fit to fly can tell you that stall speed increases on hot days relative to cold days.\u003C/p\u003E\u003Cp\u003EHot, less dense air provides less lift than colder, denser air, even if the air pressure is the same.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t confuse static pressure and dynamic pressure. Dynamic pressure is a function of velocity squared and density.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-05T21:05:05Z","Content":"\n\u003Cp\u003EI was calculating it as a function of force so I resulted in 151 m/s^2 downwards.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2015-02-05T22:29:58Z","Content":"\n\u003Cp\u003EYou can\u0027t say it\u0027s any one force or principle that causes a plane to soar. I know flight instructors who teach every student the Bernoulli doctrine like gospel. I\u0027ve seen books that say the airflow connects again at the trailing edges; They don\u0027t. I had a Professor in college who said lift was caused by air \u0022tripping\u0022 over itself as it passed over a wing in an attempt to explain the coanda effect; If I\u0027m not mistaken, the lack of separation of the boundary-layer is not caused by the coanda effect (I don\u0027t think it has anything to do with the viscosity of the layer at all). On top of that explanation, the excuse I hear most often now is the Newtonian flow deflection theory about air being deflected downward off the trailing edge to create downwash; One sister theory I\u0027ve heard a lot is the one Cicatrix described where the air hits the bottom of an airfoil with a positive AoA and pushes it up. That\u0027s not lift, it\u0027s induced drag, and it\u0027s pulls my lift vector back to make it perpendicular with that downwash from the other guys theory.\u003C/p\u003E\u003Cp\u003EIn reality, lift is caused by a total combination of the laws governing the conservation of mass and momentum along with a lot of really intelligent math describing pressure and viscosity. If I\u0027m not mistaken, aircraft engineers combine it all into an equation with a Reynolds Number to get some fancy, fraction-of-accuracy result, but I can\u0027t remember the name of it (Neither could Google, apparently). All said and done, if you were to board my plane and ask me what made it fly, I\u0027d say money.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-02-05T23:13:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WestAir\u0022 data-cite=\u0022WestAir\u0022\u003E\u003Cdiv\u003EAll said and done, if you were to board my plane and ask me what made it fly, I\u0027d say money.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd fuel. And paperwork... but I digress.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WestAir\u0022 data-cite=\u0022WestAir\u0022\u003E\u003Cdiv\u003EI don\u0027t think it has anything to do with the viscosity of the layer at all\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELift has a lot to do with viscosity. The \u003Ca href=\u0022https://en.wikipedia.org/wiki/Kutta_condition\u0022 rel=\u0022external nofollow\u0022\u003Ekutta condition\u003C/a\u003E is imposed naturally when viscous fluids (i.e. air) flow over an object with a sharp trailing edge. All airfoils have sharp trailing edges, regardless of whether they are symmetrical, cambered or are composed of a single membrane that has no relevant thickness (like a sail). The Kutta condition requires there to be circulation about the airfoil that causes air to flow faster over one surface of the airfoil than it does over the other. That circulation manifests itself in the form of tip vortices trailing back from the tips of a finite wing. The tip vortices, in turn, result in downwash. An infinite aspect ratio wing doesn\u0027t have downwash because it doesn\u0027t have tip vortices. Induced drag is a function of downwash strength, which is why induced drag is greatest at high angles of attack and large flap deflections. High angles of attack and large flap deflections both generate higher circulation (and stronger tip vortices) than a clean wing experiences at low angles of attack.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2015-02-05T23:46:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EAnd fuel. And paperwork... but I digress.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHahaha. Actually paperwork keeps us on the ground a lot more often than it gets us in the air. I already know what\u0027ll happen when I go in tomorrow,\u003C/p\u003E\u003Cp\u003E\u0022It\u0027s ten minutes past departure... where\u0027s our paperwork?\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I find it\u0027s worse when a crew member calls out sick right at showtime; Dispatch never has the name of the replacement crew and we always end up waiting for an update. Good times.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003ELift has a lot to do with viscosity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAye. I was still talking about the coanda affect in that part of my ramblings, but you still get a gold star since I really wasn\u0027t familiar with the kutta condition.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2015-02-06T01:24:07Z","Content":"\n\u003Cp\u003EThanks for the explanations guys, I\u0027m just glad that there are people smarter than me able to explain the math behind it. \u003C/p\u003E\u003Cp\u003EBut I think the most important rule of aviation that I was ever taught is that when the weight of the paper work equals the weight of the aircraft it is ready to fly.\u003C/p\u003E\n"},{"CreatedByName":"Bryce Ring","CreatedById":129673,"CreatedDateTime":"2015-02-06T01:29:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EAnd fuel. And paperwork... but I digress.\u003Cp\u003EInduced drag is a function of downwash strength, which is why induced drag is greatest at high angles of attack and large flap deflections. High angles of attack and large flap deflections both generate higher circulation (and stronger tip vortices) than a clean wing experiences at low angles of attack.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou might want to think more about this.\u003C/p\u003E\u003Cp\u003EI know it is well versed that induced drag is from air spilling in from the wing tip.\u003C/p\u003E\u003Cp\u003EBut I would like to think more about the order of actions.\u003C/p\u003E\u003Cp\u003Ethe part I wish to address is.\u003C/p\u003E\u003Cp\u003E\u0022Induced drag is a function of downwash strength\u0022\u003C/p\u003E\u003Cp\u003Ecan I have you think about this suggestion.\u003C/p\u003E\u003Cp\u003EInduced drag is a function of force vectors acting on the wing that are not perfectly up (Opposite weight etc)\u003C/p\u003E\u003Cp\u003Eso what are the force vectors acting on the wing ? draw a wing and then draw many force vectors for each cm^2 of its surface. now sum up all the vectors into one total reaction (not worrying about CoG at this time) just one vector. break that vector down to two vectors . one being opposite flight path, the other being opposite weight.\u003C/p\u003E\u003Cp\u003EIt has been a while since I thought much about lift and stuff, am I missing something?\u003C/p\u003E\u003Cp\u003E\u0022Induced drag is a function of downwash strength\u0022\u003C/p\u003E\u003Cp\u003Estrength of downwash ? would the strength not be the same at high AoA? what are we talking about when we say strength ?\u003C/p\u003E\u003Cp\u003EI can understand that High AoA will result in the above visual I invited you to think about having a total reaction force with more rearward direction in its vector. this I would think would be due to the Angle of the surface area being acted upon by the air ? do the same drawing, and one thing you may notice is the number of vectors per cm^2 now pointing more rearward (relative to flight path).\u003C/p\u003E\u003Cp\u003EAre we talking about different things. lift induced drag and wing tip spill induced drag ? personally I am thinking that the only thing that wing tip spill does is increase the pressure above the wing and thus require you to increase your AoA to compensate. (and to a lesser degree lower the pressure below the wing)\u003C/p\u003E\u003Cp\u003ELower AoA are associated with faster flight. and thus the wing tip spill has less effective time to increase the air pressure above the wing.\u003C/p\u003E\u003Cp\u003EHigher AoA are associated with slower flight and thus the wing tip spill has more effective time to increase the air pressure above the wing.\u003C/p\u003E\u003Cp\u003ECan you see my conundrum ? or am I just losing it ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-06T01:42:22Z\u0022 title=\u002202/06/2015 01:42  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 6, 2015\u003C/time\u003E by Bryce Ring\u003C/strong\u003E\n\u003C/span\u003E\n"}]}