{"TopicId":98980,"ForumId":16,"TopicTitle":"Testing out anti-wiggle measures","CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2015-02-07T05:13:26Z","PageNum":1,"Articles":[{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2015-02-07T05:13:26Z","Content":"\n\u003Cp\u003EI have a few theories about how to reduce wiggle in large structures.\u003C/p\u003E\u003Cp\u003EFirst up is the test article. This is simple (9) of the Rockomax Jumbo 64 tanks in a T-shape using the radial BZ-52 125cm plates. The sagging is very obvious. The wobble takes a bit to go away when you move to the launchpad.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/EQwDp\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ESame test, but with the BZ-52 125cm radial plates welded to the center Jumbo-64 tank using UbioZur Welding Continued. Not a lot of change.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/XqRTc\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ESlight variation on the test, this time Rockomax 125cm to 250cm adapter plates have been welded to the central Jumbo-64 tank. This results in a very strong bond because the Jumbo-64 wing tanks are connecting to a 250cm node (the Rockomax adapter plate) instead of a 125cm node (BZ-52). There is some sag/wobble, but it is minimal even with four tanks on each side.\u003C/p\u003E\u003Cp\u003ESo there is a pretty big gain from using UbioZur Welding Continued to weld the radial BZ-52 units to the center tank and also weld the Rockomax Brand Adapter 02 to the unit.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/anM5b\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ENow for the Clamp-o-tron regular docking port. This test has (4) Jumbo-64 on each wing of the T, the regular docking ports are mounted on the previous test article with the central spine having Jumbo-64 -\u0026gt; BZ-52 -\u0026gt; Rockomax Brand Adapter 02 plate all welded together. The docking ports are not welded to anything.\u003C/p\u003E\u003Cp\u003ETest ended in failure as expected.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/7a1oM\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat if we weld a Clamp-o-tron to the Rockomax Brand Adapter 02 plate? The results are not much better, the connection between the two docking ports is still the weak point.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/dY8gb\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EUbioZur Welding helps, but the link between the docking ports is still the weakest link. Welding the 125-250cm adapter plate to the docking port really helps out though.\u003C/p\u003E\u003Cp\u003EThe real trick is to combine Kerbal Joint Reinforcement (KJR) with UbioZur Welding so that you have 250cm radial mounting points instead of just 125cm mounting points.\u003C/p\u003E\n"},{"CreatedByName":"SPA","CreatedById":136486,"CreatedDateTime":"2015-02-07T14:49:28Z","Content":"\n\u003Cp\u003Eor you could just use struts ;-;\u003C/p\u003E\n"}]}