{"TopicId":99538,"ForumId":16,"TopicTitle":"Advanced Grabbing Unit: What am I doing wrong?","CreatedByName":"AmoebaMan","CreatedById":137915,"CreatedDateTime":"2015-02-13T04:49:12Z","PageNum":1,"Articles":[{"CreatedByName":"AmoebaMan","CreatedById":137915,"CreatedDateTime":"2015-02-13T04:49:12Z","Content":"\n\u003Cp\u003EBefore I start, let me say that I\u0027m a noob. I picked up this game a few days ago. Best practice is not something I\u0027m currently concerned about.\u003C/p\u003E\u003Cp\u003EI recently sent out my first manned mission to the Mun\u0027s surface. I\u0027ve sent orbiters to both the Mun and Minmus previously, and returned them safely, but I\u0027d been wary about actual landing missions until now, out of fear that I wouldn\u0027t be able to pack enough fuel to bring my Kerbals home. Today, however, all that potential Science became too damn tempting (I\u0027m playing science mode), so I put together my biggest rocket yet and launched it into the sky.\u003C/p\u003E\u003Cp\u003EAnd, of course, didn\u0027t have enough fuel to bring my Kerbal and all his research back home. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot entirely, at least. I came close. Right now he\u0027s in a pretty slick orbit just about 1,700km above Kerbin, just chillin\u0027 with all that research. I probably wasted more fuel than I needed to on the approach and landing, but the fact of the matter is that right now he\u0027s stranded up there, just a few seconds of fuel short of a happy reunion with terra firma. I don\u0027t want to waste Science by transmitting his research, and I also don\u0027t want to leave him up there because space is lonely. So I mounted an operation to return him home.\u003C/p\u003E\u003Cp\u003EWhich, of course, was complicated by the fact that his lander wasn\u0027t designed for this kind of operation. It\u0027s got no docking ports (I don\u0027t actually even have them unlocked). All I\u0027ve got to work with is the Advanced Grabbing Unit, which I barely had enough Science to buy after a few pointless ground excursions on Kerbin sampling biomes and such.\u003C/p\u003E\u003Cp\u003E\u0022Whatever,\u0022 I thought, \u0022I can make this work. Send up a rocket with plenty of spare fuel, grab it with a Klaw, push it out of orbit, and let it fall to the ground.\u0022 I even made sure the booster/rescue rocket was unmanned so I could safely ditch it if necessary.\u003C/p\u003E\u003Cp\u003ESo I sent up the rescue rocket. Blue skies. Beautiful trajectories. Everything went perfectly. I intercepted the stranded lander within 300 meters. Lined up with the RCS thrusters, deployed the claw, drifted slowly towards my target, and...\u003C/p\u003E\u003Cp\u003E...bounced off.\u003C/p\u003E\u003Cp\u003EHuh? I did this in the asteroid retrieval tutorial, it should be...grabbing? Nope. Maybe too fast? No, to crooked? Wrong again.\u003C/p\u003E\u003Cp\u003EI\u0027ve been bumping at this Munar lander for the past half hour with this gorram Klaw trying to get it to latch on. The wiki page says I should only have to make contact. It ain\u0027t working.\u003C/p\u003E\u003Cp\u003ECan somebody help me out? I\u0027ve got plenty of liquid fuel, plenty of RCS, and \u003Cem\u003Eway\u003C/em\u003E more electricity than I need. I\u0027ve got no clue what\u0027s wrong here, and I\u0027d really like to get this buddy home. Or his research, at least...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EANSWERED: \u003C/span\u003E\u003C/strong\u003EApparently the Klaw can\u0027t grab things if it\u0027s approaching too slowly. I retried with an approach velocity of ~1.0-1.5m/s (as opposed to \u0026lt;0.5m/s previously) and it worked perfectly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-13T06:44:57Z\u0022 title=\u002202/13/2015 06:44  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 13, 2015\u003C/time\u003E by AmoebaMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2015-02-13T05:16:14Z","Content":"\n\u003Cp\u003EDid you \u0027arm\u0027 the claw through its right-click menu?\u003C/p\u003E\n"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2015-02-13T05:16:37Z","Content":"\n\u003Cp\u003EIt should work, you can confirm that on ground. As for your case, I suppose you just do another slower catch?\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-02-13T05:18:32Z","Content":"\n\u003Cp\u003ESounds like either a bug or you didn\u0027t arm it.\u003C/p\u003E\u003Cp\u003EDoes it look like a claw or a rounded fuel tank?\u003C/p\u003E\n"},{"CreatedByName":"AmoebaMan","CreatedById":137915,"CreatedDateTime":"2015-02-13T05:56:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexinTokyo\u0022 data-cite=\u0022AlexinTokyo\u0022\u003E\u003Cdiv\u003EDid you \u0027arm\u0027 the claw through its right-click menu?\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwhip\u0022 data-cite=\u0022Starwhip\u0022\u003E\u003Cdiv\u003ESounds like either a bug or you didn\u0027t arm it.\u003Cp\u003EDoes it look like a claw or a rounded fuel tank?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s definitely armed. Visibly looks like a claw once the canister opens.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SaturnV\u0022 data-cite=\u0022SaturnV\u0022\u003E\u003Cdiv\u003EIt should work, you can confirm that on ground. As for your case, I suppose you just do another slower catch?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m approaching at less than a tenth of a meter per second using RCS thrusters. I don\u0027t think it\u0027s physically possible for me to come on any slower.\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2015-02-13T06:12:54Z","Content":"\n\u003Cp\u003EThinking about it, I remember seeing somewhere that there was a minimum speed below which the klaw wouldn\u0027t grab (although I can\u0027t recall ever having experienced this myself). Perhaps try a slightly faster approach, rather than a slower one, and see if that helps?\u003C/p\u003E\n"},{"CreatedByName":"archnem","CreatedById":135259,"CreatedDateTime":"2015-02-13T06:37:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmoebaMan\u0022 data-cite=\u0022AmoebaMan\u0022\u003E\u003Cdiv\u003EI\u0027m approaching at less than a tenth of a meter per second using RCS thrusters. I don\u0027t think it\u0027s physically possible for me to come on any slower.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis might actually be your problem. With the klaw, I\u0027ve found that a faster approach is better (at least personally). I usually come in at 1-1.5 m/s.\u003C/p\u003E\n"},{"CreatedByName":"AmoebaMan","CreatedById":137915,"CreatedDateTime":"2015-02-13T06:43:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022archnem\u0022 data-cite=\u0022archnem\u0022\u003E\u003Cdiv\u003EThis might actually be your problem. With the klaw, I\u0027ve found that a faster approach is better (at least personally). I usually come in at 1-1.5 m/s.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDamned if that makes any sense to me, but it worked. Came on approach at exactly 1.0m/s and it hitched on the first try!\u003C/p\u003E\n"},{"CreatedByName":"Sidereus","CreatedById":135263,"CreatedDateTime":"2015-02-13T07:12:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmoebaMan\u0022 data-cite=\u0022AmoebaMan\u0022\u003E\u003Cdiv\u003EDamned if that makes any sense to me, but it worked. Came on approach at exactly 1.0m/s and it hitched on the first try!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEh, it makes a bit of sense. If pressure is what triggers the claw to close, then you need to have enough force to trip it. So going too slow wouldn\u0027t work.\u003C/p\u003E\n"},{"CreatedByName":"Vectura","CreatedById":119212,"CreatedDateTime":"2015-02-13T15:01:52Z","Content":"\n\u003Cp\u003EThink of it like this: the claw arms have to puncture into whatever they are grabbing, and they need some speed to do this (forgetting the fact that would be rather damaging irl)\u003C/p\u003E\n"}]}