{"TopicId":99658,"ForumId":20,"TopicTitle":"Landing on The Mun","CreatedByName":"lolski85","CreatedById":138004,"CreatedDateTime":"2015-02-14T15:05:25Z","PageNum":1,"Articles":[{"CreatedByName":"lolski85","CreatedById":138004,"CreatedDateTime":"2015-02-14T15:05:25Z","Content":"\n\u003Cp\u003EUsing MechJeb i\u0027m able to get in orbit then hoghmann I sometimes get near the mun but autoland never works. Could someone please help me actually land somehow with an explanation possibly?\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tweety","CreatedById":115567,"CreatedDateTime":"2015-02-14T15:22:46Z","Content":"\n\u003Cp\u003EUsing mechjeb as an info readout can sometimes be better. That said i have used it to teach me docking so I\u0027m not against it. Use the readout out for suicide burn. When you are in Munar orbit burn retrograde until your orbit \u0027intersects\u0027 the Mun then using the suicide burn readout go full throttle retrograde again so you dont splat the surface with kerbal remains. I used to burn a couple seconds before the readout said for a safety margin.\u003C/p\u003E\u003Cp\u003EMight make sense, also might not \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003ETweety\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-02-14T15:46:00Z","Content":"\n\u003Cp\u003ENote that once you\u0027re in your descent, you might have to burn a bit above retrograde.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-02-14T16:04:32Z","Content":"\n\u003Cp\u003Ethe trick to landing is to point at the surface retrograde marker and burn. Like Tweety said, use the suicide burn countdown after your initial de-orbit so that you don\u0027t go splat. Also, if you have a pilot of sufficient level (Or Mechjeb SASS capability) point to retrograde (for a kerbal make sure you\u0027re in surface mode on the navball, for mechjeb make sure you are in SUR mode) this will keep you pointed in the right direction as you fall.\u003C/p\u003E\n"},{"CreatedByName":"ColKlonk","CreatedById":137078,"CreatedDateTime":"2015-02-14T16:20:29Z","Content":"\n\u003Cp\u003EAs said..\u003C/p\u003E\u003Cp\u003EI lock onto Retrograde and start with a slow burn... at some time you\u0027ll be nearly vertical.\u003C/p\u003E\u003Cp\u003EAt this point I throttle down so my descent slowly reduces to minimum of 20ms. Reducing to around 10ms closer to the surface.\u003C/p\u003E\u003Cp\u003EAs you get to know your lander you can get it right so that your descent come to within 5ms just before the surface - reducing it to less than 1ms on landing.\u003C/p\u003E\u003Cp\u003EClose to the surface it\u0027s advisable to unlock Retrograde coz if you start going up, and as computers are stupid.. it\u0027ll flip you over - quite fun to watch..\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2015-02-14T16:27:08Z","Content":"\n\u003Cp\u003EThere are a plethora of tutorials all over the \u003Ca href=\u0022https://www.google.com/webhp?sourceid=chrome-instant\u0026amp;rlz=1C1ASRM_enUS556US556\u0026amp;ion=1\u0026amp;espv=2\u0026amp;ie=UTF-8#q=ksp%20land%20on%20mun\u0022 rel=\u0022external nofollow\u0022\u003Einternet\u003C/a\u003E. I also would not reccomend having MechJeb fly for you; it is better if you experiment and figure things out yourself. Try some YouTube tutorials or the in-game tutorials.\u003C/p\u003E\u003Cp\u003EThis \u003Ca href=\u0022http://imgur.com/xI9qsUg\u0022 rel=\u0022external nofollow\u0022\u003Einfo graphic\u003C/a\u003E may help.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-14T16:30:34Z\u0022 title=\u002202/14/2015 04:30  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 14, 2015\u003C/time\u003E by Tank Buddy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-14T16:29:22Z","Content":"\n\u003Cp\u003EThe best thing I can offer is to quicksave in orbit. Then just keep trying. Each failure will teach you something and only take a minute or two. After a half hour, you could have done 10-20 attempts and learned a TON.\u003C/p\u003E\u003Cp\u003EI actually successfully did my first Mun landing about a half hour after learning that quicksave was a thing. Before that, I almost gave up on the game entirely. After that... well I\u0027m still here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2015-02-14T16:48:44Z","Content":"\n\u003Cp\u003EOpen surface info. Switch speedometer to surface mode.\u003C/p\u003E\u003Cp\u003EPoint your ship retrograde, and burn until the surface info reader tells you your horizontal speed is 0 (or very low. In the mm/sec).\u003C/p\u003E\u003Cp\u003EAfter this you will drop straight down slowly. Now use the surface info altitude info (true, which tells you exactly how far you are from the ground) to make sure you touch down at less than 5m/s speed (vertical speed. Since your horizontal speed should stay basicly 0).\u003C/p\u003E\u003Cp\u003EDuring this phase of landing, point your ship exactly up (so the entire navball is blue. Or tell smart ASS to point UP).\u003C/p\u003E\u003Cp\u003EThere are more effcient ways to doing this, but that involves combining the steps into a single burn. That\u0027s more complicated\u003C/p\u003E\u003Cp\u003EQuicksave just before you start retrograde burn, so you can easely go back if you screw up. Alternativly, use alt-F5 to make a named save just before your attempt, and make a regular quicksave after every landing step.\u003C/p\u003E\u003Cp\u003EFinal tip: Try landing on Minmus, instead of on Mun. Minmus\u0027s lower gravity means it\u0027s easier to land, and the lower areas are perfectly flat, which means you don\u0027t have to worry about landing on an angle and tipping over.\u003C/p\u003E\u003Cp\u003EAnd if you DO tip over, you can still salvage your ship on Minmus, but on Mun you\u0027d be screwed\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-14T16:50:53Z\u0022 title=\u002202/14/2015 04:50  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 14, 2015\u003C/time\u003E by Sirrobert\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-02-14T18:12:21Z","Content":"\n\u003Cp\u003EIf you\u0027re determined to use Mechjeb, try and understand why it\u0027s failing. Is it burning the engine hard but crashing anyway? If so, check you actually have enough TWR for a Mun landing! Is it running out of fuel? Add more. Is it smacking into the ground despite having plenty of fuel and plenty of thrust? Maybe ask for help in the Mechjeb thread.\u003C/p\u003E\u003Cp\u003EKeep in mind that Mechjeb is an autopilot, it\u0027s not a magical I Win button. Mechjeb can and will crash your ships if you don\u0027t set it correctly.\u003C/p\u003E\n"},{"CreatedByName":"lolski85","CreatedById":138004,"CreatedDateTime":"2015-02-14T18:53:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EIf you\u0027re determined to use Mechjeb, try and understand why it\u0027s failing. Is it burning the engine hard but crashing anyway? If so, check you actually have enough TWR for a Mun landing! Is it running out of fuel? Add more. Is it smacking into the ground despite having plenty of fuel and plenty of thrust? Maybe ask for help in the Mechjeb thread.\u003Cp\u003EKeep in mind that Mechjeb is an autopilot, it\u0027s not a magical I Win button. Mechjeb can and will crash your ships if you don\u0027t set it correctly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was mostly using it to get me near enough to whichever planet or satellite i\u0027m interested in. I struggle using keys because i\u0027m using onscreen keyboard as I can\u0027t physically use a keyboard this seems simple enough to land. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2015-02-14T19:13:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lolski85\u0022 data-cite=\u0022lolski85\u0022\u003E\u003Cdiv\u003EI was mostly using it to get me near enough to whichever planet or satellite i\u0027m interested in. I struggle using keys because i\u0027m using onscreen keyboard as I can\u0027t physically use a keyboard this seems simple enough to land. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat might make the fine control required for soft touchdown very difficult.\u003C/p\u003E\u003Cp\u003EWhy doesn\u0027t autoland work though? It worked fine the last time I tried, which to be fair is a while ago, but still. Maybe there\u0027s something with your ship that makes Mechjeb think it can\u0027t land? Show us some screenshots, maybe we can figure something out\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-02-15T03:07:37Z","Content":"\n\u003Cp\u003ELanding through Mechjeb is a question about mod use, and so, moved to add-on affairs.\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2015-02-15T04:22:38Z","Content":"\n\u003Cp\u003EYou can also use the translatron for neat and easy touchdowns:\u003C/p\u003E\u003Cp\u003E1) Tick the \u0022kill horizontal speed\u0022 \u003C/p\u003E\u003Cp\u003E2) Choose \u0022Keep vertical speed\u0022\u003C/p\u003E\u003Cp\u003E3) Input the descent speed in negative number (just choose something safe like -50, then -10 or -5 when near the ground and -1 for the final touchdown)\u003C/p\u003E\u003Cp\u003EThat\u0027s the only thing I use MJ for while landing, the rest is better and safer when done by hand.\u003C/p\u003E\n"}]}