{"TopicId":99684,"ForumId":51,"TopicTitle":"F-0.2 - Tiny Personal Aircraft/Escape Pod","CreatedByName":"Mister Kingdom","CreatedById":105121,"CreatedDateTime":"2015-02-14T21:28:43Z","PageNum":1,"Articles":[{"CreatedByName":"Mister Kingdom","CreatedById":105121,"CreatedDateTime":"2015-02-14T21:28:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EDo you like planes?\u003Cp\u003EDo you like big planes? Ones that eclipse the sun when they fly over, ones that break the runway when they land? \u003C/p\u003E\u003Cp\u003EWell, you\u0027re in the wrong place, friend, for we\u0027re talking gliders. Small gliders. How small? How about \u0022Small enough to fit inside a MK.2 Cargo Bay\u0022? Is that small enough for you?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sESNeA2h.png\u0022 alt=\u0022sESNeA2h.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the F-0.2, and it\u0027s the smallest aircraft (so far) that we can possibly build. Gone are the frivolous luxuries of cockpits and jet engines! Gone is the hassle of full landing gear and the ridiculous notion of \u0027wheels\u0027! All that remains is bare bones, old fashioned, KSC-Brand efficiency!\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EF-0.2 Advertising, Honest Jeb\u0027s Pre-Loved Starship Emporium\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis resulted from both images online, and my constant attempts to find \u003Cem\u003Esomething\u003C/em\u003E to put in my multitude of cargo bays. My first idea (after the obvious \u0022BIG BOOM NOW\u0022) was some form of remote survey aircraft, sort of like the ones they used to have on zeppelins, but every attempt invariably ended with the aircraft lodged in the bay by the wings. So I gave up, until I stumbled across the idea of using the RCS engines for fuel on the forums. However, I have no idea why I\u0027m telling you this; this post isn\u0027t about what the craft \u003Cem\u003Eis\u003C/em\u003E, it\u0027s about what it can \u003Cem\u003Edo\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003ETurns out, it makes a pretty good formation flyer. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Evbadre.png\u0022 alt=\u0022Evbadre.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EPictured: \u0027Good\u0027 formation flying.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI expected that dropping the plane would be like dropping a bomb: it\u0027d stick to the back wall, and then fly out at high speed when I used Sepratrons. As it happens, I was wrong; the Sepratrons are unnecessary, and in fact don\u0027t work. It flies out perfectly well by yourself, and using about 10% throttle brings you in line with the \u0027mothership\u0027 (for the purposes of this experiment, a Komet with the engines off). So, suddenly, I had two planes in the air, and 3 KM to play with.\u003C/p\u003E\u003Cp\u003EOh boy.\u003C/p\u003E\u003Cp\u003E[QUICKSAVE]\u003C/p\u003E\u003Cp\u003EI started with something simple: catching the mothership. I only discovered my proximity to it after using around 80% of my fuel, so it crashed before I could get closer than 200 M.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fyDUcIm.png\u0022 alt=\u0022fyDUcIm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EPictured: Curses!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E[QUICKLOAD]\u003C/p\u003E\u003Cp\u003ESo, I decided to investigate further. I pull out of the bay, and attempt to keep pace with the aircraft. I pull up close, and go for some formation flying (\u003Cem\u003Epictured above\u003C/em\u003E) I make a few passes, which I forgot to screenshot, and then I crashed.\u003C/p\u003E\u003Cp\u003ESo, that was that. It was a minor thing, but I find minor things entertaining every once in a while. I actually made another variant, with wheels in place of skids, that takes off from the ground, but that one isn\u0027t as interesting as this one. Any further escapades will be posted up here. I don\u0027t imagine so, but if anyone wants the .craft file, I\u0027d be happy to supply.\u003C/p\u003E\u003Cp\u003EPeace!\u003C/p\u003E\n"}]}