{"TopicId":99714,"ForumId":51,"TopicTitle":"A little closer to home: Ridin\u0026#039; dirty on Minmus","CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-02-15T04:56:11Z","PageNum":1,"Articles":[{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-02-15T04:56:11Z","Content":"\n\u003Cp\u003EWith Duna\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/110143-Operation-New-Mexico-Flyer\u0022 rel=\u0022external nofollow\u0022\u003E\u0022New Mexico Flyer\u0022 fuel operation\u003C/a\u003E running smoothly and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/110525-Flirting-with-disaster-Design-oversight-and-poor-planning-conspiring-for-success-%28long!%29\u0022 rel=\u0022external nofollow\u0022\u003Erecovery of the three kerbalteers after a mission nearly gone awry\u003C/a\u003E, it was time for a little something different. Perusing the contracts for something interesting, I found the usual fare. Send a probe into this orbit with no useful instruments, build a station supporting eighteen kerbals and fly it into Kerbol orbit never to be seen again, go tell us what the grass looks like over there, send a base to this desolate rock, etc. Closer inspection of the desolate rock base contract revealed an unusual clause: Base must be on wheels. Interesting. Intriguing even. \u003Cem\u003EChallenge accepted!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe \u0022Ark\u0022 project quickly came into being, and a suitable base was constructed. Rigorous testing was performed and it was discovered that Ark could be blown up in numerous ways, mostly involving high speed. Monopropellant engines were added to help keep the wheels on the ground, a karbonite distiller and two drills were installed so Ark could manufacture it\u0027s own RCS fuel, and the mission was a go. A new Kerbal crew was hired, consisting of a Pilot, an Engineer, and two Scientists. Manned and ready, Ark launched for Minmus.\u003C/p\u003E\u003Cp\u003ELanding was a touch awkward, but nothing exploded. After ditching the extra landing bits, science was gathered and the crew set off to drive up the nearest incredibly steep hill. Ark perfomed well, actually better than expected from testing. There was one hitch, as usual due to engineering oversight. A certain engineer (me) forgot to refill the RCS tanks after emptying them to test fuel flow, meaning Ark didn\u0027t have fuel for it\u0027s stabilizing RCS engines. First objective would be to \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ewander around and hope to find\u003C/span\u003E carefully locate a Karbonite pocket and fill the tanks. This all went rather smoothly, the Ark only leaving the surface once or twice. A significant amount of science was gathered as well, as the Arks path took it through 4 different biomes(Flats, Slopes, Midlands, Lowlands). After cresting the first plateau and getting halfway up the second, Karbonite was found. Here the base was deployed on it\u0027s gear and drills were deployed, and the crew called it a day.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/dCmNU\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EIn keeping with changing things up a bit, I tossed out all saved rocket designs to replace them with cleaner and more standardized vehicles. The \u0022Armstrong I\u0022, a three-man Mun/Minmus excursion vehicle and the \u0022Aldrin I\u0022, a one-man Mun/Minmus excursion vehicle are as far as I\u0027ve gotten today. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/USvLL\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EA new SSTO is also being designed for a mission to Kerbins north pole, since I\u0027ve never been there. More on this in the coming days.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/8zL6v\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-15T05:00:24Z\u0022 title=\u002202/15/2015 05:00  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 15, 2015\u003C/time\u003E by Randazzo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jsisidore","CreatedById":137847,"CreatedDateTime":"2015-02-15T10:54:32Z","Content":"\n\u003Cp\u003EI like your space bus.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-02-15T13:28:03Z","Content":"\n\u003Cp\u003EThe vehicle looks like a cute bug. I like it.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-02-15T19:51:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jsisidore\u0022 data-cite=\u0022jsisidore\u0022\u003E\u003Cdiv\u003EI like your space bus.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EThe vehicle looks like a cute bug. I like it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is reminiscent of a little bug climbing up a hill \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}