{"TopicId":99906,"ForumId":32,"TopicTitle":"Why do rovers suck so much?","CreatedByName":"ShadowZone","CreatedById":112420,"CreatedDateTime":"2015-02-17T10:53:11Z","PageNum":7,"Articles":[{"CreatedByName":"Octa","CreatedById":140058,"CreatedDateTime":"2015-11-18T08:45:11Z","Content":"\nRovers would be way more useful if the penalty for transmitting science would be much lower. For me, using a rover (small automatic ones like on mars) or probes for exploration is roleplay only, but it\u0026#39;s not useful gamplay wise. Why again is it more useful to send a kerbal to have a look at a thermometer than to send a few bits and bytes through the ether?\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nLets say 10 bit for the temperature, 32 bit for coordinates, 16 bits for attitude and for the sake of getting an even number 6 bit for several flags makes 64 Bit . Even Voyager can handle that (from googling i found that it sent with 21 kbps from neptun).\u003Cbr\u003E\nDoing kerballed missions only is way more effecient gameplay wise. I never did it but i guess it\u0026#39;s pretty \u0022easy\u0022 to do a kerballed duna return mission without leaving Kerbins SOI once before, somwhere in the middle of the tech tree. Please tell me if this is undoable, but from what i see what some players can do, that\u0026#39;s not totally of the grid to me.\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2015-11-18T09:32:33Z","Content":"\nRovers are deadly contraptions because of the way how the wheels work.\u003Cbr\u003E\n\u003Cbr\u003E\nThey are not really wheels but parts that have no friction as I understand them.\u003Cbr\u003E\nThey also might have suspensions but they only generate force when they are perfectly attached to the ground, which causes Rovers to dance around and flip over even at moderate speeds if not all 4 tires are on the ground.\u003Cbr\u003E\n\u003Cbr\u003E\nI am hopefull that this behavior will change drastically with unity5 and harvesters improvements.\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-11-18T12:59:30Z","Content":"\n[quote name=\u0027MalfunctionM1Ke\u0027]Rovers are deadly contraptions because of the way how the wheels work.\u003Cbr\u003E\n\u003Cbr\u003E\nThey are not really wheels but parts that have no friction as I understand them.\u003Cbr\u003E\nThey also might have suspensions but they only generate force when they are perfectly attached to the ground, which causes Rovers to dance around and flip over even at moderate speeds if not all 4 tires are on the ground.\u003Cbr\u003E\n\u003Cbr\u003E\nI am hopefull that this behavior will change drastically with unity5 and harvesters improvements.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nIt will! The plugin they used has physics akin to a driving sim. It\u0026#39;s going to be so much fun! I just hope it does not effect bearings.\n"},{"CreatedByName":"DancesWithSquirrels","CreatedById":138267,"CreatedDateTime":"2015-11-18T18:03:45Z","Content":"\nMy 0.02 cents contribution:\u003Cbr\u003E\n\u003Cbr\u003E\n* Docking mode or remap controls to avoid rotational inputs.\u003Cbr\u003E\n* Keep SAS on, it greatly minimizes flips when bouncing. Just tap \u0026#39;F\u0026#39; every once in a while when the slope under your rover changes. \u003Cbr\u003E\n* Landing legs for flipping are good, although I have to really bang around in the SPH to figure out the right leg layout. \u003Cbr\u003E\n* Use trim to set your speed - Alt-W and Alt-S put on a constant throttle.\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;ve played around a bit with additional suspension elements to keep the wheels more on the ground over rough terrain, and to take bigger shocks - the simplest effective suspension I\u0026#39;ve found so far is along the lines of this video by woodrunner51:\u003Cbr\u003E\n\u003Cbr\u003E\n[video=youtube;0lq5L3gfadw]https://www.youtube.com/watch?v=0lq5L3gfadw[/video] \u003Cbr\u003E\n\u003Cbr\u003E\nThis uses a couple of clamp-o-tron jr\u0026#39;s to hold an axle, on which you\u0026#39;ve placed your wheels, and I\u0026#39;ve found it fantastic for wheel durability as well as minimizing those random flips when crossing terrain polygons.\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-11-18T21:51:11Z","Content":"\n[quote name=\u0027Majorjim\u0027]It will! The plugin they used has physics akin to a driving sim. It\u0026#39;s going to be so much fun! I just hope it does not effect bearings.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nYeah, just basic functionality can be incredibly versatile in a game like KSP if well implemente, just look at the silly things people do with the new water upgrade! Can\u0026#39;t wait for the wheels, who knows, maybe my aircraft carriers gonna go amphibian...\n"},{"CreatedByName":"Xuixien","CreatedById":149208,"CreatedDateTime":"2015-11-19T01:08:27Z","Content":"\n[quote name=\u0027Van Disaster\u0027]Look a little harder:\u003Cbr\u003E\n\u003Cbr\u003E\n[URL]https://www.youtube.com/watch?v=QQi9_K7FBrM[/URL]\u003Cbr\u003E\n\u003Cbr\u003E\nFairly sure someone 1.0-ized it, if not then a new one is being built anyway.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nWhat mod is that, and is there a way to do it without a huge ugly box on the side of the craft?\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2015-11-19T01:41:54Z","Content":"\nThere is actually throttle control in stock. You know how you can trim aircraft so that there\u0026#39;s a bias with no user input? The same trim setting can be used with rover so that the accelerator is held down without you pressing the key.\u003Cbr\u003E\n\u003Cbr\u003E\nI used this once with an Eve rover, I drove it with cruise control 80km from its landing site to the nearest coast for a dip in the ocean before driving another 90km uphill to meet up with the return vehicle that landed separately on a mountain top:\u003Cbr\u003E\n\u003Cbr\u003E\n[img]http://105.imagebam.com/download/LmqgPAvEUBU3x2Q2tJIH_w/25596/255950514/screenshot1209.jpg[/img]\u003Cbr\u003E\n\u003Cbr\u003E\n[img]http://105.imagebam.com/download/YUG5lHCnOPOavXro5I35Rw/25596/255950544/screenshot1232.jpg[/img]\u003Cbr\u003E\n\u003Cbr\u003E\n[img]http://108.imagebam.com/download/uoM9588rs2_-7AuV2RhHdQ/25596/255950667/screenshot1397.jpg[/img]\n"}]}