{"TopicId":101638,"ForumId":32,"TopicTitle":"An old blog post.","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-09T22:25:22Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-09T22:25:22Z","Content":"[http://forum.kerbalspaceprogram.com/entries/747-The-Making-Of-New-KSC](https://forum.kerbalspaceprogram.com/entries/747-The-Making-Of-New-KSC)\n\nAny of you who weren\u0027t around before 0.21 need to read this. And also everyone else. The design part about KSC isn\u0027t *that* interesting, the important part is around the bolded line **\u0022It\u0027s not Kerbal?\u0022**"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-03-09T22:27:43Z","Content":"Oh, yeah, I\u0027ve read that one before. Very, very interesting and informative. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI remember when those new buildings had everyone super-hyped up."},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-09T22:59:49Z","Content":"\u003E \n\u003E As we aren\u0027t developing a Martian rebellion simulator with building destruction (for now, at least)\n\nSo I found this ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\n(I won\u0027t get into how I find the texture quality on destroyed buildings and even low-tier buildings fairly sub-optimal, I swear I won\u0027t do it. Even though there are glitchy, transparent textures that are gritty and... I swear I won\u0027t get into that)\n\n- - - Updated - - -\n\n\u003E \n\u003E Initially I have intended to use decals, like ones used on vertical surfaces of the buildings for AO and highlights such as the ones used on the SPH floor for all those lines. But exterior ground surface has one important difference: it\u0027s being observed from insane range of distances, from extreme close ups when Kerbals traverse the place on foot to dozens of kilometers in flight. Tests, though, have demonstrated that writing a decal shader that would be reliably sorted properly over that whole range is nearly impossible.\n\nHeh. Problems with floating decals. Just like the floating yellow lines in the Tier 2 VAB."}]}