{"TopicId":103875,"ForumId":32,"TopicTitle":"Squadcast Summary (2015-04-11) - Arrangement Of S.H.I.E.L.Ds Edition!","CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-04-11T00:48:13Z","PageNum":7,"Articles":[{"CreatedByName":"JedTech","CreatedById":104003,"CreatedDateTime":"2015-04-12T22:57:27Z","Content":"\u003E \n\u003E I hope the new aero wont be as rocket-flippy as NEAR and FAR are. I want to keep it realistic but I suck at building rockets in realistic aero. They are also the reason i stick to sending stuff in spaceplanes more.\n\nI\u0027m not entirely sure which crowd squad is trying to please with the new aerodynamics. I\u0027m thinking that the newbies will find it hard, and the realism folks will install FAR. \n\nDon\u0027t they have use cases and user persona\u0027s? If they did, I doubt this feature would have been implemented as described.\n\n**Edited \u003Ctime datetime=\u00222015-04-12T23:00:42Z\u0022 title=\u002204/12/2015 11:00  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 12, 2015\u003C/time\u003E by JedTech**"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-04-12T23:06:51Z","Content":"\u003E \n\u003E I\u0027m not entirely sure which crowd squad is trying to please with the new aerodynamics. I\u0027m thinking that the newbies will find it hard, and the realism folks will install FAR. \n\u003E Don\u0027t they have use cases and user persona\u0027s? If they did, I doubt this feature would have been implemented as described.\n\nWell, you can always clone me like... 20 times, and you\u0027ll get that crowd."},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-04-12T23:09:04Z","Content":"\u003E \n\u003E I hope that the advanced aerodynamics don\u0027t become a stumbling block to kids wanting to learn about orbital mechanics. I know I didn\u0027t buy this game because I wanted an aerodynamics simulator.\n\nYea, since aerodynamics is *useless* in space flight just remove the \u0022Launch\u0022 button and place a \u0022Go to Orbit\u0022 one."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-04-12T23:32:49Z","Content":"\u003E \n\u003E Now: Ooops, I turned too early and everything blew up.\n\nThat happens with 0.90 stock air too. It\u0027s just less pronounced. And soupier.\n\nAnyhow, they\u0027re typically doing that idiotic \u0022straight up until 40km and then turn to horizon\u0022 crap, which works in FAR too. (and by works, I mean, \u0022isn\u0027t any dumber than in stock\u0022)\n\nAlso since when was it pod\u002Btank\u002Bengine = space? That\u0027s usually \u0022boom\u0022 for newbies too ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n\u003E \n\u003E I hope the new aero wont be as rocket-flippy as NEAR and FAR are. I want to keep it realistic but I suck at building rockets in realistic aero. They are also the reason i stick to sending stuff in spaceplanes more.\n\nWhen in doubt, spam tailfins. They aren\u0027t strictly needed (especially for rockets built around 2.5m and 3.75m parts) but they can get you out of a jam if you\u0027re lost on how to proceed or have your drag all wonky."},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-04-12T23:38:42Z","Content":"\u003E \n\u003E I\u0027m not entirely sure which crowd squad is trying to please with the new aerodynamics. I\u0027m thinking that the newbies will find it hard, and the realism folks will install FAR. \n\u003E Don\u0027t they have use cases and user persona\u0027s? If they did, I doubt this feature would have been implemented as described.\n\nI don\u0027t see how making KSP challenging is somehow a bad thing. That\u0027s a big part of its charm.\n\nIt\u0027s not as if the current aerodynamics system was designed to appeal to \u0022newbies.\u0022 It was always just a hacked together placeholder.\n\n**Edited \u003Ctime datetime=\u00222015-04-12T23:44:12Z\u0022 title=\u002204/12/2015 11:44  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 12, 2015\u003C/time\u003E by GusTurbo**"},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2015-04-13T00:14:58Z","Content":"the situation with the recent developments (haven\u0027t seen the squadcast) for me is: squad wants to integrate features of 4 quite big mods. FAR/NEAR, Procedural Fairings, fuel-mining (Kethane/Karbonite/KSPI) and deadly reentry.\n\nthat is a fine idea, and honestly, I wonder why they don\u0027t add lifesupport to the bunch too (shouldn\u0027t be too hard).\n\nbut: the mechanics of those mods evolved within the last 2 years, they changed over time (someone wrote about the PITA of construcing fairings) and they got better. and now it\u0027s a hard task for squad to replicate the features of all 4 mod-systems, and being better than the modders. they\u0027ll of course bring their own ideas into the game, and the next few weeks will show how good those developments were. for us players, nothing really changes: the mods aren\u0027t gone, I\u0027m certain that they\u0027ll get an update to 1.0 and even beyond. like it was with kerbal joint reinforcement, where ferram told squad how to improve stability (with impressive results), yet KJR is still better than the stock structural system."},{"CreatedByName":"Kelvin Kerbin","CreatedById":116945,"CreatedDateTime":"2015-04-13T00:15:42Z","Content":"\u003E \n\u003E I hope that the advanced aerodynamics don\u0027t become a stumbling block to kids wanting to learn about orbital mechanics. I know I didn\u0027t buy this game because I wanted an aerodynamics simulator.\n\nKSP is about a lot more than just orbital mechanics, it\u0027s about design...for launch; orbital maneuvers; planet encounters; space construction; planet construction; etc... Assuming you are talking about a kid who is interested in learning about designing ships for orbital maneuvers, I would caution any kid who feels he is learning to design ships for orbital maneuvers without designing said ships for launch is fooling him/her self. It would be like designing planes to fly but not takeoff or land. Any kid ONLY interested in learning orbital mechanics can do so by running the in game tutorials. Those have ships already in space they can fly around all they want.\n\nLuckily, there is a pretty easy solution to gain the limited knowledge outlined. Installing the HyperEdit mod allows you to move a ship directly to orbit and skip the launch. Launch is pretty rote without proper aerodynamics and almost any crazy thing will go up so having a launch stage without aerodynamics is pointless from a \u0022learning\u0022 perspective (ignoring the absurdity of learning from a game). IMO, installing mods is much easier than designing things that work so hopefully this suggestion (if spread wide and far) would remove said stumbling block and would be considered a positive response to the proposed problem."},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2015-04-13T07:46:23Z","Content":"\u003E \n\u003E I\u0027m not entirely sure which crowd squad is trying to please with the new aerodynamics. I\u0027m thinking that the newbies will find it hard, and the realism folks will install FAR. \n\u003E Don\u0027t they have use cases and user persona\u0027s? If they did, I doubt this feature would have been implemented as described.\n\nThey don\u0027t want to release a space simulator/game where launching rockets it\u0027s the most unrealistic, laughable mess since the GTA 4 PC port."},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2015-04-13T07:59:55Z","Content":"^^\n\nhonestly, I found near to be quite nice. it allows to build rockets which look like rockets and which are fairly simple and cheap, and have a decent payload-capacity.\n\nfor example for a smaller probe: probe body, solar panels, some scientific instruments, antenna, a nosecone, fl-t 180 tank, lv 909, decoupler, bacc booster and fins.\n\nthat thing launches to space just fine, and has enough dv to do a decent amount of work. in stock, you would require at least an additional liquid stage, and mayme more than one bacc-booster. and launching that feels better..."},{"CreatedByName":"Jumpyyoza","CreatedById":129390,"CreatedDateTime":"2015-04-13T09:26:14Z","Content":"Wait, if we want to have more panels, do we just increase the symmetry?"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-04-13T14:33:44Z","Content":"\u003E \n\u003E I hope the new aero wont be as rocket-flippy as NEAR and FAR are. I want to keep it realistic but I suck at building rockets in realistic aero. They are also the reason i stick to sending stuff in spaceplanes more.\n\nBuild rocket with a TWR of 1.3~1.8. Tilt the rocket about 5deg when it reaches 75~80m/s. Follow prograde marker until out of the second atmosphere band. Adjust trajectory as desired once in third atmosphere band. As earlier stated, tail fins because KSP\u0027s engines lack the control authority they need. You\u0027ll never flip a rocket again.\nAnd jmanidb is correct, I will be installing the new FAR because I want that sort of detail. OTOH, I won\u0027t be embarrassed by the prospect of handing the stock game to my (or any other) kid anymore.\n\n**Edited \u003Ctime datetime=\u00222015-04-13T14:36:41Z\u0022 title=\u002204/13/2015 02:36  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by regex**"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-04-21T09:47:41Z","Content":"From the look of things, guys who are not paid do a better job than squad when it comes to things like aero, heat effects and fairings so I will continue to use their work. As well as saturatable wheels, realistic solar panels, kerbals with mass when in pods, rotation on rails and many other things.\n\nWill we still have utterly unrealistic chutes in 1.0 too?\n\nDon\u0027t get me started on clouds either.\n\nThank you to the makers of mods, you make the game acceptable instead of not."},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-21T12:59:10Z","Content":"\u003E \n\u003E I don\u0027t see how making KSP challenging is somehow a bad thing. That\u0027s a big part of its charm.\n\u003E It\u0027s not as if the current aerodynamics system was designed to appeal to \u0022newbies.\u0022 It was always just a hacked together placeholder.\n\nI agree.\n\nI started playing KSP because of the challenge. I was interested in space as a kid, but knew nothing about gravity turns or orbital mechanics. I had to learn to play. To say KSP is hard...I\u0027m not sure that\u0027s right. It requires knowledge and patience. I\u0027m also not a fan of the idea that \u0022New Player Friendliness\u0022 means easy."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-21T16:02:33Z","Content":"Oh hey, Max followed up on his comments about the decoupler bug:"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-04-21T16:03:06Z","Content":"\u003E \n\u003E Oh hey, Max followed up on his comments about the decoupler bug:"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-04-21T16:40:47Z","Content":"\u003E \n\u003E YEAH!!! No more self destruct staging!\n\u003E Also the sepatron industry is gonna take a hit. Sell your shares, quick!\n\nWhat self-destruct staging bug?\n\nThe only bug ive had issues with is the whole stack decouplers failing to stage both sides at once and needing like 3 hits of stage before everything decoupled. Is this what you mean by staging bug?"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-04-21T16:43:58Z","Content":"\u003E \n\u003E What self-destruct staging bug?\n\u003E The only bug ive had issues with is the whole stack decouplers failing to stage both sides at once and needing like 3 hits of stage before everything decoupled. Is this what you mean by staging bug?\n\nYou know when your boosters smash into your craft rather than move outwards? The one where you have to use separatrons or otherwise your stage is going to get smashed to bits That one.\n\nYay for no longer being forced to put separatrons on in order to stop them from smashing into your rocket on separation."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-04-21T16:51:46Z","Content":"\u003E \n\u003E What self-destruct staging bug?\n\u003E The only bug ive had issues with is the whole stack decouplers failing to stage both sides at once and needing like 3 hits of stage before everything decoupled. Is this what you mean by staging bug?\n\nIn Vanilla KSP (without Claw\u0027s fixes), if you decouple anything at speed (above uh.. 150m/s or thereabouts, and below 750m/s), an invalid torque is applied to the object.\n\nThis amazing piece of neo-classical art, worth billions of dollars, will explain:\n\n![DecoupleBug.png](http://alpha.renegrade.net/images/DecoupleBug.png)\n\nIn situation A, the decoupler is located below the CoM for a booster. When it decouples, a torque is generated around the booster\u0027s CoM in the correct direction (the magnitude is wrong, of course, but it\u0027s masked by the position somewhat).\n\nIn situation B, the torque should be reversed, but in stock, it is not for whatever broken reason. This is incorrect and bad physics.\n\nIt\u0027s present in all unpatched versions of KSP, but some types of rocket designs won\u0027t cause it (they decouple really early or really late), and a lot of users are --I\u0027mma be a bit blunt here--observationally challenged."},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-04-21T18:30:58Z","Content":"\u003E \n\u003E It\u0027s present in all unpatched versions of KSP, but some types of rocket designs won\u0027t cause it (they decouple really early or really late), and a lot of users are --I\u0027mma be a bit blunt here--observationally challenged.\n\nNot entirely correct - it was introduced in 0.24.1 as a result of trying to fix decoupling on the x64 version (inline decouplers also suffer from this incorrect application of force, but the effect is obviously inline and not as noticeable) and is somehow related to the krakensbane as the problem disappears after exactly 750m/s. When boosters decouple really early, there\u0027s negligible effect due the the low velocity. When the decouple really late, you\u0027re going faster than 750m/s so are unaffected."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-04-21T18:42:26Z","Content":"\u003E \n\u003E Not entirely correct - it was introduced in 0.24.1 as a result of trying to fix decoupling on the x64 version (inline decouplers also suffer from this incorrect application of force, but the effect is obviously inline and not as noticeable) and is somehow related to the krakensbane as the problem disappears after exactly 750m/s. When boosters decouple really early, there\u0027s negligible effect due the the low velocity. When the decouple really late, you\u0027re going faster than 750m/s so are unaffected.\n\nBy \u0022all unpatched\u0022 I meant like win32, win64(extinct in the wild), and linux, of 0.90 breed. Macintoshes don\u0027t actually exist, they\u0027re a hoax ( ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) ). I should have said \u0022all CURRENT unpatched KSPs\u0022. And by patched, I mean by Claw\u0027s fix.\n\nAnd yeah, it was introduced in the 0.24 era. Prior to that, there was a DIFFERENT decoupler bug, where strutting across a decoupler gave it effectively 0 force. The 0 force bug was less unpleasant, and the fix in my sig actually simulates it in 0.24.x onwards.\n\nYay for bugs! \\*waves a little flag\\*\n\n(I intentionally left out details on the why and how re: speeds as I\u0027m trying to cut back on walls of text, to ease people\u0027s eye burdens as well as RSI-related stuff. Don\u0027t encourage me! I\u0027ve hit the character limit before!)"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-04-21T18:52:08Z","Content":"\u003E \n\u003E By \u0022all unpatched\u0022 I meant like win32, win64(extinct in the wild), and linux, of 0.90 breed. Macintoshes don\u0027t actually exist, they\u0027re a hoax ( ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) ). I should have said \u0022all CURRENT unpatched KSPs\u0022. And by patched, I mean by Claw\u0027s fix.\n\u003E And yeah, it was introduced in the 0.24 era. Prior to that, there was a DIFFERENT decoupler bug, where strutting across a decoupler gave it effectively 0 force. The 0 force bug was less unpleasant, and the fix in my sig actually simulates it in 0.24.x onwards.\n\u003E \n\u003E Yay for bugs! \\*waves a little flag\\*\n\u003E \n\u003E (I intentionally left out details on the why and how re: speeds as I\u0027m trying to cut back on walls of text, to ease people\u0027s eye burdens as well as RSI-related stuff. Don\u0027t encourage me! I\u0027ve hit the character limit before!)\n\nI didn\u0027t realize that the bug was related to an attempted fix for the issue where struts canceled radial decoupler force. The new decoupler bug has been so much worse."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-04-21T19:05:51Z","Content":"\u003E \n\u003E I didn\u0027t realize that the bug was related to an attempted fix for the issue where struts canceled radial decoupler force. The new decoupler bug has been so much worse.\n\nWell, it was related to some win64 stuff that OWK mentioned - I dunno if it\u0027s related to the strut thing or not overall. It doesn\u0027t really matter though, the only thing is that radial decouplers have had bugs for as long as I\u0027ve been playing ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n(and yeah, the newer bug is a LOT worse than the zero-force one. The result of the zero-force bug is \u0022meh, that\u0027s lame\u0022, whereas the new one is \u0022ARGH WHY DID YOU KILL MY ROCKET SQUAD?\u0022)"}]}