{"TopicId":104116,"ForumId":32,"TopicTitle":"Why are Munar Polar Lowlands not actually lowlands?!","CreatedByName":"Silias","CreatedById":116950,"CreatedDateTime":"2015-04-14T16:18:13Z","PageNum":1,"Articles":[{"CreatedByName":"Silias","CreatedById":116950,"CreatedDateTime":"2015-04-14T16:18:13Z","Content":"\n\u003Cp\u003EBegin rant.\u003C/p\u003E\u003Cp\u003ERecently I installed SCAN Sat and noticed that Mun\u0027s Polar lowlands actually have the highest elevation of all the biomes!\u003C/p\u003E\u003Cp\u003EI\u0027ve searched the forums, KSP subreddit and did a general google search but found no explanation. Am I really the first to notice this?\u003C/p\u003E\u003Cp\u003EI find this extremely annoying.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E Not only the name is worng but it\u0027s also unrealistic since the equatorial radius of rotating planetary bodies should be larger than polar radius.\u003C/p\u003E\u003Cp\u003EEnd rant.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-04-14T16:38:58Z","Content":"\n\u003Cp\u003EIt\u0027s a side-effect of the conversion proces of heightmap to sphere. Even the most minute changes in elevation around the poles get exaggerated to the extreme. This is why the poles of practically every body in KSP have almost alien geometries to them.\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2015-04-14T17:44:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EIt\u0027s a side-effect of the conversion proces of heightmap to sphere. Even the most minute changes in elevation around the poles get exaggerated to the extreme. This is why the poles of practically every body in KSP have almost alien geometries to them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve known about this limitation for a while and just realized that I\u0027d been taking for granted that it is not fixable. I wonder if there\u0027s any way this could be smoothed out by the developers? Admittedly I haven\u0027t searched the forum for other discussions on this issue, so maybe it\u0027s already been hammered on.\u003C/p\u003E\n"},{"CreatedByName":"Silias","CreatedById":116950,"CreatedDateTime":"2015-04-14T20:26:33Z","Content":"\n\u003Cp\u003EMakes sense, I can finally get some sleep now:wink:. I guess the same thing is responsible for those strange ridges at Duna\u0027s poles. \u003C/p\u003E\u003Cp\u003EBut if this is unfixable the name should be changed to Polar Highlands:D.\u003C/p\u003E\n"},{"CreatedByName":"keeper","CreatedById":124530,"CreatedDateTime":"2015-04-14T21:48:02Z","Content":"\n\u003Cp\u003EI\u0027ve only done a few landings on poles and as rough as they are, they\u0027re not bad imo.\u003C/p\u003E\u003Cp\u003EI am yet to leave Kerbin influence.\u003C/p\u003E\n"}]}