{"TopicId":104728,"ForumId":32,"TopicTitle":"I keep quitting because of this one single reason.","CreatedByName":"Dragonchampion","CreatedById":115668,"CreatedDateTime":"2015-04-23T02:49:10Z","PageNum":1,"Articles":[{"CreatedByName":"Dragonchampion","CreatedById":115668,"CreatedDateTime":"2015-04-23T02:49:10Z","Content":"\n\u003Cp\u003EI can\u0027t make SSTOs. \u003C/p\u003E\u003Cp\u003ENo matter how hard I try I always fail, and badly. Again and again i fail, despite being able to make functional rockets, land on Duna, Eve, the Mun, Minmus... pretty much everywhere. It doesn\u0027t matter that I can make a damn good plane, It doesn\u0027t matter that I can get to the Mun with jut the first tier of parts, no. I can\u0027t make SSTOs.\u003C/p\u003E\u003Cp\u003EBecause of this, every single time I pick up the game and start playing, I end up quitting. I get to the point of the game where I should be using SSTOs, and see everyone else using them to conserve fuel, space and money, but when I get to that point I try again and again, failing over and over, until I finally get frustrated and quit. This has happened in .21, .23, .24, .9 when it first came out, and even now, when I came back to the game to try to get my basics down pat before 1.0 ups the difficulty with reentry heat.\u003C/p\u003E\u003Cp\u003EWhat should I do? What CAN I do? I\u0027ve tried looking at youtube videos, I\u0027ve tried installing mods to make the process easier, but no matter what my spaceplanes spin out from losing air, completely go ape...., or simply don\u0027t take off.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2015-04-23T02:55:14Z","Content":"\n\u003Cp\u003EMaybe have a look at \u003Ca href=\u0022http://kerbalx.com/\u0022 rel=\u0022external nofollow\u0022\u003EKerbalX\u003C/a\u003E?\u003C/p\u003E\u003Cp\u003EFilter your selection for stock\u002Bspaceplane\u002Bcraft, then try downloading a couple of craft files which have really high ratings [\u003Ca href=\u0022http://kerbalx.com/KSpaceAcademy/KSA%20Light%20Utility%20SSTO%20MkII\u0022 rel=\u0022external nofollow\u0022\u003E1\u003C/a\u003E, \u003Ca href=\u0022http://kerbalx.com/Vashts/Dodo%20C\u0022 rel=\u0022external nofollow\u0022\u003E2\u003C/a\u003E] and try them out yourself\u003C/p\u003E\u003Cp\u003EOnce you\u0027ve seen/found what you like/works for you in the comfort of your own game this will hopefully help you with your own own spaceplane designs\u003C/p\u003E\u003Cp\u003EBest of luck!\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-04-23T02:55:19Z","Content":"\n\u003Cp\u003ESpaceplanes, not SSTO (Single Stage to Orbit).\u003C/p\u003E\u003Cp\u003EI don\u0027t get it though, if you can\u0027t make spaceplanes, why fret about it... and you\u0027re a late join for 0.9 :S\u003C/p\u003E\u003Cp\u003EAre you trolling?\u003C/p\u003E\n"},{"CreatedByName":"Asharad","CreatedById":107448,"CreatedDateTime":"2015-04-23T02:56:04Z","Content":"\n\u003Cp\u003EI have 536 hours in game, and I have never made a spaceplane. I\u0027m having a blast without it.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-23T02:56:44Z","Content":"\n\u003Cp\u003ESSTOs are never essential to a space program. It\u0027s perfectly fine to have a rockets-only program. Bear in mind, SSTO jets may be one of the hardest things in the game to make. It took me way to many hours to build my first.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-23T02:57:07Z","Content":"\n\u003Cp\u003ENah, most people don\u0027t actually use SSTOs. No point, we got lots of money, and construction\u002Breentry takes faaaaaaaaaaaaaaaaaar to long as to make it a regular thing. It\u0027s a fun challenge to build and fly them, but that\u0027s about it.\u003C/p\u003E\u003Cp\u003ESounds like your usual problem is an asymetric flameout (engine on one site goes out at low oxygen while the other one still works). Easy way would be to use mechjeb and activate the \u0027prevent flameout\u0027 option.\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-04-23T02:58:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragonchampion\u0022 data-cite=\u0022Dragonchampion\u0022\u003E\u003Cdiv\u003EWhat should I do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESomething other than SSTOs.\u003C/p\u003E\u003Cp\u003ESeriously. I gave up on trying to get one to work, too. The next update is bringing a lot of changes. It might be worth waiting until then to try and figure it out. Anything you learn now is likely to be meaningless in 1.0.\u003C/p\u003E\n"},{"CreatedByName":"Kami_K220","CreatedById":135469,"CreatedDateTime":"2015-04-23T02:58:30Z","Content":"\n\u003Cp\u003EWait for 1.0!!\u003C/p\u003E\u003Cp\u003E All this will change. Should be for the better. The fuel flow logic is changing to keep a more stable CoM as well as no more asymmetric flame out. Also the new aero and stability guides in the SPH should be a welcomed change. In saying that we cant be certain that it will make it easier as atmospheric affects and changing ISP\u0027s will make it a big game changer.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-04-23T02:58:46Z","Content":"\n\u003Cp\u003EYou\u0027re not entirely alone, OP. I would never use an SSTO because they\u0027re pretty much a pipe-dream. I use conventional rockets all the way.\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2015-04-23T02:58:50Z","Content":"\n\u003Cp\u003EYou\u0027ve come to the right place! The community here can definitely help you out there. Could you start by posting some screenshots or a .craft of the best attempt you\u0027ve gotten so far?\u003C/p\u003E\u003Cp\u003EAlso, some general tips...\u003C/p\u003E\u003Cp\u003EAn SSTO plane that takes off horizontally (I\u0027m assuming this is what you mean by \u0022SSTO\u0022 as technically a rocket can be a SSTO also) can really benefit by starting off small. Take baby-steps and try to get to orbit with almost no payload at first, meaning, your goal is just to get a probe core or a pilot into orbit. Once you\u0027ve got that mastered, you can try to scale up, carry useful payloads, etc.\u003C/p\u003E\u003Cp\u003ESecondly, you\u0027d be surprised how easy it is to make an SSTO plane with just one rapier engine (and no other engines).\u003C/p\u003E\u003Cp\u003EThird, moar \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eboosters\u003C/span\u003E air intake spam! Careful, though. Some stuffy players think it\u0027s \u0022cheating\u0022 if you use more than \u0026lt;insert arbitrarily picked number here\u0026gt; air intakes per engine. So once you get a proof of concept, and if you give a crap what other people think (I don\u0027t), you can try to refine your design and take intakes off until it looks reasonable to you.\u003C/p\u003E\u003Cp\u003EFourth, you need to milk the atmosphere as much as possible. You do this by keeping your vertical ascent rate minimal while you pick up speed. If you get too high up, the air gets super thin and your engine(s) will choke. You can counteract this by throttling down. The crazy thing is, because there\u0027s less drag as well, you can actually continue picking up speed while ascending with low throttle! I\u0027ve gone as low as 25% throttle while still gaining orbital energy.\u003C/p\u003E\u003Cp\u003EAt some point you\u0027ll have to bite the bullet, pitch up, and switch to rockets. If you\u0027re using a rapier engine, I highly recommend using the tweakables to set it to MANUAL mode. Auto-switch to closed cycle (meaning no longer using air intakes) will make you miss out on milking the atmosphere (see my last paragraph).\u003C/p\u003E\u003Cp\u003EAlright, now let\u0027s see what craft you\u0027ve got so far!\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-23T03:02:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kami_K220\u0022 data-cite=\u0022Kami_K220\u0022\u003E\u003Cdiv\u003EWait for 1.0!!\u003Cp\u003E All this will change. Should be for the better. The fuel flow logic is changing to keep a more stable CoM as well as no more asymmetric flame out. Also the new aero and stability guides in the SPH should be a welcomed change. In saying that we cant be certain that it will make it easier as atmospheric affects and changing ISP\u0027s will make it a big game changer.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s actually a really good point, 1.0 should make the flight easier. Acceleration during early flight will also go a LOT faster because of the thinner atosphere, making it a faster and less frustrating thing.\u003C/p\u003E\u003Cp\u003EConstruction might get slightly harder. Or not, who knows.\u003C/p\u003E\n"},{"CreatedByName":"Dragonchampion","CreatedById":115668,"CreatedDateTime":"2015-04-23T03:13:41Z","Content":"\n\u003Cp\u003EWell, I\u0027m not really new to the forums, just mostly posted in the Modding section. To those who have stated about SSTOs not needing to be made: What about stuff that requires flybys? How do you land bases? How do you get MKS stuff landed on the ground without huge freighters?\u003C/p\u003E\u003Cp\u003EFel, I\u0027m not a troll, far from it. And as stated before I\u0027m not a late joiner, I\u0027ve been playing on and off because of this issue for around a year and a half now.\u003C/p\u003E\u003Cp\u003EFor my goal, I have this: \u003Ca href=\u0022https://www.dropbox.com/s/q8gz4d1g3w1tijp/Screenshot%202015-04-22%2023.01.35.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/q8gz4d1g3w1tijp/Screenshot%202015-04-22%2023.01.35.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI need the large tank on the back (Thus the name Hunchback) because of food, water, and air requirements due to TAC. I had planned for this ship to be the initator for a Minmus or Eve base. However, this one didn\u0027t even get off the ground, even when getting to the end of the runway.\u003C/p\u003E\u003Cp\u003EFiddling in creative mode, I made this: \u003Ca href=\u0022https://www.dropbox.com/s/ilvf9i2y1jnbg7v/Screenshot%202015-04-22%2023.04.38.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ilvf9i2y1jnbg7v/Screenshot%202015-04-22%2023.04.38.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis plane worked pretty well... until it started spinning around. I\u0027ll try turning my mechjeb to prevent burnouts, though. I didn\u0027t know there was an option to. Mechjeb is always the first thing I research, and I have an increased size research tree, so I feel it\u0027s fair. I spend 4000 science to get the best mechjeb, I deserve to be able to use it! Besides, I make sure to always learn how to control it by hand, first.\u003C/p\u003E\u003Cp\u003EAs you can see, my game is HEAVILY modded. I\u0027ve honestly forgotten which companies are stock and which aren\u0027t at this point. I do know however that that engine in the back of the first model is called the SABRE-M, which is a more powerful 2.5m version of the RAPIER. However, I switched from that because I realized that even with full fuel I only had 2200 deltaV, which would hardly be enough to get to Eve and back.\u003C/p\u003E\u003Cp\u003EI have thought about air intake spam, but I also am worried about weight, and also I don\u0027t know what the best ratio is. I have tried to figure it out but no one talks numbers.\u003C/p\u003E\u003Cp\u003EAs for everyone who says SSTOs aren\u0027t needed is this true? I haven\u0027t seen anyone really do anything WITHOUT SSTOs. All the pictures, all the videos, everything I have ever seen with showcases have shown off these awesome SSTO designs and spaceplane stuff.\u003C/p\u003E\u003Cp\u003EAs for the changes with 1.0, shouldn\u0027t I sit down and learn everything now when it\u0027s hard so that the learning new things will be easier? (reentry heat for instance)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-23T03:18:36Z\u0022 title=\u002204/23/2015 03:18  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 23, 2015\u003C/time\u003E by Dragonchampion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2015-04-23T03:18:13Z","Content":"\n\u003Cp\u003EPersistance. Keep at it and it will eventually click. If you get frustrated and fed up, step away from them for a spell. It has taken me nearly 2 years to get the hang of them. First is getting them airborne. Then landing them intact. Then getting them into space. Eventually when I finally get one into space I couldn\u0027t repeat it. AUUUUGGGHHH!\u003C/p\u003E\u003Cp\u003ESSTO\u0027s are THE hardest thing to build, for me at least, in KSP. \u003C/p\u003E\u003Cp\u003EFor a time I stuck them to the sides of rocket boosters to get them into orbit. I just recently successfully created a viable Mk-2 SSTO\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/HPV0TAHQILw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EYes it has a transfer stage, launched separately, but with it\u0027s own single LV-N rocket engine it can pretty much go anywhere by itself.\u003C/p\u003E\u003Cp\u003EFlyby\u0027s anywhere? Sure. Land and take off anywhere? No. It can only do that on Kerbin and Laythe. \u003C/p\u003E\u003Cp\u003EI haven\u0027t had any success with a Mk-3 but then I haven\u0027t really felt the urge to try. Rockets are my comfort zone.\u003C/p\u003E\u003Cp\u003EThen once 1.0 arrives you can toss everything out the window. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-23T03:46:19Z\u0022 title=\u002204/23/2015 03:46  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 23, 2015\u003C/time\u003E by Landge\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"archnem","CreatedById":135259,"CreatedDateTime":"2015-04-23T03:27:33Z","Content":"\n\u003Cp\u003EScale down! The \u0022trick\u0022 to spaceplanes (for me anyway) was to be absolutely minimalist in design. Don\u0027t put anything on your ship that doesn\u0027t absolutely have to be there.\u003C/p\u003E\n"},{"CreatedByName":"federicoaa","CreatedById":94879,"CreatedDateTime":"2015-04-23T03:34:04Z","Content":"\n\u003Cp\u003EScott Manley has a video tutorial on how to make one, I started by copying his concept to grasp a fell on how to make them, then it got much simpler\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-23T03:37:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragonchampion\u0022 data-cite=\u0022Dragonchampion\u0022\u003E\u003Cdiv\u003EWell, I\u0027m not really new to the forums, just mostly posted in the Modding section. To those who have stated about SSTOs not needing to be made: What about stuff that requires flybys? How do you land bases? How do you get MKS stuff landed on the ground without huge freighters?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou usually don\u0027t fly SSTOs to other planets. They are basically reusable rockets in form of a plane which can go back, land, and refund you all the cost. As for getting stuff to the ground, you just use just the normal landers\u002Brockets and/or parachutes. You need atmospheres for SSTOs, and then parachutes are a million times more usefull. \u003C/p\u003E\u003Cp\u003EMost spaceplanes don\u0027t have the capacity to go to other planets, especially with cargo, and there isn\u0027t really a point. Transport-motherships and parachutes/landers are a million times better.\u003C/p\u003E\u003Cp\u003EThe only real point to get planes to other planets is to easier explore them. Which is fantastic, but a purpose in itself. And you can only use jet engines on laythe, which means these planes have a very limited range.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-23T03:42:14Z\u0022 title=\u002204/23/2015 03:42  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 23, 2015\u003C/time\u003E by Temeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-04-23T03:41:28Z","Content":"\n\u003Cp\u003EI have been playing this game for 3 years, and have landed on all planets, and come back from most of them, built big stations, all that stuff. But in my 46 serious attempts (I number my designs, and so know the exact figure) to make an SSTO, only 3 have been able to reach orbit, only one of those could carry a cargo while doing so, and then an update broke that one. A practical SSTO plane and an Eve surface return are the only milestones I have yet to achieve in this game, and I\u0027ve been failing at both the whole time.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-23T03:48:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EI have been playing this game for 3 years, and have landed on all planets, and come back from most of them, built big stations, all that stuff. But in my 46 serious attempts (I number my designs, and so know the exact figure) to make an SSTO, only 3 have been able to reach orbit, only one of those could carry a cargo while doing so, and then an update broke that one. A practical SSTO plane and an Eve surface return are the only milestones I have yet to achieve in this game, and I\u0027ve been failing at both the whole time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally? What did go wrong? SSTOs aren\u0027t that hard to build, at least the \u0027kinda functional\u0027 ones.\u003C/p\u003E\n"},{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2015-04-23T03:48:43Z","Content":"\n\u003Cp\u003EDunno whats your guys problem with SSTO\u0027s. At last up to 0.25 they were dead easy if you knew what you are doing. 0.9 was a bit harder, there must have been balance adjustments. No idea how 1.0 will be. But the basic rules how to create a space plane will continue to be valid, no matter how realistic physics are now.\u003C/p\u003E\n"},{"CreatedByName":"Dragonchampion","CreatedById":115668,"CreatedDateTime":"2015-04-23T03:50:48Z","Content":"\n\u003Cp\u003EBut all the ones I have seen, including this, which I got especially to land MKS parts, looks like they are all SSTOs. (\u003Ca href=\u0022http://imgur.com/a/JQ3cE#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/JQ3cE#0\u003C/a\u003E) Do you have any expamples of freight rockets? Rockets that are able to deliver MKS parts? And how to I deliver them to a specific place?\u003C/p\u003E\u003Cp\u003EI\u0027m starting to think, from everyone\u0027s experiences, that I might have given too much credit to SSTOs...\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-04-23T03:51:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EReally? What did go wrong? \u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEverything, at one time or another. They don\u0027t always fail in the same way. The sole shared feature is that they fail.\u003C/p\u003E\n"},{"CreatedByName":"wolfedg","CreatedById":58442,"CreatedDateTime":"2015-04-23T03:52:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragonchampion\u0022 data-cite=\u0022Dragonchampion\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFor my goal, I have this: \u003Ca href=\u0022https://www.dropbox.com/s/q8gz4d1g3w1tijp/Screenshot%202015-04-22%2023.01.35.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/q8gz4d1g3w1tijp/Screenshot%202015-04-22%2023.01.35.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI need the large tank on the back (Thus the name Hunchback) because of food, water, and air requirements due to TAC. I had planned for this ship to be the initator for a Minmus or Eve base. However, this one didn\u0027t even get off the ground, even when getting to the end of the runway.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust Speculating, but it looks like the engines on that one are too high putting the center of thrust out of line with the center of mass. The result likely being that your engines are pushing down hard on the nose making takeoff and level flight impossible. Of course I cant tell with the mods you are using if those may just be intakes, but even then the structures up high may cause your com to be out of line with cot.\u003C/p\u003E\u003Cp\u003EAlso dont feel bad about your spaceplane attemps. I have only ever gotten a few designs into lko and every time they were running on fumes at the point of achieving a stable orbit, so pretty much useless except for perhaps space tourism.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-23T03:55:35Z\u0022 title=\u002204/23/2015 03:55  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 23, 2015\u003C/time\u003E by wolfedg\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2015-04-23T03:57:54Z","Content":"\n\u003Cp\u003EI only used SSTO\u0027s for LKO Kerbal rescues because it was neat, then recently for some survey missions where the survey points aren\u0027t too low.\u003C/p\u003E\u003Cp\u003EProbe\u002BCapsule on a lightest orbital manoeuvring stage you can manage flung up via an S1-SRB was a lot faster (no need to sit in the high atmosphere picking up speed like an SSTO) to orbit, and if you mounted the decoupler backwards so it stuck with the capsule, you were basically only loosing the SRB which is pretty cheap anyway (that\u0027s not going to work with re-entry damage though), then you can just plunk down anywhere \u0027close enough\u0027 to KSC for a descent recovery without needing a runway for touchdowns.\u003C/p\u003E\u003Cp\u003EThey\u0027re neat and different, but they have their own pros and cons for space deliveries\u003C/p\u003E\u003Cp\u003EWith the 1.0 update you might start getting significantly more mileage out of them due to re-entry damage though (if you can manage your ascent and re-entry properly that is)\u003C/p\u003E\n"},{"CreatedByName":"SpenSpaceCorp","CreatedById":98977,"CreatedDateTime":"2015-04-23T03:59:09Z","Content":"\n\u003Cp\u003EFailure is part of the learning curve; I would call it a failure if you did not fail and thus did not learn what you otherwise would have!\u003C/p\u003E\u003Cp\u003E\u0022You never fail until you stop trying\u0022 (Albert Einstein)\u003C/p\u003E\n"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2015-04-23T04:02:00Z","Content":"\n\u003Cp\u003EI haven\u0027t used MKS parts but can you just attach them as upper stages to rockets without having to carry them as cargo?\u003C/p\u003E\u003Cp\u003EAs far as sending bases to other planets...\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/mJuQh\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EOther ones with video can be seen in my sig...\u003C/p\u003E\n"}]}