{"TopicId":104968,"ForumId":32,"TopicTitle":"Ore drilling/fuel refining in 1.0 : a built-in cheat, or not a cheat?","CreatedByName":"tjsnh","CreatedById":108021,"CreatedDateTime":"2015-04-25T22:04:52Z","PageNum":4,"Articles":[{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-04-26T08:24:38Z","Content":"\u003E \n\u003E Would it be considered \u0022cheating\u0022 if NASA were to use the Mun to mine helium-3 and aluminium? Or perhaps the plan to mine a captured asteroid once we get one around the Earth is also cheating? Is the proposed Mars Direct mission cheating as well for using the atmosphere of Mars to produce methane-based fuel? Just because no space program has yet done something does not mean it\u0027s cheating. If that were the case, you\u0027d have to toss the RAPIER engine in the pile too.\n\n^This. ISRU is something that is regularly proposed and will probably one day happen in real life, even if its only a small scale test. Is it cheating if humans start mining other places for fuel?"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-04-26T08:28:09Z","Content":"\u003E \n\u003E So, I\u0027m watching the livestream on KSPTV where they\u0027re showing off 1.0. \n\u003E Roninpawn just demonstrated in-situ mining, using drill/refinery parts on minmus to generate fuel out of \u0022ore\u0022 (basically, out of nothing if you\u0027re landed and have done a little prep work). \n\u003E \n\u003E Am I the only one who sees this as basically cheating?\n\u003E \n\u003E I mean, I can see it adding another element to the game and simplifying refueling out around Jool instead of sending tankers, but it just seems like cheating/nerfing to me. Dramatically reduces the difficulty of things like the \u0022Jool 5 challenge\u0022 and so on.\n\u003E \n\u003E Thoughts?\n\nISRU is a real-world thing, on the level of NTRs (Nuclear Thermal Rocket) like the LV-N. Nobody\u0027s ever flown an NTR on any sort of mission, they\u0027ve only been ground tested (and only the first generation of NTRs in the US were ever tested, the later, more advanced units were not even built and existed soley on paper). Similarly, although people have made experimental ISRU (In-Situ Resource Usage) devices, they have also not flown.\n\nWe\u0027ve been using on-Earth ISRU for millions of years (do you think proto-hominids flew in basic flint tools from a Mars-based space program\u0027s MSC?). It\u0027s a real thing.\n\nUnlike reaction wheels and ion engines. Real life reaction wheels are about 20,000x weaker than the KSP version and have saturation issues (CMGs are about a thousand times stronger than a reaction wheel, but they have the same saturation issues and are still \\*20 times\\* weaker than KSP reaction wheels on a torque/mass basis. That\u0027s why I\u0027m always laughing when I see someone put a tower of the 2.5m wheels on something). Real life ion engines are 8,500x weaker (for next-generation designs that have not yet flown, it\u0027s about four times worse for ones that have flown) in an absolute sense. A real life ion has the equivalent thrust of holding up 0.5 to 2 sheets of heavy-duty laser printer *paper* in Earth\u0027s gravity. Micronewtons, not KILOnetwons. Also solar panels should only be producing a tiny trickle at Jool, not 50%.\n\n(Also note that no manned ship/capsule has reaction wheels or CMGs in real life. Mercury, Gemini, Apollo, Space Shuttle, Vostok, Voskhod, Soyuz, etc, all use various RCS systems for orientation in space(sometimes even just cold-gas RCS, like the early Russian pods or SpaceShipOne), and thrust vectoring/vernier engines/tailfins for orientation during ascent)\n\nSo really, I wouldn\u0027t worry about ISRU as cheating, considering all command pods have built-in, utterly fake, massive cheats automatically.\n\nAs for IRSU being massively simplified vs. real life systems, consider that the simplification is on the same level as the rest of KSP. LiquidFuel and Oxidizer? Unlimited current 100% efficient batteries? Unlimited life support endurance? No radiation?\n\nAnyhow, any challenge that doesn\u0027t want ISRU (although they should really be prohibiting NTRs before ISRU) can simply say, \u0022no ISRU\u0022. Not a big hurdle to overcome, just seven little characters.."},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2015-04-26T08:33:46Z","Content":"Is it cheating? IMO no.\n\nIt did look from some of the previews that ore is possibly over abundant, but the only frame of reference we have atm is the intensity of the colours on the images shown. Difficulty slider aside, it may be harder to extract and process than it appears. \n\nMaybe the \u0027default\u0027 slider position should be lower, time will tell and that\u0027s an easy fix anyway.\n\nI am looking forward to the extra game play options it gives me."},{"CreatedByName":"Torham234","CreatedById":58574,"CreatedDateTime":"2015-04-26T08:40:30Z","Content":"Luckily, [real life](https://en.wikipedia.org/wiki/In_situ_resource_utilization) doesn\u0027t think of it as cheating."},{"CreatedByName":"Dakota2063","CreatedById":127687,"CreatedDateTime":"2015-04-26T08:40:57Z","Content":"From my understanding of how the system works (I have been excited about it\u0027s inclusion for some time now.) Each Bio will randomly generate how dense the ore is in any area. This coupled with a slider for how common the resource is can leave many places with low to no ore. The lower the ore concentration, the higher the effort is to pull it out, as the energy requirements to pull it out from a 1% spot or an 8% will not change, just the amount pulled. The equipment is also heavy and needs a very energy rich system to work off of in order to keep running. That means lots of batteries and solar panels as well. The overall amount of investment into using the ISRU is equal to or greater then actually sending up a fuel tanker, or bringing that amount of extra fuel with you to begin with. (obviously more complex missions will actually profit from this in the long run.) Not to mention very time consuming (though time warp and background processing removes the tedium.)\n\nHaving used Kethane, and Karbonite, I can honestly say that circumstances will be the greatest determining factor in whether you will even use the system, as it\u0027s not going to be the infinite fuel source people think that it is. You are infact trading several resources for a different set. Is it a simple system? Yes, but making it needlessly complex adds nothing to the experience, and would put off most players to that experience. However, if you like complexity, there are mods that can add that complexity to the system, including making the deposited limited in amount that can be harvested. (Again, something Roverdude has mentioned about the openess of the system.) Is the name ore a little confusing and silly? Yes. Though given some of the other options, ore seems like a general enough name that most people will recognize. I simply look at it as I do kethane or Karbonite, It\u0027s an unrefined fuel source that needs a process to make it usable, so names don\u0027t really mater. (And again, the resource is easily modifiable via a .cfg edit if you must have a different name.)\n\nI honestly think it is as difficult to utilize as Karbonite, with fewer pieces (only a 2.5m converter.) yet simple to use. I don\u0027t think this could have been implement in any other way and be satisfying. I like that I have to set up a specific orbit to get information, but don\u0027t have to timewarp and not play just to discover the resources. I also like the concept that as you get more narrow fields of scanners, you get more accurate information. I look forward to adding it to my bases and give them a real reason to exist as anything more then contract fodder."},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-26T10:28:28Z","Content":"\u003E \n\u003E If one were to accept that cheating is only defined by each player by his or her self, then the question, \u0022is this cheating?\u0022 is indeed not a valid one to begin with.\n\u003E The fact that someone has asked \u0022is this cheating?\u0022 implies that there *is* an objective way to measure it, that there is a standard against which to measure it, and I argue that the standard is the official ruleset, which is defined by the game developer.\n\u003E \n\u003E IMO, that pretty much sums up every \u0022cheating?\u0022 thread I\u0027ve ever seen on this forum.\n\nOf course, that is what I ment with sterile ruleset. The game mechanics clearly include ressources, so it\u0027s not a cheat by game rule definition. Strictly cheating would be a unlimited fuel hack, the ingame cheat menu, or an obvious exploit (most famously infiniglide).\n\nThat is a kinda obvious and bland explanation, though, nothing really to discuss about. I assume OP is asking if ressource mining means \u0027cheating yourself\u0027, e.g. making the game less fun, degrading the learning experience, which means actually judging the game mechanics on a personal level. Which is actually an interesting idea, while cheating threads usually go into the completely wrong direction and argue about the nature of cheating (i\u0027m obviously not innocent).\n\nAs said, I don\u0027t see it as cheating. It takes effort, planning and specialized construction. Most notably, the incredibly eficient mothership/lander design won\u0027t really work with ISRU. Or you will need giant fuel depots/refineries capable of landing on low-grav worlds. Which is around as time consuming and slightly more complex than large refueling missions. There is already a way of getting \u0027unlimited fuel\u0027, during lategame you will have enough money to actually send lots of fuel ships around without any real limitation. And ISRU is, in my opinion, a much more fun way of refueling, aside from adding a completely new and versatile gameplay mechanic.\n\nThat\u0027s why I think ressource mining will clearly add to the game. It\u0027s on the 2nd last node in career, so it doesn\u0027t even save you doing conventional rocket stuff.\n\n**Edited \u003Ctime datetime=\u00222015-04-26T10:36:48Z\u0022 title=\u002204/26/2015 10:36  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 26, 2015\u003C/time\u003E by Temeter**"},{"CreatedByName":"vfernandez84","CreatedById":107377,"CreatedDateTime":"2015-04-26T10:54:24Z","Content":"For some people the usage of atomic engines could be seen as cheating because, you know, double ISP than the other engines...\n\nAt the end I think this is a very personal thing.\n\nIf you don\u0027t like the current status of the system you could set the resource avaliability to 10% on the difficulty settings, forcing you to really pinpoint the landing area (not that easy unless you use certain mods).\n\nOr maybe just don\u0027t use the ISRU at all.\n\nI mean, how hard can be just create a subclass of the jool-5 thing banning the use of any resource extraction?"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-04-26T11:05:32Z","Content":"1) I don\u0027t think it\u0027s a cheat. It\u0027s a new feature, if you don\u0027t like it don\u0027t use it.\n\n2) To make it more balanced i would love to see some kind of Life Support into the game, so mining for 3 months instead of 10 days has a cost"},{"CreatedByName":"m4inbrain","CreatedById":108770,"CreatedDateTime":"2015-04-26T11:10:28Z","Content":"That\u0027s what i think, too. It might be \u0022strong\u0022, but if it turns out too strong and you don\u0027t like it - simply don\u0027t use it. The Alt F12 Menu is a \u0022built in cheat\u0022 as well. \n\nThat\u0027s the beauty of singleplayer-games. Who cares.\n\nedit: to point that out: the ISRU stuff is not implemented in a way that you actually **need** it. It\u0027s not a requirement for anything, it\u0027s just an addition. That\u0027s why i don\u0027t really understand the discussion."},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-04-26T11:19:38Z","Content":"I don\u0027t think it\u0027s a cheat at all. It will just change the logistics of the game; trading one fuel distribution network for a different one. I\u0027m looking forward to solving the problem.\n\n I think I heard that the drilling sites never run out of fuel. Does anybody else know whether this is true or not?\n\nBest,\n\n-Slashy"},{"CreatedByName":"m4inbrain","CreatedById":108770,"CreatedDateTime":"2015-04-26T11:23:04Z","Content":"IIRC (don\u0027t quote me on it), i\u0027ve read in this forum that asteroids have finite ressources, so i assume that goes for planetary bodies as well."},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-26T11:23:52Z","Content":"\u003E \n\u003E I don\u0027t think it\u0027s a cheat at all. It will just change the logistics of the game; trading one fuel distribution network for a different one. I\u0027m looking forward to solving the problem.\n\u003E  I think I heard that the drilling sites never run out of fuel. Does anybody else know whether this is true or not?\n\u003E \n\u003E Best,\n\u003E \n\u003E -Slashy\n\nIf it uses the system of Karbonite (which seems to be the case). Karbonite had unlimited resources everywhere, and only the percentage changed.\n\nWhich leads to the issue where you can even land on a low yield area and just timewarp for a few weeks to get full tanks.\n\n\u003E \n\u003E IIRC (don\u0027t quote me on it), i\u0027ve read in this forum that asteroids have finite ressources, so i assume that goes for planetary bodies as well.\n\nYep, maxmaps said asteroids have finite resources. I don\u0027t think that\u0027ll be implemented in stock ksp tho."},{"CreatedByName":"andruszkow","CreatedById":104911,"CreatedDateTime":"2015-04-26T11:27:03Z","Content":"Problem with this discussion is as always, that you can only ask this question if there\u0027s a set way of playing this game. And there isn\u0027t. These discussions are silly really, unless the topic of debate were something along the lines of \u0022Which way of playing KSP do you enjoy the most?\u0022.\n\nWith all these silly \u0022balancing\u0022 and \u0022realism\u0022 demands, we will in the end, get a game with 3000 sliders to adjust \u0022difficulty\u0022 or \u0022realism\u0022 or \u0022how correct do you want to play KSP?\u0022 settings.\n\nAs always, if it\u0027s silly to you, don\u0027t use it."},{"CreatedByName":"SkyRex94","CreatedById":114868,"CreatedDateTime":"2015-04-26T11:31:21Z","Content":"Well it seems fine for me.\n\nHuge amounts of electricity are needed, you can adjust the amount in difficulties, and you can\u0027t just timewarp to infinity,because i\u0027m sure asteroids willl be limited and on planets you have to have enough electricity to bridge the night as it seems the drill turns itself off as soon as it rans out of energy.\n\nFine for me so far \n\ncheers"},{"CreatedByName":"m4inbrain","CreatedById":108770,"CreatedDateTime":"2015-04-26T11:44:47Z","Content":"As i said, my opinion on that is, since one doesn\u0027t need to use the ISRU stuff, who cares. It\u0027d be different if all the engines suddenly go to 4000 ISP, because you actually **need** to use them, but that\u0027s not the case. I certainly will use it, because i think it\u0027s awesome - especially with TAC LS it\u0027ll be fun. At least i\u0027m hoping."},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-04-26T11:48:42Z","Content":"You can reduce the # of minerals in the game options tab. I\u0027ll probably play with 50% (that should make it so there are only isolated pockets)."},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-04-26T11:57:52Z","Content":"It\u0027s not cheating if it\u0027s physics/science when NASA is trying to do the same thing right now."},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-04-26T12:10:17Z","Content":"Watching a stream, it seems that to avoid spending years filling up your tanks, you have to mine in areas where the percentage is very high (which restricts your landing locations greatly)."},{"CreatedByName":"Torham234","CreatedById":58574,"CreatedDateTime":"2015-04-26T12:17:02Z","Content":"\u003E \n\u003E Watching a stream, it seems that to avoid spending years filling up your tanks, you have to mine in areas where the percentage is very high (which restricts your landing locations greatly).\n\nYeah, and it seems the ore depletes under the craft, so its not infinite. You have to keep repositioning the drilling platform. I think its quite balanced, the 2% concentration refilled about 20 units of fuel before depleting the ore under the craft. That is not cost effective by any means, since the refinery and all the drilling equipment is really heavy."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-26T12:38:14Z","Content":"The ore does not deplete. What you probably saw with that streamer is the efficiency dropping as the drill overheated. Poor deposits are NOT fun ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2015-04-26T12:47:36Z","Content":"This is one of the very rare occasions when I agree with the Term \u0022If you dont like it, dont use it\u0022.\n\nKSP always gave you the freedom to do whatever you want and I refused to fully upgrade the Tracking Station to get rid of annoying Asteroids flying around.\n\nNot that I dont like the asteroid-capture-feature but I didnt feel the need to have them in my game at all.\n\nIf you dont like the Idea of ISRU\u0027s just dont use them in your install and go the planets the old fashioned way.\n\nBut keep in mind, that exoplanetary refueling is a real-world-topic and it \u0022hopefully\u0022 will find some application in the future.\n\nMaybe just for lifesupport, but if you have water and sunlight you are not far away from producing hydrogen and oxygen ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-04-26T12:57:35Z","Content":"\u003E \n\u003E Watching a stream, it seems that to avoid spending years filling up your tanks, you have to mine in areas where the percentage is very high (which restricts your landing locations greatly).\n\nSelectHalfling,\n\n Do you remember which stream you saw this in? My gameplan is going to depend on whether or not resources deplete.\n\nThanks,\n\n-Slashy"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-26T12:57:46Z","Content":"\u003E \n\u003E Yeah, and it seems the ore depletes under the craft, so its not infinite. You have to keep repositioning the drilling platform. I think its quite balanced, the 2% concentration refilled about 20 units of fuel before depleting the ore under the craft. That is not cost effective by any means, since the refinery and all the drilling equipment is really heavy.\n\nThen it\u0027s actually properly balanced. Not sure if for the best, but proper. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-26T13:00:42Z","Content":"For clarity. Ore does not deplete. See comment above"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-04-26T13:04:18Z","Content":"Ah thanks, that was the on post i missed.^^\n\nNice. There are just too many variables: I once build a 2k ton vtol that could land and start of mars including mining equipment. Can\u0027t balance that kind of stuff against a reasonable mining ship."}]}