{"TopicId":105113,"ForumId":32,"TopicTitle":"Can I... talk to you about something?","CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2015-04-27T03:52:17Z","PageNum":1,"Articles":[{"CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2015-04-27T03:52:17Z","Content":"\n\u003Cp\u003EThis is going to be a very heartfelt thing for me to talk about, so sorry if I stammer a lot.\u003C/p\u003E\u003Cp\u003EAs many of you might know, at least the old timers on here might, I had tried to make a movie project by the name of \u0022Kerbal Space Program - Rise of the Kraken\u0022, back in the Summer of 2013, man it\u0027s been a while. But the project, fell under, I never finished it and gave up, deleting the original files. But before that, I had tried back in the era of 0.17, obviously I gave up on that too. Making it about two and a half years since I originally came up with the idea. And since then, things have changed.\u003C/p\u003E\u003Cp\u003EIt was back in February of 2014, I hit that punch of inspiration again, and I wanted to finish ROTK out-right. In the next three months, I worked myself hard, recording about two and a half hours of video, about enough for an hour and a half movie. But again, I\u0027ve lost motivation. The project is still on my Hard Drive, just sitting there. Two and a half hours of perfectly good video shot back in 0.22, just, collecting dust. I\u0027ve slowly been working on it a bit since then, but I only have two of the twenty-six scenes edited, making progress slow, but I could so do it, I just don\u0027t have that passion I once had. But the sad thing is, I still do. ROTK is such a huge part of my life now, I\u0027ve spent three years thinking about a dream movie I could make, but I just can\u0027t drive myself to do it. I\u0027ve put heart and soul into the story, and at this point, I\u0027ve planned an entire trilogy\u0027s story out, I have story material for three movies, but I can\u0027t be motivated to fulfil my wishes. To make the movie about the game I love so much, for the community I hold so dear.\u003C/p\u003E\u003Cp\u003EMy old shots I spent months on at the time are now, outdated. From a relical version without the Strategy Center, from a version without volumetric clouds, from a version without asteroids or ARM\u0027s, or anything we hold true to KSP now. This old footage may not even be new enough if I edited it. And I don\u0027t want to start again. ROTK\u0027s third attempt is going to be the last one I try. It\u0027s story needs no more revision, no more changes, no new footage, no new anything. It\u0027s me vs. myself. And I want to deliver the movie I always wanted to you.\u003C/p\u003E\u003Cp\u003EMy Magnum Opus, my true work, is being held back by myself.\u003C/p\u003E\u003Cp\u003ESo I want to ask you all something, I really do. More than ever, I want an answer to my problem. Should I...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1.\u003C/strong\u003E Finish the movie with it\u0027s current footage, at the risk of it being outdated, old, and without current features.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2.\u003C/strong\u003E Reshoot the entire movie, a fate I may not be able to go through with.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3. \u003C/strong\u003EEnd it all, and let the Kraken stay unrisen. Never finish the movie.\u003C/p\u003E\u003Cp\u003EI\u0027m sorry for asking this, just, I\u0027ve never been in this much of a slump.\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-04-27T03:53:43Z","Content":"\n\u003Cp\u003E1. Go do it.\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-04-27T03:56:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cooly568\u0022 data-cite=\u0022Cooly568\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003E1.\u003C/strong\u003E Finish the movie with it\u0027s current footage, at the risk of it being outdated, old, and without current features.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeriously, what does \u0022outdated\u0022 mean anyways... it\u0027s a film not a game!\u003C/p\u003E\u003Cp\u003EBesides, you will NEVER finish it if you obsess about restarting from the beginning; inspiration/motivation only lasts so long.\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-04-27T03:57:20Z","Content":"\n\u003Cp\u003EWell.. My suggestion would be..\u003C/p\u003E\u003Cp\u003EIt\u0027s become a part of your life. Finishing it would mean a success of a big life goal of yours. Who cares if it\u0027s old? With the passion and dedication you have, I believe it could become truly amazing. If it\u0027s old, then edit it if you want. It\u0027s up to you. It\u0027s been started, and it might as well be finished. You know you worked hard on that movie, so go for it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sandworm","CreatedById":66244,"CreatedDateTime":"2015-04-27T03:58:30Z","Content":"\n\u003Cp\u003EEither do it or release the material under a GPL to let someone else possibly finish the job. Don\u0027t let good footage die.\u003C/p\u003E\n"},{"CreatedByName":"Fearlessjames118","CreatedById":44818,"CreatedDateTime":"2015-04-27T04:10:18Z","Content":"\n\u003Cp\u003E1.Do it,you should never give up.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ENo matter what \u003C/em\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-04-27T04:12:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cooly568\u0022 data-cite=\u0022Cooly568\u0022\u003E\u003Cdiv\u003EMy old shots I spent months on at the time are now, outdated. From a relical version without the Strategy Center, from a version without volumetric clouds, from a version without asteroids or ARM\u0027s, or anything we hold true to KSP now. This old footage may not even be new enough if I edited it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECrazy idea here, but hear me out.\u003C/p\u003E\u003Cp\u003EIt may just be the bourbon talking, but \u003Cem\u003Edoes the older footage need to be current?\u003C/em\u003E (I have no idea what the movie you\u0027re doing is about.) Instead of scrapping the already created footage, is there some way you can reframe it into a flashback, or a dream sequence, or use it in some other way that having a different look to it would not break the movie? You could give it a black and white or washed out look and use it behind a voice-over, etc. to fit it in between newer footage. Turn it into 1940s newsreel style stock footage or an artist\u0027s impression. That would give you a chance without needing to reshoot everything.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2015-04-27T04:41:22Z","Content":"\n\u003Cp\u003EIf you don\u0027t need any of the new features, and you\u0027re satisfied with the existing footage, I say stick with that. \u003C/p\u003E\u003Cp\u003EA movie is a big thing to make. And risky- on the net, shorter means more clicks.\u003C/p\u003E\u003Cp\u003EPerhaps you should work out what\u0027s holding you back. Is it fear? Is it available time? Is it the amount of work that it will take.\u003C/p\u003E\u003Cp\u003EMaybe you could set aside some time to bash out a rough cut, and then refine later? Do a quick, dodgy edit, then come back to add and correct things later, if your editing program will allow it. Don\u0027t try and make it perfect, Almost nothing is perfect, and everything starts out pretty rubbish at first. A first edit should be made will little effort, - just enough so you\u0027ve actually got something you can work on. \u003C/p\u003E\u003Cp\u003E I also suggest making a trailer, if you haven\u0027t already, to gauge interest. Perhaps getting some \u0027beta views\u0027 \u0027pre readers\u0027\u003C/p\u003E\u003Cp\u003E- other people, possibly from this forum, who\u0027d be willing to read through your scripts, plans and whatever- feedback can help boost confidence. \u003C/p\u003E\u003Cp\u003EIt can help you make decisions where you\u0027re not confident, help you get an idea of how people will respond, correct flaws... even if you disagree with some of the feedback, it can help you be more confident with where you\u0027ve decided the move should go.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-04-27T04:45:00Z","Content":"\n\u003Cp\u003EI vote 1. Afterward, if you feel like you could do better using the new version, feel free to make a sequel.\u003C/p\u003E\n"},{"CreatedByName":"boostme","CreatedById":118817,"CreatedDateTime":"2015-04-27T04:58:12Z","Content":"\n\u003Cp\u003ECompleting a project like this is always very rewarding, but if working on it is not bringing you joy then let it be. The project isn\u0027t going anywhere and you don\u0027t have a deadline to finish it. Take what you\u0027ve learned from this project so far and do something else. Something that interests you right now. \u003C/p\u003E\u003Cp\u003EWhen the time is right you\u0027ll know what to do with ROTK.\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2015-04-27T08:20:26Z","Content":"\n\u003Cp\u003E1 \u002B 2\u003C/p\u003E\u003Cp\u003EI would love to see it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jarmund","CreatedById":126888,"CreatedDateTime":"2015-04-27T08:27:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cooly568\u0022 data-cite=\u0022Cooly568\u0022\u003E\u003Cdiv\u003EThis is going to be a very heartfelt thing for me to talk about, so sorry if I stammer a lot.\u003Cp\u003EAs many of you might know, at least the old timers on here might, I had tried to make a movie project by the name of \u0022Kerbal Space Program - Rise of the Kraken\u0022, back in the Summer of 2013, man it\u0027s been a while. But the project, fell under, I never finished it and gave up, deleting the original files. But before that, I had tried back in the era of 0.17, obviously I gave up on that too. Making it about two and a half years since I originally came up with the idea. And since then, things have changed.\u003C/p\u003E\u003Cp\u003EIt was back in February of 2014, I hit that punch of inspiration again, and I wanted to finish ROTK out-right. In the next three months, I worked myself hard, recording about two and a half hours of video, about enough for an hour and a half movie. But again, I\u0027ve lost motivation. The project is still on my Hard Drive, just sitting there. Two and a half hours of perfectly good video shot back in 0.22, just, collecting dust. I\u0027ve slowly been working on it a bit since then, but I only have two of the twenty-six scenes edited, making progress slow, but I could so do it, I just don\u0027t have that passion I once had. But the sad thing is, I still do. ROTK is such a huge part of my life now, I\u0027ve spent three years thinking about a dream movie I could make, but I just can\u0027t drive myself to do it. I\u0027ve put heart and soul into the story, and at this point, I\u0027ve planned an entire trilogy\u0027s story out, I have story material for three movies, but I can\u0027t be motivated to fulfil my wishes. To make the movie about the game I love so much, for the community I hold so dear.\u003C/p\u003E\u003Cp\u003EMy old shots I spent months on at the time are now, outdated. From a relical version without the Strategy Center, from a version without volumetric clouds, from a version without asteroids or ARM\u0027s, or anything we hold true to KSP now. This old footage may not even be new enough if I edited it. And I don\u0027t want to start again. ROTK\u0027s third attempt is going to be the last one I try. It\u0027s story needs no more revision, no more changes, no new footage, no new anything. It\u0027s me vs. myself. And I want to deliver the movie I always wanted to you.\u003C/p\u003E\u003Cp\u003EMy Magnum Opus, my true work, is being held back by myself.\u003C/p\u003E\u003Cp\u003ESo I want to ask you all something, I really do. More than ever, I want an answer to my problem. Should I...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1.\u003C/strong\u003E Finish the movie with it\u0027s current footage, at the risk of it being outdated, old, and without current features.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2.\u003C/strong\u003E Reshoot the entire movie, a fate I may not be able to go through with.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3. \u003C/strong\u003EEnd it all, and let the Kraken stay unrisen. Never finish the movie.\u003C/p\u003E\u003Cp\u003EI\u0027m sorry for asking this, just, I\u0027ve never been in this much of a slump.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003E1. Get\u0027r\u0027done!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBecause a good video is good regardless of outdated effects.\u003C/p\u003E\u003Cp\u003EI for one love the original \u003Ca href=\u0022https://www.imdb.com/title/tt0054387/?ref_=nv_sr_2\u0022 rel=\u0022external nofollow\u0022\u003EThe Time Machine\u003C/a\u003E (can\u0027t stand \u003Ca href=\u0022https://www.imdb.com/title/tt0268695/?ref_=fn_al_tt_1\u0022 rel=\u0022external nofollow\u0022\u003Ethe newer one\u003C/a\u003E).\u003C/p\u003E\u003Cp\u003EI think the same of old KSP videos, they\u0027re still entertaining\u003C/p\u003E\n"},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2015-04-27T08:38:04Z","Content":"\n\u003Cp\u003E1.\u003C/p\u003E\u003Cp\u003Ego do it.\u003C/p\u003E\u003Cp\u003Eif it is in an old version, everyone will appreciate that you did a lot with all those bugs. of course, the kraken is still available in 0.90, even more if you don\u0027t install kerbal joint reinforcement...\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2015-04-27T08:48:07Z","Content":"\n\u003Cp\u003E4. Go with what you have already but do it in parts. An hour and a half video is quite long, and daunting to do all at once. \u003C/p\u003E\u003Cp\u003EBy breaking it up into pieces you\u0027ll find it easier to fine tune and edit, and if you release it slowly over time you\u0027ll also be able to get feedback from people about what they think is good or bad about it.\u003C/p\u003E\n"},{"CreatedByName":"LostOblivion","CreatedById":111504,"CreatedDateTime":"2015-04-27T08:54:38Z","Content":"\n\u003Cp\u003EI understand the position you\u0027re in, I\u0027ve had a few projects of my own that I never got finished, even though I\u0027d love to see them finished. However, I\u0027ve also had a few projects that I was happy with, and they all had the same solution; I had to set aside a lot of time to work hard on them, even though it\u0027s not so fun right there and then.\u003C/p\u003E\u003Cp\u003EI think the important idea about passion projects like yours, no matter which alternative you go for, it is important to remember that all projects will at some point become work, a lot of work, and that, as you\u0027ve experienced, might lose that drive to keep working on it because it\u0027s not so fun and rewarding right there and then. You may choose not to do it, and that\u0027s fine too, but either you have to choose to put in really hard work and time to get it done to reach your plans for it, or you have to lessen the effort required and lower your expectations for the final product. Besides, who says you won\u0027t ignite that spark again after that hard work put you over that proverbial hill? :-)\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-27T09:16:52Z","Content":"\n\u003Cp\u003E1.\u003C/p\u003E\u003Cp\u003EBecause I\u0027ve been writing a novel for the past 7 years due to constantly going back to chapter 1 and fixing it xD\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-04-27T09:35:33Z","Content":"\n\u003Cp\u003ESometimes you only want to want to do something, you don\u0027t actually want to do it. In this case, you want to have the desire to finish the movie but you don\u0027t. You find yourself just not doing it and doing other things instead.\u003C/p\u003E\u003Cp\u003EAccept how you feel about the project.\u003C/p\u003E\u003Cp\u003EMy suggestion would be to have a go with what you already have, if you find it fun it may ignite a desire to finish or improve it. If not at least you have made something from all your work to date.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-27T10:21:07Z","Content":"\n\u003Cp\u003EFellow video maker here including some very long ones. I know them feels.\u003C/p\u003E\u003Cp\u003EIn my opinion the game version doesn\u0027t matter at all. If you have the ideas and the inspiration then keep going and definitely use the footage you have.\u003C/p\u003E\n"},{"CreatedByName":"treejoe4","CreatedById":113762,"CreatedDateTime":"2015-04-27T10:22:39Z","Content":"\n\u003Cp\u003Ei dont care lol\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-27T10:25:56Z","Content":"\n\u003Cp\u003E#1. Should have been a poll.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-04-27T10:53:55Z","Content":"\n\u003Cp\u003ECooly568 I understand how you feel, I too have unfinished projects (some KSP, some other things) that I\u0027ve really wanted to complete but just lost the ability to. I\u0027ve dropped some projects because I felt they were now \u0022out of date\u0022 and wouldn\u0027t be well received, but I think that was a mistake on my part. This community actually appreciates art and effort even when out of date; my most viewed vid is now well over a year old (made in KSP 0.19) and people still watch it and still like it, so I\u0027d say go with option 1 and don\u0027t worry about it having out-of-date footage.\u003C/p\u003E\n"},{"CreatedByName":"Scoundrel","CreatedById":15369,"CreatedDateTime":"2015-04-27T11:25:44Z","Content":"\n\u003Cp\u003EI\u0027m imbedding my full response in a spoiler because it\u0027s a wall of text that the OP (or whoever) may or may not want to read, and it\u0027s pretty extensive as this is a subject that is quite personal for me too.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EAs a graduate of the Vancouver Film School (back when it was a two year course crammed into 8 months) and having had extensive experience in all aspects of production (I\u0027ve since moved on but still play with after affects for fun), I can say that you are going through the exact same thing every single filmmaker goes through on a big project. Most simply self-medicate to keep their energy up, but a bunch of us (who aren\u0027t insane) who have shot and edited huge projects use music (and sometimes a second pair of eyes and hands) to keep us motivated to see the project to the end.\u003C/p\u003E\u003Cp\u003EAllow me to expand on that a bit further...\u003C/p\u003E\u003Cp\u003EI suspect that the burnout you have is because you\u0027ve spent 90ish days setting up and getting your shots, know the footage inside and out, but have realized that there\u0027s a lot more work yet to be done. Now you\u0027re into the grind of post. Done right, post production is just as fun (sometimes funner) than shooting... but the problem is that you\u0027re messing with stuff you\u0027ve already seen and have already figured out how is going to be strung together, so the editing portion isn\u0027t as \u0022creative\u0022 as it could be to keep your interest going... and it is hard to stay motivated when the bulk of the workload is yet to come.\u003C/p\u003E\u003Cp\u003EFurthermore, once the burnout comes on there is a bit of depression - one of my directing instructors, in an obvious pun, used to call it \u0027\u003Cstrong\u003Epost\u003C/strong\u003Epartum depression\u0027 because the baby\u0027s been made (the fun part), but now you have to raise it and teach it not to pee on the carpet or play in traffic (the lots of work part). From that daunting realization that the job is far from over stems our self-doubt and rationalizations to quit or restart the project (this pops up because directors/producers fear the finished project won\u0027t be worth the large effort put into post and start second-guessing their decisions); most of the productions I\u0027ve worked on have ended up in freezers because the director lost interest or the producer ran out of money... but the ones that were finished were projects where the creative force pushed through the rationalizations to quit and simply stayed focused on the end goal: tell a story they want to share.\u003C/p\u003E\u003Cp\u003EBut that\u0027s easier said than done, right?\u003C/p\u003E\u003Cp\u003EWell, we non-insane sober types have developed a strategy to keep us motivated when staring at the huge EDL we need to generate: we step back and work on our soundtrack instead. The simple act of hunting down music and listening to it - seeing what scores works with the theme of various scenes, or working out the climax or the intro or the denouement - allows us to be productive, take a break from staring at scenes we know inside and out, and when we finally go back to editing we get to look at the footage from a new, creative angle because we\u0027re looking to edit to the music.\u003C/p\u003E\u003Cp\u003EFurthermore, editing to music allows us to break down large projects into small, bite sized chunks that don\u0027t require weeks of commitment to work on (let alone revealing pacing issues in the story itself, another big bonus). This lets us take breaks when we need to so we can stay motivated long enough to see the project to completion.\u003C/p\u003E\u003Cp\u003EAfter all, that\u0027s the whole point of starting a project, isn\u0027t it? To finish? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyways, it\u0027s long winded and rambling, but that\u0027s my take on filmmaker burnout. Hopefully this helps someone, somewhere.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EThat said, if the OP is simply soliciting opinions, then I\u0027ll say the same thing I say to anyone who is working on a project and is having second thoughts:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003EFinish your damned movie! Everything else is just an excuse to quit!\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-04-27T11:29:40Z","Content":"\n\u003Cp\u003EIf the old idea didn\u0027t requore the new features then, it doesn\u0027t need them now. Go and finish it. We\u0027ll be here, ready and waiting.\u003C/p\u003E\n"},{"CreatedByName":"ShadowZone","CreatedById":112420,"CreatedDateTime":"2015-04-27T11:37:44Z","Content":"\n\u003Cp\u003EFinish it! No matter the version, the parts or the effects. You need that closure, trust me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Roxette","CreatedById":84963,"CreatedDateTime":"2015-04-27T11:39:51Z","Content":"\n\u003Cp\u003ECertainly finish and release it with the present material, but maybe release it in black and white with film damage effects to emphasize its historical perspective \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}