{"TopicId":105115,"ForumId":32,"TopicTitle":"Nay-sayers, unite!","CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-04-27T04:27:06Z","PageNum":5,"Articles":[{"CreatedByName":"FleetAdmiralJ","CreatedById":73364,"CreatedDateTime":"2015-04-27T11:10:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EWhich is why they should have released it as a 0.95 version. Fix the stuff that needs to be fixed (Manley and Valdez ran into a few after only a couple of hours of play, imagine would thousands of players will do) and THEN release 1.0 as a much more stable version. That\u0027s been the whole point of the complaints of going to 1.0 and introducing so many new things without playtesting in the first place.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know about Das, but someone above mentioned that Scott might have run into mod-related bugs, which isn\u0027t really Squad\u0027s problem per se if he was using mods not actually designed for 1.0 yet. Also, experimentals is meant to be a play test. And let\u0027s be honest - KSP has gotten a heck of a lot more playtesting generally than I imagine a lot of AAA games get before release.\u003C/p\u003E\u003Cp\u003EAlso, \u003Cstrong\u003Ethere will always be bugs\u003C/strong\u003E. Fixing bugs is, of course, always nice. But expecting a game devoid of bugs is just plain ridiculous. I mean, I find bugs in GTA V all the time and I\u0027m not in a rage yelling at them that it wasn\u0027t ready. I think most people who play games expect some minimal level of bugs. The larger concern is if they are bugs that seriously affect game play or not.\u003C/p\u003E\u003Cp\u003EAnd from a marketing perspective, let\u0027s be honest - would we really get this much hype out of a 1.0 release that was little more than a bugfix release? I doubt it.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-04-27T11:13:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EWhich is why they should have released it as a 0.95 version. Fix the stuff that needs to be fixed (Manley and Valdez ran into a few after only a couple of hours of play, imagine would thousands of players will do) and THEN release 1.0 as a much more stable version. That\u0027s been the whole point of the complaints of going to 1.0 and introducing so many new things without playtesting in the first place.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes to minimize the number of bugs this would be the best solution. \u003C/p\u003E\u003Cp\u003EHowever the game has to move from early access to finished at one point, it probably also have to do with pricing and Squads cut. \u003C/p\u003E\u003Cp\u003ENow an 0.99 version would be an beta and not early access, how to sell it, the huge update generates lots of hype, reviews and new sales, stupid if the game was not for sale from 0.99 was released to 1.0 came 1-2 weeks from now.\u003C/p\u003E\u003Cp\u003ENow for us who have the game this has no effects that so ever.\u003C/p\u003E\n"},{"CreatedByName":"Bloody_looser","CreatedById":95664,"CreatedDateTime":"2015-04-27T11:14:52Z","Content":"\n\u003Cp\u003EBeing critical and vocal about some issues is a good thing (like Round-8 case).\u003C/p\u003E\u003Cp\u003EBeing butthurt for sake of butthurt and making accusation of Squad being liars and KSP being a fraud to steal your ten bucks, you\u0027ve paid two years ago, well ... apply something cold to your damaged private parts, wait for release and then be butthurt \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-04-27T11:15:03Z","Content":"\n\u003Cp\u003EI think they should just call this version 0.9999999999. Then the last update can be a few bug fixes and then what ever they had planned for next.\u003C/p\u003E\n"},{"CreatedByName":"georgTF","CreatedById":57397,"CreatedDateTime":"2015-04-27T11:19:27Z","Content":"\n\u003Cp\u003EFTL Faster Than Light had tons of bugs and something like 10-15 patches came out for it after release, sometimes fixing bugs you could not believe were not spotted before. But it\u0027s been an awesome game since 1.0 and the patching did not hurt it\u0027s reputation.\u003C/p\u003E\u003Cp\u003EKSP has been awesome since alpha. Eventually Suqad would have to bite the bullet and push 1.0 out. That was kinda my whole point, that no matter how hard you try to eliminate bugs, you will allways have some once you reach 1.0 because it will have by far the largest player base so far (though KSP is an anomaly in this case because it already has a large base and a long alpha period), and it\u0027s better to get it out of the way rather than go through several incremental bugfix releases. Such releases lack the momentum of a major release and can sometimes delay the problems rather than help.\u003C/p\u003E\u003Cp\u003EWhat was unfortunate about this release was that all excited KSP fans got to watch the bugs on streams but Squad had already put KSP in code-lock. But they\u0027re only human, and humans miss bugs in the code. A month from now everybody should have happy memories of finding new ways to crash new parts, and not the release issues.\u003C/p\u003E\u003Cp\u003ESquad could have helped themselves by reminding the fanbase that critical or numerous bugs were likely given what a major release this was going to be.\u003C/p\u003E\n"},{"CreatedByName":"FleetAdmiralJ","CreatedById":73364,"CreatedDateTime":"2015-04-27T11:21:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bloody_looser\u0022 data-cite=\u0022Bloody_looser\u0022\u003E\u003Cdiv\u003EBeing critical and vocal about some issues is a good thing (like Round-8 case).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would add that the above case and the thing with Kerbal experiences were things that the community as a whole largely spoke up about, not just a few nay-sayers that Squad suddenly decided to listen to.\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2015-04-27T11:21:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4inbrain\u0022 data-cite=\u0022m4inbrain\u0022\u003E\u003Cdiv\u003EI will have fun with the release client, and as long as squad is hurrying up fixing the bugs, i\u0027m fine with a buggy client.\u003Cp\u003EBut, that being said: this is because i think KSP is one of the very, VERY few gems of the concept of early access. They got some credit in my book, that\u0027s why. To argue \u0022when was the last time you got a perfect release\u0022.. uhm, what? It\u0027s absolutely stupid to argue \u0022well, EA and other cashgrabbers throw crap into the market, so it\u0027s fine for others too - that\u0027s just how it is\u0022. No it\u0027s not how it is. It is what it has become, and that is partially because people use that one single silly argument over and over again. \u003C/p\u003E\u003Cp\u003EMaybe it\u0027s my age, but i certainly remember better times regarding this pest (buggy clients, cashgrabs).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, the complexity of new games compared to say, a game for the Commodore 64 (I had tons of C64 games) means it is not feasible to have an absolute bug free game. The wild variety of hardware we run our games on, the wild variety of software running underneath, the complexity of the code itself, you just can\u0027t expect a bug free game. So it is definitely how it is, not a result of giving up but because we humans have limits when it comes to analyzing every single aspect of a game in any of a myriad different software/hardware environments.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MalfunctionM1Ke\u0022 data-cite=\u0022MalfunctionM1Ke\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFinally, someone who feels like I do. Probably more out there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMinding buggy stuff, I still have Daggerfall \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Only lack of time stops me from playing it nowadays.\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-04-27T11:23:56Z","Content":"\n\u003Cp\u003EI have had misgivings about releasing prematurely, but I don\u0027t really see the point of this thread.\u003C/p\u003E\n"},{"CreatedByName":"gmiddlemass","CreatedById":111037,"CreatedDateTime":"2015-04-27T11:24:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LN400\u0022 data-cite=\u0022LN400\u0022\u003E\u003Cdiv\u003EUnfortunately, the complexity of new games compared to say, a game for the Commodore 64 (I had tons of C64 games) means it is not feasible to have an absolute bug free game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly... I can even remember when games were so simple that you could type the things in yourself from pages of code printed in magazines... Try doing that with Kerbal!\u003C/p\u003E\n"},{"CreatedByName":"Roxette","CreatedById":84963,"CreatedDateTime":"2015-04-27T11:30:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gmiddlemass\u0022 data-cite=\u0022gmiddlemass\u0022\u003E\u003Cdiv\u003E... I can even remember when games were so simple that you could type the things in yourself from pages of code printed in magazines...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can remember when games were so simple they involved throwing pieces of animal bone around and catching them.\u003C/p\u003E\n"},{"CreatedByName":"Corw","CreatedById":7116,"CreatedDateTime":"2015-04-27T11:43:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roxette\u0022 data-cite=\u0022Roxette\u0022\u003E\u003Cdiv\u003EI can remember when games were so simple they involved throwing pieces of animal bone around and catching them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWatch out for the vegetarians, they might rip you apart \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"gmiddlemass","CreatedById":111037,"CreatedDateTime":"2015-04-27T11:49:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roxette\u0022 data-cite=\u0022Roxette\u0022\u003E\u003Cdiv\u003EI can remember when games were so simple they involved throwing pieces of animal bone around and catching them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust make sure you clean the bones properly first to get rid of all the \u0022bugs\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-04-27T11:50:57Z","Content":"\n\u003Cp\u003EI am very excited about this update, I think Squad has done a great job based on what I\u0027ve seen on streams and the new features look great. But that said, I still think calling it 1.0 was a bad move. It\u0027s not that I\u0027d expect a \u0022bug free\u0022 release, no software is bug free, even the simplest code has bugs; in C (and many other languages) this has a bug;\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E0.2 \u002B 0.7\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo it\u0027s not that I\u0027d expect 1.0 to be bug free, that doesn\u0027t happen, but there does seem to be quite a number of fairly significant bugs that haven\u0027t been picked up by the QA process. Personally I don\u0027t mind that this version has bugs, because we\u0027ve been told that development will continue to add new features \u003Cstrong\u003Eand\u003C/strong\u003E fix further bugs. I just feel that Squad hasn\u0027t done themselves justice in the eyes of everyone else (by which I mean new users / those who aren\u0027t community regulars). This should have been another beta release given how many major changes it has and the move to 1.0 should be a tiny code change, one line in-fact; simply changing the version number.\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-04-27T11:54:42Z","Content":"\n\u003Cp\u003EI wouldn\u0027t sweat it. With a 1.0 \u0022RELEASE\u0022 comes full support so we will probably see bug-fix patches to address issues without having to wait for a major release.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-04-27T11:57:53Z","Content":"\n\u003Cp\u003EI hope they make the claw less glitchy.\u003C/p\u003E\u003Cp\u003EYes, having 2 claws connect to same kerbal isn\u0027t something you are likely to do accidentally, but it may be a symptom of some worse issue.\u003C/p\u003E\n"},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-04-27T12:01:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EI am very excited about this update, I think Squad has done a great job based on what I\u0027ve seen on streams and the new features look great. But that said, I still think calling it 1.0 was a bad move. It\u0027s not that I\u0027d expect a \u0022bug free\u0022 release, no software is bug free, even the simplest code has bugs; in C (and many other languages) this has a bug;\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E0.2 \u002B 0.7\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo it\u0027s not that I\u0027d expect 1.0 to be bug free, that doesn\u0027t happen, but there does seem to be quite a number of fairly significant bugs that haven\u0027t been picked up by the QA process. Personally I don\u0027t mind that this version has bugs, because we\u0027ve been told that development will continue to add new features \u003Cstrong\u003Eand\u003C/strong\u003E fix further bugs. I just feel that Squad hasn\u0027t done themselves justice in the eyes of everyone else (by which I mean new users / those who aren\u0027t community regulars). This should have been another beta release given how many major changes it has and the move to 1.0 should be a tiny code change, one line in-fact; simply changing the version number.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou will probably find sales have stagnated. They need the game to release to bring in fresh revenue. Then they can judge how much money and time they can spend on future updates. If they make $200k just as a random number from fresh sales as a newly finished and released game they will budget some of that for new content.\u003C/p\u003E\u003Cp\u003ENew Porche - $100k\u003C/p\u003E\u003Cp\u003ENew House - $100k\u003C/p\u003E\u003Cp\u003ENew Big Screen TV \u002B Home Theatre - $10k\u003C/p\u003E\u003Cp\u003EAmount left over for future development - I hope we sell some more copies.\u003C/p\u003E\n"},{"CreatedByName":"FleetAdmiralJ","CreatedById":73364,"CreatedDateTime":"2015-04-27T12:16:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022uglyduckling81\u0022 data-cite=\u0022uglyduckling81\u0022\u003E\u003Cdiv\u003EYou will probably find sales have stagnated. They need the game to release to bring in fresh revenue. Then they can judge how much money and time they can spend on future updates. If they make $200k just as a random number from fresh sales as a newly finished and released game they will budget some of that for new content.\u003Cp\u003ENew Porche - $100k\u003C/p\u003E\u003Cp\u003ENew House - $100k\u003C/p\u003E\u003Cp\u003ENew Big Screen TV \u002B Home Theatre - $10k\u003C/p\u003E\u003Cp\u003EAmount left over for future development - I hope we sell some more copies.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow, the amount of cynicism here is breathtaking.\u003C/p\u003E\u003Cp\u003EAlso: How dare they pay themselves for working!\u003C/p\u003E\n"},{"CreatedByName":"Woodstar","CreatedById":99637,"CreatedDateTime":"2015-04-27T12:55:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EAmong the things after binge-watching the KSP 1.0 pre-release streams on Twitch:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe visual effects look awesome\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAero has been revamped completely\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EResource mining. Ya.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBut what also became very clear based on the streams: the game contains a solid amount of bugs and exploits that haven\u0027t been killed/discovered in experimentals. Which is not something to blame the experimental testers for; a community of thousands (chatting with the live streamers) can come up with scenarios the testers would never think off.\u003C/p\u003E\u003Cp\u003EThe decision to go straight from .90 to 1.0 (instead of launching it as .95 first and squashing bugs) seemed bizar and byzantine and the bugs showing up during the live streams are not doing a lot to counter that impression. Congratulations Squad, you\u0027re going to release a 1.0 that has a good amount of bugs and that will be followed by a bugfix release. That\u0027ll look really good for a game that has been in development for over three years.\u003C/p\u003E\u003Cp\u003EI still thing the game was rushed to 1.0 and it doesn\u0027t deserve that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea name one game that released \u0022bug free\u0022!\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-27T13:08:42Z","Content":"\n\u003Cp\u003ESo, I\u0027m late to the party here. The only thing I\u0027d like to add is this: Do not excuse the failures of one company because another has done no better. The Halo: Complete Collection was horribly bugged. AC: Unity was horribly bugged. Mortal Kombat X on PC was a main menu simulator on launch. As consumers, we can not accept this behavior as the norm. We can not excuse a buggy launch because another has had even more bugs.\u003C/p\u003E\u003Cp\u003ECompanies would not exist without their costumers. They only survive because they meet the standards we give them. It\u0027s your choice where those standards lies.\u003C/p\u003E\u003Cp\u003EAs far as KSP, 1.0 drops today. Let\u0027s wait and see what Squad has done. As an update, it actually looks pretty good. As an official 1.0 release update, have you seen the pool at the KSC? That\u0027s the type of polish I want from a 1.0. Of course there will be bugs, but the pool is not a bug. It\u0027s a deliberate decision on the part of the developer that having fake water in a pool is OK. It is not OK. It is a lack of polish, I as a costumer, will not accept.\u003C/p\u003E\u003Cp\u003E\u0022...but you\u0027ve already paid!\u0022 Such is the risk of early access. I have to bite the bullet on that one.\u003C/p\u003E\n"},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-04-27T13:14:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FleetAdmiralJ\u0022 data-cite=\u0022FleetAdmiralJ\u0022\u003E\u003Cdiv\u003EWow, the amount of cynicism here is breathtaking.\u003Cp\u003EAlso: How dare they pay themselves for working!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a joke buddy. Don\u0027t get all excited over it.\u003C/p\u003E\n"},{"CreatedByName":"crazyewok","CreatedById":97592,"CreatedDateTime":"2015-04-27T13:16:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stibbons\u0022 data-cite=\u0022stibbons\u0022\u003E\u003Cdiv\u003EDo you frequently walk around art galleries butting in to every conversation to shout that you don\u0027t think the artist finished?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo but then I have not brought that piece of art.\u003C/p\u003E\n"},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-04-27T13:19:18Z","Content":"\n\u003Cp\u003EOK. Wow. Who do I have to bribe to get this thread renamed the Hyperbole Train?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022crazyewok\u0022 data-cite=\u0022crazyewok\u0022\u003E\u003Cdiv\u003ENo but then I have not brought that piece of art.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you only do it around your house? That\u0027s comforting.\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-04-27T13:26:17Z","Content":"\n\u003Cp\u003EJust a reminder to please\u003C/p\u003E\u003Cp\u003Ea) be polite to other users\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E consider that other people might have differing opinions from you.\u003C/p\u003E\u003Cp\u003EHave a nice day!\u003C/p\u003E\n"},{"CreatedByName":"crazyewok","CreatedById":97592,"CreatedDateTime":"2015-04-27T13:26:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stibbons\u0022 data-cite=\u0022stibbons\u0022\u003E\u003Cdiv\u003EOK. Wow. Who do I have to bribe to get this thread renamed the Hyperbole Train?\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESo you only do it around your house? That\u0027s comforting.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWay to miss a point\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EMy point is if you buy something you have the right to criticize it if not up to the level it was marketed as.\u003C/p\u003E\u003Cp\u003EI believe in the old saying \u0022the customer is always right\u0022.\u003C/p\u003E\u003Cp\u003EAs for KSP?\u003C/p\u003E\u003Cp\u003EDunno yet if there is anything to moan about as Version 1.0 is not out yet.\u003C/p\u003E\u003Cp\u003EBut if its lacking I wont hold back criticism.\u003C/p\u003E\u003Cp\u003EA piece of art of hanging in a art gallery is not mine and I don not own it so even if I think it is a POS I wont demand anything from the artist.\u003C/p\u003E\n"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2015-04-27T13:48:05Z","Content":"\n\u003Cp\u003ETo be honest, I really don\u0027t care what version number they slap on it as long as they keep developing the game.\u003C/p\u003E\n"}]}