{"TopicId":105761,"ForumId":32,"TopicTitle":"My rockets are flipping out... a lot.","CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-04-28T20:21:08Z","PageNum":1,"Articles":[{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-04-28T20:21:08Z","Content":"\n\u003Cp\u003EI\u0027m not sure what I\u0027m doing wrong. Have they made the capsules extra heavy or something (making the ship top heavy)? The first stage is okay thanks to ailerons, but once I get to the second stage I start tumbling if I move more than 10 degrees beyond straight up. I can\u0027t even perform my gravity turn. This is my rocket: \u003Ca href=\u0022http://i.imgur.com/GrNyeGu.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/GrNyeGu.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m also having problems with re-entry. This is the return ship: \u003Ca href=\u0022http://i.imgur.com/Mbj6UzB.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Mbj6UzB.png\u003C/a\u003E I did my best to keep it perfectly aligned with the drag vector, but before the heat shield could even start to ablate it flipped right over, nose towards the ground, and very quickly exploded.\u003C/p\u003E\u003Cp\u003ECan anyone let me know if I\u0027m missing something obvious plz?\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-04-28T20:29:51Z","Content":"\n\u003Cp\u003EI guess we need a FAQ?\u003C/p\u003E\u003Cp\u003EAnyway, you want to launch, get barely off the pad, tilt your rocket a couple of degrees (ie. hardly anything) and then just let it fly. No SAS. No hard pitch overs. If your rocket is stable (and that looks like it should be), it will just fly itself. Keep acceleration at about 2g.\u003C/p\u003E\u003Cp\u003EAs for re-entry, read the threads on the heat shield problem. Start with just returning the capsule, not a materials lab and storage bay. (Also, if you want to do it the easy way, just stage your chutes before you re-enter the atmosphere. They will pop out and magically stop you.)\u003C/p\u003E\n"},{"CreatedByName":"Matt516","CreatedById":133442,"CreatedDateTime":"2015-04-28T20:32:00Z","Content":"\n\u003Cp\u003ESo here\u0027s the thing: what was often called a \u0022gravity turn\u0022 in old KSP isn\u0027t actually a gravity turn at all. In real life (and now KSP 1.0), rockets don\u0027t point off of prograde more than a few degrees while in atmo. Or they explode.\u003C/p\u003E\u003Cp\u003EA true gravity turn is simply pointing your rocket prograde the whole time (with a slight nudge off of vertical in the beginning to get things started) - as you follow your ballistic trajectory, the rocket will naturally turn as gravity brings it around. Hence \u0022gravity turn\u0022. Scott Manley has a nice tutorial video here:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/_q_8TO4Ag0E?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ESo to summarize - you don\u0027t turn a rocket more than 10 degrees off of prograde in real life, and now the Kerbals can\u0027t either. Gotta keep the rocket pointing prograde if you don\u0027t want to tumble. Makes sense?\u003C/p\u003E\n"},{"CreatedByName":"locustgate","CreatedById":81277,"CreatedDateTime":"2015-04-28T20:35:27Z","Content":"\n\u003Cp\u003EThey need to fix the heat shields, though you can by changing it\u0027s weight, I can\u0027t remember how exactly. Try losing the fins. Also now you start tilting at 5km and reach 45 at around 10km.\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-04-28T20:38:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022locustgate\u0022 data-cite=\u0022locustgate\u0022\u003E\u003Cdiv\u003EThey need to fix the heat shields, though you can by changing it\u0027s weight, I can\u0027t remember how exactly. Try losing the fins. Also now you start tilting at 5km and reach 45 at around 10km.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is just wrong.\u003C/p\u003E\u003Cp\u003EKeep the fins. Follow the advice Matt and I gave you. See how it works out.\u003C/p\u003E\n"},{"CreatedByName":"giltirn","CreatedById":66962,"CreatedDateTime":"2015-04-28T20:45:17Z","Content":"\n\u003Cp\u003EIf it falls over still, try adding more winglets to the base in order to move the center of lift further below the center of mass. As I understand it, the further the CoL from the CoM, the more stable your rocket is, i.e. the stronger the force keeping the rocket aligned with the prograde (direction of motion) vector, but the more difficult it is to turn. With lots of fins you should gravity turn early otherwise the lift/drag forces will prevent you from turning at all.\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2015-04-28T20:49:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PTNLemay\u0022 data-cite=\u0022PTNLemay\u0022\u003E\u003Cdiv\u003EI\u0027m not sure what I\u0027m doing wrong. Have they made the capsules extra heavy or something (making the ship top heavy)? The first stage is okay thanks to ailerons, but once I get to the second stage I start tumbling if I move more than 10 degrees beyond straight up. I can\u0027t even perform my gravity turn. This is my rocket: \u003Ca href=\u0022http://i.imgur.com/GrNyeGu.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/GrNyeGu.png\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA lot of people are really enthused about the \u0022actual gravity turn\u0022 concept of just turning off SAS and letting the turn go naturally. That\u0027s great for people who want to figure out the proper balance, but it\u0027s not necessary. You DO need to make slower, more gradual turns now, but there\u0027s no reason at all that ship you have there couldn\u0027t fly just fine. Though I do highly recommend using a \u0022swivel\u0022 or ... whatever they renamed the 909 to for that second stage. Or slap a small reaction wheel into that service compartment. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PTNLemay\u0022 data-cite=\u0022PTNLemay\u0022\u003E\u003Cdiv\u003EI\u0027m also having problems with re-entry. This is the return ship: \u003Ca href=\u0022http://i.imgur.com/Mbj6UzB.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Mbj6UzB.png\u003C/a\u003E I did my best to keep it perfectly aligned with the drag vector, but before the heat shield could even start to ablate it flipped right over, nose towards the ground, and very quickly exploded.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, know that heat shields are currently bugged, but it\u0027s an easy bug to fix. It\u0027s three lines of config that need to be changed (and will be in the next update), and easily done yourself in the meantime.\u003C/p\u003E\u003Cp\u003EOpen your game directory to \u0026lt;path\u0026gt;\\Kerbal Space Program\\GameData\\Squad\\Parts\\Aero\\HeatShield. There, you\u0027ll see HeatShield1.cfg Heatshield2.cfg and HeatShield3.cfg. Open each of them in notepad (or your text editor of choice) and look for \u0022PhysicsSignificance = 1\u0022. Change that 1 to a 0. Save and close. Repeat twice... you\u0027re done.\u003C/p\u003E\u003Cp\u003ESecond... is a bit more complicated. You have a logical arrangement of parts, but not a balanced one. The material science bay is a LOT lighter than the capsule, so it will act almost like a set of fins on the back, pulling that end around. Fixing the heat shield configs will help with this somewhat, since the shield will have mass again, but you\u0027ll still have to fight to keep it pointed the right way. Currently, the best solutions are either a) get EVA capability and just store your science in the capsule, and don\u0027t return the materials bay at all... or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E flip physics the middle finger and pop your parachute at 25km in the air, streaming fire all the way. A blast of plasma that will disintegrate a packed parachute does nothing to it once you deploy it, and it\u0027ll keep you pointed the right way as an added bonus.\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-04-28T21:09:43Z","Content":"\n\u003Cp\u003EThanks for all of the advice, I did manage a return eventually. It works, it\u0027s just a LOT more finicky than I thought it would be.\u003C/p\u003E\u003Cp\u003EI still mostly end up flying straight up and then completely circularizing once I\u0027m out of the atmosphere, because starting any proper turns in atmo have a 50/50 chance of ending in death spirals. It\u0027s embarrassing, I have nearly 400 hours logged in the game and I feel like a noob again, lol.\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-04-28T21:13:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PTNLemay\u0022 data-cite=\u0022PTNLemay\u0022\u003E\u003Cdiv\u003EThanks for all of the advice, I did manage a return eventually. It works, it\u0027s just a LOT more finicky than I thought it would be.\u003Cp\u003EI still mostly end up flying straight up and then completely circularizing once I\u0027m out of the atmosphere, because starting any proper turns in atmo have a 50/50 chance of ending in death spirals. It\u0027s embarrassing, I have nearly 400 hours logged in the game and I feel like a noob again, lol.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe more you learned how the old physics worked, the more you have to forget in order to play the new physics.\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2015-04-28T21:15:49Z","Content":"\n\u003Cp\u003EI\u0027m just glad I started playing FAR about six months ago. I had time to get used to the whole \u0022flippy rocket\u0022 concept before a similar issue showed up in stock.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2015-04-28T21:42:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PTNLemay\u0022 data-cite=\u0022PTNLemay\u0022\u003E\u003Cdiv\u003EI still mostly end up flying straight up and then completely circularizing once I\u0027m out of the atmosphere, because starting any proper turns in atmo have a 50/50 chance of ending in death spirals.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re probably going too fast. Try adjusting the thrust of that SRB until it just barely lifts off the pad.\u003C/p\u003E\n"},{"CreatedByName":"giltirn","CreatedById":66962,"CreatedDateTime":"2015-04-28T21:56:28Z","Content":"\n\u003Cp\u003EOne issue I find is that the gimbal controls are very jerky, and if you overturn it can be impossible to stop the rocket from falling over unless you have huge amounts of control authority (which exacerbates the jerkiness). This is made worse if you don\u0027t strut your craft to the gills to prevent it flopping around. I think the only real solution is to improve SAS to make it smoother; currently it is pretty much useless as you always seem to end up fighting it, and it always seems to overcorrect.\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-04-28T22:05:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jarin\u0022 data-cite=\u0022Jarin\u0022\u003E\u003Cdiv\u003EFirst, know that heat shields are currently bugged, but it\u0027s an easy bug to fix. It\u0027s three lines of config that need to be changed (and will be in the next update), and easily done yourself in the meantime.\u003Cp\u003EOpen your game directory to \u0026lt;path\u0026gt;\\Kerbal Space Program\\GameData\\Squad\\Parts\\Aero\\HeatShield. There, you\u0027ll see HeatShield1.cfg Heatshield2.cfg and HeatShield3.cfg. Open each of them in notepad (or your text editor of choice) and look for \u0022PhysicsSignificance = 1\u0022. Change that 1 to a 0. Save and close. Repeat twice... you\u0027re done.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just realized, this is a considerable bug because...\u003C/p\u003E\u003Cp\u003E1) A lot of new players will have just started playing the game, on account of the whole \u0022waiting until 1.0 came out before playing\u0022 bit.\u003C/p\u003E\u003Cp\u003E2) Many of them won\u0027t know how to spot these bugs, much less how to fix them with part-file editing.\u003C/p\u003E\u003Cp\u003E3) Heat shields are really important, even early on in the game. As soon as you accomplish your first orbit you implicitly require a heat shield.\u003C/p\u003E\u003Cp\u003EI would have expected them to hot-fix a bug like that ASAP. We don\u0027t want new players getting scared off by bugs that make flying nonsensical. I mean... the ships do still fly, even with an imbalanced shield. So it might not be such a big deal. Still, I hope it\u0027s not bothering too many players.\u003C/p\u003E\n"},{"CreatedByName":"Bstankovich","CreatedById":142111,"CreatedDateTime":"2015-04-28T22:14:34Z","Content":"\n\u003Cp\u003EEven using stock craft I can\u0027t get it above a kilometer. I tried using the advice earlier in this thread and it still inevitably flips on me no matter what\u003C/p\u003E\n"},{"CreatedByName":"Hanuman","CreatedById":116709,"CreatedDateTime":"2015-04-28T22:20:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PTNLemay\u0022 data-cite=\u0022PTNLemay\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI would have expected them to hot-fix a bug like that ASAP. We don\u0027t want new players getting scared off by bugs that make flying nonsensical. I mean... the ships do still fly, even with an imbalanced shield. So it might not be such a big deal. Still, I hope it\u0027s not bothering too many players.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are. Look at the announcements, they\u0027re already hard at work on 1.0.1\u003C/p\u003E\n"}]}