{"TopicId":105882,"ForumId":32,"TopicTitle":"No more SSTO\u0027s","CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2015-04-29T03:47:08Z","PageNum":2,"Articles":[{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2015-04-29T04:52:57Z","Content":"In ye olden days (ie last week) I built SSTOs without airhogging. In both beta and in FAR aerodynamics. I almost never made a SSTO that could make over 1500m/s on jets (except for one time I built a pure jet that I made specifically to make 2000m/s at 40km, and that was 5 intakes for one turbojet), so now only making 1300m/s is not so bad (I can carry some thrust through 1200m/s just fine). Yes it requires another 1000m/s to get to LKO and yes jets suck more fuel than they used to (or at least the turbojet and rapier do), but I would hardly call my 200m/s lost to be gamebreaking. I repeatedly made orbit with two rapiers and some fuel, and had some to spare at the end.\n\nHonestly right now my struggle is with getting them \\*back\\* from orbit. Until the thermal model gets retuned it seems impossible without exploiting silly things like re-entry parachutes, airbrakes (which are IMO too effective at hypersonic speeds), or extra nosecones (like throwing cubic octagonal struts on the front). The Mk2 cockpit seems doomed to explode using any of the common re-entry trajectories I\u0027ve tried (though actually the back of my fuselage explodes shortly before, and my engines aren\u0027t even back there. I suspect there is an issue with how I mounted the part backwards to taper to a point and/or that it\u0027s behind a cargo hold.).\n\nThe key feature of an SSTO is that they are re-usable, not that they save fuel (they use more dV, though the jet ISP offsets some of this) or are more efficient at getting things to orbit. Yes they are harder in 1.0, but certainly not impossible."},{"CreatedByName":"duckofthemoon","CreatedById":43214,"CreatedDateTime":"2015-04-29T04:56:47Z","Content":"@\u0022Roflcopterkklol\u0022\n\nJust because you can\u0027t make an SSTO that doesn\u0027t mean it\u0027s impossible.\n\nOther people have...\n\nComplaining about the game\u0027s balance is also a moot point. If you don\u0027t like it, do something for yourself and don\u0027t complain, or just don\u0027t complain at all.\n\n**Edited \u003Ctime datetime=\u00222015-04-29T05:00:27Z\u0022 title=\u002204/29/2015 05:00  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by duckofthemoon**\n  \nwords"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2015-04-29T04:57:34Z","Content":"\u003E \n\u003E Until the thermal model gets retuned it seems impossible without exploiting silly things like re-entry parachutes, airbrakes (which are IMO too effective at hypersonic speeds), or extra nosecones (like throwing cubic octagonal struts on the front). The Mk2 cockpit seems doomed to explode using any of the common re-entry trajectories I\u0027ve tried (though actually the back of my fuselage explodes shortly before, and my engines aren\u0027t even back there.\n\nWhat I\u0027d propose is a simple \u0022tile\u0022 ablative system for cockpits and payload bays, and also for spaceplane-specific fuel tanks. These will just appear as \u0022texture swaps\u0022 (i.e. showing tile textures on the lower surface of spaceplanes and or wing sections) if you select them as your part in a spaceplane you\u0027re constructing. By choosing this variant of that part, your spaceplane will have more overall weight, yet the part will be more robust on re-entry, provided that you correctly orient your craft. If this gets implemented, I\u0027ll be a happy man, and won\u0027t rely much on \u0022airbrake cheating\u0022 anymore."},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2015-04-29T05:03:14Z","Content":"I would be fine with this new system if it wasn\u0027t springing a new complication at me at every turn. Some things I can overcome with a little engineering, others just make it impossible.\n\nWant to get to orbit with a turbojet/NERVA spaceplane? Suddenly all the jets cut out at 20KM up. Oh. Well, what if I try a shallower ascen... I just exploded. Maybe a steep ascent getting as close as possible to overheat without actually getting there? Oh good, I\u0027ve got a 60KM apoapsis. Now, if I fire my nuke engine, I should be able to get to orbit quite easil... the engines exploded from overheating. They never did that before. Maybe if I run them at a lower throttle. Nope, still explode. Oooh, Squad says use solar panels as radiators... No, they do nothing. Someone else says use wings. Nope, that just slows me down on ascent and makes it harder to get to space in the first place. Maybe if I fit the nukes to a different part, it\u0027ll take more of the heat? Nope.\n\nNope.\n\nNope.\n\nNope\n\nhave I made my point yet\n\nfrigging \u0027nope\u0027. Seriously, Squad added an air pre-cooler part so that things don\u0027t overheat in atmosphere. *why* is there not a dedicated radiator part for space? This *really* frustrates me."},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-04-29T05:05:38Z","Content":"\u003E \n\u003E Who builds a non plane SSTO? \n\u003E The only ones i ever see are lifting rockets and they were air hoggers which used turbo jets to get up to orbital velocity before going above 40km which will not work anymore...\n\u003E \n\u003E As far as rapiers go...\n\u003E \n\u003E Sue me for not wanting to be stuck with a single type of enigine when building space planes, i like the ability to make a useful plane out of a combination of jet/rocket engines.\n\u003E \n\u003E Even saying that the rapiers are still useless because you need to carry 1000m/s of delta v to escape the atmosphere, never mind any maneuvers in space or orbit, rendering SSTO\u0027s useless. \n\u003E \n\u003E Whats the point of the large cargo bays? they cant be used.\n\u003E \n\u003E Or do i build a 100 ton SSTO to deliver something in a small mk2 cargo bay to a 70km orbit and act like im enjoying myself when i know it could be better lol? \n\u003E \n\u003E The devs dun goofed.\n\nBack in 0.25 I made lots of rocket SSTO, in 0.90 they was not cost effective, my main launchers was SSTO planes for light cargo and crew, SRB with returnable core for larger stuff.\n\nNow the only issue with returning is accurate enough landing, braking parachutes and air brakes should take care of the rest."},{"CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2015-04-29T05:06:51Z","Content":"\u003E \n\u003E In ye olden days (ie last week) I built SSTOs without airhogging. In both beta and in FAR aerodynamics. I almost never made a SSTO that could make over 1500m/s on jets (except for one time I built a pure jet that I made specifically to make 2000m/s at 40km, and that was 5 intakes for one turbojet), so now only making 1300m/s is not so bad (I can carry some thrust through 1200m/s just fine). Yes it requires another 1000m/s to get to LKO and yes jets suck more fuel than they used to (or at least the turbojet and rapier do), but I would hardly call my 200m/s lost to be gamebreaking. I repeatedly made orbit with two rapiers and some fuel, and had some to spare at the end.\n\u003E Honestly right now my struggle is with getting them \\*back\\* from orbit. Until the thermal model gets retuned it seems impossible without exploiting silly things like re-entry parachutes, airbrakes (which are IMO too effective at hypersonic speeds), or extra nosecones (like throwing cubic octagonal struts on the front). The Mk2 cockpit seems doomed to explode using any of the common re-entry trajectories I\u0027ve tried (though actually the back of my fuselage explodes shortly before, and my engines aren\u0027t even back there. I suspect there is an issue with how I mounted the part backwards to taper to a point and/or that it\u0027s behind a cargo hold.).\n\u003E \n\u003E The key feature of an SSTO is that they are re-usable, not that they save fuel (they use more dV, though the jet ISP offsets some of this) or are more efficient at getting things to orbit. Yes they are harder in 1.0, but certainly not impossible.\n\nTo get them back just put air brakes all over them, i have 16 on my plane and it slows to 1200ms by 30km with them open from a 90km drop at 2200m/s.\n\nMaybe its just i don\u0027t like change... \n\nI could just make all my craft 2 stage to orbit but the idea of it irritates me."},{"CreatedByName":"rrkss","CreatedById":134069,"CreatedDateTime":"2015-04-29T05:22:13Z","Content":"The way I\u0027ve been able to get back from a 150km x 150km orbit with a space plane is set the periapsis to 48km and re-enter the atmosphere with the nose pitched up at 40 degrees."},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2015-04-29T05:29:38Z","Content":"\u003E \n\u003E ...with the nose pitched up at 40 degrees.\n\nJust like the Shuttle does. Unfortunately, with the current heating system, nothing will protect some parts of your craft from blowing up, even if your craft re-enters in this realistic orientation, unless you activate air brakes. I still lobby for that tile system...a tile system and 40-degree pitch up (and without having to rely on the current air brakes) is gonna looks sweet AND realistic. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n**Edited \u003Ctime datetime=\u00222015-04-29T05:32:30Z\u0022 title=\u002204/29/2015 05:32  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by rodion\\_herrera**"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2015-04-29T05:42:51Z","Content":"Alright so the Mk2 cockpit wasn\u0027t behaving (kept exploding on re-entry) so I decided to try minimal: I strung together a ram intake, Mk1 inline, 2 FL-T800 fuel tanks (minus a little oxidizer), and a RAPIER. I bolted on two delta wings and a pair of elevons, a delta deluxe winglet as a rudder, an RTG, and a landing gear. It only made around 1000-1100m/s on the jet but still had 1200m/s of dV left in the tank once it made orbit. It would have had a little more if I\u0027d guessed the LF consumption better to balance with the O.\n\nA ship big enough to utilize an LV-N could probably make a moon landing and return if it wanted, extrapolating from here. Maybe I\u0027ll aim to do that tomorrow.\n\nThe ship is a little low on lift and has poor elevator authority (a horizontal stabilizer with a proper elevator would fix that), but it flies alright. It re-entered without incident with just maybe 10deg of nose-up during descent. No stalls, airbrakes, or parachutes to kill speed. There\u0027s a lot of thermal inconsistency with parts, it seems."},{"CreatedByName":"Enorats","CreatedById":141841,"CreatedDateTime":"2015-04-29T05:49:27Z","Content":"I\u0027ve given up on spaceplanes. Just done. They used to be all I used, even going so far as to build 300\u002B ton planes pushed into orbit by turbojets and B9 SABER M\u0027s (basically large RAPIER\u0027s) to use as orbital fuel stations (they could make orbit with 80% of their 25k or so LFO still left.. enough to go anywhere with a few LV-N\u0027s they carry for space).. but now I can\u0027t get anything up. Airbreathers flame out too low, and they burn up at any altitude they can operate at."},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2015-04-29T06:07:32Z","Content":"So far I haven\u0027t had much luck with SSTOs so I\u0027m a little discouraged... I just assumed I could drag out my pre-1.0 ones, do a couple modifications, and keep on rolling. Not quite. Good news is they all fly fine in atmo with minor tweaks (at least, at reasonable speeds and altitudes below 20km), bad news is not one will get me an apo above 65km as of right now. I\u0027m getting close with a scaled down version of one that used to be very successful. Funny part about that is the larger one used to be my \u0022masterpiece\u0022 that outperformed any SSTO or atmospheric plane for that matter that I had built, in every way. Now it\u0027s a deathtrap the instant I switch to closed cycle and nose up. The smaller version I\u0027ve been tweaking, which used to be slow as molasses and barely able to take a payload up, is now insanely fast and surprisingly stable compared to everything else I\u0027ve dusted off so far. Still no orbit though.\n\nButthurt aside (I spent a lot of time on these), I think it\u0027s going to be fun once I get the hang of it again."},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-04-29T06:22:32Z","Content":"Stock SSTOs are still trivially simple. The first thing I threw together in NuStock:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/iVVwB)"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-04-29T06:29:12Z","Content":"\u003E \n\u003E ironically it gets easier with larger and larger spaceplanes.\n\nNot totally unreasonable: for any given shape, drag increases with the 2nd power of the size, while mass increases with the third power. If you get large enough, drag becomes neglegible. Overall. \n\nIn real life, you need to reinforce the vessel so the more outlying bits won\u0027t be blown off... those reinforcements add weight that wasn\u0027t there in the smaller version, and often increase the surface area as well. But in KSP, scaling up is easier to do."},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-04-29T06:55:01Z","Content":"If you can cram it into the mk3 bay, my SSTOs can lift it.\n\nFirst design, turbo-ramjet/rapier hybrid:\n\n![10986175_10103548407260233_3056408651622725291_n.jpg?oh=9fb75b1210df356aa49b62f443497f09\u0026oe=55C6C245](https://scontent-fra.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/10986175_10103548407260233_3056408651622725291_n.jpg?oh=9fb75b1210df356aa49b62f443497f09\u0026oe=55C6C245)\n\n![11205152_10103548408288173_5405657931943816741_n.jpg?oh=7bff57b1435c0c04bae949e0be3e5dd7\u0026oe=55DE75B6\u0026__gda__=1439780323_f5fa0ddde63b7ef1e9deccd23d576d6d](https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/11205152_10103548408288173_5405657931943816741_n.jpg?oh=7bff57b1435c0c04bae949e0be3e5dd7\u0026oe=55DE75B6\u0026__gda__=1439780323_f5fa0ddde63b7ef1e9deccd23d576d6d)\n\n2nd design... I haven\u0027t even optimized my ascent profile yet.\n\nTonight when I get back, I\u0027ll be working on my 100 ton to orbit design that will keep everything in an aeroshell with aa 3.75m base.\n\nThat one should be quite useful."},{"CreatedByName":"Torham234","CreatedById":58574,"CreatedDateTime":"2015-04-29T07:39:18Z","Content":"\u003E \n\u003E \\**picture of a crazy contraption*\\*\n\u003E \n\u003E SSTO\u0027d that and I wasn\u0027t even trying to. Even managed to kick it out to the Mun and hit it.\n\nOh boy, here we go again! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2015-04-29T07:48:00Z","Content":"I was able to make one, but the cockpit exploded. Second try, heatshield\u002Bfairing, was working well, some stuff uncovered exploding, nothing major, then suddenly massive spin and it exploded. Somehow the airplane body\u002Bfairing created a lifting body and saved the crew, awesome!"},{"CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2015-04-29T07:52:56Z","Content":"\u003E \n\u003E I was able to make one, but the cockpit exploded. Second try, heatshield\u002Bfairing, was working well, some stuff uncovered exploding, nothing major, then suddenly massive spin and it exploded. Somehow the airplane body\u002Bfairing created a lifting body and saved the crew, awesome!\n\nI have managed to get mine into LKO, I am hearing it has a lot to do with the pilot, i think i might just be flying my plane like a chump\n\n![WcI7WPp.jpg](http://i.imgur.com/WcI7WPp.jpg)\n\n![7XIm8H0.jpg](http://i.imgur.com/7XIm8H0.jpg)"},{"CreatedByName":"Gravaar","CreatedById":83438,"CreatedDateTime":"2015-04-29T08:17:08Z","Content":"\u003E \n\u003E I have managed to get mine into LKO, I am hearing it has a lot to do with the pilot, i think i might just be flying my plane like a chump\n\nNO. Like everyone else you just need to work out the new \u0022best\u0022 flight path\n\n\u0022MOAR BOOSTERS :)\u0022"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-04-29T08:50:04Z","Content":"\u003E \n\u003E To get them back just put air brakes all over them, i have 16 on my plane and it slows to 1200ms by 30km with them open from a 90km drop at 2200m/s.\n\u003E Maybe its just i don\u0027t like change... \n\u003E \n\u003E I could just make all my craft 2 stage to orbit but the idea of it irritates me.\n\nMy first design that worked had... 2...\n\nMy 2nd design... 4\n\nI could reenter without them, just a matter of pitching up enough to generate a good amount of lift and drag, such that you don\u0027t drop too low while still going too fast.\n\nI\u0027d love to be able to just follow prograde the whole way in until I\u0027m ready to land.... right now I\u0027m having a hard time judging when to deorbit to come in back at KSC.\n\nMy first deisgn, I got back at the west end of the KSC continent, and then re-lit jets to fly to KSC... but went too fast too low in the atmosphere (I was accelerating and climbing, the Reentry was successful), and lost my canards... I shifted all fuel to the back, and was able to keep flying... then I\u0027m not sure what I did, but the enxt problem was a structural failure between one of the fusalage fuel tanks and the cargo bay... the front section with the 4 rapiers came off... the canards had already come off....but it stabilized pointing retrograde... and still had some fuel in it... perfect... rapiers were functional and could be used as retrorocket/jets... rapiers on... but I didn\u0027t judge the throttle and timing right... but thankfully the mk3 cockpit has a good impact tolerance... the crew survived.\n\nThats why design #2 uses a canard with a higher heat tolerance... I\u0027m thinking of adding struts to reenforce the cargobay-fusalagefuel tank joints."},{"CreatedByName":"djnattyd","CreatedById":63737,"CreatedDateTime":"2015-04-29T09:05:55Z","Content":"Basically what I\u0027ve gotten from this is people are trying to build SSTOs that are suited to the old souposphere."},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2015-04-29T09:16:43Z","Content":"Welcome to reality! And we\u0027re talking about a lilliputian system, try that on the solar system.\n\nThat\u0027s the way things are in the real world, and that\u0027s the way they should be in Kerbal. This is no ordinary game, this is rocket science! Now you\u0027ll give more credit to those guys working hard at places like NASA, ESA and SpaceX uh? ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nNext step? Add remote tech and life support mods, for another taste of the \u0022real\u0022 ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"wired2thenet","CreatedById":18275,"CreatedDateTime":"2015-04-29T09:16:59Z","Content":"In a recent post (pre-1.0) I managed to get this baby into orbit with little or no problem: [http://forum.kerbalspaceprogram.com/threads/107567-SSTO-Jet-Engine-RCS-only?p=1675000#post1675000](https://forum.kerbalspaceprogram.com/threads/107567-SSTO-Jet-Engine-RCS-only?p=1675000#post1675000)\n\nIt isn\u0027t realistic at all, and something I noted immediately when it happened, because it was a total accident. [NASA doesn\u0027t even have one right now](https://en.wikipedia.org/wiki/Single-stage-to-orbit), and never did even though concepts are on the table. It\u0027s a dream that *can probably* be done (and someone will eventually in KSP if they haven\u0027t done it already), but ... like Rocket Science ...\n\n... *it\u0027s extremely hard.*"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-04-29T09:20:44Z","Content":"So far I\u0027ve not had any luck with SSTO spaceplanes, but seeing what some of you have managed gives me hope. \n\n\u003E \n\u003E Stock SSTOs are still trivially simple. The first thing I threw together in NuStock:\n\u003E [http://imgur.com/a/iVVwB](http://imgur.com/a/iVVwB)\n\n\u003E \n\u003E If you can cram it into the mk3 bay, my SSTOs can lift it.\n\u003E First design, turbo-ramjet/rapier hybrid:\n\u003E \n\u003E [https://scontent-fra.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/10986175_10103548407260233_3056408651622725291_n.jpg?oh=9fb75b1210df356aa49b62f443497f09\u0026oe=55C6C245](https://scontent-fra.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/10986175_10103548407260233_3056408651622725291_n.jpg?oh=9fb75b1210df356aa49b62f443497f09\u0026oe=55C6C245)\n\u003E \n\u003E [https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/11205152_10103548408288173_5405657931943816741_n.jpg?oh=7bff57b1435c0c04bae949e0be3e5dd7\u0026oe=55DE75B6\u0026__gda__=1439780323_f5fa0ddde63b7ef1e9deccd23d576d6d](https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/11205152_10103548408288173_5405657931943816741_n.jpg?oh=7bff57b1435c0c04bae949e0be3e5dd7\u0026oe=55DE75B6\u0026__gda__=1439780323_f5fa0ddde63b7ef1e9deccd23d576d6d)\n\u003E \n\u003E 2nd design... I haven\u0027t even optimized my ascent profile yet.\n\u003E \n\u003E Tonight when I get back, I\u0027ll be working on my 100 ton to orbit design that will keep everything in an aeroshell with aa 3.75m base.\n\u003E \n\u003E That one should be quite useful.\n\nThese two show that both small and large SSTO\u0027s are possible, I\u0027ve just not had the ah-ha moment with the new aero. Could you guys take a moment out from building awesome aircraft and explain what your flight profile is like now.\n\nUpdate:\n\nJust made a copy of Wanderfound\u0027s small SSTO and realised he\u0027d put his flight profile in the imgur album description. Followed that and presto, I reached orbit!! (and returned safely). Thanks Wanderfound!!\n\n**Edited \u003Ctime datetime=\u00222015-04-29T09:48:06Z\u0022 title=\u002204/29/2015 09:48  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by katateochi**"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2015-04-29T09:23:18Z","Content":"I turned the heating difficulty slider to 120%. It was a mistake ... ![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif)\n\nQuite a big step up in difficulty compared to previous FAR\u002BDRE. Stuff just explodes at mach 2 already. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) I managed to make an SSTO plane though. It just has lost its canards and therefore won\u0027t be able to return ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Teutooni","CreatedById":76518,"CreatedDateTime":"2015-04-29T09:36:01Z","Content":"Spaceplanes are definitely possible still. Coming from FAR\u002BDRE\u002BAJE I\u0027d say current stock is easier. Did a 130-ton spaceplane and lifted 20-tons of cargo in a mk3 bay to 100km circular orbit with plenty of fuel left. If I used the payload as fuel the plane could probably land on minmus, drill and refine to full fuel again and go pretty much anywhere. Possibly. And it was a horribly wobbly design. One thing I noticed is control surfaces create enormous amounts of drag, so any small oscillations your plane does reduces efficiency a lot. On that note, I found just by using control surfaces to airbrake the new actual airbrake parts were unnecessary."}]}