{"TopicId":106084,"ForumId":32,"TopicTitle":"Well that was time well spent...","CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-04-29T19:51:28Z","PageNum":1,"Articles":[{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-04-29T19:51:28Z","Content":"\n\u003Cp\u003EI spent so much time trying to design a plane with only the basic jets that could reach an altitude of 18.5 k realiablly and without using any extreme maneuvers. Why? I had a contract with that altitude and 16.5 and 17.5 listed altitudes to do a temp scan. I only had the basic jet engine available and was determined this mission would be completed by a plane with those engines.\u003C/p\u003E\u003Cp\u003EAfter many failed attempts first trying light and fast to operate push up to those altitudes, then trying the \u0022Moar Boosters\u0022 approach, I was using more jets, since losing thrust was the main issue at altitudes above 10k. The more engines worked for very little altitude gains. I spent roughly 15 hours trying to come up with a pure jet design, I would see very slight improvements with each attempt then I eventually seemed to hit a wall.\u003C/p\u003E\u003Cp\u003EI finally decided a pure jet plane for this contract was not feasiable and decided to go with an jet/rocket hybrid. Jet engines would carry me to the target area and to around 13k and the rocket engine would take me the rest. I spent roughly 4-5 hours designing a plane that would remain stable when the rocket fired at both high and low altitudes, stable in normal flight, capable of rough terrain landings, able to hit Mach I with the jet engines alone, enough fuel capacity to use the rockets multiple times and leave enough fuel to return to the KSC and the usual stuff.\u003C/p\u003E\u003Cp\u003EI had my design tested and proofed then took off to head to the first target area to get the tempature scan. Nearing the area I double check the altitude I need to reach to meet the mission criteria and realized I was already at the target altitude. The contract requirments was to be at any altitude below what was listed.\u003C/p\u003E\u003Cp\u003EThe good news I now have a design standing by in case any missions popup requiring a plane capable of long range flight and multiple ascents to altitudes around 22k or capable of suborbital flight.\u003C/p\u003E\u003Cp\u003EPS: I am not being sarcastic in the title of this thread. really enjoyed the design challenges, failures requiring to go back to the drawing board and it was fun trying and eventual coming up with something close to what was originally conceived.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-04-29T20:08:46Z","Content":"\n\u003Cp\u003EI\u0027m having trouble with a contract testing the basic jet at 25,000m going 300m/s.\u003C/p\u003E\u003Cp\u003EThat\u0027s... Like any oxymoron or something. But I gotta make sure its not \u0022below 25000m \u0022 like you said. Pretty sure it\u0027s not seeing is how the altitude parameters never went green.\u003C/p\u003E\n"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2015-04-29T20:13:39Z","Content":"\n\u003Cp\u003EI am in the middle of building a simple jet plane and I am struggling to keep the thing stable. Now, I wasn\u0027t much of a plane builder before 1.0, but at the moment all I do is crash \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Seems like the simple tricks I used to build a stable plane don\u0027t apply anymore. Back to the drawing board...\u003C/p\u003E\u003Cp\u003EOh, and I killed Jeb.\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-04-29T20:35:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EI\u0027m having trouble with a contract testing the basic jet at 25,000m going 300m/s.\u003Cp\u003EThat\u0027s... Like any oxymoron or something. But I gotta make sure its not \u0022below 25000m \u0022 like you said. Pretty sure it\u0027s not seeing is how the altitude parameters never went green.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou aren\u0027t going to get up there on jet power, but there\u0027s nothing saying you can\u0027t bring a jet up there on rocket power.\u003C/p\u003E\n"},{"CreatedByName":"Snooze","CreatedById":67712,"CreatedDateTime":"2015-04-29T21:43:08Z","Content":"\n\u003Cp\u003EOr build all your speed in a vertical climb then go ballistic when the engines flame out. Coast that baby onwards and upwards. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-04-29T22:49:34Z","Content":"\n\u003Cp\u003EI suppose I could develop a purpose built craft that can bring test parts up to their specified parameters. The hard part is keeping the craft at those parameters. Rockets are a complete pain to test parts on that need s certain altitude and speed. It\u0027s gotta be a plane. Or in this case a rocket propelled plane. Tuff part about rockets is they don\u0027t last very long. Whatever it is I need to get done I have a short window to work with. \u003C/p\u003E\u003Cp\u003EAnd I\u0027ve only got the very first liquid rocket engine you can get. Fun times ahead for sure.\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2015-04-30T03:01:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snooze\u0022 data-cite=\u0022Snooze\u0022\u003E\u003Cdiv\u003EOr build all your speed in a vertical climb then go ballistic when the engines flame out. Coast that baby onwards and upwards. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOoo, this reminded me of the zoom climb. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Zoom_climb\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Zoom_climb\u003C/a\u003E I wonder if this works in KSP.\u003C/p\u003E\n"},{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-04-30T03:16:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xavven\u0022 data-cite=\u0022Xavven\u0022\u003E\u003Cdiv\u003EOoo, this reminded me of the zoom climb. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Zoom_climb\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Zoom_climb\u003C/a\u003E I wonder if this works in KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does just not to the altitudes pre 1.0. Highest I got on the basic jets alone was around 13-14k. I managed 15K once with a very light overpowered plane but the problem was it was somewhat short ranged and had stability issues because of speed. I am sure someone can exceed those heights, really the first time I am spending any meaningful time on planes for atmospheric flight. Usually I am focused on rockets.\u003C/p\u003E\n"}]}