{"TopicId":106670,"ForumId":32,"TopicTitle":"Stock Apollo/Saturn V , build one, say how good it performs","CreatedByName":"SkyRex94","CreatedById":114868,"CreatedDateTime":"2015-05-01T20:47:22Z","PageNum":1,"Articles":[{"CreatedByName":"SkyRex94","CreatedById":114868,"CreatedDateTime":"2015-05-01T20:47:22Z","Content":"Hello Community,\n\nI\u0027m in the process of updating my Rescale-Mod (SKRX), but I have something new to consider:\n\n1.0 rebalanced a lot, especially the engines. My Mod aims for a realistic experience without any big reconfig mods, but with the stock parts. It shall feel like a real Challenge but with all the stock parts, Kerbalistic experience as I call it. \n\nSo there is one thing that can be a benchmark for this: Something that should work is a classic Apollo mission.\n\nNow everybody has different building styles, so I thought I start a Thread on this. Build a Saturn V out of stock parts (5m tanks and adapters are allowed but stock engines only), and post here how it performs and what it is capable of.\n\nrequired would be:\n\nA command module and a lander, they dock together, only command returns to Kerbin. (Lander can but doesn\u0027t have to be 2 stage) \n\nA three stage Rocket. shall look roughly apollo like, try to get as much Delta-V out of it as you can while maintaining a Saturn V look. \n\nWhats interesting: TWR and DeltaV of the lander\n\nDeltaV of the command Module (with lander attached)\n\nDeltaV of the Saturn V launch stages.\n\nSome experience so far: the Poodle got extremly weak in terms of thrust... \n\nNot sure if general is right place, but did\u0027nt really fit anywhere else... Not a mod request or tutorial or support question so... well if any Mod thinks another place is better feel free to move \n\nCheers"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-05-01T21:02:31Z","Content":"Already been on that for awhile, so may as well share ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThis is all stock career mode (all default settings other than reentry turned up to 120%), so I\u0027ve been limited by the parts I have purchased, but I\u0027ve been slowly evolving a Saturn V/Apollo style design since the start of it, which has resulted in this:\n\n\u003E ![KDXuKSu.png](http://i.imgur.com/KDXuKSu.png)\n\nPretty happy with it overall, other than the additional supports/strutting required in the middle, and the slight buldge on the LM fairing as I didn\u0027t want to use 1.25m parts for it rather than 2.5m.\n\nWorks with mid-flight docking with the LM and all that:\n\n\u003E \n\u003E ![iEwpUom.png](http://i.imgur.com/iEwpUom.png)\n\u003E \n\u003E \n\nWorks great. My last missions with it was a manned landing on Minmus and I had a ton of fuel to spare. Definitely not the most efficient design for that tech level, but I was finding career mode way too easy anyways, so I decided to start building for looks rather than efficiency at some point ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nDon\u0027t have any hard delta-V figures or what have you as I don\u0027t use KER or other engineering aids and just build and fly by feel. Best I can say there is \u0022way more than capable of performing a Mun or Minmus landing and beyond\u0022 ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nEDIT: That\u0027s an LV-909 on the bottom of the LM itself BTW, in case it\u0027s obscured by the screenshot.\n\n**Edited \u003Ctime datetime=\u00222015-05-01T21:14:21Z\u0022 title=\u002205/01/2015 09:14  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 1, 2015\u003C/time\u003E by FlowerChild**"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2015-05-01T21:38:05Z","Content":"My Saturn V style rocket works fine, but I use a non-stock lander can purely because it looks way better than the stock 2-man lander can, so I won\u0027t post it here."},{"CreatedByName":"SkyRex94","CreatedById":114868,"CreatedDateTime":"2015-05-01T21:43:28Z","Content":"Well just discovered 1.0.1 OR 1.0.2 changed the vaccum TWRs of all \u003E=Terrier Engines back to its 0.90 value. So the only real balancing issue is now the reduced ISP...\n\nNot such a big issue anymore as it was before"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-05-01T21:51:12Z","Content":"I have a now stock Apollo style lander (it wasn\u0027t stock till 1.0). I mean it\u0027s not a total replica but as close as I could get (I wanted it to use only 2m parts, the lander can only support 1, and it needs booster tanks though in 1.0 I replaced them with SRB\u0027s). I don\u0027t have any screenies of it, but here is the 0.90 version screenshots of it with only Proc Fairings and FAR as a mod.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/MSCZX)\n\nI\u0027m not sure I understand exactly what you want to know.\n\n**Edited \u003Ctime datetime=\u00222015-05-01T21:54:01Z\u0022 title=\u002205/01/2015 09:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 1, 2015\u003C/time\u003E by Alshain**"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-02T02:08:28Z","Content":"I had one that I built in 0.23, currently trying to rebalance it."},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-05-02T02:16:08Z","Content":"\u003E \n\u003E Well just discovered 1.0.1 OR 1.0.2 changed the vaccum TWRs of all \u003E=Terrier Engines back to its 0.90 value. So the only real balancing issue is now the reduced ISP...\n\u003E Not such a big issue anymore as it was before\n\nI actually dont mind the ISP nerfs, it makes refueling or IRSU actually worthwhile, but its not such a nerf as to make engines useless. Still, regardless of what people say, the nuke still is the ultimate space engine, given that it didnt get any nerfs except heat buildup, something thats just a trick to build around using wings/radiators. I think the game is more enjoyeable now, although one thing that never changed is that there are many many engines that make no sense to use as they are either redundant or have another alternative engine that does far better."}]}