{"TopicId":107286,"ForumId":32,"TopicTitle":"Debris and Escape Pod question","CreatedByName":"Bar27262","CreatedById":141348,"CreatedDateTime":"2015-05-03T21:06:19Z","PageNum":1,"Articles":[{"CreatedByName":"Bar27262","CreatedById":141348,"CreatedDateTime":"2015-05-03T21:06:19Z","Content":"In all of your time of playing Kerbal Space Program, how many times has debris came close to your ship? How many times has debris hit your ship? Was there any time in which you ever had to use Escape Pods? If so, why?"},{"CreatedByName":"xrayfishx","CreatedById":76147,"CreatedDateTime":"2015-05-03T21:13:04Z","Content":"Your poll implies that everyone has either had a close call with debris or isn\u0027t capable of even reaching space. I have had no close calls because I keep my orbits clean, but I can get where ever the hell I want in stock. Please fix this."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-03T21:15:09Z","Content":"Er..define \u0027almost struck\u0027?\n\nI\u0027ve had debris pass through the old physics bubble (~2.5km prior to 1.0) - but it\u0027s never actually hit a vessel.\n\n\u003E \n\u003E Your poll implies that everyone has either had a close call with debris or isn\u0027t capable of even reaching space. I have had no close calls because I keep my orbits clean, but I can get where ever the hell I want in stock. Please fix this.\n\n^ this is also a valid point. I keep my space semi-clean (I usually use a two-stage lifter, plus a slightly oversized orbital portion that lets me drop the last stage of the lifter back into the atmosphere), and sometimes sweep any remaining junk with a claw-based craft."},{"CreatedByName":"Reddeyfish","CreatedById":142160,"CreatedDateTime":"2015-05-03T21:15:15Z","Content":"4 debris collisions, but that was because I ejected 4 nosecones forward from a payload while the launch stage was still running.\n\n**Edited \u003Ctime datetime=\u00222015-05-03T21:18:14Z\u0022 title=\u002205/03/2015 09:18  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by Reddeyfish**"},{"CreatedByName":"Bar27262","CreatedById":141348,"CreatedDateTime":"2015-05-03T21:16:59Z","Content":"\u003E \n\u003E Er..define \u0027almost struck\u0027?\n\u003E I\u0027ve had debris pass through the old physics bubble (~2.5km prior to 1.0) - but it\u0027s never actually hit a vessel.\n\nBy almost struck, I mean really close near miss."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-03T21:20:36Z","Content":"\u003E \n\u003E By almost struck, I mean really close near miss.\n\nWell, never had that, that I can recall. These things just generally graze the edge of the physics bubble. Annoying (there\u0027s a very slight pause when it loads), but not really too alarming, except in the abstract. Absolutely certain there\u0027s never been a collision.\n\nNote that I\u0027m not including situations where I\u0027m intentionally intercepting junk (like the new rescue missions or my sweeper operations) as those are always controlled, very close approaches, not accidents about to happen."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-05-03T21:27:39Z","Content":"Many times.\n\nNone.\n\nNone."},{"CreatedByName":"Aerindel","CreatedById":109952,"CreatedDateTime":"2015-05-03T21:28:31Z","Content":"Since when did Kerbal have escape pods?"},{"CreatedByName":"MrCynical","CreatedById":116703,"CreatedDateTime":"2015-05-03T21:31:25Z","Content":"A couple of times I\u0027ve seen debris pass within 2km in low kerbin orbit, but it\u0027s very rare even with me being fairly careless about leaving spent stages and so on floating round. I\u0027ve never seen a collision or anything I\u0027d class as a close miss so, yeah, no poll option."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-05-03T21:31:50Z","Content":"\u003E \n\u003E Since when did Kerbal have escape pods?\n\nYou can make your own. A better word is \u0022escape craft\u0022. Like the Soyuz on the ISS."},{"CreatedByName":"Aerindel","CreatedById":109952,"CreatedDateTime":"2015-05-03T21:43:57Z","Content":"\u003E \n\u003E You can make your own. A better word is \u0022escape craft\u0022. Like the Soyuz on the ISS\n\nOh. In that case, never, and I leave my orbits cluttered with junk because I think it would be pretty cool to actually have to re-create \u0022Gravity\u0022 but space is big."},{"CreatedByName":"JackDugan","CreatedById":139522,"CreatedDateTime":"2015-05-03T21:44:10Z","Content":"In an old KSP save, I had a space station. One day, a rocket\u0027s second stage was going to come within 0.1 Km of it. I moved the station just to be safe."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-05-03T21:45:42Z","Content":"\u003E \n\u003E In an old KSP save, I had a space station. One day, a rocket\u0027s second stage was going to come within 0.1 Km of it. I moved the station just to be safe.\n\nI would have totally grabbed some space popcorn and watched it fly by!"},{"CreatedByName":"Bar27262","CreatedById":141348,"CreatedDateTime":"2015-05-03T22:30:59Z","Content":"\u003E \n\u003E Oh. In that case, never, and I leave my orbits cluttered with junk because I think it would be pretty cool to actually have to re-create \u0022Gravity\u0022 but space is big.\n\nDamn. I just saw that last night and I was pretty excited by it, so it struck my mind to ask here. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2015-05-03T23:10:35Z","Content":"Never had a passive colision with debris where both orbits just happened to intersect while I wasnt doing anything other than a few drifting bumps (craft siting near a station but not docked drifting in at half a m/s) I\u0027ve set up a few colisions intentionaly but those dont count. I\u0027ve had a bunch of crashing a craft into a station/craft I intended to dock to but thats just bad piloting. The only accidental debris hit I have was one time where I got a craft to orbit, detached the lift booster (was going to deorbit it later) and setup a node for a burn. Turns out that burn ended up almost exactly 1 orbit after I disconnected and the booster got infront of me in that time. I fired up the rocket and 5 seconds later plowed right into the launch stage. Kinda iffy on if that even counts as the collision would never have happened if I hadnt been burning at the time, I just didnt look forward before fireing."},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-05-03T23:13:28Z","Content":"I haven\u0027t had to use escape pods, but my station did have them. One time, while docking a transport ship to a station, an old launcher (extremely large and overpowered) flew within 500 meters of the station with a difference of 200 m/s velocity. Truthfully, escape pods would not be useful because by the time you realized a piece of debris is headed for your ship, the debris will hit long before you transfer all kerbals to it."},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-05-03T23:15:12Z","Content":"I fly stuff intentionality into my space stations and see how much of them I can save. Sometimes I try dock while it is rotating. (Que Interstellar song("},{"CreatedByName":"Teutooni","CreatedById":76518,"CreatedDateTime":"2015-05-03T23:20:57Z","Content":"Back in 0.23.5 where I put most of my hours in KSP I had a huge save that was probably centuries old in kerbin time. So a lot of obsolete satellites, failed rocket parts, fairings etc flying around. One time when I was testing an SSTO and got to orbit, one of the structural wing panels on top of the plane suddenly exploded. I could only deduce it was struck by some small debris - the plane was not under any kind of stress or any other effect that could have destroyed the panel. Escape pods? No. But plenty of occasions when I should have used one! Incidentally the spaceplane I was testing when hit by debris was one of the few things I ever fitted with a re-entry capable escape pod for the pilot. Didn\u0027t need to use it that time though."},{"CreatedByName":"Dakota2063","CreatedById":127687,"CreatedDateTime":"2015-05-04T02:04:39Z","Content":"I have no option in the pole. But truth of the matter is, you would need to put a lot of debris into space to even come close to hitting anything. It\u0027s amazing how much space is actually in LKO, and how often you avoid hitting things. But it\u0027s always good to de-orbit debris, especially to watch it burn up."}]}