{"TopicId":107851,"ForumId":32,"TopicTitle":"New expierence table?","CreatedByName":"Ferdoni","CreatedById":140765,"CreatedDateTime":"2015-05-06T10:07:49Z","PageNum":1,"Articles":[{"CreatedByName":"Ferdoni","CreatedById":140765,"CreatedDateTime":"2015-05-06T10:07:49Z","Content":"Hi fellow Kerbals!!\n\nI\u0027m now training all my kerbonauts to at least level 2. To archieve this, i send them on a orbit round kerbin and a mission to the mun. But.. they don\u0027t get the expierence I expect them to have. Beacause you should get expierence from a fly by and a orbit around Kerbin and Mun plus i land them on the Mun and let them all plant their flags. In this way, according to the information on the table on the wiki page, they should get enough expierence to level 2. But they do stuck just before level 2. \n\nDoes anyone know if and how the Expierence levels and archievements have changed?\n\nThanks in advance!"},{"CreatedByName":"Zyffyr","CreatedById":138032,"CreatedDateTime":"2015-05-06T10:53:29Z","Content":"I think you are missing/forgetting that you only get the highest value from each world, not all of the individual values from each.\n\nKerbin Orbit = 2\n\nMun Flag = 5\n\nThat is a total of 7, Level 2 takes a total of 8."},{"CreatedByName":"Ferdoni","CreatedById":140765,"CreatedDateTime":"2015-05-06T11:18:55Z","Content":"Hahaha, I have never ever seen an answer so absolutely perfectly accurate. That explains everything! Thanks a lot!"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-05-06T13:00:25Z","Content":"You do not need to plant a flag - or do you?\n\nAt least for the Mun I see no difference in my game."},{"CreatedByName":"vicwarrior","CreatedById":120410,"CreatedDateTime":"2015-05-06T15:40:51Z","Content":"if you want to get max xp quickly ferry them into orbit, land them on the mun and have them plant flags (then tear them down if you want to keep it tidy), do the same in minimus, peek out of the kerbin SOI to get a kerbol orbit then go right back in and land them home for some quick level 3 kerbonauts."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-05-06T15:57:29Z","Content":"You can get to level 2 in a single mission if you go to Minmus. Take off, orbit Kerbin, transfer to Minmus, plant a flag, and come home. Eight points: level 2.\n\nAs noted, the Mun only gets you seven points."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-05-06T16:56:50Z","Content":"\u003E \n\u003E You do not need to plant a flag - or do you?\n\u003E At least for the Mun I see no difference in my game.\n\nYes, planting a flag is extra points for some reason. Kinda silly, because it means you will have lots of flags laying around... Landing should be enough (and it\u0027s less tedious with 3 kerbals)"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-05-06T17:12:32Z","Content":"\u003E \n\u003E if you want to get max xp quickly ferry them into orbit, land them on the mun and have them plant flags (then tear them down if you want to keep it tidy), do the same in minimus, peek out of the kerbin SOI to get a kerbol orbit then go right back in and land them home for some quick level 3 kerbonauts.\n\nSlight correction: They only need to plant a flag on Minmus; on the Mun, it\u0027s enough to land their vessel (no EVA or flags required).\n\nAlso pay attention to actually do suborbital on Kerbin. With the new atmo, it\u0027s easy to go from *flying* to *orbit* and back without ever going suborbital at any time in between."},{"CreatedByName":"colonel0sanders","CreatedById":26580,"CreatedDateTime":"2015-05-06T17:50:00Z","Content":"\u003E \n\u003E Slight correction: They only need to plant a flag on Minmus; on the Mun, it\u0027s enough to land their vessel (no EVA or flags required).\n\u003E Also pay attention to actually do suborbital on Kerbin. With the new atmo, it\u0027s easy to go from *flying* to *orbit* and back without ever going suborbital at any time in between.\n\nActually, I think it only counts the best thing you do in each SOI, so as long as you make orbit, you get the 2 points. You could, for example, land on the Mun and return without ever actually being in orbit around the Mun."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-05-06T18:12:50Z","Content":"\u003E \n\u003E Slight correction: They only need to plant a flag on Minmus; on the Mun, it\u0027s enough to land their vessel (no EVA or flags required).\n\u003E Also pay attention to actually do suborbital on Kerbin. With the new atmo, it\u0027s easy to go from *flying* to *orbit* and back without ever going suborbital at any time in between.\n\nIf you look at the experience table in the KSP wiki you see that planting a flag is more valuable than just landing. Due to the Mun\u0027s multiplier, landing on the Mun is worth 4.6 points and planting a flag is worth 5 points. But 4.6 rounds up to 5.\n\nWhat I don\u0027t know is whether the experience is stored as 4.6 and only displayed as 5, or whether it is stored as 5."},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-05-06T19:40:08Z","Content":"To get full experience (except for cases small enough that merely landing rounds up anyway), you do need to plant a flag... but nobody ever said you had to leave the flag there. My landings generally consist of everybody popping out of the lander, planting a bunch of flags, posing for screenshots, picking up the flags AND SCIEEEEEENCE, getting into the lander, and taking off again."},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-05-06T20:14:52Z","Content":"\u003E \n\u003E landing on the Mun is worth 4.6 points and planting a flag is worth 5 points. But 4.6 rounds up to 5.\n\u003E What I don\u0027t know is whether the experience is stored as 4.6 and only displayed as 5, or whether it is stored as 5.\n\nI don\u0027t know either. I do know that I get my Kerbals to three stars without planting a flag on the Mun, even without leaving the vessel. If you don\u0027t need the science, you can really do the shortest of pitstops on the Mun. The flag on Minmus is mandatory, however. I just did that yesterday: get out, plant flag, repeat 17 times until the vessel is empty. Take down flag, return to vessel, again 17 times. I sure wish this wasn\u0027t necessary."},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-05-06T20:15:16Z","Content":"One question...\n\nSituation:\n\nDildorf and Neilfrid Kerman are twin brothers that enlisted at the same time.\n\nDildorf is not the sharpest knife in the drawer. Nevertheless he goes on various missions: 1. Flying, 2. Kerbin suborbital, 3. orbital, 4. Mun flyby, 5. Mun landing, when finally on his 6th mission he is entrusted with a flag which he uses to puncture his space suit before finally managing to stick in the Mun.\n\nNeilfrid, on the other hand, inherited the brains of both twins and is a genius. He, while still a rookie, is sent directly to Mun and nails the flag planting procedure on his first try.\n\nKnowing that XP is awarded on return to the KSC, does Dildorf have more XP? Or do they have the same?\n\n(That was two questions, I guess.)"},{"CreatedByName":"vicwarrior","CreatedById":120410,"CreatedDateTime":"2015-05-06T20:19:00Z","Content":"provided the second kerbal doesn\u0027t skip kerbin orbit by launching himself directly at the mun and back (which is extremely unlikely) they will both end up with the same amount of xp at return."},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-05-06T20:24:23Z","Content":"So if you visit the Mun without planting the flag, you get 4,6 and when you get there the second time and plant the flag, you only get additional 0,4? Right?"}]}