{"TopicId":108908,"ForumId":32,"TopicTitle":"Veteran players reminisce: What was your first Munar landing like?","CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-12T14:31:56Z","PageNum":4,"Articles":[{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-05-13T10:29:18Z","Content":"Landed successfully... Then pressed space... RESCUE MISSION TIME!!!"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-05-13T11:43:14Z","Content":"I made my first \u0022landing\u0022 back before we had real patched conics, and the maneuver node system was just a glimmer in maxmaps eye. My first encounter with the Mun was... high velocity, let\u0027s say. I somehow managed to achieve a retrograde orbit around Kerbin, and went for the Mun from there. Of course, I thought going for an impact trajectory was the only way to go. I hit the ground going 1000 meters per second."},{"CreatedByName":"Overlocker","CreatedById":118850,"CreatedDateTime":"2015-05-13T11:45:16Z","Content":"I remember back at those very early versions when only the Mun and Kerbin was on the game and you must land on the Engines... those where good times:rolleyes:"},{"CreatedByName":"Crampman","CreatedById":111527,"CreatedDateTime":"2015-05-13T12:02:13Z","Content":"For my first munar landing, about a year an half ago, I used an overpowered vehicle including 3 launches : a lander, a crew transfer ship and a propulsion module using 3 or 4 LV-Ns\n\nI don\u0027t have any pictures, sadly, but it was an epic success !"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-13T12:08:03Z","Content":"It was back in 0.12, when the Mun was first added. There were no landing gear yet, so I was using fins instead (idea stolen from other players here on the forum). I built a huge, terribly inefficient rocket to get a tiny lander up there and in orbit around the Mun. There were no reverts or quicksaves, so every time I messed something up meant starting over from the pad. It took me dozens of attempts before I finally landed gently enough to not break anything (hurray for RCS translation for fine tuning descent rates!).\n\nIt is hard to describe the exhilaration I felt upon finally getting it right, I shouted with joy and pumped my fist in the air. I\u0027ve since done some tougher things in KSP, but no moment since has delivered the same sense of satisfaction that that first Mun landing did."},{"CreatedByName":"elpollodiablo","CreatedById":128492,"CreatedDateTime":"2015-05-13T12:46:27Z","Content":"I think it was 0.23, and it was mostly blood, sweat and tears. And a lot of swearing.\n\nBecause of some of my personal interests, i already knew how Orbit\u0027s and Hohmann Transfer\u0027s etc work. But no theory teaches you how to land a (badly designed) craft without parachutes. I don\u0027t remember a lot, but i will never forget how i raged about how impossibly hard it is to control directions and thrust at the same time and that it is no fun at all. Needless to say that i logged several hundred hours after this nerve wrecking \u0022no fun at all\u0022 experience.\n\nGood you didn\u0027t ask about docking, that was even worse (and became one of the things i do the most - love orbital assemblies) ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-13T14:20:08Z","Content":"My 1st Mun landing......\n\nThat happened in 0.20. Being an Orbiter vet of several decades standing, I already knew how to fly rockets so I just needed to learn how to build them in KSP. A quick trip to Minmus following a Scott Manley tutorial video made me think I knew all about it, so my 1st Mun lander was very complex, a transformable lander/rover thingy.\n\n[https://flic.kr/p/eNtf7U](https://flic.kr/p/eNtf7U)\n\n[https://flic.kr/p/eNtf5y](https://flic.kr/p/eNtf5y)\n\nIt was a marvel of engineering with each langing leg on a separate action group (and other action groups to work them in various pairs) so I could tip the thing over and stand it up again (on Kerbin) no matter how it fell over. It could even drive along perfectly well upside down. So I was very happy with it and sent it off to Mun.\n\n[https://flic.kr/p/eNteXq](https://flic.kr/p/eNteXq)\n\nBut despite having all these features, there was still a lot about KSP I didn\u0027t know. Such as, I hadn\u0027t considered how the forces exerted by the moving landing legs would toss the lander high into the sky on Mun compared to Kerbin, so all the functionality was very difficult to use. Still, the thing was liberally covered in struts so it still worked, although it had tense moments and broke a solar panel bouncing around.\n\nAnyway, in those ancient days, Mun didn\u0027t have procedural terrain. It was pretty much just a sphere composed of flat facets with little craters and rocks drawn on with low-res textures. So, a very boring place, but actually quite good rover country. You could go screaming along for miles and miles without fear of jumping off a or falling into a crater, just every once in a while you came to the edge of a facet where the angle of the terrain changed slightly to that of the next facet. But that happened at the horizon so you could see it coming miles in advance even in the dark and slow down to cross such ridges.\n\nThus, I covered a significant distance with no problem. However, eventually I got totally bored with the unchanging vista of flat terrain, sharp horizons in the distance, and the same low-res ground texture repeating ever few hundred yards and decided to go home. This is when I discovered that I didn\u0027t have enough dV. See, this mechanical marvel of a lander was essentially just my Minmus lander with wheels on it. This was before I\u0027d discovered MJ and KER so had no idea how much dV it had or what was needed (and was cursing this because such basic information is readily available without mods in Orbiter), but I figured Mun couldn\u0027t have much more gravity than Minmus. I\u0027d been quite concerned with my fuel consumption during the landing, however, and knew I didn\u0027t have much left.\n\nFortunately, it was JUST BARELY enough to get to orbit and I thought, no problem, I\u0027ll just do my 1st KSP rescue mission. Due to difficulties in getting the lander back upright in low gravity, I had no real control over orientation. Thus, the orbit was rather egg-shaped, inclined about 30^, and retrograde. That complicated the rendezvous but no problem for an old Orbiter vet ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif). So I decided to get fancy and use the newly discovered KAS to refuel the lander so I could bring it back. Unfortunately, due to glitches with that, refueling proved impossible so I had to use Plan B, which was to just bring Jeb home in the empty seat of the 3-seat pod, leaving the rover in orbit."},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-05-13T14:25:15Z","Content":"My first was all SRBs becuse I didn\u0027t know how to use liquid fuel.(didn\u0027t read the controls..?) I used SRBs to de-orbit and to land I had an SRB on the top of the ship to ram it into the ground if my landing SRB pushed me back up.\n\nI couldn\u0027t get back until I figured how to use liquid boosters, then I sent a rescue mission."},{"CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2015-05-13T15:37:49Z","Content":"ridiculously overpowered ship. second stage took us to low munar orbit with half its fuel left. lol. apollo style. eventually they went back to kerbin after mucking about on the surface. parachutes were dead somehow, idk. jeb jumped out and lived. then i reloaded the quicksave and they all survived because the parachutes took pity on me."},{"CreatedByName":"Drethon","CreatedById":100831,"CreatedDateTime":"2015-05-13T16:03:01Z","Content":"I created an Apollo style lander with no landing legs, because I didn\u0027t realize that part existed. I managed to land perfectly but did not have enough fuel to get back to orbit. So I quick loaded and never successfully landed that ship again, until I found out what landing legs are..."},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-05-13T16:07:23Z","Content":"My first Mun landing was in the .18 demo, using the classic .18 demo lander using fins as landing legs. After I bought the game, which was in .19, I redid the landing with a proper lander. My strategy was to go in front of the Mun, and then let gravity pull me straight down towards the surface and then suicide burn for 700 m/s. horridly inefficient."},{"CreatedByName":"vixr","CreatedById":133940,"CreatedDateTime":"2015-05-13T16:10:38Z","Content":"I started playing last november (0.25 I think) so I\u0027m not much of a vet, but my first Munar landing was not pretty...(BOOM) couldn\u0027t figure out why I was actually at 0 altitude instead of what my altimeter was reading out. Finally found the RADAR altimeter inside the cockpit and tried to toggle back and forth between views (also not pretty) couldnt figure out how to kill horizontal velocity and skidded in a bunch of times...didn\u0027t have enough fuel to get back into orbit a bunch of times...BUT, when I finally landed a ship!!! it was glorious!!! I was jumping up and down like a little kid."},{"CreatedByName":"RayneCloud","CreatedById":11227,"CreatedDateTime":"2015-05-13T16:13:59Z","Content":"I started back in 0.8/0.9, and joined the forums actively four days after 0.12 came out. So, my munar landings? Well..my first one was when EVA came out, so that made it more awesome I think.\n\n**Edited \u003Ctime datetime=\u00222015-05-13T16:23:06Z\u0022 title=\u002205/13/2015 04:23  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 13, 2015\u003C/time\u003E by Damion Rayne**"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-05-13T16:15:57Z","Content":"\u003E \n\u003E I started back in 0.8/0.9, and joined the forums actively four days after 0.12 came out.\n\nbut...what was your first Mun landing? ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"wossname","CreatedById":118005,"CreatedDateTime":"2015-05-13T16:17:36Z","Content":"I remember my first successful Mun landing, it was probably my 50th launch overall, maybe the 10 before it were all lithobraking practice.\n\nIt was a real heartpounding moment actually, once you\u0027re committed to a landing by deorbiting it\u0027s a hectic task to keep track of all the variables you have to keep under control. Now I\u0027ve been playing for a while it doesn\u0027t seem so stressful, but the fun is still there.\n\nIt took me a few launches early on to figure out the main key piece of advice I\u0027d give to new players...\n\nWhile steering your Mun rocket -- DON\u0027T look at the rocket itself -- you should be using the NavBall to drive it while you\u0027re still new to the game.\n\nAbout 3 years ago when I first played KSP, I tried to launch a rocket and got frustrated with the steering because I couldn\u0027t work out what the navball was telling me and then gave up for about 18 months without playing it again. I\u0027d hate for that to happen to others.\n\nTHe navball is all important when landing - it is simply impossible without it.\n\nNavball for president!"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2015-05-13T16:32:50Z","Content":"First landing, not crash ?\n\nIt was for a Opportunity/Spirit rover look-alike. I had found a way to encase it in between 2 fuel tanks, each with 2 radial engines (the white ones). The platform was powerful enough and stable enough to land very well, also had quite enough fuel.\n\nTook me a while to figure that following the anti-prograde was how to do it. Once I did I was quite happy. I roved on the moon for quite some time before moving on to other things (Like Duna !)\n\nAll and all it must\u0027ve take me a few days to get everything right. (those where 8h/day kinda days) Back in 0.22"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-05-13T20:16:50Z","Content":"It was a crash landing."},{"CreatedByName":"Delrey","CreatedById":131343,"CreatedDateTime":"2015-05-14T12:14:23Z","Content":"I came to a dead stop about 30 km up then a vertical decent. Not very effecient.\n\nDel"},{"CreatedByName":"Bloody_looser","CreatedById":95664,"CreatedDateTime":"2015-05-14T12:31:00Z","Content":"First landing (not crashing) was quite remarkable. \n\nI managed to land Jeb on the Mun, but had no fuel to return home. So, I\u0027ve sent an unmanned rescue ship and landed it within 10 km range of the site. I considered it kinda precise. ![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)\n\nAnd then ... I walked Jeb to the rescue ship for guddam 40 minutes RL straight, since I didn\u0027t know about a jetpack. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nYeah, those were the days."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-14T12:40:08Z","Content":"Slow. Very, very slow. And quite inefficient ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n\u003E \n\u003E I walked Jeb to the rescue ship for guddam 40 minutes RL straight, since I didn\u0027t know about a jetpack. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nLol, oh dear ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Did you know about 4x timewarp at least?"},{"CreatedByName":"Bloody_looser","CreatedById":95664,"CreatedDateTime":"2015-05-14T12:47:49Z","Content":"\u003E \n\u003E Lol, oh dear ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Did you know about 4x timewarp at least?\n\nThankfully, yes. \n\nAnd in these times kerbals really enjoyed staying in ragdoll state, so it was technically more sliding on the Mun than walking."},{"CreatedByName":"sam.johnson841","CreatedById":104846,"CreatedDateTime":"2015-05-14T12:49:23Z","Content":"\u003E \n\u003E \u0022AaaaaaaaaAAAAAAAAHHHHHH-\u0022 \\*Splut\\*\n\nExactly what happened with me!\n\n- Sam"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2015-05-14T12:54:11Z","Content":"My first time? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nLithobreaking. Lander in pieces. Jeb survived. Planted the flag. \n\nNot unlike the opening animation in the game!"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-05-14T14:32:04Z","Content":"On my first Munar landing, I didn\u0027t know the altimeter read in height ASL, not height above the terrain. The result was slamming into the surface at about 50m/s.\n\nThere were no survivors."},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-14T14:33:40Z","Content":"\u003E \n\u003E My first time? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\u003E Lithobreaking. Lander in pieces. Jeb survived. Planted the flag. \n\u003E \n\u003E Not unlike the opening animation in the game!\n\nAha, we have an origin story!\n\nAnd thanks for all the interesting stories, guys! I love hearing all of these adventures.\n\n**Edited \u003Ctime datetime=\u00222015-05-14T14:36:17Z\u0022 title=\u002205/14/2015 02:36  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 14, 2015\u003C/time\u003E by Maximus97**"}]}