{"TopicId":109183,"ForumId":32,"TopicTitle":"Fueling Big Ships with Ore? Coal power FTW!","CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-05-14T12:55:23Z","PageNum":1,"Articles":[{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-05-14T12:55:23Z","Content":"\n\u003Cp\u003EGot my first mining operation going and am starting to think interplanetary. Am thinking that for a very big ship it might not be the dumbest thing in the world to load up big tanks of ore and convert on the ship into comparatively small tanks of LF, O2 and mono. Consider:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sgKWsCs.png\u0022 alt=\u0022sgKWsCs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EObviously this is not the whole ship, just enough to demonstrate the point. This 25.4 ton assembly can put 3000 units of LF through the engine. A more classical arrangement of, say, an orange Rockomax tank (without O2) and an LV-N would mass 21.4 tons and carry 2880 units of LF. You\u0027d get a better ratio using LF-only Mk2 or Mk3 spaceplane parts, of course.\u003C/p\u003E\u003Cp\u003EWith a single engine the \u0027solid fuel\u0027 option loses due to the big mass of the converter... but imagine a capital ship with a whole battery of LV-Ns, monopropellant thrusters, and a complement of boats for planetary/moon landings. If you could run the whole thing off one or two converters, \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eyou would break even on mass or even do better than LF/LFO\u003C/span\u003E the mass penalty would be much reduced... AND the \u0027solid fuel\u0027 system is a lot more compact. Such a ship could even have a mining boat that brings in ore along the way.\u003C/p\u003E\u003Cp\u003EI think I\u0027m on to something... and imagining a fleet of \u0022coal-powered\u0022 cruisers!\u003C/p\u003E\u003Cp\u003EETA: Looking further, the ore can never truly win...\u003C/p\u003E\u003Cp\u003E--Five big ore tanks weigh 10t empty and carry ore that can convert to 15,000 units of LF. \u003C/p\u003E\u003Cp\u003E--Three standard Mk3 LF tanks weigh 9t empty and carry 15,000 untis of LF\u003C/p\u003E\u003Cp\u003E...but I still may do something like this for convenience, compactness and coolness if I am running a big ship that needs lots of different fuel types. At least that way I won\u0027t carry more monopropellant or oxidant than I truly need.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-14T13:30:01Z\u0022 title=\u002205/14/2015 01:30  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 14, 2015\u003C/time\u003E by Kuzzter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-05-14T16:05:24Z","Content":"\n\u003Cp\u003EInteresting idea! But you\u0027re right - it would work best for larger ships (that refinery part is MASSIVE) out at the edge of the system say Dres/Jool/Eeloo type long-term missions.\u003C/p\u003E\u003Cp\u003EHaven\u0027t even started playing around with resource collection myself (first is an experimental Minmus mining expedition) but your \u0022Capital Ship/Refinery\u0022 idea sounds like it could work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2015-05-14T16:37:23Z","Content":"\n\u003Cp\u003EDefinitely something worth trying for a new mothership for a grand-tour in 1.0.x\u003C/p\u003E\u003Cp\u003EHaving a \u0022Cargo ship\u0022 docked to it which could also dual-serve as the low-gravity lander/mining ship would work as you extract the ore from the body and redock to store it.\u003C/p\u003E\u003Cp\u003EI wonder if it would be possible to make one that works everywhere, including Tylo... Ummm. \u003C/p\u003E\u003Cp\u003ENow the only thing missing are new, bigger LV-N with 250 thrust. (Wasn\u0027t there a mod for that ?)\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-05-14T16:47:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Francois424\u0022 data-cite=\u0022Francois424\u0022\u003E\u003Cdiv\u003EDefinitely something worth trying for a new mothership for a grand-tour in 1.0.x\u003Cp\u003EHaving a \u0022Cargo ship\u0022 docked to it which could also dual-serve as the low-gravity lander/mining ship would work as you extract the ore from the body and redock to store it.\u003C/p\u003E\u003Cp\u003EI wonder if it would be possible to make one that works everywhere, including Tylo... Ummm. \u003C/p\u003E\u003Cp\u003ENow the only thing missing are new, bigger LV-N with 250 thrust. (Wasn\u0027t there a mod for that ?)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust what I\u0027m thinking; use low gravity moons like Gilly \u0026amp; Bop for a quick top-up of the ore bunkers, and of course then there\u0027s the convenient scattering of minable rocks around Dres.\u003C/p\u003E\n"},{"CreatedByName":"SDEngineer","CreatedById":101148,"CreatedDateTime":"2015-05-14T18:14:44Z","Content":"\n\u003Cp\u003ENifty idea. Hold your fuel in a common pool and only refine what you need into small holding tanks just big enough for the maximum you\u0027d use at any time. Particularly a good idea for a mothership, since mine are always powered by LV-Ns, but carry landers with LF\u002BO rockets, so with the 1.0 changes, this would keep me from needing to estimate the amount of oxidizer I the missions will require (and likely over-estimating wasting dV and tank space or under-estimating and not being able to complete a landing I would have otherwise been able to).\u003C/p\u003E\n"},{"CreatedByName":"vej","CreatedById":143657,"CreatedDateTime":"2015-05-14T19:12:52Z","Content":"\n\u003Cp\u003EI have a single small ore tank on my refinery station around Minmus even though my miner is what really holds the ore bulk during processing. The idea is, once I fill the LF\u002BO and monoprop fuel tanks, I can fill up the ore tank and have it as a reserve for conversion into whatever may be needed but unavailable in the future. Ore has a 1:1 conversion ratio into fuel mass so by having the refinery with you you\u0027re only adding 4.2t of weight. On a long-distance ship, you might as well just use that weight on extra smaller tanks to save the hassle of doing the refining. One tank of ore doesn\u0027t really yield a whole lot of fuel.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-05-15T01:05:00Z","Content":"\n\u003Cp\u003EI have observed that according to the tech tree Ore has no mass, although I have yet to double-check this in practice. If so, it does provide a rather broken system for fueling massive yet mass-efficient motherships.\u003C/p\u003E\u003Cp\u003EEDIT: Disregard this claim. I just checked and it turns out that it\u0027s listed as massless only because the tank comes with 0 units. Ore weighs 10kg per unit, i.e. 100 Ore weighs 1 ton.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-15T01:09:52Z\u0022 title=\u002205/15/2015 01:09  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 15, 2015\u003C/time\u003E by parameciumkid\u003C/strong\u003E\n\u003C/span\u003E\n"}]}