{"TopicId":109958,"ForumId":32,"TopicTitle":"What a difference a engine can make (SNEAKY)","CreatedByName":"Korizan","CreatedById":142032,"CreatedDateTime":"2015-05-19T15:14:14Z","PageNum":1,"Articles":[{"CreatedByName":"Korizan","CreatedById":142032,"CreatedDateTime":"2015-05-19T15:14:14Z","Content":"So I was going back and testing some old rockets to answer a thread and I realized something critical that most likely gets overlooked and more important a HUGE difference from the BETA 0.90 (mind you a good difference) \n\nThe Rocket top to bottom (this rocket will get you into orbit)\n\nMK16 / MK1 \u002B (MechJeb 2 Module) / Heat Shield / TR-18A / FL-T200 / LV-909 / TR-18A / FL-T800 / FL-T800 / MAIN ENGINE\n\nYou can replace the (2) FL-T800\u0027s with (4) FL-T400\u0027s or (8) FL-T200\u0027s with the same result.\n\n[Notice it has NO fins]\n\nThe Main engine is the fun part.\n\nI had a LV-T45 \u0022swivel\u0022 (THIS ENGINE CAN GIMBAL) for a main engine and it flew into orbit just fine.\n\nFor fun I replaced the LV-T45 with a LV-T30 (it has more power right but it CAN NOT GIMBAL ) \n\nWell that is where it got interesting the rocket did a flip @ 6500m and was just uncontrollable.\n\nPlaced (4) Basic Fins at the bottom of the Rocket and it was stable enough to fly into orbit but the fuel efficiency was terrible.\n\nA tiny change for more realism (a good thing) that is most likely driving some players up the wall when they first start out.\n\nWhat makes things worse is there are several good tutorials out there for 0.90 on how to get into orbit but they used the LV-T30 which worked just fine back then.\n\nHowever now it is the engine of doom without fins.\n\nMakes me wonder what other tiny little items where put in that are driving people insane.\n\n**Edited \u003Ctime datetime=\u00222015-05-19T15:34:40Z\u0022 title=\u002205/19/2015 03:34  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 19, 2015\u003C/time\u003E by Korizan**\n  \nAdded in options for first stage"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-19T15:34:35Z","Content":"i have put fins on every rocket for a long time now, mostly because of the better maneuverability in the denser part of the atmosphere. i never use the LV-T30. i had some minor problems getting into orbit when 1.0 came out, but they didn\u0027t last, i personally don\u0027t consider it more or less difficult to launch rockets, just the same matter of trial and error as before ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\ngood observation, hopefully this will help those people which are still having trouble getting to orbit."},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-05-19T15:43:08Z","Content":"With regard to rockets, I feel like fins are just a band-aid for non-efficient aerodynamic craft design.\n\nIf your rocket is flipping, you\u0027re probably going too fast and/or trying to put too much payload into orbit with not enough rocket."},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2015-05-19T15:46:59Z","Content":"\u003E \n\u003E With regard to rockets, I feel like fins are just a band-aid for non-efficient aerodynamic craft design.\n\nAlso doing too aggressive maneuvers while still in the atmosphere. If you still have a problem despite of being very careful - sometimes it might just be better to push above 15km with SAS on before touching controls. Yea, you\u0027ll waste some Dv, but also save a lot of time."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-05-19T15:49:39Z","Content":"\u003E \n\u003E With regard to rockets, I feel like fins are just a band-aid for non-efficient aerodynamic craft design.\n\u003E If your rocket is flipping, you\u0027re probably going too fast and/or trying to put too much payload into orbit with not enough rocket.\n\nIn 1.0, things were WAY too hot and not draggy enough. The 1.0.1 changes knocked that heat down but boosted up the drag a bit too much. Doing some stalking of Maxmaps on twitter and reading a few other things, either a 1.0.3 hotfix is coming or in 1.1, there are going to be a few tweaks. Drag is coming down a wee bit and heating is going up some (aerobraking return from Duna will require a heat shield)\n\nFins are a bit of a bandaid for the current atmosphere being a bit more flip-happy than the community as a whole is happy with (this is a pretty divisive issue, but if Squad is turning back the drag just a hair, then the community opinion overall must be its a bit too flippy)."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-05-19T16:43:01Z","Content":"\u003E \n\u003E With regard to rockets, I feel like fins are just a band-aid for non-efficient aerodynamic craft design.\n\u003E If your rocket is flipping, you\u0027re probably going too fast and/or trying to put too much payload into orbit with not enough rocket.\n\nIn career mode, you start out with only non-gimballing engines. Fins are very useful for aerodynamic stability (as the OP points out). Later, when you have gimballing engines, they are less useful."},{"CreatedByName":"Korizan","CreatedById":142032,"CreatedDateTime":"2015-05-19T16:54:51Z","Content":"I am not how I feel about fins.\n\nFins do help you stabilize even a stable rocket, lets face it in RL you won\u0027t be flying a rocket into space manually.\n\nThere is also the consideration of keyboard versus joystick.\n\nKeyboard controls are either on or off where a joystick gives you degrees of control and that can make a huge difference when trying to control a rocket on assent.\n\nPersonally I use Mechjeb simply because it may be fun at times to get off the ground manually I generally have other things in mind like fuel to get to another planet and I am happy to let the computer run the assent.\n\nBut this may be the grind.\n\nFor those that use mechjeb then changing in the atmosphere means tweaking the assent profile.\n\nWhere if you are flying manually it may become ridiculously hard to get into space.\n\nSo what does the squad do.\n\nMake it very realistic and put a mechjeb style autopilot into the game or make it less realistic and easier to fly on manual. ?\n\n**Edited \u003Ctime datetime=\u00222015-05-19T16:57:42Z\u0022 title=\u002205/19/2015 04:57  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 19, 2015\u003C/time\u003E by Korizan**"},{"CreatedByName":"spacenut1337","CreatedById":144436,"CreatedDateTime":"2015-05-19T17:18:47Z","Content":"I think locking the first gimbaling engine behind an upgrade and the addition of tier 0 fins introduces players to a key concept - drag can work in your favor to keep things pointed where you want them.\n\nWhat I find frustrating is the tendency for SAS oscillations to diverge instead of converge. The system just loves to overcorrect."},{"CreatedByName":"Fleb","CreatedById":63851,"CreatedDateTime":"2015-05-19T17:29:50Z","Content":"LVT30 is better as a low atmos booster, it\u0027s better than solids. The LVT45 has the now all important gimbal and better ISP, so I use it on my core stages."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-05-19T17:37:25Z","Content":"\u003E \n\u003E I think locking the first gimbaling engine behind an upgrade and the addition of tier 0 fins introduces players to a key concept - drag can work in your favor to keep things pointed where you want them.\n\u003E What I find frustrating is the tendency for SAS oscillations to diverge instead of converge. The system just loves to overcorrect.\n\nThat\u0027s because the stock rockets are too flexible. The cockpit gives the input to the rocket to steer north, let\u0027s say, so the engine steers north. But by the time the cockpit finally points north, the engine has oversteered. So the cockpit tells the engine to steer south. Etc. If the SAS controller was more rigidly connected to the place where it is steering from, this wouldn\u0027t be a problem."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-05-19T17:48:51Z","Content":"If you\u0027re going to use solid rocket boosters, then fins with control surfaces are extremely useful in your initial boost phase. If you do things properly, and don\u0027t overbuild your rocket, you can get into orbit easily in a few minutes. When I first started playing KSP, getting a spacecraft into orbit seemed like an unbeatable challenge. After flying a rocket into orbit a few thousand times now it\u0027s a piece of cake, and I barely have to think about it even when I screw up.\n\nHere is the final build of my \u0022Project Moho\u0022 Rocket, it\u0027s only purpose is to put a science package into LKO.\n\n**Spacecraft:**\n\nClamp-O-Tron Jr.\n\nMK1 Command Pod\n\n(2) MK2R Radial Parachutes\n\n1.25m Service Bay with: 2 Z200 Batteries, 4 OX Stat solar panels, 2 Thermometers, 2 Barometers, and 2 Goo Canisters\n\n1.25m Heat Shield\n\nDecoupler\n\n**Service Module:**\n\n(4) RCS Thruster Blocks\n\nScience Jr.\n\nFLT 200 Fuel Tank\n\nLV909 Engine\n\nDecoupler\n\n**Sustainer Stage:**\n\n(2) FLT - 800 Fuel Tanks\n\nFLT - 400 Fuel Tank with (4) AV-R8 Winglets\n\nLV T45 Engine\n\n**Booster Stage:**\n\n(2) Aerodynamic Nosecones\n\n(2) Rockomax BACC SRB @ 77% thrust\n\n(2) TT-38K Radial Decoupler\n\nThe total cost of the rocket is less than 30,000 spacebucks and it can reach a 250km x 250km orbit while still returning to Kerbin with the fuel onboard.\n\n(Ignore the video thumbnail, it\u0027s just an old screenshot.)\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/eQ034VYpCaA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n**Edited \u003Ctime datetime=\u00222015-05-19T17:51:24Z\u0022 title=\u002205/19/2015 05:51  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 19, 2015\u003C/time\u003E by Guest**"},{"CreatedByName":"Archgeek","CreatedById":116048,"CreatedDateTime":"2015-05-19T17:52:31Z","Content":"\u003E \n\u003E That\u0027s because the stock rockets are too flexible. The cockpit gives the input to the rocket to steer north, let\u0027s say, so the engine steers north. But by the time the cockpit finally points north, the engine has oversteered. So the cockpit tells the engine to steer south. Etc. If the SAS controller was more rigidly connected to the place where it is steering from, this wouldn\u0027t be a problem.\n\nIt\u0027s also rocket gimbals being all-or-nothing. I did a mun injection for a re-entry test, lazily hitting hold prograde on an OCTO-2, and stared bemused at the remainder of my LV-T45 lift stage flipping out in each available direction for a second before it emptied."}]}