{"TopicId":110774,"ForumId":32,"TopicTitle":"New Service / Utility Bays in 1.x - Kraken bait?","CreatedByName":"Bluebird1","CreatedById":132481,"CreatedDateTime":"2015-05-25T11:50:28Z","PageNum":1,"Articles":[{"CreatedByName":"Bluebird1","CreatedById":132481,"CreatedDateTime":"2015-05-25T11:50:28Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana, Arial, Tahoma, Calibri, Geneva, sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#222222;\u0022\u003EDoesanyone else have the same trouble I have with these new storage bays,both the 1.25 and 2.5m? \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana, Arial, Tahoma, Calibri, Geneva, sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#222222;\u0022\u003EIget random shaking and general glitching whenever I try to use them,last night culminating in a science module going nuts and having tobe decoupled before it tore apart the station it was docked to. Itused to be that the 2.5m ones were temperamental, but last night itwas a 1.25m version. The strange thing was that it was tested on theground first, and had been taken up to Muna orbit where the stationwas with out any problems. Happened when I loaded back to the stationfrom the tracking station, there it was having some kind ofseizure. \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana, Arial, Tahoma, Calibri, Geneva, sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#222222;\u0022\u003ETheseseem to be very buggy at the moment, and I\u0027m finding I\u0027m avoidingusing these due to their inherent instability, which is a shame asthey serve a very useful purpose and I want to use them.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mipe","CreatedById":109421,"CreatedDateTime":"2015-05-25T11:52:42Z","Content":"\n\u003Cp\u003EWhen parts clip through service bay floor/ceiling and into adjacent parts, the kraken awakens. Most notorious are those goo canisters of kraken summoning.\u003C/p\u003E\u003Cp\u003EThat\u0027s why I place structural elements inside container bay and attach those kraken-summoning bits to them.\u003C/p\u003E\n"},{"CreatedByName":"Varsi","CreatedById":120571,"CreatedDateTime":"2015-05-25T11:55:11Z","Content":"\n\u003Cp\u003ENever ever clip anything thru the bay doors. Rather don\u0027t even go near them! I once had a ship I managed to save by opening the doors before the shaking got too bad. I then went and closed the doors again and watched the pieces fly...\u003C/p\u003E\n"},{"CreatedByName":"Raptor9","CreatedById":67915,"CreatedDateTime":"2015-05-25T12:55:58Z","Content":"\n\u003Cp\u003EYeah, that Science Jr bay that looks like it fits perfectly inside the 2.5m service bay...careful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TARDISES","CreatedById":144068,"CreatedDateTime":"2015-05-25T13:01:11Z","Content":"\n\u003Cp\u003E...A new method to summon the Kraken?\u003C/p\u003E\u003Cp\u003ESomeone tell Danny. Now. For the sake of hilarity.\u003C/p\u003E\n"},{"CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2015-05-25T13:05:07Z","Content":"\n\u003Cp\u003EYou don\u0027t want to know what happened when you put a service bay in-between two cargo-bay\u0027s.\u003C/p\u003E\u003Cp\u003EI\u0027m still trying to figure out how Jeb ended up in my room..\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022No jeb, I don\u0027t want any snacks...\u0022\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-05-25T16:16:25Z","Content":"\n\u003Cp\u003Emost probably related to colliders volume and there respective animation wich are slighty different from the part(s) and cause collision and shaking by unseeable occlusions and/or proximity within some part(s) and non rigid joint native properties wich tend to turn in an exponential kind of calculation loop by the physics engine (colliders layer is unseeable in game that\u0027s why this kind of thing happen time to time). \u003C/p\u003E\u003Cp\u003E(\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43478?p=564188\u0026amp;viewfull=1#post564188)\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/43478?p=564188\u0026amp;viewfull=1#post564188)\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-25T16:38:11Z\u0022 title=\u002205/25/2015 04:38  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 25, 2015\u003C/time\u003E by WinkAllKerb\u0026#39;\u0026#39;\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-05-25T16:45:41Z","Content":"\n\u003Cp\u003EBe right back, going to put the Klaw in a Kargo Bay and see what happens.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-25T17:41:31Z","Content":"\n\u003Cp\u003EIn my own experience, it\u0027s like this:\u003C/p\u003E\u003Cp\u003E1. Probe Cores:\u003C/p\u003E\u003Cp\u003EIf you attach an inline probe core to the floor node of the service bay, or on top of something else inert (SAS, inline battery, etc.) that is itself on the floor node of the bay, no problem. However, if you hang the probe core from the ceiling node in the service bay, you get horrible shakes as soon as you launch.\u003C/p\u003E\u003Cp\u003E2. Clipping Through Floor/Ceiling of Service Bays:\u003C/p\u003E\u003Cp\u003ENot really a problem for \u0022inert\u0022 (non-animated) parts. For instance, I routinely hang the large radial RCS tanks from the ceiling and their feet clip through into whatever part is stacked above the bay. The only time this causes a problem is if that other part is a docking port, which of course usually don\u0027t work with anything clipping into them. However, it\u0027s a different story with animated parts, IF the moving components themselves clip the flor or ceiling of the service bay. If they don\u0027t, then no problem.\u003C/p\u003E\u003Cp\u003E3. Service Bay Door Collisions\u003C/p\u003E\u003Cp\u003EThis is when the swinging doors impact some other part of the rocket. There are actually 2 ways this can cause problems:\u003C/p\u003E\u003Cp\u003EA. In the VAB/SPH\u003C/p\u003E\u003Cp\u003EWhile the doors move harmlessly through other rocket parts in the editors, the EFFECT of them having passed through the other parts remains when you later go to fly the rocket. This results in the whole rocket vibrating badly. This situation usually arises when you belatedly remember you need to assign action groups to parts in the service bay and you\u0027ve already built more rocket around the bay in the way of the doors (you don\u0027t plan on opening the bay in flight). So the lesson here is, if you\u0027re loading up a bay you don\u0027t plan on opening in flight, be sure you do everything necessary to the parts inside before closing the bay the last time and then building stuff around it.\u003C/p\u003E\u003Cp\u003EB. In Flight\u003C/p\u003E\u003Cp\u003EBay doors that impact other rocket parts will opening in flight don\u0027t usually result in vibrations, Instead, they work like bulldozers, pushing hard on the surrounding parts. Depending on joint strength, the other parts will either bend out of the way and snap back no problem, or will break off. As with all animations in KSP, the moving doors are an irresistible force so will never be stopped by anything in their path.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-05-25T21:46:16Z","Content":"\n\u003Cp\u003EI\u0027ve found that in my latest spaceplane, which ended up needing a service bay, it shakes when first loaded but stops as soon as the bay moves, either opening or closing, and remains stable after the animation finishes. My guess is the source of the problem is related to the animation and the colliders turning on/off improperly.\u003C/p\u003E\n"},{"CreatedByName":"pvtnum11","CreatedById":58904,"CreatedDateTime":"2015-05-25T21:48:53Z","Content":"\n\u003Cp\u003EFor fun, trap a Kerbal inside a bay while on EVA. If there\u0027s not enough room in the bay, they\u0027ll flop and twitch around, possibly leading to either broken parts or if you\u0027re really lucky, a Kraken summoning.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-05-25T22:12:12Z","Content":"\n\u003Cp\u003EI think my Jool probe went fourth dimension because of one of those : /\u003C/p\u003E\u003Cp\u003EOh, well... Good thing Jool windows are so common.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-05-25T22:21:53Z","Content":"\n\u003Cp\u003EI can\u0027t say I\u0027ve noticed this issue, and I put Goo Canisters right on the floor.\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2015-05-26T01:47:52Z","Content":"\n\u003Cp\u003EI put my goo on the floor too, and I haven\u0027t had a problem so far. The only problem I\u0027ve noticed is the top-attached probe core: not a good idea! Attaching the core to the bottom of the bay is fine, though. I\u0027ve attached (and used) parachutes attached to both nodes, and they work fine too -- if you remember to open the doors before deploying the chutes.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027ve successfully attached the Communitron antenna to either the bottom or top of the bay; it works fine, even though it clips through all sorts of stuff when extended. But my recent designs avoid this, as I don\u0027t like part-clipping.\u003C/p\u003E\n"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-05-26T01:50:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EI can\u0027t say I\u0027ve noticed this issue, and I put Goo Canisters right on the floor.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m with him. (Unfortunately, I have only used service bays on a single mission that even went above ~3k and into space.)\u003C/p\u003E\n"},{"CreatedByName":"keeper","CreatedById":124530,"CreatedDateTime":"2015-05-26T03:11:50Z","Content":"\n\u003Cp\u003EI cram them full aswell havn\u0027t noticed any probs... \u003C/p\u003E\u003Cp\u003EManaged to fit : 4xGoo canisters, 4xthermometers, 4xbarometers, a structural cube thing, magnetometer and orbital telescope from dmagic slightly clipping but only a little bit no probs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Done a few missions with that config. \u003C/p\u003E\u003Cp\u003ELast time i seen the craken was with clipping external mono tanks back in 0.25 :/\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-05-26T05:17:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022keeper\u0022 data-cite=\u0022keeper\u0022\u003E\u003Cdiv\u003EI cram them full aswell havn\u0027t noticed any probs... \u003Cp\u003EManaged to fit : 4xGoo canisters, 4xthermometers, 4xbarometers, a structural cube thing, magnetometer and orbital telescope from dmagic slightly clipping but only a little bit no probs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Done a few missions with that config. \u003C/p\u003E\u003Cp\u003ELast time i seen the craken was with clipping external mono tanks back in 0.25 :/\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have had problems with two ships, both was 3x2.5 m stacks, it looks like the bays hate being in stacks. closing the doors does not always help here.\u003C/p\u003E\n"},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-26T09:20:29Z","Content":"\n\u003Cp\u003EI always attach probe cores to the top node of the smaller bays and never have any problems. Have avoided clipping anything through the doors as I figured it would cause issues.\u003C/p\u003E\u003Cp\u003EGenerally avoid clipping as much as possible so Goo canisters are always unimpeded. The only object that has severe clipping is the RCS tanks, but as they are not animated I haven\u0027t had any issues with bays.\u003C/p\u003E\u003Cp\u003EThough I found they make good landing legs. Just land a base on it\u0027s side and open the doors, perfect legs!\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-05-26T09:29:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mister Spock\u0022 data-cite=\u0022Mister Spock\u0022\u003E\u003Cdiv\u003EI put my goo on the floor too, and I haven\u0027t had a problem so far.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere might be a conflict with angle snapped and rotated goo only?\u003C/p\u003E\u003Cp\u003EWith angle snap it has to be rotated first or it will clip through the bay and only show its feet, without angle snap the goo sits inside the bay.\u003C/p\u003E\u003Cp\u003EI too have a ship with a service bay that is acting up - but it is not shaking, it is moving its center of mass/camera like zooming out and a bit to the left ... I only had this once with a parachute mod bug, but this ship has neither chutes nor fairings.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-05-26T10:30:37Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9kzR8L8.png\u0022 alt=\u00229kzR8L8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the bay I used for my Mun and Minmus landings in the start before I learned about clipping problems. \u003C/p\u003E\u003Cp\u003EOcto probe core in center, the two boxes with handles are science experiment storage. You can store science experiments for later retrieval.above one goo container and one life support container. \u003C/p\u003E\u003Cp\u003EThermometer on bottom pressure and seismic detector on top with an battery in center.\u003C/p\u003E\u003Cp\u003EBack is more batteries and an mechjeb module. backup parachute on top of bay below pod however its visible in bay from the back.\u003C/p\u003E\u003Cp\u003ELife support module clips door.\u003C/p\u003E\u003Cp\u003ENever had any problems with it.\u003C/p\u003E\n"},{"CreatedByName":"The Lone Wolfling","CreatedById":13675,"CreatedDateTime":"2015-05-28T20:35:40Z","Content":"\n\u003Cp\u003EI find that it tends to be absurdly Kracken-baity, until/unless I toggle the bay doors. Then it\u0027s fine until the next time Physics loads. (For instance, quickloading or popping out of warp.) It\u0027s weird.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-05-28T20:38:58Z","Content":"\n\u003Cp\u003EI have experienced Phantom forces with them, I had a minmus lander that would not stop spinning \u0022head over heels\u0022. time warp would stop it, but as soon as I un warped, it began accelerating in its spin again.\u003C/p\u003E\n"}]}