{"TopicId":110960,"ForumId":32,"TopicTitle":"Examining The Kerbol System as if it were a real solar system","CreatedByName":"Darkday560","CreatedById":113686,"CreatedDateTime":"2015-05-26T23:59:45Z","PageNum":1,"Articles":[{"CreatedByName":"Darkday560","CreatedById":113686,"CreatedDateTime":"2015-05-26T23:59:45Z","Content":"\n\u003Cp\u003EI\u0027ll examine the Kerbol System as if it were a real solar system, and pose a few theories based off of said things being found or seen.\u003C/p\u003E\u003Cp\u003EFirst off, Kerbol is small compared to Earth\u0027s sun. Kerbol has an equatorial radius of 261,600 kms, while our sun has an equatorial radius of 696,000 kms. That means the \u0022habitable zone\u0022 is much smaller, and if Earth was placed into Kerbol\u0027s system, it would probably be a bit colder. Now, looking at this habitable zone which I find not very easy to define, it is either very large or the planets are smushed in all around the habitable zone. Proof of this lies on Eve, which is not close enough to the sun to be burnt by radiation or have the waters and atmosphere evaporate, and Laythe, who is so far out AND orbiting a gas giant and still not being frozen from distance. If Jool is technically inside the habitable zone, Eeloo has a chance to have life on it because it occasionally passes near jool\u0027s orbit. This I would assume means that Kerbol is producing waves of heat that keep Laythe warm while still not burning Eve and Moho to oblivion, or some strange forces outside of Kerbol are keeping the solar system to what it is. \u003C/p\u003E\u003Cp\u003EAnother thing is that Kerbol has no visible asteroid belts or comets unless created by the player. Instead infinite comets are found hurling themselves are Kerbin for whatever reason. This could be because of the Nemesis theory placed on our real life solar system, but edited a little. The endless asteroids flying at Kerbin could be a result of a red dwarf similar to Nemesis orbiting fast enough, far away enough, and in the right position that it orbits in a way that flings asteroids from the orc cloud to kerbin, making Kerbol a binary system. This star would have to be orbiting very quickly just inside, outside, or on the orc cloud for it to be able to fling asteroids constantly at kerbin. \u003C/p\u003E\u003Cp\u003EI may update this in the future, but I need to go eat for now. Post your arguments and theories below! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-05-27T00:08:05Z","Content":"\n\u003Cp\u003EThis is a bit of a redundant thread but I\u0027ll humor you.\u003C/p\u003E\u003Cp\u003E- I see Kerbol as a white dwarf. For small stars, the actual diameter isn\u0027t nearly as important to the \u0022habitable zone\u0022 as the surface temperature, and white dwarfs have a range of temperatures from Sun-like to piping superheated blue. A relatively cool white dwarf, perhaps with some accreted gas, could possibly have a similar size and color to Kerbol.\u003C/p\u003E\u003Cp\u003E- Eve\u0027s surface pressure is much higher than Kerbin\u0027s or Earth\u0027s, making it easier to keep water a liquid - and that\u0027s under the assumption that Eve\u0027s oceans are water and not something like mercury.\u003C/p\u003E\u003Cp\u003E- Laythe could easily be kept toasty by tidal heating considering its proximity to Jool. Europa has no atmosphere, so its surface is frozen, but it\u0027s commonly thought that underneath it has liquid water due to tidal heating from Jupiter.\u003C/p\u003E\u003Cp\u003EP.S.: \u003Cstrong\u003EOort Cloud\u003C/strong\u003E. Not the \u0022orc cloud\u0022 xD\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-05-27T00:37:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darkday560\u0022 data-cite=\u0022Darkday560\u0022\u003E\u003Cdiv\u003EI\u0027ll examine the Kerbol System as if it were a real solar system, and pose a few theories based off of said things being found or seen.\u003Cp\u003EFirst off, Kerbol is small compared to Earth\u0027s sun. Kerbol has an equatorial radius of 261,600 kms, while our sun has an equatorial radius of 696,000 kms. That means the \u0022habitable zone\u0022 is much smaller, and if Earth was placed into Kerbol\u0027s system, it would probably be a bit colder. Now, looking at this habitable zone which I find not very easy to define, it is either very large or the planets are smushed in all around the habitable zone. Proof of this lies on Eve, which is not close enough to the sun to be burnt by radiation or have the waters and atmosphere evaporate, and Laythe, who is so far out AND orbiting a gas giant and still not being frozen from distance. If Jool is technically inside the habitable zone, Eeloo has a chance to have life on it because it occasionally passes near jool\u0027s orbit. This I would assume means that Kerbol is producing waves of heat that keep Laythe warm while still not burning Eve and Moho to oblivion, or some strange forces outside of Kerbol are keeping the solar system to what it is. \u003C/p\u003E\u003Cp\u003EAnother thing is that Kerbol has no visible asteroid belts or comets unless created by the player. Instead infinite comets are found hurling themselves are Kerbin for whatever reason. This could be because of the Nemesis theory placed on our real life solar system, but edited a little. The endless asteroids flying at Kerbin could be a result of a red dwarf similar to Nemesis orbiting fast enough, far away enough, and in the right position that it orbits in a way that flings asteroids from the orc cloud to kerbin, making Kerbol a binary system. This star would have to be orbiting very quickly just inside, outside, or on the orc cloud for it to be able to fling asteroids constantly at kerbin. \u003C/p\u003E\u003Cp\u003EI may update this in the future, but I need to go eat for now. Post your arguments and theories below! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt could also be that the comets aren\u0027t concentrated around Kerbin, but rather that\u0027s the only place that allows us to spot them (that\u0027s where all of our deep space radars are).\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-05-27T08:02:20Z","Content":"\n\u003Cp\u003EOne consideration that should be kept in mind when trying to look at the KSP solar system as if it was real is orbital stability in N-body dynamics.\u003C/p\u003E\u003Cp\u003EMost of the orbits are actually decently stable for the time periods that people play in. Eeloo and Jool are in proper resonance, I believe (as Pluto and Neptune are), and as such shouldn\u0027t interfere with one another. Mun and Minmus are far enough apart and small enough to not affect each other noticably.\u003C/p\u003E\u003Cp\u003EBut the Jool system will fall apart rather quickly. First, Vall gets ejected with a swift kick in the behind from Tylo within a short few years. Over the next hundred years or so, Pol and Bop significantly change their orbits, and may also be lost to deep space. Laythe and Tylo remain more or less stable.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-05-27T08:28:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EP.S.: \u003Cstrong\u003EOort Cloud\u003C/strong\u003E. Not the \u0022orc cloud\u0022 xD\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt should be Ore cloud in Kerbol system \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Asharad","CreatedById":107448,"CreatedDateTime":"2015-05-27T10:56:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EBut the Jool system will fall apart rather quickly. First, Vall gets ejected with a swift kick in the behind from Tylo within a short few years. Over the next hundred years or so, Pol and Bop significantly change their orbits, and may also be lost to deep space. Laythe and Tylo remain more or less stable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI modeled the Kerbol System using the Universe Sandbox. Tylo quickly disturbed all moons in the Jool system causing them to be absorbed by Jool or Tylo. In less than a year, the only surviving moon was Tylo.\u003C/p\u003E\u003Cp\u003EEve and Kerbin are too close to each other, and their orbits begin to change slowly through the years. Something tugged on Ike and pulled it out of orbit, but I did not see why. The entire Kerbol system is a mess.\u003C/p\u003E\u003Cp\u003EThe density of the planets (25-45 g/cm^3) is higher than any substance known to man. In our universe, Jool would be solid rock of Unobtainium.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T11:04:14Z\u0022 title=\u002205/27/2015 11:04  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Asharad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-27T11:04:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darkday560\u0022 data-cite=\u0022Darkday560\u0022\u003E\u003Cdiv\u003EProof of this lies on ... Laythe, who is so far out AND orbiting a gas giant and still not being frozen from distance. If Jool is technically inside the habitable zone, Eeloo has a chance to have life on it\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour Laythe example is already contradicted by Eeloo, which is frozen, and you also forget Val: Frozen.\u003C/p\u003E\u003Cp\u003ELaythe has features suggestive of Cauldera, suggesting internal heat is responsible, and thus laythe is not useful for determining the habitable zone.\u003C/p\u003E\u003Cp\u003EDuna has an atmospheric pressure that is sufficient to support water, but non is found, only ice caps.\u003C/p\u003E\u003Cp\u003ESo... conclusion: The habitable zone is inside of Jool.\u003C/p\u003E\u003Cp\u003EMaybe if Duna had a thicker atmosphere, it would work.\u003C/p\u003E\n"},{"CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2015-05-27T14:00:48Z","Content":"\n\u003Cp\u003ELaythe has supergreenhouse gases (maybe CFCs). Duna has no water albeit being closer in to Kerbol, because it\u0027s in an ice age and all the ice raises the albedo which lowers the temperature. Eeloo and Vall cannot have an atmosphere similar to Laythe\u0027s, to allow water on the surface, because they are too small to hold it there (see the last sentence in the second paragraph of Eeloo\u0027s page on the wiki). Minmus cannot be made of ice because I had a colony there and one of the thermometers read 278K, or 5C which water can evaporate at. Kerbin has no magnetic field, because it does not have a molten core. This deficiency of a molten core is evidenced by the seeming lack of plate tectonics there (mountains formed likely from impact craters, continents do not fit together, no volcanoes, no undersea trenches, etc). Laythe\u0027s and Vall\u0027s orbits around Jool (and Minmus\u0027 orbit around Kerbin) are also perfectly circular, meaning no tidal energy can be derived from orbital eccentricity. Tidal forces from other moons in their system will still affect them, and so will the gradual slowing of the day because of tidal locking (only on Minmus). Eve probably formed outside its current orbit, and Kerbin\u0027s influence put it where it is today.\u003C/p\u003E\u003Cp\u003EIn a couple of million years Eve\u0027s oceans will have evaporated and the pressure and temperature will have gone up there. Also, in a couple million years Moho will be tidally locked to Kerbol, its day is 123 days and its year is 102 days. Vall will become a dwarf planet. So will Bop. Minmus\u0027 orbit will become non-circular.\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2015-05-27T14:04:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Findthepin1\u0022 data-cite=\u0022Findthepin1\u0022\u003E\u003Cdiv\u003EAlso, in a couple million years Moho will be tidally locked to Kerbol.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESomething I\u0027ve always wanted.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-05-27T14:04:21Z","Content":"\n\u003Cp\u003EWhile this is interesting to read, I hope the OP realizes that it\u0027s meant to be playable, not realistic. Squad has said KSP is a game first and a simulator second. While Laythe may be frozen IRL, I\u0027m glad it has water because it makes the moon more interesting.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-05-27T21:27:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Asharad\u0022 data-cite=\u0022Asharad\u0022\u003E\u003Cdiv\u003EThe density of the planets (25-45 g/cm^3) is higher than any substance known to man.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cem\u003EOn Earth\u003C/em\u003E. White dwarfs have a density of 1 billion kilograms per m^3 (i.e. 1000 g/cm^3); neutron stars weigh on par with a fleet of battleships per teaspoon; and black holes, even if one assumes the event horizon is the \u0022surface\u0022, have a density far higher than even that.\u003C/p\u003E\n"},{"CreatedByName":"tychodin","CreatedById":100446,"CreatedDateTime":"2015-05-27T22:47:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003EThis is a bit of a redundant thread but I\u0027ll humor you.\u003Cp\u003E- I see Kerbol as a white dwarf. For small stars, the actual diameter isn\u0027t nearly as important to the \u0022habitable zone\u0022 as the surface temperature, and white dwarfs have a range of temperatures from Sun-like to piping superheated blue. A relatively cool white dwarf, perhaps with some accreted gas, could possibly have a similar size and color to Kerbol.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eexcept even the largest white dwarf would be about 50x smaller than Kerbol. Kerbol is something like a KV star, and as far as stars go, about twice as common as the Sun.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-27T22:59:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Findthepin1\u0022 data-cite=\u0022Findthepin1\u0022\u003E\u003Cdiv\u003ELaythe has supergreenhouse gases (maybe CFCs).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*sigh* and you base that on what? is this some joke because you\u0027re also an anthropogenic climate change denier?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EDuna has no water albeit being closer in to Kerbol, because it\u0027s in an ice age and all the ice raises the albedo which lowers the temperature.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESays who that it is in an ice age?\u003C/p\u003E\u003Cp\u003EHow do you know what the baseline icecap is for Duna?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEeloo and Vall cannot have an atmosphere similar to Laythe\u0027s, to allow water on the surface, because they are too small to hold it there (see the last sentence in the second paragraph of Eeloo\u0027s page on the wiki).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, all the planets except jool are too small to hold on to much of any atmosphere.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EKerbin has no magnetic field, because it does not have a molten core. This deficiency of a molten core is evidenced by the seeming lack of plate tectonics there (mountains formed likely from impact craters, continents do not fit together, no volcanoes, no undersea trenches, etc).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA molten core does not neccessarily mean plate tectonics are active. The topography of kerbin does have many ridges that cannot be impact formed.\u003C/p\u003E\u003Cp\u003EWhile it doesn\u0027t have the obvious jigsaw puzzle look like we see on earth around the atlantic, I can\u0027t say with confidence anything about Kerbin.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E Laythe\u0027s and Vall\u0027s orbits around Jool (and Minmus\u0027 orbit around Kerbin) are also perfectly circular, meaning no tidal energy can be derived from orbital eccentricity. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebut they wouldn\u0027t be in real life, as they would alter each others orbits.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIn a couple of million years Eve\u0027s oceans will have evaporated and the pressure and temperature will have gone up there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESays who? you don\u0027t even know what Eve\u0027s oceans are.\u003C/p\u003E\u003Cp\u003EA couple million years is a REALLY REALLY short time on the astronomical scale. The oceans on Venus lasted longer than that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso, in a couple million years Moho will be tidally locked to Kerbol, its day is 123 days and its year is 102 days,\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore likely, it will end up like Mercury, which is not tidally locked, but has a spin orbit resonance.\u003C/p\u003E\u003Cp\u003EAlso... a couple million years is a really really really short time scale for this sort of thing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EVall will become a dwarf planet. So will Bop. Minmus\u0027 orbit will become non-circular.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, that is what the N-body simulations show.. I also seem to recall some question about the long term fate of pol\u003C/p\u003E\n"},{"CreatedByName":"Asharad","CreatedById":107448,"CreatedDateTime":"2015-05-27T23:51:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003E\u003Cem\u003EOn Earth\u003C/em\u003E. White dwarfs have a density of 1 billion kilograms per m^3 (i.e. 1000 g/cm^3); neutron stars weigh on par with a fleet of battleships per teaspoon; and black holes, even if one assumes the event horizon is the \u0022surface\u0022, have a density far higher than even that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was talking about planets. Eve isn\u0027t a star but has star-like density. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#252525;\u0022\u003E\u0022The densest transiting exoplanet known is \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/COROT-3b\u0022 rel=\u0022external nofollow\u0022\u003ECOROT-3b\u003C/a\u003E\u003Cspan style=\u0022font-family:sans-serif;\u0022\u003E\u003Cspan style=\u0022color:#252525;\u0022\u003E, which has density of 26.4 g/cm\u003C/span\u003E\u003C/span\u003E\u003Csup\u003E3\u0022 \u003C/sup\u003E. There are debates, but most classify COROT-3b as a brown dwarf star.\u003C/p\u003E\u003Cp\u003EThe density of Eve is 85 g/cm^3.\u003C/p\u003E\u003Cp\u003EThe density of Jool is near Earth.\u003C/p\u003E\u003Cp\u003EActually, all of Jool\u0027s properties are near Earthlike, except for the green texture.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-28T02:25:36Z\u0022 title=\u002205/28/2015 02:25  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 28, 2015\u003C/time\u003E by Asharad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-05-28T02:01:03Z","Content":"\n\u003Cp\u003EAccording to Physics.cfg, the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Solar_constant\u0022 rel=\u0022external nofollow\u0022\u003Esolar constant\u003C/a\u003E at Kerbin is 1360 W/m\u003Csup\u003E2\u003C/sup\u003E. From this we can determine that Kerbol\u0027s luminosity is 3.16Ãƒâ€”10\u003Csup\u003E24\u003C/sup\u003E watts. Using the size of our Sun\u0027s habitable zone as a guideline, and adjusting for the difference in luminosity, we can estimate that Kerbol\u0027s habitable zone extends from roughly 10 million km to 20 million km. This is roughly from the orbit of Eve to the orbit of Duna.\u003C/p\u003E\u003Cp\u003EThe only planet with enough mass to have a thick atmosphere is Jool. Based on their mass and temperature, Eve, Tylo, and Laythe might be able to retain a very thin atmosphere of heavy gases (e.g. carbon dioxide). Although Kerbin is larger than either Tylo or Laythe, its warmer temperature makes it less likely to be able to hold onto an atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2015-05-28T19:14:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E*sigh* and you base that on what? is this some joke because you\u0027re also an anthropogenic climate change denier?\u003Cp\u003ESays who that it is in an ice age?\u003C/p\u003E\u003Cp\u003EHow do you know what the baseline icecap is for Duna?\u003C/p\u003E\u003Cp\u003EActually, all the planets except jool are too small to hold on to much of any atmosphere.\u003C/p\u003E\u003Cp\u003EA molten core does not neccessarily mean plate tectonics are active. The topography of kerbin does have many ridges that cannot be impact formed.\u003C/p\u003E\u003Cp\u003EWhile it doesn\u0027t have the obvious jigsaw puzzle look like we see on earth around the atlantic, I can\u0027t say with confidence anything about Kerbin.\u003C/p\u003E\u003Cp\u003Ebut they wouldn\u0027t be in real life, as they would alter each others orbits.\u003C/p\u003E\u003Cp\u003ESays who? you don\u0027t even know what Eve\u0027s oceans are.\u003C/p\u003E\u003Cp\u003EA couple million years is a REALLY REALLY short time on the astronomical scale. The oceans on Venus lasted longer than that.\u003C/p\u003E\u003Cp\u003EMore likely, it will end up like Mercury, which is not tidally locked, but has a spin orbit resonance.\u003C/p\u003E\u003Cp\u003EAlso... a couple million years is a really really really short time scale for this sort of thing.\u003C/p\u003E\u003Cp\u003EYup, that is what the N-body simulations show.. I also seem to recall some question about the long term fate of pol\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would like to clarify that all I am doing is guessing. So is everyone else here. The planets in KSP with atmospheres can all hold their atmospheres because what matters is the gravity. They\u0027re really, really dense. You could theoretically have an object six inches across, with an unrealistic density that gives it about 9.81 meters per second squared gravity. It would be able to hold onto an atmosphere of 1 atm. That atmosphere would be much less \u003Cem\u003Emassive\u003C/em\u003E than Earth\u0027s, but still 1 atm, as in Kerbin\u0027s scenario. As you say, it could also end up like Mercury. IF Eve\u0027s oceans are made of something similar to water, then they would begin to boil somewhere on the planet if its temperature were raised barely two degrees (Eve\u0027s maximum temperature is two degrees below the boiling point of water at 5 atm, assuming the Kerbals measure in Kelvin). That is a very risky environment. One particularly hot day at the equator over ocean could set off a runaway greenhouse effect (oceans evaporate, increase air pressure, air traps more heat due to higher mass/density/pressure, increase temperature, more oceans evaporate, etc). I was also assuming Duna was in an ice age because one of the devs once posted that Duna was inspired by something about Mars in an ice age, I regret assuming that now. Either way, the ice has an effect on Duna\u0027s albedo.\u003C/p\u003E\u003Cp\u003EAlso, I do not consider myself an anthropogenic climate change denier, I consider myself an anthropogenic climate change skeptic. This is because I am willing to listen to and consider people\u0027s opinions on either side of the debate, and when talking about the subject I try to make my points as logically as possible. It is possible that Laythe has CFCs or some other strong greenhouse gas. I do not dispute the existence of greenhouse gases or their effects, it was not a joke.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-28T19:47:18Z\u0022 title=\u002205/28/2015 07:47  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 28, 2015\u003C/time\u003E by Findthepin1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-28T19:46:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Findthepin1\u0022 data-cite=\u0022Findthepin1\u0022\u003E\u003Cdiv\u003EThe planets in KSP with atmospheres can all hold their atmospheres because what matters is the gravity. They\u0027re really, really dense. You could theoretically have an object six inches across, with an unrealistic density that gives it about 9.81 meters per second squared gravity. It would be able to hold onto an atmosphere of 1 atm. That atmosphere would be much less \u003Cem\u003Emassive\u003C/em\u003E than Earth\u0027s, but still 1 atm, as in Kerbin\u0027s scenario.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it is not surface gravity that matters. It is escape velocity that matters.\u003C/p\u003E\u003Cp\u003EOn Earth, a gas molecule moving at 8 km/s will be barely suborbital.\u003C/p\u003E\u003Cp\u003EA gas molecule moving at \u0026lt;11 km/s will go on very very very eccentric trajectories around earth, but their perapsis will still intersect the top of the atmosphere.\u003C/p\u003E\u003Cp\u003EA gas molecule moving at 12 km/s... is gone... that is over escape velocity.\u003C/p\u003E\u003Cp\u003EEscape velocity for kerbin is about 3km/sec, orbital is about 2km/sec.\u003C/p\u003E\u003Cp\u003EEven mars has a higher escape velocity than Kerbin (mars: 5 km/s)\u003C/p\u003E\u003Cp\u003EYou should easily be able to tell that some gases that Earth can hold on to, Kerbin would not be able to hold on to (assuming the same temperature).\u003C/p\u003E\u003Cp\u003EKerbin, having a lower escape velocity and warmer temperature (meaning the gas molecules will move faster) than mars, wouldn\u0027t hold on to its atmosphere nearly as well as mars.\u003C/p\u003E\u003Cp\u003ENow, Eve\u0027s escape velocity seems to be about 4.5km/s... but its temperature much higher... it wouldn\u0027t even hold on to an atmosphere as well as mars did.\u003C/p\u003E\u003Cp\u003EThat leaves us with Jool as the only planet to hold on to an atmopshere\u003C/p\u003E\n"},{"CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2015-05-28T20:15:22Z","Content":"\n\u003Cp\u003EOh ok I understand it now\u003C/p\u003E\u003Cp\u003Ealso at the end of the post *atmosphere*\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-05-28T20:33:44Z","Content":"\n\u003Cp\u003EKerikBalm is correct; it\u0027s escape velocity that is the key. The rule of thumb that I\u0027ve heard is that the average speed of a gas molecule has to be no more than about 10% of the escape velocity to be retained over an extended period of time. If the \u003Cem\u003Eaverage\u003C/em\u003E speed is much more than that, there will be enough molecules exceeding escape velocity that, over billions of years, the gas will slowly be lost. The average speed of a gas molecule is given by the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Root-mean-square_speed\u0022 rel=\u0022external nofollow\u0022\u003Eroot-mean-squared velocity\u003C/a\u003E, which is function of temperature and molecular weight. If we know the escape velocity and temperature, we can compute the minimum molecular weight molecule that a planet can hold onto. For temperature, we can use the sun\u0027s luminosity of 3.16Ãƒâ€”10\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Csup\u003E24\u003C/sup\u003E\u003C/span\u003E watts and calculate the black body temperature. I estimate the following minimum molecular weights:\u003C/p\u003E\u003Cp\u003E[TABLE=width: 250]\u003C/p\u003E\u003Cp\u003E[TR]\u003C/p\u003E\u003Cp\u003E[TD]Jool[/TD]\u003C/p\u003E\u003Cp\u003E[TD]3.3 g/mol[/TD]\u003C/p\u003E\u003Cp\u003E[/TR]\u003C/p\u003E\u003Cp\u003E[TR]\u003C/p\u003E\u003Cp\u003E[TD]Tylo[/TD]\u003C/p\u003E\u003Cp\u003E[TD]33[/TD]\u003C/p\u003E\u003Cp\u003E[/TR]\u003C/p\u003E\u003Cp\u003E[TR]\u003C/p\u003E\u003Cp\u003E[TD]Eve[/TD]\u003C/p\u003E\u003Cp\u003E[TD]35[/TD]\u003C/p\u003E\u003Cp\u003E[/TR]\u003C/p\u003E\u003Cp\u003E[TR]\u003C/p\u003E\u003Cp\u003E[TD]Laythe[/TD]\u003C/p\u003E\u003Cp\u003E[TD]39[/TD]\u003C/p\u003E\u003Cp\u003E[/TR]\u003C/p\u003E\u003Cp\u003E[TR]\u003C/p\u003E\u003Cp\u003E[TD]Kerbin[/TD]\u003C/p\u003E\u003Cp\u003E[TD]59[/TD]\u003C/p\u003E\u003Cp\u003E[/TR]\u003C/p\u003E\u003Cp\u003E[/TABLE]\u003C/p\u003E\u003Cp\u003EClearly Jool can retain a thick atmosphere. Tylo and Laythe might be able to retain some heavy gases, such as carbon dioxide (44 g/mol). Although Eve can theoretically hold onto heavier gases, it\u0027s closeness to the sun also means it must deal with a strong solar wind. I doubt Eve would retain an atmosphere. Kerbin really has no chance.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-28T21:32:39Z","Content":"\n\u003Cp\u003ENor does Duna...\u003C/p\u003E\u003Cp\u003EBut I guess using those numbers, we\u0027d conclude that their atmosphere (aside from no-chance Kerbin)is probably CO2.\u003C/p\u003E\u003Cp\u003ELaythe\u0027s oxygen would be continuously lost to space, so it must be replenished... hydrolysis of water? that Hydrogen escapes... why hasn\u0027t laythe become dessicated?\u003C/p\u003E\u003Cp\u003EO2 would be lost - MW 32\u003C/p\u003E\u003Cp\u003EN2 would be lost - MW 28\u003C/p\u003E\u003Cp\u003EWater vapor would be lost - MW 18\u003C/p\u003E\u003Cp\u003EHelium - LOL, lost, even lost on Eart\u003C/p\u003E\u003Cp\u003ENeon would be lost - MW 20\u003C/p\u003E\u003Cp\u003EMethane would be lost - MW 16\u003C/p\u003E\u003Cp\u003EAmmonia would be lost...\u003C/p\u003E\u003Cp\u003ECarbon monoxide would be lost - MW 28\u003C/p\u003E\u003Cp\u003EArgon would be retained by all exept Duna and Kerbin - MW 40\u003C/p\u003E\u003Cp\u003EKrypton and Xenon would thus be retained (even though they are quite rare) by Kerbin (Duna?)\u003C/p\u003E\u003Cp\u003ECO2 would be retained - MW 44 by all except Duna and Kerbin - its questionable for laythe, particularly as we should assume laythe is not in radiative equilibirum, but rather has significant inernal heat. - Although I\u0027m not sure how much that affects the top of the atmosphere where the mean free path becomes significant (you can have hotter gases down low, because they\u0027ll collide with another gas molecule before escaping to space - you only need to consider the velocity at the \u0022top\u0022 of the atmosphere)\u003C/p\u003E\u003Cp\u003ESo... Eve can have an Argon/Kr/Xe \u002B CO2 atmosphere, Jool can keep everything except hydrogen (uh oh, that is most of the mass of a gas giant... I guess it is more of an ice giant).\u003C/p\u003E\u003Cp\u003EKerbin loses pretty much everything.\u003C/p\u003E\u003Cp\u003ELaythe is questionable. Tylo should have some CO2... but even in game they remark that it is weird that it has nothing.\u003C/p\u003E\u003Cp\u003EI\u0027m surprised Eve can even hold on to a CO2 atmosphere.... but OK, I\u0027ll trust your math.\u003C/p\u003E\n"},{"CreatedByName":"KanadianCerbal","CreatedById":107127,"CreatedDateTime":"2015-05-28T21:56:33Z","Content":"\n\u003Cp\u003EIsn\u0027t a white dwarf the remains of a star after its expanded to critical mass? If this is true than wouldn\u0027t it mean that this Kerbol system is not the first? This could also explain the lack of a substantial Oort cloud, comets or asteroids, as whatever was left after the expansion and compression of \u0022Kerbol 1\u0022 led to the reformation of the current Kerbol system.\u003C/p\u003E\n"},{"CreatedByName":"tychodin","CreatedById":100446,"CreatedDateTime":"2015-05-28T22:09:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KanadianCerbal\u0022 data-cite=\u0022KanadianCerbal\u0022\u003E\u003Cdiv\u003EIsn\u0027t a white dwarf the remains of a star after its expanded to critical mass? If this is true than wouldn\u0027t it mean that this Kerbol system is not the first? This could also explain the lack of a substantial Oort cloud, comets or asteroids, as whatever was left after the expansion and compression of \u0022Kerbol 1\u0022 led to the reformation of the current Kerbol system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ea white dwarf is the core of a star that has ceased fusion. there\u0027s no explosion for these stars (unless the white dwarf explodes later). they just go through a pulsational phase where they shed their outer layers and leave the core behind. and like i said earlier, Kerbol is far too large to be a white dwarf.\u003C/p\u003E\n"},{"CreatedByName":"KanadianCerbal","CreatedById":107127,"CreatedDateTime":"2015-05-28T23:02:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tychodin\u0022 data-cite=\u0022tychodin\u0022\u003E\u003Cdiv\u003Ea white dwarf is the core of a star that has ceased fusion. there\u0027s no explosion for these stars (unless the white dwarf explodes later). they just go through a pulsational phase where they shed their outer layers and leave the core behind. and like i said earlier, Kerbol is far too large to be a white dwarf.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, thanks for telling me. I guess I didn\u0027t see your post earlier, sorry. And thanks for informing me on what a white dwarf is.\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-05-28T23:13:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003ENor does Duna...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t put Duna on the list because after Kerbin it\u0027s not even close. The minimum MW for Duna works out to be 298 g/mol. Vall is actually next best with MW = 223 g/mol.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EI\u0027m surprised Eve can even hold on to a CO2 atmosphere.... but OK, I\u0027ll trust your math.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeing close to the sun, Eve obviously has a high black body temperature (327 K), but it also has the second highest escape velocity in the game (after Jool). The high escape velocity is what allows it to hold onto some heavy gases. If Eve where the size of Kerbin, then its minimum MW would be 69 g/mol.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-29T09:45:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OhioBob\u0022 data-cite=\u0022OhioBob\u0022\u003E\u003Cdiv\u003EBeing close to the sun, Eve obviously has a high black body temperature (327 K), but it also has the second highest escape velocity in the game (after Jool). The high escape velocity is what allows it to hold onto some heavy gases. If Eve where the size of Kerbin, then its minimum MW would be 69 g/mol.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea, well, I figured its escape velocity is still lower than mars, and it should be warmer...\u003C/p\u003E\u003Cp\u003EYes, Mars has an atmosphere... but not 5 atmospheres of pressure at the surface.\u003C/p\u003E\u003Cp\u003EThe atmosphere of Mars is barely there.... for most purposes, Mars has lost its atmosphere.\u003C/p\u003E\u003Cp\u003EIf Mars lost its atmosphere, I can\u0027t see Eve having much chance of retaining its thick atmosphere.\u003C/p\u003E\n"}]}