{"TopicId":11151,"ForumId":32,"TopicTitle":"Rocket Design in .15","CreatedByName":"mrdest21","CreatedById":10441,"CreatedDateTime":"2012-05-21T21:27:17Z","PageNum":1,"Articles":[{"CreatedByName":"mrdest21","CreatedById":10441,"CreatedDateTime":"2012-05-21T21:27:17Z","Content":"\n\u003Cp\u003EI have 3 rocket design that I use constantly and all of them have become quirky in 0.15. My lunar landing rocket used to get into orbit every launch but nowadays, about a third of launches start with the rocket veering side ways after 3 seconds. My biggest design used to fly relatively well once it was past the atmosphere but now it starts spinning like crazy past the first atmospheric cutoff, making it unsteerable. Did something change to the way the parts behave or could it be the SAS?\u003C/p\u003E\n"},{"CreatedByName":"Rock-it-man","CreatedById":19379,"CreatedDateTime":"2012-05-21T21:36:53Z","Content":"\n\u003Cp\u003EMy big super reliable mun rocket became weird too. It used to run out of fuel in the boosters at 80km roughly and dump them before circularisation, but now, the entire stack can get into a 200km circular orbit without staging. Guessing the 2 basic rocket engines must be more effiecient now? Either way, not complaining, it allowed me to get a massive lander to mun and to minimus without any fuel worries. (even then, it probably still would have worked if the stack still worked like in 0.14, but I\\\u0027d be cutting it finer than I\\\u0027d like with minimus landing. I like to have enough fuel in my transfer stage to change my orbit from equatorial to polar and back again.)\u003C/p\u003E\u003Cp\u003EOnly issue now is the dense cloud of boosters now filling LKO :S\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-05-21T21:38:22Z","Content":"\n\u003Cp\u003EI get the strong impression that Nova and C7 went through the list of parts and tweaked them. This would provide for changes in behaviour that would be small on their own, but added to others would cascade quite strongly. My suggestion would be to haul those ships into the VAB and do a bit of reassembly. You might even improve their performance along the way!\u003C/p\u003E\n"},{"CreatedByName":"mrdest21","CreatedById":10441,"CreatedDateTime":"2012-05-21T21:43:07Z","Content":"\n\u003Cp\u003EMaybe I will rework everything. I did notice that my rockets seemed to be going further or at least, the ones that weren\\\u0027t flying into the control tower right as they lifted off anyway.\u003C/p\u003E\u003Cp\u003ESmaller rockets could help the new (or returning) problem I\\\u0027ve been having, the ungodly lag in the first minute of flight.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-05-21T21:44:24Z","Content":"\n\u003Cp\u003EI have noticed on a lot of my old rockets that the radial decouplers are not strong enough to hold the boosters steady any more, and this causes my rockets to twist and turn uncontrollably.\u003C/p\u003E\u003Cp\u003EEven a single fuel tank and engine seems to be too heavy for a radial decoupler to hold still, I have had to revisit my designs and add at struts to them in order to control the twisting.\u003C/p\u003E\u003Cp\u003EIt seems strange that something like the decouplers have been \u0027balanced\u0027 but parts like the linear RCS thruster are massively overpowered.\u003C/p\u003E\u003Cp\u003EOh and samstarman5, I have been looking for a large version of your avatar pic for ages, where did you find it?\u003C/p\u003E\n"}]}