{"TopicId":112340,"ForumId":32,"TopicTitle":"Dead Kerbals.","CreatedByName":"chd","CreatedById":78680,"CreatedDateTime":"2015-06-08T04:03:09Z","PageNum":1,"Articles":[{"CreatedByName":"chd","CreatedById":78680,"CreatedDateTime":"2015-06-08T04:03:09Z","Content":"\\*sigh\\*\n\nI started playing again recently, and I usually play in a very liberal career mode (funding rewards turned way up because I really don\u0027t want to have to worry much about money), but also with \u0022respawn lost Kerbals\u0022 off because well let\u0027s be a little careful.\n\nI have yet to keep Jeb alive very long. I\u0027ve played enough to know the basic pitfalls, but I invariably do something stupid and kill him. Most recently, I discovered that if your capsule falls over and rolls to where the hatch is down, against the ground, he dies in a poof if you try to EVA. Sorry bud.\n\nAnd now I just killed 8 Kerbals at once, due to me being careless, on a trip up to populate the newly commissioned space station. Bill is my only orange-suit guy left.\n\nOh well. How does everyone else do keeping people alive? Better than me on average, I\u0027ll bet. :-) Now I\u0027ve decided that I need to plant memorial flags to each dead Kerbal on a moon or other planet."},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-06-08T04:13:16Z","Content":"\u003E \n\u003E I have yet to keep Jeb alive very long. I\u0027ve played enough to know the basic pitfalls, but I invariably do something stupid and kill him. Most recently, I discovered that if your capsule falls over and rolls to where the hatch is down, against the ground, he dies in a poof if you try to EVA. Sorry bud.\n\nIt isn\u0027t supposed to. It should tell you the hatch is blocked.\n\nI don\u0027t kill Kerbals very often, I tend to be a very careful planner. I don\u0027t slap rockets together and hope for the best, I often spend a lot of time checking and double checking things. However if I forget something and notice it in the first minute or so after launch I just revert and consider it a practice run."},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2015-06-08T04:21:11Z","Content":"I lost Val and a tourist to a staging error: the parachute deployed during the launch, and burned up during re-entry. Other than them, no casualties so far."},{"CreatedByName":"OddFunction","CreatedById":143805,"CreatedDateTime":"2015-06-08T04:22:42Z","Content":"I just use probecores until the rocket design is safe. Then I make sure to send them up with at least 3 parachutes.\n\nI still die the exact same way as OP though, with the hatch against the ground EVA. For those encounters, I just edit my persistence file to revive them. \n\nAnd then there\u0027s those precious few who I unintentionally banish to an orbit around the Sun *oh god im so sorry*\n\nPersonally I wouldn\u0027t apply for my space program..."},{"CreatedByName":"LittleBlueGaming","CreatedById":144665,"CreatedDateTime":"2015-06-08T04:29:24Z","Content":"I play with quickloading in my current career, so generally a death comes from practicing landings, and I just F9 and try again.\n\nI have been paying more attention to what I\u0027m building though, double checking everything and going through a checklist."},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-06-08T04:31:34Z","Content":"I lost one just last night. :/\n\nI play with TAC life support, and had a mission to rescue a kerbal from the Mun\u0027s surface. So I took my first Mun lander with a single-seat pod, added a probe core and radio antenna, and launched. Launch didn\u0027t go quite as efficiently as last time, and by the time I got to Mun orbit I knew I wouldn\u0027t have enough fuel to get home. But I figured I could at least get to orbit, and the pod was loaded with enough supplies to keep a kerbal alive for many weeks.\n\nThe rescue site had just moved in to night, but no worries. I dropped the rescue pod about a kilometre away and EVAd the kerbal in out of the cold. A quick check of the fuel level said that I wouldn\u0027t be getting back to orbit, but even worse the life support console was telling me I only had about six hours of battery power left. That\u0027s nowhere near enough for Mun night even after shutting down all non-essential systems. I considered trying to launch retrograde and burn the last of my fuel in a suborbital hop, but would not have had enough to get back in to sunlight and successfully land again, so poor Barcus hunkered down for a cold night while an expensive and hastily-prepared rescue mission burned a very inefficient trajectory trying to get there in time.\n\nIt didn\u0027t get there in time, touching down nearby a couple of hours too late. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) Sorry Barcus."},{"CreatedByName":"chd","CreatedById":78680,"CreatedDateTime":"2015-06-08T04:34:10Z","Content":"Oh yeah, I also play with revert turned off, because doing otherwise seems to make it pointless have respawn off.\n\nIf I actually strand someone in orbit around the sun, I make it a goal to eventually rescue them. They might be 60 years older then, but I\u0027ll get them. If I start playing with TAC life support I\u0027ll have to be more careful... ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-08T05:46:34Z","Content":"I do use quicksaves, so I generally go back and correct whatever I screwed up before it gets so far gone that kerbals start dying. I\u0027ve never lost an orange-suit, amazingly, but I have lost other kerbals. Usually to EVA mishaps and crashing rovers or running out of EVA propellant. \n\nI thought for sure I had lost Jeb once, I goofed the parachute settings in Realchute (Apparently, landing at 50 m/s instead of 5 is bad.) and was way beyond being able to revert. I bailed him out of the pod at about thirty kilometers. He bounced, then skidded to a stop on his face, and was smiling when he stood up."},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-06-08T05:55:24Z","Content":"\u003E \n\u003E It isn\u0027t supposed to. It should tell you the hatch is blocked.\n\u003E I don\u0027t kill Kerbals very often, I tend to be a very careful planner. I don\u0027t slap rockets together and hope for the best, I often spend a lot of time checking and double checking things. However if I forget something and notice it in the first minute or so after launch I just revert and consider it a practice run.\n\nThis is me basically me. Recently, however, I\u0027ve tried to stop reverting and now I\u0027ve lost 40,000 funds on my Mun program due to my rocket breaking apart from flipping (I use FAR btw). I find it more challenging, and FUN."},{"CreatedByName":"LittleBlueGaming","CreatedById":144665,"CreatedDateTime":"2015-06-08T05:58:33Z","Content":"\u003E \n\u003E This is me basically me. Recently, however, I\u0027ve tried to stop reverting and now I\u0027ve lost 40,000 funds on my Mun program due to my rocket breaking apart from flipping (I use FAR btw). I find it more challenging, and FUN.\n\nI recently lost three 160,000 fund launches in a row, cause I\u0027m stupid ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2015-06-08T11:12:42Z","Content":"Haven\u0027t killed any Kerbals yet, in my 1.0 campaign. I have had to mount some ridiculous rescues, though ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif).\n\nI play for keeps, except when testing a new design - then I can \u0022simulate\u0022 as many times as I like by reverting back, until the final launch, from which I don\u0027t revert."},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2015-06-08T11:58:33Z","Content":"I\u0027ve one casualty caused by a \u0022forget that, I\u0027m sure it will fly\u0022 attempt to build an ultra-lightweight plane, one Kerbal died because of reentry heat in 1.0.0, and three Kerbals that exploded together with my 150000 funds Eve ship when due to aero forces and too high thrust an engine decided to break loose and shoot directly through the hitchhiker container...\n\nI try to keep Kerbals alive as much as I can, and usually perform missions with probe cores instead. But there are things a probe core can\u0027t do. Manned landings for instance ;-)"},{"CreatedByName":"JackDugan","CreatedById":139522,"CreatedDateTime":"2015-06-08T18:27:06Z","Content":"My career is hard mode, and I have yet to be responsible for a fatality ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif). Let\u0027s just hope it stays this way...\n\n**Edited \u003Ctime datetime=\u00222015-06-08T18:30:46Z\u0022 title=\u002206/08/2015 06:30  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by JackDugan**"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-06-08T18:29:53Z","Content":"I \u0022technically\u0022 lost one Kerbal a few days ago when Kerbal Alarm Clock failed to inform me about her periapsis with enough time to switch to her. I guess really it was my fault for not making the time margin long enough, but meh. I called it \u0022non-canon\u0022 and shoved her back in from an older save file.\n\nAside from that, I have a spotless record for at least the past year."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-08T19:20:33Z","Content":"I don\u0027t rack up fatalities often and when I do its due to either a) my ineptitude and forgetting to quicksave, or ![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) inadequate delta V margins to complete the mission.\n\nBoth of these managed to end many of my Jool missions prematurely and, until recently, Laythe remained baseless and Jool had almost 20 confirmed kills."},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-06-08T19:47:59Z","Content":"Redundancies and overengineering is the key to success of this player\u0027s space program ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif) Seriously - only time when i build small is early in the career. After unlocking couple of science tiers, upgrading KSC a bit and earning some money i get right back to building ships and stations with more parachutes, batteries, solar panels, science equipment than is really necessary. And fuel, lots of fuel - my Kerbin system exploration ships regularly carry enough dV to reach Duna ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) And almost everything is reuseable. But it pays off - i have yet to lose a crew member to causes other than Kraken attack. Which do not count as legitimate and get save-reverted Damn bugs ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif)"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-06-09T06:19:39Z","Content":"I put a LES on anything I have. The LES have a parachute bit so that any launch that is not supposed to land but has kerbals in it can still survive. I have .625 Version, a better 1.25 meter version, and a 2.5 meter version with landing assist rockets."},{"CreatedByName":"Gnou","CreatedById":132378,"CreatedDateTime":"2015-06-09T08:39:06Z","Content":"Such career options really changed all the KSP experience for me.\n\nEspecialy at start while dealing with low ground installations, parts count and cost.\n\nSafety become all a budget!\n\nIt is not that harsh in end but make every step more \u0022interessing\u0022 in a way.\n\n*--- My path*\n\nI go slowly, hoping surely.\n\nShip design and mission planning become very different.\n\nUsualy I go with 1-3 prototype before having 1st in-prod version. Making a lot of test about launch/stage stability, parachutes efficiency before painting a proud \u0022*Approuved*\u0022 on the ship/subpart design. I record more my flight, the safe reentry attempt I gradually lower.\n\nYep, very slowly!\n\nAnd sometimes I still overestimate my good old trusted model and run into very emotional situations. Typicaly when launching a lander which dont have any parachute... And things gone wrongly! I have a few miracle survivor from such bad scenario.\n\nBut aircraft still *The Danger*, no doubt. Always my *FAG* department (*Famous And Glorious*), reserved to the most fearless\\* Kerbals.\n\n\\* or brainless. Distinguish inbetween is so hard!"},{"CreatedByName":"Voyager275","CreatedById":128829,"CreatedDateTime":"2015-07-08T21:47:53Z","Content":"I lost 3 when the parachute burned up upon re-entry and they crashed into the ocean. I put a flag to commemorate the losses.\n\n**Edited \u003Ctime datetime=\u00222015-07-12T07:45:26Z\u0022 title=\u002207/12/2015 07:45  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 12, 2015\u003C/time\u003E by Voyager275**"},{"CreatedByName":"davidpsummers","CreatedById":108982,"CreatedDateTime":"2015-07-08T22:07:00Z","Content":"\u003E \n\u003E \\*sigh\\*\n\u003E I started playing again recently, and I usually play in a very liberal career mode (funding rewards turned way up because I really don\u0027t want to have to worry much about money), but also with \u0022respawn lost Kerbals\u0022 off because well let\u0027s be a little careful.\n\u003E \n\u003E I have yet to keep Jeb alive very long. I\u0027ve played enough to know the basic pitfalls, but I invariably do something stupid and kill him. Most recently, I discovered that if your capsule falls over and rolls to where the hatch is down, against the ground, he dies in a poof if you try to EVA. Sorry bud.\n\u003E \n\u003E And now I just killed 8 Kerbals at once, due to me being careless, on a trip up to populate the newly commissioned space station. Bill is my only orange-suit guy left.\n\u003E \n\u003E Oh well. How does everyone else do keeping people alive? Better than me on average, I\u0027ll bet. :-) Now I\u0027ve decided that I need to plant memorial flags to each dead Kerbal on a moon or other planet.\n\nWell, in my previous campaign it was abort escape system and sheer luck. I had a rocket explode on the pad only to leave the capsule sitting safely on the launch pad....\n\n![kBagUUY.png](http://i.imgur.com/kBagUUY.png)"},{"CreatedByName":"Sidereus","CreatedById":135263,"CreatedDateTime":"2015-07-09T00:04:40Z","Content":"So far I\u0027ve only lost one Kerbal on this career save...and it was because I didn\u0027t realize his vessel used parts from a mod I uninstalled (the parts were exactly like stock parts, just with slightly different properties, and I must have grabbed one of the modded parts by mistake). Luckily he was a rescued Kerbal, and not one of the orange suites."},{"CreatedByName":"Coneshot","CreatedById":69785,"CreatedDateTime":"2015-07-09T01:17:41Z","Content":"I had 2 die the other day from premature parachute deployment, then an accident during EVA sent Val retrograde with enough speed to deorbit her. She reentered and fell into the ocean with just a spacesuit and somehow survived! Just shows sometimes luck goes both ways."},{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-09T01:20:14Z","Content":"Jeb died. Oh. F NINE"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-07-09T02:42:12Z","Content":"\u003E \n\u003E I just use probecores until the rocket design is safe. Then I make sure to send them up with at least 3 parachutes.\n\u003E I still die the exact same way as OP though, with the hatch against the ground EVA. For those encounters, I just edit my persistence file to revive them. \n\u003E \n\u003E And then there\u0027s those precious few who I unintentionally banish to an orbit around the Sun *oh god im so sorry*\n\u003E \n\u003E \n\u003E \n\u003E Personally I wouldn\u0027t apply for my space program...\n\nSorry, but why don\u0027t you just hit Q or E and roll the craft over. As a general rule its not a good idea to tip your craft over. I made to nacell arms that I use as radials that I put my landing gear at the end of, the craft is hard to tip. You can always rescue an abandoned pilot and bring them home. If you have McJeb put it on a capsule and send it up empty to fetch stranded players. I killed Bill in a mission to get skill up engineering, when he was respawned he had skilled up two levels, next time I kill him sooner, lol. \n\nDon\u0027t take the game too seriously, if on your first moon landing your pilot survives but your ship is lunar paper weight, meh, consider it good luck."},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2015-07-09T02:59:57Z","Content":"On my current save, I\u0027ve killed half a dozen already. It will get better once I get out of the initial tiers of buildings and science, but I misjudged the effects of reentry and killed a bunch of Kerbals when the capsule didn\u0027t slow down fast enough and the parachute couldn\u0027t be safely deployed."}]}