{"TopicId":113091,"ForumId":32,"TopicTitle":"The problem with the atomic engine now is bulk","CreatedByName":"RocketBlam","CreatedById":103420,"CreatedDateTime":"2015-06-16T05:47:36Z","PageNum":1,"Articles":[{"CreatedByName":"RocketBlam","CreatedById":103420,"CreatedDateTime":"2015-06-16T05:47:36Z","Content":"The atomic engines can be more efficient than regular engines... but usually only if you carry a ton of liquid fuel, and leave the oxidizer behind. This should be fine - it should balance out, and become a net positive over regular engines, and it does, when you include a LOT of tanks.\n\nIf you just use the regular, liquid fuel tanks (like are used on airplanes), you have to include a bunch of them. And though they are lighter in weight, this is counterbalanced by the huge bulk of all those tanks in the numbers you need.\n\nSo you might choose to use the regular fuel tanks, and just take out the oxidizer before you launch, but that\u0027s a problem too. Now you have huge tanks that are half empty, and will always be half empty.\n\nOne thing we need, I think, is some 2.5m tanks that are dedicated to liquid fuel only. Then we can use the whole tank volume for LF instead of launching a huge, half-empty tank. I know we have the large tanks for spaceplanes, but they can be troublesome to use in vertical, VAB rockets (having to include adapters, things don\u0027t attach in the same way, etc.)"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-16T06:43:53Z","Content":"The MK3 long liquid fuel fuselage holds only 1/3 less liquid fuel than the largest Kerbodyne fuel tank, and one such tank \u002B LV-N gives you some 10,000 m/s dV, more than any other engine-tank combination by far (maybe save for Ion).\n\nIf you\u0027re building a spaceplane, most of your parts will be fuel tanks anyway, and you\u0027ll need liquid fuel for jet engines.\n\nSeriously, what and where do you want to fly if - say - three such tanks (not an overkill) are not enough for you?"},{"CreatedByName":"Megadeath","CreatedById":144236,"CreatedDateTime":"2015-06-16T10:03:17Z","Content":"While the mk3 parts can certainly hold a decent amount of fuel, that doesn\u0027t really give the whole picture. \n\nAs the OP said, there\u0027s other constraints weighing against them. Especially in the VAB. To the original reasons, I\u0027d add that I believe they have worse wet/dry mass ratio? Not sure and can\u0027t check right now.\n\nFor something like a modular interplanetary engines, among other things, it seems like a dedicated, liquid fuel tank for rockets specifically is justified."},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-06-16T11:42:38Z","Content":"I think it simulates hydrogen fuel density really good, and should stay.. the only reason I dont use plane tanks on rockets for nukes.\n\nedit- maybe they even should add hydrogen as a resource and add a tweakable on tanks to make them hydrogen mode."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-16T12:04:46Z","Content":"You don\u0027t need a huge amount of fuel to make the LV-N a good choice. Breakeven for a nuke over a chemical engine occurs at around 2.5t of fuel per engine, the best chemical engine would require \u003E5t of fuel for the same delta-V. A single Mk2 LF fuselage per LV-N makes for an efficient combination. Take this tug ([pic](https://dl.dropboxusercontent.com/u/61004449/KSP/1.0/screenshot13.png)) with 4 LV-Ns, it fits inside a 3.75m fairing (and a 2-LV-N version will fit in a Mk3 cargo bay) and it can deliver 2700m/s for an orange tank sized payload. It gets even better if the tug is reused or combined with ISRU.\n\nDefinitely agree we could use a 2.5m LF-only tank, though."},{"CreatedByName":"JimmyAgent007","CreatedById":74761,"CreatedDateTime":"2015-06-16T12:08:23Z","Content":"No new tanks unless its a size we dont have. What we do have now should be adjustable so we can tweak what fuels we have in it. An old suggestion I know but really, it makes more sense and less clutter in the menus."},{"CreatedByName":"georgTF","CreatedById":57397,"CreatedDateTime":"2015-06-16T12:13:22Z","Content":"There\u0027s lots of issues with the LV-Ns. Same as other engines. Isp is certainly important and the nuke is king in Isp, but it\u0027s also heavy, large, tends to overheat small/sensitive parts, uses LF only which forces a slightly different fuel tank solution, and above all else it has crappy thrust for the bulk.\n\nIs it **allways** the best engine for the job? No. Not unless your craft is an interplanetary SSTO or system tug/fuel tanker. It is **often** the most efficient choice, but not allways the most practical one. Given how good it already is when used in it\u0027s ideal conditions, why should it be improved further? It would make other engines useless.\n\n[edit]\n\nAtomic motors should really use a separate type of fuel, but Squad must be loathe to include yet another one. It\u0027s also neglected that when using garbage can or orange tanks, the craft benefits from better heat management in addition to carrying a bit of deadweight. It evens out.\n\n**Edited \u003Ctime datetime=\u00222015-06-16T12:24:41Z\u0022 title=\u002206/16/2015 12:24  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 16, 2015\u003C/time\u003E by georgTF**"},{"CreatedByName":"Orbital Vagabond","CreatedById":145561,"CreatedDateTime":"2015-06-16T13:44:37Z","Content":"Scott Manley also weighed in on this about a month ago:\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/s90tSM0oowo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nTo sum up: Liquid hydrogen is the fuel that makes sense for nukes, and LH2 is very bulky. If we included any kind of accurate LH2 fuel, then it\u0027s tankage would be *even less size and mass efficient than using the half empty LFO tanks!*\n\n- - - Updated - - -\n\n\u003E \n\u003E What we do have now should be adjustable so we can tweak what fuels we have in it. An old suggestion I know but really, it makes more sense and less clutter in the menus.\n\nOn one level, I agree with this so hard it\u0027s not even funny. But on another level, I\u0027m really conflicted about it.\n\nThe devs have stated that *any* kind of procedural part (beyond fairings, because...?) isn\u0027t going to be considered because they prefer the \u0022lego\u0022 asthetic and building challenge: You have a variety of pre-fab parts, instead of the perfect part for every possible situation.\n\nHowever, it\u0027s frustrating when the devs include new mechanics (e.g. LF-only nukes), then *don\u0027t* include the parts that feel like they support the new mechanics. *See also \u0022Where my radiators at, Squad?, Vol. XXVIII\u0022*\n\nAnd I kind of hate myself for saying this, but I think sticking with the \u0022lego\u0022 aesthetic is better option in this case. However, I would be very happy if we got a few configurations (like, 4 or fewer) for each tank size, e.g. the FLT 200 could carry LFO 9:11 (for pure LFO engines), LFO 12:4 (for dual-cycle engines), pure LF, or pure OX. The configuration could be selected in the tweakables menu, and one-fuel tanks could hold slightly more volume than fuel tanks that contained multiple fuels. I think it would be a good compromise between the two stances.\n\nPS we still need radiators."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-16T13:51:29Z","Content":"Tweakable fuel types could also permit the elimination of the duplicate spaceplane parts and save a bit of RAM."},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-16T14:05:37Z","Content":"Procedural Tanks needs to be stock."},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2015-06-16T15:06:58Z","Content":"It is really sill we canot just fill them up with whatever we want using tweakables.. \n\nI wish they did not start adding such features only to implement them just partly..\n\nWas also hidden tweakable to make parts into rotor/ball bearings as well.. They said it was disabled currently by default because of a bug making it crash when doing time warp and that it would most likely be fixed and enabled in the next versions.\n\nNow probably like close to a year later there has been nothing.. I bet the original developer is no longer even at squad, since they love to hire modders just to fire and replace them a month or two later.\n\nSquad has done alot of great things with this game, but their management seems really bad..."},{"CreatedByName":"MLWostal","CreatedById":134330,"CreatedDateTime":"2015-06-16T15:39:32Z","Content":"If you want larger LF tanks then make them. Just find the tank size you want, copy (and rename) the folder in the gamedata\\squad\\parts folder, edit the copied .cfg file and change the fuel (changing the in game name as well). \n\nThis way, those who are purist or have tons and tons of items already in their parts folders, won\u0027t get all upset because more parts are showing up in their already overloaded listings and you have the part you want.\n\nThe new parts also have their textures as .dds so changing their colors to indicate LF only is easy.\n\nNo modding of the actual .mu, no having to learn 3d design to create new, just a few very simple changes and your version of KSP is now tailored to your own gameplay.\n\nAnd if you\u0027re a \u0027It must be REAL!\u0027 type player, what\u0027s it matter to you is another uses something you don\u0027t agree with? With all the mods out there, why not allow others to enjoy the game as a game and not real life. Besides, last I looked, the only green people I see are the one that eat my cooking, and they are thankfully very few in numbers. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nFor those that want to share their .craft files, a pic is all I need to recreate most (not all as they do get complicated) of them. Never needed to download a .craft file anyway as it is much more fun to try and recreate the ship myself so I learn from my own mistakes of which, I assure you, are many. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nSo, shutting up now and I hope I offended no one."},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-06-16T15:48:33Z","Content":"\u003E \n\u003E Procedural Tanks needs to be stock.\n\nProcedural parts is great for any realism modpack- but it really makes KSP feel like a different game.\n\nI just don\u0027t think it would be good for stock."},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-06-16T16:06:30Z","Content":"If you\u0027re not against part packs, try Fuel Tanks Plus. Great for more options, and LF only tanks."},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-16T16:32:42Z","Content":"\u003E \n\u003E Procedural parts is great for any realism modpack- but it really makes KSP feel like a different game.\n\nYeah, it makes KSP feel like a much better game."},{"CreatedByName":"Tankman101","CreatedById":144359,"CreatedDateTime":"2015-06-16T16:39:40Z","Content":"\u003E \n\u003E Yeah, it makes KSP feel like a much better game.\n\nIn your opinion\\*\n\nFrankly Proc Parts makes the game feel too sterile (I used them)."},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-16T16:47:29Z","Content":"\u003E \n\u003E In your opinion\\*\n\nE: Yes, I know, I thought that was implicit in this matter of taste. ![:rolleyes:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif)\n\n**Edited \u003Ctime datetime=\u00222015-06-16T16:53:32Z\u0022 title=\u002206/16/2015 04:53  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 16, 2015\u003C/time\u003E by regex**"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-06-16T16:56:47Z","Content":"\u003E \n\u003E E: Yes, I know, I thought that was implicit in this matter of taste. ![:rolleyes:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif)\n\nInstead of procedural tanks, i would be perfectly happy with tweakable tanks that let you put what type of fuel you want in a tank."},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-16T16:59:34Z","Content":"\u003E \n\u003E Instead of procedural tanks, i would be perfectly happy with tweakable tanks that let you put what type of fuel you want in a tank.\n\n*Anything* is better than this silly LEGO crap we have now (IN MY OPINION)."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-16T17:03:15Z","Content":"I\u0027m odd about that, I prefer Lego-style for the stock game but go all procedural for RSS/RO."},{"CreatedByName":"Mat2ch","CreatedById":139755,"CreatedDateTime":"2015-06-16T18:30:21Z","Content":"I have my Space Tug floating around Duna right now. Uses four LV-Ns. It takes some time to get somewhere, but it\u0027s very efficient. Not bulk, I\u0027d say."},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-06-16T18:39:19Z","Content":"\u003E \n\u003E Procedural Tanks needs to be stock.\n\nWhile I see the wisdom behind that suggestion (3 diameters x 5 heights really don\u0027t have to be represented by 15 individual parts), I respectfully disagree. \n\nI\u0027ve recently discovered a great desire to make tanks of the oddest shapes in order to fill up the free space within a fairing. Which isn\u0027t totally unlike how it happens in reality, methinks. But the ability (and necessity) to build vessels in this fashion should remain in Realism Overhaul. For stock KSP, I think it\u0027s better to have distinct and discrete sizes. That\u0027s what makes it a virtual erector kit.\n\nEDIT: ninja\u0027d five times over. I really should read the whole thread before I reply.\n\n**Edited \u003Ctime datetime=\u00222015-06-16T18:41:56Z\u0022 title=\u002206/16/2015 06:41  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 16, 2015\u003C/time\u003E by Laie**"},{"CreatedByName":"Archgeek","CreatedById":116048,"CreatedDateTime":"2015-06-16T19:10:07Z","Content":"\u003E \n\u003E A single Mk2 LF fuselage per LV-N makes for an efficient combination. Take this tug ([pic](https://dl.dropboxusercontent.com/u/61004449/KSP/1.0/screenshot13.png)) with 4 LV-Ns, it fits inside a 3.75m fairing (and a 2-LV-N version will fit in a Mk3 cargo bay) and it can deliver 2700m/s for an orange tank sized payload. It gets even better if the tug is reused or combined with ISRU\n\nWow, that looks a lot more effective than my crazy Von Braun [tug](https://dl.dropboxusercontent.com/u/59091477/Monstrosities/Nuke%20Test/screenshot138.png). Mine\u0027s got a lot more fuel and half the thrust, making for a pathetic TWR. It can get a 101 tonnes on a kerbin escape and come back, though."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-17T06:30:01Z","Content":"Why the heck procedural?\n\nBoth LF and oxidizer sliders should go up to full tank capacity, only limited in software so that their sum doesn\u0027t go over the tank\u0027s capacity (say, the fuel bar is reflected in the right side of oxidizer bar, through a different color."},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2015-06-17T09:44:17Z","Content":"\u003E \n\u003E Instead of procedural tanks, i would be perfectly happy with tweakable tanks that let you put what type of fuel you want in a tank.\n\nThis. \n\nI played around with procedural tanks a few versions back, honestly I didn\u0027t care for it. They were nice to limit part count (a little) but I didn\u0027t care for the looks or just the mechanics or what have you. Being able to take all the oxidizer out of a tank and make it a pure LF tank(to the volume it should be) would be exactly what I was expecting when tweakables was announced, and what I am still hoping for."}]}