{"TopicId":11316,"ForumId":32,"TopicTitle":"Stock Mars Landing","CreatedByName":"Candre","CreatedById":15181,"CreatedDateTime":"2012-05-24T06:04:30Z","PageNum":1,"Articles":[{"CreatedByName":"Candre","CreatedById":15181,"CreatedDateTime":"2012-05-24T06:04:30Z","Content":"I\\\u0027d like to discuss getting to Mars using stock vehicles. Does anyone have any strategies they\\\u0027ll be using? Like docking with a spacestation and re-fueling, then getting into Kerbol orbit, etc. Any launch vehicles you think can get to Mars without the use of docking? (assume that Mars\\\u0027 SMA is twice the length of Kerbin\\\u0027s)\n\nI certainly can\\\u0027t wait to get there. If you\\\u0027ve seen my other thread you would know that I\\\u0027ve already found a suitable launch vehicle. But it isn\\\u0027t stock, so I can\\\u0027t guarantee it\\\u0027ll be around for much longer.\n\nIf anyone has a vehicle, posting it for testing and stuff like that would be beneficial. Thanks!"},{"CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-05-24T07:14:37Z","Content":"I\\\u0027m certainly intrigued by the problem from a game play and real life perspective.\n\nHowever, my general mission will probably go something like, fly up to space station which has been built and filled with lots of precious fuel with a few medium lift launches beforehand... then fling entire space station to kerbal mars using a munar slingshot. Once in orbit, the lander would then detach and and land and return, however that may be accomplished, and then the entire space station, complete with empty fuel tanks brought back. Aerobraking may be used to try and save fuel. The main advantage of doing this is that the interplanetary ferry can be used again and again.\n\nAs for actually landing and returning form a mars like planet, that\\\u0027s something i\\\u0027m not so sure about. Space-planes are probably out due to atmosphere not being not as thick. Parachuets\u002Brockets to land something with enough fuel mass to reenter orbit will probably be what i\\\u0027d try first though."},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2012-05-24T07:24:14Z","Content":"That sounds like the Chinese ship from 2010: Odyssey 2. Everyone thought it was a space station until the engines got bolted on. The important thing is, once it has engines, it\\\u0027s more ship than spacestation.\n\nAs for me... NERVA engines, assemble! So no, it wouldn\\\u0027t be stock."},{"CreatedByName":"popeter123","CreatedById":18410,"CreatedDateTime":"2012-05-24T07:33:17Z","Content":"try mars direct idea"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-05-24T08:19:16Z","Content":"\u003E \n\u003E That sounds like the Chinese ship from 2010: Odyssey 2. Everyone thought it was a space station until the engines got bolted on. The important thing is, once it has engines, it\\\u0027s more ship than spacestation.\n\u003E \n\u003E As for me... NERVA engines, assemble! So no, it wouldn\\\u0027t be stock.\n\nYou, sir, win a geek cookie from me. As good as the movie is, the book is still awesome on its own with this reason as a good example. Where is this ingenuity today? KSP."},{"CreatedByName":"VincentMcConnell","CreatedById":14492,"CreatedDateTime":"2012-05-24T13:58:00Z","Content":"Well my biggest hypothesis for Mars landing travel for us will be to take advantage of parachutes. More than \\*one\\* parachute.\n\nThree would probably do it, but Mars has a thin atmosphere, so the goal is to try to get as much of that lift as possible. It will require less delta-v from the powered descent engine when the parachutes finally deploy. The craft can also be lighter in that way. It would not need a dedicated ascent stage. Refueling, however, will probably require a station in Martian orbit."},{"CreatedByName":"6677","CreatedById":890,"CreatedDateTime":"2012-05-24T14:08:19Z","Content":"I was discussing this with a friend recently, our theoretical landing would present its own difficulties but we think would be the best. Launch a spaceplane with droptanks to get it to \u0027mars\u0027, land it normally (it may require an unusual amount of wings to create lift) using high atmosphere engines, take off, somehow get back to kerbin possibly decoupling the extra wings for the mars lift."},{"CreatedByName":"Naiba","CreatedById":3221,"CreatedDateTime":"2012-05-24T14:24:15Z","Content":"I\\\u0027d just cheat and use an existing IRL study.\n\nSomething like TROY?\n\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/Uj45Au3KCRg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E"},{"CreatedByName":"RC1062","CreatedById":10709,"CreatedDateTime":"2012-05-24T14:32:35Z","Content":"Reusability appears to be the future."},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-05-24T14:48:13Z","Content":"Well, considering a Mars planet is coming after crew transfer, I am going to do something like Mars Direct; I would land my unmanned return stage first, and then land a habitation module with my crew inside next to it. When I am done on mars, I hop into my returnstage and go home to Kerbin. This means I leave my habitation module every mission, so I am also simultaneously making a marsbase! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2012-05-24T19:07:29Z","Content":"More than any of the planned features, I\\\u0027m looking forward to flying missions to other planets. I\\\u0027m thinking it\\\u0027ll end up being my entertainment for next winter. I like the idea of crew transfer and orbital rendezvous. \n\nAs for how to get to another planet, there was some good discussion about this topic in the [How are we to get to Mars](http://kerbalspaceprogram.com/forum/index.php?topic=9660.0) thread a few months ago."},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2012-05-24T19:08:56Z","Content":"But surely we can\\\u0027t tell what \\\u0027stock\\\u0027 will be at that point?\n\nWe know for a fact that docking is planned beforehand."},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-05-24T20:48:59Z","Content":"\u003E \n\u003E I\\\u0027d just cheat and use an existing IRL study.\n\u003E \n\u003E Something like TROY?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E \u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/Uj45Au3KCRg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nEven if it\\\u0027s not a IRL study, I rather liked the design for Mars 2 in \\\u0027Mission to Mars.\\\u0027 True, it was rather vulnerable to space debris and flotsam, but you have to consider that it was a rush job when it became Mars Recovery. I honestly hope that NASA and commercial interests pay attention to movies like these that remind us that space isn\\\u0027t that empty out there."},{"CreatedByName":"AlternNocturn","CreatedById":17872,"CreatedDateTime":"2012-05-24T21:08:00Z","Content":"I\\\u0027d pull a Stephen Baxter\\\u0027s \u0027Voyager\u0027 (hadn\\\u0027t read the book but I saw a video of a Mars landing detailed in it) and build a huge propulsion stack in orbit (via docking of course), then launch the rocket containing the other parts of the mission, dock it to the propulsion stack and use the propulsion stack\\\u0027s large supply of fuel to do a Trans-Martian Insertion. No fancy slingshots, no math, just wait for the planet to rise over Kerbin\\\u0027s limb and burn."},{"CreatedByName":"Excalibur","CreatedById":12839,"CreatedDateTime":"2012-05-24T22:33:00Z","Content":"\u003E \n\u003E I\\\u0027d pull a Stephen Baxter\\\u0027s \u0027Voyager\u0027 (hadn\\\u0027t read the book but I saw a video of a Mars landing detailed in it) and build a huge propulsion stack in orbit (via docking of course), then launch the rocket containing the other parts of the mission, dock it to the propulsion stack and use the propulsion stack\\\u0027s large supply of fuel to do a Trans-Martian Insertion. No fancy slingshots, no math, just wait for the planet to rise over Kerbin\\\u0027s limb and burn.\n\nGreat book (though I think it\\\u0027s \\\u0027Voyage\\\u0027). I found the whole Apollo-N business in that book rather grizly. Still it\\\u0027s a great insight in to what may have been had NASA not pursued the flawed (but still incredible) Space Shuttle Program. Mr. Baxter has produced some excellent hard science fiction - if you liked \\\u0027Voyage\\\u0027 give \\\u0027Titan\\\u0027 a go - I think it\\\u0027s even better.\n\nBack on topic, I like this brute force approach. I think it\\\u0027ll be the first one I use. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Candre","CreatedById":15181,"CreatedDateTime":"2012-05-24T23:11:38Z","Content":"\u003E \n\u003E But surely we can\\\u0027t tell what \\\u0027stock\\\u0027 will be at that point?\n\u003E \n\u003E We know for a fact that docking is planned beforehand.\n\nGood point about stock. I think that it should be entirely possible now, and then we\\\u0027ll just have some new parts by the planet release. Unless current stock parts get re-balanced beforehand..."},{"CreatedByName":"Thiel","CreatedById":13126,"CreatedDateTime":"2012-05-24T23:19:48Z","Content":"\u003E \n\u003E No fancy slingshots, no math, just wait for the planet to rise over Kerbin\\\u0027s limb and burn.\n\nThat only works when you want to get to a body that\\\u0027s orbiting the same body as you are."},{"CreatedByName":"Excalibur","CreatedById":12839,"CreatedDateTime":"2012-05-24T23:34:41Z","Content":"\u003E \n\u003E That only works when you want to get to a body that\\\u0027s orbiting the same body as you are.\n\nHell, if you\\\u0027re looking for a planet that far away to come over the limb you\\\u0027ll have a very hard time seeing it anyway.\n\nMakes me wonder, once the full planetary system arrives, will we actually be able to see distant bodies and how will the renderer cope with it? I think it would be pretty cool to look up from Kerbin at night and see the planets twinkling in a string along the ecliptic (assuming the system is like ours). I\\\u0027m sure you could even navigate by them..."},{"CreatedByName":"maxpower","CreatedById":16625,"CreatedDateTime":"2012-05-25T00:28:09Z","Content":"\u003E \n\u003E Well, considering a Mars planet is coming after crew transfer, I am going to do something like Mars Direct; I would land my unmanned return stage first, and then land a habitation module with my crew inside next to it. When I am done on mars, I hop into my returnstage and go home to Kerbin. This means I leave my habitation module every mission, so I am also simultaneously making a marsbase! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nThats probably how I would do it as well. \n\nAlthough, instead of sending my return craft to the surface of \u0027Mars\u0027 I would probably put it in orbit instead and just make sure my lander has enough fuel to get back into Mars orbit and meet up with it. Otherwise my return craft would need enough fuel to get to \u0027Mars\u0027, land, get back into orbit, and go home. If it can do all that, you could just use one craft to begin with. Sending it to orbit instead would save all that fuel needed to land and get it back into orbit... which is probably the part of the mission that needs the most fuel. Of course that means your lander needs to carry enough fuel to make it back into orbit itself, but that shouldn\\\u0027t be that hard to do. The other way I could see doing a Mars style mission would simply be to build a huge \u0027mothership\u0027 in Kerbin orbit using docking, and then launch that to \u0027Mars\u0027 and have a small landing craft attached to it to get to do the landing and get back into orbit. \n\nOne thing I don\\\u0027t see as being possible is doing a \u0027Mars\u0027 mission with one single launch from the surface of Kerbin with current parts. You would need to bring so much fuel the ship would be way too large to get into orbit."},{"CreatedByName":"Rascal Nag","CreatedById":9451,"CreatedDateTime":"2012-05-25T00:31:02Z","Content":"Am I the only one who is irked by calling the first other planet Mars? I know it\\\u0027s just a placeholder name by the community, but it just seems a bit weird to use it in reference to KSP planets."},{"CreatedByName":"Ted","CreatedById":26298,"CreatedDateTime":"2012-05-25T01:45:01Z","Content":"\u003E \n\u003E Am I the only one who is irked by calling the first other planet Mars? I know it\\\u0027s just a placeholder name by the community, but it just seems a bit weird to use it in reference to KSP planets.\n\nI think a modification of that name would be okay, it would help people with a point of reference."},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-05-25T02:21:55Z","Content":"Oh yeah, there\\\u0027s a topic. Heh. My aim is going to be using slingshotting, as even with KSP\\\u0027s SOI mechanics, it seems to be quite effective."},{"CreatedByName":"RC1062","CreatedById":10709,"CreatedDateTime":"2012-05-25T06:54:10Z","Content":"Well, we can\\\u0027t really refer to it by another name...\n\nFrom henceforth I shall refer to it as MARS (Martian Analogue Really Special)."},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-05-25T08:42:41Z","Content":"\u003E \n\u003E Well, we can\\\u0027t really refer to it by another name...\n\u003E \n\u003E From henceforth I shall refer to it as MARS (Martian Analogue Really Special).\n\nBetter yet, MARK- Martian Analogue Really Kerbal\n\nWho doesn\\\u0027t want to sound like a hair-lipped dog when talking about the next planet out from Kerbin?"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2012-05-25T10:19:29Z","Content":"I refer to it as \u0027Planet L\u0027\n\nL being after K"}]}