{"TopicId":113168,"ForumId":32,"TopicTitle":"PS4 Announcement Discussion","CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-06-17T02:43:43Z","PageNum":3,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-06-17T03:33:15Z","Content":"\u003E \n\u003E No dev time lost thanks to the kind people at Flying Tiger, who have shown us fantastic progress with getting the game working on the PS4. Also they\u0027ve been great to work with as well, as Unity 5 was something both studios could work on at the same time and it really, really increased the speed at which we progressed through that project.\n\u003E Worry not, 1.0.3 is still being worked on and you shouldn\u0027t have to wait much longer for it.\n\u003E \n\u003E Edit: And you\u0027d be amazed at how well the DS4 works with the game. We certainly were ourselves.\n\nI think I can say on behalf of everyone else, we demand this Squadcast be played on a controller. Doesn\u0027t have to be on PS4, but it must be on a controller. I think we all want to see just what you can actually do with NO mouse or keyboard.\n\n(Bonus points if, for budget cuts reasons, you just use an NES controller)"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-06-17T03:33:18Z","Content":"\u003E \n\u003E Annnnd I can breathe again! As I don\u0027t own a PS4 I really don\u0027t care how it will work out.... Good luck and fly safe *Flying Tiger*!\n\nExcept for the fact that Flying Tiger is a mobile game studio, perhaps that\u0027s a good thing that they are used to working with low computer power devices. Perhaps a mobile port is in the works?"},{"CreatedByName":"Maxmaps","CreatedById":66172,"CreatedDateTime":"2015-06-17T03:34:16Z","Content":"\u003E \n\u003E I think I can say on behalf of everyone else, we demand this Squadcast be played on a controller. Doesn\u0027t have to be on PS4, but it must be on a controller. I think we all want to see just what you can actually do with NO mouse or keyboard.\n\u003E (Bonus points if, for budget cuts reasons, you just use an NES controller)\n\nYou\u0027re implying I can play even with a keyboard and mouse."},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-06-17T03:35:08Z","Content":"\u003E \n\u003E Except for the fact that Flying Tiger is a mobile game studio, perhaps that\u0027s a good thing that they are used to working with low computer power devices. Perhaps a mobile port is in the works?\n\nYea, I\u0027ll just amend my statement to \u0022Good Luck, you\u0027re gonna need it.\u0022"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-06-17T03:35:47Z","Content":"\u003E \n\u003E You\u0027re implying I can play even with a keyboard and mouse.\n\nBravo. Way to avoid having to play with controller. ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)\n\nwhile you\u0027re here can you tell us which version of Unity the PS4 version will run?"},{"CreatedByName":"tygoo7","CreatedById":57345,"CreatedDateTime":"2015-06-17T03:35:56Z","Content":"Interesting... Maxmaps, are you sure the controls can fit on the PS4 controller? I just don\u0027t see how it would work since I have a PS4 myself."},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-17T03:37:03Z","Content":"\u003E \n\u003E Also they\u0027ve been great to work with as well, as Unity 5 was something both studios could work on at the same time and it really, really increased the speed at which we progressed through that project.\n\nYou say \u0022progressed\u0022, as in past tense, does that mean the Unity 5 upgrade is complete? Because that would be awesome."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-06-17T03:37:37Z","Content":"\u003E \n\u003E No dev time lost thanks to the kind people at Flying Tiger, .... they\u0027ve been great to work with as well, as Unity 5 was something both studios could work on at the same time and it really, really increased the speed at which ***we progressed*** through that project.\n\nEmphasis added: perhaps you mean ***are progressing***? You make it sound like the KSP on PC / Unity 5 engine update, is close to release. Which does not seem likely ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n*Edit:* ninja\u0027d by Randazzo, posted in the same minute ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n**Edited \u003Ctime datetime=\u00222015-06-17T03:40:37Z\u0022 title=\u002206/17/2015 03:40  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by basic.syntax**"},{"CreatedByName":"Maxmaps","CreatedById":66172,"CreatedDateTime":"2015-06-17T03:37:38Z","Content":"Controls work out well so far. We\u0027ll share diagrams later. And of course, like future versions of KSP (not 1.0.3, we\u0027re not that fast) it will run on U5."},{"CreatedByName":"tygoo7","CreatedById":57345,"CreatedDateTime":"2015-06-17T03:38:41Z","Content":"\u003E \n\u003E You say \u0022progressed\u0022, as in past tense, does that mean the Unity 5 upgrade is complete? Because that would be awesome.\n\nHeh, Unity 5 update before 1.0.3. Seems legit.\n\n\u003E \n\u003E Controls work out well so far. We\u0027ll share diagrams later. And of course, like future versions of KSP (not 1.0.3, we\u0027re not that fast) it will run on U5.\n\nAlright, looking forward to those diagrams."},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-06-17T03:41:11Z","Content":"I could explain my reaction in a whole paragraph but I could get the gist of it with this:\n\nWhat the .... Squad. You told us to trust you guys. ![;.;](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif)\n\nAlso, where the hell are our devnotes and 1.0.3? \n\n\u003E \n\u003E SQUAD? Hello?\n\nArrrrrrrrrrrrrgh, for *some* reason that I can not possibly explain, I longer see Squad as some sort of little indie game company. Instead, it\u0027s starting to look more and more like EA. I bet next week\u0027s devnotes will be the announcement of DLC. Mark my words.\n\n**Edited \u003Ctime datetime=\u00222015-08-07T06:49:19Z\u0022 title=\u002208/07/2015 06:49  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 7, 2015\u003C/time\u003E by mythbusters844**\n  \nremoved memes"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2015-06-17T03:45:36Z","Content":"The more the merrier, I say.\n\nAs for those concerned about keybindings not mapping, I\u0027m willing to bet something like this will be utilized:\n\n ![ffxiv-indepth-ps3-action-set.jpg](http://zantetsuken.net/wp-content/uploads/2012/10/ffxiv-indepth-ps3-action-set.jpg)\n\nFinal Fantasy XIV plays great on both the computer and PS3/4, and I actually use my controller when playing on my PC occasionally. The way it works is you have shoulder toggles that remap all eight face buttons to your hotkeys (which are fully customizable), and you can set up to eight of these, giving you 64 buttons easily accessible on the controller. \n\nI can\u0027t speak to how well building rockets will work using thumbsticks, but people have made some crazy stuff in Minecraft on the XBox, so who am I to judge?"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2015-06-17T03:45:58Z","Content":"Can\u0027t blame Squad for wanting to crack another market.\n\nUnless Squad are going to do something stupid like force us to play the game via gamepad, I don\u0027t really understand the wailing and gnashing of teeth that is going on.\n\nMinecraft and Terraria seem to manage just fine on PC with console versions also being available. I agree that the PS4 is probably not the ideal platform for KSP, so what? We will continue to have the superior version on PC. All this does is open KSP to a larger market, which is most likely a net positive."},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-06-17T03:47:49Z","Content":"\u003E Arrrrrrrrrrrrrgh, for *some* reason that I can not possibly explain, I longer see Squad as some sort of little indie game company. Instead, it\u0027s starting to look more and more like EA. I bet next week\u0027s devnotes will be **the announcement of DLC**. Mark my words.\n\nUm. I remember SQUAD saying that there would be DLCs a Loooonnnnnggggg time ago. \n\nIts part of the early access agreement too. I think."},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-06-17T03:47:52Z","Content":"Could use special moves from fighting games. Forward fireball for action group 1, reverse fireball for action group 2, double dash forward for landing gear, double dash backward for brakes, etc.\n\nSeriously though, what exactly is the point here? Are there that many people who have a PS4 but not a Mac/Windows/Linux machine?"},{"CreatedByName":"pegleg1972","CreatedById":142711,"CreatedDateTime":"2015-06-17T03:48:39Z","Content":"Early adopters are getting screwed, 1.0.3 and unity has been silent for weeks with there 1 person testing it.pc is getting screwed\n\n**Edited \u003Ctime datetime=\u00222015-06-17T04:20:17Z\u0022 title=\u002206/17/2015 04:20  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Vanamonde**\n  \nLanguage."},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-06-17T03:49:44Z","Content":"\u003E \n\u003E Could be compiling them as we speak, could be there isn\u0027t anything of note to share other than this.\n\u003E Also drama llamas confirmed.\n\nWe\u0027re not drama llamas. We just want Squad to actually develop the game we paid for, not expand it without fixing the core game\u0027s massive blatant flaws.\n\n\u003E \n\u003E Um. I remember SQUAD saying that there would be DLCs a Loooonnnnnggggg time ago. \n\u003E Its part of the early access agreement too. I think.\n\nI do know that Squad announced DLC a few months before I joined the forums, but we don\u0027t have paid DLC services yet. I was *implying* that they would announce the start of a paid DLC service.\n\n**Edited \u003Ctime datetime=\u00222015-06-17T10:10:10Z\u0022 title=\u002206/17/2015 10:10  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by KasperVld**\n  \nplay nice."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-17T03:50:15Z","Content":"Squad doesnt have the manpower for this. They\u0027re gonna overstretch and kill the game. They rushed 1.0, they didnt even give us a proper beta cycle, and now they\u0027re porting a game that taxes the hell out of even the strongest of hand-built gaming desktops to consoles with very limited processing power. My faith that they know what they\u0027re doing is becoming increasingly strained.\n\nI will happily be pleasantly surprised if the influx of funding leads to team expansions (its shrinking scarily fast right now) and massive improvements to the game as a whole (I smell optimization coming) but I reserve the right to be a cynical, critical, skeptic until proven otherwise."},{"CreatedByName":"Tankman101","CreatedById":144359,"CreatedDateTime":"2015-06-17T03:50:57Z","Content":"\u003E \n\u003E Early adopters are getting screwed\n\nLiterally no\n\n\u003E \n\u003E with there 1 person testing it\n\nWhere the hell did that number come from?\n\n\u003E \n\u003E Squad doesnt have the manpower for this.\n\nWhich is why there\u0027s a second studio on this. Do you not read?\n\n\u003E \n\u003E We\u0027re not drama llamas. We just want Squad to actually develop the game we paid for, not expand it without fixing the core game\u0027s massive blatant flaws.\n\nAnd Squad IS developing the game you paid for. So no, you\u0027re just drama llamas.\n\n**Edited \u003Ctime datetime=\u00222015-06-17T03:53:15Z\u0022 title=\u002206/17/2015 03:53  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Tankman101**"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-06-17T03:51:57Z","Content":"\u003E \n\u003E You\u0027re implying I can play even with a keyboard and mouse.\n\nI\u0027ve seen you. You flew to orbit that one time. And the other times. And then you stranded a hero at Ike. And later you killed him. Good times. Great fun. That\u0027s over half the fun of Squadcast, the other being teases about upcoming KSP news.\n\nread: pictures and announcements"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-17T03:52:24Z","Content":"\u003E \n\u003E \\*preemptive snip\\*\n\nThanks Max, for taking the time to come on here and share some stuff with us. We really appreciate all the hard work that goes into this game!\n\nThat\u0027s what he really wanted to say."},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-06-17T03:52:26Z","Content":"\u003E \n\u003E **Squad doesnt have the manpower for this.** They\u0027re gonna overstretch and kill the game. They rushed 1.0, they didnt even give us a proper beta cycle, and now they\u0027re porting a game that taxes the hell out of even the strongest of hand-built gaming desktops to consoles with very limited processing power. My faith that they know what they\u0027re doing is becoming increasingly strained.\n\n**SQUAD isn\u0027t doing the port.**\n\nedited out for unnecessary rudeness. ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif)\n\n**Edited \u003Ctime datetime=\u00222015-06-17T04:00:42Z\u0022 title=\u002206/17/2015 04:00  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Endersmens**"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-17T03:53:07Z","Content":"\u003E \n\u003E Early adopters are getting screwed, 1.0.3 and unity has been silent for weeks with there 1 person testing it.pc is getting screwed\n\nYou sir are being unnecessarily hostile. You do not appear in a position to speak on behalf of early adopters, not with a May 2015 join date. Us early adopters very much got our money\u0027s worth. We can be annoyed at the development direction, but we got what we paid for ten times over and can\u0027t complain in that regard.\n\n- - - Updated - - -\n\n\u003E \n\u003E **SQUAD isn\u0027t doing the port.**\n\u003E Geez.\n\ncitation needed. source plz?\n\nI apologize for not reading through the almost 20 pages of forum spam that is this chaos to find every detail. /sarcasm\n\n**Edited \u003Ctime datetime=\u00222015-06-17T04:21:53Z\u0022 title=\u002206/17/2015 04:21  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Vanamonde**\n  \nReference to edited post."},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-06-17T03:53:54Z","Content":"\u003E \n\u003E Which is why there\u0027s a second studio on this. Do you not read?\n\nI bet the PS4 version is going to end up more optimized and will run faster and use less memory than the PC version.\n\nAnd thats\u0027s the rest of the answer to this guy\u0027s question:\n\n\u003E \n\u003E ...and now they\u0027re porting a game that taxes the hell out of even the strongest of hand-built gaming desktops to consoles with very limited processing power.\n\n\u003E \n\u003E Literally no\n\nLiterally yes.\n\n\u003E \n\u003E And Squad IS developing the game you paid for.\n\nWhich is why we have 1.0.3 right now and the game is completely optimized and has little to no bugs. It\u0027s acceptable for an early access game, but why stay in early access when you can go 1.0 and get money?"},{"CreatedByName":"Tankman101","CreatedById":144359,"CreatedDateTime":"2015-06-17T03:54:40Z","Content":"\u003E \n\u003E citation needed. source plz?\n\n\u003E \n\u003E **No dev time lost thanks to the kind people at Flying Tiger**, who have shown us fantastic progress with getting the game working on the PS4.\n\nPlease read things, it works out for everyone."}]}