{"TopicId":113913,"ForumId":32,"TopicTitle":"Why the hate towards x64?","CreatedByName":"JeeF","CreatedById":143053,"CreatedDateTime":"2015-06-23T21:12:15Z","PageNum":3,"Articles":[{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-06-25T06:14:12Z","Content":"\u003E \n\u003E ... I see you didn\u0027t read the second sentence of the first paragraph where I acknowledged that...\n\n\u003E \n\u003E ... *as you yourself point out...*\n\nYour words acknowledged it. Your argument ignores it. \n\n\u003E \n\u003E And considering that it was Squad that truly opened the floodgates on this...\n\nBy withholding 64bit until it was put forth by others and then acceding to the demand for their official version? It was dragged from them unwillingly, which is hardly the same thing as carelessly \u0022opening the floodgates.\u0022 \n\n\u003E \n\u003E ... \u0022broken\u0022 is a rather loaded and unfair term for something that was broken?\n\nSure is, if the thing in question was, to repeat this as many times as it takes to get the point across, withheld because they knew it wasn\u0027t ready, and only reluctantly released in the face of popular demand. \n\n\u003E \n\u003E The difference was that the people asking for it to be pulled had their work directly hurt by it existing; Squad went and made things much more difficult for a group of people that created content for their game for free. Why?\n\nBecause Squad does not owe one segment of their players more than they owe another segment of their players. *Anything* they do is going to please some people and aggravate other people. Mod-makers are not a higher class of people deserving of greater consideration. \n\n\u003E \n\u003E ... none of this mess would have happened if they had never released the win64 build in 0.24.\n\nAnd the players demanding it would have been screaming about it ceaselessly this whole time. And remember, they did not originally release the 64bit anyway. Somebody discovered a way to jury-rig it and make it available despite Squad\u0027s wishes. \n\n\u003E \n\u003E Is it against the forum rules to state facts about what has happened if they reflect poorly on Squad?\n\nDon\u0027t try to play the oppression card. You were not infracted and nothing was edited from your post. \nYou want facts? 1) They didn\u0027t release it because they knew it wasn\u0027t ready. 2) Somebody forced their hand by making a hacked version available, at which point they saw little harm in acceding to popular demand and making the official one available, despite its unfinished (or \u0022broken\u0022, if you insist) state. 3) When people complained that the thing they had stated was unstable turned out to be unstable, they did both of the things you wanted: labeled it as unreliable, and then pulled it. \n\nThere is a lot of blame to be thrown around in this mess, but this is at least one situation where it\u0027s just plain silly to try to make it Squad\u0027s fault."},{"CreatedByName":"yafeshan","CreatedById":130191,"CreatedDateTime":"2015-06-25T08:08:15Z","Content":"Guys, be cool.\n\n Just go install linux for KSP and enjoy your time. Why do you even use windows at snail speed if your favorite game has a version for linux at rocket speed. Personally I planned my weekend to manage a new linux installation, just for KSP"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-06-25T08:11:38Z","Content":"\u003E \n\u003E Your words acknowledged it. Your argument ignores it.\n\nOh, I see. The fact that I didn\u0027t give Squad a free pass like you wanted to is a problem. Or would something else have been sufficient?\n\n\u003E \n\u003E It was dragged from them unwillingly, which is hardly the same thing as carelessly \u0022opening the floodgates.\u0022\n\nOh my god. Someone hacked into their servers to release it? Or held their family hostage? Or blackmailed them? I mean, if it was actually dragged from them unwillingly, why didn\u0027t they say so? What made the crisis end?\n\n\u003E \n\u003E Sure is, if the thing in question was, to repeat this as many times as it takes to get the point across, withheld because they knew it wasn\u0027t ready, and only reluctantly released in the face of popular demand.\n\nYou haven\u0027t answered my question:\n\nWhat would cause it to count as broken? What, above and beyond how win64 was, would be necessary for that criteria?\n\n\u003E \n\u003E Because Squad does not owe one segment of their players more than they owe another segment of their players. *Anything* they do is going to please some people and aggravate other people. Mod-makers are not a higher class of people deserving of greater consideration.\n\nI thought the main reason for 64 bit was to make modding easier. Why ignore the portion of your userbase that has the most experience with modding?\n\n\u003E \n\u003E And the players demanding it would have been screaming about it ceaselessly this whole time. And remember, they did not originally release the 64bit anyway. Somebody discovered a way to jury-rig it and make it available despite Squad\u0027s wishes.\n\n\u003E \n\u003E Don\u0027t try to play the oppression card. You were not infracted and nothing was edited from your post.\n\nNoted, but I will also note that when someone talks about things that reflect very badly on Squad, and then a moderator comes down to criticize it and play up Squad as so perfect, on Squad\u0027s forums, and there is no mention that it\u0027s a personal opinion, it gets very difficult to tell whether it is an official moderator notice or not. Especially since it is against the rules to criticize moderator actions, so basically arguing with a moderator is asking for trouble, because your posts are in a superposition of moderator statement / not-moderator statement at all times.\n\nThis is actually a serious problem with the forums. It\u0027s impossible to tell if a moderator is acting as a moderator or a user.\n\n\u003E \n\u003E You want facts? 1) They didn\u0027t release it because they knew it wasn\u0027t ready.\n\n...which was a good thing...\n\n\u003E \n\u003E 2) Somebody forced their hand by making a hacked version available, at which point they saw little harm in acceding to popular demand and making the official one available, despite its unfinished (or \u0022broken\u0022, if you insist) state.\n\nI fail to see how any of this forced their hand. I fail to see how them not thinking about the consequences of letting a (let\u0027s go with your words) completely unfinished (to the point of nearly being unplayable) version be released would not have negative consequences. I can\u0027t see how this isn\u0027t some form of negligence on their fault.\n\n\u003E \n\u003E 3) When people complained that the thing they had stated was unstable turned out to be unstable, they did both of the things you wanted: labeled it as unreliable, and then pulled it.\n\nLabelled it as unstable only after, what, 3 months of (implicitly) claiming that it was stable? And then pulling the build after over a year of hell with it? \n\n\u003E \n\u003E There is a lot of blame to be thrown around in this mess, but this is at least one situation where it\u0027s just plain silly to try to make it Squad\u0027s fault.\n\nThere\u0027s a lot of blame, but not for the ones that decided to make everything worse by releasing something that was clearly \u0022unfinished\u0022\\* when \u0022they knew it wasn\u0027t ready.\u0022 Got it.\n\n\\*Thinking about it, I like this. It\u0027s a great euphemism, and fits KSP\u0027s development pretty well too. Thanks!"},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-06-25T08:24:48Z","Content":"I think your both right, yes it was an experiment that was possibly flawed. Yes they listened to users requests. The contradiction comes from who the users were. Essentially alpha testers. The game was in alpha. Only someone who completely ignored that fact would think they had a right to complain about a broken early release alpha.\n\nThis is a problem with all early release games. At least squad was listening at that point unlike many developers."},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2015-06-25T11:21:26Z","Content":"\u003E \n\u003E Noted, but I will also note that when someone talks about things that reflect very badly on Squad, and then a moderator comes down to criticize it and play up Squad as so perfect, on Squad\u0027s forums, and there is no mention that it\u0027s a personal opinion, it gets very difficult to tell whether it is an official moderator notice or not. Especially since it is against the rules to criticize moderator actions, so basically arguing with a moderator is asking for trouble, because your posts are in a superposition of moderator statement / not-moderator statement at all times.\n\u003E ---8\u003C---\n\nThis I too have noticed. Anything pointing the finger even vaguely in Squads direction is pretty quickly pounced on and there\u0027s no way to tell whether it\u0027s \u0022Squad can do no wrong\u0022 personal opinion or something more official... Very proactive with the glowing praise and sidelining of bugs, not so much with the divulging of actual information as to what went wrong or why certain decisions were made.\n\nIf that\u0027s a personal stance, cool. If not... I\u0027m discussing forbidden topics.\n\nFrom a players perspective, modders are indeed a \u0022special breed\u0022 worthy of more consideration, simply because they provide what the community wants and Squad has not (yet) provided.\n\nI would have stopped playing some time ago were it not for people like Ferram filling the gaps in the stock game.\n\n**Edited \u003Ctime datetime=\u00222015-06-25T11:27:31Z\u0022 title=\u002206/25/2015 11:27  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 25, 2015\u003C/time\u003E by steve\\_v**"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2015-06-25T11:36:19Z","Content":"As far as I understand it, the job of forum moderators is to moderate the forums. I assume that anything they post that is not obviously related to the running of the forum is personal opinion and I would have no qualms about publicly arguing with them about it. They do not have the authority to make official announcements on Squad\u0027s behalf unless they also happen to be Squad employees. Your assumption that they even have the information that you want them to divulge is by no means guaranteed let alone that they would be given permission to post it publicly."},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-06-25T12:40:11Z","Content":"Without wanting to get drawn into the existing arguments (and hopefully not starting a new one), I feel there is another good reason to leave 64bit alone right now; The problem is how KSP utilises memory, but 64bit is only a bandaid on that problem, not the actual cure. The cure is to address at the core game level how KSP uses memory, it still loads every single asset into memory at the start, regardless of whether that asset is actually required. In recent updates that problem has been reduced by using more efficient textures, but the game still packs every single part (and it\u0027s textures) into memory at the start and they remain in memory, regardless of whether they are going to be used. The recent improvement to textures applies to the core game, but many mods are still inefficient with their use of textures so they quickly fill up the available ram. \n\nIf Squad focuses on 64bit then they could take that as a cop-out for optimizing memory usage and modders will have no reason to optimize their mods and before you know it your 64 bit install will be using all of your available physical memory. The problem just gets delayed and it penalizes those who can\u0027t afford to just go out and buy a shed-load more ram. \n\nThe focus needs to be on optimizing KSP\u0027s memory usage, not trying to get 64bit working (that should come later)."},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-06-25T12:46:49Z","Content":"\u003E \n\u003E Just ask the really bleedingly obvious questions early, like: \u0022We are making a sandbox physics sim, with a huge gameworld, can we do this in a reasonable fashion with a game engine that has an already outdated, single threaded physics implementation?\u0022 \n\u003E Or: \u0022We envisage our universe to be \u003Cthis\u003E big, can we do the math and fit the textures into ram on a 32bit platform? maybe we could load textures on demand, does the engine support that?\u0022\u003C/this\u003E\n\u003E \n\u003E Squad has been fighting the limitations of Unity since day dot. The time to switch has been and gone, but it\u0027s certainly not an unforeseeable situation we\u0027re in now.\n\nWell, what other choices were there when Harvester was starting out? A custom engine seems out of the question for a single guy with little or no game development experience doing this as a personal project on company time. Unreal Engine, so often suggested as what KSP should use, was at the time very expensive and from what I\u0027ve looked into I think it\u0027s even *less* suited towards KSP than Unity. Similar cost issues applied to most commercial engines back in 2011, while Free engines are often weak on documentation, a big deal for a novice developer. SpaceEngine wasn\u0027t being licensed and still isn\u0027t and I\u0027m not sure if it even has a physics model to speak of.\nA discussion on making a game like KSP in Unreal Engine: [https://forums.unrealengine.com/showthread.php?29261-how-to-create-planet-size-world](https://forums.unrealengine.com/showthread.php?29261-how-to-create-planet-size-world) . It sounds like making KSP in UE would be extremely difficult if not impossible."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-25T12:55:14Z","Content":"\u003E \n\u003E As far as I understand it, the job of forum moderators is to moderate the forums. I assume that anything they post that is not obviously related to the running of the forum is personal opinion and I would have no qualms about publicly arguing with them about it. They do not have the authority to make official announcements on Squad\u0027s behalf unless they also happen to be Squad employees. Your assumption that they even have the information that you want them to divulge is by no means guaranteed let alone that they would be given permission to post it publicly.\n\n^^This. Our job is not to keep the forums as \u0022pro-Squad\u0022 as possible or suppress criticism, only to keep the discussions civil and within our Community Rules. We are not spokespeople for Squad at all, and we all have our various opinions about the state of KSP and its development. Unlike some forums where I\u0027ve been a member, the moderators are not standoffish here and actively participate in a many of the discussions and the opinions expressed should be seen as those of the member rather than the moderation team or Squad. The only posts that should be read in the context of \u0022from a moderator\u0022 are those that are actually trying to keep a thread civil or polite; if it is just discussion about some topic (Squad or otherwise) then it is just that, discussion. We certainly would not use moderator privileges to win an argument or suppress an opinion, and everyone should feel free to discuss, criticize or debate non-moderation posts from moderators.\n\nAnyway, let\u0027s return to the topic at hand."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-06-25T18:05:05Z","Content":"Ferram4, I have answered all of your other points already, so I\u0027m not going to go through it all again. Go right ahead blaming Squad for the 64bit mess, and the Lindbergh kidnapping, and whatever else. \n\n\u003E \n\u003E Noted, but I will also note that when someone talks about things that reflect very badly on Squad, and then a moderator comes down to criticize it and play up Squad as so perfect, on Squad\u0027s forums, and there is no mention that it\u0027s a personal opinion, it gets very difficult to tell whether it is an official moderator notice or not.\n\nIt\u0027s really not unclear. \u0022Don\u0027t do that because it\u0027s against the rules\u0022 is a moderation statement. \u0022You\u0027re mistaken and here\u0027s why... \u0022 is an opinion."},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2015-06-25T18:09:06Z","Content":"With ferram\u0027s argument, i think it just shows how \u0027fresh\u0027 the dev team is, in retrospect it was a terrible decision to release it, but a lot was learnt."},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-25T18:24:14Z","Content":"\u003E \n\u003E With ferram\u0027s argument, i think it just shows how \u0027fresh\u0027 the dev team is, in retrospect it was a terrible decision to release it, but a lot was learnt.\n\nThis, right here. The release of the actual Win x64 client is why we have discussions like this instead of posts asking where a Win x64 client is."},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2015-06-25T19:47:53Z","Content":"\u003E \n\u003E Ferram4, I have answered all of your other points already, so I\u0027m not going to go through it all again. Go right ahead blaming Squad for the 64bit mess, and the Lindbergh kidnapping, and whatever else.\n\nYou never answered what would count as broken. Why not?\n\n\u003E \n\u003E It\u0027s really not unclear. \u0022Don\u0027t do that because it\u0027s against the rules\u0022 is a moderation statement. \u0022You\u0027re mistaken and here\u0027s why... \u0022 is an opinion.\n\nExcept that hasn\u0027t always been the case. There was that Realism In KSP thread awhile back that got locked on the basis of going against a moderator (or something near to it, from when I talked to Rows about it) because Sal said something rather silly about physics in KSP, and Ippo made a snarky comment about trying that on his next physics exam. Because it was criticizing Squad after Ted and a ton of the moderators came in to defend them near the end of the thread it was locked.\n\nTo be honest, unless you guys explicitly state when it\u0027s a moderator action in your posts and when it\u0027s not, you\u0027re bringing the power you have as moderators to the front to win the argument, especially when you bat for Squad in the way that steve\\_v mentioned. We know how this works, we\u0027re not stupid. We know that you\u0027re only human, not perfect god-creatures, and that that means that you\u0027ll be tempted to reach for that moderator panel if you think it\u0027ll help."},{"CreatedByName":"almagnus1","CreatedById":78068,"CreatedDateTime":"2015-06-25T20:38:13Z","Content":"Wasn\u0027t KSP x64 insanely unstable due to the Unity version they were using at the time?\n\nI might be misremembering that, though \u003E.\u003E"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-06-25T20:53:31Z","Content":"\u003E \n\u003E Without wanting to get drawn into the existing arguments (and hopefully not starting a new one), I feel there is another good reason to leave 64bit alone right now; The problem is how KSP utilises memory, but 64bit is only a bandaid on that problem, not the actual cure. The cure is to address at the core game level how KSP uses memory, it still loads every single asset into memory at the start, regardless of whether that asset is actually required.\n\nThat\u0027s actually a relatively minor problem compared to the unexplained memory leaks and the fact that DX9 KSP is somehow using *almost twice* the memory of OpenGL/DX11 KSPs (my personal theory on that is the DX9 code somehow has two copies of each texture in memory, seeing as that\u0027s the majority of KSP\u0027s memory use..).\n\nI do agree though that using x86-64/amd64 as a band-aid would definitely be a cop-out, regardless of where the memory is getting eaten heh."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-25T21:08:41Z","Content":"Renegade, your personal theory is in fact totally correct. Unity 4.x has a known bug where D3D9 on PC (and, sadly, the OSX/OpenGL version too) keep a shadow copy of all textures in system RAM even after they\u0027ve been uploaded to VRAM, even if you explicitly tell Unity not to (as KSP does).\n\nThe Windows OpenGL client does not have that bug. That\u0027s why you get ram savings, and why adding more parts barely increases ram footprint."},{"CreatedByName":"KAO","CreatedById":30795,"CreatedDateTime":"2015-06-25T21:13:12Z","Content":"I am highly unfamiliar with the new upgrades Unity 5 will be introducing, will it fix the RAM shadow copy problem with DX9? \n\nAlso, I remember there was a mod in the add-on development forum that loaded textures on demand, though I don\u0027t remember if it had a great impact on the reduction of RAM usage, or a minor one. But since it was a working concept, it is a possible mechanic that Squad can implement. Though since Squads own assets don\u0027t overload RAM, I don\u0027t think they\u0027ll pursue it in the near future.\n\nAs it stands, despite DX11\u0027s and OpenGL\u0027s RAM usage reducing capability, they have a slew of their own problems that make them difficult to use with installs."},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-06-25T21:34:28Z","Content":"\u003E Also, I remember there was a mod in the add-on development forum that loaded textures on demand, though I don\u0027t remember if it had a great impact on the reduction of RAM usage, or a minor one.\n\nI used Load On Demand extensively in 0.23 and 0.23.5. I\u0027d get RAM related crashes every now and then, but after it added texture compression it was never an issue. The absolute best part of it was the lightning fast load times, which is the main reason I used it. Even the new DDS textures on a Stock game don\u0027t compare against a highly modded 0.23.5 game with LoD. I really wish Squad would come up with a better way of handling texture loading. I\u0027d like to see that long before a Win 64 version, as I see the 64 bit version as just a temporary fix to the real problem. There\u0027s no reason we should HAVE to use more than 4 gigs of RAM when we\u0027re only using 1 gig of textures at once. Once 64 bit comes out and people start getting crashes from hitting their system limits of 8 gigs, or even 16 gigs... then we\u0027ll just be having this discussion again of \u0022My game crashes when running a bajillion mods!\u0022. Plus, the complaints about load times."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-06-25T21:59:52Z","Content":"\u003E \n\u003E Renegade, your personal theory is in fact totally correct. Unity 4.x has a known bug where D3D9 on PC (and, sadly, the OSX/OpenGL version too) keep a shadow copy of all textures in system RAM even after they\u0027ve been uploaded to VRAM, even if you explicitly tell Unity not to (as KSP does).\n\u003E The Windows OpenGL client does not have that bug. That\u0027s why you get ram savings, and why adding more parts barely increases ram footprint.\n\nMakes sense - I knew it had to be something like that when forcing OpenGL rendering made me go from 2.1g to 1.2g... heh. There\u0027s little else that could take up that much memory ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-06-25T22:12:06Z","Content":"\u003E \n\u003E -snip-\n\nYou misunderstand how the moderation team works. There is *no such thing* as a moderator using moderator action to reinforce his own views over those of a non-moderator. If he did, he would be off the team.\n\nIf someone expressed their views in a fashion that broke the rules (and happened to disagree with a mod\u0027s opinion), of course that post would be appropriately dealt with."},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2015-06-25T22:17:27Z","Content":"\u003E \n\u003E Renegade, your personal theory is in fact totally correct. Unity 4.x has a known bug where D3D9 on PC (and, sadly, the OSX/OpenGL version too) keep a shadow copy of all textures in system RAM even after they\u0027ve been uploaded to VRAM, even if you explicitly tell Unity not to (as KSP does).\n\nAhh, I thought something like this was going on. I take it this is related to (or the the root cause of) the mystery malloc failures on OSX, even when KSP itself is well within the address space limit?"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-06-25T22:22:34Z","Content":"\u003E \n\u003E That\u0027s actually a relatively minor problem compared to the unexplained memory leaks and the fact that DX9 KSP is somehow using *almost twice* the memory of OpenGL/DX11 KSPs (my personal theory on that is the DX9 code somehow has two copies of each texture in memory, seeing as that\u0027s the majority of KSP\u0027s memory use..).\n\u003E I do agree though that using x86-64/amd64 as a band-aid would definitely be a cop-out, regardless of where the memory is getting eaten heh.\n\nah, yeah, I had meant to mention some of the other memory issues in that post. And as well as the ones you mention there are other performance related issues (that goram stutter problem, to name one) that need to be addressed before looking to x64. \n\n\u003E \n\u003E \\* snip There\u0027s no reason we should HAVE to use more than 4 gigs of RAM when we\u0027re only using 1 gig of textures at once. Once 64 bit comes out and people start getting crashes from hitting their system limits of 8 gigs, or even 16 gigs... then we\u0027ll just be having this discussion again of \u0022My game crashes when running a bajillion mods!\u0022. Plus, the complaints about load times.\n\nExactly."},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-06-26T00:45:30Z","Content":"I must say that after reading a few of these threads, there are some voices who seem to post in all of them who really are not doing themselves any favours, however strongly they feel about the topic...."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-26T01:54:00Z","Content":"In my experience OSX\u0027s limit for KSP is in *practice* \u003C3GB, even though in theory it\u0027s supposed to be a full 4GB (unlike KSP-win32 where in theory and in practice it\u0027s ~3.4 GB). You combine a ~2900MB limit with the texture issue, and yeah, you can hit that stock."},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-06-26T02:36:06Z","Content":"\u003E \n\u003E In my experience OSX\u0027s limit for KSP is in *practice* \u003C3GB, even though in theory it\u0027s supposed to be a full 4GB (unlike KSP-win32 where in theory and in practice it\u0027s ~3.4 GB). You combine a ~2900MB limit with the texture issue, and yeah, you can hit that stock.\n\nI have not had these issues, though I run the osx game at minimum. Maybe it is related to what gpu the apple has. My Intel while not very powerful chugs along fine with no issues. Latest OSX."}]}