{"TopicId":11481,"ForumId":32,"TopicTitle":"Persistance","CreatedByName":"funfight22","CreatedById":22861,"CreatedDateTime":"2012-05-27T04:30:52Z","PageNum":1,"Articles":[{"CreatedByName":"funfight22","CreatedById":22861,"CreatedDateTime":"2012-05-27T04:30:52Z","Content":"\n\u003Cp\u003EIf I land my ship back on kerbin, will it disappear or will I have 30 ships sitting in one area from old satellite launches?\u003C/p\u003E\u003Cp\u003EThe satellites are for the comm network addon that I can not remember the name of at all.\u003C/p\u003E\n"},{"CreatedByName":"VincentMcConnell","CreatedById":14492,"CreatedDateTime":"2012-05-27T04:37:57Z","Content":"\n\u003Cp\u003EEVERYTHING will remain until you end flight or clear your persistence files.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-05-27T07:38:00Z","Content":"\n\u003Cp\u003EAlso, take note that all debris (including satellites, at this point) will remain even after you end flight until it is destroyed by something or you switch to it and end flight on it.\u003C/p\u003E\n"},{"CreatedByName":"Polkavenger","CreatedById":9803,"CreatedDateTime":"2012-05-27T13:55:07Z","Content":"\n\u003Cp\u003EDo the pieces of debris still experience all the forces, even when you\\\u0027re not \u0027following\u0027 those parts? I have a bunch of discarded fuel tank \u002B engine stacks in orbit, with a periapsis of about 66-67 km, so they pass through the atmosphere. If I\\\u0027m doing other missions elsewhere, will those orbits decay as they should or do they run on \u0027reduced physics\u0027?\u003C/p\u003E\n"},{"CreatedByName":"G Addict","CreatedById":2730,"CreatedDateTime":"2012-05-27T14:07:48Z","Content":"\n\u003Cp\u003EI\\\u0027ve got orbiting debris that passes low through the atmosphere with no change in its path, so I don\\\u0027t think the forces on them are considered at all. Very annoying when I don\\\u0027t want to look at all these useless orbit paths.\u003C/p\u003E\n"},{"CreatedByName":"ForumHelper","CreatedById":8635,"CreatedDateTime":"2012-05-27T15:06:57Z","Content":"\n\u003Cp\u003EThat\\\u0027s because they are on-rails. What you can do, however, is open your save file in notepad and manually remove unwanted debris. This or do it the kerbal way - launch another rocket and collide with your debris you want to go away.\u003C/p\u003E\n"},{"CreatedByName":"Foamy","CreatedById":608,"CreatedDateTime":"2012-05-27T15:28:06Z","Content":"\n\u003Cp\u003EI believe that will change soon enough though as Harvester was talking about reentry estimation for rails orbits, although i am not sure if it will be part of the next update.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-05-27T15:37:48Z","Content":"\n\u003Cp\u003EAnything unfocused that goes below 24km altitude will suddenly vanish without a trace. If the periapsis is higher than that, you\\\u0027ll have to get rid of it manually somehow.\u003C/p\u003E\u003Cp\u003EThe quick way is to open the persistent.sfs file and delete any vessel with _debris in the name. The fun way is to rendezvous, and use the laser mod to blow it out of the sky.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2012-05-27T15:58:47Z","Content":"\n\u003Cp\u003EYou can also double-click on debris from the map view (while in flight, not in the tracking station) and \u0027end flight\u0027 on debris manually. Can take a bit of work.\u003C/p\u003E\n"},{"CreatedByName":"Chrischn89","CreatedById":24486,"CreatedDateTime":"2012-05-29T18:51:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou can also double-click on debris from the map view (while in flight, not in the tracking station) and \u0027end flight\u0027 on debris manually. Can take a bit of work.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoesn\\\u0027t seem to work for me?\u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-05-29T19:54:32Z","Content":"\n\u003Cp\u003EUse the [ and ] keys to cycle through objects in flight, and end the flights of the debris\u003C/p\u003E\n"}]}