{"TopicId":115243,"ForumId":32,"TopicTitle":"MechJeb vs non MechJeb","CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-06T23:14:56Z","PageNum":10,"Articles":[{"CreatedByName":"Antares_Insomnious","CreatedById":147253,"CreatedDateTime":"2015-07-10T10:00:19Z","Content":"Well, if you think about it. All rockets are computerized in some way, even manned flights. They aren\u0027t always controlled by a person. So Mechjeb isn\u0027t cheating, it\u0027s actually quite realistic. The same with Kerbal Engineer. \n\nI use both but only for certain things, I mainly use Mechjebs automated system if I have a 3 hour flight and I have the maneuver node set up the way I want it and I have to leave the computer for some reason.\n\nbut then again, I use a lot of plugins and part addons. I think about 40 to 50 all together not including the minor ones added by certain addons.\n\nI actually think a lot of these mods make the game more realistic in a small green alien type of way.\n\nBut I actually haven\u0027t seen a single mod that I would consider cheating though."},{"CreatedByName":"Zeo","CreatedById":147045,"CreatedDateTime":"2015-07-10T12:30:37Z","Content":"\u003E \n\u003E You could make the same arguments about any video game - it\u0027s not realistic / it\u0027s too simple / it\u0027s too complex / it doesn\u0027t smell right. \n\u003E Stop comparing the gameplay balance to actual NASA operations. \n\u003E \n\u003E  *As a video game* , KSP is pretty well-balanced in difficulty without adding \u0027autopilot\u0027 features. It\u0027s much more rewarding to achieve a difficult task, like building and flying an SSTO, without assistance, trust me. You get more out of the game, and the devs don\u0027t feel the need to dumb it down to \u0022press button for space station\u0022 to attract more casuals. That\u0027s the real issue here, and the only reason that anyone should care how you play. \n\u003E \n\u003E Every time you post about how bored you are with \u0027repetitive\u0027 trips to Eeloo, without mentioning that the game just moved your ship there while you had coffee, that\u0027s another vote for more Stupid to be introduced, and less challenge. A game without challenge is just a crummy movie about nothing.\n\nAs a video game, KSP is definitely designed for casuals. The game is, on purpose, kept so shallow and simple that even 10y old kids can easily play and have fun in it. KSP is not a hardcore space simulator. Stock also already has autopilot features; SAS, aka space unicorns inside your ship farting and providing torque. There is no challenge whatsoever in flying manually in KSP. In stock, there is hardly any challenge in designing ships either, just add more boosters, struts and space unicorns. \u0022I\u0027m a hardcore gamer, I play KSP.\u0022 said noone ever, all aspects of the game are extremely dumbed down by default."},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-07-10T13:37:28Z","Content":"\u003E \n\u003E I love to try program in optimal launches with the ascent guidance and then watch my rockets launch. I spend hours tinkering with it sometimes. It\u0027s fun to me. That said, I plan all my maneuvers with the stock tools.\n\nYeah, this to me. Launching is thrilling when you\u0027re new to the game, designing a new launcher, or something like that, but after some time it\u0027s just kind of boring.\n\nBesides, fiddling around and finding the perfect setting for that particular ship is *not* trivial, even tho it isn\u0027t the same kind of challenge as learning to launch in the first place.\n\n\u003E \n\u003E ftfy, no need to thank me.\n\nHa. Wish I could rep you twice, now.\n\n\u003E \n\u003E The only valid Eve return is the Venus return. Otherwise you\u0027re not really doing anything special.\n\nMake that three times? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\n\u003E \n\u003E I think that Mechjeb should be stock! It\u0027s probably more \u0027realistic\u0027 to use it, at least in the *simulation* aspect of the game. I\u0027m not a NASA pilot, but I would imagine that NASA would love to have a MechJeb system on all of their equipment!\n\nThat\u0027s also what I think. I don\u0027t use most of its features, but I see it that way, too."},{"CreatedByName":"micr0wave","CreatedById":136352,"CreatedDateTime":"2015-07-10T14:06:59Z","Content":"\u003E \n\u003E (...) Some people just make stuff in VAB and then HyperEdit it above Laythe and make nice screenshots. That\u0027s not cheating because they\u0027re using the game for a different purpose. (...)\n\u003E Mechjeb does not control coasting. It controls adjustments, and that robs you of fun and learning. There\u0027s tons of things one could learn about orbital mechanics in an awesome way if one fiddles with maneuver nodes. Not to mention when it comes to landing. So much fun is taken away if you just \u0022press key to adjust\u0022 or \u0022press key to land there\u0022. For me, that\u0027s not *playing* KSP. That\u0027s *witnessing the simulation doing its thing*.\n\nOh ... so, making a vessel and pressing a button to teleport it is ok, but using MJ to assist (in opposite to instant-hyperedit) is not ?\n\nReally too bad, that once MJ is installed there\u0027s no way to play without using MJ.\n\nWhen fiddling around with maneuver nodes to minmus for the 100th time is fun for you, great, go ahead, but don\u0027t try to disgrace other people who don\u0027t share your definition of fun.\n\nYou should also consider that a lot of people have learned by using mechjeb and probably would have ditched the game if they didn\u0027t have that option.\n\nI would also vote that all people who yell \u0022REALISM !!!!1111oneone\u0022 should have the timewarp button removed, if you pretend to walk, walk the whole way."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-07-10T14:21:16Z","Content":"In 0.9, I used MJ for all rocket flights to LKO. But with the new 1.0 aero, it\u0027s more fun to fly them manually (and more efficient). \n\nI use MJ for executing manoeuver nodes, especially when I make a multi fight mission (like my 13 parts mission to be assembled around Laythe)\n\nI use a lot the Node Editor to get precise tweaking of node. I hate the stock node control.\n\nI also use the landing guidance as I use many recoverable SSTO rockets. I use it on my mission only for safety net, in case I mess my landings on the final few meters.\n\nI use MJ for rendez-vous because I find this maneuver tedious. But I love the docking procedure which I do with a joystick (the only time I use a joystick on KSP)\n\nI usually don\u0027t use MJ for interplanetary because it\u0027s quite fun to find encounter myself.\n\nAs for data display, MJ has some data on drag that KER doesn\u0027t have."},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2015-07-10T14:37:11Z","Content":"I use both."},{"CreatedByName":"flyboy67109","CreatedById":98767,"CreatedDateTime":"2015-07-10T14:40:44Z","Content":"\u003E \n\u003E I use Kerbal Engineer.\n\u003E I do not think MechJeb is cheating.\n\nI\u0027ve said this in another thread and I\u0027ll say the same thing here. I\u0027m a private pilot in the real world. I rent different types of aircraft depending on how I want to fly. When I want to \u0022punch holes in the sky\u0022 I\u0027ll rent a Cessna 152 with simple instrumentation. No autopilot and no gps. When I take a cross country flight, however, I\u0027ll choose a more complex aircraft that does have an autopilot and gps. There is a huge misconception among people that don\u0027t fly that the autopilot flies the airplane. for me. It flies the airplane just like cruise control drive your car for you; it doesn\u0027t. When I fly cross country, there is a LOT more going on and autopilot helps keep control of the attitude of the airplane while I talk to Air Traffic Control and get instructions. GPS helps me keep track of my true heading (I have to turn the airplane slightly into the wind to go the direction I really want to go ) and my ground speed (The wind is pushing me back a little and even though the indicator says I\u0027m going a certain speed, I\u0027m not really ). IMHO, MechJeb is no different. It helps me keep track of my dv and helps me keep my heading while I\u0027m busy doing other things. I don\u0027t think it\u0027s cheating any more then using cruise control in your car or autopilot in a plane is cheating."},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2015-07-10T14:50:06Z","Content":"I MechJeb. \n\nThough I sometimes do something by hand for fun, usually I just MechJeb through transfers. Also, I\u0027m terrible at docking, so I leave this to my more precise metal friend too."},{"CreatedByName":"Pixel Kola","CreatedById":147216,"CreatedDateTime":"2015-07-10T20:31:46Z","Content":"Using MechJeb is not cheating. To use MechJeb properly you have to understand the basic mechanics. Not wanting to manually circularize for the 1,000th time is ok... You think that when the shuttle was launched that the pilot ever touched a control? The only time the computer didn\u0027t handle a shuttle mission was the last few minutes before landing... and even then i would bet that the shuttle was fully capable of handling that with a computer if it was necessary.\n\nSometimes it is fun to manually control your craft and others it\u0027s just tedium. MechJeb is a great solution to solving the tedium problem and allows you to achieve your goals in a more efficient time frame allowing you to move on to bigger and better ones.\n\nYou still have to plan you missions, know how the mechanics work and oversee them."},{"CreatedByName":"irichey25","CreatedById":66851,"CreatedDateTime":"2015-07-14T01:53:35Z","Content":"Gotta agree with Pixel. It\u0027s also the simple fact that going into orbit for the 300\u002B plus time with the new aerodynamic system is very tedious, and it\u0027s much more enjoyable to watch it be done than do it my self again, and again, and again."},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-07-14T02:58:04Z","Content":"I\u0027ve been trying but so far the latest Mechjeb is the only one able to suicide burn my Tylo lander. I\u0027m trying to copy it but the margins are really tight, a few seconds difference hovering can use all the fuel."},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2015-07-14T08:56:00Z","Content":"\u003E \n\u003E As a video game, KSP is definitely designed for casuals. The game is, on purpose, kept so shallow and simple that even 10y old kids can easily play and have fun in it. KSP is not a hardcore space simulator. Stock also already has autopilot features; SAS, aka space unicorns inside your ship farting and providing torque. There is no challenge whatsoever in flying manually in KSP. In stock, there is hardly any challenge in designing ships either, just add more boosters, struts and space unicorns. \u0022I\u0027m a hardcore gamer, I play KSP.\u0022 said noone ever, all aspects of the game are extremely dumbed down by default.\n\nI\u0027d say KSP is a pretty difficult game. Of course it gets easy if one uses the walkthrough (dV maps from the Wiki/Forum, data readout mods, transfer window planners,...) or autopilot mods, but if one wants the full KSP experience, one should imho calculate this stuff by hand instead of looking it up.\n\nSo, yes, I\u0027m a hardcore gamer, as I play KSP (and Dwarf Fortress). I\u0027m also playing a lot of other games (including several AAA titles), but none of them make me think of myself as a hardcore gamer (despite the several hundreds of hours spent playing Skyrim for instance...), as they very seldom pose an as big challenge as the calculations required for KSP do.\n\nRegarding the \u0022dumbing down\u0022 of the game, I think it\u0027s justified. The developers want to focus on things they consider fun, and therefore simplify things they consider tedious. After playing Realism Overhaul for some time, I must say, that stock missions feel more dynamic than RO-missions, simply because one doesn\u0027t need to keep as many things in mind while building a craft and therefore doesn\u0027t need to spend as much time in the VAB. Also, in RO it\u0027s already very tough to do a manned return from Mars, and I wouldn\u0027t even think about manned return missions to Venus, Mercury or the satellites of the gas giants... The Kerbolar system on the other hand is small enough to allow return missions to every rocky planet or satellite, what in my opinion contributes a lot to the game experience. \n\nThe only thing about the simplifications: What the developers consider fun/tedious isn\u0027t necessary the same as what players consider fun/tedious. But for that there are mods. ;-)"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-07-14T10:57:41Z","Content":"\u003E \n\u003E if one wants the full KSP experience, one should imho calculate this stuff by hand instead of looking it up.\n\nI suspect Squad realizes that would severely restrict the target audience for this game and/or severely dissapoint many customers (who were afer all not warned that this game involves a lot of manual calculation). And just how manual should it be? No spreadsheet? No calculator? And once you do use spreadsheet or calculator, how big a difference is there with having a specialized calculator in the game, other than that being a lot more convenient? \n\nOnce the game is finished (don\u0027t let the \u00221.0\u0022 desigation fool you) we\u0027ll see whether or not Squad intents the full KSP experience to involve manual calculations of delta-V and such."},{"CreatedByName":"kreutzkevic","CreatedById":146514,"CreatedDateTime":"2015-07-14T12:02:12Z","Content":"I used MJ back in 0.23. I recall I mostly used the \u0022circularize orbit at Ap\u0022 and \u0022Execute next node\u0022 (after I had planned the manouever myself) because I\u0027m lazy like that.\n\nOh yes, and I used the \u0022Ascent guidance\u0022 after launching umptheen refueling missions to my station because of tedium.\n\nAnd I used the \u0022Rover Auto-pilot\u0022 once to get from one side of the Mun\u0027s polar crater to the other. Kudos if you\u0027ve got the patience to make that trip by hand. Even then it took some planning in placing the waypoint markers.\n\nI use KER for data readouts. Easier on the eyes.\n\nNever used it after that. Will never begrudge players for using it. Or not using it for that matter.\n\nIt\u0027s \\*your\\* game. You can darn well do whatever you like with it. So long as you have fun."},{"CreatedByName":"Korizan","CreatedById":142032,"CreatedDateTime":"2015-07-14T13:11:55Z","Content":"Mechjeb vs non Mechjeb, which according to most of the replies in this thread is about using an autopilot or not using an autopilot.\n\nIf that is all mechjeb was then it could be a single window with a few options.\n\nInstead mechjeb is a tool set and how much or little of the set you use is up to you.\n\nHere is just 2 examples (to keep this thing from being a book) of the tools that mechjeb can provide and neither one involves using the autopilot function.\n\nKSp gives you zero ability to map or plan your ascent from Kerban. \n\nIt is all by the seat of your pants and worse yet there is no way to review your ascent to see if the last 2 flights used the same or different profile.\n\nTool 1 Ascent Guidance - With this tool you can go into Ascent path guidance and tweak your ascent path to your hearts content and get a visual representation of that path, then you can select Show navball ascent path guidance which paints a nice little target on your navball for you to follow up to your planned AP. \n\nAs someone who has played Orbiter and used transx I can say I love KSP\u0027s GUI for maneuvers but it is not as precise as it needs to be (Mouse is good but it can be a real pain for tiny adjustments).\n\nTool 2 Maneuver Node editor - This tool gives you the ability to modify an existing maneuver node by adjusting the Pro grade, Radial and Normal vectors in steps ranging from .001 to 10 \n\nTO some extent mechjeb is no different then Kerbal Alarm Clock or Docking Port Alignment indicator both of which I use for there own reason\n\n**Edited \u003Ctime datetime=\u00222015-07-14T13:14:50Z\u0022 title=\u002207/14/2015 01:14  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 14, 2015\u003C/time\u003E by Korizan**"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2015-07-14T18:10:41Z","Content":"\u003E \n\u003E I\u0027ve been trying but so far the latest Mechjeb is the only one able to suicide burn my Tylo lander. I\u0027m trying to copy it but the margins are really tight, a few seconds difference hovering can use all the fuel.\n\nNot to get off topic, but you can probably save some delta-v and not have to worry about precise timing (unless you want to land somewhere very specific) by using the constant-altitude landing method. The savings over a mainly-vertical suicide burn on Tylo are going to be significant. If you\u0027re talking about a hybrid (constant-altitude just above the peak terrain until you\u0027re on a soon-to-impact trajectory then a suicide burn to finish the landing) then ignore me."},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2015-07-14T18:19:43Z","Content":"Ok lets take it to an extreme. Lets pretend Mechjeb PRO comes out. When you start up the mod you get a pop up window that asks you what you want to do. I pick the complete Jool challenge option and select all science experiments from all biones option. And because I am in a hurry and have plenty of funds I select the holman transfer(no sling shots) option. Mech jeb pro then calculates the optimal launch window, calculates all required dV, builds a ship with the required dV, takes off at the perfect time on auto pilot, lands on all the planets/moons and collects all the science. Then it flys back and gives you your nice pretty science. \n\nPersonally I had no fun here. However that being said after you have done 100 circulations it does get quite trivial. After 1000 docks it is quite trivial even without RCS or target tracking. After 10 transfers to the Mun/Minimus they are now so trivial I no longer need patched conics or maneuver nodes and can simply eyeball them. I have yet to go to Duna but I am sure after 10 missions or so I will be able to eyeball them as well. I personally think Mech Jeb should be part of Stock but features should unlock higher in the science tree i.e. transfer window planning should be 2000 science level. This is the same reason I dont use kerbal alarms transfer window planner because I have not learned it yet and it is not trivial yet however I know I am on a lower orbit and it will take 5-6 orbits to catch up with a target I have no problem using find closest intersection alarm because stock only shows 2 intersections and I am too lazy to get out a spread sheet and to the math for orbit periods."},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-07-14T18:36:55Z","Content":"\u003E \n\u003E Ok lets take it to an extreme. Lets pretend Mechjeb PRO comes out. When you start up the mod you get a pop up window that asks you what you want to do. I pick the complete Jool challenge option and select all science experiments from all biones option. And because I am in a hurry and have plenty of funds I select the holman transfer(no sling shots) option. Mech jeb pro then calculates the optimal launch window, calculates all required dV, builds a ship with the required dV, takes off at the perfect time on auto pilot, lands on all the planets/moons and collects all the science. Then it flys back and gives you your nice pretty science.\n\nI would install such mod immediately. If it can do all that automatically, it can probably do whatever I find boring in the game on any particular day."},{"CreatedByName":"JDCollie","CreatedById":103176,"CreatedDateTime":"2015-07-14T19:44:14Z","Content":"I\u0027ve found that the more I the play the game the less I use Mechjeb\u0027s functionality beyond info readouts. I still use Execute Maneuver Node religiously, mostly because I\u0027m lazy. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-07-14T19:55:53Z","Content":"\u003E \n\u003E And just how manual should it be? No spreadsheet? No calculator? And once you do use spreadsheet or calculator, how big a difference is there with having a specialized calculator in the game, other than that being a lot more convenient?\n\nThanks for pointing that out, it\u0027s something that had always bothered me."},{"CreatedByName":"Tylerd","CreatedById":147949,"CreatedDateTime":"2015-07-14T19:57:40Z","Content":"i dont think its cheating, you have to unlock the tech. It kind of makes sense for spaceships to have some form of autopilot. Also sometimes mechjeb isnt as good as manual. It is kind of cheating if you are 100% dependent on it though. I use mechjeb since it saves time, and ive already done all the basic things without it, like rendevous, landing, getting into orbit etc etc.."},{"CreatedByName":"Tiber9","CreatedById":144299,"CreatedDateTime":"2015-07-14T21:47:46Z","Content":"I think cheating is a subjective term in KSP. What mods one installs is all about the gameplay experience they want to have. It only matters and needs to be specified if there is an attempt at comparison, such as in challenges, where one\u0027s tools are specified or limited. But if one player wants to do the math, while another wants to make the ships and then have Mechjeb fly them, it\u0027s just how they want to spend their free time. \n\nI don\u0027t have Mechjeb on my current save because doing a maneuver for the millionth time by hand still holds my attention better than having Mechjeb do it. But the tools are very powerful and have taught me a lot, and Mechjeb is fantastic for rocket development because you can have a consistent launch profile as you make design changes and test them."},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2015-07-14T23:30:22Z","Content":"Mechjeb is the Antichrist, just saying ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nBut dont forget, everybody is free to do what he wants ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"JLtheGrunger","CreatedById":147928,"CreatedDateTime":"2015-07-14T23:57:12Z","Content":"With mechjeb is way too easy, dude ![:rolleyes:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif)\n\nBtw i never used it, I think it takes away most of the fun, and piloting the spacecraft by yourself is more satisfying. However, I always use Engineer.."},{"CreatedByName":"Data","CreatedById":144475,"CreatedDateTime":"2015-07-15T01:11:02Z","Content":"\u003E \n\u003E snip..... , everybody is free to do what he wants ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nyou got this totally wrong and you\u0027re probably not married..\n\nwhat you should have said is: everybody is free to do what SHE wants.\n\nsorry, couldn\u0027t resist."}]}