{"TopicId":115442,"ForumId":32,"TopicTitle":"Aaaargh!! Remote Control bug is still around..","CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2015-07-09T00:19:46Z","PageNum":1,"Articles":[{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2015-07-09T00:19:46Z","Content":"\n\u003Cp\u003ESo I just spend most of the evening building and flying a rescue mission beyond Mun\u0027s orbit. After a long and difficult rendezvous and grab (With the Klaw), I EVA\u0027d said Kerbal, pressed \u0026lt;space\u0026gt; to let go of the ladder, and.... my main ship staged! Noooo! There goes the engine \u0026amp; fuel for the homeward trip.\u003C/p\u003E\u003Cp\u003ENow I have 3 Kerbals and 2 capsules to recover from deep space. I don\u0027t mind if it happens through my own fault. But when it\u0027s because of (an allegedly squashed) bug I get a bit miffed.\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2015-07-09T01:57:18Z","Content":"\n\u003Cp\u003EUsually a sign that you didn\u0027t do a clean install of an update. Might want to delete your current version, install the latest version with no mods installed, and give that a try with your save.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-07-09T02:03:42Z","Content":"\n\u003Cp\u003EI\u0027ve not encountered this bug in KSP v1.0, but man was it ever annoying in 0.90. I\u0027ve avoided the Klaw ever since. It\u0027s not a bad install, or user error, it\u0027s just the nature of the Klaw.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-07-09T02:15:17Z","Content":"\n\u003Cp\u003EI put my claw inside of MK3 cargo bay, open the door and let the craft float in slightly tap the gas, and it home again, no need to get our of the ship and push stuff around.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-09T06:58:05Z","Content":"\n\u003Cp\u003EI\u0027ve attached the Klaw to a vestigal vehicle with not even a main engine (just RCS) but all the reentry goodies.\u003C/p\u003E\u003Cp\u003EThey land in whatever they were found in, with that small stub covered thickly in airbrakes and parachutes trailing behind them.\u003C/p\u003E\n"},{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2015-07-09T09:56:31Z","Content":"\n\u003Cp\u003EI always do a complete fresh install instead of an update. This is pretty much the first time I\u0027ve used the Klaw - I didn\u0027t know this bug was triggered by it.\u003C/p\u003E\u003Cp\u003EI was EVA\u0027ing the Kerbal to get it into the main pod - as I\u0027m not convinced the Mk2 Lander Can she was stranded in will survive the fires of re-entry. Haven\u0027t unlocked Mk3 parts yet so don\u0027t have cargo bays large enough. Besides, I tend not to play with the spaceplane parts, but it\u0027s a good suggestion, thanks.\u003C/p\u003E\n"}]}