{"TopicId":116787,"ForumId":32,"TopicTitle":"Best Way to Play Without Lag","CreatedByName":"alanbr00","CreatedById":148750,"CreatedDateTime":"2015-07-25T02:05:57Z","PageNum":1,"Articles":[{"CreatedByName":"alanbr00","CreatedById":148750,"CreatedDateTime":"2015-07-25T02:05:57Z","Content":"I\u0027m playing with the lastest ksp 1.0.4 and i having too much lag when i build a rocket larger then 500 parts. Any tips?"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-25T02:35:31Z","Content":"Err, you can get a mod and weld it, or you can shrink it for less lag. The biggest craft I ever built was 611 parts. It was an O\u0027Neill Cylinder."},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2015-07-25T02:44:22Z","Content":"500 Parts? That\u0027s a pretty good sized ship, and will have tons of physics lag on any system. Not really much you can do except deal with it or build smaller ships. Or overclock your CPU."},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-07-25T03:28:34Z","Content":"Get a time machine. Fast Forward some ten years to the future. Buy a brand new computer, return to the present, hope that machine can run the current Windows 10 and run KSP there.\n\nMaybe the unity 5 update will help, but with 500 parts, your best bet is to overclock whatever cpu you have and, even then, it\u0027s likely to lag, at least in the atmosphere."},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-07-25T03:39:44Z","Content":"And here I was feebly hoping someone had either discovered an ingenious solution or had a hilarious joke to tell.\n\nThe above posters are right. 500 parts is a huge rocket and beyond what any normal computer running KSP should be able to handle smoothly. The update to Unity 5 is expected to help to a limited degree, but I would still expect to have trouble with hundreds of parts.\n\nIf you are desperate and have a budget, you could buy a computer with a high core clock speed. KSP currently does not capitalize on multithreading, so multiple cores will do you no good - what matters is the CPU clock, i.e. at how many GHz it runs. Few computers go higher than 4 GHz."},{"CreatedByName":"X-SR71","CreatedById":108775,"CreatedDateTime":"2015-07-25T04:58:39Z","Content":"I feel part of the challenge of the game is not only make efficient ships, but ships with the lowest possible number of parts!"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-07-25T05:04:15Z","Content":"\u003E \n\u003E I\u0027m playing with the lastest ksp 1.0.4 and i having too much lag when i build a rocket larger then 500 parts. Any tips?\n\nYeah, don\u0027t play."},{"CreatedByName":"alanbr00","CreatedById":148750,"CreatedDateTime":"2015-07-25T05:45:53Z","Content":"I have a x8 3.5ghz, will over to 4.0ghz. But yeah i guess looking to this issue as a dificulty is not bad.\n\nThanks for those who helped. \n\nAnd for the rest, try to do some help, the world needs, if you don\u0027t wanna help just die or get out of the way. \n\nMy regards to all."},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-25T09:02:35Z","Content":"I can\u0027t read - I was seeing \u0022plant without flag\u0022"},{"CreatedByName":"Agost","CreatedById":126710,"CreatedDateTime":"2015-07-25T09:43:44Z","Content":"\u003E \n\u003E I have a x8 3.5ghz, will over to 4.0ghz. But yeah i guess looking to this issue as a dificulty is not bad.\n\u003E Thanks for those who helped. \n\u003E \n\u003E And for the rest, try to do some help, the world needs, if you don\u0027t wanna help just die or get out of the way. \n\u003E \n\u003E My regards to all.\n\nAMD FX are not good for KSP since it only uses 2 cores. A Haswell Pentium would actually be better for KSP, since single core performance in current AMD CPUs suck."},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2015-07-25T11:21:28Z","Content":"I don\u0027t want to sound like Captain Obvious here, but have you tried lowering graphical settings? \n\nGPU is impacted the most this way, but surely the CPU will be a little offloaded as well?"},{"CreatedByName":"LostOblivion","CreatedById":111504,"CreatedDateTime":"2015-07-25T12:00:17Z","Content":"If you don\u0027t mind not playing real time, you can turn down the max physics delta-time to 0.01 or less. The graphics won\u0027t lag at all, even with several hundred-part monstrosities, but the game will not be 100 % real time. To turn it up higher than what the in-game settings allow, edit the settings.cfg file in your game install."},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2015-07-25T12:36:58Z","Content":"\u003E \n\u003E I feel part of the challenge of the game is not only make efficient ships, but ships with the lowest possible number of parts!\n\nAgreed, me stops finally having fun beyond 400 Parts, and my PC is fast as hell.\n\nIt starts lagging at around 250 parts, depending on where it is, athmospheric flight adds lot of calculations.\n\nWait for x64 release..."},{"CreatedByName":"Violent Jeb","CreatedById":130681,"CreatedDateTime":"2015-07-25T15:48:19Z","Content":"For me, it\u0027s the smoke on the landing pad that really makes lag apparent with big ships. I have an i5 w 8gb ram and ONLY with version 1.0\u002B have I been able to notice a substantial lag leaving the pad.\n\nWe\u0027re talking 200\u002B parts. A segment that should take ~10s, takes more like 30. My solution has been to stay under those parts counts, i\u0027m sure i could edit the smoke settings but i\u0027m bound to run into more problems further down the line. \n\nIf there\u0027s a way to disable the launch smoke effects that\u0027ll be your #1 culprit i bet."},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-07-25T15:53:26Z","Content":"Turn off computer. Sit down and recline back, get comfy. Close eyes. Play - no lag, no wonkyness from time warp, and the Kraken only comes out when you order him to. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Izny","CreatedById":137814,"CreatedDateTime":"2015-07-25T17:14:57Z","Content":"\u003E \n\u003E Turn off computer. Sit down and recline back, get comfy. Close eyes. Play - no lag, no wonkyness from time warp, and the Kraken only comes out when you order him to. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nI play KSP every day like this when i go to sleep. I now know i\u0027m not the only one who\u0027s weird like that ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"alanbr00","CreatedById":148750,"CreatedDateTime":"2015-07-25T20:44:47Z","Content":"\u003E \n\u003E I don\u0027t want to sound like Captain Obvious here, but have you tried lowering graphical settings? \n\u003E GPU is impacted the most this way, but surely the CPU will be a little offloaded as well?\n\nYes i have set the graphics to the min and get my 3.5 clock to 4.0\n\n\u003E \n\u003E If you don\u0027t mind not playing real time, you can turn down the max physics delta-time to 0.01 or less. The graphics won\u0027t lag at all, even with several hundred-part monstrosities, but the game will not be 100 % real time. To turn it up higher than what the in-game settings allow, edit the settings.cfg file in your game install.\n\nHelped a lot, did not screw my gameplay and increase a lot my FPS, thanks!"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2015-07-25T22:11:54Z","Content":"\u003E \n\u003E when i build a rocket larger then 500 parts. Any tips?\n\nbest tip: don\u0027t build a rocket with 500 parts.\n\nseriously, IDK why anyone would need to breach 200 parts on a rocket.\n\nyou only need 1.2 TWR and ~2400 dV to reach orbit; your TWR increases as your rocket climbs out of Kerbin\u0027s atmosphere due to the lost fuel from burning it, so you\u0027ll have to learn how to decrease your throttle, which helps conserve fuel.\n\n learning to pilot your rockets efficiently is a very vital key skill in this game that you\u0027re going to have to learn. you can\u0027t just burn with the Z key all the time.\n\nanother skill to use is gravity turning, I\u0027ll touch more on this later. \n\nonce in orbit, you can dock with a re-usable nuclear tug and burn chemical engines to escape kerbin\u0027s SOI (~1500 dV) \n\nonce you\u0027re orbiting the sun, TWR becomes almost meaningless so shut down your chemical engines and use the nuclear tug to setup your interplanetary rendezvous with your target.\n\nonce you\u0027ve arrived at your target, switch back to chemical engines and set a stable orbit, undock from the nuclear tug and plan your landing.\n\nif you\u0027re doing a return trip, you can use the same nuclear tug that you left in orbit, refuel if needed.\n\ntips on nuclear tugs:\n\nLV-N nukes are LF engines that don\u0027t need oxidizer, and only work best in a vacuum and have a high ISP making them ideal for longer burning times. however, they\u0027re pretty heavy engines so it\u0027s usually not a good idea to permanently keep them on your vessel.\n\nthe best use for these engines is in situations where TWR doesn\u0027t matter, such as interplanetary travel.\n\n1 FT-800 tank (with oxidizer removed) will give you about 5 and a half minutes of burn time, you only need 1 LV-N per 100t of payload.\n\nso for example, if you\u0027re hauling 220t of stuff to the Jool system, you only need 2 LV-N engines and a single Rockomax-32 tank without oxidizer.\n\ntips on gravity turning: \n\nyou can\u0027t just burn straight up and expect to reach orbit. what goes up, eventually comes down. you\u0027ll have to use a gravity turn to initiate an orbit.\n\ngravity turning varies as each vessel is built differently, but a general guideline is to use surface mode on the navball and a radial lock during pre-launch.\n\nif your vessel has any boosters that it would shed, you might want to fight the radial tracking to lead the rocket away from the Launchpad.\n\nwhen the vessel reaches 22kM, switch to orbit mode on the navball and use prograde tracking. your vessel \\*should\\* gravity turn by itself all the way into sub-orbit.\n\nwhen you\u0027re at your AP, circulate, but it shouldn\u0027t be much of a burn since gravity turning did most of the work.\n\ntips on docking:\n\nyour orbital AP should be about the same height as your docking target. it doesn\u0027t have to be exact, but the closer, the better.\n\nwhen you circulate your orbit, make sure your PE is higher than 70kM but below the target\u0027s altitude. this will give you an egg-shaped orbit that isn\u0027t shaped like your docking target\u0027s orbit; this is the secret to an orbital rendezvous, one vessel will have a shorter orbit than the other, eventually they will pass each other. all you need to do is make sure you\u0027re close to the target then match your orbital speed. so what you need to do next is to time warp until the two vessels meet, switch the navball to target mode and burn chemical engines in the Retrograde direction until your navball reads between 1 or 2 m/s; this is your speed relative to your target.\n\nset target lock and give a short burn towards your target, you shouldn\u0027t need to go faster than 20m/s because eventually you will have to slow down again, so time warp until you\u0027re really close. while you\u0027re in target lock, your prograde indicator should be aligned with your target (and your navball pointer) if not, you can use RCS to make the necessary course adjustments until it is aligned.\n\nalso, on a separate note, when setting your inclination to your target, know that your Ascending Node requires Anti-Normal burns. (and descending is the opposite.) - this is a memorization trick so you won\u0027t get confused. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n**Edited \u003Ctime datetime=\u00222015-07-26T01:54:45Z\u0022 title=\u002207/26/2015 01:54  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 26, 2015\u003C/time\u003E by Xyphos**"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-07-25T22:40:39Z","Content":"\u003E \n\u003E best tip: don\u0027t build a rocket with 500 parts.\n\u003E seriously, IDK why anyone would need to breach 200 parts on a rocket.\n\nContract:\n\nExplore Duna\n\nExplore Ike\n\nExtract 2700 ore from Ike and deliver it to Duna\n\nPut a space station in Ike\u0027s orbit with a capacity for 11 kerbals and a science lab\n\nThrow in a \u0022base in Duna\u0022 if you wish\n\nTry to do this through a single mothership and you\u0027ll easily breach 200 parts. On top, it will be great for bases and stations if the game didn\u0027t lag as you overbuild them. Besides, once a ship/base/station is outside the atmosphere/not in Gilly, if there is nothing firing up rockets in the vecinity, no physics calculation should take place - what is going to change from a frame to the other?"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-07-25T22:44:19Z","Content":"\u003E \n\u003E I play KSP every day like this when i go to sleep. I now know i\u0027m not the only one who\u0027s weird like that ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nI admit I have KSP dreams now and then too. In fact I had one today and didn\u0027t want to get up because I wanted to keep playing. Then I remembered that unlike most dreams, I can play KSP in real life xD"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2015-07-25T22:44:27Z","Content":"\u003E \n\u003E Err, you can get a mod and weld it, or you can shrink it for less lag. The biggest craft I ever built was 611 parts. It was an O\u0027Neill Cylinder.\n\n![E1klw52.png](http://i.imgur.com/E1klw52.png)\n\nI\u0027m building one of those currently. Just downloaded Ubio Zur and hangar extender to continue on and launch it. I want to make it wider now.\n\n[http://forum.kerbalspaceprogram.com/threads/107273-0-90-UbioZur-Welding-Ltd-Continued-2-1-1-%282015-01-14%29](https://forum.kerbalspaceprogram.com/threads/107273-0-90-UbioZur-Welding-Ltd-Continued-2-1-1-%282015-01-14%29) Just in case you decide to go the welding route. It\u0027s a great mod and I hope a similar system to allow multiple similar parts to be merged into a single one will become part of the base game someday."},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2015-07-25T23:46:07Z","Content":"\u003E \n\u003E Contract:\n\u003E Explore Duna\n\u003E \n\u003E Explore Ike\n\u003E \n\u003E Extract 2700 ore from Ike and deliver it to Duna\n\u003E \n\u003E Put a space station in Ike\u0027s orbit with a capacity for 11 kerbals and a science lab\n\u003E \n\u003E Throw in a \u0022base in Duna\u0022 if you wish\n\u003E \n\u003E Try to do this through a single mothership and you\u0027ll easily breach 200 parts. On top, it will be great for bases and stations if the game didn\u0027t lag as you overbuild them. Besides, once a ship/base/station is outside the atmosphere/not in Gilly, if there is nothing firing up rockets in the vecinity, no physics calculation should take place - what is going to change from a frame to the other?\n\nwhat\u0027s the timeframe on the contract? does it REALLY have to be done in a single launch?\n\n1. build a small 2-large ore tank refinery on Ike, include a command module for 1 engineer to increase efficiency.   \nRefinery can be built as a rover to help explore.   \nput docking ports on the two ore tanks so you can detach the tanks from the refinery rover, leaving that heavy mass on the surface and taking only the ore tanks back. use toggling of landing gear wheels to re-dock with your lander/orbiter, but note that landing gear has no motor drive, use rover wheels too.\n2. build your rocket for the above payload, don\u0027t go all willy-nilly either, follow the KISS rule, it doesn\u0027t take much to get to orbit (or to leave kerbin\u0027s SOI)  \nthe rocket should include 1 Mk3 passenger module, 1 Mk3-100 Cargo Bay to hold the science lab and refinery rover, and a simple command module to make it a \u0022station\u0022, add docking ports and build your Ike lander.\n3. launch your station into orbit - leave it there for now.\n4. launch your refinery into orbit, dock with the station.\n5. launch your Ike lander into orbit, dock with the station.\n6. build a nuclear tug if you don\u0027t have one already in kerbin\u0027s orbit\n7. launch the nuclear and dock with the station\n8. escape kerbin\u0027s SOI\n9. nuke-drive to Ike\n10. orbit Ike, undock the nuke tug, undock the lander, undock the refinery rover, leaving only the station and science lab.\n11. dock the refinery rover to the lander.\n12. land.\n13. use the refinery rover to collect the ore\n14. refuel your lander/orbiter\n15. collect more ore if needed\n16. leave ike and redock with the nuke tug\n17. leave ike\u0027s SOI and nuke drive to duna\n18. orbit duna, undock the nuke tug, land.\n19. contract complete.\n\nYou really shouldn\u0027t try to do everything all at once, not only does adding more parts make it more difficult to launch the vessel, more parts induce more physics lag and create more \u0022points of possible failure\u0022 in which the kraken finds very delicious.\n\ninstead of viewing the problem as a whole, break it down into smaller goals that work towards the ultimate goal, you\u0027ll find it much easier and more successful that way.\n\n**Edited \u003Ctime datetime=\u00222015-07-26T02:02:05Z\u0022 title=\u002207/26/2015 02:02  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 26, 2015\u003C/time\u003E by Xyphos**"},{"CreatedByName":"Rus-Evo","CreatedById":107004,"CreatedDateTime":"2015-07-26T09:00:21Z","Content":"I find lag is worst at the launchpad when you have the most parts,and I just put up with it as I know most of the mission will be spent using a ship of a manageable size."},{"CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2015-07-26T09:35:06Z","Content":"\u003E \n\u003E I find lag is worst at the launchpad when you have the most parts,and I just put up with it as I know most of the mission will be spent using a ship of a manageable size.\n\nI have same upon launch. What I do is zoom out and change my FOV to the sky and just use the navball.....no lag at all. I then zoom in when cleared the EVE cloud layer."},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-07-26T15:16:03Z","Content":"\u003E \n\u003E what\u0027s the timeframe on the contract? does it REALLY have to be done in a single launch?\n\u003E \n\u003E \n\u003E 1. build a small 2-large ore tank refinery on Ike, include a command module for 1 engineer to increase efficiency.   \n\u003E Refinery can be built as a rover to help explore.   \n\u003E put docking ports on the two ore tanks so you can detach the tanks from the refinery rover, leaving that heavy mass on the surface and taking only the ore tanks back. use toggling of landing gear wheels to re-dock with your lander/orbiter, but note that landing gear has no motor drive, use rover wheels too.\n\u003E 2. build your rocket for the above payload, don\u0027t go all willy-nilly either, follow the KISS rule, it doesn\u0027t take much to get to orbit (or to leave kerbin\u0027s SOI)  \n\u003E the rocket should include 1 Mk3 passenger module, 1 Mk3-100 Cargo Bay to hold the science lab and refinery rover, and a simple command module to make it a \u0022station\u0022, add docking ports and build your Ike lander.\n\u003E 3. launch your station into orbit - leave it there for now.\n\u003E 4. launch your refinery into orbit, dock with the station.\n\u003E 5. launch your Ike lander into orbit, dock with the station.\n\u003E 6. build a nuclear tug if you don\u0027t have one already in kerbin\u0027s orbit\n\u003E 7. launch the nuclear and dock with the station\n\u003E 8. escape kerbin\u0027s SOI\n\u003E 9. nuke-drive to Ike\n\u003E 10. orbit Ike, undock the nuke tug, undock the lander, undock the refinery rover, leaving only the station and science lab.\n\u003E 11. dock the refinery rover to the lander.\n\u003E 12. land.\n\u003E 13. use the refinery rover to collect the ore\n\u003E 14. refuel your lander/orbiter\n\u003E 15. collect more ore if needed\n\u003E 16. leave ike and redock with the nuke tug\n\u003E 17. leave ike\u0027s SOI and nuke drive to duna\n\u003E 18. orbit duna, undock the nuke tug, land.\n\u003E 19. contract complete.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E You really shouldn\u0027t try to do everything all at once, not only does adding more parts make it more difficult to launch the vessel, more parts induce more physics lag and create more \u0022points of possible failure\u0022 in which the kraken finds very delicious.\n\u003E \n\u003E instead of viewing the problem as a whole, break it down into smaller goals that work towards the ultimate goal, you\u0027ll find it much easier and more successful that way.\n\nNo, it doesn\u0027t have to be completed in one ship, but that\u0027s not only cheaper (less boosters to take off from Kerbin) but also fun. In any case, in that particular case, the refinery I\u0027ve included went to Duna, not Ike, and the ore will be transported in an overengineered rover. I also don\u0027t like orbit assembly too much. Since I find orbit disassembly instead, I\u0027ve sent my Duna/Ike mission in a flotilla including this stuff\n\n![x5xl6q.jpg](http://i60.tinypic.com/x5xl6q.jpg)\n\n![2jes292.jpg](http://i57.tinypic.com/2jes292.jpg)\n\nThey don\u0027t reach 500 parts, but they are above 200 at launch, and why shouldn\u0027t they? It\u0027s a game, if I want complex designs, it\u0027s my issue.\n\nAnd note that I\u0027m using Space-Y large SRBs to save on part count instead of clustering kickbacks\n\n- - - Updated - - -\n\n\u003E \n\u003E [http://i.imgur.com/E1klw52.png](http://i.imgur.com/E1klw52.png)\n\u003E I\u0027m building one of those currently. Just downloaded Ubio Zur and hangar extender to continue on and launch it. I want to make it wider now.\n\u003E \n\u003E [http://forum.kerbalspaceprogram.com/threads/107273-0-90-UbioZur-Welding-Ltd-Continued-2-1-1-%282015-01-14%29](https://forum.kerbalspaceprogram.com/threads/107273-0-90-UbioZur-Welding-Ltd-Continued-2-1-1-%282015-01-14%29) Just in case you decide to go the welding route. It\u0027s a great mod and I hope a similar system to allow multiple similar parts to be merged into a single one will become part of the base game someday.\n\nDoes it work with 1.0.4?"}]}