{"TopicId":117582,"ForumId":32,"TopicTitle":"Any workaround for the cargo bays exploding (or their contents)?","CreatedByName":"Tazin","CreatedById":147235,"CreatedDateTime":"2015-08-04T02:38:40Z","PageNum":1,"Articles":[{"CreatedByName":"Tazin","CreatedById":147235,"CreatedDateTime":"2015-08-04T02:38:40Z","Content":"Well, i can\u0027t put anything on any cargo bay. I tried 2.5m 1.25m mk2 . . . either the cargo bays explode, or their contents explode. This can happen on load, on time warp, on opening/closing . . . i read this is a common problem with the new heat/aero model . . . any way around it?"},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-08-04T02:53:48Z","Content":"If you don\u0027t do any clipping its not usually a problem and attaching thingsinside with cubic structures is also a no no, they are like one way heat valves or sometthing. Also get stock bug fix mod."},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2015-08-04T02:57:52Z","Content":"Most everything I have read thus far leads evidence of cargo bay failure being due to parts clipping through the walls of the bay. I have only used the large bays once thus far, but I use the service bays very often and have seen reports of those failing as well. I haven\u0027t had one service bay explode on me once, and I have packed them pretty well with science or power modules or a mix of both. If you don\u0027t treat the bay like your family station wagon on a trip to California, you should actually do quite well. Just make sure you pay attention to how everything is positioned."},{"CreatedByName":"Tazin","CreatedById":147235,"CreatedDateTime":"2015-08-04T03:04:43Z","Content":"I read about the clipping. So i tried a spaceplane with a mk2 cargo bay, with absolutely no clipping in it. It explodes on the runway if i do phisical warp x2. The log claims it is overheating of this component, that component, or the bay itself."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-08-04T04:30:47Z","Content":"Physics warp is dangerous/buggy/broken\\_for\\_heat."},{"CreatedByName":"Taowulf","CreatedById":149037,"CreatedDateTime":"2015-08-04T04:50:45Z","Content":"This just answered for me why I was getting a mysterious explosion on one of my rockets...a cargo bay full of batteries. (just a little cargo bay)"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-04T11:36:55Z","Content":"\u003E \n\u003E Most everything I have read thus far leads evidence of cargo bay failure being due to parts clipping through the walls of the bay. I have only used the large bays once thus far, but I use the service bays very often and have seen reports of those failing as well. I haven\u0027t had one service bay explode on me once, and I have packed them pretty well with science or power modules or a mix of both. If you don\u0027t treat the bay like your family station wagon on a trip to California, you should actually do quite well. Just make sure you pay attention to how everything is positioned.\n\nWhat? When I think cargo bay I think how full can I stuff it like a frisco-bound family battle tank (was this before or after the summer of love, cause I want to know whether it should have flower decals or not?). Come to think of it it should have a trailer hitch on both sides so we can put stuff full the trailers also, that would be more nostalgic, and a little electric window in the back that goes up an down. \n\nTake a copy of modular girder segment CFG and modify its rescale factor until if fits to about 80%-90% of the interior height. Then you can mount stuff safely on it, on the sides you can mount a radiator to keep the parts inside cool. The bay is somewhat superfluous since there many of KSPs parts are not stream-lined, you can tuck many of the science parts in the groves and crevices created by stacking such parts and they are pretty well protected."},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-08-04T13:06:54Z","Content":"\u003E \n\u003E Most everything I have read thus far leads evidence of cargo bay failure being due to parts clipping through the walls of the bay. I have only used the large bays once thus far, but I use the service bays very often and have seen reports of those failing as well. I haven\u0027t had one service bay explode on me once, and I have packed them pretty well with science or power modules or a mix of both. If you don\u0027t treat the bay like your family station wagon on a trip to California, you should actually do quite well. Just make sure you pay attention to how everything is positioned.\n\nI disagree. I have had explosions on ships with nothing at all in the cargo bay, and no explosions in bays with internal parts clipped through them. And the explosion is caused by the bay spontaneously heating nearly instantly to WAY above its maxTemp without exploding, but this heat flows into not only the bay\u0027s contents but any parts fore or aft. Whichever of those parts has the lowest maxTemp will explode, whether inside the bay or not. Once the 1st part explodes, the \u0022Kraken Heat\u0022 disappears as quickly and mysteriously as it appeared.\n\nThis heating problem seems to stem from the doors touching any external part during their opening/closing animations. Even if this animation is ONLY done in the SPH/VAB prior to launch and never done in actual flight. Furthermore, the part touched by the door might not even be there on the finished ship (such as, you see it will interfere with the door so remove it in the editor). Just having the moving door touch another external part one even once, even during editing, is enough to permanently curse that bay to spontaneous superheating.\n\nIn fact, you don\u0027t even need to actually touch the moving door, just have the POTENTIAL to. For instance, build a ship with a telescoping ladder attached to the part above/in front of the cargo bay, so that the ladder, when extended, will cross the path of the moving bay doors. Even if you never have the ladder extended when the door moves, not even in the editor, the bay will still superheat in flight."}]}