{"TopicId":117825,"ForumId":32,"TopicTitle":"its been a while...kerbin","CreatedByName":"Lego8_bit","CreatedById":58076,"CreatedDateTime":"2015-08-06T22:08:22Z","PageNum":1,"Articles":[{"CreatedByName":"Lego8_bit","CreatedById":58076,"CreatedDateTime":"2015-08-06T22:08:22Z","Content":"hello guys im lego8\\_bit its been a while since i played this game like 0.90 and when i got back into the game today i noticed a few different changes to my planes and how they reacted when they flew around in kerbins atmosphere. they felt a bit sluggish. what happened exactly ?\n\n**Edited \u003Ctime datetime=\u00222015-08-06T22:22:09Z\u0022 title=\u002208/06/2015 10:22  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 6, 2015\u003C/time\u003E by Lego8\\_bit**"},{"CreatedByName":"March Unto Torment","CreatedById":149317,"CreatedDateTime":"2015-08-06T22:27:28Z","Content":"The entire aerodynamic system got overhauled; it now bears more in common with Faraam Aerospace than with the original KSP aerodynamics system.\n\nI\u0027d advise seriously reworking your designs. As a rule, anything built to fly before 1.0 won\u0027t fly now."},{"CreatedByName":"Brofessional","CreatedById":2080,"CreatedDateTime":"2015-08-06T22:32:33Z","Content":"You can enable the aerodynamics by pressing F12 to see drag and lift forces on your craft in-flight."},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-08-06T22:32:58Z","Content":"The atmosphere and heating has been reworked. It is much more like RL now, a bit like old FAR in 0.90, also re-entry heat and parts heating each other is a thing. It\u0027s all good, takes some getting used to. Jets are no where near as powerful as they were, still way overpowered. But there are some bugs. Be careful clipping things in cargo bays and service modules. Physics timewarp in atmosphere can cause rapid disassembly, especially with MK2 parts.\n\nSome tips, with rockets don\u0027t go too fast low down and start your gravity turn early and slowly, no more blast to 10km then 45 degrees. You need nosecones, the front of the craft must be less draggier than the back. The CoM must be high, think normal rocket vs pancake. You need a shallow re-entry, I hear people are doing 45km\u002B degrees periapsis, I have not had to worry too much, straight down is an obvious no no. The other planets have bugs with their atmospheres, no Jool aerobrake (instant death), you need to be extra careful aerobraking on any world especially the bigger ones.\n\nEdit: you NEED Claws [Stock Bug Fix Mod](https://forum.kerbalspaceprogram.com/threads/97285-KSP-v1-0-4-Stock-Bug-Fix-Modules-%28Release-v1-0-4b-2-1-Aug-15%29) and to install it use [CKAN](https://forum.kerbalspaceprogram.com/threads/100067-The-Comprehensive-Kerbal-Archive-Network-%28CKAN%29-Package-Manager-v1-12-0-30-Jul-2015) these are almost mandatory.\n\n**Edited \u003Ctime datetime=\u00222015-08-06T22:39:39Z\u0022 title=\u002208/06/2015 10:39  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 6, 2015\u003C/time\u003E by selfish\\_meme**"},{"CreatedByName":"Lego8_bit","CreatedById":58076,"CreatedDateTime":"2015-08-07T01:49:55Z","Content":"Wow thanks for the update on the game lol i am also broke over 2200 m/s in a mk2 plane ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Arran","CreatedById":64656,"CreatedDateTime":"2015-08-07T14:53:22Z","Content":"\u003E \n\u003E Wow thanks for the update on the game lol i am also broke over 2200 m/s in a mk2 plane ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nI launch my MK2 spaceplanes in a shallow angle (5/10 degrees) way up to about 32km where they start to sufficate, reaching a speed of about 2600 m/s that pushes it to a near stable orbit (roughly 450km x 30km) on airbreathing engines alone while the plane itself, then just let it glide to AP, where i active my lvl-909 for a circlulasation manouvre.\n\nOnly this approach takes patience as the acent on turbofans take about 35mins.\n\nOnly 2 small MK2 tanks are needed one for Liquid fuel and one for the LoX, so even with the airbreathing engine nerf, they still are pretty OP if you ask me."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-08-07T14:56:59Z","Content":"Ok, how the heck are you guys getting those speeds on air breathers...? They\u0027re supposed to fizzle around 1100-1400m/s?"},{"CreatedByName":"Arran","CreatedById":64656,"CreatedDateTime":"2015-08-07T15:33:12Z","Content":"\u003E \n\u003E Ok, how the heck are you guys getting those speeds on air breathers...? They\u0027re supposed to fizzle around 1100-1400m/s?\n\nDont try to gain speed in the lower atmosphere with the Turbo fans, to much air resistance there that gives huge drag, get to about 20.000, then level off as i said to about an angle of about 5 degrees, and go full speed (i need 4 turbo fans for an basic Spaceplane to reach this speed, and just 2 LV-909\u0027s with 8 air intakes), and it takes a LONG time, the acent from 20.000 to 32.000 takes about 25mins with an accelleration of about 0.1m/s at 20.000 and tops off at 32.000 at around 1.6 to 2m/s\n\nSo its **NOT** a quick launch approach, its all about efficiency, with as little as possible drag creating stuff on the outside, so build sleek.\n\nAlso use as less wing as possible, the airframe itself with a deltawing is enough for those speeds, landings might be a tat hairy, since you need to keep a high speed to keep it airborn, basicly its a horizontal rocket with slow acelleration on airbreathing engines ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nGiven enough time (heat managment will be a HUGE issue, as your craft will be the whole time engulfed in flames, to near critical levels, i get to about 97% heat buildup on the cockpit for example) you reach insane speeds.\n\nPatience and precision control is the key here, for this i use the Pilot assistance mod as normal keyboard wsad inputs are to jerky, Mechjeb cant do such precision inputs neither. Keep the angle as shallow as possible and keep that AoA meter as much on the 5 degrees.\n\nUse enough air intakes to keep the airflow to the turbo fans flowing at those heights, and they will sufficate no matter the intakes around 32/34.000 m height.\n\nBut with 2400m/s and faster the AP will then be around 400km and PE around 30km, so you prolly need just a minor burn to make the orbit stable.\n\nAny jerky moves, and you bleed of speed alot, hence i have to use that pilot assistance mod, on fine control mode, to make those tiny adjustments, and again alot of patience ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nLower AP might be hard as you will need to throttle down the last bit to keep the heat under control and the tiny drag even there will slow you down and lower the AP.\n\nAlso keep it as light as possible, there crafts arent ment for carrying huge loads, but very economical shuttles to resupply stations (i use TAC lifesupport, thus need regulair resupply flights) and crew.\n\n**Edited \u003Ctime datetime=\u00222015-08-07T15:40:36Z\u0022 title=\u002208/07/2015 03:40  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 7, 2015\u003C/time\u003E by Arran**"}]}