{"TopicId":118264,"ForumId":32,"TopicTitle":"Rockets Built By Bill","CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-12T03:50:57Z","PageNum":1,"Articles":[{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-12T03:50:57Z","Content":"The tremendous joy that I felt with my first model rocket. All the time it took in selecting that special rocket and then the time on assembly. Paper tubes, balsam wood, held together with glue and the decals just right. Testing the COM with a string and spinning it around like a lasso. The finished rocket is now carefully packed and I head off to the launchpad (park). Now the model rocket is all set up and ready to go. That feeling of accomplishment is instantly doubled when the ignition is lit and the rocket soars.\n\nThat same feeling is what I am experiencing when I let Bill build rockets on the lawn. When he drives through KSC hauling 36 tonne components from the runway. I am trying to drive and assemble using IVA and it feels great. Then create a rocket at the launch pad that soars into space has got me sold. This for me is truly an unforgettable and awesome KSP experience.\n\nDoes anyone else feel this is totally worth the time and effort?\n\nHere a rocket built by Bill that reached orbit. \n\nBill:) has learned plenty about mechanical devices down at the ranch and still has much to learn about building rockets.\n\nFor the first time he built a multi stage rocket that sent a probe into orbit.\n\n![EJl99Rz.png](http://i.imgur.com/EJl99Rz.png)\n\n![MR2XuC1.png](http://i.imgur.com/MR2XuC1.png)\n\n![SfTxkwz.png](http://i.imgur.com/SfTxkwz.png)\n\nMore details\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/6rdQL)\n\nPost your creations from the [Vehicle Assembly Lawn](https://forum.kerbalspaceprogram.com/threads/131321-Vehicle-Assembly-Lawn?p=2133258#post2133258)."},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-08-12T09:55:54Z","Content":"You\u0027d love\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/SyUpLwbWbvU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n by Cupcake :-)"},{"CreatedByName":"LordCorwin","CreatedById":114256,"CreatedDateTime":"2015-08-13T15:19:49Z","Content":"Wow, never thought to compare model rocketry and KSP, but here it goes from my point of view.\n\nIn both cases the feeling when achieving a goal is simply superb. I remember the first model rocket I did. it was a C class (10 NÃ‚Â·s), quite small, but the feeling was... just incredible. I was 12 years old and I felt like Superman!\n\nIn KSP I\u0027ve been playing close to a thousand hours. I remember first time I landed on the Mun and came back safe to Kerbin. I danced all around the table while thinking the \u0022Space will never be the same\u0022 motto.\n\nSo I guess yeah, feelings when playing KSP vs making model rockets are similar.\n\nTo me the big difference between Model rocketry and KSP is how I pursuit a project. In model rocketry once I have built my rocket, the only I can do once built is fly it as much as possible. I don\u0027t do many changes, only repairments if necessary. With KSP I enjoy planning and testing my rockets, trying to squeeze and minimize the resources. Sometimes I spend more time refining my model than actually flying. But each time I accomplish a mission you could see a happy face.\n\nFor sure I enjoy both!\n\nLord"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-14T03:56:14Z","Content":"I made this for anyone to enjoy building and launching a rocket. An easy to snap together design and even if after you build it and it fails it is still very thrilling.\n\nThe design is based on one of my first model rockets I built. Single tube and three balsam wood fins. Smoothed out the body/fin connection with putty and sanded it too many times. I remember the flash of the plastic molded nose cone needed to be trimmed in order to fit inside the tube. Painted the rocket with two coats of matte white. It was a bright spring afternoon and the launch went fantastic. After reaching its altitude the parachute opened and the wind carried it far away;.;. \n\n Be free my tiny rocket. Be free.\n\n![Hu2Uewj.png](http://i.imgur.com/Hu2Uewj.png)\n\nThe design can be used in a tier zero facility. \n\nMake certain to follow all the safety guidelines and take cover in the bunker!\n\n![waCbUDm.png](http://i.imgur.com/waCbUDm.png)\n\nThe probe core reaches orbit and has 2500 m/s delta V remaining.\n\n![0Roa63H.png](http://i.imgur.com/0Roa63H.png)\n\n[**Bob Bill Rocket Kit**](https://forum.kerbalspaceprogram.com/threads/131321-Vehicle-Assembly-Lawn?p=2136917#post2136917)\n\nBe sure to use [Docking Ports Sounds mod](https://kerbalstuff.com/mod/927/Docking%20Sounds) and make every connection the sound of progress.\n\nP.S.\n\nI have become sort of enthralled in building rockets and every time I am making new discoveries. Those discoveries lead to another test and so on.\n\nAt the moment the docking ports are being thoroughly investigated. The issue is undocking a spent booster. Sometimes the vessel focus switches to the separated booster and causes havac with mission control. Having the mantra \u0022Don\u0027t Panic!\u0022 is my only solace.\n\n**Edited \u003Ctime datetime=\u00222015-08-14T04:16:44Z\u0022 title=\u002208/14/2015 04:16  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 14, 2015\u003C/time\u003E by MoeslyArmlis**"}]}