{"TopicId":118386,"ForumId":32,"TopicTitle":"(I guess I didn\u0027t \u0022Knock on Wood\u0022 re Kraken), or, ...what just happened?","CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-08-13T16:54:15Z","PageNum":1,"Articles":[{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-08-13T16:54:15Z","Content":"\n\u003Cp\u003ESo, the 10x too big Eve probe was 10 days out from its Orbital Insertion Burn, so I selected it in the tracking station, clicked \u0022Fly\u0022...\u003C/p\u003E\u003Cp\u003EAnd it loaded the probe\u0027s staging on the Left of the screen, but no probe- in fact, no Stars; no Altitude on the UI, no colors in the Nav Ball.\u003C/p\u003E\u003Cp\u003EThis frightened me.\u003C/p\u003E\u003Cp\u003EI went back to KSC... and there was no PLANET. Just the Skybox as far as the eyes could see. This too was frightening, so I closed them.\u003C/p\u003E\u003Cp\u003EI exited, re-loaded, ...and the Solar Syatem was there, but the Eve Probe was gone; erased. I remembered I had Quick-saved Just before switching to the Eve Probe, so I loaded that save, and tried again... and this time everything was as it should be. Orbital Burn was successful after successful time acceleration, game seems normal.\u003C/p\u003E\u003Cp\u003ESo, what kind of drinking binge happened at the Space Center? - i.e., what the heck happened? o.O\u003C/p\u003E\u003Cp\u003EIf I had not been able to recover, I would have chalked it up to \u0022Lost communications due to an unexplained malfunction\u0022 (since parts don\u0027t \u0022fail\u0022 this fills that niche kind-of), but still it was weird.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-13T17:03:48Z\u0022 title=\u002208/13/2015 05:03  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 13, 2015\u003C/time\u003E by GarrisonChisholm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-08-13T17:05:41Z","Content":"\n\u003Cp\u003EYou have found what I call the SOI Doppler Effect Kraken, a sadly familiar annoyance.\u003C/p\u003E\u003Cp\u003EI really have no idea what causes it, but it\u0027s a common occurrence when a ship is near the edge of an SOI, especially if behind the body it\u0027s approaching. Such as when your interplanetary ship leaves Kerbin and passes just behind Mun on the way out. Or when approaching another planet from the inside of its orbit so you\u0027re catching up with it from behind. So tell me, where you approaching Eve from inside our outside of its orbit?\u003C/p\u003E\u003Cp\u003EMy theory is that SOIs do not move with analog smoothness but rather in discrete steps, and that the SOI\u0027s steps are fewer and longer than the steps taken by the associated planet. Especially when using warp. Thus, there is like a Doppler Effect on the SOI as the planet gets off-center in it. As a result, SOIs extend more behind a planet than in front of it, and this confuses the game. Part of the game thinks you\u0027re inside the SOI, part of you thinks you\u0027re not, and the game can\u0027t decide what to draw so the universe goes away and takes the ship with it.\u003C/p\u003E\u003Cp\u003EWhile this theory is almost certainly wrong, it\u0027s Kerbal enough for my tastes. And it really doesn\u0027t matter why this happens anyway, just that it does.\u003C/p\u003E\n"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-08-13T18:25:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EYou have found what I call the SOI Doppler Effect Kraken, a sadly familiar annoyance.\u003Cp\u003EI really have no idea what causes it, but it\u0027s a common occurrence when a ship is near the edge of an SOI, especially if behind the body it\u0027s approaching. Such as when your interplanetary ship leaves Kerbin and passes just behind Mun on the way out. Or when approaching another planet from the inside of its orbit so you\u0027re catching up with it from behind. So tell me, where you approaching Eve from inside our outside of its orbit?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFascinating. It was an \u0022outside-Eve\u0027s-orbit\u0022 approach, so Eve would have been just passing up the probe, as SOI entry (10-days away) would be low (anti-normal?) and to the retrograde of Eve\u0027s motion- the capture orbit though is nearly polar, much to my surprise.\u003C/p\u003E\n"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-08-14T03:32:34Z","Content":"\n\u003Cp\u003EOh this happened a lot with me already. It\u0027s just a matter of time for it to happen if you are playing for some time.\u003C/p\u003E\n"}]}