{"TopicId":11855,"ForumId":32,"TopicTitle":"Tried to do Delta V calculations... help?","CreatedByName":"Superewza","CreatedById":1152,"CreatedDateTime":"2012-06-01T21:34:02Z","PageNum":1,"Articles":[{"CreatedByName":"Superewza","CreatedById":1152,"CreatedDateTime":"2012-06-01T21:34:02Z","Content":"\n\u003Cp\u003EWell over the past few days i\\\u0027ve been trying to churn out some numbers that might help me to better design ships. I can work out the ?v of a ship and all the separate stages, what i have trouble with is actually calculating the requirements of a maneuver.\u003C/p\u003E\u003Cp\u003EUsing the equations ?vo = sqrt[ (G * Pm) / Pr ], ?vd = gp * tL, tL = ?vo / A, ?va ? 610 (not sure how accurate this estimation is for Kerbin but without knowing more about the atmosphere i don\\\u0027t think there\\\u0027s much you can do about it) and of course ?tvo = ?vo \u002B ?vd \u002B ?va i managed to come up with an estimation for reaching orbit, assuming about 2Gs acceleration of around \u003Cstrong\u003E4250m/s\u003C/strong\u003E. I also figured i should probably take 100 off that due to the rotation at the equator but it can\\\u0027t hurt to overestimate a little.\u003C/p\u003E\u003Cp\u003EThen for starters i tried to work out the combined requirements for a mission to the Mun. Using Hoffman orbits i think there should be about six independent maneuvers (Kerbin orbit, Munar transfer burn, Munar insertion burn, Munar de-orbit burn, Munar descent burns and the Munar ascent/Kerbin transfer burn). \u003C/p\u003E\u003Cp\u003ERespectively, i assume to work out each i would have to use the value i already have (which i am aware doesn\\\u0027t take into account altitude, so i assumed 100km above surface), the first Hohmann transfer equation (on wikipedia, although i was a bit thrown off with the Gravitational parameter given in the wiki for Kerbin being in km^3/s^2, so i used all km values and came up with an answer of \u003Cstrong\u003E0.842km/s\u003C/strong\u003E). Then... i got lost. I assume you would have to know how fast you would be travelling at the point in the transfer orbit where you got captured, and the orbital velocity of the Mun. Then is it just the difference of the two? Problem being i have no idea how to work out velocity at any given point in an orbit. I could probably do the rest using what i already know plus suvat.\u003C/p\u003E\u003Cp\u003ESo i guess what i\\\u0027m asking is - how do you work out velocity at apoapsis (which i believe is also the semi major axis?), are the figures i have anywhere near right/what anyone else has and also, with regards to Minmus, are the calculations much the same if you just rotate the craft on the launch pad? Just because i\\\u0027m pretty sure that changing your orbital inclination is one of the most fuel-intensive burns you can do... what sort of angle are you looking for then, or does nobody know.\u003C/p\u003E\u003Cp\u003EThanks to anybody that can help/understand what the hell i\\\u0027m on about (i barely can). I have to say i never thought i would be using this stuff in a game, and actually enjoy it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EReferences:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/mission.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/mission.php\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Hohmann_transfer_orbit\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Hohmann_transfer_orbit\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2012-06-01T21:37:35Z","Content":"\n\u003Cp\u003EIf you know your velocity and altitude at periapsis and your altitude at apoapsis, you can use the equations for conservation of mechanical energy and solve for final kinetic energy.\u003C/p\u003E\n"},{"CreatedByName":"Superewza","CreatedById":1152,"CreatedDateTime":"2012-06-01T21:43:10Z","Content":"\n\u003Cp\u003EHmm, well velocity at periapsis should be initial orbital velocity plus the change in velocity required for the transfer burn, right? You wouldn\\\u0027t happen to have a link to somewhere i can read up on these equations, would you?\u003C/p\u003E\n"},{"CreatedByName":"The_Duck","CreatedById":1156,"CreatedDateTime":"2012-06-01T21:52:01Z","Content":"\n\u003Cp\u003EYour figures for delta-V for ascent and for trans-munar injection are quite accurate. MechJeb will record how much delta-V is expended during automatic ascents if you want hard numbers. It will also tell you how much delta-V is required for various orbital operations, including TMI.\u003C/p\u003E\u003Cp\u003EI believe the most efficient way to land on the Mun is to adjust your Munar periapsis so that it is just above the ground, then when you reach periapsis do one big burn to kill all your velocity and drop a few meters to the surface. When I do this I usually find that my velocity at periapsis is around 800 m/s, so that\\\u0027s the delta-V required to land this way. \u003C/p\u003E\u003Cp\u003EIt\\\u0027s a little complicated to predict that 800 m/s figure from first principles. If you know your velocity at the apoapsis of your transfer orbit, you can subtract the Mun\\\u0027s orbital velocity to get your velocity with respect to the Mun at the moment when you enter the Mun\\\u0027s SOI. But then the Mun accelerates you toward it, so you\\\u0027re going faster when you reach the deorbit burn. \u003C/p\u003E\u003Cp\u003ETo find your velocity at one altitude given your velocity at another altitude you can use conservation of energy. Your orbital energy per unit mass is\u003C/p\u003E\u003Cp\u003EE/m = (1/2)v^2 - GM/r\u003C/p\u003E\u003Cp\u003Ewhere v is your orbital velocity, GM is the body\\\u0027s gravitational parameter, and r is your distance from the center of the body. E/m is conserved, so if you know your velocity at one value of r, you can compute E/m, then solve the above equation for v, plug in a new value of r, and find your new velocity at the new r. With this you should be able to calculate how much the Mun will accelerate you as you fall toward it.\u003C/p\u003E\u003Cp\u003EIt\\\u0027s true that plane changes are expensive. You can calculate the cost of a plane change as dV = 2 v sin(theta/2) where v is your velocity and theta is the angle by which you rotate your plane. For small theta this is approximately dV = v * theta if theta is measured in radians. Since v is large in low orbits, plane changes are especially expensive at low altitudes.\u003C/p\u003E\u003Cp\u003EOne way to avoid that cost when going to Minmus is to launch into an initial Kerbin parking orbit that lies in the same plane as Minmus, instead of launching into an equatorial parking orbit and then doing a plane change. (This requires launching at the time of day when the launchpad passes through Minmus\\\u0027s orbital plane).\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2012-06-01T21:52:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Superewza\u0022 data-cite=\u0022Superewza\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo i guess what i\\\u0027m asking is - how do you work out velocity at apoapsis\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWhat semi-ninja said. Both orbital energy and the vis-a-vis equation will work.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Superewza\u0022 data-cite=\u0022Superewza\u0022\u003E\u003Cdiv\u003E(which i believe is also the semi major axis?)\u003C/div\u003E\u003C/blockquote\u003EOnly for circular orbits. For elliptical orbits, average the two apses together to get the semi-major axis. (Just keep in mind that KSP gives altitudes, rather than the \u0027actual\u0027 apoapsis/periapsis figures.)\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Superewza\u0022 data-cite=\u0022Superewza\u0022\u003E\u003Cdiv\u003Eare the figures i have anywhere near right/what anyone else has and also, with regards to Minmus, are the calculations much the same if you just rotate the craft on the launch pad?\u003C/div\u003E\u003C/blockquote\u003EThe figures are in the right area. From what I\\\u0027ve flown, efficient ascents tend to LKO be ~4300-4400 m/s. Less efficient ones may be 4500-5100 m/s. The descent figure also sounds about right. Timing for launching into Minmus\\\u0027 orbital plane is slightly hard at the moment, but the low inclination (6Â°?), means that there are times when you can reach it from a 0Â° orbit. (eg: with a fresh persistence file)\n"},{"CreatedByName":"Superewza","CreatedById":1152,"CreatedDateTime":"2012-06-02T17:05:30Z","Content":"\n\u003Cp\u003ERight, well using everyone\\\u0027s suggestions i came up with this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D2JW6.jpg\u0022 alt=\u0022D2JW6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat it doesn\\\u0027t take into account is the delta-v you need to not crash into the surface of the Mun or Minmus after your de-orbit burn, which depends largely on your distance above the surface (v^2=u^2\u002B2as, where u=0). Also the gravitational drag you need to overcome to get back into orbit from the surface. Oh, and also the fact that piloting skills can be less than perfect. But i can calculate all those - what i can\\\u0027t is a maneuver between the Mun and Minmus.\u003C/p\u003E\u003Cp\u003EHow does it look? Anything drastically off? Thanks!\u003C/p\u003E\n"},{"CreatedByName":"DavidSJ","CreatedById":29904,"CreatedDateTime":"2012-07-17T09:26:22Z","Content":"\n\u003Cp\u003EI did some calculations tonight for some maneuvers. I got:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMun landing -\u0026gt; Low Munar Orbit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E575 m/s*\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELow Munar Orbit -\u0026gt; Mun/Minmus transfer orbit\u003C/strong\u003E (assuming orbital plane alignment obviates need for change of inclination)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E294 m/s\u003C/span\u003E (provides 308 m/s in hyperbolic excess velocity, resulting in 850 m/s at periapsis and 217 m/s at apoapsis)\u003C/p\u003E\u003Cp\u003E3d 2h 24m transfer time, launch 90.5 degrees clockwise from Minmus\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELow Munar Orbit/Minmus transfer orbit -\u0026gt; Minmus landing\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E57 m/s\u003C/span\u003E burn to eliminate hyperbolic excess velocity\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E307 m/s\u003C/span\u003E burn to land*\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMinmus landing -\u0026gt; Low Minmus orbit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E217 m/s*\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELow Minmus orbit -\u0026gt; Kerbin\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E166 m/s\u003C/span\u003E burn (provides 229 m/s in hyperbolic excess velocity, resulting in 45 m/s at apoapsis and \u0026lt;3254 m/s at periapsis, in atmosphere)\u003C/p\u003E\u003Cp\u003E2d 6h transfer time\u003C/p\u003E\u003Cp\u003E* Actual cost will be somewhat higher; depends on thrust/mass ratio.\u003C/p\u003E\n"},{"CreatedByName":"DavidSJ","CreatedById":29904,"CreatedDateTime":"2012-07-17T09:37:55Z","Content":"\n\u003Cp\u003EHaven\\\u0027t checked all your numbers but note that the most efficient way to get to Kerbol is a Munar slingshot for Kerbin escape followed by a bi-elliptical transfer to Kerbol. I\\\u0027d guess you save about 5 km/s vs. a simple Kerbin escape followed by Hohmann transfer.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2012-07-17T15:55:41Z","Content":"\n\u003Cp\u003EMunar slignshot doesn\\\u0027t help for a bi-elliptic sundive. You\\\u0027re far better off taking advantage of the Oberth Effect and doing your burning for the outbound leg in low Kerbin orbit.\u003C/p\u003E\u003Cp\u003E You gain velocity on a slingshot by being bent closer to the travel direction of the body you\\\u0027re slingshotting past, and when moving at 4\u002Bkm/s, even a Munscraping flyby doesn\\\u0027t bend you much.\u003C/p\u003E\n"},{"CreatedByName":"DavidSJ","CreatedById":29904,"CreatedDateTime":"2012-07-17T17:31:07Z","Content":"\n\u003Cp\u003EAh, that is a good point. A burn in LKO buys you far more energy than a Hohmann to Mun and slingshot/burn there.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2012-07-17T18:10:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DavidSJ\u0022 data-cite=\u0022DavidSJ\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003ELow Munar Orbit -\u0026gt; Mun/Minmus transfer orbit\u003C/strong\u003E (assuming orbital plane alignment obviates need for change of inclination)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E294 m/s\u003C/span\u003E (provides 308 m/s in hyperbolic excess velocity, resulting in 850 m/s at periapsis and 217 m/s at apoapsis)\u003C/p\u003E\u003Cp\u003E3d 2h 24m transfer time, launch 90.5 degrees clockwise from Minmus\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is nice to see new members who share my enjoyment of pre-planning missions. Welcome to the forums! Can you provide more details about your planned trajectory? You seem to be using a hyperbolic Munar escape trajectory and then bleeding off the excess later in the flight. Have you tried planning your Munar escape burn using an elliptical trajectory with apoapsis outside the Mun\\\u0027s SOI, instead?\u003C/p\u003E\u003Cp\u003EI \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=15509.msg234766#msg234766\u0022 rel=\u0022external nofollow\u0022\u003Ecalculated\u003C/a\u003E (and later verified with an actual mission) that 185.1 m/s Delta-V was sufficient to transfer from a 50 km circular, prograde orbit about the Mun to a ~100 km orbit about Minmus. Delta-V for a typical plane change manoeuvre would add between 0 and about 30 m/s to that if done correctly, and depending on the timing of the window.\u003C/p\u003E\n"}]}