{"TopicId":118689,"ForumId":32,"TopicTitle":"Hardware discussion about prepare for unity 5","CreatedByName":"royying","CreatedById":20591,"CreatedDateTime":"2015-08-17T16:07:06Z","PageNum":1,"Articles":[{"CreatedByName":"royying","CreatedById":20591,"CreatedDateTime":"2015-08-17T16:07:06Z","Content":"\n\u003Cp\u003EI am considering to buy a retina iMac, which equipped with AMD graphic.\u003C/p\u003E\u003Cp\u003EI know AMD card don\u0027t support physx, does Unity5 further support in physx can boost the performance on AMD card platform? like the multi-core CPU physic calculation?\u003C/p\u003E\u003Cp\u003EAnd do you guys planning to buy/ upgrade your computer for the KSP 1.1 unity5 feature ?\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2015-08-17T16:40:58Z","Content":"\n\u003Cp\u003ENot at this time. Unity doesn\u0027t currently support non-CPU physics calculation at all, and the only GPU acceleration they\u0027re working on in for hair and cloth from what I\u0027ve heard. For that matter, I\u0027m not even certain that we\u0027d gain anything from GPU acceleration of physics calculations in KSP even if it were possible, because the connected rigid body physics simulation that KSP uses hasn\u0027t been parallelized outside of research projects and I don\u0027t think most GPUs would beat CPUs for workloads that can\u0027t be parallelized.\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-08-17T16:42:35Z","Content":"\n\u003Cp\u003EDon\u0027t. The only reason to get an iMac is if you like OSX (Which can, by the way, be installed on a normal PC too). You can build an equally powerful custom rig for half the price.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pcpartpicker.com/p/gPpYGX\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pcpartpicker.com/p/gPpYGX\u003C/a\u003E Here\u0027s a quick example setup (I did this in 5 mins so there may be room for improvements) which will completely wreck a Retina iMac while being nearly 50% cheaper. Just add a keyboard, a mouse and some speakers (or a headset) and you\u0027re good to go. To make it even more kickass, throw in an i7 processor and an R9 390 or a GTX 970 GPU. Heck, you could even get a GTX 980 or an R9 390X and it\u0027d still be cheaper.\u003C/p\u003E\u003Cp\u003EI don\u0027t think I\u0027ll be upgrading for a while. I just got a new GPU a few months ago and the good ol\u0027 2600k is still going strong.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-17T16:58:13Z\u0022 title=\u002208/17/2015 04:58  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 17, 2015\u003C/time\u003E by CaptainKorhonen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SmallFatFetus","CreatedById":137860,"CreatedDateTime":"2015-08-17T16:56:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptainKorhonen\u0022 data-cite=\u0022CaptainKorhonen\u0022\u003E\u003Cdiv\u003EDon\u0027t. The only reason to get an iMac is if you like OSX (Which can, by the way, be installed on a normal PC too)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you sure about that? I\u0027m pretty sure you have to buy Mac-approved components, which are more expensive. A hackintosh is for someone who wants to build and mess with their computer and also wants Mac OS X. You might save a few bucks, but I don\u0027t think that\u0027s the point.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-08-17T16:57:26Z","Content":"\n\u003Cp\u003EYes - by all means feel free to get a better computer, but by all means for the love of Kod don\u0027t buy a Mac!\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-08-17T16:57:34Z","Content":"\n\u003Cp\u003ENot to get into an argument about Macs, but there is no way you can replicate that iMac for half of the price. The very purpose of the retina iMac is for that giant 5K screen. The only standalone 5K screen that I know of is a Dell monitor that costs more than $2000 (more than the base price of the retina iMac; though choosing the base model is kind of insane and the markups for the upgrades are absurd). While the screen you listed has a nice refresh rate it is vastly inferior in every other way.\u003C/p\u003E\u003Cp\u003EAs to the OP, no, the AMD card won\u0027t make any difference for the physics calculations. Neither will an nVidia card. Everything is handled on the CPU. I\u0027m not sure about how well that GPU will handle KSP at 5K, but you can always try running it at a lower resolution in a window, or use scaling.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-17T17:04:50Z\u0022 title=\u002208/17/2015 05:04  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 17, 2015\u003C/time\u003E by DMagic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2015-08-17T17:02:56Z","Content":"\n\u003Cp\u003EDon\u0027t buy a Mac if you plan to play KSP. The OS X version of KSP is even more broken than the Linux or Win version.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/3869\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bugs.kerbalspaceprogram.com/issues/3869\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOn the other hand the GPU isn\u0027t very important for KSP. AMD, nVidia, Intel, it doesn\u0027t really matter, as long as it\u0027s powerful enough. I\u0027d consider the R7 250X as the lower limit to be able to run KSP in Full HD resolution without (GPU related) stuttering.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-17T17:05:00Z\u0022 title=\u002208/17/2015 05:05  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 17, 2015\u003C/time\u003E by soulsource\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-08-17T17:23:58Z","Content":"\n\u003Cp\u003EMACs are a waste of money for a gaming machine. the same money spent on a PC will get you much more performance!\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-08-17T17:48:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SmallFatFetus\u0022 data-cite=\u0022SmallFatFetus\u0022\u003E\u003Cdiv\u003EAre you sure about that? I\u0027m pretty sure you have to buy Mac-approved components, which are more expensive. A hackintosh is for someone who wants to build and mess with their computer and also wants Mac OS X. You might save a few bucks, but I don\u0027t think that\u0027s the point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI recall installing OSX on my ASUS G50V laptop a few years ago and it worked perfectly. Maybe things have changed since then.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003ENot to get into an argument about Macs, but there is no way you can replicate that iMac for half of the price. The very purpose of the retina iMac is for that giant 5K screen. The only standalone 5K screen that I know of is a Dell monitor that costs more than $2000 (more than the base price of the retina iMac). While the screen you listed has a nice refresh rate it is vastly inferior in every other way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course, but I was talking about performance. The iMac will be great for video editing, watching movies and stuff like that, but if OP plans to use it for any kind of gaming or other GPU intensive things then it\u0027s the wrong choice. That mobile M290X is crap, it\u0027s less powerful than a $100 GTX 460 from 2010, I doubt it\u0027d be able to run current gen games even at 1080p. 4K monitors really aren\u0027t too expensive anymore - around $500 to $600 for a mid range one - so if he\u0027s willing to sacrifice some image quality, he\u0027ll be able to build a system that kicks the iMac\u0027s ass and also lasts a lot longer before it needs to be upgraded again, and when it does, he only has to replace individual components, therefore also making it much cheaper in the long run.\u003C/p\u003E\n"},{"CreatedByName":"qromodynmc","CreatedById":87139,"CreatedDateTime":"2015-08-18T10:03:41Z","Content":"\n\u003Cp\u003EGotta ask to OP, Why he is getting mac? Is he some kind of artist or just usual user? If you are casual user, dont waste your money on mac. Even if you are small scale artist, Still go for PC, All adobe and autodesk applications have pc version, They all do same thing. This way you\u0027ll save money for extra accesories for your hobbies.\u003C/p\u003E\u003Cp\u003EAt last, if you are large scale artist, and doing things for money, get mac, you\u0027ll get more money anyway.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-08-18T10:25:31Z","Content":"\n\u003Cp\u003EI feel a need to echo others here... Mac\u0027s are for the following user groups:\u003C/p\u003E\u003Cp\u003E- heavy photoshop/Adobe suite users\u003C/p\u003E\u003Cp\u003E- video editors (maybe?)\u003C/p\u003E\u003Cp\u003E- people who absolutely must have the very highest resolution screen ever (...why?)\u003C/p\u003E\u003Cp\u003E- people who don\u0027t know \u003Cem\u003Ewhy \u003C/em\u003Ethey want a Mac, they just \u003Cem\u003Ewant\u003C/em\u003E one and don\u0027t want to hear the reasons not to \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf the OP is outside all of these, he will invariably find a better gaming spec available for a lower price by getting a standard Windows PC, like the rest of the world. It\u0027ll also be upgradeable in future, which the Mac likely won\u0027t.\u003C/p\u003E\u003Cp\u003EOn the original question; no, my overclocked i5 quad core with nVidia 760 and 32gb of RAM will do just fine for Unity 5. The limiting factor to me is single threaded physics (not changing, sadly) and the memory leak/crash at ~3.4gb. The latter might, if we\u0027re lucky, go away, leaving us with fancy environmental shinies, and exactly the same part limit before lag claims our vessels.\u003C/p\u003E\n"},{"CreatedByName":"keeper","CreatedById":124530,"CreatedDateTime":"2015-08-18T12:19:34Z","Content":"\n\u003Cp\u003EI long for the day when we can rack up the part counts. \u003C/p\u003E\u003Cp\u003EI probably have the worst CPU for the job AMD fx 8350 8 cores, when I hit KSP it clocks itself at 4.2ghz, one or two of the cores get busy and my graphics card starts steaming. \u003C/p\u003E\u003Cp\u003EMy plan is that unity 5 will work with my crap hardware better. so hopefully can consider not upgrading\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-08-18T15:21:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EI feel a need to echo others here... Mac\u0027s are for the following user groups:\u003Cp\u003E- heavy photoshop/Adobe suite users\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot even that - the Adobe suite for PC is exactly the same. The only difference is Apple designed software. Which, IIRC, it\u0027s Final Cut Pro X and some audio editor.\u003C/p\u003E\u003Cp\u003EOther than that, it\u0027s \u0022Ohhh, I have a Mac\u0022\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-08-18T15:38:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003ENot at this time. Unity doesn\u0027t currently support non-CPU physics calculation at all, and the only GPU acceleration they\u0027re working on in for hair and cloth from what I\u0027ve heard. For that matter, I\u0027m not even certain that we\u0027d gain anything from GPU acceleration of physics calculations in KSP even if it were possible, because the connected rigid body physics simulation that KSP uses hasn\u0027t been parallelized outside of research projects and I don\u0027t think most GPUs would beat CPUs for workloads that can\u0027t be parallelized.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHair and cloth is the only real hardware PhysX acceleration there is at the moment. If they do that, it will be full support. I think Unity said they planned to add it in a later U5 build, but that doesn\u0027t mean KSP will do anything with it. What would it really get us? Waving flags on atmospheric bodies?\u003C/p\u003E\u003Cp\u003EKeep in mind that physics calculations done on the GPU can only be output to video. It\u0027s a post processing render. Physics like craft interaction (read: crashing) in KSP are not output directly to video and can not be done on the GPU at all. There would be no point in sending the data to the GPU only to have it sent back to the CPU. In the case of something like hair, it\u0027s physical properties are irrelevant to hitboxes. Nothing has to interact with it, so the GPU can handle that and the CPU doesn\u0027t really need to know about it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-18T15:48:21Z\u0022 title=\u002208/18/2015 03:48  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 18, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-08-18T15:48:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022royying\u0022 data-cite=\u0022royying\u0022\u003E\u003Cdiv\u003EI am considering to buy a retina iMac, which equipped with AMD graphic.\u003Cp\u003EI know AMD card don\u0027t support physx, does Unity5 further support in physx can boost the performance on AMD card platform? like the multi-core CPU physic calculation?\u003C/p\u003E\u003Cp\u003EAnd do you guys planning to buy/ upgrade your computer for the KSP 1.1 unity5 feature ?\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERegardless of your choice of computer vendor:\u003C/p\u003E\u003Cp\u003E- Unity uses the PhysX library (that is, a predefined set of mathematical formulas) as its physics engine.\u003C/p\u003E\u003Cp\u003E- Unity simulates physics using the PhysX library running on the CPU, not on the video card.\u003C/p\u003E\u003Cp\u003E- Therefore, physics performance in KSP is completely unrelated to your (or your preferred vendor\u0027s) choice of video card model or manufacturer.\u003C/p\u003E\u003Cp\u003EThis is true right now, and it is true for Unity 5.\u003C/p\u003E\u003Cp\u003EYou do not have to pay attention to the manufacturer of the video card in whatever computer you end up buying in order to enjoy KSP.\u003C/p\u003E\u003Cp\u003E(But, as others have rightly pointed out, the Mac version of KSP does not work as well as the other versions do.)\u003C/p\u003E\u003Cp\u003EAnd no - being in possession of an overclocked desktop Haswell quadcore and 16 GB RAM, I do not plan to upgrade my computer for KSP 1.1 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"royying","CreatedById":20591,"CreatedDateTime":"2015-08-18T18:19:36Z","Content":"\n\u003Cp\u003EI\u0027ve using MBA for several years, OSX gave me a great experience, so I considering to buy a iMAC.\u003C/p\u003E\u003Cp\u003EAnd I think it is not fair to compare the mac and DIY PC just by the price sum of the hardware.\u003C/p\u003E\u003Cp\u003EThe OS and the support also cost money.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-18T18:21:55Z","Content":"\n\u003Cp\u003EI heard Unity 4 had a problem with multicore processors (or multithreaded cores) not sure. \u003C/p\u003E\u003Cp\u003EDoes Unity5 work better with multicore processors than single core processors?\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-08-18T18:32:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EI heard Unity 4 had a problem with multicore processors (or multithreaded cores) not sure. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt didn\u0027t have a problem, it just didn\u0027t support them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EDoes Unity5 work better with multicore processors than single core processors?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, probably Unity 5\u0027s biggest improvement will be the ability to use all your cores.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2015-08-18T18:35:45Z","Content":"\n\u003Cp\u003Eah, the OS wars have hit the KSP forums again...\u003C/p\u003E\u003Cp\u003EMyself? I run several computers, both Windows (all Win10 by now) and a Mac. The Mac\u0027s a Macbook Air I got because I had a requirement for a small, lightweight, sturdy, laptop with a very long battery life and there was no Windows machine that can match all 3 of those (though the new Surface 3 Pro comes close, it also costs about the same and wasn\u0027t available when I bought the Mac).\u003C/p\u003E\u003Cp\u003EAlso, were I to select a new computer for my father today I\u0027d likely choose a Mac for him simply because he already has an iPad and the two integrate well, plus he\u0027s nearly computer illiterate and a Mac can be easier to use for those people.\u003C/p\u003E\n"},{"CreatedByName":"nalfz","CreatedById":145025,"CreatedDateTime":"2015-08-19T12:48:18Z","Content":"\n\u003Cp\u003EPreparing for unity 5? I wouldn\u0027t hold your breath if I were you\u003C/p\u003E\u003Cp\u003EI mean I hope I\u0027m wrong but it seems to be going at snails\u0027 pace\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-19T13:01:10Z","Content":"\n\u003Cp\u003EThe general speculation - but it is only speculation - is that Unity 5 will bring one thread per vessel, and that single vessels will still be limited by your processor\u0027s single-core performance. Therefore the ideal CPU for KSP remains the same as now - a modern fast-clocked Intel CPU.\u003C/p\u003E\u003Cp\u003EFor the GPU KSP wants something competent but it doesn\u0027t need massive performance. A GT 610, which is a weak display card that\u0027s worse than good integrated graphics, clearly underperformed. A GTX 750 Ti, which is a great budget gaming card, does well. That said gaming at higher resolutions will always be demanding.\u003C/p\u003E\u003Cp\u003EFor RAM, expect the stock game to continue being happy with 4 GB. But if you want to play modded and run a 64-bit build of KSP then 8 GB is probably better. There\u0027s already a 64-bit KSP for Linux, KSP 1.1 might or might not bring it for Windows and/or OSX.\u003C/p\u003E\u003Cp\u003EFor the monitor, bear in mind KSP currently has poor user-interface scaling. We\u0027ve no idea if that will change, but don\u0027t be surprised if you have to drop down to 1080p or thereabouts for the game wasting your \u0022Retina\u0022 display.\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-08-19T14:04:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022royying\u0022 data-cite=\u0022royying\u0022\u003E\u003Cdiv\u003EI\u0027ve using MBA for several years, OSX gave me a great experience, so I considering to buy a iMAC.\u003Cp\u003EAnd I think it is not fair to compare the mac and DIY PC just by the price sum of the hardware.\u003C/p\u003E\u003Cp\u003EThe OS and the support also cost money.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, but I just can\u0027t agree with this. If you check the setup I posted (PCPartPicker link), you\u0027ll see that it already includes an OS (Windows 10 Home 64-bit). Ubuntu and Linux Mint are also good OS choices if you want a free one.\u003C/p\u003E\u003Cp\u003EAs for support - I\u0027m assuming you mean technical support provided by the manufacturer, and you really don\u0027t need that unless you\u0027re a total noob with computers. You can find solutions to most problems with a bit of googling. This also applies to OSX so you\u0027ll be wasting money by calling tech support every time you have a problem.\u003C/p\u003E\u003Cp\u003EBut, hey, it\u0027s your money, who am I to tell you what you should do with it.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-19T14:28:31Z","Content":"\n\u003Cp\u003EI knew I forgot something.\u003C/p\u003E\u003Cp\u003EFor the Operating System, currently Linux is best for KSP provided you have well-supported hardware. Windows is the most commonly used OS and you can expect it to be what Squad test the most on, and if it gets a stable 64-bit version of KSP it will probably become the preferred option for existing Windows users. OSX is the worst for KSP.\u003C/p\u003E\u003Cp\u003EBut if you want to run OSX for other reasons, your only hassle-free option is to buy a Mac. That\u0027s the way it is.\u003C/p\u003E\n"},{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2015-08-19T19:36:53Z","Content":"\n\u003Cp\u003EWhat about a Mac with SSD drive?\u003C/p\u003E\u003Cp\u003EI got an 5 years old iMac 27 with 24go Ram, 1 Gb video card, no ssd drive, and it runs pretty good KSP. Sometimes the game quit or i make it quit because it does not seems to work (turning wheel...) but it\u0027s always when trying to return to space center or to leave space center towards ship. So I start it again and it starts where i leave...it\u0027s never a problem of RAM as i got plenty of RAM, i think it\u0027s a problem with Unity which work with limited RAM....\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-08-19T19:59:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nalfz\u0022 data-cite=\u0022nalfz\u0022\u003E\u003Cdiv\u003EPreparing for unity 5? I wouldn\u0027t hold your breath if I were you\u003Cp\u003EI mean I hope I\u0027m wrong but it seems to be going at snails\u0027 pace\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow so? It was just released and the port is coming in the next version. The only way to be faster than that was to have ported to the beta version.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EThe general speculation - but it is only speculation - is that Unity 5 will bring one thread per vessel, and that single vessels will still be limited by your processor\u0027s single-core performance. Therefore the ideal CPU for KSP remains the same as now - a modern fast-clocked Intel CPU.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAllow me to end that speculation right now. That isn\u0027t how programming works. There is no way to specify in game terms (i.e. one ship) what a thread is comprised of so you will just have to take my word for it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EFor RAM, expect the stock game to continue being happy with 4 GB. But if you want to play modded and run a 64-bit build of KSP then 8 GB is probably better. There\u0027s already a 64-bit KSP for Linux, KSP 1.1 might or might not bring it for Windows and/or OSX.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would almost say 16 for mods now. I have 8GB on Windows 10 and my whole computer starts running out of RAM even with the 4GB cap for the game. Mostly because I have various other things open on my second monitor.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EFor the monitor, bear in mind KSP currently has poor user-interface scaling. We\u0027ve no idea if that will change, but don\u0027t be surprised if you have to drop down to 1080p or thereabouts for the game wasting your \u0022Retina\u0022 display.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat is poor about it? It scales fairly well, it might get a little stretched on a retina display but it\u0027s the ship and the solar system you really want to look good.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gilflo\u0022 data-cite=\u0022gilflo\u0022\u003E\u003Cdiv\u003EWhat about a Mac with SSD drive?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESSD drives shorten load times (including the OS booting), but that is about it. It is up to you whether that is important or not.\u003C/p\u003E\n"}]}