{"TopicId":119209,"ForumId":32,"TopicTitle":"A question about the Sentinel and the Asteroid Day Mod","CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-08-24T01:50:05Z","PageNum":1,"Articles":[{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-08-24T01:50:05Z","Content":"\n\u003Cp\u003EHey, you know the Sentinel from the mod, well, I wonder if multiple sentinels on the same craft will act like separete Sentinels, making detection quicker, or if I need to make a mothership to dispense these little buggers.\u003C/p\u003E\u003Cp\u003EOh and, how do you get that thing to between Moho and Sun without spending the entire observable universe in fuel?\u003C/p\u003E\n"},{"CreatedByName":"NightOwl07","CreatedById":132117,"CreatedDateTime":"2015-08-24T01:57:01Z","Content":"\n\u003Cp\u003ESorry I don\u0027t know about multiple sentinels, the impression I got is that it doesn\u0027t matter how many you have. \u003C/p\u003E\u003Cp\u003EThe only time I got that close ot the sun is an insane contract requiring me to put a satellite in low and highly inclined orbit around the sun. I did it with ion engines, it\u0027s tricky but Eve aerobraking or sling shot might be another option if you can set it up.\u003C/p\u003E\n"},{"CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-08-24T02:21:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003EOh and, how do you get that thing to between Moho and Sun without spending the entire observable universe in fuel?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIon \u0022Dawn\u0022 engine or assorted similar modded engines (low TWR high ISP). Not like burn times matter for a Kerbol orbit and a lifter capable of sending, say, a Duna lander, will give you almost the observable universe in dV when most of that mass is xenon instead of a lander.\u003C/p\u003E\n"}]}