{"TopicId":120078,"ForumId":32,"TopicTitle":"Craft File Parser?","CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-03T21:04:00Z","PageNum":1,"Articles":[{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-03T21:04:00Z","Content":"\n\u003Cp\u003EThis isn\u0027t a game play question or a plug in problem, so fingers crossed today I am finally posting in the correct place. Not placing any bets.\u003C/p\u003E\u003Cp\u003EShort explanation - I need a parser program that will check the integrity of a craft file and show me where things go awry. \u003C/p\u003E\u003Cp\u003ELong version - I went to load my Mun Base craft to work on it some more, but the menu said it now contained an invalid part. It worked fine yesterday. I looked to see if the part was available in the part tabs and it was not. I had trouble with this part once before. Early on it had an extra } at the end of the file that I had to fix. I opened the cfg to check today and it was fine. I made no changes. Loaded KSP again and the previously questioned part is now available. The Mun Base craft opened in the hangar, except several later added items are not there. Closed KSP, opened the craft file, and I can see the parts towards the bottom of the file. The craft file is long and will be a bear to try and spot an error - especially for someone with very little experience. I need some way to automate the process. \u003C/p\u003E\u003Cp\u003EHelp?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-09-03T21:15:20Z","Content":"\n\u003Cp\u003EHmmm, this may be best in addon requests, but I think something like this did exist, it was a part of some tools years ago so I don\u0027t know if it will still help.\u003C/p\u003E\u003Cp\u003EI can\u0027t remember what it was called though.\u003C/p\u003E\n"},{"CreatedByName":"Captain H@dock","CreatedById":139017,"CreatedDateTime":"2015-09-04T08:03:00Z","Content":"\n\u003Cp\u003EI made a lua tool for parsing standalone .craft file, but i\u0027m assuming the craft part of the save file structure would be the same.\u003C/p\u003E\u003Cp\u003EWhile my tool isn\u0027t made for error checking (it\u0027s for swapping equivalent parts: mk2 short fuselage -\u0026gt; mk2 crew compartement. it allows me to do build transport, cargo and tanker variants of my spaceplanes very easily), It would probably be able to raise any simple error (ie. file syntax error)\u003C/p\u003E\u003Cp\u003EContact me if you haven\u0027t found anything better in a couple of days, and if command line invocation of such a tool isn\u0027t scaring you.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-09-04T09:04:04Z","Content":"\n\u003Cp\u003EI wanted to do something like that. A generic file editor with some plugins to create dedicated features, such as removing parts.\u003C/p\u003E\u003Cp\u003EBut sadly, I\u0027ve not enough time to develop anymore.\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2015-09-04T10:05:26Z","Content":"\n\u003Cp\u003ETry to check file integrety on steam, sometimes files get renamede.\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-09-04T12:47:19Z","Content":"\n\u003Cp\u003EA much better solution would be to fix what ever the hell is causing parts to disappear.. \u003C/p\u003E\u003Cp\u003E Are you using mods? If not it could be a problem with your hard drive.\u003C/p\u003E\n"},{"CreatedByName":"EladDv","CreatedById":118368,"CreatedDateTime":"2015-09-04T13:24:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majorjim\u0022 data-cite=\u0022Majorjim\u0022\u003E\u003Cdiv\u003EA much better solution would be to fix what ever the hell is causing parts to disappear.. \u003Cp\u003E Are you using mods? If not it could be a problem with your hard drive.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei dont know- from his descriptions it seems to get extra parts and bit on the craft file each time he loads so i think it\u0027s a KSP originating problem\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-09-04T13:34:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EladDv\u0022 data-cite=\u0022EladDv\u0022\u003E\u003Cdiv\u003Ei dont know- from his descriptions it seems to get extra parts and bit on the craft file each time he loads so i think it\u0027s a KSP originating problem\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA re-install would fix this though. If not its a hardware issue. Even with the program he requested he will, at some point, have to address the cause of the issue.\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2015-09-04T13:43:06Z","Content":"\n\u003Cp\u003EIf my corporate *%$ proxy didn\u0027t suck for one day of the year at least, I would find that Hyperedit post... The hyperedit official has a link to download that takes you to a page that has, as far as I remember, other tools. One of them is a craft... hmm... parser, merger, fixer? Don\u0027t remember right now, but you might want to check that.\u003C/p\u003E\n"},{"CreatedByName":"Ignath","CreatedById":77210,"CreatedDateTime":"2015-09-04T13:54:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rosco P. Coltrane\u0022 data-cite=\u0022Rosco P. Coltrane\u0022\u003E\u003Cdiv\u003EIf my corporate *%$ proxy didn\u0027t suck for one day of the year at least, I would find that Hyperedit post... The hyperedit official has a link to download that takes you to a page that has, as far as I remember, other tools. One of them is a craft... hmm... parser, merger, fixer? Don\u0027t remember right now, but you might want to check that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the link you\u0027re looking for is here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.kerbaltek.com/craftkitchen\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbaltek.com/craftkitchen\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAt the bottom of Kerbaltek (guys who maintain Hyperedit) Craft Kitchen there is a link to a Craft Fixer, but it\u0027s a pre-0.90 version (really old).\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-09-04T14:57:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ignath\u0022 data-cite=\u0022Ignath\u0022\u003E\u003Cdiv\u003Ethere is a link to a Craft Fixer, but it\u0027s a pre-0.90 version (really old).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe craft file format hasn\u0027t changed like, at all. Chances are it\u0027ll still work.\u003C/p\u003E\n"},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-04T18:43:45Z","Content":"\n\u003Cp\u003EThanks all. I will check out craftkitchen. Today I removed the only mod I think might be messing with my parts (texture replacer), and I have rebuilt the base from scratch. I just finished and am taking a break but will see if that helped. I don\u0027t think it is a KSP problem. I am not even sure it is a cfg problem. I\u0027ve counted the } to make sure I have one left for each right. Even if the nodes are backwards the parts should be there to use. Grasping at straws but is there any chance the mu file of very old parts can glitch? I don\u0027t have any idea how to open or recompile them if it is a problem.\u003C/p\u003E\n"},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-04T19:20:38Z","Content":"\n\u003Cp\u003EWell, removing texture replacer and rebuilding the base did not help But I see this in the cfg:\u003C/p\u003E\u003Cp\u003E MODEL\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E model = z_thing/Parts/Structural/Crosswalk/TypeB_S\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003Erevised for 1.04, should this maybe read?:\u003C/p\u003E\u003Cp\u003E MODEL\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E model = GameData/z_thing/Parts/Structural/Crosswalk/TypeB_S\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003EWhat language are the cfg written in and how can I learn how they work?\u003C/p\u003E\u003Cp\u003ETotally grasping at straws. Thanks for the help.\u003C/p\u003E\n"},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-04T20:33:58Z","Content":"\n\u003Cp\u003EAt the bottom of the craftkitchen page is a repair craft option. I uploaded my base file and there were no errors found. Next I removed my part files for the crosswalk and went to Chaosratt\u0027s updated z_thing page and grabbed the revised crosswalk parts. My existing base loaded fine, but wait, there\u0027s more. I Built a simple craft. Saved. Exited completely out of KSP. On return the part is gone. Neither the new craft nor the old base can be loaded. Pretty sure now it is not me.\u003C/p\u003E\n"}]}