{"TopicId":120458,"ForumId":32,"TopicTitle":"What are you doing until 1.1?","CreatedByName":"Kyrt Malthorn","CreatedById":149101,"CreatedDateTime":"2015-09-08T21:05:23Z","PageNum":4,"Articles":[{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-14T09:49:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AndyMt\u0022 data-cite=\u0022AndyMt\u0022\u003E\u003Cdiv\u003EI started a stock career 1 week ago. No mods except Kerbal Engineer for TWR and dV readings. -snip-\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou should also get Precise Node as the maneuver node system is a bit too simplified at times. You\u0027d be surprised by the amount of awesome gravity assists you can pull with them; like placing yourself on a polar orbit using the Mun.\u003C/p\u003E\u003Cp\u003EOh and get Trajectories.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-09-14T09:55:06Z","Content":"\n\u003Cp\u003EI\u0027m just chilling around the Kerbin. Experimenting with various configurations of mining ships, interplanetary tugs and research bases. Also exploring asteroids stumbling into the system.\u003C/p\u003E\n"},{"CreatedByName":"AndyMt","CreatedById":123144,"CreatedDateTime":"2015-09-14T09:55:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003EYou should also get Precise Node as the maneuver node system is a bit too simplified at times. You\u0027d be surprised by the amount of awesome gravity assists you can pull with them; like placing yourself on a polar orbit using the Mun.\u003Cp\u003EOh and get Trajectories.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI know these. But I don\u0027t expect them to work for a while in 1.1. Especially \u0022Precise Node\u0022 as they redo the patched conics and orbital displays. Same for Trajectories - whichs latest version wasn\u0027t very accurate anyway. So I try to do everything in stock. But if Kerbal Engineer won\u0027t work, then I\u0027ll probably have to wait anyway. I\u0027m just too lazy to calculate TWR and dV myself.\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-09-14T10:34:42Z","Content":"\n\u003Cp\u003EWrapping up projects I still have active - in particular Duna Mission. It will be impossible to finish once the antennarange features are activated.\u003C/p\u003E\u003Cp\u003EI\u0027m tempted to develop a vehicle and start Elcano challenge in submersible mode - equatorial through bottoms of the oceans.\u003C/p\u003E\u003Cp\u003EI\u0027m still stuck with developing the return vehicle from my \u0022Purple Submarine\u0022 mission. I mean I can reach orbit, I can get the kerbal on board but I can\u0027t get the SCIENCE on board!\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-09-14T10:39:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EWhat am I doing in KSP until 1.1? As little as possible! For now I\u0027m done with this piece of faecal matter.\u003Cp\u003EI quit KSP about two weeks ago as it has too many bugs and is just too unstable to play with even with only a moderate amount of mods. I\u0027m not even flying ships, just building things in the VAB/SPH is apparently enough to cause fatal crashes. No warning at all, just a single mouse click or key press too many and POOF! desktop.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0060m wondering if you have an NVidia graphics card. I\u0060m starting to suspect something going on with the drivers for NVidia, KSP (specifically the VAB) and Unity...\u003C/p\u003E\n"},{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-09-14T11:27:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Theysen\u0022 data-cite=\u0022Theysen\u0022\u003E\u003Cdiv\u003EWell I\u0027m sorry to hear that. But I think it\u0027s more of an issue with your pc ? I\u0027m on an average laptop and everything works as it should.\u003Cp\u003EWhat are your specs?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a HORRIBLE laptop and that is not a problem\u003C/p\u003E\n"},{"CreatedByName":"CaptainApollo","CreatedById":145000,"CreatedDateTime":"2015-09-14T16:24:08Z","Content":"\n\u003Cp\u003EI am progressing on my primary career mode profile.\u003C/p\u003E\n"},{"CreatedByName":"MaxwellsDemon","CreatedById":147660,"CreatedDateTime":"2015-09-14T20:37:06Z","Content":"\n\u003Cp\u003EPlugging away with 1.04 when I can. I don\u0027t get enough free time to play it in order to get tired of it! My primary problem is concentrating on \u0022work\u0022 when my brain is thinking about a design for a Duna rover...\u003C/p\u003E\n"},{"CreatedByName":"Dirty Bob","CreatedById":59885,"CreatedDateTime":"2015-09-14T22:43:19Z","Content":"\n\u003Cp\u003EI\u0027m woodworking until it comes out. I can\u0027t get Linux to boot right with this RAID setup for some reason. I\u0027ve tried and I just can\u0027t enjoy going back to the limits of 32-bit in the game. \u003C/p\u003E\u003Cp\u003EI have been feeling the bug though and decided I\u0027m going to try a Kerbal pyrography piece. I\u0027m just trying to find the right image that will work in monochrome and be within my ability.\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2015-09-15T23:08:27Z","Content":"\n\u003Cp\u003EI\u0027m spending the time with a few other early-access games I have: Planet Explorers, Subnautica, and most recently, The Long Dark. But I\u0027m definitely looking forward to 1.1, and check here daily to see if it\u0027s out yet.\u003C/p\u003E\u003Cp\u003ERover wheels have given me tons of headaches over the years, so I\u0027m eager to see the new wheel system. And single-threaded physics were practically a crime in a game like KSP (and totally not Squad\u0027s fault).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EPlaying Factorio. When 1.1 comes out I\u0027ll probably play more Factorio, or something else. Once 1.1 has been updated to 1.14 or 1.15, i will then download it and check it out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENever heard of it...but you got me downloading the demo so I hope they appreciate you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"strigon","CreatedById":123021,"CreatedDateTime":"2015-09-16T02:07:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beowolf\u0022 data-cite=\u0022Beowolf\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENever heard of it...but you got me downloading the demo so I hope they appreciate you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame here; the name intrigued me, so I downloaded the demo, and now I\u0027ve bought the game!\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-09-16T02:27:19Z","Content":"\n\u003Ca href=\u0022https://i.imgur.com/XkoeieW.jpg\u0022 rel=\u0022external nofollow\u0022\u003EBuilding starships.\u003C/a\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-09-16T14:29:57Z","Content":"\n\u003Cp\u003EMy much-neglected 1.04 career save. That\u0027s what I did prior to 0.9.0 too. About to do my first interplanetary mission (in this save) - an unmanned Eve probe. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2015-09-16T23:09:19Z","Content":"\n\u003Cp\u003EI\u0027m playing the Dark Multiplayer mod with a friend. Career mode is not doing it for me, so I\u0027m hoping 1.1 improves it a bit. Until then, we\u0027re putting together a Minmus ISRU operation jointly. I\u0027m designing the fuel truck and landing crane, and my friend is designing the prospecting satellite, mining rig, and fuel taxi.\u003C/p\u003E\u003Cp\u003EI\u0027ll probably design the orbital fuel depot and refueling tanker.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xacktar\u0022 data-cite=\u0022Xacktar\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://i.imgur.com/XkoeieW.jpg\u0022 rel=\u0022external nofollow\u0022\u003EBuilding starships.\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice starships \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"davidy12","CreatedById":143411,"CreatedDateTime":"2015-09-17T15:32:59Z","Content":"\n\u003Cp\u003EEngaging in my college career, playing 1.04, and socializing with friends and family. What else?\u003C/p\u003E\n"},{"CreatedByName":"marcello639","CreatedById":144435,"CreatedDateTime":"2015-09-17T16:33:24Z","Content":"\n\u003Cp\u003ETrying out Realism overhaul. Practising remote tech... preparing for 1.1.\u003C/p\u003E\n"},{"CreatedByName":"Rakshasa","CreatedById":75497,"CreatedDateTime":"2015-09-17T17:05:38Z","Content":"\n\u003Cp\u003EPlaying ED until KSP gets OSX unity engine that can properly detect my X-55 hotas controllers separately.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2015-09-17T19:21:18Z","Content":"\n\u003Cp\u003ENot playing KSP and hoping 1.1 will get me interested again\u003C/p\u003E\n"},{"CreatedByName":"Peder","CreatedById":57860,"CreatedDateTime":"2015-09-17T19:37:04Z","Content":"\n\u003Cp\u003EIn desperation while waiting for 1.1 I read the forum several times every day both on steam but also here on the official ksp forum. I want to play but no reason to play since I want to create a new career when the 1.1 become avaliable.\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2015-09-17T19:54:11Z","Content":"\n\u003Cp\u003EEngineering bulletproof rovers in my 0.25 save.\u003C/p\u003E\u003Cp\u003EI\u0027ll probably go for 6.4x when 1.1 drops.\u003C/p\u003E\u003Cp\u003EHoping Editor Extensions will once again have a toggle for Vertical Snap. That\u0027s the one of the many reasons I\u0027m just not interested in 1.x\u003C/p\u003E\n"},{"CreatedByName":"Kuansenhama","CreatedById":114023,"CreatedDateTime":"2015-09-17T20:09:29Z","Content":"\n\u003Cp\u003EMostly doing college work and working out. Maybe hop on and do a few contracts in career. I\u0027ll see what happens, but the physics improvements in 1.1 (from what I\u0027ve heard) are going to improve part count and rover wheels. I just hope that the physics change doesn\u0027t cause TOO many problems for mod makers.\u003C/p\u003E\n"},{"CreatedByName":"Dingbat1967","CreatedById":75953,"CreatedDateTime":"2015-09-18T04:36:26Z","Content":"\n\u003Cp\u003EI\u0027m still playing 0.25 -- I have a particular set of mods that are particularly stable including EVE and Astronomer\u0027s pack and even with all the stuff in it, it consumes less RAM overall than a similarly configured 1.04 version. Really, between 0.25 and 1.04, there really isn\u0027t that much that is revolutionary enough to make me switch and whatever was added in KSP 1.04 was already covered by mods previously. Really, I\u0027m waiting for Squad to finally come out with a version I\u0027m willing to invest redoing all my save games and starting over without going through the mod reinstall routine again.\u003C/p\u003E\n"},{"CreatedByName":"The Science Bucket","CreatedById":141289,"CreatedDateTime":"2015-09-18T14:49:43Z","Content":"\n\u003Cp\u003ESaving for a new stick of RAM, I\u0027ve only got 4GB now.\u003C/p\u003E\n"},{"CreatedByName":"MassoudGL","CreatedById":143332,"CreatedDateTime":"2015-10-14T03:23:22Z","Content":"\n\u003Cp\u003EI am trying really really really really hard not to play KErbal. I have big enough ships now that my cpu lags when I try to do major stuff. Planning to colonize Laythe. \u003C/p\u003E\u003Cp\u003EI vowed to myself that I wouldn\u0027t touch the game until 1.1\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-10-14T03:28:54Z","Content":"\n\u003Cp\u003EI bought Europa Universalis 4 when it was on sale last weekend, or maybe the weekend before, and have been playing that when I have the time. I am also waiting for the next Dwarf Fortress update, and hope that 1.1 and the new DF update do not happen at the same time.\u003C/p\u003E\n"}]}