{"TopicId":121171,"ForumId":32,"TopicTitle":"What are your extra-planetary logistics?","CreatedByName":"Rocket Farmer","CreatedById":71519,"CreatedDateTime":"2015-09-18T15:55:10Z","PageNum":1,"Articles":[{"CreatedByName":"Rocket Farmer","CreatedById":71519,"CreatedDateTime":"2015-09-18T15:55:10Z","Content":"\n\u003Cp\u003ESo I typically like to build my extra planetary ship in no more than 3 launches and assemble in space. As I get deeper into career my ships also get larger (100 tonne\u002B). I also like to \u0022do it all\u0022 in one swing.\u003C/p\u003E\u003Cp\u003EIn going to Duna I will launch with \u003C/p\u003E\u003Cp\u003E1. My main extra-planetary booster. This will push everything out and the return vessel back plus serve as a fuel wagon for multiple landings of my lander. I aim to make these reusable for the next mission as well.\u003C/p\u003E\u003Cp\u003E2. The primary lander. This will have enough DV to land and re-orbit/ dock with my booster. In Dunas case It will also have an rover that is dropped on the first trip down (usually cradled under the legs and separately jettisoned and parachuted down while in atmosphere). As well a separate extra detachable tank that will mostly stay with the main ship unless I am going to the moon at which point it will be used to boost range and then returned to the main ship.\u003C/p\u003E\u003Cp\u003E3. 2 satellites (with science and resource trackers!) that I will orbit around the poles of Duna and its moon. Thee are really small units.\u003C/p\u003E\u003Cp\u003E4. A detachable space station. This will include the science lab, will have the lander left docked to it and will have decent tanks for both fuel and mono. Any excess fuel/mono not needed to return to Kerbal will be left as well for future missions. If I am leaving it manned I also leave a return vehicle behind.\u003C/p\u003E\u003Cp\u003E5. A outbound and return vessel. This will typically be rigged for direct kerbin re-entery although recently I have also tinkered with integrating this into the main booster package and then rendezvous with a deorbitor in LKO so as not to carry the heavier weight too and from Duna/etc.\u003C/p\u003E\u003Cp\u003E6. I also sometimes land a station on the ground as well and these I typically leave manned but again with a way for the Kerbals to get home.\u003C/p\u003E\u003Cp\u003EWhat does everybody else do?\u003C/p\u003E\n"}]}