{"TopicId":122649,"ForumId":32,"TopicTitle":"What if KSP were to reach 2.0? What would happen?","CreatedByName":"Sanguine","CreatedById":114962,"CreatedDateTime":"2015-10-09T07:00:21Z","PageNum":1,"Articles":[{"CreatedByName":"Sanguine","CreatedById":114962,"CreatedDateTime":"2015-10-09T07:00:21Z","Content":"\n\u003Cp\u003EA question that generally bugs me during long burns is what would happen if KSP continually developed to 2.0? Would this justify the creation of an entirely new KSP from the ground up, in some sort of fantastical superengine, or would the original KSP simply continue to get upgraded? Both routes pose pros and cons. On the one hand, creating an entirely new game means that Squad can erase any ancient mistakes that were in the old game - the first release of KSP 2.0 could in fact be less buggy and more stable than KSP 1.0 because of experience. Also, with an entirely new game, comes more streamlined coding and probably a far better engine, which would allow whackjobian creations to be built while not completely destroying your computer - and whackjob could create even larger designs. The base game itself would also benefit greatly, with new approaches to rocket design - imagine having everything be procedural, where engines could be tweaked for different fuels, bell shapes, designs and structural strength. On the other hand, any development on the original KSP would stop, and the creation of an entirely new game would take an insanely long time. \u003C/p\u003E\u003Cp\u003EWhat are your thoughts should KSP ever advance that fart?\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-10-09T07:31:10Z","Content":"\n\u003Cp\u003EI think you mean \u0027far\u0027. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut seriously, I wouldn\u0027t lose too much sleep over it. Yes, KSP would be thrown on the scrapheap and KSP2 would be the new game... just like every videogame sequel ever. Videogames are not in a stagnant environment, computer capabilities have grown rapidly over the past 2 or 3 decades (or more) and although microprocessing power is reaching it\u0027s physical limits, game programming, compiling and development in general is still rapidly evolving.\u003C/p\u003E\u003Cp\u003ESo, as perfect a game as KSP is right now, in 20 years you\u0027ll either be glad that Squad left it behind because KSP2 is so much better, or you\u0027ll be miserable that they didn\u0027t make KSP2 at all. Sooner or later the engine that KSP is built on will just go out of date, and something else that\u0027s faster and more diverse will take its place.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2015-10-09T07:35:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sanguine\u0022 data-cite=\u0022Sanguine\u0022\u003E\u003Cdiv\u003EWhat are your thoughts should KSP ever advance that fart?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI feel that would be better as an addition to Chatterer.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2015-10-09T07:44:03Z","Content":"\n\u003Cp\u003EI do not believe KSP 2.0. It would need hard decisions what would be ideas of new game. There should be much more activities on planets, much more complicated planets etc. Such things are very laborious to program. It would be very expensive project and need much larger development crew than SQUAD have. On the other hand, spaceflights are not very popular stuff. Would it be possible to achieve many times more buyers? Developing of the game is business and must product money to SQUAD. Own gaming engine is not realistic at all. Just a good engine would need much more work hours than whole KSP has taken so far.\u003C/p\u003E\u003Cp\u003EI think that only possibility to get KSP 2.0 is that some larger gaming company buy rights and dev team from SQUAD. Unfortunately such a company would not respect to KSP\u0027s basic idea and it would destroy the game. We would lose gravity and celestial mechanics and transitions between planets would be like military flight sims. Fighting against enemies and avoiding asteroid swarms and \u0022black holes\u0022 with flight dynamics of arcade plane game. No thanks for me. Modding can be poor man\u0027s \u00222.0\u0022 and bring many new and interesting dimensions to KSP.\u003C/p\u003E\n"},{"CreatedByName":"_stilgar_","CreatedById":147818,"CreatedDateTime":"2015-10-09T07:59:58Z","Content":"\n\u003Cp\u003EWhat does \u00222.0\u0022 mean? If it\u0027s just a version number, then I think we\u0027ll get it in a year or two, maybe with an expansion or something. \u003C/p\u003E\u003Cp\u003EIF you mean KSP 2, a new game... I\u0027m not sure I want that. KSP is great game, just add more features to it and improve performance and we\u0027ll have tons of fun for years. \u003C/p\u003E\u003Cp\u003EAnd that version number and game number are not the same thing... see Paradox Games for example:\u003C/p\u003E\u003Cp\u003EEuropa Universalis 3 5.2\u003C/p\u003E\u003Cp\u003EEuropa Universalis 4 1.13\u003C/p\u003E\u003Cp\u003ECrusader Kings 2 2.4.5 (started as Crusader Kings 2 1.0) \u003C/p\u003E\u003Cp\u003ESo, do you mean KSP1 2.0 or KSP 2 1.0 ?\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-10-09T08:33:13Z","Content":"\n\u003Cp\u003E^ This exactly. Version numbers are completely arbitrary. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou define them to have a consistent version tracking system internally, but \u003Cem\u003Ehow\u003C/em\u003E you define them doesn\u0027t matter. For example, all of the following are completely valid and, depending on how they were defined, can mean \u003Cem\u003Eexactly the same thing\u003C/em\u003E:\u003C/p\u003E\u003Cp\u003E- Version 17 followed by version 18 followed by version 19 followed by version 20\u003C/p\u003E\u003Cp\u003E- Version 1.7 followed by version 1.8 followed by version 1.9 followed by version 1.10\u003C/p\u003E\u003Cp\u003E- Version 1.7.0 followed by version 1.7.1 followed by version 1.7.2 followed by version 1.8.0\u003C/p\u003E\u003Cp\u003EYou don\u0027t even know if Squad is going to count 1.9 -\u0026gt; 2.0. In fact, chances are they\u0027re \u003Cem\u003Enot\u003C/em\u003E going to. They\u0027ll instead count 1.9 -\u0026gt; 1.10, like in the second example above. Because while the common non-developer person thinks that it might make sense to roll over into 2.0 because of how our decimal number system works, for a developer, version numbers are defined by what they signify, not by how you count them.\u003C/p\u003E\u003Cp\u003ETake a version number like 1.4.2a.3489. Here\u0027s how it breaks down:\u003C/p\u003E\u003Cp\u003E- The 1 is the production status, showing that this piece of software is post-release (as opposed to 0, which would make it pre-release)\u003C/p\u003E\u003Cp\u003E- The 4 is the major version (a large patch that changes a lot of stuff around)\u003C/p\u003E\u003Cp\u003E- The 2 is the minor version (a small patch that fixes bugs and tweaks things in between major versions)\u003C/p\u003E\u003Cp\u003E- The a denotes that one hotfix has been applied (an emergency fix to a critical issue that was supplied outside of normal patch cycles)\u003C/p\u003E\u003Cp\u003E- The 3489 is the internal build number, which counts how many times the project has been successfully built (compiled and packaged into a fully working product, but not necessarily released)\u003C/p\u003E\u003Cp\u003EThis is a typical system, used by many (but not all) companies in this or a slightly different form. In this system, counting the major version past 9 does not increment the production status, because they have nothing to do with each other. Counting the minor version past 9 does not increment the major version either, because those also have nothing to do with each other. A version number like 1.17.12b.5968 is perfectly valid.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-09T08:47:43Z\u0022 title=\u002210/09/2015 08:47  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 9, 2015\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2015-10-09T09:03:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sanguine\u0022 data-cite=\u0022Sanguine\u0022\u003E\u003Cdiv\u003EWould this justify the creation of an entirely new KSP from the ground up, in some sort of fantastical superengine, or would the original KSP simply continue to get upgraded? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that this means a new game. KSP2 version 1.0. It may have some elements from current KSP but is basically a different game.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-10-09T09:14:26Z","Content":"\n\u003Cp\u003EI would much rather KSP keeps being updated indefinitely than have a sequel. That way more features can be added, graphics can keep being worked on, and more parts can be added.\u003C/p\u003E\u003Cp\u003EIf KSP 2 is brought out it will be inevitably several years before its features catch up to those of KSP 1, if ever. All for lightly more fancy graphics.\u003C/p\u003E\u003Cp\u003EI\u0027ve seen it happen with way too many sequels and don\u0027t want to see it happen to my favourite game.\u003C/p\u003E\n"},{"CreatedByName":"FyunchClick","CreatedById":143109,"CreatedDateTime":"2015-10-09T10:57:07Z","Content":"\n\u003Cp\u003EBasically they can reinvent the game over and over again with these incremental updates as they have before. Even the base platform get\u0027s a pretty hefty update now with supporting the new Unity engine. There\u0027s no storyline that would require a new version. And Kerbal is probably a slow burner, so the money would have been tricking in all this time funding for these incremental changes.\u003C/p\u003E\u003Cp\u003EI do wonder about the business side of things though, as at some point everyone that is going to buy Kerbal will have (or even more worrying, may have already), and at that point there\u0027s no business sense in in investing much time adding new features. The shift to other platforms than PC/Mac is part of finding a new source of revenue of course, and if it\u0027s sharing a common base, PC and Mac can lift along on the improvents coming out of those platforms, but at some point that market will saturate too. Then they\u0027d either need to really reinvent the game in a Kerbal II of sorts, which should be offering enough to be worth buying too, have subscriptions or paid expansions to keep this deal going, or move on to something else.\u003C/p\u003E\u003Cp\u003EI know for me Kerbal\u0027s been the best deal ever, buying it at a sale and logging substantially more hours on it even than on my Fallout New Vegas playthrough (and I played that for months and months on end). I\u0027d donate or buy expansions to keep this deal going (but not subscriptions, I hate the idea of having my game ransomed to a monthly pay-off).\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-10-09T11:13:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI do wonder about the business side of things though, as at some point everyone that is going to buy Kerbal will have (or even more worrying, may have already), and at that point there\u0027s no business sense in in investing much time adding new features.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is why I support the idea of squad releasing large DLC packs in the future. While updates to the original game should always be free, things that were outside that scope would work as paid DLC and continue to fund updates to the base game. Things such as colonisation.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-10-09T11:17:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_stilgar_\u0022 data-cite=\u0022_stilgar_\u0022\u003E\u003Cdiv\u003EWhat does \u00222.0\u0022 mean? If it\u0027s just a version number, then I think we\u0027ll get it in a year or two, maybe with an expansion or something. \u003Cp\u003EIF you mean KSP 2, a new game... I\u0027m not sure I want that. KSP is great game, just add more features to it and improve performance and we\u0027ll have tons of fun for years. \u003C/p\u003E\u003Cp\u003EAnd that version number and game number are not the same thing... see Paradox Games for example:\u003C/p\u003E\u003Cp\u003EEuropa Universalis 3 5.2\u003C/p\u003E\u003Cp\u003EEuropa Universalis 4 1.13\u003C/p\u003E\u003Cp\u003ECrusader Kings 2 2.4.5 (started as Crusader Kings 2 1.0) \u003C/p\u003E\u003Cp\u003ESo, do you mean KSP1 2.0 or KSP 2 1.0 ?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith KSP 2 I think most think an new game who would require an new license. \u003C/p\u003E\u003Cp\u003EOur current game will end around 1.3-1.4 I think.\u003C/p\u003E\u003Cp\u003EOne obvious idea would be multiple stars and interstellar travel, had guessed multiplayer would be an 2.0 feature but it will come in this game.\u003C/p\u003E\u003Cp\u003EMain reason to make the KSP 2 instead of continue to improve the old game would be to earn more money.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2015-10-09T12:35:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FyunchClick\u0022 data-cite=\u0022FyunchClick\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI do wonder about the business side of things though, as at some point everyone that is going to buy Kerbal will have (or even more worrying, may have already), and at that point there\u0027s no business sense in in investing much time adding new features.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suggest that for example major graphical and physical overhaul of planets could be a DLC. Basic game begins to be quite good and it would be better make large paid DLC to it than start a new game from scratch (taking economic reality into account, fantastical engines etc. are practically impossible). I mean detailed topography, fluid flows, physical and chemical effects (temperature, weather, corrosion, liquid flows (lava, water, erupting gases)), caves and complicated (maybe dynamic) 3D geometry. Things which would be very expensive to program and are not realistic to expect as a free update.\u003C/p\u003E\n"},{"CreatedByName":"KerBlammo","CreatedById":137834,"CreatedDateTime":"2015-10-09T12:38:43Z","Content":"\n\u003Cp\u003E2.0 is released and overhead, without any fuss, the stars are going out...\u003C/p\u003E\n"},{"CreatedByName":"Broax","CreatedById":109333,"CreatedDateTime":"2015-10-09T13:36:01Z","Content":"\n\u003Cp\u003EI think there\u0027s room for a KSP2 but I don\u0027t think we\u0027ll need it for a long, long, long time. \u003C/p\u003E\u003Cp\u003EKSP is good enough (or will be with the new U5 engine) to stand on its own two feet for a good long time. Modders can just revamp the game from time to time and the exercise of modding has become trivially simple with the development of CKAN. \u003C/p\u003E\u003Cp\u003EBetween the enormous playground that KSP is on its own and the longevity that mods create I don\u0027t think we\u0027ll need a KSP2 for a while. But, eventually, computers will get better and there will be enough reasons to warrant an upgrade.\u003C/p\u003E\u003Cp\u003ESo... Unless KSP 2.0 comes after 5-10 years I don\u0027t think we\u0027ll need a completely new game from scratch. Nor do I think it\u0027ll make much financial sense as this game will sell well on its own. I think squad could start to focus on some other IP and to develop DLCs and updates for KSP. After a couple of years of doing this they could focus on KSP2.\u003C/p\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2015-10-09T13:41:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf KSP 2 is brought out it will be inevitably several years before its features catch up to those of KSP 1, if ever. All for lightly more fancy graphics.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo go from updates to sequel there has to be some serious new stuff.\u003C/p\u003E\u003Cp\u003ELook at the Civilization series for instance.\u003C/p\u003E\u003Cp\u003ENew engine, new game play, new graphics, etc and lots of other new stuff.\u003C/p\u003E\u003Cp\u003EThere might come a day when the current game, regardless of updates, simply can\u0027t be patched to allow the new content that the studio wants.\u003C/p\u003E\u003Cp\u003EBut that doesn\u0027t mean that the first game dies, nor that everyone just rushes ahead and picks up the new one.\u003C/p\u003E\n"},{"CreatedByName":"Superman","CreatedById":152048,"CreatedDateTime":"2015-10-09T14:02:36Z","Content":"\n\u003Cp\u003EI don\u0027t believe it will happen.. Or if it does it must be better than the stock KSP in every aspect. KSP is bit like SLRR, it\u0027s old but never gets old because of the updates. (Well they tried to make Street Tuning Evolution, which crapped :\u0027()\u003C/p\u003E\n"},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-10-09T14:17:17Z","Content":"\n\u003Cp\u003EAs with most gaming industry trends, 2.0 would be more easily accessible with simpler craft design interface and more use of procedural parts to more easily produce large rockets and aerospace craft in a much more refined interface and improved game design... but would lose a bit of the rough-hewn charm we know and love today. Maybe, in the new VAB / SPH we would not be able to zoom in to inspect the smallest of joints and manually position parts until we get picture-perfect individual panel gaps and welds between clipped parts.\u003C/p\u003E\u003Cp\u003EIt would be a better and more successful product with a wider fanbase yes, but we would miss the kind of simplicity we used to enjoy when deltaV had to be guessed or calculated with slide rules, and being able to rotate parts after placing them was a revolutionary game-changing function!\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2015-10-09T14:21:39Z","Content":"\n\u003Cp\u003EI think the OP was asking what features might be in KSP 2.0:\u003C/p\u003E\u003Cp\u003E1. total Kerbal POV with freedom of movement IVA and EVA . (KSP as first person shooter)\u003C/p\u003E\u003Cp\u003E2. clouds\u003C/p\u003E\u003Cp\u003E3. Lag fixes for lots o\u0027 parts and lots o\u0027 ships\u003C/p\u003E\u003Cp\u003E4. A parts marketplace where USERS could SELL ships and parts as DLC (for micropayments)\u003C/p\u003E\u003Cp\u003E5. part replacement (all the way to building ships off-world)\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-10-09T14:23:18Z","Content":"\n\u003Cp\u003E2.0? You mean the version that will follow 1.1?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-10-09T14:25:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brainlord Mesomorph\u0022 data-cite=\u0022Brainlord Mesomorph\u0022\u003E\u003Cdiv\u003E4. A parts marketplace where USERS could SELL ships and parts as DLC (for micropayments)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really, really doubt that would happen.\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2015-10-09T14:29:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI really, really doubt that would happen.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlready happening in the 3D animation hobby world. Its profitable for everyone (devs get a cut). It creates a lot of user excitement. I would not be surprised if 3d gaming goes in that direction.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-10-09T14:36:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sanguine\u0022 data-cite=\u0022Sanguine\u0022\u003E\u003Cdiv\u003EWhat are your thoughts should KSP ever advance that fart?\u003C/div\u003E\u003C/blockquote\u003EIt would probably keep going in the same vein. Career mode would still be a botched experiment in grind-mechanics, science collecting would still make no sense, there still wouldn\u0027t be anywhere else to go... On the plus side we\u0027d have a lot more rote, unrelated game mechanics to occupy our time.\u003Cp\u003EFortunately they put in enough realism to make the game respectable in 1.0.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-10-09T14:52:27Z","Content":"\n\u003Cp\u003EWhat would happen if and/or when KSP reaches 2.0?\u003C/p\u003E\u003Cp\u003EPeople would complain that 1.whatever was better and that 2.0 is hopelessly broken.\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-10-09T15:09:14Z","Content":"\n\u003Cp\u003EThe Aerobraking at Jool bug and random overheating will finally be fixed, replaced with other, equally confusing and game-altering bugs, such as \u0022Never EVA while there\u0027s science in the capsule or the game will freeze\u0022 or \u0022Using too many fuel lines will cause engines to overheat and explode\u0022 or \u0022Pressing F1 while in an atmosphere makes your autosave unusable.\u003C/p\u003E\u003Cp\u003EJust like how our current confusing bugs replaced \u0022Don\u0027t use boosters ever or they\u0027ll destroy your core stage engines\u0022 and \u0022Long rockets behave like noodles\u0022 from previous versions.\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-10-09T15:13:49Z","Content":"\n\u003Cp\u003EI\u0027ve seen much \u0022minor products\u0022 going release after release over the past years. IF SQUAD would be the owner of KSP for the future, they will make a KSP 2 with Unity 6/7 (if it will ever exist) or with a new engine or create a new engine (as it happens on the X series). This means that in the future we\u0027ll see a better KSP, with more features, a better implementation, a better graphics with better parts and better planets. So, what\u0027s the problem? We just have to wait for \u0022some\u0022 years...\u003C/p\u003E\n"}]}