{"TopicId":122785,"ForumId":32,"TopicTitle":"Wacthed The Martian last night...actually UNDERSTOOD the spacey stuff!","CreatedByName":"SpaceyCLE","CreatedById":150476,"CreatedDateTime":"2015-10-11T13:23:49Z","PageNum":1,"Articles":[{"CreatedByName":"SpaceyCLE","CreatedById":150476,"CreatedDateTime":"2015-10-11T13:23:49Z","Content":"\n\u003Cp\u003ESo my wife and I went to see The Martian last night, in glorious 3D and on a giant screen (only way to see it, really). What a great movie, and I read the book too, which I also highly recommend...unless you have a problem with staying up until 3:00 AM because it\u0027s the kind of book you say to yourself repeatedly: \u0022Just one more chapter!\u0022 The flick followed the book pretty well, with some parts understandably left out. I mean, they can\u0027t expect people to sit through a 3-hour movie every time. The scenes were awe-inspiring and gorgeous, but 3D on a giant screen? It was an experience to behold, I tell you.\u003C/p\u003E\u003Cp\u003EAnyway, to the point! There were many parts of the movie that dealt with space travel, talking about gravity assist, orbital mechanics, Hohmann transfer window, etc. Because of this game, I got a huge kick out of actually understanding what they were talking about and doing! I don\u0027t know if it\u0027s a little sad, though, that I was thinking of KSP during the movie, lol!\u003C/p\u003E\u003Cp\u003ESuffice it to say, however, score major points for KSP actually teaching some real science-y stuff that applies in real life! The game also made me *greatly* appreciate how vastly difficult space travel is and what a job NASA had on their hands from the 1950\u0027s and on. To think they did the entire Apollo program with computers running on a fraction of the power of today\u0027s home computers and slide rules just boggles my mind.\u003C/p\u003E\u003Cp\u003EI think it might be time to rewatch HBO\u0027s From the Earth to the Moon miniseries. If only they would re-master it in blu-ray and widescreen...\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-10-11T13:34:25Z","Content":"\n\u003Cp\u003EWow, I think I need to see this movie for myself after reading what you said.\u003C/p\u003E\n"},{"CreatedByName":"SpaceyCLE","CreatedById":150476,"CreatedDateTime":"2015-10-11T13:39:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Columbia\u0022 data-cite=\u0022Columbia\u0022\u003E\u003Cdiv\u003EWow, I think I need to see this movie for myself after reading what you said.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENASA lent their hand in the making of this movie and my wife said she listened to a piece about it on NPR last week, interviewing a bunch of scientists. They all agreed that the science in the movie was spot-on with maybe a couple of minor quibbles (like a storm on Mars wouldn\u0027t be anywhere nearly as bad as portrayed). I also knew that there would be no sound on Mars (or very, very little) as the atmosphere was a near-vacuum, but it *is* fiction, after all. The book is much more detailed with math and science, but the author, Andy Weir, did a masterful job at making it accessible and compelling.\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2015-10-11T14:39:19Z","Content":"\n\u003Cp\u003EAmen... It\u0027s a great movie that uses 3D perfectly to convey the message that space is hard. And bad. Very hard. And very bad. The only issues I had were: Firstly, in the Pathfinder retrieval scene, the sand was in a wave pattern - kinda hard to do that sort of pattern with such low pressures and winds. One other really tiny issues was that the Chinese booster was just a Atlas-V booster without SRBs that was modified with CGI to have Chinese markings. Otherwise, it was a splendid movie.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-10-11T14:43:06Z","Content":"\n\u003Cp\u003EYou read that, Felipe? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E That\u0027s how great your game is, man.\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2015-10-11T14:43:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceyCLE\u0022 data-cite=\u0022SpaceyCLE\u0022\u003E\u003Cdiv\u003ETo think they did the entire Apollo program with computers running on a fraction of the power of today\u0027s home computers and slide rules just boggles my mind.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat actually isn\u0027t a good comparison. Although the AGC (Apollo Guidance Computer) on the CSM and the LM was indeed only a fraction as powerful as today\u0027s home computers, they were custom-built to run just the programs required to take the entire stack to the Moon, and then (for the LM) down to the surface and back up, compared to modern computers which run an OS then programs on top. Although, the slide rule part is accurate - it was VERY hard to calculate everything without modern supercomputers; plus, they had to pioneer advanced programming techniques to get everything in the AGCs to not overload the CPU (or the equivalent).\u003C/p\u003E\n"},{"CreatedByName":"LostOblivion","CreatedById":111504,"CreatedDateTime":"2015-10-11T15:16:02Z","Content":"\n\u003Cp\u003ECan\u0027t agree more with the OP and also the only squibbles I had were mentioned by Spacey and SuperGuy. What a great movie for us space exploration fans. :-)\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-10-11T16:47:58Z","Content":"\n\u003Cp\u003EWhen I read the book I remember having the same thoughts - that stuff I\u0027d learnt in KSP made some bits more understandable. \u003C/p\u003E\u003Cp\u003EMy two minor quibbles with the movie were similar to what others have said...They really should have come up with something other than a sandstorm as the reason for quitting the planet. A solar flare and needing to get to a water-lined room on the main ship would have done it for me. The other thing was kinda the opposite of the OP, I don\u0027t like movies like this in 3D. The craft look like little models to me, but like proper big things in 2D.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-10-11T17:12:06Z","Content":"\n\u003Cp\u003EMy biggest complaint about The Martian was, where\u0027s the SLS? It showed a lighter variant of the Atlas V carrying payload to Mars?? At the end, the follow up Ares mission was performed by an Delta IV HEAVY? Holy Jebediah, the D-IV Heavy couldn\u0027t put the Orion module past the moon! The heck! Moreover, the launch portrayed at the end was just videos and audio taken from Orion EFT-1 (launched in December 4th of 2014!!). I had a lot of problems with it, I heard a lot of praise, but I feel I just got Gravity\u0027d. Good story, but whoever was directing didn\u0027t know up from down.\u003C/p\u003E\u003Cp\u003EI am aware the film tried to work with NASA to make it more realistic, as in, ditch NASA\u0027s plan of space suit and go with something else entirely since you can\u0027t get his profile right for the shots. Hollywood yet again ignores reality and preference for it\u0027s own. \u003C/p\u003E\u003Cp\u003EI\u0027m certain the story within the book is outstanding, hence why it became a movie. But from the movie\u0027s standpoint, the flaws are off the charts.\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-10-11T17:16:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003EMy biggest complaint about The Martian was, where\u0027s the SLS? It showed a lighter variant of the Atlas V carrying payload to Mars?? At the end, the follow up Ares mission was performed by an Delta IV HEAVY? Holy Jebediah, the D-IV Heavy couldn\u0027t put the Orion module past the moon! The heck! Moreover, the launch portrayed at the end was just videos and audio taken from Orion EFT-1 (launched in December 4th of 2014!!). I had a lot of problems with it, I heard a lot of praise, but I feel I just got Gravity\u0027d. Good story, but whoever was directing didn\u0027t know up from down.\u003Cp\u003EI am aware the film tried to work with NASA to make it more realistic, as in, ditch NASA\u0027s plan of space suit and go with something else entirely since you can\u0027t get his profile right for the shots. Hollywood yet again ignores reality and preference for it\u0027s own. \u003C/p\u003E\u003Cp\u003EI\u0027m certain the story within the book is outstanding, hence why it became a movie. But from the movie\u0027s standpoint, the flaws are off the charts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah that was jarring for NASA fans. I\u0027m fairly sure the Ares V 541 launch shown was the launch of MSL Curiosity.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2015-10-11T17:19:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003EAt the end, the follow up Ares mission was performed by an Delta IV HEAVY? Holy Jebediah, the D-IV Heavy couldn\u0027t put the Orion module past the moon! The heck!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure that launch was just to get the crew to the \u003Cem\u003EHermes\u003C/em\u003E in orbit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2015-10-11T17:22:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003EMy biggest complaint about The Martian was, where\u0027s the SLS? It showed a lighter variant of the Atlas V carrying payload to Mars?? At the end, the follow up Ares mission was performed by an Delta IV HEAVY? Holy Jebediah, the D-IV Heavy couldn\u0027t put the Orion module past the moon! The heck! Moreover, the launch portrayed at the end was just videos and audio taken from Orion EFT-1 (launched in December 4th of 2014!!). I had a lot of problems with it, I heard a lot of praise, but I feel I just got Gravity\u0027d. Good story, but whoever was directing didn\u0027t know up from down.\u003Cp\u003EI am aware the film tried to work with NASA to make it more realistic, as in, ditch NASA\u0027s plan of space suit and go with something else entirely since you can\u0027t get his profile right for the shots. Hollywood yet again ignores reality and preference for it\u0027s own. \u003C/p\u003E\u003Cp\u003EI\u0027m certain the story within the book is outstanding, hence why it became a movie. But from the movie\u0027s standpoint, the flaws are off the charts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDude, the director was RIDLEY SCOTT. He knew what he was doing... And the reason they used those launches was because they were REAL launches. They didn\u0027t want to CGI a massive stack when they had perfectly good real footage to use, even if they weren\u0027t as big as they needed to be. \u003C/p\u003E\u003Cp\u003EAnd as for the space suit... You simply cannot have a movie take place where you can\u0027t see the actor\u0027s face 70-80% of the time. Quit your bitching, even NASA is admitting the movie\u0027s pretty damned close.\u003C/p\u003E\n"},{"CreatedByName":"LayZboy","CreatedById":92384,"CreatedDateTime":"2015-10-11T17:22:43Z","Content":"\n\u003Cp\u003EBabylon 5 handles \u0022real space travel\u0022 pretty well for a TV show.\u003C/p\u003E\u003Cp\u003EThe space station has a rotating part to give gravity.\u003C/p\u003E\u003Cp\u003EThe engines of their space fighters aren\u0027t always on like most shows, and thrust when needed.\u003C/p\u003E\u003Cp\u003EWrong trajectories and coming in too steep are actual concerns due to collisions and burning up.\u003C/p\u003E\u003Cp\u003EI\u0027m only at season 1 though so it could play fast and loose later though.\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-10-11T17:27:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mitchz95\u0022 data-cite=\u0022Mitchz95\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure that launch was just to get the crew to the \u003Cem\u003EHermes\u003C/em\u003E in orbit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen why not use the SLS Block 1? Isn\u0027t that what it\u0027s for? Or better yet, use the Falcon 9, CST-100 or the Vulcan! But by the time we can go to Mars, the Delta and Atlas series of rockets will be greatly outdated in preference for the new partially reuseable Vulcan.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EDude, the director was RIDLEY SCOTT. He knew what he was doing... And the reason they used those launches was because they were REAL launches. They didn\u0027t want to CGI a massive stack when they had perfectly good real footage to use, even if they weren\u0027t as big as they needed to be. \u003Cp\u003EAnd as for the space suit... You simply cannot have a movie take place where you can\u0027t see the actor\u0027s face 70-80% of the time. Quit your bitching, even NASA is admitting the movie\u0027s pretty damned close.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes and the writer of Armageddon was J.J Abrams! So your point is null. I get the idea its better to use live footage, but in this case your trying to show us the future, so don\u0027t show me the past!! \u003C/p\u003E\u003Cp\u003EI disagree, the fishbowl style for the Z-1 is actually quite viewable, just not when your trying to get a shot over his shoulder or from the back. Just look him dead on and your fine. It\u0027s one of the major benefits of the Z-1, being able to see more than the old style lunar space suits.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2015-10-11T17:34:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003EYes and the writer of Armageddon was J.J Abrams! So your point is null. I get the idea its better to use live footage, but in this case your trying to show us the future, so don\u0027t show me the past!! \u003Cp\u003EI disagree, the fishbowl style for the Z-1 is actually quite viewable, just not when your trying to get a shot over his shoulder or from the back. Just look him dead on and your fine. It\u0027s one of the major benefits of the Z-1, being able to see more than the old style lunar space suits.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight... Because the director of the original Alien movie has no idea how space works...\u003C/p\u003E\u003Cp\u003EAnd the movie takes place in 2037-47, so as for the Z-1, that twenty-year old piece of prototype... \u0027don\u0027t show me the past!!\u0027\u003C/p\u003E\n"},{"CreatedByName":"Sobriquet","CreatedById":137022,"CreatedDateTime":"2015-10-11T18:08:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003EMy biggest complaint about The Martian was, where\u0027s the SLS? It showed a lighter variant of the Atlas V carrying payload to Mars?? At the end, the follow up Ares mission was performed by an Delta IV HEAVY? Holy Jebediah, the D-IV Heavy couldn\u0027t put the Orion module past the moon! The heck! Moreover, the launch portrayed at the end was just videos and audio taken from Orion EFT-1 (launched in December 4th of 2014!!). I had a lot of problems with it, I heard a lot of praise, but I feel I just got Gravity\u0027d. Good story, but whoever was directing didn\u0027t know up from down.\u003Cp\u003EI am aware the film tried to work with NASA to make it more realistic, as in, ditch NASA\u0027s plan of space suit and go with something else entirely since you can\u0027t get his profile right for the shots. Hollywood yet again ignores reality and preference for it\u0027s own. \u003C/p\u003E\u003Cp\u003EI\u0027m certain the story within the book is outstanding, hence why it became a movie. But from the movie\u0027s standpoint, the flaws are off the charts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is some serious nerd rage here. Funny stuff. I\u0027m glad I only have a cursory knowledge of all things spacey so that my suspension of disbelief was not nuked from orbit. \u003C/p\u003E\u003Cp\u003EWatching this movie I can\u0027t tell you how many times I said, \u0022Kerbal Space Program\u0022, in my head. Very enjoyable movie made even more enjoyable by a video game I play. How often can you say that!\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-10-11T18:37:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003ERight... Because the director of the original Alien movie has no idea how space works...\u003Cp\u003EAnd the movie takes place in 2037-47, so as for the Z-1, that twenty-year old piece of prototype... \u0027don\u0027t show me the past!!\u0027\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe director of gravity definitely didn\u0027t. So directing one space movie does not make you good at space.\u003C/p\u003E\u003Cp\u003EAnd the Orion would be equally as old, as would be the MAV concepts. If you think that way, EVERY concept is old.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sobriquet\u0022 data-cite=\u0022Sobriquet\u0022\u003E\u003Cdiv\u003EThis is some serious nerd rage here. Funny stuff. I\u0027m glad I only have a cursory knowledge of all things spacey so that my suspension of disbelief was not nuked from orbit. \u003Cp\u003EWatching this movie I can\u0027t tell you how many times I said, \u0022Kerbal Space Program\u0022, in my head. Very enjoyable movie made even more enjoyable by a video game I play. How often can you say that!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is nerd rage \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E but that\u0027s GOOD. When your audience starts pointing out the MINUTE details which are wrong, that\u0027s good because it means your audience cares and is paying attention! So for people who are thinking I dislike the movie because of these errors, your far off. I LOVE the movie, so much so I want it to be BETTER.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2015-10-11T18:59:42Z","Content":"\n\u003Cp\u003EThe thing that seemed strange to me was that the final stage of the MAV (the bit he discarded all the window and nosecone from) didn\u0027t have any sort of manoeuvring thrusters. By the time he was close to intercept with the Hermes, he was left in a pod over which he had absolute control, or do we accept that because he had ditched the nosecone he wouldn\u0027t be able to dock with anything, and everything connected with any sort of docking process was also ditched.\u003C/p\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2015-10-11T19:08:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scarecrow88\u0022 data-cite=\u0022Scarecrow88\u0022\u003E\u003Cdiv\u003EThe thing that seemed strange to me was that the final stage of the MAV (the bit he discarded all the window and nosecone from) didn\u0027t have any sort of manoeuvring thrusters. By the time he was close to intercept with the Hermes, he was left in a pod over which he had absolute control, or do we accept that because he had ditched the nosecone he wouldn\u0027t be able to dock with anything, and everything connected with any sort of docking process was also ditched.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt least in the book, docking is never even considered. As such, I just assume that any maneuvering thrusters would have been ditched to save weight. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sovek","CreatedById":57251,"CreatedDateTime":"2015-10-11T19:08:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYes and the writer of Armageddon was J.J Abrams! So your point is null. I get the idea its better to use live footage, but in this case your trying to show us the future, so don\u0027t show me the past!! \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept one problem, J.J Abrams is a crappy director, and every single one of his movies have holes in the plot you can fly the Enterprise (starship) through. \u003C/p\u003E\u003Cp\u003EPoint is not null.\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-10-11T21:37:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI disagree, the fishbowl style for the Z-1 is actually quite viewable, just not when your trying to get a shot over his shoulder or from the back. Just look him dead on and your fine. It\u0027s one of the major benefits of the Z-1, being able to see more than the old style lunar space suits.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey went for a mechanical counter pressure suit rather than a regular pressure suit to give the surface astronauts increased mobility.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_activity_suit\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Space_activity_suit\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-10-11T21:43:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sovek\u0022 data-cite=\u0022Sovek\u0022\u003E\u003Cdiv\u003EExcept one problem, J.J Abrams is a crappy director, and every single one of his movies have holes in the plot you can fly the Enterprise (starship) through. \u003Cp\u003EPoint is not null.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPoint is indeed null in the fact it shows that many directors can be crap. This director is no different.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reactordrone\u0022 data-cite=\u0022Reactordrone\u0022\u003E\u003Cdiv\u003EThey went for a mechanical counter pressure suit rather than a regular pressure suit to give the surface astronauts increased mobility.\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_activity_suit\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Space_activity_suit\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am aware of the design. I have been looking into it for some time.\u003C/p\u003E\n"},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-10-11T22:51:15Z","Content":"\n\u003Cp\u003EYou guys are funny, my most ... moments in order of WTFness (though I loved the book and liked the film, .... see my sig to see my obsession)\u003C/p\u003E\u003Cp\u003E1. Cutting suit to use suit pressure to fly around, I bet everyone here has tried to fly an offcenter thrust craft (film)\u003C/p\u003E\u003Cp\u003E2. The Mission COMMANDER replacing a SPECIALIST to do the EVA rescue, I almost shouted at the screen (film)\u003C/p\u003E\u003Cp\u003E3. The whole MAV to Hermes intercept, see the pages of complicated orbital stuff in The Dunatian thread about trying to accomplish this (book/film)\u003C/p\u003E\u003Cp\u003E4. The Hermes (see offcenter thrust again, look at that stupid cabin) (film)\u003C/p\u003E\u003Cp\u003E5. The bomb, (see offcenter thrust again) (film/book) I would expect the weakest spot in an airlock to be an overpressure leak valve or something, possibly the air dump vent. Because I doubt in a big airlock like that you want to dump the atmosphere out the door when you want to open it and an explosion is not going to rip the door off, it\u0027s going out the vents first.\u003C/p\u003E\u003Cp\u003E/rant I still liked the film, that end scene was a bit of a sore point for me it seems like they just dumped everything we would actually do just to make a big end scene, that ended up kind of just being awkward, especially as their spin would have increased not decreased as they got closer.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2015-10-12T02:36:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scarecrow88\u0022 data-cite=\u0022Scarecrow88\u0022\u003E\u003Cdiv\u003EThe thing that seemed strange to me was that the final stage of the MAV (the bit he discarded all the window and nosecone from) didn\u0027t have any sort of manoeuvring thrusters. By the time he was close to intercept with the Hermes, he was left in a pod over which he had absolute control, or do we accept that because he had ditched the nosecone he wouldn\u0027t be able to dock with anything, and everything connected with any sort of docking process was also ditched.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaven\u0027t seen the movie yet, but in the book he dumped all docking equipment, including the RCS system to save weight. It makes sense, even though RCS is useful fuel, its Isp is lower than your main engine\u0027s and so it reduces the overall delta-v.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2015-10-12T02:55:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022 data-cite=\u0022ZooNamedGames\u0022\u003E\u003Cdiv\u003EPoint is indeed null in the fact it shows that many directors can be crap. This director is no different.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re entitled to your opinion, provided that you can back it up with objective evidence.\u003C/p\u003E\u003Cp\u003EWhy, specifically, is Ridley Scott a crap director in this? DIRECTING, mind you, not visual effects or set design or script.\u003C/p\u003E\n"}]}