{"TopicId":123187,"ForumId":32,"TopicTitle":"Is there any benefit to launching multiple flights at once in career?","CreatedByName":"Ant P","CreatedById":152428,"CreatedDateTime":"2015-10-16T20:07:40Z","PageNum":1,"Articles":[{"CreatedByName":"Ant P","CreatedById":152428,"CreatedDateTime":"2015-10-16T20:07:40Z","Content":"\n\u003Cp\u003EI\u0027ve just sent my first unmanned probe to Duna in career mode. It\u0027s due to arrive there in 191 days.\u003C/p\u003E\u003Cp\u003EIt feels as though - in the meantime - more stuff should be happening. Like I should be launching shorter missions while my Duna probe is in transit.\u003C/p\u003E\u003Cp\u003EIs there any real benefit to being \u0022active\u0022 during the interim versus just warping and getting on with it? As far as I can tell, the only difference is that the career timer will be higher for subsequent missions.\u003C/p\u003E\u003Cp\u003EIf that\u0027s the case - has there been any talk of adding any incentive to more \u0022efficient\u0022 use of career time in future versions (in-game rather than challenge-based)? It seems like it could add a real strategic dimension to the game...\u003C/p\u003E\n"},{"CreatedByName":"Volix","CreatedById":144192,"CreatedDateTime":"2015-10-16T21:33:19Z","Content":"\n\u003Cp\u003EThere isn\u0027t really any benefit to it, no. The only thing I can think of is hitting a transfer window for a different planet while your probe is on its way to Duna. Anything within the Kerbin system can be done pretty much any time for the same effect, just a different time-stamp as you mentioned. For myself, I tend to keep launching missions, but the result is I often finish the tech tree before many of my probes reach their destination. Don\u0027t be afraid of time-warp.\u003C/p\u003E\u003Cp\u003EWhile I agree there needs to be more incentive to run multiple missions once you go interplanetary, first the game needs a better way of managing multiple missions. If you\u0027re open to mods there are things like Kerbal Alarm Clock, but right now in vanilla it\u0027s really easy to time-warp a craft to Minmus, and on the way fail to notice your probe has arrived, passed, and left Duna.\u003C/p\u003E\u003Cp\u003EEDIT: Welcome to the forums!\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-10-16T21:40:07Z","Content":"\n\u003Cp\u003EIs one mission at a time better/worse than lots of missions at once? Not really, as far as I can see. However...\u003C/p\u003E\u003Cp\u003EContract timers come to mind, but I guess if you\u0027re not accepting contracts until your current ones are completed then that\u0027s moot. Then again, I guess if more than one contract comes up that makes you think \u0027I really wanna do that!\u0027 then yeh, u need to run multiple missions.\u003C/p\u003E\u003Cp\u003EAlso, staying with Jeb on a solo mission to the Mun means I can\u0027t train up any of my other Kerbs until he\u0027s done and back...but then... what would be the point of using any other pilot if I have a better trained Jeb kicking his heels in the astroplex...?\u003C/p\u003E\u003Cp\u003EOne other thing is the ease of sending several small and stable rockets to achieve the same objectives as one big one, e.g. a Duna mission with an Ike probe, Duna lander and a return vehicle sent separately rather than in one stack. Cost wise this isn\u0027t necessarily best, but it might be more manageable with more basic parts than trying to send one big craft with all those modules built in.\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-10-16T21:49:26Z","Content":"\n\u003Cp\u003EIn stock career? Not necessarily unless you\u0027re dealing with close together transfer windows and don\u0027t want to wait for the next one for either transfer. \u003C/p\u003E\u003Cp\u003EHowever, with mods, running multiple missions at once becomes much more appealing as time becomes more valuable. Kerbal Construction Time, StateFunding, Life Support mods, and even the wide variety of contracts available via Contract Configurator all help make time something you don\u0027t want to waste, and as such running single missions at a time becomes less and less desirable the farther you get into the tech tree.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-10-16T22:03:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ant P\u0022 data-cite=\u0022Ant P\u0022\u003E\u003Cdiv\u003E Is there any real benefit to being \u0022active\u0022 during the interim versus just warping and getting on with it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe benefit is that you can earn more funds/science per game time. Which is pretty nearly meaningless.\u003C/p\u003E\u003Cp\u003EWhen I play a mission, I get into it; snapping out of it and switching to another mission, I take some time to adjust. The busy-ness of running several missions in parallel can be quite taxing at times. \u003C/p\u003E\u003Cp\u003EHowever, there is a \u0022punish the lazy\u0022 mod and it has users, so I assume that not everyone feels like I do. I suggest you just try for yourself and see what suits you.\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-10-16T22:16:47Z","Content":"\n\u003Cp\u003EI just find it boring to do only one mission at a time. It just feels wrong that when you are flying for several years to Jool, absolutely nothing else is happening with your space program.\u003C/p\u003E\n"},{"CreatedByName":"nsgallup","CreatedById":136892,"CreatedDateTime":"2015-10-16T22:23:41Z","Content":"\n\u003Cp\u003EWhen my probe is going to take 80 years to get to its destination I do other missions while waiting because that\u0027s like an hour of time warp\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-10-16T22:43:50Z","Content":"\n\u003Cp\u003EI just started doing so. Most contracts have decade or so long durations so doing so usually isn\u0027t strictly necessary, though it can help to make your program feel a bit more active.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-10-16T22:51:54Z","Content":"\n\u003Cp\u003EWell one option is to do things in front, you are likely to get an explore Eve/ Gilly after Duna and Ike so if the window comes up launch. \u003C/p\u003E\u003Cp\u003EMy problem is that I tend to accept in system contracts all the time, either they pay well or its getting more crew and then train them.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-10-16T23:11:45Z","Content":"\n\u003Cp\u003EAdding some other stuff with mods, that would be better if you don\u0027t waste the game time too much.\u003C/p\u003E\u003Cp\u003ECommunication satellite orbit drift.\u003C/p\u003E\u003Cp\u003ENuclear fuel/RTG decay.\u003C/p\u003E\u003Cp\u003EBut also, don\u0027t try to optimize too much, as you\u0027ll find yourself get trapped inside Kerbin SoI and never gets to interplanetary.\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-10-16T23:17:24Z","Content":"\n\u003Cp\u003EWow I usually have 30 or 40 flights going at any given time. The biggest advantage is its more fun, but once you\u0027ve really developed your program there\u0027s a legit cost savings to having specialized, reusable infrastructure in place. Get a mining rig going on minmus, then either make a tanker you can aerobreak into LKO, or a tug to pull your modules up to minmus. After that you\u0027ll never need to launch more fuel than it takes to get to orbit. You can put fueling stations like this all over the system and run a really tight interplanetary network.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2015-10-16T23:32:39Z","Content":"\n\u003Cp\u003EDuna windows are also the least common, occurring about one every 230 earth days, so when I throw to Duna, I tend to throw everything I think I\u0027m going to need at once.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/4057920/Kerbal%20Space%20Program/v0.21/Screenshots/screenshot724.png\u0022 alt=\u0022screenshot724.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThat said, 20 spacecraft was entirely too many. I generally limit myself to six to twelve these days.\u003C/p\u003E\u003Cp\u003EBut I\u0027m a long-time devotee of Kerbal Alarm clock, and throwing multiple spacecraft at once gives me the time to scamper to the top of the tech tree and train decent multiple crews before that first Duna Window arrives on Earth-Day 60 or thereabouts, and when /that/ mission arrives at Duna, the first Eve window is opening, and when /that/ mission arrives, it\u0027s a short amount of time before the almost-too-perfect-to-miss Second Dres Window (Dres is passing through Kerbin\u0027s orbital plane on arrival, and the return window is about 10 days after that), and the missions from the previous two destinations can arrive while that one\u0027s in transit.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-10-16T23:34:42Z","Content":"\n\u003Cp\u003EUsually there is no ingame reason to do fly many missions at once.\u003C/p\u003E\u003Cp\u003ETime doesn\u0027t matter in this game.\u003C/p\u003E\u003Cp\u003EUnless you have ships in transfer orbits, or active contracts you can just timewarp 100 years and continue like nothing had happened.\u003C/p\u003E\u003Cp\u003EThis is also why using ingame time as a balancing tool for ISRU/science lab is completely useless.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-10-17T00:43:15Z","Content":"\n\u003Cp\u003EIt used to be that you had a limited amount of time until the Kerbal version of the \u0022Y2K bug\u0022 hit, so it was in your best interest to hoover up as much science as possible in limited time.\u003C/p\u003E\u003Cp\u003E I don\u0027t know if that\u0027s still the case, but I still operate that way.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-10-17T02:44:24Z","Content":"\n\u003Cp\u003EIn my latest career I didn\u0027t see any missions through to completion in one go. I launched things as windows came around, set them on their way and moved onto the next mission. \u003C/p\u003E\u003Cp\u003EThe fun thing about this was there was no option to do reverts or load up previous saves, things either had to work or not. It also meant I didn\u0027t do massive time warps (a ~70 day warp was the longest). Kerbal Alarm clock was an essential tool for doing this!\u003C/p\u003E\u003Cp\u003EIt was fun, but I\u0027d say it\u0027s neither better or worse, just another way of playing. You could argue it\u0027s more \u0022realistic\u0022, but that wasn\u0027t the driving reason for me doing that.\u003C/p\u003E\u003Cp\u003EThe only real problem was that by the time I had around 40\u002B craft going here and there, the game\u0027s performance took a big hit.\u003C/p\u003E\n"},{"CreatedByName":"Ant P","CreatedById":152428,"CreatedDateTime":"2015-10-17T14:46:41Z","Content":"\n\u003Cp\u003EGood point about mods - I\u0027m still getting myself comfortable with the vanilla game for the time being (although I have just installed KER and PreciseNode) but I will take a look at some gameplay mods soon.\u003C/p\u003E\u003Cp\u003EI do think there\u0027s a lot of potential for strategic depth that could come with some incentive to co-ordinate more missions at once... may have to have a look at the SDK!\u003C/p\u003E\n"},{"CreatedByName":"Vegvisir","CreatedById":148279,"CreatedDateTime":"2015-10-22T21:50:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FancyMouse\u0022 data-cite=\u0022FancyMouse\u0022\u003E\u003Cdiv\u003EBut also, don\u0027t try to optimize too much, as you\u0027ll find yourself get trapped inside Kerbin SoI and never gets to interplanetary.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehehe, yeah this. I\u0027ve been doing atmospheric missons for a long time, getting a lot of temperature scans and stuff like that. Flying several missions in a row and tying as many of those objectives together has kept me busy - and has actually put a bit of a halt on the science gathering, as I\u0027ve done most of Kerbin now. I\u0027ve got probes heading to Mun and Minmus, and in the meantime have continued to do some short term Kerbin-based stuff.\u003C/p\u003E\u003Cp\u003EI suppose for me it depends on \u0022what else is going on\u0022. If not much, I\u0027ll time warp until the vessel arrives. Otherwise, keep flying I say \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027m totally gonna get the Alarm Clock mod before I start up this weekend though.\u003C/p\u003E\n"},{"CreatedByName":"obi_juan","CreatedById":89945,"CreatedDateTime":"2015-10-22T22:09:44Z","Content":"\n\u003Cp\u003EI play sending several missions at the same time... just as you said, and unmaned probe to Eve, other to Duna, and maned to rescue Kerbals or make another contracts.\u003C/p\u003E\u003Cp\u003EIs my option play on this way, you can chose by yourself. \u003C/p\u003E\u003Cp\u003ETo play on this way is very interesting use this pluging \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24786\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Alarm Clock\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt reminds you when a probe (or ship) need to do a maneuver or reach another planes. \u003C/p\u003E\u003Cp\u003EAnd is your choice, nobody will say how you need to play your game.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-10-22T22:15:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EIt used to be that you had a limited amount of time until the Kerbal version of the \u0022Y2K bug\u0022 hit, so it was in your best interest to hoover up as much science as possible in limited time.\u003Cp\u003E I don\u0027t know if that\u0027s still the case, but I still operate that way.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs it true the game maxes out at 255 years? I was under this impression during my last play through with OPM and I forget the name of another planet pack that adds bodies even further out. \u003C/p\u003E\u003Cp\u003EFreaking Sedna analogs. Took my probe 120 some years for the transfer. It was the first to launch and the last mission before I ended my career. All during that time I pretty much conquered all of OPM with manned land and returns with TAC.\u003C/p\u003E\u003Cp\u003EProbably my best ksp career I\u0027ve ever done. Took four months.\u003C/p\u003E\u003Cp\u003ESo to the OP I\u0027d say go for it. It\u0027s a neat way to play the game and with Kerbal Alarm Clock its easy as can be. It leaves you with constant things to do.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-22T22:18:01Z\u0022 title=\u002210/22/2015 10:18  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 22, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2015-10-22T22:39:45Z","Content":"\n\u003Cp\u003EHave to agree. Launching multiple craft at once gives you more things to do while having less wait time. Most of the time... Some times i feel like time warp is not an option. Even though I do use it when I cannot think of something to try or lack funds...\u003C/p\u003E\n"},{"CreatedByName":"Sobriquet","CreatedById":137022,"CreatedDateTime":"2015-10-22T22:58:13Z","Content":"\n\u003Cp\u003EI\u0027m with the majority of the posters on this as well. There is no benefit from multiple mission launches outside of your own personal enjoyment. For myself, being limited to max 14 contracts at a time, sometimes I take each one and assign a different craft. Other times I hit the \u0022X\u0022 until all 14 contracts are for the the same planet and launch one massive \u003Cem\u003Ething\u003C/em\u003E. depends on my mood.\u003C/p\u003E\u003Cp\u003EIf you are not mod-averse, get Kerbal Alarm Clock if you decide to multi-mission. Handles the tedium of having many flights.\u003C/p\u003E\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-10-23T00:16:04Z","Content":"\n\u003Cp\u003ENot really, and it comes with some big and very annoying complications at least for those among us who are not really what you\u0027d call \u0022planners.\u0022 \u003C/p\u003E\u003Cp\u003EI put myself in that latter category. Although I also have multiple missions (using KAC). The main reason I do multiple missions is for internal narrative reasons.... call it imaginative play. Two years waiting for a probe to reach Jool, where nothing is happening elsewhere doesn\u0027t work with my \u0022story\u0022. \u003C/p\u003E\u003Cp\u003EThe downside is planning errors can be devastating, especially if your a save/reload type, rather than a shrug and move on type. \u003C/p\u003E\u003Cp\u003ESay I have a probe going to Eve and a mission to Duna. I launch the Eve mission first, the Duna second. Do adjustment burns halfway for both. Eve mission arrives first... everything is fine. Say I land on Gilly, do some science. the Duna mission arrives and I realise I\u0027ve forgotten some major mission critical element, which can\u0027t be worked around. If your me.... you have to revert all the way, back to the Duna launch. It can be heart breaking.\u003C/p\u003E\n"}]}