{"TopicId":123208,"ForumId":32,"TopicTitle":"Squadcast Summary 2015/10/16 - Two Types of DC, and Two Types of ISRU","CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-10-17T02:14:09Z","PageNum":4,"Articles":[{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-10-17T18:34:17Z","Content":"\n\u003Cp\u003EYou do realize, guys, that I answered these same balance questions and concerns in the prior post? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-10-17T18:42:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003ESolution for a kerbal ragdolling down a hill: \u003Cp\u003EPress Alt-F12\u003C/p\u003E\u003Cp\u003EClick \u0022Hack Gravity\u0022\u003C/p\u003E\u003Cp\u003EStabilize your kerbal.\u003C/p\u003E\u003Cp\u003EClick \u0022Unhack Gravity\u0022\u003C/p\u003E\u003Cp\u003EYou\u0027re done!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne problem: Your lander will explode when you unhack gravity.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003ESo to hop in on the ISRU discussion (as always, I like to do the early reveals so we get a chance for constructive feedback).\u003Cp\u003EUsual caveats, anything below is subject to change based on QA, experimentals, etc.\u003C/p\u003E\u003Cp\u003EThere has been a thermal overhaul on ISRUs and drills - this is not insignificant, since now it\u0027s an extremely effective lever.\u003C/p\u003E\u003Cp\u003EThe mini ISRU is not as efficient cooling, cannot make monoprop, and is significantly less efficient (both in terms of ore use, making it a very poor choice for those \u0027ore powered ships\u0027 out there, and in terms of raw speed.\u003C/p\u003E\u003Cp\u003EI recognize that any efficiency number is out the window if you can just \u0027warp to infinity and get all your stuffs\u0027. This has been addressed in the case of the mini ISRU - it is optimized for relatively short operation cycles - i.e. it\u0027s the wrong bit to use for your mining base because it cannot operate for years on end without a break. But it\u0027s excellent if you just need to do short-term conversions (i.e. refueling a biome hopper, etc.).\u003C/p\u003E\u003Cp\u003ERadiators will be important - critical - for ISRUs and drills. That being said, if you have one of the 2.5m ones out there on a ship with no radiators, you will still be able to operate, but the efficiency will be very low since it will overheat quickly (but not down to zero in the case of the 2.5m ones - they will tend to hit equilibrium with a net positive in processing capabilities).\u003C/p\u003E\u003Cp\u003EThe design choice here is to provide two very clear options with each one having it\u0027s benefits and drawbacks. A large, more robust ISRU for bases and such where you want continuous, unattended operations, and a smaller, less industrial-grade one that\u0027s better for quick fuel runs. Take your pick.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI love the safety mechanism on the ISRU idea.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vallius\u0022 data-cite=\u0022Vallius\u0022\u003E\u003Cdiv\u003EHow would we balance out a smaller drill? Maybe it couldn\u0027t pick up materials as quickly, or overheats easier? Perhaps it could realistically cut down the ability to grab resource from a location even more? Just some engineering thoughts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it was shorter, it would be less useful for every craft.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-10-17T19:18:56Z","Content":"\n\u003Cp\u003EA reminder of how elegant it used to be with Kethane\u0027s small drills.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/oEyvuQkDxUA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-10-17T19:28:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joonatan1998\u0022 data-cite=\u0022Joonatan1998\u0022\u003E\u003Cdiv\u003ESince it is easy to carry to the surface, that is basically the same as just making it work slower.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut if you did have it in space, you would lose mass. Heck, maybe even make it work faster but still lose mass, so it would still take the same amount of time.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-10-17T19:30:24Z","Content":"\n\u003Cp\u003EI did like Kethane\u0027s smaller drills. I preferred the Baha drills though in the looks department.\u003C/p\u003E\u003Cp\u003EIdeally, I\u0027d like 4 ISRU drills, 2 small and 2 large, one each ventral and radial.\u003C/p\u003E\u003Cp\u003EOh, and Roverdude, great summary and explanation. I quoted you in the OP.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-10-17T19:31:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EYou do realize, guys, that I answered these same balance questions and concerns in the prior post? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003EWhat does the small refinery being bad for long term operation mean in practice?\u003Cp\u003EDoes it just mean that you have to visit the refinery now and the and click to turn it on/off to keep it working?\u003C/p\u003E\u003Cp\u003EI think the reason people are still talking about balance is that not everyone is happy with \u0022the small refinery is same as the larger one, but with annoying click-grind(and without monopropellant)\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-17T20:48:16Z\u0022 title=\u002210/17/2015 08:48  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 17, 2015\u003C/time\u003E by Joonatan1998\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-17T20:27:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EThere has been a thermal overhaul on ISRUs and drills - this is not insignificant, since now it\u0027s an extremely effective lever.\u003C/div\u003E\u003C/blockquote\u003EI\u0027ll wait and see if 1.0.5 fixes things, but relying on what I consider to be the single worst thing in 1.0.x - the broken to heck and back thermal system - does not give me much confidence.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bloody_looser\u0022 data-cite=\u0022Bloody_looser\u0022\u003E\u003Cdiv\u003EYep, since the system is that small, ISRU is not really needed at all in the first place. Though for some reasons SQUAD added it. From that point of view - yeah why not make various sizes.\u003C/div\u003E\u003C/blockquote\u003EISRU equipment is to some extent a \u0022fixed mass\u0022, meaning that there\u0027ll always be ships big enough for the ISRU to be worthwhile.\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-10-17T20:39:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joonatan1998\u0022 data-cite=\u0022Joonatan1998\u0022\u003E\u003Cdiv\u003EWhat does the small refinery being bad for long term operation mean in practice?\u003Cp\u003EDoes it just mean that you have to visit the refinery now and the and click to turn it on/off to keep it working?\u003C/p\u003E\u003Cp\u003EI think the reason people are still talking about balance is that not everyone is happy with \u0022the small refinery is same as the larger one, but with annoying click-grind\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou folks are making a pretty large boatload of assumptions right about now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-10-17T20:44:19Z","Content":"\n\u003Cp\u003ESo why no monoprop from the small isru?\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-10-17T21:07:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EYou folks are making a pretty large boatload of assumptions right about now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy best friend\u0027s sister\u0027s boyfriend\u0027s brother\u0027s girlfriend heard from this guy who knows this kid who\u0027s going with the girl who said that the new ISRU machine would require you to play a mini-game, and the better you did, the more fuel you got per unit of ore.\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-10-17T21:54:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EYou folks are making a pretty large boatload of assumptions right about now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWelcome to the Kerbal Forums!\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-10-17T22:31:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EMy best friend\u0027s sister\u0027s boyfriend\u0027s brother\u0027s girlfriend heard from this guy who knows this kid who\u0027s going with the girl who said that the new ISRU machine would require you to play a mini-game, and the better you did, the more fuel you got per unit of ore.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbal Quick Time Event Simulator!\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-10-17T22:50:01Z","Content":"\n\u003Cp\u003EI love quick time events!\u003C/p\u003E\u003Cp\u003EGood to see a 1.25m ISRU converter. I like the fact it\u0027s kind of worse, but also smaller. A lot of kewl things coming in the update. The small converter is going to be included in 1.0.5, right? Code-wise everything is there, so I assume it will.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-10-17T23:01:49Z","Content":"\n\u003Cp\u003E:/ I found ISRU a bit overpowered already.\u003C/p\u003E\u003Cp\u003EThe mining equipment setup takes the same space as a Rockomax X200-32 Fuel Tank - but masses significantly less.\u003C/p\u003E\u003Cp\u003EAlthough I could swear in 1.02, the drills were .25 or .15 tons... now they are 0.75 tons... that is a step in the right direction.\u003C/p\u003E\u003Cp\u003ETo some extent, I like ISRU, because before I was setting up fuel depots and shipping the fuel all the way from Kerbin... the fuel was precious, and ever little maneuver or biome vist was carefully planned.\u003C/p\u003E\u003Cp\u003EBut now... I\u0027ve found I get quite sloppy with my missions when I\u0027m packing ISRU... because... yea, free fuel, easy to obtain, very little mass addition....\u003C/p\u003E\u003Cp\u003EI\u0027ve started to artificially limit myself to No ISRU missions to make things more challenging (doing reusable to moho and back, no ISRU... the fuel for the return would mass more than the ISRU... so ISRU should be the default option for a moho mission now)\u003C/p\u003E\u003Cp\u003EFuel is easy to get, particularly when I start using monsters like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hTOcaAx.png\u0022 alt=\u0022hTOcaAx.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYea, you could increase the ISRU to 3.75m diameter... double the mass of all ISRU stuff, and it would be fine- barely would notice (its \u0026gt;300 tons full)\u003C/p\u003E\u003Cp\u003ESomething to supply fuel depots cares not about the mass of the ISRU (and for this purpose, bigger is better, because that means less tedious fuelling trips)\u003C/p\u003E\u003Cp\u003EBut now... with the small ISRU... well, why bother with fuel depots at all... everything will just refuel itself when it lands.\u003C/p\u003E\u003Cp\u003EI\u0027m assuming ore isn\u0027t going to be further restricted to make it so that its harder to find a spot with ore?\u003C/p\u003E\u003Cp\u003EWhy bother with staging at all now if its not an eve ascent?\u003C/p\u003E\u003Cp\u003EJust stop and refill.\u003C/p\u003E\u003Cp\u003EAs already explained... this heat mechanic seems to break the laws of physics in our world, and thus in un-intuitive.\u003C/p\u003E\u003Cp\u003E*Doesn\u0027t overheat in the sun... captures some energy from the sun, uses it... now suddenly there is enough energy to overheat it? (the same would go for a RTG powered thing, if the RTG doesn\u0027t overheat it from the start)\u003C/p\u003E\u003Cp\u003EAs to a previous suggestion... I like the idea that these things can wear out, and thus only provide up to a certain amount of fuel.\u003C/p\u003E\u003Cp\u003EI disagree with alshain. its not a time based mechanic... anymore than engines consuming fuel would be.\u003C/p\u003E\u003Cp\u003EIf the small ISRU wore out and broke after a certain amount of fuel had been processed, it would be fine with me.\u003C/p\u003E\u003Cp\u003EThe ISRU could carry 100 units of a resource named something like \u0022durability\u0022.. .and that resource would be like solid fuel/ablator... you can\u0027t refill it.\u003C/p\u003E\u003Cp\u003EAs the ISRU operates, it consumes electric charge, ore, and \u0022durability\u0022... and then when durability runs out... its as useless as an empty SRB casing.\u003C/p\u003E\u003Cp\u003EThe larger one would be more durable and maintenence friendly.. and thus lasts a long time/does not wear out\u003C/p\u003E\u003Cp\u003E(idea: it also consumes durability units, but can regenerate durability for itself if it has an engineer on board)\u003C/p\u003E\u003Cp\u003EOr, Durability could be a transferable resource, and you could have a part that is like a \u0022spare parts canister\u0022 that stores \u0022durability\u0022 units (with the lore behind it being that the spare parts are used to repair/replace the broken ISRU... akin to rebuilding an engine).\u003C/p\u003E\u003Cp\u003EI like this idea... the small ISRU should break down after producing a certain amount of fuel!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-17T23:05:45Z\u0022 title=\u002210/17/2015 11:05  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 17, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-10-17T23:14:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022passinglurker\u0022 data-cite=\u0022passinglurker\u0022\u003E\u003Cdiv\u003ESo why no monoprop from the small isru?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe small one is an simplified version who has lower performance and don\u0027t have that extra complexity. It will be something you put on an large probe or an smaller lander, you use monoprop to dock, do minor adjustments and to turn huge ships. \u003C/p\u003E\u003Cp\u003EYou can still carry some for docking and have more in the mothership. \u003C/p\u003E\u003Cp\u003EMy 500 ton orion uses the vernier engines only 8 groups of 4 engines. Then finding I have 2000 liter monoprop onboard \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-10-17T23:38:54Z","Content":"\n\u003Cp\u003EHere\u0027s an idea for the mini-ISRU balance:\u003C/p\u003E\u003Cp\u003EBig ISRU: High efficiency (87% Ore to Resource conversion) and comparatively small power drain (though still far more than the small ISRU)\u003C/p\u003E\u003Cp\u003ESmall ISRU: Low efficiency (60% Ore to Resource conversion) and higher power drain for its size.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EMy best friend\u0027s sister\u0027s boyfriend\u0027s brother\u0027s girlfriend heard from this guy who knows this kid who\u0027s going with the girl who said that the new ISRU machine would require you to play a mini-game, and the better you did, the more fuel you got per unit of ore.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI made myself map out that string of separation before reading the punchline. That made my day better.\u003C/p\u003E\n"},{"CreatedByName":"manaiaK","CreatedById":129599,"CreatedDateTime":"2015-10-18T00:08:30Z","Content":"\n\u003Cp\u003EGreg: Big vs small ISRU: read roverdude\u0027s comment on page 5 or so. He knows how you think and anticipated you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It\u0027s pretty clever actually; I think it will enhance the game.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-10-18T00:14:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EI\u0027ve started to artificially limit myself to No ISRU missions to make things more challenging\u003C/div\u003E\u003C/blockquote\u003ESo basically what you\u0027re saying is you figured out how to play a sandbox game? Good for you!\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-10-18T00:38:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EOr, Durability could be a transferable resource, and you could have a part that is like a \u0022spare parts canister\u0022 that stores \u0022durability\u0022 units (with the lore behind it being that the spare parts are used to repair/replace the broken ISRU... akin to rebuilding an engine).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had an idea ages ago that instead of harvesting ore, the intermediary resource would be on the front end in the form of a catalyst. You could process fuel with a drill rig and a converter using this catalyst at a ratio of like 25:1. I thought it was a nice way to avoid infini-fuel, but in the end I had to ask myself if it was too complicated to be fun. I mean I think its obvious that the current resource system is simplified compared to real life, and is pretty forgiving even from a balance standpoint. Still, it takes some effort to make it work, and I have to say I\u0027ve had fun with it so I\u0027m pretty happy. The scanning and landing process is also quite well executed.\u003C/p\u003E\u003Cp\u003EI really do hope we get LS at some point, and if that happened all of a sudden there would be a real cost to time-warping. It could also be that only the large converter could produce LS, which would be an important bit of balance.\u003C/p\u003E\n"},{"CreatedByName":"NFUN","CreatedById":78715,"CreatedDateTime":"2015-10-18T01:11:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022 data-cite=\u0022Pthigrivi\u0022\u003E\u003Cdiv\u003EI had an idea ages ago that instead of harvesting ore, the intermediary resource would be on the front end in the form of a catalyst. You could process fuel with a drill rig and a converter using this catalyst at a ratio of like 25:1. I thought it was a nice way to avoid infini-fuel, but in the end I had to ask myself if it was too complicated to be fun. I mean I think its obvious that the current resource system is simplified compared to real life, and is pretty forgiving even from a balance standpoint. Still, it takes some effort to make it work, and I have to say I\u0027ve had fun with it so I\u0027m pretty happy. The scanning and landing process is also quite well executed.\u003Cp\u003EI really do hope we get LS at some point, and if that happened all of a sudden there would be a real cost to time-warping. It could also be that only the large converter could produce LS, which would be an important bit of balance.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy definition, catalysts aren\u0027t used up during a reaction. \u003Cspan style=\u0022font-size:8px;\u0022\u003EI\u0027m sure somebody will argue that they can be lost through exhaust or other reactions over time, but shush.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-10-18T01:27:12Z","Content":"\n\u003Cp\u003EYeah I mean there was more than one thing wrong with this proposal haha.. seed fuel if you prefer.\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-10-18T03:43:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EThe small one is an simplified version who has lower performance and don\u0027t have that extra complexity. It will be something you put on an large probe or an smaller lander, you use monoprop to dock, do minor adjustments and to turn huge ships. \u003Cp\u003EYou can still carry some for docking and have more in the mothership. \u003C/p\u003E\u003Cp\u003EMy 500 ton orion uses the vernier engines only 8 groups of 4 engines. Then finding I have 2000 liter monoprop onboard \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe problem I see is that it\u0027ll encourage players to spam LFO based rcs on even small ships jacking up part counts and it doesn\u0027t help that rcs ports cause more lag than other parts due to their use of resources\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-10-18T06:33:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NFUN\u0022 data-cite=\u0022NFUN\u0022\u003E\u003Cdiv\u003EBy definition, catalysts aren\u0027t used up during a reaction. \u003Cspan style=\u0022font-size:8px;\u0022\u003EI\u0027m sure somebody will argue that they can be lost through exhaust or other reactions over time, but shush.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome catalysts are worn down over time by secondary reactions. You also have mechanical wear. \u003C/p\u003E\u003Cp\u003EOne idea is to have durability, now as we can not swap out parts deep inside huge ships and having everything modular would be an pain who not do it simple.\u003C/p\u003E\u003Cp\u003EMake durability an resource. take ISRU durability as one, then it get low you can dock another ISRU refinery and transfer durability to the one in the ship, you can now dump the empty one. Think of it as chopping up the new and switch out worn part. US air force does this a lot.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022passinglurker\u0022 data-cite=\u0022passinglurker\u0022\u003E\u003Cdiv\u003Ethe problem I see is that it\u0027ll encourage players to spam LFO based rcs on even small ships jacking up part counts and it doesn\u0027t help that rcs ports cause more lag than other parts due to their use of resources\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree, I tend not to put RCS on small landers myself to save weight, rather dock the mothership to lander to move it, to refuel I use KAS.\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-10-18T08:19:31Z","Content":"\n\u003Cp\u003ESmaller ore tank pls\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-10-18T08:44:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003ESome catalysts are worn down over time by secondary reactions. You also have mechanical wear. \u003Cp\u003EOne idea is to have durability, now as we can not swap out parts deep inside huge ships and having everything modular would be an pain who not do it simple.\u003C/p\u003E\u003Cp\u003EMake durability an resource. take ISRU durability as one, then it get low you can dock another ISRU refinery and transfer durability to the one in the ship, you can now dump the empty one. Think of it as chopping up the new and switch out worn part. US air force does this a lot.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI agree, I tend not to put RCS on small landers myself to save weight, rather dock the mothership to lander to move it, to refuel I use KAS.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EI tend to use RLA for smaller rcs ports\u003C/span\u003E but that\u0027s besides the point the exclusion of monoprop seems arbitrary to me \u003Cspan style=\u0022font-size:8px;\u0022\u003E(like excluding xenon instead of simply making it cheap enough to not be exploitable)\u003C/span\u003E. No monoprop isn\u0027t a limitation, it\u0027s just an annoyance, an inconvenience. You don\u0027t lose self sufficiency because you can just use lfo rcs instead therefore any disadvantage it may have in not making monoprop is essentially moot, but more lfo rcs means using more resource using parts negatively affecting game performance due to how the game is coded. so instead it should be able to make monoprop to encourage the use of a fewer number of standard rcs ports thereby promoting good vehicle building practices so we don\u0027t get complaints about game performance because people are spamming verners trying to exploit the new isru size \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(speaking of xenon seriously most dv ranges can be done lighter, cheaper, and lower tech using LFO, and even at the high range where xenon is supposed to shine even without isru a giant lfo probe\u002Bgiant rocket to lift it is still cheaper than an ion probe with equivalent dv and the lfo probe doesn\u0027t need to worry about the sun or kick burns! xenon needs to be cheaper! or buffed but I imagine that wouldn\u0027t go over well I mean where would you go with that much dv?)\u003C/span\u003E\u003C/p\u003E\n"}]}