{"TopicId":125736,"ForumId":32,"TopicTitle":"Eve re-entry impossible due to overheating","CreatedByName":"Makki","CreatedById":153711,"CreatedDateTime":"2015-11-17T18:36:47Z","PageNum":1,"Articles":[{"CreatedByName":"Makki","CreatedById":153711,"CreatedDateTime":"2015-11-17T18:36:47Z","Content":"\nSo I\u0026#39;ve been trying to land on and return from Eve since May this year. It\u0026#39;s been pretty challenging so far, and I\u0026#39;ve had to try many different designs, but none of them has worked. The biggest problem with this mission hasn\u0026#39;t been the ascent, but rather the descent to Eve\u0026#39;s surface. It just seems impossible to design a craft that can both decent to the surface without burning up, while also being big enough to ascent from it\u0026#39;s thick atmosphere and strong gravity.\u003Cbr\u003E\n\u003Cbr\u003E\nNote: I play with Re-entry heating at 100%\u003Cbr\u003E\n\u003Cbr\u003E\nNote: I play stock KSP 1.05 (no mods added)\u003Cbr\u003E\n\u003Cbr\u003E\nNote: How do I spoiler-tag images? They take a lot of space.\u003Cbr\u003E\n\u003Cbr\u003E\nKeep in mind you are more than welcome to tell me about improvements I could make to my design. I don\u0026#39;t mind being educated on this topic.\u003Cbr\u003E\n\u003Cbr\u003E\nThis is the lander I\u0026#39;ve been using. The design was copied from another thread somewhere on this forum. As far as I\u0026#39;ve heard it should be big enough to ascent from Eve, but I haven\u0026#39;t tried it yet.\u003Cbr\u003E\n[IMG]http://i.imgur.com/BeP01Cn.png[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nThe lander weighs a total of 138 tonnes with parachutes, landing gear and heatshields.\u003Cbr\u003E\n\u003Cbr\u003E\nI also added some A.I.R.B.R.A.K.E.S to further slow down my craft as it descent into the atmosphere:\u003Cbr\u003E\n[IMG]http://i.imgur.com/4WnwPfF.png[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nThis is a picture of the transfer stage I managed to get in orbit around Kerbin (phew that wasn\u0026#39;t easy). \u003Cbr\u003E\nIt weighs a total of 967 tonnes. \u003Cbr\u003E\nIt also has a total delta-v of 4632 m/s , which is more than enough to get from Kerbin to Eve, and circularise the orbit.\u003Cbr\u003E\n[IMG]http://i.imgur.com/lsuxGW8.png[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nWhen I arrived at Eve and circularised my orbit, I dropped my apoapsis down to 95 km and my periapsis to 60 km. This was done to minimize the thermal heating from the atmosphere. And thus began my descent.\u003Cbr\u003E\n\u003Cbr\u003E\nHere is a picture of my ship at an altitude of 74 km:\u003Cbr\u003E\n[IMG]http://i.imgur.com/9oYPzHB.png[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nAlready my ship is burning hot. In fact I\u0026#39;m surprised it hasn\u0026#39;t exploded yet... Aside from that my ship also started tilting to one side, and I tried preventing that by using SAS to keep it pointed away from the heat. Sadly without success as you can see.\u003Cbr\u003E\n\u003Cbr\u003E\nHere\u0026#39;s a picture of my ship at an altitude of 71.4 km:\u003Cbr\u003E\n[IMG]http://i.imgur.com/UYSS2Kb.png[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nAt this point my Airbrakes have already exploded due to overheating, even though their job was to prevent it...\u003Cbr\u003E\nAnd why doesn\u0026#39;t the heat shield work... Like seriously.\u003Cbr\u003E\nAlso on the left notice how my 4 main engines are overheating? They are positioned directly behind the heat shield so that shouldn\u0026#39;t even be physically possible?!\u003Cbr\u003E\n\u003Cbr\u003E\n[IMG]http://i.imgur.com/zY2nCTC.png[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nAnd finally the inevitable happened. My ship didn\u0026#39;t even get below an altitude of 70 km before it exploded. \u003Cbr\u003E\nI just don\u0026#39;t see any way for this to have been possible. It\u0026#39;s the most frustrating challenge I\u0026#39;ve faced since I started playing KSP.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd I thought Squad had fixed this issue with their recent update with the so called \u0022Thermal Improvement\u0022 . Clearly it hasn\u0026#39;t improved at all.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd yes I could just reduce the heating from re-entry, but I consider that cheating... Might aswel remove it entirely then.\u003Cbr\u003E\n\u003Cbr\u003E\nKSP is such a fun game, but this problem is just too big for me to ignore. I doubt I will be playing this game for much longer if they don\u0026#39;t find a way to fix this.\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2015-11-17T19:51:55Z","Content":"\nwhat... didnt this thread have posts before?\u003Cbr\u003E\nforum, go home, your drunk!\u003Cbr\u003E\n\u003Cbr\u003E\nedit:\u003Cbr\u003E\noh, different thread.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-17T19:55:23Z\u0022 title=\u002211/17/2015 07:55  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 17, 2015\u003C/time\u003E by Deadpangod3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-11-17T19:58:26Z","Content":"\nAhh Makki posted twice due to the moderation queue, I better close this one.\n"}]}