{"TopicId":125732,"ForumId":32,"TopicTitle":"Can we talk about the new MK I cockpit","CreatedByName":"Dr Farnsworth","CreatedById":147177,"CreatedDateTime":"2015-11-17T17:53:38Z","PageNum":1,"Articles":[{"CreatedByName":"Dr Farnsworth","CreatedById":147177,"CreatedDateTime":"2015-11-17T17:53:38Z","Content":"\nThe new MK I cockpit is awesome! Love it. I also love the previous version on the Mk I cockpit.\u003Cbr\u003E\nFor jets and planes the new Mk I is perfect. However, I would prefer to use the previous version cockpit for spacecraft/ space-planes.\u003Cbr\u003E\n\u003Cbr\u003E\n[IMG]http://i.imgur.com/Abh4j4L.png[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nIs there any reason we can not have both at our disposal?\u003Cbr\u003E\nPPPLLLLEEEAAASSSEEEE.\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-11-17T17:55:29Z","Content":"\nDrag it out of an old download, rename it and paste it in to your current install?\n"},{"CreatedByName":"Choctofliatrio","CreatedById":153260,"CreatedDateTime":"2015-11-17T17:58:39Z","Content":"\nDo they have different stats?\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-11-17T17:58:42Z","Content":"\n[quote name=\u0027Pecan\u0027]Drag it out of an old download, rename it and paste it in to your current install?[/QUOTE]\u003Cbr\u003E\nThis. No need to have two parts that are functionally identical in the game, IMO.\n"},{"CreatedByName":"Melfice","CreatedById":3143,"CreatedDateTime":"2015-11-17T17:58:42Z","Content":"\n[quote name=\u0027Pecan\u0027]Drag it out of an old download, rename it and paste it in to your current install?[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nOr wait for the obligatory \u0022THE OLD PARTS WERE BETTER YOU SHOULD HAVE NEVER CHANGED A THING YOU\u0026#39;RE LITERALLY WORSE THAN HITLER\u0022 mod somebody is going to release.\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-17T18:05:33Z","Content":"\nI like the new cockpit (although i wish it had a 0.6m node on nose instead of that overly long spike that you cant attach anything to), but the main reason im against adding the old one in stock is that like most of the older parts, it was very inefficient on resources. The way new pats work is that one, many of them share a single texture and pull different UV maps from it, and two, the new stuff is just better optimized. If you like the old pit, then as poster above said, you can ALWAYS add it alongside by renaming it to some different name in the part.cfg, and placing it in either squad\u0026#39;s folder or a new mod folder.\u003Cbr\u003E\n\u003Cbr\u003E\nGive it a few more weeks and someone will come out with a pack of old part models for everyone to use. Ive already seen people reusing the old models for custom parts like say a jet engine that works on duna, or stuff of that general style.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, i know this may sound selfish, but i NEVER seriously used that nose mounted MK1 cockpit in 90% of my designs. WHat sort of idiotic pilot wants to be in the front of their fighter, when the usual spot they are taking heavy flak fire from is the front! Frontal cockpits are unsafe when doing head on attacks vs capital ships!\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2015-11-17T18:13:09Z","Content":"\n[quote name=\u0027Pecan\u0027]Drag it out of an old download, rename it and paste it in to your current install?[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nWhere would you find it in the install? I thought it would be in the parts folder, but that\u0026#39;s empty.\n"},{"CreatedByName":"Dr Farnsworth","CreatedById":147177,"CreatedDateTime":"2015-11-17T18:14:11Z","Content":"\nPlease don\u0026#39;t think that I am being a complainer. I am just finding myself wishing I had more cockpit choices for purely aesthetic reasons. Am I the only one who is feeling this way?\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-11-17T18:15:17Z","Content":"\n[quote name=\u0027Scarecrow88\u0027]Where would you find it in the install? I thought it would be in the parts folder, but that\u0026#39;s empty.[/QUOTE]\u003Cbr\u003E\n\u0026#092;GameData\u0026#092;Squad\u0026#092;Parts\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-11-17T18:36:58Z","Content":"\n[quote name=\u0027Red Iron Crown\u0027]\u0026#092;GameData\u0026#092;Squad\u0026#092;Parts[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\n... \u0026#092;Command\u0026#092;mk1Cockpit\u0026#092;\u003Cbr\u003E\n(at a guess, based on the name - that\u0026#39;s from 1.0.4 and I didn\u0026#39;t actually [I]look[/I] to see if it was the correct part)\u003Cbr\u003E\n\u003Cbr\u003E\nETA: For those that don\u0026#39;t know - Squad have been [I]very[/I] kind in the arrangement and organisation of parts like this, mostly so modders can do their stuff with relative ease. It also makes it easy to add or remove parts yourself when you know a little bit of what goes where. If you want to save a little memory and there is a part you never use ... just delete its folder and re-start the game. Make sure you keep a copy of the whole download/install somewhere, just in case; there are some dependencies between parts IIRC.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-17T18:42:45Z\u0022 title=\u002211/17/2015 06:42  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 17, 2015\u003C/time\u003E by Pecan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-11-17T18:57:29Z","Content":"\n[quote name=\u0027Dr Farnsworth\u0027]Please don\u0026#39;t think that I am being a complainer. I am just finding myself wishing I had more cockpit choices for purely aesthetic reasons. Am I the only one who is feeling this way?[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nNope, you\u0026#39;re not the only one. I would like to see about four or five stock Mk 1 cockpits. Ideally, I\u0026#39;d like to see a stock two-kerbal cockpit as well. Perhaps one day...\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2015-11-17T18:59:15Z","Content":"\n[quote name=\u0027Red Iron Crown\u0027]This. No need to have two parts that are functionally identical in the game, IMO.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nI do agree with this.\u003Cbr\u003E\n\u003Cbr\u003E\nI don\u0026#39;t have a preference between the old and new versions so I\u0026#39;m not too bothered, but if the the old one was brought back slightly stretched as a tandem two seater then I\u0026#39;d be in favour. Maybe tweak the visuals to be a bit closer to the in line cockpit though.\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-11-17T19:52:57Z","Content":"\nWhile I have to admit the new cockpit is extremely nice, I still prefer the old one, especially for early-game space planes, and I will undoubtedly mod it back in when I start seriously playing 1.0.5. \u003Cbr\u003E\n\u003Cbr\u003E\nWhat I\u0026#39;d [I]really[/I] like to see is a revision to the old Mk1 along the lines of what happened to the Mk1 inline between 0.90 and 1.0: same basic idea (more Bell X-2 than Lear jet), just a nicer and more optimized model. I don\u0026#39;t understand why it was replaced by a completely different design.\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-11-17T20:12:34Z","Content":"\nWell, the modding option is there, of course, but that doesn\u0026#39;t take much from the argument... when you look at it, the new Mk1 is a plane cockpit, period. Gorgeous, but it only looks right when flying in an atmosphere, and plain ridiculous on top of a rocket. The old Mk1 was much more... open ended? Short of like the shuttle parts: it is very difficult to use them in a modular fashion like the old aero parts, constricting the kind of designs that you can use and look right, at least in my eyes.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd now I have jumped track and I think this rant has turned on a general criticism of Porkjet\u0026#39;s parts.... but I\u0026#39;ll go with it, because I am inspired. Don\u0026#39;t get me wrong, most of them are awesome and the quality is consistently spectacular, but some of them are just too... constrained would be the word, I guess. They seem to look right only on a certain use, and put together in a particular order and fashion. Try to do a wing for a \u0026gt;100mT plane and you will see exactly what I mean, you will end up using the medium-size modular wing parts (with the consequent part count increase) or having a clipped mess that looks awful. Or the shuttle cockpit, which you immediately recognized when I called it \u0022the shuttle cockpit\u0022. [I]That thing will only ever look as good it\u0026#39;s supposed to on top of a shuttle replica[/I]. Compared to the infinite variety of ships that KSP has spawned over the years, I feel like that is a fair warning to shout to the devs: we are in this because it is the LEGO of rockets, so do everything you can to stick to that spirit of options and variety, and offer only the slightest guidance... this game is, at its glorious green heart, a sandbox universe to toy with. Keep it as open as you can, please!\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nRune. But yeah... I want my old Mk1 back too. ;)\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-17T21:22:01Z\u0022 title=\u002211/17/2015 09:22  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 17, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003Cbr\u003ETypo, as always ^^\u0026#039;\n\u003C/span\u003E\n"},{"CreatedByName":"Halban","CreatedById":89536,"CreatedDateTime":"2015-11-17T20:30:57Z","Content":"\n[quote name=\u0027Rune\u0027]Rune. But yeah... I want my old Mk1 back too. ;)[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nYes. \u003Cbr\u003E\n\u003Cbr\u003E\nAnyway, once you get to a certain point in this game it becomes a lot more about aesthetics, so it makes sense to have plenty of options, as well as the ability to craft unique shapes and designs from more adaptable parts - hence the problem with most the new aero parts. [I]Especially[/I] since the other option has already been created and was in the game for an awful long time, loved by many for embodying the \u0026#39;ace pilot\u0026#39; aspect of KSP lore with Jebediah and such.\n"},{"CreatedByName":"Dr Farnsworth","CreatedById":147177,"CreatedDateTime":"2015-11-17T20:44:51Z","Content":"\n[quote name=\u0027Rune\u0027]Well, the modding option is there, of course, but that doesn\u0026#39;t take much from the argument... when you look at it, the new Mk1 is a plane cockpit, period. Gorgeous, but it only looks right when flying in an atmosphere, and play ridiculous on top of a rocket. The old Mk1 was much more... open ended? Short of like the shuttle parts: it is very difficult to use them in a modular fashion like the old aero parts, constricting the kind of designs that you can use and look right, at least in my eyes.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd now I have jumped track and I think this rant has turned on a general criticism of Porkjet\u0026#39;s parts.... but I\u0026#39;ll go with it, because I am inspired. Don\u0026#39;t get me wrong, most of them are awesome and the quality is consistently spectacular, but some of them are just too... constrained would be the word, I guess. They seem to look right only on a certain use, and put together in a particular order and fashion. Try to do a wing for a \u0026gt;100mT plane and you will see exactly what I mean, you will end up using the medium-size modular wing parts (with the consequent part count increase) or having a clipped mess that looks awful. Or the shuttle cockpit, which you immediately recognized when I called it \u0022the shuttle cockpit\u0022. [I]That thing will only ever look as good as good it\u0026#39;s supposed to on top of a shuttle replica[/I]. Compared to the infinite variety of ships that KSP has spawned over the years, I feel like that is a fair warning to shout to the devs: we are in this because it is the LEGO of rockets, so do everything you can to stick to that spirit of options and variety, and offer only the slightest guidance... this game is, at its glorious green heart, a sandbox universe to toy with. Keep it as open as you can, please!\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nRune. But yeah... I want my old Mk1 back too. ;)[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThank you Rune, I could not have said it better myself. \u003Cbr\u003E\n\u003Cbr\u003E\nI want to reiterate, I don\u0026#39;t want this to be a rant post against KSP or the new MKI cockpit. \u003Cbr\u003E\n\u003Cbr\u003E\nI am just asking if Squad would consider adding some variety in this arena, and to Rune\u0026#39;s point with the MKIII, maybe some other places as well.\n"},{"CreatedByName":"JTpopcorn","CreatedById":130311,"CreatedDateTime":"2015-11-17T21:10:43Z","Content":"\nIs it possible to have a button to toggle textures/colliders of the part. I know mods have had that feature to switch between part varients, B9 had/has it.\u003Cbr\u003E\n-JT\n"},{"CreatedByName":"Skyentist","CreatedById":107333,"CreatedDateTime":"2015-11-17T21:12:26Z","Content":"\nYeah, I wish we had the old cockpit to use as well.\u003Cbr\u003E\n\u003Cbr\u003E\nEspecially if you\u0026#39;re going to give me fighter jet engines in the same update, just saying.\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-11-17T21:31:13Z","Content":"\nI agree that two redundant parts would be undesirable, so I\u0026#39;m all for adding in a fighter cockpit with different stats. Perhaps the plane cockpit can be light and have a high crash tolerance, while the fighter cockpit has a high thermal tolerance and more monopropellant.\u003Cbr\u003E\nWe have lots of 1.25m engines, so why not have two 1.25m cockpits, if they serve different roles?\n"},{"CreatedByName":"SpenSpaceCorp","CreatedById":98977,"CreatedDateTime":"2015-11-17T21:31:45Z","Content":"\nI love the new one, but also wish we had a refined version of the old one.\u003Cbr\u003E\n\u003Cbr\u003E\nEDIT: a refined one that fits into a slightly different niche.\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-11-17T21:36:37Z","Content":"\nTo be honest the old one is a bit too narrow and the IVA was poor, it\u0026#39;d be better to have a new cockpit in the style of the Mk1 inline, but with a .6m front node.\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-11-17T21:47:41Z","Content":"\n[quote name=\u0027Rune\u0027] a general criticism of Porkjet\u0026#39;s parts.... but I\u0026#39;ll go with it, because I am inspired. Don\u0026#39;t get me wrong, most of them are awesome and the quality is consistently spectacular, but some of them are just too... constrained would be the word, I guess.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThis. Absolutely this.\u003Cbr\u003E\n\u003Cbr\u003E\nThey look great and slick and only really work well among each other. The Mk3 pieces are delightfully art deco, but if you slip in a single reaction wheel it will ruin the looks. Mk2 parts are more versatile, but have a strong tendency to turn into SR-71 replicas.\n"},{"CreatedByName":"Moarmau5","CreatedById":148243,"CreatedDateTime":"2015-11-17T22:07:23Z","Content":"\n[quote name=\u0027Melfice\u0027]Or wait for the obligatory \u0022THE OLD PARTS WERE BETTER YOU SHOULD HAVE NEVER CHANGED A THING YOU\u0026#39;RE LITERALLY WORSE THAN HITLER\u0022 mod somebody is going to release.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nCould not have said it any better :D\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-11-17T22:21:46Z","Content":"\n[URL=\u0022http://i91.photobucket.com/albums/k297/monsterzero_jr/blitz.jpg\u0022]I\u0026#39;d rather have a high visibility full-glass cockpit than that ugly thing back.[/URL]\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-11-17T23:06:54Z","Content":"\nI was never really a fan of the old one, it wasn\u0026#39;t very pretty. Also I like the civilian look of the new cockpit... in my head-canon, Kerbal-kind were too focused on blasting themselves to the stars, than blasting each-other to smithereens (although in the process of going to space they have inadvertently blasted no small number of Kerbal\u0026#39;s to smithereens.) \u003Cbr\u003E\n\u003Cbr\u003E\nI also never really used the Mk1 in space, my preference was always the Mk2. Its sleek and smooth.\u003Cbr\u003E\n\u003Cbr\u003E\nBut, on the other-hand, if the question is should both be included in stock? I\u0026#39;m always in favor of more choice. I\u0026#39;d especially like it if they reworked it to be less Top-Gun and more Bell X-1.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-17T23:11:10Z\u0022 title=\u002211/17/2015 11:11  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 17, 2015\u003C/time\u003E by Tourist\u003C/strong\u003E\n\u003C/span\u003E\n"}]}