{"TopicId":126231,"ForumId":32,"TopicTitle":"Happy Birthday *my* KSP","CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-11-23T02:28:55Z","PageNum":1,"Articles":[{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-11-23T02:28:55Z","Content":"\nFriday 27th will mark the second birthday of when I started KSP (I\u0026#39;ll probably forget if I don\u0026#39;t post this now).\u003Cbr\u003E\nThere is no particular point to this post apart from that so the TL;DR version is - thanks Squad.\u003Cbr\u003E\n\u003Cbr\u003E\nOn that date I tripped-over an online article that mentioned it and downloaded the demo to see if it would work on my ancient machine.\u003Cbr\u003E\nSeveral hours later, when I escaped the dream, I decided I had to get the full game. (Actually, to be honest, I did think about it for a couple of days because my lifestyle is largely self-sufficient and buyng [I]anything[/I] is a fairly major decision but this one was only ever going to go one way).\u003Cbr\u003E\nIt took me a while after that to find a method of payment I could use, mostly because I\u0026#39;d never heard of the online systems.\u003Cbr\u003E\nI see from the save dates on my old backups that I finally got 0.22 on the 8th December.\u003Cbr\u003E\nAt the, early-access, time I thought it was better and more complete than most \u0022Best Seller\u0022 games I\u0026#39;d ever bought (looking at you EA; learn what value for money means)\u003Cbr\u003E\nSince then I\u0026#39;ve played thousands of hours on 0.23, 0.24. 0.25, 0.90, 1.0 and 1.0.5, along with their patches (and I\u0026#39;m not quibbling about version-numbering, I just think 1.0.5 is such a big release it deserves separate mention).\u003Cbr\u003E\nIf we\u0026#39;re good Squad might bring us 1.1 for Christmas - remember children, you have to go to bed early or father christmas won\u0026#39;t come.\u003Cbr\u003E\n\u003Cbr\u003E\nThe last software artefact that held my interest so much was Second Life, which has the advantage of embedded programming and is essentially entirely about modding everything. In the end though the question was \u0022what am I learning here?\u0022, what\u0026#39;s the use of this?\u003Cbr\u003E\nThe Total War and Elder Scrolls games might, between them, occupy as much of my time but are, when all\u0026#39;s said and done, pure escapism.\u003Cbr\u003E\n\u003Cbr\u003E\nKSP enabled me to recite Tsiolkovsky\u0026#39;s rocket equation in the pub to the bemusement of my peers - what more could you ask? ^^\u003Cbr\u003E\nProbably like most of us I thought I was interested in space-exploration before KSP but had NO idea what it involved. To the extent that my aerospace appreciation has improved, within the limitations of a popular model, I\u0026#39;ve gained even more than the fun of landing on other planets.\u003Cbr\u003E\n\u003Cbr\u003E\nAnyway; the community is moving on, as the game itself is and as the game becomes more popular.\u003Cbr\u003E\nIt is in the nature of such things that the early-adopters (and, yes, I know \u0026#39;only\u0026#39; 2 years makes me a relative newcomer amongst you) will want more of the same; it\u0026#39;s what we signed-up for after all.\u003Cbr\u003E\nIn KSP\u0026#39;s case I think I can get away with saying that most of us want(ed) it harder/more realistic with more engineering challenges. On the other hand the wider and more commercial market wants it simpler and more \u0026#39;flat-pack\u0026#39; - here is your moon kit, etc. - more \u0026#39;Earth\u0026#39; (shuttles) and more laser-sci-fi shooting.\u003Cbr\u003E\nThat is a great simplification on both sides, of course, and for all the complaints about every update there are several things I\u0026#39;ve taken particular note of with Squad:\u003Cbr\u003E\n[list]\u003Cbr\u003E\n[*]There have [B]been[/B] updates, not just bug-fixes\u003Cbr\u003E\n[*]They haven\u0026#39;t cost me another penny\u003Cbr\u003E\n[*]New functionality has tended to be what the community shouted for, maybe after some delay, even at the cost of the things the developers would rather have done\u003Cbr\u003E\n[*]At least twice development has continued when I would have closed it pending \u0022Version 2\u0022, at extra cost ^^\u003Cbr\u003E\n[*]Even to the extent of not wanting to be given a copyright accreditation they don\u0026#39;t want anything to cost you any more!\u003Cbr\u003E\n[*]We still don\u0026#39;t really know who owns KSP - the software says Squad and the website \u0022Deported\u0022 - so probably one or the other will sue me for the manuals I\u0026#39;m publishing\u003Cbr\u003E\n[/list]\u003Cbr\u003E\n\u003Cbr\u003E\nKSP has come a long way, not just from when I started, and continues to make progress. Be careful what you wish for - Squad (or whoever) seem to be pretty good at giving it to us.\u003Cbr\u003E\n\u003Cbr\u003E\nThanks Squad\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2015-11-23T07:29:29Z","Content":"\nWell, Happy Kerb day! While scrolling through the forums, and I see \u0022Pecan\u0022 associated to a thread, I always read it. Your input is informative and interesting. Hope you stick around here for a while. And yeah, bring on those manuals!\n"},{"CreatedByName":"Geher","CreatedById":116288,"CreatedDateTime":"2015-11-23T08:08:51Z","Content":"\nHappy KSP-day.\u003Cbr\u003E\nRemembers me of the time when I bought the game. It was quite similar: I played the demo for one day and the next day I bought the full version. Normally it takes weeks for me to decide wether I should buy something. But I haven\u0026#39;t regretted it for one second.\n"},{"CreatedByName":"Kyrt Malthorn","CreatedById":149101,"CreatedDateTime":"2015-11-23T08:15:29Z","Content":"\nIf 2 years is a relative newcomer, I\u0026#39;m a total newbie, hehe.\u003Cbr\u003E\n\u003Cbr\u003E\nAmid all the raging forumgoers screaming \u0022this isn\u0026#39;t realistic\u0022, \u0022that\u0026#39;s to hard*\u0022, \u0022such and such is impossible\u0022, and \u0022you broke mah game\u0022, it\u0026#39;s very refreshing to read sometime who\u0026#39;s just as happy with the game\u0026#39;s development and Squad\u0026#39;s commitment as I am.\u003Cbr\u003E\n\u003Cbr\u003E\nI for one wanted to see The Martian in theaters, not Star Wars.... family did not agree. Sigh. Give me a realistic sci fi any day.\u003Cbr\u003E\n\u003Cbr\u003E\n(* isn\u0026#39;t it amazing how often the things they complain about can be toggled in difficulty settings?)\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2015-11-24T01:03:25Z","Content":"\n[quote name=\u0027Kyrt Malthorn\u0027]If 2 years is a relative newcomer, I\u0026#39;m a total newbie, hehe.\u003Cbr\u003E\n\u003Cbr\u003E\nAmid all the raging forumgoers screaming \u0022this isn\u0026#39;t realistic\u0022, \u0022that\u0026#39;s to hard*\u0022, \u0022such and such is impossible\u0022, and \u0022you broke mah game\u0022, it\u0026#39;s very refreshing to read sometime who\u0026#39;s just as happy with the game\u0026#39;s development and Squad\u0026#39;s commitment as I am.\u003Cbr\u003E\n\u003Cbr\u003E\nI for one wanted to see The Martian in theaters, not Star Wars.... family did not agree. Sigh. Give me a realistic sci fi any day.\u003Cbr\u003E\n\u003Cbr\u003E\n(* isn\u0026#39;t it amazing how often the things they complain about can be toggled in difficulty settings?)[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\n\u0022you broke mah game\u0022 Well, you\u0026#39;ve gone and done it. Wouldn\u0026#39;t be surprised if this didn\u0026#39;t start popping up as signatures all over the forums. Too funny. Your\u0026#39;e gettin\u0026#39; one \u002B\n"}]}