{"TopicId":127451,"ForumId":32,"TopicTitle":"Issue with satellite contract.","CreatedByName":"herrozerro","CreatedById":74395,"CreatedDateTime":"2015-12-10T16:26:50Z","PageNum":1,"Articles":[{"CreatedByName":"herrozerro","CreatedById":74395,"CreatedDateTime":"2015-12-10T16:26:50Z","Content":"\n\u003Cp\u003E\nHello all!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve had this happen to me a few times before and I just wanted to ask if there is anything I can do to fix this.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a contract for an equatorial orbit and as far as I can tell it\u0027s dead on.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022https://i.imgur.com/aphy9rQ.png\u0022 alt=\u0022aphy9rQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIs there any kind of way to fix this?  or is the deviation for this contract just too specific?\n\u003C/p\u003E\n\u003Cp\u003E\nI have also noticed that no matter how long i keep the satelite still the maintain stability checkmark never seems to work either.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Matt77","CreatedById":69015,"CreatedDateTime":"2015-12-10T17:16:05Z","Content":"\n\u003Cp\u003E\nIf you press alt-F12 it opens a menu.  Look for \u0022cheats\u0022 and you\u0027ll find an option to mark the contract as complete.\n\u003C/p\u003E\n\u003Cp\u003E\nI used it the first time I matched an orbit and after scratching my head, I noticed the orbit direction dots!  You might be going the wrong way...\n\u003C/p\u003E\n"},{"CreatedByName":"Snarfster","CreatedById":80347,"CreatedDateTime":"2015-12-10T19:41:50Z","Content":"\n\u003Cp\u003E\nWeird, both the contract and MJ say inclination 0, so you\u0027re not heading the wrong way. I\u0027d complete it with the cheat menu, you fulfilled the contract, it\u0027s just not triggering.\n\u003C/p\u003E\n"},{"CreatedByName":"herrozerro","CreatedById":74395,"CreatedDateTime":"2015-12-10T20:56:35Z","Content":"\n\u003Cp\u003E\nThanks for the tip about the cheat menu.  Though I tried it once more with a brand spanking new satellite and it worked.  And just to be sure, both of those were launched before the contract.  The second one was wildly off compared to the first and it worked.\n\u003C/p\u003E\n\u003Cp\u003E\nWeird.\n\u003C/p\u003E\n"}]}