{"TopicId":128320,"ForumId":32,"TopicTitle":"How competent are kerbals?","CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2015-12-21T05:54:05Z","PageNum":1,"Articles":[{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2015-12-21T05:54:05Z","Content":"\n\u003Cp\u003E\nI know there\u0027s a tendency to characterize kerbals as filled with childlike curiosity but pretty dim witted, what with their rockets made up of non-insignificant amount of parts \u0022found by the side of the road\u0022. But in your head canon just exactly how competents are the Kerbals at this rocket science business?\n\u003C/p\u003E\n\u003Cp\u003E\nFor me, it seems like a species who have mastered nuclear physics, some kind of quantum mechanics (hence negative Gravioli) and can put together enough heads to start a space program can\u0027t really be that stupid. Either the kerbals have a lot of geniuses among them that\u0027s much smarter than the average population, or else the average kerbal is actually pretty clever. Sure they approach science and engineering in a much more \u0022hands on\u0022 way than us humans, but they must also be learning rather quickly from all the rockets they blow up, else their society would have never progressed beyond the \u0022sharpen sticks -\u0026gt; stab mammoth\u0022 stage.\n\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2015-12-21T06:04:47Z","Content":"\n\u003Cp\u003E\nYeah, it\u0027s amazing how they can advance there technology to deep space rocketry, without even invented the wheel !\n\u003C/p\u003E\n"},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2015-12-21T06:14:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222330913\u0022 data-ipsquote-contentid=\u0022128320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221450677245\u0022 data-ipsquote-userid=\u002224430\u0022 data-ipsquote-username=\u0022Temstar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Temstar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n... the average kerbal is actually pretty clever. ...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is the answer to me. The sum of all kerbal cleverness is allmost the reason for their successfull Space program. Until they discover stiffer joints we can sure enjoy more funny explosions.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-12-21T09:08:47Z","Content":"\n\u003Cp\u003E\nStupid species don\u0027t build spaceships.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my headcanon, the kerbals are just as competent as humans when it comes to engineering and space travel. The reputation for using \u0027parts lying by the side of the road\u0027 was a popular exaggeration created by the fact that the earliest kerbal spaceflight efforts were strictly amateur affairs run on a pretty shoestring budget, rather than big national prestige projects. Think British Interplanetary Society or the Verein fur Raumschiffahrt, rather than NACA/NASA.\n\u003C/p\u003E\n\u003Cp\u003E\nMainstream kerbal society didn\u0027t really see the point of spaceflight, or regarded it as a nice but unrealistic dream, especially since early rocket launches (uncrewed of course) tended to result in more or less spectacular explosions. That is, until Jeb, Bill and Bob\u0027s\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/30718-first-flight/\u0026amp;do=findComment\u0026amp;comment=408807\u0022\u003E first flight\u003C/a\u003E...\n\u003C/p\u003E\n"},{"CreatedByName":"Hannu2","CreatedById":154334,"CreatedDateTime":"2015-12-21T09:09:38Z","Content":"\n\u003Cp\u003E\nI think that Kerbals are about as intelligent but more scientifically curious that humans. They want to explore space because it is interesting for everyone and it is not just business or propaganda tricks of leaders of superpowers. Loss of kerbal does not cut money and cease program for several years. They have same attitude than humans had at time of great expeditions. Space exploration is dangerous pioneering work. Astronauts, politicians and citizens know that but someone want to be heroes and most of typical kerbals want to pay taxes so that they can see heroes in media. If some ship does not return, leaders do not despair and lose their faces.\n\u003C/p\u003E\n\u003Cp\u003E\nI think that humankind can not achieve anything great in space before we get back same attitude. Work of astronaut can not be as safe as work of office bureaucrat at this phase when technology is new.\n\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-12-21T11:57:50Z","Content":"\n\u003Cp\u003E\nMy Kerbal\u0027s are much more intelligent than humans, scientifically and ethically.  That doesn\u0027t discount them from also being child-like and, maybe, a bit to oblivious to danger.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2015-12-21T12:33:10Z","Content":"\n\u003Cp\u003E\n^^ That\u0027s it exactly. It\u0027s not an intelligence question. It\u0027s the psychological traits of obliviousness to danger, and a lack of common sense.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2015-12-21T12:56:51Z","Content":"\n\u003Cp\u003E\nIn my universe, they didn\u0027t invent their technology.... they found it:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/gsSfBOs.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022gsSfBOs.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rithsom","CreatedById":114646,"CreatedDateTime":"2015-12-21T13:14:48Z","Content":"\n\u003Cp\u003E\nWell, it is possible to complete the tech tree within a few in-game years, so I would say they\u0027re pretty clever. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E Though the diversity of the parts isn\u0027t too big to be totally unreasonable in real life.\n\u003C/p\u003E\n\u003Cp\u003E\nAs was said above, I would say they are just as intelligent as humans, but with a child-like attitude that sticks with them their whole lives.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-21T13:16:54Z\u0022 title=\u002212/21/2015 01:16  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 21, 2015\u003C/time\u003E by Rthsom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-12-21T13:50:27Z","Content":"\n\u003Cp\u003E\nI think that they certainly grasp  technology but never lose their curiosity and imagination. Also, some of them are born/cloned/createdinanunknownway without glands that produce fear chemicals, so that certainly helps.\n\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-12-21T13:52:17Z","Content":"\n\u003Cp\u003E\nMaybe the kerbals you can recruit for the roster are the ones that are considered too dangerously stupid to do the \u003Cem\u003Ereal\u003C/em\u003E work in the engineering bay or research labs... Give a moron a title and tell them they\u0027re good at it, however they perform, and you can safely send them far away where they won\u0027t bother you any more \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn a hundred years, I imagine kerbals will build a gigantic space ark that will meander its way across the heavens filled with \u0027pilots\u0027, \u0027scientists\u0027, \u0027engineers\u0027, hair dressers, dog walkers and middle managers. Their mission shall be simple; flee the doomed planet of Kerbin before it is eaten by an enormous mutant star goat. Or something like that. \n\u003C/p\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-12-21T15:56:37Z","Content":"\n\u003Cp\u003E\nIrresponsibility does not imply a lack of intellligence. It only implies a lack of responsibility.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-12-21T16:34:19Z","Content":"\n\u003Cp\u003E\nTo me, Kerbals are pretty much exactly like (apart from appearance) a race invented by SF writer \u003Ca href=\u0022https://en.wikipedia.org/wiki/Gordon_R._Dickson\u0022 rel=\u0022external nofollow\u0022\u003EGordon R. Dickson\u003C/a\u003E:  the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Earthman%27s_Burden\u0022 rel=\u0022external nofollow\u0022\u003EHokas\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nFor them as have never had the pleasure of reading about Hokas, they\u0027re a race of cute, friendly, beings who look rather like teddybears.  Nobody really knows what their own native culture was like (other than it was very primitive) because the main distinguishing trait of Hokas is immediate assimilation and immitation of other cultures.  Thus, as soon as the 1st human xeniologists arrived to study them, the Hokas immediately morphed into a culture of xeniologists and began studying the humans and themselves.  And the Hokas didn\u0027t stop there.  Recognizing that humans were more advanced, they began imitating them in all ways, modeling entire nations on different cultures from various eras of human history.  In these Hoka nations, every Hoka truly believed he was a human from that place and time, and lived his whole life that way in all respects:  clothing, language, zeitgeist, the works.  The humans thus had to be very careful about what information leaked out to the Hokas because, obviously, some human cultures have not been (and some still are not) things that need repeating.\n\u003C/p\u003E\n\u003Cp\u003E\nProblem was, however, that Hokas couldn\u0027t tell the difference between fact and fiction, had an overly developed liking for romanticism, and were quite ready to jump into the whole roleplaying thing with only a minimum of background information, improvising the rest as they went along.  So there were always these small groups of Hokas going off on wild tangents and the human protagonist of the story, charged with keeping them safe and shepherding their development, was always getting caught up in their zany adventures.\n\u003C/p\u003E\n\u003Cp\u003E\nOne such story involved some Hokas who\u0027d gotten hold of some 1950s pulp sci-fi about the Galactic Space Patrol or some such.  So they kludged a spaceship together (\u0022commandeered\u0022 the human\u0027s), armed it with blackpowder cannon (\u0022commandeered\u0022 from the Hoke pirate nation), went into space, and promptly got into serious trouble.  This, combined with Squad\u0027s videos showing Kerbal behavior, shaped my view of Kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\nSo basically, to me Kerbals are Trekkies who take things too far \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Inverurie Jones","CreatedById":154679,"CreatedDateTime":"2015-12-21T18:25:21Z","Content":"\n\u003Cp\u003E\nKerbals are clever but, as we say in my part of the world, \u0027hallyracket\u0027, that is \u0027possessed of a dangerous mix of reckless enthusiasm and clumsiness\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nYeah, we have a word for that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-21T18:28:42Z\u0022 title=\u002212/21/2015 06:28  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 21, 2015\u003C/time\u003E by Inverurie Jones\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2015-12-21T18:29:46Z","Content":"\n\u003Cp\u003E\nI see Kerbals as instinctively very competent and strongly compelled at building stuff, but not necessarily individually intelligent. Much like termites, really.\n\u003C/p\u003E\n\u003Cp\u003E\nBy themselves they will just hang around the KSC without really doing much of anything other than nibbling on snacks, but the moment a root part is placed in either SPH or VAB they swarm to it and start building feverishly from that seed until a fantastic contraption emerges in record time. From observation of different colonies, it appears that they operate as a type of hive mind, under some kind of control mechanism (scent? sound? vibrations?) by a yet to be identified design intelligence, maybe a hive Kween. Different hives/kweens can often be identified by the designs and construction methods typical to each of them.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kerbals we see all the time appear to be little more than drones, obviously lacking long-term memory or any sense of individual self-preservation - they will happily board the same contraptions dozens of times regardless of how many times it ended up in near or total disaster before. They are not particularly aware of either cost, risk, or danger, and so will unquestioningly follow the hive/kween direction and build as wasteful/frugal or safe/risky as directed, without any apparent effect to their passion to see construction finished and/or getting aboard.\n\u003C/p\u003E\n\u003Cp\u003E\nThey also seem to have a caste system: they are born into a very specific and limited role which they will fill for the length of their lifetime. We have been able to determine identifiers that correlate with their roles, but whether they are the cause or a side-effect from an underlying mechanism is unclear.\n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps the building of aircraft or rockets is some sort of procreation mechanism, and the craft are really just a form of seed pods, to be build in large numbers and flung far away in the hope that at least some will land on a fertile location to begin a new colony.\n\u003C/p\u003E\n"},{"CreatedByName":"MrOsterman","CreatedById":153514,"CreatedDateTime":"2015-12-21T18:41:14Z","Content":"\n\u003Cp\u003E\nSo......\n\u003C/p\u003E\n\u003Cp\u003E\nKerbals are Kender?\n\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2015-12-21T18:52:16Z","Content":"\n\u003Cp\u003E\nThey are fairly well competent, but their culture hasn\u0027t contrived to quell innate curiosity in the same way human cultures (you see plenty of children who are very curious about the world around them - the only thing that makes that go away is the insistence of others and society at large), and usually they possess an extreme lack of \u003Cem\u003Eforesight, (\u003C/em\u003Eand, often, hindsight as well). Kerbal architecture would be not unlike the Winchester Mansion as a result of this, and would have lots of odd protrusions and things started but then scrapped and left as-is. Their space program is the same way, and effectively built around this attitude - rockets get more purpose-built as nobody can say what the next mission requirements will be. Sometimes there are consequences for that.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t stand the \u0022they just love explosions\u0022 concept. Some individual Kerbals \u003Cem\u003Edo\u003C/em\u003E have that attitude, but so do some humans - it\u0027s just that humans usually have the foresight not to let those types of people into the astronaut corps. They\u0027re not so stupid as to just laugh and clap their hands when a rocket explodes, especially not when it\u0027s carrying fellow Kerbals. Even the 1.0 trailer doesn\u0027t show that, and that was bleak as hell.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t like the view that they\u0027re just expendable nobodies, either. The routine casual usage of the term \u0022Kerbal genocide\u0022 makes me wince. But that\u0027s arisen out of a lack of consequences for losing crew throughout most of the game\u0027s history\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-21T18:58:01Z\u0022 title=\u002212/21/2015 06:58  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 21, 2015\u003C/time\u003E by NovaSilisko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-12-21T18:52:56Z","Content":"\n\u003Cp\u003E\nThe first tutorial I played told me Kerbals were basically dumb and can\u0027t do anything themselves.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s pretty close to how it was worded.\n\u003C/p\u003E\n"},{"CreatedByName":"Pwnstarr","CreatedById":84803,"CreatedDateTime":"2015-12-21T19:50:07Z","Content":"\n\u003Cp\u003E\nThe Krotheans left their junk everywhere and disappeared... Then along came the Kerbals. \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-12-21T20:18:32Z","Content":"\n\u003Cp\u003E\nPretty darn competent given that fact that they are landing on other worlds within couple months of their flight manned flight in any sort of rocket at all.\n\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-12-21T20:23:09Z","Content":"\n\u003Cp\u003E\nI see Kerbals as something of a plant/animal hybrid whose intelligence is strongly linked to their diet. A well fed Kerbal is just as smart as a human, but take the food away and most of the brain power goes with it. Photosynthesis will keep them from starving, but it won\u0027t necessarily keep their minds running on all cylinders. \n\u003C/p\u003E\n"},{"CreatedByName":"ninjacat","CreatedById":155668,"CreatedDateTime":"2015-12-21T21:12:18Z","Content":"\n\u003Cp\u003E\nmy estimation would be: the maturity of a 6-year-old, the intelligence of a 9-year-old, and the knowledge of a 12-year-old. on average.\n\u003C/p\u003E\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-12-21T23:25:08Z","Content":"\n\u003Cp\u003E\nKerbal-kind is smart. But Kerbalnauts are not chosen from among the smartest. They are chosen for the courage and ability to survive the ordeal of long-duration spaceflight.\n\u003C/p\u003E\n\u003Cp\u003E\nThe tales of bits of technology being picked up by the side of the road is just a bit of an in joke. In much the same vein of the bill that Grumman sent North American Aviation for towing the Apollo 13 Command and service module. Astronauts, and engineers are well known for their jokes.\n\u003C/p\u003E\n\u003Cp\u003E\nIn many ways, Kerbal kind is smarter having never engaged in the incomprehensible stupidity of war (in my head-cannon).    \n\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2015-12-21T23:51:05Z","Content":"\n\u003Cp\u003E\nI see Kerbals as being similar to Bloody Stupid Johnson. Everything they build \u003Cem\u003Eworks\u003C/em\u003E, they\u0027re just not entirely sure how or why, and it doesn\u0027t necessarily do what they originally intended. They\u0027re extremely good at coming up with wildly over-engineered problems that shouldn\u0027t have existed in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nThey\u0027re not stupid, just intelligent in a rather convoluted way, with the exception of the occasional oddball like Jeb. Jeb\u0027s just daft.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-21T23:51:12Z\u0022 title=\u002212/21/2015 11:51  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 21, 2015\u003C/time\u003E by Panzerbeard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Inverurie Jones","CreatedById":154679,"CreatedDateTime":"2015-12-22T00:25:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222331840\u0022 data-ipsquote-contentid=\u0022128320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221450741865\u0022 data-ipsquote-userid=\u002266380\u0022 data-ipsquote-username=\u0022Panzerbeard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n33 minutes ago, Panzerbeard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI see Kerbals as being similar to Bloody Stupid Johnson. Everything they build \u003Cem\u003Eworks\u003C/em\u003E, they\u0027re just not entirely sure how or why, and it doesn\u0027t necessarily do what they originally intended. They\u0027re extremely good at coming up with wildly over-engineered problems that shouldn\u0027t have existed in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\nThey\u0027re not stupid, just intelligent in a rather convoluted way, with the exception of the occasional oddball like Jeb. Jeb\u0027s just daft.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo...like Minions crossed with Orks?\n\u003C/p\u003E\n"}]}