{"TopicId":12931,"ForumId":32,"TopicTitle":"First Orbital Rendezvous - Bad orbit, Bad manoeuvring.","CreatedByName":"Vostok","CreatedById":22467,"CreatedDateTime":"2012-06-19T12:28:37Z","PageNum":1,"Articles":[{"CreatedByName":"Vostok","CreatedById":22467,"CreatedDateTime":"2012-06-19T12:28:37Z","Content":"\n\u003Cp\u003EThe story begins with me letting my Gf play KSP. She made a rocket that (surprisingly) made it into orbit. However, a lack of RCS and SAS meant the orbit was at about 45 degrees of inclination.#\u003C/p\u003E\u003Cp\u003EI decided to launch an intercept ship. \u003C/p\u003E\u003Cp\u003EI chose a ship I already knew worked, it was a generic lander ship for landing on the mun or minimus. I launched it, and placed it into an orbit at 90 degrees around the planet\\\u0027s equator, that intersected the inclined orbit.\u003C/p\u003E\u003Cp\u003EI burned north at the point of intersection to incline the orbit to be parallel with the target ship.\u003C/p\u003E\u003Cp\u003EThe target ship was in an elliptical orbit, so I had to adjust my apoapsis and periapsis to fit with it. \u003C/p\u003E\u003Cp\u003EI began the process of catching up with the target ship, adjusting the orbit radius to speed up and slow down accordingly.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img33.imageshack.us/img33/382/screenshot556.png\u0022 alt=\u0022screenshot556.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen the target was within 12km, I boosted towards it with three small engines, remembering to slow down on the way.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img341.imageshack.us/img341/2108/screenshot562.png\u0022 alt=\u0022screenshot562.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a long time (my RCS fuel ran out about now) I managed to get in viewing distance of the target, and with a LOT of fiddling and ship rotating (I could only use main engines to manoeuvre, since the RCS was out of fuel, meaning I had to swing my ship in massive circles to point the engines) I eventually jettisoned the landing stage as it was too large and heavy to turn with quickly, and I used the re-entry stage for controlling.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img201.imageshack.us/img201/1183/screenshot567.png\u0022 alt=\u0022screenshot567.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E After a while, I arrived close enough to touch the target ship. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img15.imageshack.us/img15/3770/screenshot568.png\u0022 alt=\u0022screenshot568.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA parachute broke off, but I had three. \u003Cstrong\u003EMission success!\u003C/strong\u003E Finally, I performed a re-entry burn.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img560.imageshack.us/img560/4953/screenshot583h.png\u0022 alt=\u0022screenshot583h.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI jettisoned the re-entry stage, leaving the landing stage short of one parachute.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img28.imageshack.us/img28/2553/screenshot584.png\u0022 alt=\u0022screenshot584.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img854.imageshack.us/img854/617/screenshot592.png\u0022 alt=\u0022screenshot592.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ship landed on wheels and two parachutes in a desert somewhere. The pod broke off the lander part, since it only had 2 out of it\\\u0027s normal 3 parachutes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img18.imageshack.us/img18/5074/screenshot597.png\u0022 alt=\u0022screenshot597.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img23.imageshack.us/img23/4488/screenshot600.png\u0022 alt=\u0022screenshot600.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut nevertheless, my first attempt (and success) at an orbital intercept was a complete success! I just need to remember more RCS fuel next time. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Millst0ne MK II","CreatedById":13384,"CreatedDateTime":"2012-06-19T12:41:41Z","Content":"\n\u003Cp\u003EDang....You should have pushed the big ship back to Kerbin with you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}