{"TopicId":13709,"ForumId":32,"TopicTitle":"1st Successful MunSat Delivery/Return - Also Hello, and some mid-level questions","CreatedByName":"wildkittyv1","CreatedById":30893,"CreatedDateTime":"2012-07-05T18:42:13Z","PageNum":1,"Articles":[{"CreatedByName":"wildkittyv1","CreatedById":30893,"CreatedDateTime":"2012-07-05T18:42:13Z","Content":"\n\u003Cp\u003EHey guys,\u003C/p\u003E\u003Cp\u003EFirstly, I want to say how much I love KSP and have been enjoying it immensely for the past five or six days. My first spacecraft were relatively simple, and I went through the steps like we all do. Eventually I got into orbit around Kerbin, then shot myself to the moon (and promptly crash landed), then settled for an orbit, then put a satellite into geosynchronous orbit around Kerbin, and ultimately made a goal to put a satellite into orbit around the Mun with a manned flight and to bring those reluctant Kerbals home. After a few failures, I managed to succeed in putting a satellite into orbit around the Mun at 500km and bring my kerbonauts home.\u003C/p\u003E\u003Cp\u003EHere is the spacecraft that accomplished this goal: \u003Ca href=\u0022http://imgur.com/Pk090\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/Pk090\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI have a few questions now, though. As you can see, I\\\u0027ve started to use mods (though many of my initial ventures were with vanilla parts and my geosynchronous satellite was made with plane wings set on struts), and I\\\u0027m using NovaPunch, but opted out of the fairing system for this craft because I was having difficulty with a certain joint.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/2EeGj\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/2EeGj\u003C/a\u003E - The circle is centered around the joint in question. The engine inside the decouple (Mk 46 1m - 1.75m hollow decoupler from NP) is a 1m K2-X from NP. Below the hollow decoupler is flipped HH-78d 1.75-3m adapter from NP, which is attached to 3m fuel tanks for the main thrusters and has the first stage boosters attached. I feel like I am doing something wrong with the attachment of these parts, as the 2nd (top) stage of the rocket has way too much wobble. STS and wings help it fly straight until I exit the atmosphere, but I can\\\u0027t help but feel like it\\\u0027s still wobbling too much. Is there a better way to transition from a 1m engine with a hollow decoupler to a 3m base? At one point I did make use of the fairing system to enclose the final stage of the delivery system, but temporarily scrapped the idea while having issues with proper staging, weight, and balance. At some point I will redo the mission with the fairing enclosures.\u003C/p\u003E\u003Cp\u003ELastly, I am just wondering if there is a good way to learn how to read the gyroscope/artificial horizon, and using it to gauge/alter my orbital paths better. I am learning how to read it and how to adjust my paths mid-flight, but I feel like I\\\u0027m just missing a small bit of information with working with it and 3d geometry in general. Any information or links to information regarding these topics is appreciated. One example is like on my last successful mission to put the satellite in orbit: I came around the \u0027front\u0027 of the Mun (as though I launched at 270) and ended up beginning my orbit on its backside. I did this successfully, sure, but I know I wasted far too much fuel making adjustments. Much of my problem stemmed from trying to read the orbital map and the adjustments it was making to my path. Having to rotate my exit route in my head and anticipate which direction I need to fire in to close the orbit proved troublesome because of the way the escape/encounter system works with showing your path.\u003C/p\u003E\u003Cp\u003EAnyway, pardon the lengthy initial message, but I\\\u0027m having great fun with this game. Next up... land on the Mun and return home!\u003C/p\u003E\n"},{"CreatedByName":"dogon11","CreatedById":20786,"CreatedDateTime":"2012-07-05T18:46:00Z","Content":"\n\u003Cp\u003EWelcome, hope you have fun.\u003C/p\u003E\u003Cp\u003EAnyways, the main problem with the floppy stage is probably that it just isn\\\u0027t wide enough. The way I solve this is by attaching the two stages with struts. This solidifies the connection, and should fix your problem.\u003C/p\u003E\n"},{"CreatedByName":"wildkittyv1","CreatedById":30893,"CreatedDateTime":"2012-07-05T19:49:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dogon11\u0022 data-cite=\u0022dogon11\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWelcome, hope you have fun.\u003C/p\u003E\u003Cp\u003EAnyways, the main problem with the floppy stage is probably that it just isn\\\u0027t wide enough. The way I solve this is by attaching the two stages with struts. This solidifies the connection, and should fix your problem.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually have a question regarding struts that I left out of my first post.\u003C/p\u003E\u003Cp\u003EHow exactly does strut decoupling work? I know in the staging list they\\\u0027re denoted as a \u0027structural\u0027 piece. When you activate the stage that they are listed under, do they decouple then or are they a permanent fix type of thing, as in that in order to have them detach from the spacecraft, you have to have them primarily attached to a radial (or other style) decoupler, and activate the stage where the decoupler is in order to jettison them?\u003C/p\u003E\u003Cp\u003EAlso, in regards to mods and struts: I can\\\u0027t remember if it was in the NP pack that there are stronger struts, but do they have a decoupling property? I also have used the small explosive charges that come with that pack to jettison my fairing walls, but haven\\\u0027t tried to affix a strut to that and use the charges as a strut tossing mechanism - would this work? Are there any part packs out there that have struts that can be jettisoned without needing to be attached to another part? I\\\u0027d like to use this approach for some of my more chaotic rocket designs, but it gets a bit overwhelming (even using symmetry) to set up the staging appropriately so my unneeded parts fall away safely rather than hovering alongside or hitching a ride on one engine and messing up the whole ordeal because one small operation (that then becomes a chore to first discover and then fix) going awry.\u003C/p\u003E\n"},{"CreatedByName":"dogon11","CreatedById":20786,"CreatedDateTime":"2012-07-05T19:51:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wildkittyv1\u0022 data-cite=\u0022wildkittyv1\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI actually have a question regarding struts that I left out of my first post.\u003C/p\u003E\u003Cp\u003EHow exactly does strut decoupling work? I know in the staging list they\\\u0027re denoted as a \u0027structural\u0027 piece. When you activate the stage that they are listed under, do they decouple then or are they a permanent fix type of thing, as in that in order to have them detach from the spacecraft, you have to have them primarily attached to a radial (or other style) decoupler, and activate the stage where the decoupler is in order to jettison them?\u003C/p\u003E\u003Cp\u003EAlso, in regards to mods and struts: I can\\\u0027t remember if it was in the NP pack that there are stronger struts, but do they have a decoupling property? I also have used the small explosive charges that come with that pack to jettison my fairing walls, but haven\\\u0027t tried to affix a strut to that and use the charges as a strut tossing mechanism - would this work? Are there any part packs out there that have struts that can be jettisoned without needing to be attached to another part? I\\\u0027d like to use this approach for some of my more chaotic rocket designs, but it gets a bit overwhelming (even using symmetry) to set up the staging appropriately so my unneeded parts fall away safely rather than hovering alongside or hitching a ride on one engine and messing up the whole ordeal because one small operation (that then becomes a chore to first discover and then fix) going awry.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. Struts go away when the two pieces that it\\\u0027s connected to separate.\u003C/p\u003E\u003Cp\u003E2. How\\\u0027d you figure out the explosive charges for the payload fairing?\u003C/p\u003E\n"},{"CreatedByName":"wildkittyv1","CreatedById":30893,"CreatedDateTime":"2012-07-05T20:12:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dogon11\u0022 data-cite=\u0022dogon11\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E1. Struts go away when the two pieces that it\\\u0027s connected to separate.\u003C/p\u003E\u003Cp\u003E2. How\\\u0027d you figure out the explosive charges for the payload fairing?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\\\u0027m going to answer 2 first here:\u003C/p\u003E\u003Cp\u003E2. I\\\u0027m not really sure what you mean. How did I figure out where to place them? I just kind of did it trial and error. I wasn\\\u0027t entirely sure at first, so I placed them at the bottom of the fairing groups and when I was ready to jettison them the first time, I tossed them and they rotated inwards. I wanted them to rotate/float outwards, so I moved the charges up to about halfway up the entire casing and they work almost how I want. The fairings themselves don\\\u0027t seem to have any actual physics or collision properties, so they can and will float around and clip through the rest of the rocket. I think having two charges for each side (2 groups of half-circumference casings with one set of charges near the bulkhead/fairing mount and one just below where you attach the cone or whatever else) will work, as the charges blow whatever they are attached to outward, but there\\\u0027s some weird physics stuff going on with them - ultimately it doesn\\\u0027t matter since they don\\\u0027t collide with anything, but for aesthetic purposes I\\\u0027m trying to perfect the charges.\u003C/p\u003E\u003Cp\u003E1. I\\\u0027ve seen how the struts disappear, but I\\\u0027ll show you a picture where I first started using radial decouplers with struts attached: \u003Ca href=\u0022http://imgur.com/NpIxv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/NpIxv\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou can see how the yellow circled bits have the struts attached to decouplers. If you look in the lower-left corner, you can see there are struts fixed directly to the tanks. I was trying to build a radial monstrosity, and this thing did eventually get into orbit around the Mun, but I digress. My initial problem with the craft was jettisoning the outside stage and have it fall away safely from the rest of the craft. This didn\\\u0027t happen with solid struts, even if I staged them separately from everything else. The entire outer ring of engines would continue to float upwards, even after playing with floating and acceleration of both rings. I solved it by first jettisoning the green decouplers attached to the yellow struts (in the image) and that setup was applied to half of the outer ring. Then, the blue decouplers would go and that would free the green circled engines to freely float away from the rest of the ship along the red line. The process was repeated until the final interior ring was reached.\u003C/p\u003E\u003Cp\u003EI had to attach the struts to decouplers for this to happen though, I want to know if there\\\u0027s a simpler way to setup struts to decouple on their own, if there\\\u0027s a parts pack out there that does it, a plugin.. anything, to remove a bit of complexity in the design of my ships, since one of my favorite things (and I\\\u0027m sure many others) is to have somewhat complex staging and watch it all come together and work as intended.\u003C/p\u003E\u003Cp\u003EPardon the monologue, but cheers.\u003C/p\u003E\n"},{"CreatedByName":"zack2014","CreatedById":17837,"CreatedDateTime":"2012-07-05T22:56:12Z","Content":"\n\u003Cp\u003EStruts don\\\u0027t need decoupling. Fact \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E, it\\\u0027s wasted effort to decouple them.\u003C/p\u003E\n"}]}