{"TopicId":13891,"ForumId":32,"TopicTitle":"Alternative to higher warps?","CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-09T05:33:51Z","PageNum":1,"Articles":[{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-09T05:33:51Z","Content":"\n\u003Cp\u003EI have an idea that isn\\\u0027t fleshed out enough to call a suggestion yet. A lot of players are calling for higher levels of time warp to make long trips feasible, but when I\\\u0027m running a mission that\\\u0027s going to take a while, I just leave it going and hop to a shorter mission to pass the time. The problem, of course, is that the unattended mission could run into trouble. So how about an alert system? A message pops up that says, \u0027Such-and-such has happened. Do you wish to switch to so-and-so ship to deal with it?\u0027 The part I haven\\\u0027t figured out yet is what would trigger an alert. The main issue would be getting close to a destination and needing to brake or land. But how would the software know what your destination was? Perhaps a certain proximity to any celestial body would trigger an alert? \u003C/p\u003E\u003Cp\u003EOr perhaps this won\\\u0027t be an issue? How autonomous will the crews be, once they\\\u0027re fully implemented? Will we be able to trust the guys to enter orbit on their own? Land? \u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2012-07-09T09:44:06Z","Content":"\n\u003Cp\u003EThe main issue with that in KSP, is Such-and-Such tends to equal either crash or explode. There really isn\\\u0027t anything else besides SOI insertion that would be of note for such a system. Call me crazy, but if my crew is going to hit something or explode inexplicably, I want to be present to view the show.\u003C/p\u003E\u003Cp\u003EWith persistence, there is always the option to just let your mission go its merry way while you assemble new craft or launch other missions. One just needs to be vigilant and visit the tracking station often to see how your other craft are fairing. Any veteran kerbal pilot can launch a tested vehicle with their eyes closed. I already have it down pat what numbers I need to establish orbit at 70k without visiting the map. The same map that also shows all the other craft currently in mission.\u003C/p\u003E\u003Cp\u003ESo, nah, an alarm system is really unnecessary. One merely needs to visit the map now and then to see what all is going on. Once an interplanetary mission gets close to its goal, that would be a fine time to hop on board, and use the time warp as what is provided to bring it in.\u003C/p\u003E\u003Cp\u003EAs for autonomous crews, I wouldn\\\u0027t be surprised if the highly experienced ones would be able to pull off certain actions what MechJeb currently provides such as unaided landing. The trick is to get a crew to survive long enough through enough missions to become that experienced. That would be all part of the fun of campaign mode.\u003C/p\u003E\n"},{"CreatedByName":"flaillomanz","CreatedById":8088,"CreatedDateTime":"2012-07-09T12:18:51Z","Content":"\n\u003Cp\u003EMy solution has always been to boot up Cheat Engine and use it\\\u0027s speedhack feature to get ridiculous speed. I mean, I\\\u0027d probably never use it for anything else. \u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-09T14:55:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOne just needs to be vigilant and visit the tracking station often to see how your other craft are fairing. \u003C/div\u003E\u003C/blockquote\u003EThat\\\u0027s exactly what I was hoping to get around. \u0027Are we there yet? Are we there yet?\u0027 It\\\u0027s just as annoying when you\\\u0027re asking the game as when a kid is asking you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ean alarm system is really unnecessary \u003C/div\u003E\u003C/blockquote\u003EUnnecessary? Sure. Helpful? I still think so. I mean, strictly speaking map view isn\\\u0027t \u003Cem\u003Enecessary\u003C/em\u003E, but it makes things a lot easier and more enjoyable. And I just think that it would be easier and more enjoyable if it was safe to go do something else fun while waiting for my flights to arrive, instead of sitting around watching time whiz by in warp, or anxiously checking back again and again.\n"}]}