{"TopicId":139943,"ForumId":32,"TopicTitle":"Is it true that most KSP players never go interplanetary?","CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-05-17T07:46:00Z","PageNum":4,"Articles":[{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-05-17T14:48:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586666\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463491920\u0022 data-ipsquote-userid=\u0022164245\u0022 data-ipsquote-username=\u0022theTyke\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, theTyke said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think the docking process in itself is the pain to learn. It\u0027s trying to get the rendezvous with the not-so-nimble stock maneuver node system (especially if the target sits in a high orbit).\u003Cbr\u003E\u003Cbr\u003E\nThe maneuver system might also be part of the issue why people don\u0027t do interplanetary travel (combined with the pain of learning when the transfer window to a certain body is open and learning about the deltaV needs of a trip).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe rendezvous manoeuvre is probably the harder thing to master in KSP. But your don\u0027t need it to go interplanetary. I remember doing my first Duna/Ike mission with 2 vehicles send on the same day with a dedicated lander. Their design was very near my previous Munar lander.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for interplanetary manoeuvre, the manoeuvre tool is also very clumsy. It works fine with Mun/Minmus but very user-unfriendly for planetary encounter.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"teag2","CreatedById":119694,"CreatedDateTime":"2016-05-17T14:54:25Z","Content":"\n\u003Cp\u003E\nAfter my first few times sending interplanetary ships manually, I just use MechJeb for all of them now. It gets kinda boring sending them repeatedly \u003Cimg alt=\u0022:kiss:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif\u0022 title=\u0022:kiss:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs for the people talking about docking: My latest interplanetary ship was a giant nuclear tug with a 2 kerbal Duna lander that had all the science, and it didn\u0027t use any docking. In fact, I have explored Eve, Duna, and Jool and haven\u0027t done any docking. I have docked before, but it\u0027s much easier and more practical to just send it all up in one launch \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Codraroll","CreatedById":163815,"CreatedDateTime":"2016-05-17T15:00:34Z","Content":"\n\u003Cp\u003E\nI played KSP for months and had quite elaborate space stations in orbit of Kerbin, the Mun and Minmus before I even considered a Duna mission. Leaving Kerbin is a very high treshold.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is something psychological about leaving the home SOI. Early-game, you become quite attached to your little green fellows, and sending them off into the great dark takes a bit of a build-up. If you strand them on the Mun or Minmus, you can slap together a rescue mission and save them in a week or two. Returning safely home from those bodies isn\u0027t hard either. You\u0027ll usually have fuel enough to make orbit, and from there the trip back home is just a trip down Kerbin\u0027s gravity well. Hit for the center of the system, aerobrake until suborbital, release parachutes, and call the rescue chopper.\n\u003C/p\u003E\n\u003Cp\u003E\nGoing to other planets, though, means that you\u0027ll have to aim into the boundless sky, and hope you hit your target. Then follows a great timewarp, a year or more of game time may pass while you\u0027re on the way, and then you have to brake down, make orbit around the target planet, and then land. Until you\u0027ve tried, in Stock you have no way of knowing whether you\u0027ve packed enough fuel. And Kod help you if you plan to return to Kerbin. On my Duna mission, I had barely enough fuel to make a circular orbit around Duna, and I had to attempt four landings before I managed a configuration that would leave me enough fuel to rendezvous with the mother ship afterwards. And then I had to assemble a rescue craft to get the trio of astronauts home again. That craft was basically just a Hitchhiker with a drive section, and after assembly and refuelling in orbit it had enough dV to get to Duna (after another great timewarp to optimize transfer windows), rendezvous with the stranded ship in Duna orbit, timewarp again, and then bring the astronauts back to Kerbin orbit. Then I had to send up another craft to land the Kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\nAll in all, my great mission required orbital assembly of two craft, several failures, hours of game time, and while I had built the aforementioned elaborate Kerbin, Mun and Minmus stations within the first year and a half of game time, the Duna mission pushed the game clock to somewhere around mid-year-5. I had spent all of two minutes on Duna\u0027s surface, collecting a few hundred points of Science, planting a flag, then packing up and leaving. A tremendous effort compared to what I got out of it, and compared to how quickly I had proceeded in Kerbin\u0027s SOI, this felt like I had wasted four in-game years on a single mission. Like my Space Center had been sitting there useless, collecting dust while I was away. That\u0027s when I decided to install some mods, to at least make interplanetary travel easier. Or maybe to just get more stuff to do in Kerbin\u0027s SOI.\n\u003C/p\u003E\n\u003Cp\u003E\nAs it stands, I think we need more reasons to get to the outer planets, and/or skipping stones to go there. I feel colonization could be a step in both the right directions, as it\u0027d be a less daunting task to launch a Duna mission from, say, shipyards on Minmus. And with a base down on Duna, Dres isn\u0027t that far away. You\u0027d get a reason to bring Kerbals to other planets, you\u0027d get more transfer windows (Kerbin -\u0026gt; Jool, Duna -\u0026gt; Jool and Dres -\u0026gt; Jool would rarely overlap, and it\u0027d be a simple matter of picking what planet you wanted to launch from), and since ship construction on other planets would be vastly more expensive than on Kerbin (at least, at first?) you\u0027d find a good use for those Funds that keep heaping up. Is upgrading the Tracking Station to level 3 a matter of pocket money? Try levelling up the Vall shipyard, then reconsider the state of your wallet. Alas, this requires work so extensive that hasn\u0027t even been done with mods. I\u0027m not sure if it\u0027s even theoretically possible. Maybe Squad will address the issue one day? For the majority of the player base, I dare say it\u0027s way more important than adding new planets.\n\u003C/p\u003E\n\u003Cp\u003E\nBut in the mean time,Kerbin\u0027s SOI acts as the lone safe island in a giant ocean. It\u0027s the only planet to ever be \u0022home\u0022, and if you want your Kerbals to ever return, you have to construct craft capable of both reaching the target and get back home, which is very difficult with the few tools and limited readouts Stock provides you with.\n\u003C/p\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2016-05-17T15:05:20Z","Content":"\n\u003Cp\u003E\nIt took me about 100 hours and the installation of MechJeb to finally go interplanetary (I sent a Venera-style probe to Eve). It took me a bit longer to realize that MechJeb had a bunch of autopilot features other than the manoeuvre planner, and consequently to learn how to dock and how to do a proper gravity turn. But since then I\u0027ve had no difficulties at all going interplanetary, and I love to make increasingly large MMSEVs (Multi-Mission Space Exploration Vehicles) for going just about everywhere. It\u0027s incredibly challenging to learn how to go interplanetary in stock (or at least it used to be, I imagine the in-game wiki now helps) but once you know what you\u0027re doing it becomes very easy. And if you\u0027re anything like me you end up wanting to go further than the stock game has, and start installing planet packs and even new star systems. I expect \u0022most\u0022 players who are surveyed say they don\u0027t go interplanetary because many of them are probably new to the game and have yet to learn how.\n\u003C/p\u003E\n"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2016-05-17T15:05:34Z","Content":"\n\u003Cp\u003E\nGoing interplanetary is hard.  This is the first time in a year and a half that I have played a science/career mode and had both the know-how and proper tech to build something to go interplanetary, muck about, and return home with some nice science or screenshots but I do not have mechjeb installed and thus have to do all interplanetary transfers myself.  I do know the general gist of how to transfer and a very rough approximation  of on what angle is need from kerbin to other planets, but I\u0027m still wasting hundreds of DV  on very rough and inaccurate burns.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP really needs to change their manuver system to enable players to easily manuvers tend or hundreds of days in ahead instead of only 1 orbit at a time( and a LKO orbit isnt even an hour so there\u0027s alot of clicking)\n\u003C/p\u003E\n"},{"CreatedByName":"nosirrbro","CreatedById":69814,"CreatedDateTime":"2016-05-17T15:11:56Z","Content":"\n\u003Cp\u003E\nI\u0027ve been interplanetary for a very long time but it did take 40 or so hours for me to even make an eve probe, and I bet the vast majority of players haven\u0027t even got 30 hours in.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-05-17T15:14:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586792\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463497234\u0022 data-ipsquote-userid=\u0022163815\u0022 data-ipsquote-username=\u0022Codraroll\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Codraroll said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI feel colonization could be a step in both the right directions, as it\u0027d be a less daunting task to launch a Duna mission from, say, shipyards on Minmus. And with a base down on Duna, Dres isn\u0027t that far away. You\u0027d get a reason to bring Kerbals to other planets, you\u0027d get more transfer windows (Kerbin -\u0026gt; Jool, Duna -\u0026gt; Jool and Dres -\u0026gt; Jool would rarely overlap, and it\u0027d be a simple matter of picking what planet you wanted to launch from), and since ship construction on other planets would be vastly more expensive than on Kerbin (at least, at first?) you\u0027d find a good use for those Funds that keep heaping up. Is upgrading the Tracking Station to level 3 a matter of pocket money? Try levelling up the Vall shipyard, then reconsider the state of your wallet. Alas, this requires work so extensive that hasn\u0027t even been done with mods. I\u0027m not sure if it\u0027s even theoretically possible. Maybe Squad will address the issue one day? For the majority of the player base, I dare say it\u0027s way more important than adding new planets.\n\u003C/p\u003E\n\u003Cp\u003E\nBut in the mean time,Kerbin\u0027s SOI acts as the lone safe island in a giant ocean. It\u0027s the only planet to ever be \u0022home\u0022, and if you want your Kerbals to ever return, you have to construct craft capable of both reaching the target and get back home.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, as far as colonization, there is ISRU added... Duna in my career feels like a \u0022home\u0022... I\u0027ve got 400 tons of \u003Cs\u003E\u0022stuff\u0022\u003C/s\u003E -space station- orbiting it (a large portion of which is fuel... which was expended, then replaced with stuff mined on Ike and Duna, also a large portion are the docked ISRU vessels since the station is full, they aren\u0027t on the surface mining more). In orbit I\u0027ve got a large return vehicle, nuclear tugs with docking ports, one with a grabber. On the surface: a rover, asurface hab, a solar aircraft (modded propulsion)... a reusable duna lander, if I can get a craft to Duna\u0027s SOI, I can grapple it/dock with it, and fuel it back up, a crippled craft can have its kerbals moved to a station or surface hab. I\u0027ve even got a modded Xenon ISRU (only works on planets with atmospheres). Laythe will be like this too... with a bigger surface hab, and more stuff for going around the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t need to build a vessel on Minmus... just build it on Kerbin, get it to minmus, and fill it back up with ISRU.\n\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2016-05-17T15:16:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586776\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463496527\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs for interplanetary manoeuvre, the manoeuvre tool is also very clumsy. It works fine with Mun/Minmus but very user-unfriendly for planetary encounter.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhich is why I\u0027ve been to Duna and Eve using the stock system, but I won\u0027t do it again unless MJ ceases to function. The stock maneuver node system is just so painful to use in an interplanetary scale.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-17T15:17:39Z\u0022 title=\u002205/17/2016 03:17  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 17, 2016\u003C/time\u003E by DChurchill\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-05-17T15:16:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586809\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463497916\u0022 data-ipsquote-userid=\u002269814\u0022 data-ipsquote-username=\u0022nosirrbro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, nosirrbro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve been interplanetary for a very long time but it did take 40 or so hours for me to even make an eve probe, and I bet the vast majority of players haven\u0027t even got 30 hours in.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBack in the day, if a game was good for 30hours, you considered it a pretty good deal! I bought a game for 60GBP about a year ago, it made me cringe and my wallet nearly cracked down the middle, but about a week later I realised I had 60hours on it.\n\u003C/p\u003E\n\u003Cp\u003E\nCompare it to the price of a cinema ticket!!\n\u003C/p\u003E\n\u003Cp\u003E\nBut anyway, I dont know how much we can say about the portrion of folks who play KSP but who aren\u0027t active here. I doubt many folks will look twice at KSP unless they are pretty interested in space/orbits/etc. I know I looked twice and look where I am.\n\u003C/p\u003E\n"},{"CreatedByName":"Kevin Kyle","CreatedById":110492,"CreatedDateTime":"2016-05-17T15:37:45Z","Content":"\n\u003Cp\u003E\nI find that leaving the Kerbin system and going interplanetary is no different than going to the Mun. Only thing that really changes is the distance and required dv obviously increase but the principle is still the same, So instead of Kerbin being the main body, the sun becomes the main body until you arrive at the target planet. I dont use mechjeb but I do use the launch window planner. Once I have the general launch window, I keep messing with the node until it comes into it. I also use the dv chart so I know I have what I need to get there. After you have done it once, it becomes a lot easier to have faith that you can get there and back.\n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-05-17T15:45:42Z","Content":"\n\u003Cp\u003E\nIt did take me a while to get past Minmus, but keep in mind, those stats (which we haven\u0027t seen btw) are skewed by the fact that a lot of the career game takes place before leaving Kerbin\u0027s SOI.  No matter how good a game is, there are going to be a lot of players that get bored or realize the game is not their kind of game before they get any further than that.  If we were able to somehow get stats from only the people who truly enjoy the game, I think you would find it would be different.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-05-17T16:10:57Z","Content":"\n\u003Cp\u003E\nWell thats why I previously said that I think the question should be refined to\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586471\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463483844\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLets not consider people who bought the game, but have barely played it... and only consider those that played enough to have returned from Mun/Minmus. What I want to know is:\n\u003C/p\u003E\n\u003Cp\u003E\n#1) What percent of those people have gone on to interplanetary missions?\n\u003C/p\u003E\n\u003Cp\u003E\n#2) For the remaining portion: what prevented them from going on interplanetary missions next?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPS, as noted: \u0022The forum community is conspicuously smaller than even the 30,000 Steam ratings (let alone the total number of sales!)\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nPosts by forum members about what planets they\u0027ve visited aren\u0027t reallly relevant... its far from an \u0022unbiased\u0022 sampling of KSP players, so it doesn\u0027t help answer #1. A post about what was holding you back before going interplanetary, would help answer #2.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIts not worth asking why someone hasn\u0027t gone interplanetary if they haven\u0027t made it to one of the moons.\n\u003C/p\u003E\n\u003Cp\u003E\nSo how much of a barrier is this interplanetary step, and is another \u0022stepping stone\u0022 (a dwarf trojan planet) warranted?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-17T16:12:52Z\u0022 title=\u002205/17/2016 04:12  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 17, 2016\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2016-05-17T16:12:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586792\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463497234\u0022 data-ipsquote-userid=\u0022163815\u0022 data-ipsquote-username=\u0022Codraroll\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n52 minutes ago, Codraroll said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI played KSP for months and had quite elaborate space stations in orbit of Kerbin, the Mun and Minmus before I even considered a Duna mission. Leaving Kerbin is a very high treshold.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is something psychological about leaving the home SOI. Early-game, you become quite attached to your little green fellows, and sending them off into the great dark takes a bit of a build-up. If you strand them on the Mun or Minmus, you can slap together a rescue mission and save them in a week or two. Returning safely home from those bodies isn\u0027t hard either. You\u0027ll usually have fuel enough to make orbit, and from there the trip back home is just a trip down Kerbin\u0027s gravity well. Hit for the center of the system, aerobrake until suborbital, release parachutes, and call the rescue chopper....\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter several months I felt a bit guilty that I hadn\u0027t even tried to go somewhere else so I went to Duna just to prove i could.\u003Cbr\u003E\nThen I went back to the whole system of stations, tugs, ferries, etc. that I\u0027d been playing about with in Kerbin SOI.\u003Cbr\u003E\nThere is so much you can do with Kerbin and its two moons that can be done at any time (no wait for transfer windows) and is at least potentially \u0027rescuable\u0027 since it\u0027s only a few hours/days away.  It took nearly a year before I\u0027d done everything I wanted to in Kerbin SOI and started going interplanetary as a matter of course.  That was only because I wanted to find every Easter Egg and have a transport-tycoon newtwork across the system *grin*.  I was and am quite happy to carry on with Kerbin SOI operations while interplanetary missions drift their way to encounters so don\u0027t need to time-warp a huge amount.  In a typical game I\u0027ll have at least 30 flights in progress at any time - yes KAC is vital to me!\n\u003C/p\u003E\n\u003Cp\u003E\nAs to the whys and why nots; I don\u0027t think docking should be blamed as most people who make it that far will probably be docking ships to their stations anyway.\u003Cbr\u003E\nTransfer window and dV planning are far more likely to be the suspects just because most people will want to make sure long-term missions at least stand a chance of success.  That said, I was showing KSP to a couple of people the other day and they were just happy to see Duna, even though the thrown-together ship had no chance of landing or returning (design by committee when the majority of said committee just want something that looks impressive).  In the end it comes down to the fact that realistic space-exploration, even in the simplified form offered by KSP, isn\u0027t easy and unless people have enough interest to read (or watch videos since not so many seem to understand the concept of literacy these days) about and learn the mechanics they just aren\u0027t going to get very far.  Ah well, if they have fun throwing rockets at the sky that\u0027s good enough.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-05-17T16:13:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586855\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463499465\u0022 data-ipsquote-userid=\u0022110492\u0022 data-ipsquote-username=\u0022Kevin Kyle\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, Kevin Kyle said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI find that leaving the Kerbin system and going interplanetary is no different than going to the Mun. Only thing that really changes is the distance and required dv obviously increase but the principle is still the same, So instead of Kerbin being the main body, the sun becomes the main body until you arrive at the target planet. I dont use mechjeb but I do use the launch window planner. Once I have the general launch window, I keep messing with the node until it comes into it. I also use the dv chart so I know I have what I need to get there. After you have done it once, it becomes a lot easier to have faith that you can get there and back.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNeeding a \u0022launch window\u0022 is exactly why the principle is different. Get into Kerbin orbit and you can play with a node until you get a reasonably cheap intercept with Mun or Minmus. Same can\u0027t be said for going to another planet, if it\u0027s the wrong time of year then no amount of node fiddling will make it cheap.\n\u003C/p\u003E\n\u003Cp\u003E\nThe issue is that the game tells you exactly nothing about when those transfer windows occur. And it\u0027s a very tough thing to trial-and-error.\n\u003C/p\u003E\n"},{"CreatedByName":"suicidejunkie","CreatedById":155878,"CreatedDateTime":"2016-05-17T16:33:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586646\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463491220\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think that\u0027s a great idea, though I think it should be a small planet. Maybe even a Pol/Bop type with a Gilly type moon. That would be a great stepping stone because you could ALWAYS go to it in the exact same, describable way without ever waiting for a transfer window.\n\u003C/p\u003E\n\u003Cp\u003E\nForget Gas Giant 2, I want a Kerbal Trojan!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAlso, there needs to be a horse hidden somewhere on it.\n\u003C/p\u003E\n"},{"CreatedByName":"Cairol","CreatedById":145279,"CreatedDateTime":"2016-05-17T16:35:16Z","Content":"\n\u003Cp\u003E\nI played KSP for a good while now. but I also are on of those that hadn\u0027t got to Duna yet...\u003Cbr\u003E\nI use RemoteTech. So I had the fear that my satellites would de-arrange themselves on their orbits when I do fast forward for years and years to get\u003Cbr\u003E\ntransfer windows for other planets.\u003Cbr\u003E\nNow I cheated them into perfect orbital periods to avoid this, because I really don\u0027t want to reposition them each time I go somewhere far away.\u003Cbr\u003E\u003Cbr\u003E\nAnother reason is, that my rocket designs all failed to make it to Duna and back.\u003Cbr\u003E\nI need to make them larger with more d/v, and if I do so, it get\u0027s more difficult to get them to orbit in one piece.\u003Cbr\u003E\nThen I had problems with my Nervas to overheat o the long burn. Then I had problems with the thin atmosphere of Duna to get a proper aerocapture wihtout\u003Cbr\u003E\noverstressing the craft.\u003Cbr\u003E\nSo I failed and failed...a spiral of problems.\u003Cbr\u003E\nI\u0027m working on my satellite deployer to get there \u0022soon\u0022, but I really struggle here.\u003Cbr\u003E\nIt\u0027s not like I don\u0027t want to visit those other planets... It\u0027s just that I\u0027m obviously missing some strategies to do it properly.\u003Cbr\u003E\nIn those youtube videos it looks so easy. Those guys fly every brick and every SSTO to Duna. But I couldn\u0027t yet.\n\u003C/p\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2016-05-17T16:41:02Z","Content":"\n\u003Cp\u003E\nI am pretty sure 100% of KSP player base never gone interplanetary... I know only one guy that played KSP a bit and have gone to the Moon... Unless all that UFO conspirancy stories are true...\u003Cbr\u003E\u003Cbr\u003E\nOh... you\u0027re talking about ingame interplanetary travel... ok... nevermind... \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2016-05-17T16:41:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586911\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463501626\u0022 data-ipsquote-userid=\u002212858\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n26 minutes ago, Red Iron Crown said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNeeding a \u0022launch window\u0022 is exactly why the principle is different. Get into Kerbin orbit and you can play with a node until you get a reasonably cheap intercept with Mun or Minmus. Same can\u0027t be said for going to another planet, if it\u0027s the wrong time of year then no amount of node fiddling will make it cheap.\n\u003C/p\u003E\n\u003Cp\u003E\nThe issue is that the game tells you exactly nothing about when those transfer windows occur. And it\u0027s a very tough thing to trial-and-error.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis. A thousand times this.\n\u003C/p\u003E\n"},{"CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2016-05-17T16:41:38Z","Content":"\n\u003Cp\u003E\nKerbin, Minmus and the Mun. That\u0027s all the places I\u0027ve been.\n\u003C/p\u003E\n"},{"CreatedByName":"Smitty2016","CreatedById":164367,"CreatedDateTime":"2016-05-17T16:51:43Z","Content":"\n\u003Cp\u003E\nI\u0027ve had KSP since 2014 but the closest thing to interplanetary I\u0027ve done is sending a probe on a flyby of of Duna. I can dock ships decently but I\u0027ve never built something powerful enough to go to another planet. I just tend to get burned out after spending hours on a ship and then having it fail.\n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2016-05-17T17:02:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586911\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463501626\u0022 data-ipsquote-userid=\u002212858\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, Red Iron Crown said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe issue is that the game tells you exactly nothing about when those transfer windows occur. And it\u0027s a very tough thing to trial-and-error.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDefinitely.  At this point it requires going into the online rabbit hole, which is not exactly ideal but kind of fits the mold of the more hardcore games out there.\n\u003C/p\u003E\n\u003Cp\u003E\nI also personally feel like the maneuver node editor in the stock game is perfectly serviceable; I have no need for a more precise editor even when playing with a fully modded RO (funny because I\u0027m the guy who originally wrote PreciseNode).  About the only thing it needs is a better method of making minute adjustments and possibly an ejection angle display, although that can be easily eyeballed and the recent ability of the widget to remember what orbit it\u0027s on while dragging it around the orbit alleviates that to some extent.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-05-17T17:19:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586818\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463498213\u0022 data-ipsquote-userid=\u002260282\u0022 data-ipsquote-username=\u0022DChurchill\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, DChurchill said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhich is why I\u0027ve been to Duna and Eve using the stock system, but I won\u0027t do it again unless MJ ceases to function. The stock maneuver node system is just so painful to use in an interplanetary scale.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u0022Precise Node\u0022 mod is also excellent (maybe better than MJ)\n\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-05-17T17:41:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586324\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463474698\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen I think of all the time my kerbals will spend there waiting for the return window as well, I then want to make it a more substantial mission, which rapidly snowballs into a very major effort.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is a pretty big one for me. Missions past Minmus are typically very complicated if you want everything to go right, you don\u0027t want to cheat, want to be fairly realistic, use an LS mod, you\u0027re a bit of a perfectionist, and you attempt to design rockets with maximum efficiency in mind (both cost, mass, part count to an extent, and not bringing unnecessary dV).....this is my play style.\n\u003C/p\u003E\n\u003Cp\u003E\nSo those are my main problems. I end up spending a \u003Cem\u003Elot\u003C/em\u003E of time in the VAB tinkering to make it a \u003Cem\u003Eperfect\u003C/em\u003E mission. Honestly, I need to let go and stop doing this to such a large extent. I spend so much effort building these missions that I don\u0027t get to spend as much time in flight, where things really get interesting. Sure, I love designing, but at some point it starts to feel like a chore designing complicated missions.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027ve never been further out past Duna, and in the opposite direction, I\u0027ve only done Moho unmanned flybys, so I still have a intimidating amount of stuff to learn.\n\u003C/p\u003E\n\u003Cp\u003E\nMy biggest thing is not wanting to have to cheat, or send rescue missions. This is my basis for a lot of things, and it causes me to spend as much time in the VAB as I do.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222586977\u0022 data-ipsquote-contentid=\u0022139943\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463503262\u0022 data-ipsquote-userid=\u002297503\u0022 data-ipsquote-username=\u0022luizopiloto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, luizopiloto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am pretty sure 100% of KSP player base never gone interplanetary... I know only one guy that played KSP a bit and have gone to the Moon... Unless all that UFO conspirancy stories are true...\u003Cbr\u003E\u003Cbr\u003E\nOh... you\u0027re talking about ingame interplanetary travel... ok... nevermind... \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t have a citation on this, but I suspect more than one person on this planet plays KSP and has gone to space. Granted, lots of people work for NASA and don\u0027t go to space, but I imagine more than a single person plays KSP and has gone off world. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut don\u0027t quote me. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2016-05-17T18:02:41Z","Content":"\n\u003Cp\u003E\nI\u0027ve been to Eve and Duna, plus the Mun and Minmus, all flying manually -- I\u0027ve never used MechJeb.  (I like piloting and docking myself; to me, automating those things would take much of the fun and challenge out of the game.)  In one recent save, I did add PreciseNode, and that considerably eases the maneuver-node manipulation.  \n\u003C/p\u003E\n\u003Cp\u003E\nIn my current game, I\u0027m using the \u0022historical contracts\u0022 mission pack, which has 500 missions or so, many of which will be inside the Kerbin SOI.  I imagine eventually the pack will take me to Duna or such; we\u0027ll see.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-17T18:05:00Z","Content":"\n\u003Cp\u003E\nive been to all bodies via probe but kerballed to moho, kerbin ofc, mun, minmus, duna and eeloo. Got it on steam at .21 fwiw\n\u003C/p\u003E\n"}]}