{"TopicId":140159,"ForumId":32,"TopicTitle":"Why are spaceplanes so twitchy after re-entry?","CreatedByName":"awfulhumanbeing","CreatedById":164500,"CreatedDateTime":"2016-05-20T12:41:29Z","PageNum":1,"Articles":[{"CreatedByName":"awfulhumanbeing","CreatedById":164500,"CreatedDateTime":"2016-05-20T12:41:29Z","Content":"\n\u003Cp\u003E\nHello guys.\n\u003C/p\u003E\n\u003Cp\u003E\nToday I\u0027ve built a Space Shuttle clone, and I\u0027m satisfied with it. But one problem remains: even though it works perfectly fine on takeoff (I tested it with jets), after re-entry it suddenly becomes extremely unstable and absurdly easy to stall and fail the mission. What\u0027s the explanation of this?\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not just my fail. KSO and CSS do the same, and they are engineered perfectly.\n\u003C/p\u003E\n"},{"CreatedByName":"wibou7","CreatedById":155221,"CreatedDateTime":"2016-05-20T14:06:27Z","Content":"\n\u003Cp\u003E\nHard to answer without even a look at the plane.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen does it \u0022start\u0022 becoming unstable is quite important here.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is in the upper layer of the atmosphere?\u003Cbr\u003E\nThen it could be explained by the air being too thin for the control surface to work properly... it will fix itself as you go down.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is near the ground?\u003Cbr\u003E\nThen check your COM / COL \u003Cu\u003Ewhile empty of fuel\u003C/u\u003E in the SPH : the loss mass from the expended fuel may have made your craft naturally unstable.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, are you gliding your way home or are you still under some kind of propulsion?\u003Cbr\u003E\nIf you are gliding, maybe the air speed is just too low for the control surface to work properly. Or maybe you are simply lacking control surface and that the craft was only able to steer because of engine gimbal.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPlease provide more details, screenshots..\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"awfulhumanbeing","CreatedById":164500,"CreatedDateTime":"2016-05-20T14:24:49Z","Content":"\n\u003Cp\u003E\nI can\u0027t upload the craft right now because I\u0027m in a train and my laptop\u0027s battery is dead, I\u0027m asking this with an iPad. But I watched guides and yes, my craft is balanced with or without fuel (once again, tested)\n\u003C/p\u003E\n\u003Cp\u003E\nBecomes unstable approx. at 30 km ASL, right after the flare extinguishes.\n\u003C/p\u003E\n\u003Cp\u003E\nI guess it\u0027s because of lack of lift and low speeds due to overshooting with aero braking. Basically, it might be a piloting mistake. On its takeoff speed of 250 m/s or so and up to Mach 3 the craft is awesome.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll try to fix this, thanks for help!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-20T14:27:16Z\u0022 title=\u002205/20/2016 02:27  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 20, 2016\u003C/time\u003E by awfulhumanbeing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeNapalm","CreatedById":67032,"CreatedDateTime":"2016-05-20T14:51:27Z","Content":"\n\u003Cp\u003E\nEverything wibou7 said, plus are you using engines with gimbals when you\u0027re under power?\n\u003C/p\u003E\n\u003Cp\u003E\nThat changes things significantly from when you\u0027re just on a glide profile.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n-Jn-\n\u003C/p\u003E\n"},{"CreatedByName":"awfulhumanbeing","CreatedById":164500,"CreatedDateTime":"2016-05-20T14:59:24Z","Content":"\n\u003Cp\u003E\nYes, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/67032-joenapalm/\u0026amp;do=hovercard\u0022 data-mentionid=\u002267032\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/67032-joenapalm/\u0022 rel=\u0022\u0022\u003E@JoeNapalm\u003C/a\u003E, I am using gimbals, but it\u0027s not that I have much fuel left on landing.\n\u003C/p\u003E\n"},{"CreatedByName":"Tomator","CreatedById":163065,"CreatedDateTime":"2016-05-20T14:59:41Z","Content":"\n\u003Cp\u003E\nAt 30km the air is so thin that aerodynamic steering may not suffice. Usually I have gyros that help keep the plane under control and maneuvering engines that let maintain safe attack angle when re-entering before the speed falls. Also, having 1500 m/s at high altitudes is quite good for gliding.\n\u003C/p\u003E\n"},{"CreatedByName":"awfulhumanbeing","CreatedById":164500,"CreatedDateTime":"2016-05-20T15:17:27Z","Content":"\n\u003Cp\u003E\nThanks \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/163065-tomator/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022163065\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/163065-tomator/\u0022 rel=\u0022\u0022\u003E@Tomator\u003C/a\u003E, maybe this is it, I\u0027ll check when I get home.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, how do you get 1500 m/s in-atmosphere by gliding?\n\u003C/p\u003E\n"},{"CreatedByName":"qromodynmc","CreatedById":87139,"CreatedDateTime":"2016-05-20T15:46:06Z","Content":"\n\u003Cp\u003E\n250ms take off speed you say? That\u0027s a lot.\n\u003C/p\u003E\n"},{"CreatedByName":"awfulhumanbeing","CreatedById":164500,"CreatedDateTime":"2016-05-20T16:34:36Z","Content":"\n\u003Cp\u003E\nYeah, I know.\n\u003C/p\u003E\n"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2016-05-21T22:20:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222592561\u0022 data-ipsquote-contentid=\u0022140159\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463757447\u0022 data-ipsquote-userid=\u0022164500\u0022 data-ipsquote-username=\u0022awfulhumanbeing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/20/2016 at 10:17 AM, awfulhumanbeing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/163065-tomator/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022163065\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/163065-tomator/\u0022 rel=\u0022\u0022\u003E@Tomator\u003C/a\u003E, maybe this is it, I\u0027ll check when I get home.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, how do you get 1500 m/s in-atmosphere by gliding?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor Kerbin under 100% entry re-heating setting, 1500 m/s is perfectly acceptable until 25Km.\u003Cbr\u003E\nin fact, 1550 m/s at 22Km is what most SSTO spaceplanes get to before switching to rockets during launch.\u003Cbr\u003E\nthis means you don\u0027t have to aerobrake so hard in the upper atmosphere, a 10* pitch above prograde is sufficient to slow down enough while retaining a speed viable enough for control in the thin atmosphere, just don\u0027t use AIRBRAKES yet.\n\u003C/p\u003E\n\u003Cp\u003E\ndon\u0027t worry too much about the red glow, that\u0027s not really heat, it\u0027s just excited gasses giving off light, kinda like a neon lamp.\n\u003C/p\u003E\n\u003Cp\u003E\nin the lower altitudes where the atmosphere is thicker, your glider might wobble around a bit until it reaches a \u0022safe\u0022 speed, but activating the AIRBRAKES can help stabilize it. most of my spaceplanes tend to stall out at this point, and go into an uncontrollable death-spin. when this happens, deploying drouge chutes should be enough to nose-down and regain enough control to nose-up without killing all of your needed air speed.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-21T22:32:19Z\u0022 title=\u002205/21/2016 10:32  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 21, 2016\u003C/time\u003E by Xyphos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-05-22T01:27:14Z","Content":"\n\u003Cp\u003E\nA very common reason why spaceplanes become horribly unstable on reentry:  \u003Cstrong\u003EIt\u0027s because their CoM shifts to the rear.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s say you build a spaceplane with a fuselage full of fuel, engines at the back.  It\u0027s a common design.\n\u003C/p\u003E\n\u003Cp\u003E\nYou place all your wings, control surfaces, etc. and you take off, and hey look, it\u0027s stable!  Why is it stable?  Because the CoM is sufficiently far forward.  Specifically, it\u0027s in front of the center of drag.\n\u003C/p\u003E\n\u003Cp\u003E\nThe CoM is as far forward as it is because the lion\u0027s share of the mass is in the fuel.  Yes, you have those heavy engines at the back, but all that heavy fuel in front of them moves the CoM forward.\n\u003C/p\u003E\n\u003Cp\u003E\nNow you take off and go to orbit.  You burn that fuel.  As you burn fuel, the CoM shifts radically backwards, because for a spaceplane like this, they tend to be very lightweight when empty, \u003Cem\u003E\u003Cu\u003Eexcept\u003C/u\u003E\u003C/em\u003E\u003Cem\u003E \u003C/em\u003Efor those heavy engines at the back of the plane.  So you end up with a craft that has a CoM way towards the back, which is aerodynamically unstable.\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t notice that instability when you\u0027re climbing.  This is because during the air-breathing part of ascent, you have a really high Isp and don\u0027t burn much actual fuel mass, so your CoM doesn\u0027t move much.  When you \u003Cem\u003E\u003Cu\u003Ereally\u003C/u\u003E\u003C/em\u003E start dumping mass is when you shift to rocket power, and that\u0027s when you\u0027ve climbed way past 20 km, which means you don\u0027t even \u003Cem\u003E\u003Cu\u003Enotice\u003C/u\u003E\u003C/em\u003E that you\u0027ve become aerodynamically unstable because there\u0027s not enough air to matter anymore.\n\u003C/p\u003E\n\u003Cp\u003E\nOkay, now you\u0027re in orbit.  When you come back down, you\u0027re empty of fuel.  Why?  Because nobody wants to ship fuel up and down to orbit. Either you built your plane so it has just enough fuel to get to orbit, or else it\u0027s a fuel hauler that unloads the fuel before returning.\n\u003C/p\u003E\n\u003Cp\u003E\nWith your plane now completely empty... its CoM is \u003Cem\u003E\u003Cu\u003Eway\u003C/u\u003E\u003C/em\u003E back in the back of the plane (all those heavy engines), with a lightweight draggy fuselage sticking out in front.  This is a recipe for instability.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, how to fix it?\n\u003C/p\u003E\n\u003Cp\u003E\nYou need to come up with a way to keep the CoM forward even when empty of fuel.  There are various ways to do this.  One way is not to put all your engines at the back.  Mount them on the sides, farther forward up close to the (full) center of mass of the plane.  This way, the CoM won\u0027t shift much when you drain the fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nOkay, so how to \u003Cem\u003E\u003Cu\u003Etest\u003C/u\u003E\u003C/em\u003E it?\n\u003C/p\u003E\n\u003Cp\u003E\nTechnique #1:  In the SPH, try filling and unfilling the fuel tanks while the CoM marker is displayed.  If it moves a lot, that\u0027s bad.\n\u003C/p\u003E\n\u003Cp\u003E\nTechnique #2:  Do a dry run.  Literally.  Launch the plane empty, turn on the infinite-fuel cheat, and try flying it.  Don\u0027t have to go to orbit, just take off and get past Mach 1 or so.  Does it fly okay, or does it flip out?  If it flies okay, then you\u0027re good to go.\n\u003C/p\u003E\n"},{"CreatedByName":"Cairol","CreatedById":145279,"CreatedDateTime":"2016-05-22T09:11:24Z","Content":"\n\u003Cp\u003E\nI use the \u0022RCS Building Aid\u0022 mod to see my CoM in dry state of the craft. So I don\u0027t have to empty all tanks in the VAB/SPH.\u003Cbr\u003E\nAlso, when having a MechJeb module installed on the craft, you can activate an option that displays a red dot that shows the CoM during flight,\u003Cbr\u003E\nwhich gives you a good idea why your craft is misbehaving in some situations.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-22T09:11:57Z\u0022 title=\u002205/22/2016 09:11  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 22, 2016\u003C/time\u003E by Cairol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2016-05-22T14:13:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222592629\u0022 data-ipsquote-contentid=\u0022140159\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463759166\u0022 data-ipsquote-userid=\u002287139\u0022 data-ipsquote-username=\u0022qromodynmc\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn May 20, 2016 at 10:46 AM, qromodynmc said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n250ms take off speed you say? That\u0027s a lot.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis. A thousand times, this.\n\u003C/p\u003E\n\u003Cp\u003E\n250 m/s is a hell of a high \u0022take off\u0022 speed. At sea level that\u0027s about Mach 0.7 or so.  You need more lift, plain and simple. That\u0027s why your craft is stalling and spinning out of control in the high, thin upper atmosphere.\n\u003C/p\u003E\n"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2016-05-22T15:51:49Z","Content":"\n\u003Cp\u003E\nyeah, most of my take-off speeds are around 130 m/s you\u0027re doing almost double. you only need a 0.8 TWR for planes at sea-level, you don\u0027t need the full 1.2 that a rocket needs.\n\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-05-27T13:25:55Z","Content":"\n\u003Cp\u003E\nI have had some really good SSTO s with a 140-150 take off speed but nothing close to 250\n\u003C/p\u003E\n"},{"CreatedByName":"RocketBlam","CreatedById":103420,"CreatedDateTime":"2016-05-27T14:57:09Z","Content":"\n\u003Cp\u003E\nSnark is right. In my experience my CoM has shifted way to the back, making my plane want to stall or even fly backwards. I usually have a little fuel left on the return though, so I transfer it all to the forward-most tank. This usually helps a lot.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is also a good idea to check your CoM and CoL in the SPH both when full of fuel and when empty, by draining all the tanks and looking again. This is also useful when you have a payload that you release in orbit, which also changes your CoM.\n\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2016-05-27T17:28:04Z","Content":"\n\u003Cp\u003E\nIn my MK3 shuttle replica, I place one of the MK3 monopropellant tanks on either ends of the bay doors to act as ballast tanks.   In the SPH, I make sure that each tank is only half full (empty?) with 500 units of mono each. This way, I can push all the monopropellant to the front tank which would be 100% full and the back one 100% empty.  This allows you to control you COM a bit more.  Add to this the 100 units in the MK3 cockpit as a forward reserve (turn fuel flow off in the SPH) and you can have a little more to use as ballast after you\u0027ve burned off much of your mono in space (if youre using the OMS style for thrust in space).   Of couse, this isnt exactly efficient in that youre hauling mono up and down into space, but that mono has a ballast use beyond its thrust capabilities, so its a fair trade to me.  \n\u003C/p\u003E\n"},{"CreatedByName":"Raideur Ng","CreatedById":158532,"CreatedDateTime":"2016-05-27T18:14:42Z","Content":"\n\u003Cp\u003E\nWe\u0027ve established that when you burn fuel, your CoM will shift, probably to the rear, and if you undock cargo from an internal bay, CoM will shift. Ideally, having both your full (fuel \u002B cargo) and empty CoM right in the middle of your cargo hold.\n\u003C/p\u003E\n\u003Cp\u003E\nA decent question is how do you possibly wing this? Engines will always be towards the rear and without a non-fuel counterweight, you cannot balance your vehicle short of eyeballing fuel redistribution.\n\u003C/p\u003E\n\u003Cp\u003E\nAny thoughts? (Sorry to put a question in a question)\n\u003C/p\u003E\n"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2016-05-27T19:39:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604112\u0022 data-ipsquote-contentid=\u0022140159\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464372882\u0022 data-ipsquote-userid=\u0022158532\u0022 data-ipsquote-username=\u0022Raideur Ng\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Raideur Ng said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe\u0027ve established that when you burn fuel, your CoM will shift, probably to the rear, and if you undock cargo from an internal bay, CoM will shift. Ideally, having both your full (fuel \u002B cargo) and empty CoM right in the middle of your cargo hold.\n\u003C/p\u003E\n\u003Cp\u003E\nA decent question is how do you possibly wing this? Engines will always be towards the rear and without a non-fuel counterweight, you cannot balance your vehicle short of eyeballing fuel redistribution.\n\u003C/p\u003E\n\u003Cp\u003E\nAny thoughts? (Sorry to put a question in a question)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, this is a \u003Cem\u003Efuel \u003C/em\u003Ecounterweight, so not exactly what you asked for, but I find it works.  Add a small fuel tank forward in the fuselage, well ahead of the center of lift.  It does not need to be a lot of fuel, just needs to be far enough forward that it can leverage the center of mass.  Fill the tank, and set it to deny fuel flow.  That will keep the mass up front while the rear tanks dry up first.  If you need that extra fuel, you can unlock the fuel lines on that tank and let the fuel draw from there, so the extra mass is not just \u0022dead weight\u0022.  \n\u003C/p\u003E\n\u003Cp\u003E\nI find it works well for spaceplanes that spend most of their fuel mass getting to orbit, then need to save a little extra anyway to make it back to the ground safely.  The forward tank is effectively treated as cargo mass on the way up, and all the rest of the fuel can be spent getting it up there.  Then that becomes the landing fuel that the plane needs to navigate back to the runway.  By the time you are ready to use it, you do not have much fuel in the rear tanks left to wreck the stable balance.  \n\u003C/p\u003E\n"},{"CreatedByName":"RocketBlam","CreatedById":103420,"CreatedDateTime":"2016-05-27T20:56:09Z","Content":"\n\u003Cp\u003E\nI always try to put a rocket fuel tank right behind the crew pod. This lets me transfer whatever leftover fuel I have as far forward as possible. If you have no fuel, I guess there\u0027s not much you can do. This is also why I usually put parachutes on the top of my spaceplanes. If worse comes to worse, I can just land under chutes like a regular pod.\n\u003C/p\u003E\n"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2016-05-27T21:23:58Z","Content":"\n\u003Cp\u003E\nAlthough it was for the fact that the center of lift moves between subsonic and supersonic speeds (not modeled in ksp afaik) Concorde did this move the fuel around trick to stay stable in all flight modes.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-27T21:24:22Z\u0022 title=\u002205/27/2016 09:24  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 27, 2016\u003C/time\u003E by tg626\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-05-28T04:33:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604112\u0022 data-ipsquote-contentid=\u0022140159\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464372882\u0022 data-ipsquote-userid=\u0022158532\u0022 data-ipsquote-username=\u0022Raideur Ng\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Raideur Ng said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe\u0027ve established that when you burn fuel, your CoM will shift, probably to the rear, and if you undock cargo from an internal bay, CoM will shift. Ideally, having both your full (fuel \u002B cargo) and empty CoM right in the middle of your cargo hold.\n\u003C/p\u003E\n\u003Cp\u003E\nA decent question is how do you possibly wing this? Engines will always be towards the rear and without a non-fuel counterweight, you cannot balance your vehicle short of eyeballing fuel redistribution.\n\u003C/p\u003E\n\u003Cp\u003E\nAny thoughts? (Sorry to put a question in a question)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEngines don\u0027t have to be at the rear. You can mount them on the sides, farther forward, near the CoM (Skylon-style).\n\u003C/p\u003E\n"},{"CreatedByName":"awfulhumanbeing","CreatedById":164500,"CreatedDateTime":"2016-05-28T05:01:33Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/57336-lamelefty/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257336\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57336-lamelefty/\u0022 rel=\u0022\u0022\u003E@LameLefty\u003C/a\u003E, I do have problems like this with SSTOs, probably that\u0027s the reason they don\u0027t fly.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I was talking originally about a Shuttle. I designed it with dry tanks because it shouldn\u0027t be stable as a plane should on takeoff, it takes off vertically with an external tank which makes gliding impossible.\n\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2016-05-28T12:56:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604830\u0022 data-ipsquote-contentid=\u0022140159\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464411693\u0022 data-ipsquote-userid=\u0022164500\u0022 data-ipsquote-username=\u0022awfulhumanbeing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, awfulhumanbeing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/57336-lamelefty/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257336\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57336-lamelefty/\u0022 rel=\u0022\u0022\u003E@LameLefty\u003C/a\u003E, I do have problems like this with SSTOs, probably that\u0027s the reason they don\u0027t fly.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I was talking originally about a Shuttle. I designed it with dry tanks because it shouldn\u0027t be stable as a plane should on takeoff, it takes off vertically with an external tank which makes gliding impossible.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDry tanks or not, the vehicle still needs to be aerodynamically stable during entry and clearly your craft is not. It needs bigger wings and (probably) more lateral control as well via a larger tail. Look at photos of real high speed aircraft and design accordingly. \n\u003C/p\u003E\n"},{"CreatedByName":"Tiberius K","CreatedById":163867,"CreatedDateTime":"2016-05-30T06:12:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604830\u0022 data-ipsquote-contentid=\u0022140159\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464411693\u0022 data-ipsquote-userid=\u0022164500\u0022 data-ipsquote-username=\u0022awfulhumanbeing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 28/05/2016 at 3:01 PM, awfulhumanbeing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/57336-lamelefty/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257336\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57336-lamelefty/\u0022 rel=\u0022\u0022\u003E@LameLefty\u003C/a\u003E, I do have problems like this with SSTOs, probably that\u0027s the reason they don\u0027t fly.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I was talking originally about a Shuttle. I designed it with dry tanks because it shouldn\u0027t be stable as a plane should on takeoff, it takes off vertically with an external tank which makes gliding impossible.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSince it takes off as a shuttle the weight of fuel etc is obviously not relevant but it\u0027s not necessarily lacking lift as some are saying.  You should try transferring it to the SPH though and launch it from the runway with a tiny bit of fuel (minus payload, external tanks etc) just to test if it\u0027ll glide at a reasonably low speed without stalling.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my experience when you are re-entering and in the thin air high up in the atmosphere you can either allow the craft to tumble and attempt to regain control by manically trying to push the nose into the dive lower in the atmosphere, or if the COM/COL are very close try to keep your nose glued (or very close to) prograde to avoid tumbling.  You can end up diving quite steeply following the prograde vector but should be able to pull up when the air bites assuming you\u0027ve re-entered shallow and bled off most of your speed high up.  If you have air brakes disengage them.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-30T06:13:08Z\u0022 title=\u002205/30/2016 06:13  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 30, 2016\u003C/time\u003E by Tiberius K\u003C/strong\u003E\n\u003C/span\u003E\n"}]}