{"TopicId":141538,"ForumId":32,"TopicTitle":"I feel like I\u0026#039;ve done so little, yet so much, in KSP lately...","CreatedByName":"dewin","CreatedById":96372,"CreatedDateTime":"2016-06-10T02:59:09Z","PageNum":1,"Articles":[{"CreatedByName":"dewin","CreatedById":96372,"CreatedDateTime":"2016-06-10T02:59:09Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003E(TL;DR: Orbital mechanics is fun.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo I recently finally decided to install kOS.  I\u0027m a software developer by trade -- the only reason I put off kOS so long is I\u0027d rather write in a real language (Python preferably).  But then I started having mod ideas that require an understanding of astromechanics to pull off correctly... and trying to learn them at the same time as learning C# and restarting KSP a bunch didn\u0027t seem like a good idea.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the last month, I\u0027ve launching KSP pretty much as soon as I got home from work every day.  But I haven\u0027t set foot in the VAB or SPH, launched any rockets, landed on any planets, or even left Kerbin\u0027s SOI.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I have done feels more like rocket science to me than all of my previous hundreds of hours in KSP combined.\n\u003C/p\u003E\n\u003Cp\u003E\nIt began with an unplanned crash refresher course on mathematics.  By the way, almost all of the orbital math in KSP (and other cases of restricted 2-body problem) requires only basic algebra. This is good, because I never took calculus, differential equations, or anything else.  (I have a computer science background, but no formal education beyond high school knowledge that I\u0027ve not really used much since then.)\n\u003C/p\u003E\n\u003Cp\u003E\nSome of the more unusual math concepts I\u0027ve dealt with are:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nComplex numbers -- those with both real and imaginary (\u003Cem\u003Ei\u003C/em\u003E = sqrt(-1)) parts.  This is mostly for trigonometry functions involving hyperbolas -- in practice, the actual formulas used don\u0027t have imaginary numbers at all.\n\u003C/li\u003E\n\u003Cli\u003E\nDerivatives -- which are basically “What is the slope of this curve at this location”.  They look way more complicated than they really are -- it\u0027s really “what is the value of y at these two very close values of x, and what\u0027s the slope of the resulting line?”.  These are used for calculating velocity at a particular point in an orbit.\n\u003C/li\u003E\n\u003Cli\u003E\nFormulas with no closed-form solution -- which means you can\u0027t truly “solve for x”, you can only test various values of x and see what gets you acceptably close to y.  A simple example of this is square roots: if you were to try to calculate sqrt(2), you know that it\u0027s greater than 1 (1*1=1) but less than 2 (2*2=4), so you might try 1.5 and so on until you converge on the solution.  Calculating eccentric anomaly (needed to find true anomaly) from mean anomaly is an example of this.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nFrom there, I\u0027ve spent a bunch of time learning about astromechanics.  (And I still am!)  kOS has lots of useful functions about getting information on an existing orbit, but those capabilities are nowhere near complete.  There\u0027s no MechJeb-esque “Plot a maneuver at LAN to raise inclination to 30 degrees” function.  Additionally, there\u0027s no built-in way to construct an arbitrary orbit (say… the effects of executing a possible maneuver).\n\u003C/p\u003E\n\u003Cp\u003E\nSo some of my goals are now:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli dir=\u0022ltr\u0022\u003E\nImplementing all sorts of maneuver planning capabilities within kOS\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\nMaking it possible to select the most efficient plan to arrive at a given result.  For instance, bi-elliptic transfers are sometimes more efficient than Hohmann ones, and ascending/descending nodes are not always the best place to perform an inclination change.\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\nWriting down everything I\u0027ve learned, formulas and all, in a guide that is more approachable and doesn\u0027t require having to memorize all of the symbols involved.\n\u003C/li\u003E\n\u003Cli dir=\u0022ltr\u0022\u003E\nAt some point, actually playing the game again \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSome interesting things that I\u0027ve learned along the way:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nSometimes “North” or “South” (as related to the poles) are the best place to do inclination changes, against all logic.\n\u003C/li\u003E\n\u003Cli\u003E\nNorth and South are always 90 degrees true anomaly away from LAN and LDN.\n\u003C/li\u003E\n\u003Cli\u003E\n“Radial out” and “up” are not the same direction unless your vertical velocity is zero: at periapsis, apoapsis, or a circular orbit.\n\u003C/li\u003E\n\u003Cli\u003E\nIt\u0027s possible to turn a set of the six Keplerian elements into a pair of position and velocity vectors.  It\u0027s also possible to go the other way.  This is handy for orbit prediction.\n\u003C/li\u003E\n\u003Cli\u003E\nSometimes running an entire orbit while graphing data makes formulas blatantly obvious.\n\u003C/li\u003E\n\u003Cli\u003E\nYou can calculate latitude for any position in an orbit with the following formula:\u003Cbr\u003E\nsin(λ) = sin(ω\u002BΩ) * sin(i)\u003Cbr\u003E\nor: sin(latitude) = sin(argument_of_periapsis \u002B true_anomaly) * sin(inclination)\u003Cbr\u003E\u003Cem\u003EI actually derived this formula myself by gathering a bunch of data and graphing it out (as opposed to finding it on the internet), so I’m pretty proud of this one.\u003C/em\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFor anyone else who might find themselves tempted to dive down the rabbit rocket hole, I thought I’d collect some of the resources I’ve found useful:\n\u003C/p\u003E\n\u003Cul dir=\u0022ltr\u0022\u003E\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Orbital_elements\u0022 rel=\u0022external nofollow\u0022\u003EWikipedia article on Orbital elements\u003C/a\u003E - basic starting-off point for everything\n\u003C/li\u003E\n\u003Cli\u003E\nThe Wikipedia articles for \u003Ca href=\u0022https://en.wikipedia.org/wiki/Mean_anomaly\u0022 rel=\u0022external nofollow\u0022\u003Emean\u003C/a\u003E, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Eccentric_anomaly\u0022 rel=\u0022external nofollow\u0022\u003Eeccentric\u003C/a\u003E, and \u003Ca href=\u0022https://en.wikipedia.org/wiki/True_anomaly\u0022 rel=\u0022external nofollow\u0022\u003Etrue\u003C/a\u003E anomaly.\n\u003C/li\u003E\n\u003Cli\u003E\nVarious other Wikipedia articles\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022http://space.stackexchange.com/questions/1904/how-to-programmatically-calculate-orbital-elements-using-position-velocity-vecto\u0022 rel=\u0022external nofollow\u0022\u003E“How to programmatically calculate orbital elements using position/velocity vectors?\u003C/a\u003E” post on StackExchange, including -- to a lesser extent -- some of the links off of that page.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022http://www.bogan.ca/orbits/kepler/orbteqtn.html\u0022 rel=\u0022external nofollow\u0022\u003E“Equations for Elliptical, Parabolic, Hyperbolic Orbits”\u003C/a\u003E full of various formulas for the various types of orbital trajectories.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022http://www.braeunig.us/space/orbmech.htm\u0022 rel=\u0022external nofollow\u0022\u003E“Basics of Spaceflight: Orbital Mechanics”\u003C/a\u003E -- Linked off the kOS subreddit, but I ended up finding it independently first.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022http://www.dept.aoe.vt.edu/~lutze/AOE4134/\u0022 rel=\u0022external nofollow\u0022\u003EAOE 4134\u003C/a\u003E, supplemental page for a an Astromechanics course taught at Virginia Tech (thanks, Google!).   Very information-dense.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-10T02:59:49Z\u0022 title=\u002206/10/2016 02:59  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 10, 2016\u003C/time\u003E by dewin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2016-06-10T03:28:11Z","Content":"\n\u003Cp\u003E\nSo,,, you\u0027re kind of into KSP, hey?\n\u003C/p\u003E\n"},{"CreatedByName":"Moarmau5","CreatedById":148243,"CreatedDateTime":"2016-06-11T03:36:09Z","Content":"\n\u003Cp\u003E\nWas going to comment, but SpacedCowboy pretty much took my words lol\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-11T03:36:30Z\u0022 title=\u002206/11/2016 03:36  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 11, 2016\u003C/time\u003E by Moarmau5\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2016-06-11T04:52:17Z","Content":"\n\u003Cp\u003E\nYou might be surprised how many astronauts spend a lot of time crunching numbers before a mission and not even feel bothered by it(Like, \u0022Why am I doing this and not already docking with the ISS?\u0022).  For one thing, they are doing their part to ensure mission success, and another, it\u0027s in their blood.\n\u003C/p\u003E\n"}]}