{"TopicId":14290,"ForumId":32,"TopicTitle":"Share your Mun Base!","CreatedByName":"Gabe_Ruckus","CreatedById":32373,"CreatedDateTime":"2012-07-14T06:44:25Z","PageNum":1,"Articles":[{"CreatedByName":"Gabe_Ruckus","CreatedById":32373,"CreatedDateTime":"2012-07-14T06:44:25Z","Content":"\n\u003Cp\u003EFirst, hello, been lurking around for a bit, but I\\\u0027m enjoying KSP more and more lately (And it\\\u0027s a game I can play with my kids, huge bonus), figured I\\\u0027d register in the forums.\u003C/p\u003E\u003Cp\u003EI gave myself a bunch of challenges with the stock parts, orbits, trips to the moons, a hangar full of working air (not space) planes, and an atmospheric X-Wing fighter. Figured I\\\u0027d try out some mods and ramp up my challenges a bit, and went for broke. Skipping the space station, I created...\u003C/p\u003E\u003Cp\u003EMy first Mun base! I used a bunch of Kosmos parts and cobbled together a moon base. Set it on top of a 3 stage NovaPunch rocket and sent it on my way. First thing I learned, mod parts do NOT imbalance the game. Thought that would be the case, that\\\u0027s why I stayed away from them for so long. They do open the door on creating new challenges. Now that my Kerbals have a permanent base on the moon, I need to send them a rover, and put communications satellites in Mun orbit. Anyway, here it is, Mun Base Alpha!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i482.photobucket.com/albums/rr186/gsleighter/1.jpg\u0022 alt=\u00221.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDescending with the transit stage still attached.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i482.photobucket.com/albums/rr186/gsleighter/2.jpg\u0022 alt=\u00222.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETransit detached, lowering the station to the surface (Turns out I brought WAY too much fuel - I could fly the station to Minmus and back if I wanted).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i482.photobucket.com/albums/rr186/gsleighter/3.jpg\u0022 alt=\u00223.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter two aborted landings, I finally brought the whole complex down to its new home on the Mun. Now I just need a passenger lander to swap out the crew every now and then.\u003C/p\u003E\u003Cp\u003EAttached the craft file for the whole base \u002B rockets.\u003C/p\u003E\u003Cp\u003EWhat have you guys got?\u003C/p\u003E\n"},{"CreatedByName":"glugg23","CreatedById":26082,"CreatedDateTime":"2012-07-14T13:46:25Z","Content":"\n\u003Cp\u003EWhat mods did you use to make this?\u003C/p\u003E\n"},{"CreatedByName":"kacperrutka26","CreatedById":18849,"CreatedDateTime":"2012-07-14T13:51:32Z","Content":"\n\u003Cp\u003ENice base, I don\\\u0027t like to use mods so I don\\\u0027t make such huge space bases. And I never get my two rockets close \u003C/p\u003E\u003Cp\u003Eto each other, usually 1 of the rockets is ont he other side of the mun from the other one ???\u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-07-14T17:53:36Z","Content":"\n\u003Cp\u003ENeat.\u003C/p\u003E\u003Cp\u003EI must be retarded or something, because I can\\\u0027t get any of the 6-way connecting nodes to work anymore.\u003C/p\u003E\n"},{"CreatedByName":"GeekyMe97","CreatedById":24678,"CreatedDateTime":"2012-07-14T19:07:13Z","Content":"\n\u003Cp\u003EI once built a base on the Moon with the stock parts, by flying up there multiple times and landing several times and putting them close to each other. Though one of the landings failed and everything exploded D:\u003C/p\u003E\n"},{"CreatedByName":"Gabe_Ruckus","CreatedById":32373,"CreatedDateTime":"2012-07-14T23:20:30Z","Content":"\n\u003Cp\u003EI\\\u0027m using Kosmos space station parts for the Mun base, and NovaPunch rocket parts for the main rocket. The 6-way connectors were weird, they didn\\\u0027t want to work but I randomly rotated them until they snapped into place. Just keep hitting the rotate keys until they turn green.\u003C/p\u003E\u003Cp\u003ELanding rockets in the same spot turned out to be pretty easy on the equator, just do a hard retrograde burn and drop straight down on the site. It\\\u0027s easier with bases since you don\\\u0027t have to budget your fuel for the return trip.\u003C/p\u003E\n"}]}