{"TopicId":14474,"ForumId":32,"TopicTitle":"The Small Things","CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-07-17T05:12:10Z","PageNum":1,"Articles":[{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-07-17T05:12:10Z","Content":"\n\u003Cp\u003EI\\\u0027ll start with something I found while playing around with the large hinges from Damned Robotics. I had them extended out from my rocket with some fuel tanks on the ends. When I launched, I soon started rolling, and when I pulled them in closer the roll sped up to ludicrous speed, following the laws of physics quite satisfyingly. The opposite was also true when I launched with them tucked in; as I started rolling, I extended them and calmed the roll (for a short time).\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-17T06:09:55Z","Content":"\n\u003Cp\u003EI was thinking of starting a thread like this. \u003C/p\u003E\u003Cp\u003EAfter you eject a stage or coupler, if your rocket wash moves over it, the discarded piece picks up momentum and rotation from the impact of the exhaust. I can\\\u0027t tell if RCS does it as well, but it wouldn\\\u0027t surprise me. \u003C/p\u003E\u003Cp\u003EMun\\\u0027s surface includes newer craters with dark lava-flow floors and sharp edges, but also older craters with faded colors and contours rounded by erosion (presumably by the same micrometeorites that cause that effect on earth\\\u0027s moon). Somebody took the care to make Mun look as if it\\\u0027s been shaped by billions of years of natural forces. \u003C/p\u003E\u003Cp\u003EHave you ever driven a rover around KSC? The buildings are actually kind of cool-looking. Has everybody noticed that the radio dish on the tracking station rotates? \u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-07-17T09:50:11Z","Content":"\n\u003Cp\u003EYep, the dish has always rotated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI did a double-take first time, though.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2012-07-17T11:52:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003E Somebody took the care to make Mun look as if it\\\u0027s been shaped by billions of years of natural forces. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen Mun rises over the horizon, visible through the atmosphere of Kerbin, it looks just like the real thing. Catches my eye every time.\u003C/p\u003E\n"},{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-07-17T13:10:16Z","Content":"\n\u003Cp\u003EI love how the atmosphere looks when Kerbol sets and rises. The way it turns from black, to orange, to blue and how Kerbol just blinds you when it just peeps over the horizon.\u003C/p\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-07-17T14:26:39Z","Content":"\n\u003Cp\u003EI was just about to say, speaking of over the horizon...\u003C/p\u003E\u003Cp\u003EYeah, those effects are pretty amazing for a game still in alpha. I hope they\\\u0027ll be touched up even more later on as more polish is added \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-17T16:59:04Z","Content":"\n\u003Cp\u003EAt times I have forgotten to make my gravity turn because I love watching the sky fade from blue to black behind my rocket. It makes me feel like I really am going somewhere exotic and exciting. \u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-07-17T20:29:50Z","Content":"\n\u003Cp\u003EI love how Minmus looks just like a star from a low orbit, and slowly becomes a big object on the screen.\u003C/p\u003E\n"},{"CreatedByName":"Da_Dumples","CreatedById":32594,"CreatedDateTime":"2012-07-17T23:40:05Z","Content":"\n\u003Cp\u003EI like how you can explain what you\\\u0027re doing to a friend and make yourself look like a genius.\u003C/p\u003E\n"},{"CreatedByName":"ElectroxSoldier","CreatedById":18194,"CreatedDateTime":"2012-07-18T01:12:25Z","Content":"\n\u003Cp\u003EThere\\\u0027s a favorite spot of mine on the Mun, it\\\u0027s on the side not facing Kerbin, there\\\u0027s a huge crater, a small crater at the bottom right that\\\u0027s half in half out of that Big Crater, and east of that, is a huge canyon of some sorts. Fascinating from low orbit, and huge from a rover\\\u0027s point of view (can be dangerous too if you start picking up speed).\u003C/p\u003E\u003Cp\u003EOtherwise, it amazes me how small Minmus is, as a rover, I landed on a Ice lake, and on the horizon I only saw one mountain sticking up, the closer I got the more mountains I saw, and on the top of that mountain, I could see a nice view, plus you can see the curved horizon of Minmus due to it\\\u0027s size.\u003C/p\u003E\n"},{"CreatedByName":"Czman007","CreatedById":22578,"CreatedDateTime":"2012-07-18T11:04:19Z","Content":"\n\u003Cp\u003EI love how you can watch Kerbin rise on the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Vostok","CreatedById":22467,"CreatedDateTime":"2012-07-18T21:06:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Czman007\u0022 data-cite=\u0022Czman007\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI love how you can watch Kerbin rise on the Mun.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought kerbin and the mun were tidally locked, meaning that what you just said is impossible.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-18T21:14:35Z","Content":"\n\u003Cp\u003EWhen you deploy or retract the landing wheels, the housing has 3 little doors that open and close: 2 that move to the sides, and the long one that covers the strut. \u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2012-07-18T21:17:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vostok\u0022 data-cite=\u0022Vostok\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI thought kerbin and the mun were tidally locked, meaning that what you just said is impossible.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe may have meant when you orbit around the Mun at 270.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-25T00:47:25Z","Content":"\n\u003Cp\u003EWhen your little guy is climbing ladders, he looks up or down (as appropriate) to see where he\\\u0027s going. Also, in EVA backpack mode, he\\\u0027s actually got little joysticks in each hand, with little red actuator buttons on top. \u003C/p\u003E\u003Cp\u003EOn the title screen where the Kerbal is standing on the Mun, Kerbin in the background is rotating. You\\\u0027ve probably noticed that occasionally a meteorite (?) zips by and bounces across the surface, but just now, I think I saw a Kerbal in a space suit tumbling by instead. \u003C/p\u003E\n"},{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-07-25T00:56:38Z","Content":"\n\u003Cp\u003EI like how when your on the mun and you are controlling a kerbal going like 30m/s and you hit the ground, he starts bouncing across the surface all ragdoll like. What makes the moment is you can switch to another kerbal near to the bouncing kerbal and you get to see from his vantage point the bouncing kerbal pass by him. Its very comical ;D\u003C/p\u003E\n"},{"CreatedByName":"ElectroxSoldier","CreatedById":18194,"CreatedDateTime":"2012-07-25T01:42:59Z","Content":"\n\u003Cp\u003EAnother little thing now that 0.16 is out, is just simply, EVA.\u003C/p\u003E\u003Cp\u003EEvery single rocket I bring up to the heavens I have the real need to, have a spacewalk, float around near the ship, even mess around, making my kerbal spin around crazily in orbit, while listening to \u0027Right Round\u0027 by Flo Rida hehehe.\u003C/p\u003E\u003Cp\u003ELanding on the Mun, stepping out my crew, walking around, jumping, crashing into the 2 other crewmates.\u003C/p\u003E\u003Cp\u003ESmall things... ;D\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-25T02:57:32Z","Content":"\n\u003Cp\u003ESaw it again. The thing that bounces by the Mun guy is a helmet. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u0027Right Round\u0027 by Flo Rida \u003C/div\u003E\u003C/blockquote\u003EYou rotten kids and your synthesized music! \u0026gt;\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E In my day we had \u003Ca href=\u0022https://www.youtube.com/watch?v=zJv5qLsLYoo#\u0022 rel=\u0022external nofollow\u0022\u003Ereal music\u003C/a\u003E! (Is that plagiarism or what?)\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-10-03T02:34:22Z","Content":"\n\u003Cp\u003EHas anybody else noticed that the little crew portraits on the lower right get brighter or darker depending on whether the windows on the ship are facing the sun? Because they do.\u003C/p\u003E\n"},{"CreatedByName":"Yeomans","CreatedById":46569,"CreatedDateTime":"2012-10-03T02:44:13Z","Content":"\n\u003Cp\u003EI love when solid boosters separate and all drift away in unison behind the ship, it\u0027s so cool, it really gives the feeling of microgravity.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EOne thing that they should add soon is so that when your in IVA mode, and your character looks around, that you see them looking around in the pilot view. That would be GREAT.\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"MinerEdgar","CreatedById":21247,"CreatedDateTime":"2012-10-03T04:19:37Z","Content":"\n\u003Cp\u003EI was going to the Mun (first time i did that in .17) and i looked out the window and, there with the mun in sight, was little minmus. I zoomed in and saw so much detail on its surface, it was very cool.\u003C/p\u003E\n"}]}