{"TopicId":149495,"ForumId":32,"TopicTitle":"So, is KSP dying?","CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2016-10-08T14:33:33Z","PageNum":1,"Articles":[{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2016-10-08T14:33:33Z","Content":"\n\u003Cp\u003E\nBefore this thread turns into a hate train, I\u0027m not saying that KSP as a game is dying, I\u0027m saying that people who have worked on the game such as modders and developers are leaving and not getting replaced, or not as far as I\u0027m aware.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, this is pretty sad. If it keeps up, development could eventually be forced to stop, although I doubt that will happen any time soon.\n\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2016-10-08T14:41:29Z","Content":"\n\u003Cp\u003E\nPorkjet\u0027s departure is a blow to future graphical improvements. Beyond that, it\u0027s not really clear yet what the difference will be.\n\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2016-10-08T14:44:38Z","Content":"\n\u003Cp\u003E\nIt\u0027s normal for developers to come and go.  Kudos to them for stating until 1.2 was mostly finished.  They still have a number of developers, in fact, they have more total developers now than at the beginning of the year.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease drop this, since the topic has been beaten to death in other forums and threads\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-10-08T14:49:48Z","Content":"\n\u003Cp\u003E\nKSP is not dying..\n\u003C/p\u003E\n\u003Cp\u003E\nSeriously dude, asking if KSP is dying isn\u0027t helping at all.\n\u003C/p\u003E\n\u003Cp\u003E\nJust be happy atleast that we still have 1.2.\n\u003C/p\u003E\n\u003Cp\u003E\nAs mentioned previously, drop this. It\u0027s going to be blocked by moderators anyways\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Papa_Joe","CreatedById":10788,"CreatedDateTime":"2016-10-08T14:55:38Z","Content":"\n\u003Cp\u003E\nWith that said, build 1574 dropped late last night.  Check out the change log\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/147583-12-prerelease-changelog/#comment-2792778\u0022 rel=\u0022\u0022\u003E here\u003C/a\u003E:  \n\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2016-10-08T15:03:34Z","Content":"\n\u003Cp\u003E\nThe devs who left were temporary contractors or remote personnel; Squad seems to be shifting to a more local dev team. If you check out this week\u0027s Squadcast, UomoCapra is in a room jam-packed full of the new developers working hard on 1.2 AND 1.3. So, no. Not dying.\n\u003C/p\u003E\n"},{"CreatedByName":"Frybert","CreatedById":97766,"CreatedDateTime":"2016-10-08T15:12:11Z","Content":"\n\u003Cp\u003E\nKSP is not dying anymore than any software eventually gets to a point there\u0027s only so much can be done. If you wish to discuss the recent dev departure there are plenty of other threads to choose from, closing this one.\n\u003C/p\u003E\n"}]}