{"TopicId":150186,"ForumId":32,"TopicTitle":"Why I fell in love with KSP in the first place","CreatedByName":"EladDv","CreatedById":118368,"CreatedDateTime":"2016-10-17T01:11:04Z","PageNum":1,"Articles":[{"CreatedByName":"EladDv","CreatedById":118368,"CreatedDateTime":"2016-10-17T01:11:04Z","Content":"\n\u003Cp\u003E\nThis year has been tough, I went straight from high school to university and began my studies towards a degree in physics and computer science in one of the best universities in the country. It has not been easy-I studied hard, barely went out with friends and had almost no relationships but I\u0027ve made it through, this summer I went to basic training (dont ask why, it\u0027s just a normal thing here)- luckily it was with great people but they still were rough 1.5 months. Just after the academic year ended I moved back with my parents so I could focus on my studies and not work (much \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E ).\n\u003C/p\u003E\n\u003Cp\u003E\nSo here I am, it\u0027s 10 PM and I find myself with nothing to do, nobody is going out today and I dont feel like doing anything really, and then... I fire up KSP for the first time in a year...\n\u003C/p\u003E\n\u003Cp\u003E\nSuddenly all my problems melt away, I cant remember the last time I was just being there, focused, not worried on stuff like how my year is gonna be and when will I find someone, I was just focused on the game, \u0022there we go... a new career, and this time on hard(plus some extra modifiers for more difficulty)\u0022. It\u0027s now 4AM, I just got back from my first landing on minmus (in that career), I have 200k in the bank and the next mission is going to be either landing on mun or placing satellites around kerbin and minmus for contracts (and comms).\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I play KSP I just disappear for hours, not thinking about the outside world. Just focused on the physics and the game, it\u0027s not satisfying because I\u0027m winning...it\u0027s not that kind of experience for me,I just look out into space and I\u0027m in awe,YES it\u0027s just a video game but I\u0027m totally lost, this game is something else, I feel like it\u0027s something that has become a part of me now. With everything that happened in the last year I was starting to feel overwhelmed and as funny as it is to say that, I feel like KSP has brought me down to earth, it calmed me and gave me an escape for a few hours from my busy life and that\u0027s why I keep coming back for it, that\u0027s why I fell in love with Kerbal Space Program in the first place.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEladDv.\n\u003C/p\u003E\n"},{"CreatedByName":"Freshmeat","CreatedById":111048,"CreatedDateTime":"2016-10-17T07:01:19Z","Content":"\n\u003Cp\u003E\nKnow the feeling. Although I am to tired to fire KSP up most evenings, when I get started I just play until I get direct orders from the wife. Although I have landed on most bodies, a Mun touchdown just never gets old. Yesterday I had a splitting headache, but when I messed with some tuning parameters for my controller, I could forget about it. Still waiting for the last crucial mod to update before upgrading to 1.2, but the exploration is still the same.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-10-17T09:04:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI feel like KSP has brought me down to earth\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, that\u0027s Ironic!\n\u003C/p\u003E\n\u003Cp\u003E\nBut yes, it is calming and relaxing.... most of the time... trying to get a complicated aircraft or high speed rover working just right can be frustrating at times. Docking large craft can also be furstating \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}