{"TopicId":15011,"ForumId":32,"TopicTitle":"No atmospheric drag?","CreatedByName":"Joshman1306","CreatedById":13351,"CreatedDateTime":"2012-07-24T06:24:34Z","PageNum":1,"Articles":[{"CreatedByName":"Joshman1306","CreatedById":13351,"CreatedDateTime":"2012-07-24T06:24:34Z","Content":"\n\u003Cp\u003EHey guys. I updated to 0.16 and I launched a rocket to get to the Mun. Everything went fine except for when I decoupled my stage. As it usually does, it continued on its orbit but since its periapsis was at 20,000m I decided to check and see what it would do. I noticed that it did not experience atmospheric drag as you would expect until after I had switched to make it my current vessel. Has this always been the case and if not, is there a way to fix it?\u003C/p\u003E\u003Cp\u003EThanks in advance. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"leopardenthusiast","CreatedById":26084,"CreatedDateTime":"2012-07-24T06:48:14Z","Content":"\n\u003Cp\u003EI\\\u0027m fairly sure that unless the craft in question is either VERY close or the one you\\\u0027re piloting, it won\\\u0027t actually be affected by physics, instead just moving on rails. You also need to keep time warp off.\u003C/p\u003E\n"},{"CreatedByName":"Marcvs101","CreatedById":31953,"CreatedDateTime":"2012-07-24T11:31:02Z","Content":"\n\u003Cp\u003EThe game can handle more than 1000 pieces of debris... Now imagine the work of the physics engine if all theese debris entered the atmosphere...\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-07-24T11:51:02Z","Content":"\n\u003Cp\u003EIt\\\u0027s always been the case. Not sure if that will ever be changed. Possibly not but I\\\u0027m just guessing.\u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-07-24T16:40:12Z","Content":"\n\u003Cp\u003EDebris and ships are on rails until their little purple or grey icon shows up (I\\\u0027m pretty sure).\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-07-24T17:16:13Z","Content":"\n\u003Cp\u003EIn version 15, anything below 24 km altitude would suddenly vaporize if it gets farther than 2.5 km from your active vessel. That includes debris, and crewed vehicles too. I think this stayed the same with version 16.\u003C/p\u003E\n"}]}