{"TopicId":150594,"ForumId":32,"TopicTitle":"how did you find out about ksp??","CreatedByName":"TheGuyNamedAlan","CreatedById":162058,"CreatedDateTime":"2016-10-22T11:41:10Z","PageNum":4,"Articles":[{"CreatedByName":"something","CreatedById":157505,"CreatedDateTime":"2016-11-01T22:11:55Z","Content":"\n\u003Cp\u003E\nSaw a few remarks on XKCD, looked up the game, saw it did cost money and decided to let it be. At that point I did have the impression the game was about throwing nuclear submarines into Jupiter or whatever it was. Years later a colleague at university told me that he was playing this game (KSP) in co-op mode and that it was incredibly hard and realistic. Apparently he wasted a day with his colleague building a space station... Asked him a few questions, downloaded the demo and gave it a try. Landing on the Mun, Minmus and rendezvous\u0027ing in the demo version became easy at some point, so I decided to purchase the full game...after all, wasting a lot of time might be worth an investment. And should I get bored, I can still throw nuclear submarines into Jool...\n\u003C/p\u003E\n"},{"CreatedByName":"Alpha 360","CreatedById":166007,"CreatedDateTime":"2016-11-02T17:42:23Z","Content":"\n\u003Cp\u003E\nHad a friend who showed it to me. Since I am young and a scientist to be..... expected result. That was about five months ago in May. I am an avid Ksper and love mods and have ambitions to be a modder. \n\u003C/p\u003E\n"},{"CreatedByName":"EpicSpaceTroll139","CreatedById":162839,"CreatedDateTime":"2016-11-02T19:10:27Z","Content":"\n\u003Cp\u003E\nI was bored one day so I looked up \u0022rocket game\u0022 in search of some arcade game or the like. I found something much better and have been playing since .14.\n\u003C/p\u003E\n"},{"CreatedByName":"Program Kerbal Space","CreatedById":169331,"CreatedDateTime":"2016-11-02T21:48:08Z","Content":"\n\u003Cp\u003E\nOk how I found out was my brother saw it on a channel so then I saw him play it and he showed me possibilities of the game so that made me buy it.\n\u003C/p\u003E\n"},{"CreatedByName":"Cdw2468","CreatedById":165431,"CreatedDateTime":"2016-11-02T22:33:00Z","Content":"\n\u003Cp\u003E\nKurtjmac. I was a typical little kid that loved mine craft and I watched is Far Lands or Bust series and he was talking about KSP on his channel. Took a look and I\u0027ve watched through the whole thing, all 112 episodes, twice now. Being a little kid without the means to buy the game, I pirated it (Sorry squad, I\u0027ve bought it since) and I\u0027ve just fallen in love with it. It has inspired me to want to become an astrophysicist and hopefully someday an astronaut. I just hope they do a little better with their rockets than I do\n\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2016-11-03T00:09:10Z","Content":"\n\u003Cp\u003E\nSimple.... NERD CUBED FREE GAME FRIDAY (back in 2012)...\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/-n1g3oTXjDM?start=405\u0026amp;feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kyrt Malthorn","CreatedById":149101,"CreatedDateTime":"2016-11-03T05:48:29Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI originally was told about the game by an online friend who was getting into it. I think they sent me a screenshot and were describing their struggle to design and then learn to fly space planes.  I was very dismissive.  Got hung up on the little green men part and assumed the game was quite silly, which, pile that on the fact it sounded like an awful lot of work....  I didn\u0027t think it would be my thing.\n\u003C/p\u003E\n\u003Cp\u003E\nLike, a year later, I was pondering writing science fiction stories and happened across this website: \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/respectscience.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/respectscience.php\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis guy appealed to my interest in realism and managed to convey how and why Hollywood sci fi is so often unrealistic per real world physics.  Plus he\u0027s witty and a hilarious read.  I gobbled up everything on that website...\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then I got to orbital mechanics.  He used KSP as a demonstration tool.  Also, he made an really early version (pre .90) orion drive mod.  Which led me to watch Scott Manley playing around with said mod.\n\u003C/p\u003E\n\u003Cp\u003E\nI still haven\u0027t written any sci fi\u0027s.  I haven\u0027t even landed on Eeloo yet!  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Sagacity","CreatedById":170806,"CreatedDateTime":"2016-11-03T07:40:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222836020\u0022 data-ipsquote-contentid=\u0022150594\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478152109\u0022 data-ipsquote-userid=\u0022149101\u0022 data-ipsquote-username=\u0022Kyrt Malthorn\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Kyrt Malthorn said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI originally was told about the game by an online friend who was getting into it. I think they sent me a screenshot and were describing their struggle to design and then learn to fly space planes.  I was very dismissive.  Got hung up on the little green men part and assumed the game was quite silly, which, pile that on the fact it sounded like an awful lot of work....  I didn\u0027t think it would be my thing.\n\u003C/p\u003E\n\u003Cp\u003E\nLike, a year later, I was pondering writing science fiction stories and happened across this website: \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/respectscience.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/respectscience.php\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis guy appealed to my interest in realism and managed to convey how and why Hollywood sci fi is so often unrealistic per real world physics.  Plus he\u0027s witty and a hilarious read.  I gobbled up everything on that website...\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then I got to orbital mechanics.  He used KSP as a demonstration tool.  Also, he made an really early version (pre .90) orion drive mod.  Which led me to watch Scott Manley playing around with said mod.\n\u003C/p\u003E\n\u003Cp\u003E\nI still haven\u0027t written any sci fi\u0027s.  I haven\u0027t even landed on Eeloo yet!  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes this happened to me. I saw the \u0022cartoony little green men\u0022 and just passed on it.\n\u003C/p\u003E\n"},{"CreatedByName":"Benji13","CreatedById":162932,"CreatedDateTime":"2016-11-03T08:16:54Z","Content":"\n\u003Cp\u003E\nA friend at school was casually playing it and me, liking orbital dynamics/physics, immediately went home and downloaded the demo. 5 mins later I bought the game. I am now well and truly better than my friend. \n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-11-03T09:39:34Z","Content":"\n\u003Cp\u003E\nAnother vote for xkcd here, \u003Ca href=\u0022https://www.xkcd.com/1244/\u0022 rel=\u0022external nofollow\u0022\u003E1244\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nGot the demo, played the demo to death, wondered skeptically about the \u0022planes\u0022 bit and all the other stuff not available in the demo.\u003Cbr\u003E\nI came to the conclusion that either the \u0022buy it\u0022 splashscreen was excessively photoshopped, or I\u0027d waste my life away playing the game. Either way I shouldn\u0027t buy it.\n\u003C/p\u003E\n\u003Cp\u003E\nFast-forward a couple of years, and xkcd got me again, this time with the Jupiter Descending what-if. Downloaded the demo, played the demo to death (this time there was career mode), tried to resist the temptation to buy (again), but this time I failed.\n\u003C/p\u003E\n\u003Cp\u003E\nI was right though. I shouldn\u0027t have bought it \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2016-11-07T03:38:52Z","Content":"\n\u003Cp\u003E\nSorry 4 the relatively minor necro, but I was really into space videos ~early to mid 2014 on Youtube (I\u0027ve loved Astronomy my whole life), so one day YT just decided to recommend a Scott Manley video to me. I got hooked on his channel, watching for ages and ages until I got the game a few days later as a birthday gift.\n\u003C/p\u003E\n"},{"CreatedByName":"Zamolxes77","CreatedById":114067,"CreatedDateTime":"2016-11-08T18:17:49Z","Content":"\n\u003Cp\u003E\nI was playing a idler game and someone in the chat mentioned it. I looked it up and I was hooked !\n\u003C/p\u003E\n"},{"CreatedByName":"rkarmark","CreatedById":158904,"CreatedDateTime":"2016-11-08T19:32:56Z","Content":"\n\u003Cp\u003E\nlong story short. A friend got me into simplerockets. which got me into ksp. which i have been playing since 1.0.4 with many hours spent.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-11-08T19:53:59Z","Content":"\n\u003Cp\u003E\nScott Manley popped up in my YouTube recommendations. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E  Yep.  If I didn\u0027t look at YouTube that day, I would have never found KSP, and I have no clue what I would be doing right now because it got me into game development, gave me reason to do web development, made me learn C#, build my first real \u0022gaming\u0022 computer, etc...\n\u003C/p\u003E\n"},{"CreatedByName":"Racescort666","CreatedById":137852,"CreatedDateTime":"2016-11-08T20:04:19Z","Content":"\n\u003Cp\u003E\nXKCD is what got me first interested. It turned out that I had a few friends who played and I found out about this wonderful community so I\u0027ve stayed.\n\u003C/p\u003E\n"},{"CreatedByName":"The Flying Kerbal","CreatedById":171547,"CreatedDateTime":"2017-01-16T11:11:52Z","Content":"\n\u003Cp\u003E\nScott Manley\u0027s to blame for me getting into KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nI was watching some of his Elite: Dangerous videos (another game I need to buy soon), and he happened to mention Kerbal Space Programme.  That was all he said, just the title, and I must be honest and admit I thought it was a daft title and probably a game I wouldn\u0027t be interested in.\n\u003C/p\u003E\n\u003Cp\u003E\nThen a few weeks later I happened to find one of his videos, watched it and knew immediately my previous impression was wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rest is history.\n\u003C/p\u003E\n"},{"CreatedByName":"Artheus","CreatedById":162290,"CreatedDateTime":"2017-01-16T12:03:01Z","Content":"\n\u003Cp\u003E\nProbably either Jacksepticeye or that one PewdiePie video. After about 750 hours of gametime, I am amazed how little they knew about the game.\n\u003C/p\u003E\n"},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2017-01-16T12:18:17Z","Content":"\n\u003Cp\u003E\nI watched one too many vids about space on Youtube and some tutorial vids on \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E online while I was digging it. So Youtube decided to recommend me the Scott Manley\u0027s channel. At first I thought it was a game for kids because of the cute little green aliens, but was curious why such a grown man was playing the game. After three vids I fell in love with the lego-like building of space ships, bought the game and subscribed to Scott\u0027s channel.\n\u003C/p\u003E\n"},{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2017-01-17T00:39:50Z","Content":"\n\u003Cp\u003E\nI liked trains. So I clicked on this since it had something that resembled a train somewhere that isn\u0027t earth. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.youtube.com/watch?v=jmSHFCls9H0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=jmSHFCls9H0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI immediately searched up KSP and got 0.23 for Christmas.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2017-01-17T00:46:48Z","Content":"\n\u003Cp\u003E\nI first heard of it when I was in the closed, pre-alpha test crew for DayZ; on Skype calls with Dean Hall and the gang, and he was big into the game then. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/bREBUIXwOX4?feature=oembed\u0022 width=\u0022459\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Parpaza","CreatedById":160128,"CreatedDateTime":"2017-01-20T13:35:37Z","Content":"\n\u003Cp\u003E\nHeard about it like when I was browsing lists and stuffs for good \u0027space games\u0027. And that was like about 1-2 years ago? Can\u0027t really remember.\n\u003C/p\u003E\n\u003Cp\u003E\nEither way, I remember seeing early 0.8.0 footage of KSP and thinking, \u0027Wow! That\u0027s really a nice game,\u0027 and then all of sudden reading the description of an article that described the game as hardcore, and being (very sadly) put-off for a few years.\n\u003C/p\u003E\n\u003Cp\u003E\nThen, a few years(?) later I saw it again, this time in the 0.24.0 stage. Thinking \u0027huh, I\u0027m bored, let\u0027s try something new,\u0027 I bought the game, and... The rest is history.\n\u003C/p\u003E\n"},{"CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2017-01-21T15:46:44Z","Content":"\n\u003Cp\u003E\nI\u0027ve been seeing KSP videos on YouTube for a couple years -- they\u0027d come up in my recommended list, probably because I search for videos on sailplanes, autogyros, ultralights, hang gliders, airchairs, high power rocketry, etc.  A couple months ago, I watched several of them, including a couple by Scott Manley, and there was mention somewhere of a demo version.  Well, a free demo of an interesting looking game is always worth a try -- but I use Kubuntu (Linux).  Would it run on my system?\n\u003C/p\u003E\n\u003Cp\u003E\nWell, eventually I decided to try the demo, even through it was Windows-only.  Downloaded it, went through the process of installing it via PlayOnLinux (an easy front end for Wine, the Windows API for Linux systems) and found the demo worked very well. I Googled a bit, after flying a couple of what amounted to sounding rockets with pilot, and found a design for a demo-part rocket that could make orbit.  Built it, flew it, extended it a little (limited by stack flex with the 20-unit 1.25 m tanks) and flew Jeb around the Mun -- and got him stranded in a rather high orbit because I ran out of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E before I could get a periapsis inside the atmosphere.  But by then, I was hooked.\n\u003C/p\u003E\n\u003Cp\u003E\nI was concerned, however, about whether the full version would run well enough under Wine to be playable.  Then I found out there was a Linux-native version, specific to Debian-based distros.  Well, what do you know -- Ubuntu (and hence, Kubuntu) is based on Debian.  Even better, if I bypassed Steam, it was less than US$14.  Done!\n\u003C/p\u003E\n\u003Cp\u003E\nNow I\u0027m waiting for the mods I want to install (based on Scott Manley\u0027s videos, ones like TAC Life Support and Ferram Aerospace Research) to be compatible with 1.2.2.  So much for free time...\n\u003C/p\u003E\n"},{"CreatedByName":"Frybert","CreatedById":97766,"CreatedDateTime":"2017-01-21T15:54:10Z","Content":"\n\u003Cp\u003E\nSome guy on my steam list names \u0027Tuguley\u0027\n\u003C/p\u003E\n"},{"CreatedByName":"drhay53","CreatedById":150399,"CreatedDateTime":"2017-01-21T16:23:09Z","Content":"\n\u003Cp\u003E\nMe and one of the grad students in my group were doing a night of remote observing at the Keck telescope. The night was weathered out, couldn\u0027t even open the dome, so he goes \u0022have you ever played Kerbal Space Program?\u0022. Sometime in 2015, I think. Anyway, I had never heard of it.\n\u003C/p\u003E\n\u003Cp\u003E\nHe brings it up, we play all night just trying to get a simple rendezvous with no addons. After playing all night, I went home and bought the game, went addon crazy, stayed up all day playing (when I normally would be sleeping). In the end I think was up a total of 36 hours.\n\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2017-01-21T17:20:21Z","Content":"\n\u003Cp\u003E\nNot exactly proud of that but I was still on my pirating spree back in 2013 and KSP showed up very high on the first page of TPB so I became intrigued. Bought it about a month after that.\n\u003C/p\u003E\n"}]}