{"TopicId":15985,"ForumId":32,"TopicTitle":"I think KSP could be the next minecraft","CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2012-08-04T03:35:48Z","PageNum":1,"Articles":[{"CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2012-08-04T03:35:48Z","Content":"\n\u003Cp\u003EThis thread had 2 reasons. \u003C/p\u003E\u003Cp\u003EOne, what similarities do you think KSP has to minecraft, and or, what does KSP beat minecraft in.\u003C/p\u003E\u003Cp\u003ETwo, do you think it\u0027s time for physical KSP merchandise? I sure think so.\u003C/p\u003E\u003Cp\u003EI really think KSP could be as popular as minecraft. I think KSP could easily reach 1 million sells by the end 2013.\u003C/p\u003E\n"},{"CreatedByName":"NIN3","CreatedById":16605,"CreatedDateTime":"2012-08-04T03:37:57Z","Content":"\n\u003Cp\u003EIm not sure if thats a good thing, or a bad thing. Minecraft has had its issues.....\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-08-04T04:23:54Z","Content":"\n\u003Cp\u003EHey guys, HarvesteR is going to take \u003Cem\u003Eanother\u003C/em\u003E vacation!\u003C/p\u003E\u003Cp\u003ENo please. Also, have you seen the minecraft forums? Eugh.\u003C/p\u003E\n"},{"CreatedByName":"residenthalo","CreatedById":34172,"CreatedDateTime":"2012-08-04T04:30:37Z","Content":"\n\u003Cp\u003EI\u0027m not so sure about this. Minecraft is a simple game that anyone can easily pick and play whereas KSP is more of a simulator that involves a much higher degree of difficulty, for example learning all the parts, how they would fit together to create a successful rocket, and basic orbital maneuvers. It\u0027s not that I don\u0027t think KSP will be popular, I think it\u0027ll definitely be a pretty big game eventually but not on the same level as Minecraft, due to its gameplay catering to gamers of all ages.\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-08-04T04:36:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022residenthalo\u0022 data-cite=\u0022residenthalo\u0022\u003E\u003Cdiv\u003EI\u0027m not so sure about this. Minecraft is a simple game that anyone can easily pick and play whereas KSP is more of a simulator that involves a much higher degree of difficulty, for example learning all the parts, how they would fit together to create a successful rocket, and basic orbital maneuvers. It\u0027s not that I don\u0027t think KSP will be popular, I think it\u0027ll definitely be a pretty big game eventually but not on the same level as Minecraft, due to its gameplay catering to gamers of \u003Cstrong\u003Eall ages\u003C/strong\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah. I\u0027m glad KSP wont to that. I want KSP to be popular, but I don\u0027t want every immature 12 year old to know about it.\u003C/p\u003E\n"},{"CreatedByName":"nibula","CreatedById":12289,"CreatedDateTime":"2012-08-04T10:30:55Z","Content":"\n\u003Cp\u003EI wouldnt compare minecraft to this way more superior game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Naiba","CreatedById":3221,"CreatedDateTime":"2012-08-04T10:48:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nibula\u0022 data-cite=\u0022nibula\u0022\u003E\u003Cdiv\u003EI wouldnt compare minecraft to this way more superior game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMinecraft has multiplayer, it can afford to have less stimulating gameplay and let the social aspect keep it entertaining.\u003C/p\u003E\u003Cp\u003E*But yeah, generally speaking, multiplayer games are a lot more popular. The Minecraft forums have had over twice as many people online at the same time as KSPs forums have total users.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-04T10:54:58Z\u0022 title=\u002208/04/2012 10:54  AM\u0022 data-short=\u002211 yr\u0022\u003EAugust 4, 2012\u003C/time\u003E by Naiba\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2012-08-04T12:05:04Z","Content":"\n\u003Cp\u003EWhen KSP finally gets close to it\u0027s final version I think it could have multiplayer.\u003C/p\u003E\n"},{"CreatedByName":"RayneCloud","CreatedById":11227,"CreatedDateTime":"2012-08-04T12:09:57Z","Content":"\n\u003Cp\u003EYeah, let\u0027s not talk about this again shall we?\u003C/p\u003E\n"},{"CreatedByName":"lukasni","CreatedById":30981,"CreatedDateTime":"2012-08-05T13:00:14Z","Content":"\n\u003Cp\u003EI\u0027m still learning KSP Forum etiquette, so allow me to ask: The \u0022m word\u0022 that has something to do with players should be used with a lot of caution, did I get that right?\u003C/p\u003E\n"},{"CreatedByName":"Dimitri_Kerman","CreatedById":33229,"CreatedDateTime":"2012-08-05T13:14:10Z","Content":"\n\u003Cp\u003EI\u0027d rather it not become that. I agree with Nutt007! I\u0027d it be popular like a cult classic movie, people like it and kids are not MASSIVELY involved. I don\u0027t mind kids playing of course though.\u003C/p\u003E\n"},{"CreatedByName":"maxsil","CreatedById":4017,"CreatedDateTime":"2012-08-05T13:17:54Z","Content":"\n\u003Cp\u003EI honestly don\u0027t think so, minecraft is a casual game that applies to all audiences, whilst KSP is much more specific ands requires a lot more skill and knowledge to play.\u003C/p\u003E\u003Cp\u003EBut, if the game does become more popular i suppose it would be a good thing, seeing how the devs could hire more deves and haul out updates at a weekly basis, but it might take a turn for the worse, like minecraft did, meaning the devs takes a permanent vacation and lets one single guy do all the developing\u003C/p\u003E\n"},{"CreatedByName":"Voron","CreatedById":36886,"CreatedDateTime":"2012-08-06T07:04:03Z","Content":"\n\u003Cp\u003EKSP Multiplayer Why do i think people will curse from Fuel missiles just ruining launches?\u003C/p\u003E\n"},{"CreatedByName":"MrMadGameplay","CreatedById":20225,"CreatedDateTime":"2012-08-06T13:13:02Z","Content":"\n\u003Cp\u003EMinecraft is a totally different style of game, to compare KSP to a game like that is just not right lol\u003C/p\u003E\n"},{"CreatedByName":"Zmapus","CreatedById":30072,"CreatedDateTime":"2012-08-06T16:41:35Z","Content":"\n\u003Cp\u003E1. They are not the same type of game, or anywhere close besides both are \u0022indie\u0022 games. They don\u0027t compete so one doesn\u0027t beat the other. Its not fair to either game to try to compare them really.\u003C/p\u003E\u003Cp\u003E2. I\u0027d buy me some Kerbal stuff.\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2012-08-06T17:20:32Z","Content":"\n\u003Cp\u003EHipsters detected.\u003C/p\u003E\u003Cp\u003ESeriously, who cares if literally everyone in the world knows about it? It won\u0027t affect YOUR experience in the slightest.\u003C/p\u003E\n"},{"CreatedByName":"segaprophet","CreatedById":14087,"CreatedDateTime":"2012-08-07T03:17:58Z","Content":"\n\u003Cp\u003EI don\u0027t want KSP to be the next Minecraft. Minecraft has been ruined by the extreme popularity.\u003C/p\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2012-08-07T05:17:35Z","Content":"\n\u003Cp\u003EMinecraft was ruined by a poor response to extreme popularity, not the popularity itself. I don\u0027t see that being a likely problem here. Squad have proven themselves far more intelligent than Mojang many times.\u003C/p\u003E\n"},{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2012-08-07T05:31:20Z","Content":"\n\u003Cp\u003EThey\u0027re too different to compare each other.\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2012-08-07T11:24:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dimitri_Kerman\u0022 data-cite=\u0022Dimitri_Kerman\u0022\u003E\u003Cdiv\u003EI\u0027d rather it not become that. I agree with Nutt007! I\u0027d it be popular like a cult classic movie, people like it and kids are not MASSIVELY involved. I don\u0027t mind kids playing of course though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to disagree, I want kids getting excited about space travel, learning the basic science behind putting things in orbit, wondering \u0022How would I have done that?\u0022 when they see things like the Curiosity landings.\u003C/p\u003E\u003Cp\u003EWhen I meet my little cousin, I want to be embarrassed because his rockets are more efficient than mine or that he has a working satelite network and I don\u0027t rather than seeing him fling birds at pigs.\u003C/p\u003E\n"},{"CreatedByName":"TailorTF","CreatedById":37054,"CreatedDateTime":"2012-08-07T11:33:15Z","Content":"\n\u003Cp\u003EI\u0027ve personally always compared KSP to Dwarf Fortress in terms of popularity, since they DO have some similarities (not too popular, quite difficult to play effectively, well-spoken and tight playerbase).\u003C/p\u003E\u003Cp\u003EAs for KSP merchandise, that would be great. Maybe a Kerbal or a Command Pod Mk.1 keychain.\u003C/p\u003E\u003Cp\u003EUnrelatedly, hooray for me joining the forums, moving on.\u003C/p\u003E\n"},{"CreatedByName":"Nooblet68","CreatedById":11784,"CreatedDateTime":"2012-08-07T11:36:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dimitri_Kerman\u0022 data-cite=\u0022Dimitri_Kerman\u0022\u003E\u003Cdiv\u003EI\u0027d rather it not become that. I agree with Nutt007! I\u0027d it be popular like a cult classic movie, people like it and kids are not MASSIVELY involved. I don\u0027t mind kids playing of course though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027d actually be quite surprised about what fraction of the Kerbal Space Program community could be classed as \u0027Kids\u0027. Kerbal Space Program is fairly accessible to many people, and is surprisingly easy to learn.\u003C/p\u003E\n"},{"CreatedByName":"cr055H41rz","CreatedById":57250,"CreatedDateTime":"2013-05-01T00:55:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NIN3\u0022 data-cite=\u0022NIN3\u0022\u003E\u003Cdiv\u003EIm not sure if thats a good thing, or a bad thing. Minecraft has had its issues.....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really don\u0027t want KSP to be like MC\u003C/p\u003E\u003Cp\u003EMC sucks without buttloads of mods.\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-05-01T01:05:21Z","Content":"\n\u003Cp\u003EMinecraft is a Lego set. KSP is an erector set. They\u0027re both toys for building things, and both have been around for a long time. But, one\u0027s an open-ended system where you can build pretty much whatever you want, without any need to worry about realism, and where you can\u0027t really \u0022fail\u0022, per se; the other\u0027s a system where you can accomplish all kinds of neat things, but your designs have to make a bit more sense and the rules of how everything fits together have basically been provided for you by the product\u0027s creators.\u003C/p\u003E\u003Cp\u003ENow, KSP will never be as accessible to the average person as Minecraft is, but that doesn\u0027t mean it can\u0027t be successful. What they have in common is that they both show that you can make a successful sandbox game that focuses more on gameplay than ultra-realistic aesthetics, with a fairly cheap price tag, and without dumbing things down for the typical gamer. But beyond that, no, this won\u0027t be the next Minecraft; one doesn\u0027t replace the other.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2013-05-01T01:53:09Z","Content":"\n\u003Cp\u003EI would really stay away from comparing those 2.\u003C/p\u003E\u003Cp\u003EMinecraft would be the awesome game that lost its potential thanks to the fans and broken promises, and lately, by taking mods and converting them into \u0022official content\u0022 without even giving credit and, from that point, it devolved into another \u0022adventure game\u0022, with the exception that you can build your own house, or go full creative and do whatever you want with blocks, which gets boring after a while. On top of that, it even got dumbed down for the retarded \u0022I\u0027M SUCH A GAMURR\u0022 fan.\u003C/p\u003E\u003Cp\u003EKSP is still in the awesome game with loads of potential phase. To make it comparable with minecraft, then there should be a point in which devs get tired of making their own game and started accepting suggestion from everyone or converting mods into official content without even thinking about the rest of the game. And of course, the retarded fanbase.\u003C/p\u003E\n"}]}