{"TopicId":161327,"ForumId":32,"TopicTitle":"Aliens of the Jool System","CreatedByName":"Laythe Squid","CreatedById":175666,"CreatedDateTime":"2017-05-30T22:24:12Z","PageNum":1,"Articles":[{"CreatedByName":"Laythe Squid","CreatedById":175666,"CreatedDateTime":"2017-05-30T22:24:12Z","Content":"\n\u003Cp\u003E\nCould there be life in the Jool System? \n\u003C/p\u003E\n\u003Cp\u003E\nI know Squad has said \u0022no aliens\u0022, but if there were, what might they look like? How would they survive?\n\u003C/p\u003E\n\u003Cp\u003E\nYou can say what you think it would be like, but here are my ideas.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nJool-Complex chemical reactions in the atmosphere, but no life...yet.\n\u003C/li\u003E\n\u003Cli\u003E\nLaythe-Extremely complex multi-celled and unicellular biosphere. Most life is in the oceans, as radiation from Jool makes it hard to live on land. Despite this, life thrives under the surface, as the sand and rock protects from radiation. \n\u003C/li\u003E\n\u003Cli\u003E\nVall-Life thrives deep underground in a vast subsurface ocean as well as subsurface lakes in the ice sheet.\n\u003C/li\u003E\n\u003Cli\u003E\nTylo-Simple unicellular life in lava tubes.\n\u003C/li\u003E\n\u003Cli\u003E\nBop-No life..what do you mean by \u0022kraken\u0022?\n\u003C/li\u003E\n\u003Cli\u003E\nPol-No life\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2017-05-30T23:13:05Z","Content":"\n\u003Cp\u003E\nPol has those weird spiky things though...maybe it is alive?\n\u003C/p\u003E\n"},{"CreatedByName":"Laythe Squid","CreatedById":175666,"CreatedDateTime":"2017-05-31T00:40:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223074014\u0022 data-ipsquote-contentid=\u0022161327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496185985\u0022 data-ipsquote-userid=\u0022150330\u0022 data-ipsquote-username=\u0022cubinator\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, cubinator said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPol has those weird spiky things though...maybe it is alive?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaybe...those look like they\u0027re just crystal, but it\u0027s possible.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2017-05-31T05:26:51Z","Content":"\n\u003Cp\u003E\nLaythe probably have life as in microbes because of the oxygen. \u003Cbr\u003E\nWe have the dead kraken who is not alive but has been. \u003Cbr\u003E\nYou also have the artifacts. \u003Cbr\u003E\u003Cbr\u003E\nWe will not get aliens to trade with or go to war with \n\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2017-05-31T18:38:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223074272\u0022 data-ipsquote-contentid=\u0022161327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496208411\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe will not get aliens to trade with or go to war with \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow about just for forced labor then?\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2017-06-01T05:27:38Z","Content":"\n\u003Cp\u003E\nWe got a body with water and oxygen, a temple on Vall, a Dead body of the Kraken on Bop.... seems suspicious....\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2017-06-01T11:51:00Z","Content":"\n\u003Cp\u003E\nTBH, oxygen on Laythe makes very little sense.\n\u003C/p\u003E\n\u003Cp\u003E\nLife on Laythe... fine, tidal heating and water = probably habitable. However using Earth as a basis, O2 in large quantities would only result from photosynthesis. At 5x the distance from the sun, that would be 1/25th as much light... photosynthesis doesn\u0027t really seem that viable. I\u0027m not sure what the lower limit for light exposure is for life on Earth, but I wouldn\u0027t be surprised if 1/25th is simply too little. Even if photosynthesis at ~1/25th the rate on kerbin was enough to support life, we should expect a substantial reduction in O2 concentration as a result - maybe 2% O2 instead of ~20%.\n\u003C/p\u003E\n\u003Cp\u003E\nAs with many things in KSP, it breaks down if you try to apply real science to it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOther points:\n\u003C/p\u003E\n\u003Cp\u003E\n* Jool: unliekly to be many complex chemicals in the atmosphere. The upper layers (assuming its similar to jupiter) will be just hydrogen and inert helium). Lower layers will have nitrogen containing compounds, then even lower will have sulfur and Oxygen atoms in the compounds. None of that is sufficient for life. It will also get hot as one gets lower, which will disassociate larger compounds. No life.\n\u003C/p\u003E\n\u003Cp\u003E\n* Laythe: The radiation isn\u0027t from Jool, its from the sun - its charged particles trapped by Jool\u0027s magnetic fields. Unlike the moons of Jupiter, Laythe has a thick atmosphere which would protect against these particles. A surface pressure of 0.8 atmospheres on a world with 0.8 G surface gravity will have the same atmospheric mass above a given point as a world with a surface pressure of 1 atmospheres and a surface gravity of 1 G. They changed Laythe\u0027s atmospheric pressure from 0.8 to 0.6... but that still means it has 75% the mass of air shielding it as kerbin does. That would be a lot, the surface of Laythe should be a benign environment as far as radiation is concerned. Since its got O2, we can assume its also got Ozone, and that would protect against UV, which would be 25x less intesne to start with. If lathe has its own magnetic field to provide additional charged particle radiation, even better.\n\u003C/p\u003E\n"}]}