{"TopicId":170745,"ForumId":32,"TopicTitle":"What is your most facepalm-worthy moment regarding KSP?","CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2018-02-10T21:41:01Z","PageNum":11,"Articles":[{"CreatedByName":"sturmhauke","CreatedById":190611,"CreatedDateTime":"2018-11-26T20:21:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223494154\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543260849\u0022 data-ipsquote-userid=\u0022152561\u0022 data-ipsquote-username=\u0022JonathanPerregaux\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n43 minutes ago, JonathanPerregaux said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen it finally occurred to me that aero forces during launch really only break deployed antennas and panels. Everything else is fine, even if a bit flimsy strut-wise.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s easier to build big stupid rockets in KSP than in real life, but it\u0027s definitely possible for other things to break off due to aero forces. I\u0027ve lost plenty of \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E wings for instance.\n\u003C/p\u003E\n"},{"CreatedByName":"yuri_3a3rin","CreatedById":192092,"CreatedDateTime":"2018-11-27T21:45:39Z","Content":"\n\u003Cp\u003E\nWhen you go to land on eve and don\u0027t put parachutes\n\u003C/p\u003E\n"},{"CreatedByName":"leftbedtime","CreatedById":193601,"CreatedDateTime":"2018-11-28T21:31:17Z","Content":"\n\u003Cp\u003E\nI didn\u0027t know what ablator did, until i tried a orbit with an empty heat shield, which then promptly exploded upon reentry. Have tested this, and when re entering, you can rotate your command module, which dissipates the heat somehow,  and slows the process of overheating.\n\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2018-11-28T21:39:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223494154\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543260849\u0022 data-ipsquote-userid=\u0022152561\u0022 data-ipsquote-username=\u0022JonathanPerregaux\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/26/2018 at 11:34 AM, JonathanPerregaux said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI mean, why do I even turn on the max Q setting in MechJeb? Because it works in \u0022real life\u0022 but not \u0022in game\u0022?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFuel efficiency by reducing drag losses? I think it\u0027s more of a holdover from the days of the \u0022soup atmosphere\u0022 Kerbin.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-28T21:40:07Z\u0022 title=\u002211/28/2018 09:40  PM\u0022 data-short=\u00225 yr\u0022\u003ENovember 28, 2018\u003C/time\u003E by MaverickSawyer\u003C/strong\u003E\n\u003Cbr\u003EDouble posted by accident. Fixed.\n\u003C/span\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2018-11-29T14:45:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223495471\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543440677\u0022 data-ipsquote-userid=\u0022193601\u0022 data-ipsquote-username=\u0022leftbedtime\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, leftbedtime said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHave tested this, and when re entering, you can rotate your command module, which dissipates the heat somehow,  and slows the process of overheating.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhen you rotate your command module, you are distributing the heating over a larger surface and giving the previously heated portions a chance to cool off before getting heated again.\n\u003C/p\u003E\n\u003Cp\u003E\nI would be surprised if this is not used in real life when applicable, at least to the point of a slow rotation of the capsule to ensure heating is even over the entire heat-shield.\n\u003C/p\u003E\n"},{"CreatedByName":"Eriksonn","CreatedById":177612,"CreatedDateTime":"2018-11-29T14:59:02Z","Content":"\n\u003Cp\u003E\nI recently made an orbital refuel outpost over minmus with an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E to get fuel from. Also launched a miner to mine ore from minmus, refuel at minmus station and then fly with some more ore to a larger station in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003Elko\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI had 2 problems with this mission: Firstly i did not realize that the small \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E unit had only 20% effectivity compared to the large one so the full ore load of the miner was not even enough to replenish what was needed to land and take off from minmus. So i had a net loss of fuel...\n\u003C/p\u003E\n\u003Cp\u003E\nThe second fail was that the miner itself had too little \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E to get to kerbin station. With a few munar gravity assists i got there by using the \u003Cabbr title=\u0022Reaction Control System\u0022\u003Ercs\u003C/abbr\u003E in the end(i ran out of liquidfuel). So now i have a miner with a nerv engine instead of a terrier.(Even looks slightly cooler due to the new shiny golden hull panels)\n\u003C/p\u003E\n"},{"CreatedByName":"Lukun7Rocket","CreatedById":192338,"CreatedDateTime":"2018-12-01T03:31:54Z","Content":"\n\u003Cp\u003E\nRealizing i\u0027m orbiting the sun, about to encounter eve, and I realize there\u0027s no decoupler between the fairing and my lander\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2018-12-01T04:50:42Z","Content":"\n\u003Cp\u003E\nJust today, in my no revert save, I forgot to check the first stage\u0027s atmo \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003Etwr\u003C/abbr\u003E (it was less than 1) and when I hit the spacebar not only did the ensuing explosion destroy the rocket and the launch pad, but my best pilot and a scientist who was going to pay a lot to bring him home after the mission.\n\u003C/p\u003E\n\u003Cp\u003E\nI had to take a bail out grant to fix the launch pad and had negative rep for the first time ever. Very fun.\n\u003C/p\u003E\n"},{"CreatedByName":"DocMike","CreatedById":193267,"CreatedDateTime":"2018-12-25T21:09:02Z","Content":"\n\u003Cp\u003E\nThe Discovery had already landed on Mun, Minimus, Moho, Eve, Gilly, Duna, Ike, Dres, Bop, Pol and Vall and was en route to Eeloo. I decided to refuel her on a passing-by asteroid. Then everything went FUBAR. \n\u003C/p\u003E\n\u003Cp\u003E\nHit the wrong key, then hit the asteroid. From outside, I noticed two Gigantors missing, and as Bob broke the third EVAing on Bop, this left me with one.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I realized the collision destroyed contents of cargo bay. All the reaction wheels and batteries, leaving only these in command pod.\n\u003C/p\u003E\n\u003Cp\u003E\nAND MY MATERIALS BAY WITH ALL THE DATA AND SAMPLES FROM LANDINGS.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd no quicksave, either \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThere was enough fuel to put Discovery on solar orbit between Duna and Dres, R/Ved with a tanker and returned to Kerbin.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOn a retrograde orbit.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI\u0027m trying to deorbit in one piece tomorrow.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"OgreMagi","CreatedById":103767,"CreatedDateTime":"2018-12-30T08:08:19Z","Content":"\n\u003Cp\u003E\nMine was when I began building my Jool mission,  I had mechjeb and  was using LVN.s to build my ship by attaching the landers, and space planes to the core one by one.   Well mechjeb was allways going long with my rendezvous between the ships.  you know you set it to 100 m  and then it arrives between 150 to 200m .    I was almost finished with my ships and I updated mech jeb  and set my last ship to  meet up with my core ship and mech jeb  got it exactly spot on and my LVN powered engine fired too late and the ship ran right into the core at 20 m/s........ \n\u003C/p\u003E\n\u003Cp\u003E\nWhat made it more painful this was a at the end of a 6 hour session that I forgot to SAVE................\n\u003C/p\u003E\n\u003Cp\u003E\nNEVER FORGET TO SAVE\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"NorthernDevo","CreatedById":161219,"CreatedDateTime":"2019-01-01T07:46:25Z","Content":"\n\u003Cp\u003E\nToday\u0027s facepalm:\n\u003C/p\u003E\n\u003Cp\u003E\nNearing the end of a huge and WILD ride for Jeb and a scientist that took them all over Minmus in a Rover Max. Four survey missions, taking science from every biome...and when I say \u003Cem\u003Eall over\u003C/em\u003E Minmus I really mean \u003Cem\u003Eall over\u003C/em\u003E. A complete circumnavigation, and a cross over the pole from one side to the other. The Max behaved beautifully; zipping over everything at a cool 50kph. \u003Cem\u003EHours\u003C/em\u003E to complete and the lads were pretty satisfied; as they should be.\n\u003C/p\u003E\n\u003Cp\u003E\nWith only two observation spots left about a quarter of the way around the moon, I got lazy...ALT-TABbed over to KSP Wiki to see what Eve was like. About the time I was going \u0022Yeah - not a great idea...\u0022 I heard WHAM!!!! and ALT-TABbed back; panic-stricken. \n\u003C/p\u003E\n\u003Cp\u003E\nSeems the Rover had gone zipping up one of the mountains on the West edge of the Greater Flats and launched itself practically into orbit. With Stability Control engaged in \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E Rover AP, the sucker had stayed flat and came down HARD.\n\u003C/p\u003E\n\u003Cp\u003E\nInsurance apparently doesn\u0027t cover pancaking into the ground from 5km up.\n\u003C/p\u003E\n\u003Cp\u003E\nAmazingly, the rugged machine protected the Kerbals - though it, itself was pretty much smoked. It was able to wobble close enough to one of the spots to get the reading, then Jeb and Geofgun jet-packed to the next; about 20 kms. away. With all missions done, they awaited the return vehicle in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that\u0027s where the facepalms started to pile up.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, Geofgun had to turn around and fly \u003Cem\u003Eback\u003C/em\u003E to the destroyed Rover and...you guessed it; grab all the science. \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E Then he had to jet part of the way back, stop, turn around, jump back \u003Cem\u003Eagain\u003C/em\u003E, climb into the bent buggy, recharge his fuel, THEN jump back to Jeb.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EKinda went downhill from there. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe return vehicle performed flawlessly; targeting and nearly landing of top of Jeb. Too bad the Human Director (waves) wasn\u0027t such a twit... just as it was landing I accidentally touched the space bar and its radial tanks - you know; the ones the landing gear and the solar panels are bolted to - went FOOM and the rocket wound up sitting on its engine with barely enough fuel to get back to Kerbin. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThen I forgot to change the Ascent Autopilot from 100km for a Kerbin launch to 25 for a Minmus one - and THERE goes most of my remaining fuel. The engine died with a Kerbin \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E of 340Km - nowhere near close enough.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFortunately, \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E gave enough \u003Cem\u003Ejust\u003C/em\u003E enough Delta-Vee to lower that to 33kms, so I deployed the chutes, blew the service module and shut the capsule down for the long slide back to Kerbin.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWe made it by the skin of our teeth; no-where close to the right continent but alive.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EDuh. (facepalm)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TanDeeJay","CreatedById":188578,"CreatedDateTime":"2019-01-01T12:10:18Z","Content":"\n\u003Cp\u003E\nRendezvous with a class E asteroid in my un-tested asteroid catcher with 2 nuclear engines.  Underestimated the burn length to intercept, and overshot by about 15K. That oft practiced maneuver to rendezvous with another ship didn\u0027t prepare me for the much lower \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E combined with a much greater \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E...  Then when I finally caught the asteroid, I discovered I was 4dv short of being able to pull the asteroid into orbit.  Needed 862 \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E to stop the asteroid escaping, but only had 858 \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E available.  Damn those Class E asteroids are big!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Lapis","CreatedById":193784,"CreatedDateTime":"2019-01-01T22:23:03Z","Content":"\n\u003Cp\u003E\nI don\u0027t really have Big facepalm moments but there are some...\n\u003C/p\u003E\n\u003Cp\u003E\nEvery time I build A mun probe I forget \u003Cabbr title=\u0022Reaction Control System\u0022\u003Ercs\u003C/abbr\u003E or reaction wheels meaning using only engine gimbal I have to land on the mun, and usually in the dark as I have to wait for my ships angle to line up with my retrograde.\n\u003C/p\u003E\n\u003Cp\u003E\nI built a rocket without symmetry the first stage(with one engine) was fine. the second stage (with three engines in a line) flew out of control. I relaunched THREE TIMES\u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E! but because I was looking at the rocket from only one angle I did not figure it out until the fourth launch where it happened to roll slightly, I then fixed it and I lived happily ever after\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-05T00:38:19Z\u0022 title=\u002201/05/2019 12:38  AM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 5, 2019\u003C/time\u003E by lapis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Odiseus","CreatedById":101032,"CreatedDateTime":"2019-01-02T23:51:16Z","Content":"\n\u003Cp\u003E\nIt was very strange and unexplained .\n\u003C/p\u003E\n\u003Cp\u003E\nI was sending a probe to jool when i had to quit from the game.\n\u003C/p\u003E\n\u003Cp\u003E\nTo make the things more realistic i  switched off the fuel valves of the probe , save and quit. \n\u003C/p\u003E\n\u003Cp\u003E\nWhen i reloaded kerbal and the career, i had to make a course correction, and in the moment to switch on the fuel valves again, the whole spacecraft blow up  in pieces in a huge explosion, and a big cloud of debris .\n\u003C/p\u003E\n"},{"CreatedByName":"TanDeeJay","CreatedById":188578,"CreatedDateTime":"2019-01-03T03:00:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223515176\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546473076\u0022 data-ipsquote-userid=\u0022101032\u0022 data-ipsquote-username=\u0022Odiseus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Odiseus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt was very strange and unexplained .\n\u003C/p\u003E\n\u003Cp\u003E\nI was sending a probe to jool when i had to quit from the game.\n\u003C/p\u003E\n\u003Cp\u003E\nTo make the things more realistic i  switched off the fuel valves of the probe , save and quit. \n\u003C/p\u003E\n\u003Cp\u003E\nWhen i reloaded kerbal and the career, i had to make a course correction, and in the moment to switch on the fuel valves again, the whole spacecraft blow up  in pieces in a huge explosion, and a big cloud of debris .\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAt least it was a probe (unmanned I assume) so no kerbals were lost in the incident \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Error_Sophius","CreatedById":156232,"CreatedDateTime":"2019-01-03T21:59:29Z","Content":"\n\u003Cp\u003E\nFirst probe lander on Laythe. Heat shield is in place for re-entry, parachutes are correctly attached, approach path is well-covered by relay satellites. I retract the solar panels on approach. Everything looks good.\n\u003C/p\u003E\n\u003Cp\u003E\nSuddenly I realize that the atmosphere is probably going to rip off the probe\u0027s antenna on the way down. Oh no. I didn\u0027t plan for that, and the last-hop relays aren\u0027t specced to talk to a bare probe core from orbit. Maybe the antenna will survive if retracted? Maybe the probe can land blindly, and I can ship a newer, bigger relay to reestablish contact? Dicey, but it might work, and I can\u0027t think of anything else to try. That atmosphere is coming up awful fast. Let\u0027s go with it.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I retract the antenna in space.\n\u003C/p\u003E\n\u003Cp\u003E\n...before arming the parachutes.\n\u003C/p\u003E\n\u003Cp\u003E\n...in hard mode.\n\u003C/p\u003E\n\u003Cp\u003E\n(how are you supposed to handle an unmanned landing in atmosphere, anyway? I did manage it later, in just that way -- retract antenna, land blindly, use a brief contact from a powerful relay to extend the antenna again -- but the successful splashdown was mostly luck, and it won\u0027t work on solid ground)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-03T22:12:05Z\u0022 title=\u002201/03/2019 10:12  PM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 3, 2019\u003C/time\u003E by Error_Sophius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tyko","CreatedById":164179,"CreatedDateTime":"2019-01-03T23:18:20Z","Content":"\n\u003Cp\u003E\nSeveral Planetary Encounters that went wrong -\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nA Moho orbital attempt became a flyby when I grossly underestimated how much velocity I\u0027d pick up going deeper into the Kerbol gravity well.\n\u003C/li\u003E\n\u003Cli\u003E\nA Jool orbital attempt became a Jool deep dive expedition when I went a little too deep into the atmosphere during my aerobraking maneuver\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nPlus the obligatory \u0022forgot to open my solar panels for the umpteenth time\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2019-01-04T02:38:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223513189\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546157299\u0022 data-ipsquote-userid=\u0022103767\u0022 data-ipsquote-username=\u0022OgreMagi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/30/2018 at 12:08 AM, OgreMagi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNEVER FORGET TO SAVE\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nProbably too late to help, but every so often the game autosaves (situation change?). I\u0027m pretty sure it writes a new persistent.sfs save when there\u0027s a scene change, and persistent.sfs files are backed up in the \u0022backup\u0022 folder (not accessible in game) so there\u0027s usually a few of those going back in the backup folder (PC, not console).\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if you don\u0027t mind mods, there\u0027s the \u0022Dated Quicksaves\u0022 mod which tacks a date onto the quicksave so all your quicksaves can\u0027t get overwritten. Even better, it dates the Autosaves too so those won\u0027t get overwritten either. To load a specific save, use Alt-F9 or Esc -\u0026gt; load save, but the folder structure is not available when loading a save; everything is usually piled in one folder so if you want something from the backup folder, you need to move it from outside the game.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-04T02:39:47Z\u0022 title=\u002201/04/2019 02:39  AM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 4, 2019\u003C/time\u003E by StrandedonEarth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Triop","CreatedById":145841,"CreatedDateTime":"2019-01-04T06:44:26Z","Content":"\n\u003Cp\u003E\nLoading time\n\u003C/p\u003E\n"},{"CreatedByName":"Gapone","CreatedById":193365,"CreatedDateTime":"2019-01-04T08:29:25Z","Content":"\n\u003Cp\u003E\nWhen... i... um... sent a relay to the mun with only the hg-55 antenna?..\n\u003C/p\u003E\n"},{"CreatedByName":"TanDeeJay","CreatedById":188578,"CreatedDateTime":"2019-01-04T12:21:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223515875\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546569539\u0022 data-ipsquote-userid=\u002289439\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, StrandedonEarth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nProbably too late to help, but every so often the game autosaves (situation change?). I\u0027m pretty sure it writes a new persistent.sfs save when there\u0027s a scene change, and persistent.sfs files are backed up in the \u0022backup\u0022 folder (not accessible in game) so there\u0027s usually a few of those going back in the backup folder (PC, not console).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cp\u003E\n  This is one I learnt too late... after I\u0027d crashed a rover descending into one of the highland craters on the Mun after about 5 hours of real time driving the rover to different biomes collecting science... I\u0027d been using quicksave, but accidentally hit F5 just at the start of the fatal roll... so all I could do with my quicksave was to watch repeats of the loss of hours of work...\n\u003C/p\u003E\n\u003Cp\u003E\nBy the time I found out about those autosave backups, I\u0027d already progressed with the game far enough and re-collected the science with a biome hopper that it was pointless rolling back that far, and besides, the relevant autosave backup had probably been autoremoved by that time...  Since then, that autosave has saved me from some embarrassing mistakes... like when I hit \u0027Z\u0027 instead of \u0027X\u0027 while docking... I now shutdown the main engines before I start docking...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-04T12:21:28Z\u0022 title=\u002201/04/2019 12:21  PM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 4, 2019\u003C/time\u003E by TanDeeJay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gapone","CreatedById":193365,"CreatedDateTime":"2019-01-05T17:29:47Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223516063\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546604467\u0022 data-ipsquote-userid=\u0022188578\u0022 data-ipsquote-username=\u0022TanDeeJay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/4/2019 at 3:21 PM, TanDeeJay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhen I hit \u0027Z\u0027 instead of \u0027X\u0027 while docking\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESo me, just while landing \u003Cspan\u003E\u003Cspan\u003E\u003Cspan\u003E:)\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-05T17:31:14Z\u0022 title=\u002201/05/2019 05:31  PM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 5, 2019\u003C/time\u003E by Gapone\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sturmhauke","CreatedById":190611,"CreatedDateTime":"2019-01-05T18:49:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223516063\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546604467\u0022 data-ipsquote-userid=\u0022188578\u0022 data-ipsquote-username=\u0022TanDeeJay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/4/2019 at 4:21 AM, TanDeeJay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv\u003E\nlike when I hit \u0027Z\u0027 instead of \u0027X\u0027 while docking... I now shutdown the main engines before I start docking...\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI put my engines on an action group for this reason.\n\u003C/p\u003E\n"},{"CreatedByName":"TanDeeJay","CreatedById":188578,"CreatedDateTime":"2019-01-05T20:37:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223516063\u0022 data-ipsquote-contentid=\u0022170745\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546604467\u0022 data-ipsquote-userid=\u0022188578\u0022 data-ipsquote-username=\u0022TanDeeJay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/4/2019 at 10:21 PM, TanDeeJay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cp\u003E\n  This is one I learnt too late... after I\u0027d crashed a rover descending into one of the highland craters on the Mun after about 5 hours of real time driving the rover to different biomes collecting science...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nl learnt from this why you should build rovers with a good set of reaction wheels. I probably could have recovered the roll if I\u0027d had reaction wheels. A lack of reaction wheels on that rover limited my driving speed to about 15m/s too so that 5 hours of science collection was quite painful. I can safely travel at least 5 times as fast with reaction wheels...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-05T20:59:03Z\u0022 title=\u002201/05/2019 08:59  PM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 5, 2019\u003C/time\u003E by TanDeeJay\u003C/strong\u003E\n\u003Cbr\u003EFix typo\n\u003C/span\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2019-01-06T08:19:31Z","Content":"\n\u003Cp\u003E\nOkay, got a great one for y\u0027all, in celebration of this being picked as Thread of the Year for 2018...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve always loved Tweakable Everything, as it allows me to do things like throttle back the EVA pack thrusters on the fly for precise handling while in space, set my docking ports to have almost no \u0022magnetic\u0022 pull and no ejection force, fine tune the reaction wheel strength, stuff like that. Absolute godsend.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, 1.6.0 rolls around, and I decided to thin out the more memory and storage space intensive mods in favor of a simpler, more streamlined install. Clean everything except for the Squad and SquadExpansion folders out of GameData, update the game, start installing stuff, and, well, Tweakable Everything... wasn\u0027t. Matter of fact, It was causing all sorts of grief. I found this odd, due to the fact that pretty much every other plugin wasn\u0027t doing anything out of the ordinary. I finally dug into the log files to find out what the heck was happening...\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d completely forgotten to put in the dependency. \u003Cimg alt=\u0022facepalm.gif\u0022 class=\u0022ipsImage\u0022 height=\u002224\u0022 src=\u0022https://www.orbiter-forum.com/images/smilies/facepalm.gif\u0022 width=\u002245\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGod I hate moments like that.\n\u003C/p\u003E\n"}]}