{"TopicId":172493,"ForumId":32,"TopicTitle":"So many bugs","CreatedByName":"Red Thought","CreatedById":186712,"CreatedDateTime":"2018-03-16T22:27:56Z","PageNum":1,"Articles":[{"CreatedByName":"Red Thought","CreatedById":186712,"CreatedDateTime":"2018-03-16T22:27:56Z","Content":"\n\u003Cp\u003E\nI want to play game, but i cant.   I deleted all my ksp data when the DLC came out.   I then downloaded a fresh install, bought dlc.  Then proceeded  to play a new vanilla game.    Within an hour of playing I found a bug that disabled my ability to finish further contracts and even reach new milestones, such as orbit, which I tried.   I was a little annoyed but have never witnessed a game breaking bug in ksp before so thought maybe it was a fluke.  Started a new save file and within an hour again the same bug.   I had by this time figured out, I think, what was causing the bug.  So I used debug menu to give my self enough cash to lvl fully the building with contracts available in it.   I then avoided all missions with tourists in them.   This seemed to work and I got 20\u002B hours in on my 3rd save.    Then i was working on a contract to save someone stranded in space, and this time there was one of the new capsules.   I thought little about it and proceeded with mission.   As soon as I switched to the new capsule i got an error message on my screen.   and again found myself unable to do anything with contracts.   I decided since i could no longer use contracts and didnt want to waist all my time or start a new save file, to treat my current save file as a science only play through.  So I went to the moon and was going to land, when low and behold, yet another bug......  At which point i threw my hands up in disgust and exited game.   I have seen a few other minor bugs to that are mainly graphical.     But game seems to be unplayable to me atm.  Going to give it a few weeks...  Hope i dont have to reinstall 1.3 again in a month.\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-03-17T01:51:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223324565\u0022 data-ipsquote-contentid=\u0022172493\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221521239276\u0022 data-ipsquote-userid=\u0022186712\u0022 data-ipsquote-username=\u0022Red Thought\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Red Thought said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI deleted all my ksp data when the DLC came out\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNever delete previous versions.  Never.  Rule number one of KSP update day.  I still have .18 somewhere......\n\u003C/p\u003E\n\u003Cp\u003E\nand:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed8972680975\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/172470-141-making-history-really-buggy/\u0026amp;do=embed\u0022 style=\u0022height:214px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-17T02:38:51Z\u0022 title=\u002203/17/2018 02:38  AM\u0022 data-short=\u00226 yr\u0022\u003EMarch 17, 2018\u003C/time\u003E by Gargamel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2018-03-17T02:35:29Z","Content":"\n\u003Cp\u003E\nYeah, DLC should\u0027ve came with a can of Raid.\n\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2018-03-17T03:45:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223324763\u0022 data-ipsquote-contentid=\u0022172493\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221521251476\u0022 data-ipsquote-userid=\u002264714\u0022 data-ipsquote-username=\u0022Gargamel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Gargamel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNever delete previous versions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTrust.  I have versions back to 0.24.2.  I also think 1.3.1 is pretty darn good, and I had questions about how 1.4 might turn out.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Thought","CreatedById":186712,"CreatedDateTime":"2018-03-18T22:05:33Z","Content":"\n\u003Cp\u003E\nI have been playing through a career mode save file on normal... oops...    No content mods...  First time that I have done so.     I am used to 2.5x scale mod, which makes things much harder, I see now.    Anyway lol I have maxed tech already, and have barely touched minmus or kerbal science points.   Just have a station above minmus  that gave me all the science that I needed to max everything out.     I built one above the Mun too, but have not even bothered landing on the Mun yet, as why bother....    The science alone from putting a station into orbit around the Mun gave me at least 2k science.    That with the 5k science i got from Minmus station after only having landed on two spots, gave me enough science to nearly max science tree out.  I have sent two probes out of system to the closest two planets to the Sun, but only got 300 or so science for that.    Perhaps Take Two could spend some time making an actual career mode, that informs you of difficulty before you start a vanilla play through.    Instead what we got was.......   Drum Roll please........   Missions!!!!!!!!!!!    Yes missions, do exactly nothing for base game play.   We did get a few more parts, yes....   Mods already did a great job of that task.      What seems to be lacking from this game is only in the career mode and overall scale of the universe.   Mods have covered the later well, but the former is really out of modding hands and if polished off could add so much dimension to this game that its not even fathomable to the Devs, apparently.   \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTLDR :   Ksp is currently a AA game, for 40 USD.   DLC  Worth 3.50 USD.   KSP, has potential to be a AAAAA game  Worth 70 USD for base game.    On top of that if Take Two was smart, they would offer \u0022cosmetic DCL\u0022  for those who have extra money to spend on a game they love.    Updates should be done bi annually, to give modding community time to keep up, and all Updates should be major, adding AAA content into the game.    Take two has enough money to make this game into what it should be.     Will you take up the challenge, Take Two???\n\u003C/p\u003E\n"},{"CreatedByName":"Red Thought","CreatedById":186712,"CreatedDateTime":"2018-03-19T18:53:46Z","Content":"\n\u003Cp\u003E\nJust got a null exception that seems to have maxed all of my resources..   I now have 60k science 87 mil in cash and maxed out reputation.   This was in a fresh game that i was 20 min into.\n\u003C/p\u003E\n"},{"CreatedByName":"Gorman","CreatedById":186136,"CreatedDateTime":"2018-03-20T00:22:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223327840\u0022 data-ipsquote-contentid=\u0022172493\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221521485626\u0022 data-ipsquote-userid=\u0022186712\u0022 data-ipsquote-username=\u0022Red Thought\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Red Thought said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust got a null exception that seems to have maxed all of my resources..   I now have 60k science 87 mil in cash and maxed out reputation.   This was in a fresh game that i was 20 min into.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have been playing the same career for about 8 hours in and I do not see anything like whats happening to you. The progression of science, cash and reputation seem to be normal. Can you give exact steps to reproduce what you are seeing? That is the only way bugs will be fixed.\n\u003C/p\u003E\n"}]}