{"TopicId":173642,"ForumId":32,"TopicTitle":"Your hardest missions","CreatedByName":"Jeb, The Lonely Kerbonaut","CreatedById":180473,"CreatedDateTime":"2018-04-08T15:08:20Z","PageNum":1,"Articles":[{"CreatedByName":"Jeb, The Lonely Kerbonaut","CreatedById":180473,"CreatedDateTime":"2018-04-08T15:08:21Z","Content":"\n\u003Cp\u003E\nI want to know what was your hardest mission in KSP. An mission in that something not planned happened, and that have great chances of gone wrong, but in the end you managed to fulfill it sucessfully.\n\u003C/p\u003E\n\u003Cp\u003E\nMy hardest mission was an probe that i sended to Eve, the Kernera 2. I not prepared the probe to make an aerocapture to orbit Eve, so i braked with an engine. I orbited Eve, but i wanted to low pretty much the orbit to get an safe athimospheric entry.\n\u003C/p\u003E\n\u003Cp\u003E\nBut i overestimated the amount of fuel nedded, and i didn\u0027t have enough fuel to low my orbit. So i lowered my periapsis to below Eve\u0027s athimosphere, and started to aerobrake to low my orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nBut this operation was pretty long. I make at least 30 passages by the athimophere, and this number didn\u0027t was bigger because of 2 time warp bugs that lowered my apoapsis of 78.000 km to 20.000 km.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd besides that, all the ablator of the heat shield of the probe gone during the entries, so i had to rotate desesperally the probe during the final entry, to dissipate the heat.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the final reentry was a sucess. The ship fulfilled his mission of land in one of the Eve\u0027s oceans (but very close to a island), and i gathered many science points with the entries.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd you, what was you hardest mission in KSP?\n\u003C/p\u003E\n"},{"CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2018-04-08T16:02:13Z","Content":"\n\u003Cp\u003E\nI think the hardest I\u0027ve had that I\u0027ve managed to finish successfully was when Lufrid was landed on the Mun with tourists aboard; the lander tipped over (too much slope in the landing site, and too much horizontal velocity on contact).  No \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E (craft wasn\u0027t built to dock), and the reaction wheel wasn\u0027t strong enough to even raise the nose.  Retracting the landing legs had no effect.  The command pod hatch was down, so Lufrid couldn\u0027t even get out of the pod to plant a flag and take a surface sample.\n\u003C/p\u003E\n\u003Cp\u003E\nI had the landing legs mounted on fuel tanks that, in turn, were attached with radial decouplers, but blowing the (empty) tanks didn\u0027t solve the problem either -- but it did allow Lufrid to roll the craft so the hatch wasn\u0027t blocked; she was able to plant her flag and take her sample and EVA report.\n\u003C/p\u003E\n\u003Cp\u003E\nWith that done, I made a quicksave and made a few attempts at the old \u0022slide up the crater wall\u0022 Munar launch method.  No good; the fuel tank or decoupler kept exploding before I\u0027d slide 100 m.  I finally tried maximum pitch/yaw upward (using both the reaction wheel and the gimbal of the Poodle engine), and that \u003Cem\u003Ewould\u003C/em\u003E in fact raise the nose rapidly enough to get off the surface before anything exploded.  Three or four more tries, and I managed to get \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E turned on to keep the craft pointed upward (Lufrid was still 1 star, so didn\u0027t have \u0022radial out\u0022 as a hold option), then shut down the engine, oriented horizontally to the east as the craft coasted upward, and burned for orbit.  Lufrid and her tourists were off the Munar surface, still with plenty of fuel to get back to Kerbin.\n\u003C/p\u003E\n"},{"CreatedByName":"suicidejunkie","CreatedById":155878,"CreatedDateTime":"2018-04-09T17:10:39Z","Content":"\n\u003Cp\u003E\nI was sending a big food delivery to a base on Minmus by tweaking a standard shuttle, and when it came time to launch, I accidentally loaded it with tourists instead of leaving the back seats empty.\n\u003C/p\u003E\n\u003Cp\u003E\nA few days out from Kerbin, I got the alert that O2 \u0026amp; H2O were running out.  I burned almost all the remaining fuel to redirect into a very high energy transfer and catch a 1km/s flyby of Minmus.  Bill, already on Minmus, spent the 5 hour ETA using \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E to bolt together a 909, a set of fuel tanks and a capsule from the scrapyard, and then scraped together all the dregs of fuel in the area for a completely hand-crafted rescue ship.\n\u003C/p\u003E\n\u003Cp\u003E\nFighting the lopsided craft with no \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, popping up above Minmus and hovering until it was time for the rendezvous burn, he was able to slap on a spare can of air with 9 minutes left on the clock, and then docked to share fuel and prevent the ship from swinging off into interplanetary space.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSome say he did it for the 5 years worth of snacks, others say he did it to show off his skills with the wrench, but really it was just following the Kerbonaut\u0027s Kode.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-10T17:51:19Z\u0022 title=\u002204/10/2018 05:51  PM\u0022 data-short=\u00226 yr\u0022\u003EApril 10, 2018\u003C/time\u003E by suicidejunkie\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"},{"CreatedByName":"invision","CreatedById":178900,"CreatedDateTime":"2018-04-09T21:20:42Z","Content":"\n\u003Cp\u003E\nkeeping Jeb alive for any amount of time\n\u003C/p\u003E\n"},{"CreatedByName":"Atkara","CreatedById":169458,"CreatedDateTime":"2018-04-10T16:29:32Z","Content":"\n\u003Cp\u003E\nDocking a miner with an out of fuel lander on suborbital trajectory over Duna and pushing it to a stable orbit in order to fuel it up.\n\u003C/p\u003E\n\u003Cp\u003E\nNot the hardest all around, but pulling it off felt good.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}