{"TopicId":18025,"ForumId":32,"TopicTitle":"I\u0026#039;m ticked off to the extreme on MechJeb","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2012-08-28T13:54:07Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2012-08-28T13:54:07Z","Content":"\n\u003Cp\u003EToday I decided to go to the mon with rocket.\u003C/p\u003E\u003Cp\u003EI still use the MechJeb autopilot especially for mon landing(on mun) because it\u0027s still too difficult for my , but i greatly improved my navigation skills so most of space maneuvers i do myself, it\u0027s great fun :-)\u003C/p\u003E\u003Cp\u003EToday, for the first time I had enough excess fuel to back all the astronauts bring to Kerbin ( i can orbiting the mun and back, but i have problem with bring all kerbonauts to Kerbin, i never have enough fuel to deorbit) \u003C/p\u003E\u003Cp\u003EToday i menage to save enough fuel to do this maneuver for the first time, it\u0027s will be de-orbit with aerobrake predicted 6,5 G :-)\u003C/p\u003E\u003Cp\u003EBut i do one bloody mistake, when all was set, I thought to myself why Il continue to torment me I\u0027ll turn MechJeb auto-land function, mayby i do this to early? anyway damn MechJeb turn me spacecraft into pro-grade mode firing full throttle and increasing my perigee to over 1000 km, i freaked out i turn off MechJeb steering to retrograde but i have fuel run out i menage to decrease perigee to 200 km.\u003C/p\u003E\u003Cp\u003EI\u0027m so furious on MechJeb but most of all on myself. Unfortunately, of this fault is a space tragedy my laziness, I entrusted life of the crew to the fool on-board computer, i can do this maneuver myself ease.\u003C/p\u003E\u003Cp\u003EI would like to know if any of you had a similar unpleasant experience with MechJeb?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-28T14:02:59Z\u0022 title=\u002208/28/2012 02:02  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 28, 2012\u003C/time\u003E by Pawelk198604\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"2008dragon","CreatedById":13712,"CreatedDateTime":"2012-08-28T14:09:38Z","Content":"\n\u003Cp\u003EIt sounds like it was going to try a bi-elliptical transfer to save fuel. If I were you I\u0027d slow down until I was going to crash into the mun (suborbital trajectory ?) and then turn on the landing feature.\u003C/p\u003E\n"},{"CreatedByName":"4 IN 1","CreatedById":1540,"CreatedDateTime":"2012-08-28T14:15:59Z","Content":"\n\u003Cp\u003EIts called Mech Jeb for a reason: When it work it work, when it goes to hell, crap start hitting the fan.\u003C/p\u003E\n"},{"CreatedByName":"Tauge","CreatedById":39280,"CreatedDateTime":"2012-08-28T14:40:24Z","Content":"\n\u003Cp\u003EMechjeb is a wonderful tool, but it\u0027s just a tool. It does make mistakes, sometimes those mistakes are due to incompatibility with your ship design and how Mechjeb flies (For example, my biggest problem with some of my designs is that some have a tendency to roll and Mechjeb likes to oversteer, so on gravity turns a roll turns into a barrel roll turns into a tumble turns into an abort, I could achieve orbit fine on manual). Sometimes it makes mistakes with burns (takes to long to rotate your massive craft and burns too late). It\u0027s not perfect, and you need to be there and ready to take over when everything goes wrong, or abort and try again.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2012-08-28T15:04:06Z","Content":"\n\u003Cp\u003EWell I\u0027ll have to try again, once I did it certainly will again.\u003C/p\u003E\u003Cp\u003EFor now I have to write a eulogy to honor fallen kerbonauts , I even found a template,\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.dailymail.co.uk/news/article-2193732/President-Nixon-The-moving-speech-delivered-Apollo-11-astronauts-return.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.dailymail.co.uk/news/article-2193732/President-Nixon-The-moving-speech-delivered-Apollo-11-astronauts-return.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E A little rewrite , and you will be fine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KAO","CreatedById":30795,"CreatedDateTime":"2012-08-28T15:19:40Z","Content":"\n\u003Cp\u003EI find myself doing manual landings more and more, especially with my new series of miniature probes\u003C/p\u003E\n"},{"CreatedByName":"ilikemoneygreen","CreatedById":10776,"CreatedDateTime":"2012-08-28T15:26:01Z","Content":"\n\u003Cp\u003EIm going to be honest, i can do the landing itselft fine, but get to the mun isnt within my skills yet. i have tried 20 times to get within the muns orbit without mech assistance but its like a bad guessing game. I always use mech to get me to the mun and to circularize. Mechs messed up a few of my landing so i tend not to let it land itself (unless its within minminus. it has a couple frozen lakes that are perfect for mechjob to land on, nice and flat!)\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2012-08-28T15:33:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ilikemoneygreen\u0022 data-cite=\u0022ilikemoneygreen\u0022\u003E\u003Cdiv\u003EIm going to be honest, i can do the landing itselft fine, but get to the mun isnt within my skills yet. i have tried 20 times to get within the muns orbit without mech assistance but its like a bad guessing game. I always use mech to get me to the mun and to circularize. Mechs messed up a few of my landing so i tend not to let it land itself (unless its within minminus. it has a couple frozen lakes that are perfect for mechjob to land on, nice and flat!)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut i landed on Mun, i admit with small help of MechJeb but i have problem with return to Kerbin, i can go around mun but when i land, i have problem with fuel.\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2012-08-28T15:38:10Z","Content":"\n\u003Cp\u003EI never used mechjeb myself. One way to really help with capturing orbit, is use atmospheric braking. When you leave the mun, try to burn in opposite direction of munar orbit. This way you are only moving in orbit of kerbin of a few hundred m/s. At this speed, it is easy to change your orbital intercept since small velocity changes have a large effect on your Po. Set your orbit to graze atmosphere. Try and avoid less than 37km in my experience if you want to use it to help capture orbit. The atmosphere will slow you down so capturing orbit takes alot less burn. On re-escape from atmosphere; once you are in space, if you burn directly towards planet, it will circularize your orbit.\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2012-08-28T16:21:13Z","Content":"\n\u003Cp\u003EFirst of all, some questions:\u003C/p\u003E\u003Cp\u003Ea) Your orbit was circular ?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Did you used \u0022land\u0022 or land on target\u0022 ?\u003C/p\u003E\u003Cp\u003EFor the first, mechjeb assumes a lot of stuff regarding your orbit and , in case of the landing algos, it assume that you\u0027re either using a circular orbit or that you are using one that crosses the body surface. If you are not in neither of them, it will do wacky stuff. For the second, if you used, \u0022land on target\u0022 with the target being on the other side of the world at the time it is expected you will land without intervention or at Pe, Mechjeb will try to do a bi-elliptical or atleast to circularize ....\u003C/p\u003E\n"},{"CreatedByName":"BurningSky93","CreatedById":2316,"CreatedDateTime":"2012-08-28T16:40:46Z","Content":"\n\u003Cp\u003EI find MechJeb\u0027s landing tools work best when you are at a fairly high altitude (above 100km) and you give it plenty of time to react with a \u0022land at target\u0022, but don\u0027t start the autopilot too early or MechJeb will freak out.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2012-08-28T18:06:47Z","Content":"\n\u003Cp\u003EThank you for your advice;)\u003C/p\u003E\u003Cp\u003EI managed to land on the moon and brought everyone back, but unfortunately my kerbonauts did not survive this epic journey;)\u003C/p\u003E\u003Cp\u003ESomething screwed up in the design, parachute is broke off and the capsule followed in the footsteps of the* Soyuz 1 :-(\u003C/p\u003E\n"},{"CreatedByName":"bandit4910","CreatedById":14446,"CreatedDateTime":"2012-08-28T18:12:40Z","Content":"\n\u003Cp\u003EI did this before and my rocket fell off over on the launchpad.\u003C/p\u003E\n"},{"CreatedByName":"Tauge","CreatedById":39280,"CreatedDateTime":"2012-08-28T18:19:06Z","Content":"\n\u003Cp\u003EWere you using the 3 man capsule? If you were, did you have anything between the parachute and the capsule itself? ASAS? Mechjeb? RCS Fuel? A stuffed bear? If there was anything between the capsule and the parachute, then the parachute will pull the item off the capsule leaving the capsule to plummet to the Kerbin. When using a three man capsule I have tried using struts to hold the item better to the capsule, but it doesn\u0027t always work. Typically, I\u0027ve just been using several (3) of the smaller parachutes attached directly to the capsule, the only time had one rip off was when I collided with jettisoned fuel tanks on reentry.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2012-08-28T19:09:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tauge\u0022 data-cite=\u0022Tauge\u0022\u003E\u003Cdiv\u003EWere you using the 3 man capsule? If you were, did you have anything between the parachute and the capsule itself? ASAS? Mechjeb? RCS Fuel? A stuffed bear? If there was anything between the capsule and the parachute, then the parachute will pull the item off the capsule leaving the capsule to plummet to the Kerbin. When using a three man capsule I have tried using struts to hold the item better to the capsule, but it doesn\u0027t always work. Typically, I\u0027ve just been using several (3) of the smaller parachutes attached directly to the capsule, the only time had one rip off was when I collided with jettisoned fuel tanks on reentry.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI used 3 men capsule i add several struts, but maybe to little\u003C/p\u003E\n"},{"CreatedByName":"BurningSky93","CreatedById":2316,"CreatedDateTime":"2012-08-28T19:40:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003EThank you for your advice;)\u003Cp\u003EI managed to land on the moon and brought everyone back, but unfortunately my kerbonauts did not survive this epic journey;)\u003C/p\u003E\u003Cp\u003ESomething screwed up in the design, parachute is broke off and the capsule followed in the footsteps of the* Soyuz 1 :-(\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is why you follow in NASA\u0027s footsteps and test your rockets as much as possible in atmo before undertaking the main mission. Make sure it stages properly and make sure the parts that need to land on Kerbin do so safely. Remember to try and open your parachute only when the final stage has slowed down quite a bit from drag before opening it (though obviously keep your altitude in mind). You obviously don\u0027t want your chute open too late, but it doesnt help to have it open too early either.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-28T19:45:08Z\u0022 title=\u002208/28/2012 07:45  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 28, 2012\u003C/time\u003E by BurningSky93\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Suzaku","CreatedById":40800,"CreatedDateTime":"2012-08-28T19:54:02Z","Content":"\n\u003Cp\u003ELol, why are you so mad? It\u0027s not like it\u0027s a real rocket. Were you using time accelerate?\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2012-08-28T20:46:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BurningSky93\u0022 data-cite=\u0022BurningSky93\u0022\u003E\u003Cdiv\u003EThis is why you follow in NASA\u0027s footsteps and test your rockets as much as possible in atmo before undertaking the main mission. Make sure it stages properly and make sure the parts that need to land on Kerbin do so safely. Remember to try and open your parachute only when the final stage has slowed down quite a bit from drag before opening it (though obviously keep your altitude in mind). You obviously don\u0027t want your chute open too late, but it doesnt help to have it open too early either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you, now I know I was going to run Fraps and record a video of my landing on the mun, to celebrate Niel Armstrong, it\u0027s good that I forgot, because that was a total embarrassment . I\u0027m going to improve my project(the parachute), and I\u0027m going to try again tomorrow with a full video recording to be able to fulfill Neil Armstrong Challenge, i plan also download flag mod too to add more realism.\u003C/p\u003E\n"},{"CreatedByName":"AncientAstronaut","CreatedById":36093,"CreatedDateTime":"2012-08-28T20:52:55Z","Content":"\n\u003Cp\u003EI have a crazy idea. It might just work...\u003C/p\u003E\u003Cp\u003ELearn to fly yourself instead of relying on autopilots. When the Eagle\u0027s auto-landing went whacky on them, you know what Neil Armstrong and Buzz Aldrin did? They made the last minute of the landing completely manually. \u003C/p\u003E\u003Cp\u003EKSP is only fun if you know how to fly. What\u0027s the point of just pressing a few buttons and having the game do it for you? I do it sometimes in some cases because it\u0027s convenient, but I can perform every maneuver in the game\u003C/p\u003E\u003Cp\u003Ecompletely manually. I think you should give that a shot.\u003C/p\u003E\n"},{"CreatedByName":"techonce","CreatedById":35508,"CreatedDateTime":"2012-08-28T21:02:53Z","Content":"\n\u003Cp\u003EMechjeb does not play well with my standard rocket. THe gravity burn kills it since my rocket is a bit unwieldy and it goes into the death tumble.\u003C/p\u003E\u003Cp\u003EBut launches are not the issue anyway, I can handle those. I use jeb to circularize, since i seem to be unable to do it, althought after watching Mechjeb, I see where I was making mistakes.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-28T21:03:34Z","Content":"\n\u003Cp\u003ERight, well, it looks like this thread is going to turn into an argument thread, so I am closing it, and AncientAstronaut, people play in different ways, KSP is flexible enough, especially with add-ons, to allow this, it is not up to others to dictate how people play this game or any other.\u003C/p\u003E\u003Cp\u003EThe point of gaming is to enjoy yourself and have fun, if that means using autopilots then so be it.\u003C/p\u003E\u003Cp\u003EThread closed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}