{"TopicId":18196,"ForumId":32,"TopicTitle":"make shift EVA parachutes","CreatedByName":"roebuck","CreatedById":45010,"CreatedDateTime":"2012-08-30T13:46:18Z","PageNum":1,"Articles":[{"CreatedByName":"roebuck","CreatedById":45010,"CreatedDateTime":"2012-08-30T13:46:18Z","Content":"\n\u003Cp\u003Esorry if this has been posted before but i dont think it has\u003C/p\u003E\u003Cp\u003ESo ive made EVA parachutes with vanilla parts you will need 3 part to make them first the TT-38k radial decoupler the telus-LV bay mobile enchancer and the mk16 parachute. \u003C/p\u003E\u003Cp\u003Ethis so whats bad about this parachut it can only be \u0022started\u0022 in a 0G placem and you will have to jump on it after its detached or often the kerbal will be lanched away from the eva parachute, so it wont work on space planes unless with abit of luck you can time it right and get the kerbal on the ladder.\u003C/p\u003E\u003Cp\u003ESo theres nothing more to say i have tryed it 10 times it has worked all times its just that you have to manuly keep the kerbal on the ladder else its an easy thing! now jeb can sky dive from space and surive with out even hurting his sunglasses \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003Eanyways hope you will have fun with this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ealso sorry for the bad english it isent my first langunge so... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2012-08-30T16:06:47Z","Content":"\n\u003Cp\u003ENeat! Could we see some pictures?\u003C/p\u003E\u003Cp\u003ESomebody did something similar before: an EVA re-entry vehicle made of a winglet, a ladder and a parachute. It worked rather well.\u003C/p\u003E\n"},{"CreatedByName":"Elven_sword","CreatedById":16427,"CreatedDateTime":"2012-08-30T17:38:25Z","Content":"\n\u003Cp\u003EPretty sure this has been discovered before, but it\u0027s good to see new players discovering this principle! By the way, jump on the chute under 100km so you don\u0027t get thrown off.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2012-08-30T17:55:29Z","Content":"\n\u003Cp\u003EI performed a skydive from 500km.\u003C/p\u003E\n"}]}