{"TopicId":182050,"ForumId":32,"TopicTitle":"Out of curiosity, what\u0027s your craft naming scheme?","CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-02-09T04:32:01Z","PageNum":1,"Articles":[{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-02-09T04:32:01Z","Content":"\n\u003Cp\u003E\nHey there.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s actually been a while since I last played KSP, but after taking a look at a few crafts of mine and the way I named, I got curious:\n\u003C/p\u003E\n\u003Cp\u003E\nWhat naming scheme do you use to name your ships?\n\u003C/p\u003E\n\u003Cp\u003E\nI, for instance, used the USAF naming scheme for naming aircraft, and a self-made scheme for naming rocket based on their characteristics, such as:\n\u003C/p\u003E\n\u003Cp\u003E\n-Total Stages\n\u003C/p\u003E\n\u003Cp\u003E\n-Crewed (if so, how many crewkerbs)\n\u003C/p\u003E\n\u003Cp\u003E\n-Carriable cargo, in tons\n\u003C/p\u003E\n\u003Cp\u003E\n-Ship ID\n\u003C/p\u003E\n\u003Cp\u003E\n-Ship version\n\u003C/p\u003E\n\u003Cp\u003E\n-Total delta-V once in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, in m/s, sum of all stages\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nKerbal-X, for instance, would look something like 3 C/3 0 \u0022Kerbal X\u0022 A 4302 (note: 4302 is just an example)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m curious to know how you guys name yours, feel free to share!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-09T04:32:44Z\u0022 title=\u002202/09/2019 04:32  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 9, 2019\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2019-02-09T05:47:17Z","Content":"\n\u003Cp\u003E\nI\u0027m ridiculously boring usually. Usually it\u0027s just \u0026lt;destination\u0026gt; \u0026lt;job\u0026gt; \u0026lt;iteration\u0026gt;, as in \u0022Mun Orbit 2\u0022 or \u0022Laythe Lander 1\u0022 or maybe \u0022Jeb Rescue\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSometimes I throw in something whimsical. \u0022Eve Exploder\u0022 in tribute to Scott Manley or something like that. \u0022Kill Me Not\u0022 for dangerous stuff. Whatever. But more often than not, it\u0027s the simple \u0026lt;destination\u0026gt; \u0026lt;job\u0026gt; \u0026lt;iteration\u0026gt;\n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2019-02-09T06:24:23Z","Content":"\n\u003Cp\u003E\nIt\u0027s different in every save, and often highly random (for example, I had a save where every craft name was the name of a Simon \u0026amp; Garfunkel song). The only exception is my naming scheme for \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E/\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1, where spacecraft are named after figures from Ancient Greek history and mythology. Even there, though, I pick something random for my booster/upper stage naming scheme (for example, I had a save where boosters were named after birds of prey, and upper stages after songbirds).\n\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2019-02-09T07:33:03Z","Content":"\n\u003Cp\u003E\nI\u0027m with 5th Horseman.  In my current game so far there have been:\n\u003C/p\u003E\n\u003Cp\u003E\nSub Orbital \n\u003C/p\u003E\n\u003Cp\u003E\nTourist sub orbital \n\u003C/p\u003E\n\u003Cp\u003E\nFirst orbit \n\u003C/p\u003E\n\u003Cp\u003E\nTourist orbital \n\u003C/p\u003E\n\u003Cp\u003E\nMun1\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHowever I plan to break convention,  my next launch will be Agena, a target vessel for the next ship, which probably called Docker or Dock Test.  No prizes for guessing thier mission \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2019-02-09T07:37:22Z","Content":"\n\u003Cp\u003E\nI don\u0027t really have one. \u003Cspan style=\u0022line-height:1.6;\u0022\u003EI mean I do, but it\u0027s weird. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EIf it\u0027s unmanned, then the name is the probe core name (OKTO, HECS etc) if it has any other purposes than just being in orbit, like it has a scanning equipment, I add SCAN. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EFor manned missions I simply use the capacity as a name - if it can hold one kerbal, it\u0027s Single, if two it\u0027s Double etc.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EThen the rest of the name: it goes from Mk1 to Mkwhatever, so far I got only to 3. Mk1 can get into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and nothing more, Mk3 can reach Minmus orbit and come back (and is more reliable) OR, the regular iterations, if I don\u0027t plan to increase their \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E but the overall design changes to better, with newer tech, like my Lune Mk1, the SaturnV-ish Apollo-ish ship for Mun landing.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003E\u003C/span\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003EThen I add letters: D if it has a docking port, R if at least the first stage is recoverable, L if it goes for landing somewhere.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ESo I can have OKTO2 Mk3RL or Triple Mk2RD\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EPlanes have their own names, so do rovers, orbital stations, bases (the last two have planet prefix, like Kerbutt (don\u0027t ask) and Dunbase)\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Hotel26","CreatedById":139095,"CreatedDateTime":"2019-02-09T09:03:43Z","Content":"\n\u003Cp\u003E\nSimilar to 5thHorseman, but abbreviated.  MX1 would be space station (X) 1 at (or going to) the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nEvery planet/moon has a unique single-letter designation: e.g. \u0027N\u0027 is Minmus.  Every type of craft has a unique single-letter designation: e.g. \u0027R\u0027 rover.  I use X for space station only because mine is \u0027Krux\u0027, which is a cross.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the exact type of craft, when it is important, I sometimes add that after code for clarity, especially for airplanes.  On Kerbin and the Mun, with lots of bases, I\u0027ll add the longitude for the base the craft is attached to (even if it is traveling).\n\u003C/p\u003E\n\u003Cp\u003E\nHaystack searches happily on short, consistent abbreviations, so entering e.g. \u002734W\u0027 brings up everything relevant to that longitude, if it is so marked.  The clarity part after the abbreviation could include something like \u0027KX1\u0027, which prompts me that when it has finished its mission, it should return to base, Kerbin space station #1.\n\u003C/p\u003E\n\u003Cp\u003E\nThe system is still somewhat fluid and evolving.  So perhaps something like \u0027KX1H1 Hawk\u0027, meaning \u0027first Hawk attached to KX1\u0027 is where it is going.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-09T09:19:30Z\u0022 title=\u002202/09/2019 09:19  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 9, 2019\u003C/time\u003E by Hotel26\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2019-02-09T09:16:13Z","Content":"\n\u003Cp\u003E\nI have several that I am currently using.\n\u003C/p\u003E\n\u003Cp\u003E\nStandard spacecraft and modules are all given a designation as Alnitak, Alnilam, or Mintaka, mostly just depending on their size; these names come from the stars in Orion\u0027s Belt. Alnitak covers 1.25m to 1.875m parts, Alnilam covers 2.5m parts, and Mintaka covers 3.75m and larger parts. This naming scheme is for crewed spacecraft and for modules of crewed vehicles; uncrewed \u003Cem\u003Elarge\u003C/em\u003E spacecraft will perhaps get a separate naming scheme once I actually create some, but probes are typically bespoke for a particular mission.\n\u003C/p\u003E\n\u003Cp\u003E\nOn top of the Orion\u0027s Belt names, there are sub-classes, denoted by a number appended to the star name. Alnitak-1 denoted my first crewed spacecraft series (a one-kerbal spacecraft and some basic station modules), Alnitak-2 now covers my Gemini-like two-kerbal crew transport and the expanded infrastructure designed to work with it (including future Mun and Minmus landers), Alnitak-3 will consist of extensions of the Alnitak-class spacecraft for surface base construction on Mun and Minmus, and Alnitak-4 will only be used if I continue using similar technology for early interplanetary missions (probably limited to flybys of Eve and Duna, and certainly nothing more complex than landings on Gilly and Ike). Alnilam-1 will include technology somewhat comparable to both the Apollo program and the lunar aspect of the Constellation program, Alnilam-2 will involve things like Duna landings and surface infrastructure (as well as expanding upon all previous capabilities), and beyond that it really depends where I want to go and when. Mintaka-class modules will almost exclusively be components of stations and interplanetary transports, though the classification will also include some of the larger landing vehicles.\n\u003C/p\u003E\n\u003Cp\u003E\nEach individual spacecraft of the aforementioned classes also has its own designation, but that is just a short alphanumerical sequence to indicate what it does (e.g. CT3 refers to a \u003Cstrong\u003Ecrew transport\u003C/strong\u003E for three kerbals). These designations are always unique because within a particular series of spacecraft (i.e. similar level of technology) it makes little sense to have several that do the same thing.\n\u003C/p\u003E\n\u003Cp\u003E\nAll that said, these names do not apply to the actual \u003Cem\u003Emissions\u003C/em\u003E. Crewed missions, mission programs, modular spacecraft (like interplanetary transports), and space stations are all named after Jovian moons. Surface bases are named after Uranian moons. Uncrewed spacecraft like probes are named after Saturnian moons - with the exception of landers, and atmospheric ascent vehicles for gas giants, which are named after Neptunian moons. Regarding crewed missions, any \u003Cem\u003Ebespoke\u003C/em\u003E infrastructure (anything designed exclusively for that mission without the possibility of modularity) will just be named after the mission; for example, if I choose to name my upcoming Munar missions the Pasiphae program (one of the Jovian moons I am considering for the name), a versatile orbital resupply depot will be Alnitak-class while a lander designed exclusively for transporting cargo to the Munar surface will be Pasiphae-class.\n\u003C/p\u003E\n\u003Cp\u003E\nMy launch vehicles are standardized and also have a naming scheme, though I doubt many people will be able to guess the source material (the names in question are Argos, Halcyon, Minos, Aegis, Orion, and Mimir).\n\u003C/p\u003E\n\u003Cp\u003E\nJust about the only things I do not yet have a standardized naming scheme for are standard transfer stages (for sending payloads of a particular mass from low Kerbin orbit to other locations, and potentially back again), planes, and rovers, but in all three of these cases that is because I have not yet \u003Cem\u003Emade\u003C/em\u003E any of these vehicles in my current 1.6 playthrough.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-09T09:17:28Z\u0022 title=\u002202/09/2019 09:17  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 9, 2019\u003C/time\u003E by septemberWaves\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Espatie","CreatedById":194327,"CreatedDateTime":"2019-02-09T10:17:34Z","Content":"\n\u003Cp\u003E\nI use a TLA designation for the ship\u0027s purpose, in a deliberate homage to the Culture novels. OUV is \u0022Orbital Utility Vehicle\u0022; SCT is \u0022\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E Crew Transport\u0022; CCS is \u0022Container Cargo Ship\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThen each has a name, which is usually something to do with an event that happened in game. So the SCT Slingshot is named because it\u0027s shakedown launch resulted in an unexpected slingshot journey around the Mun in order to get home, while the OUV Faust was named because it was launched on a mission to save an earlier ship called Demon.\n\u003C/p\u003E\n"},{"CreatedByName":"Fraktal","CreatedById":184990,"CreatedDateTime":"2019-02-09T16:34:44Z","Content":"\n\u003Cp\u003E\nFor space vessels:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cem\u003EPathfinder\u003C/em\u003E class: manned short-range science flights\n\u003Cul\u003E\u003Cli\u003E\nKerbin-1: sounding rocket\n\u003C/li\u003E\n\u003Cli\u003E\nKerbin-2: suborbital rocket\n\u003C/li\u003E\n\u003Cli\u003E\nKerbin-3: \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E rocket\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Ci\u003ESpaceliner\u003C/i\u003E class: manned personnel/tourist transport\n\u003Cul\u003E\u003Cli\u003E\nSpaceliner-1: \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nSpaceliner-2: Mun/Minmus orbiter\n\u003C/li\u003E\n\u003Cli\u003E\nSpaceliner-3: Mun/Minmus orbiter with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E and docking capability\n\u003C/li\u003E\n\u003Cli\u003E\nSpaceliner-4: near interplanetary orbiter\n\u003C/li\u003E\n\u003Cli\u003E\nSpaceliner-5: far interplanetary orbiter\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cem\u003ESurveyor\u003C/em\u003E class: unmanned science flights\n\u003Cul\u003E\u003Cli\u003E\nSurveyor-1: single-shot Mun/Minmus probe\n\u003C/li\u003E\n\u003Cli\u003E\nSurveyor-2: Minmus orbiter \u002B rover\n\u003C/li\u003E\n\u003Cli\u003E\nSurveyor-3: Gilly/Ike orbiter \u002B rover\n\u003C/li\u003E\n\u003Cli\u003E\nSurveyor-4: Dres/Bop/Pol orbiter \u002B rover\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cem\u003EExplorer\u003C/em\u003E class: manned long-range science flights\n\u003Cul\u003E\u003Cli\u003E\nExplorer-1: single-person Mun/Minmus orbiter\n\u003C/li\u003E\n\u003Cli\u003E\nExplorer-2: single-person Mun/Minmus lander\n\u003C/li\u003E\n\u003Cli\u003E\nExplorer-3: two-person Mun/Minmus lander with sufficient \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for polar landings\n\u003C/li\u003E\n\u003Cli\u003E\nExplorer-4: near interplanetary (Duna/Dres/Moho) orbiter, lander and manned rover\n\u003C/li\u003E\n\u003Cli\u003E\nExplorer-5: far interplanetary (Jool/Eeloo) orbiter and \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E lander shuttle\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cem\u003EArgus\u003C/em\u003E class: Grand Tour mothership with a rocket \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E rated for Tylo\u0027s gravity, an airbreathing \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E rated for Kerbin\u0027s gravity and an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E rig rated for Moho\u0027s gravity\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nFor aircraft, with an increasing letter suffix as more advanced engines are developed and used:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nL - Mk1\n\u003Cul\u003E\u003Cli\u003E\nL1: twin Juno, then single-engine\n\u003C/li\u003E\n\u003Cli\u003E\nL2: twin-engine\n\u003Cul\u003E\u003Cli\u003E\nL2 Record Breaker: triple-engine with no science or personnel payload\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nL3: \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nM - Mk2\n\u003Cul\u003E\u003Cli\u003E\nM1: twin-engine\n\u003C/li\u003E\n\u003Cli\u003E\nM2: quad-engine\n\u003Cul\u003E\u003Cli\u003E\nM2 Record Breaker: hexa-engine with no science or personnel payload\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nM3: \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nH - Mk3\n\u003Cul\u003E\u003Cli\u003E\nH1: atmospheric\n\u003C/li\u003E\n\u003Cli\u003E\nH2: \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nNo designations for STS analogues yet, because I\u0027m yet to produce a flyable tailsitter shuttle. My last attempt made suborbital, but it was very small and instead of being a tailsitter, it had the tanks and engines symmetrically attached on the top and bottom instead of only at the bottom.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-09T23:35:39Z\u0022 title=\u002202/09/2019 11:35  PM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 9, 2019\u003C/time\u003E by Fraktal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MiscelanousItem","CreatedById":194744,"CreatedDateTime":"2019-02-09T16:59:43Z","Content":"\n\u003Cp\u003E\nMy naming scheme is: launcher rocket with serial and mission name,for example:\u003Cbr\u003E\nRutherford 6\u002BDunaDiscoveryMission 1 \u0022Shot and hope\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n(my early rocket don\u0027t have a naming scheme because the are designed with the pay load all ready integrated)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"catonthekbd","CreatedById":189435,"CreatedDateTime":"2019-02-09T21:02:55Z","Content":"\n\u003Cp\u003E\nI use a simple \u0022type-capacity-destination\u0022 scheme, so I can remember the mission it is running as mission sometimes take over a month in RL time.\n\u003C/p\u003E\n\u003Cp\u003E\ne.g. ore-2500-duna-ike, tour-30-minmus, rescue-1-\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003Eker\u003C/abbr\u003E, etc.\n\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2019-02-09T21:21:29Z","Content":"\n\u003Cp\u003E\n“Untitled Spacecraft” \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"voicey99","CreatedById":166341,"CreatedDateTime":"2019-02-10T01:43:09Z","Content":"\n\u003Cp\u003E\nIt changes every game. This time round I give all my probes a utilitarian name appended with the name of a famous criminal kingpin, so I have an \u0022Eve Probe \u0022Escobar\u0022\u0022, a \u0022Urlum Probe \u0022Capone\u0022\u0022 and a \u0022Jool Probe \u0022Putin\u0022\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for manned vessels, if it\u0027s just a routine flight I don\u0027t bother naming them but proper interplanetary ships are always named after fictional characters from a particular source. This save they will be named after SWTOR characters e.g. in a year\u0027s time the \u003Cem\u003ENadia Grell\u003C/em\u003E and its attached lander \u003Cem\u003ESarkhai\u003C/em\u003E will depart for Duna. Unlike probes, they are usually major and infrequent enough for me to learn which is which.\n\u003C/p\u003E\n\u003Cp\u003E\nBooster subassemblies follow a similar pattern, with size 0, size 1 and size 2 series being named after characters from\u003Cem\u003E I, Robot, The Lost Fleet \u003C/em\u003Eand\u003Cem\u003E Mass Effect \u003C/em\u003Erespectively.\n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2019-02-10T04:45:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223537919\u0022 data-ipsquote-contentid=\u0022182050\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549762989\u0022 data-ipsquote-userid=\u0022166341\u0022 data-ipsquote-username=\u0022voicey99\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, voicey99 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBooster subassemblies ... named after characters from\u003Cem\u003E I, Robot, The Lost Fleet \u003C/em\u003Eand\u003Cem\u003E Mass Effect\u003C/em\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you have an Olivaw series somewhere out there I\u0027d keep an eye on it. It might just start running your space program for you without you even knowing it.\n\u003C/p\u003E\n\u003Cp\u003E\n-\n\u003C/p\u003E\n\u003Cp\u003E\nFor my saved craft I usually append an abbreviation for the planetary body they are intended to go to and a prefix including a string of letters that stand for (O)rbiter, (F)lyby, (P)robe, (L)ander, (R)eentry, or (C)rewed followed by the number of crew members it can carry. After this is the series name. Crewed science craft are named after scientists, real or fictional. Crew transport ferries are named after explorers or pilots; fuel tankers after large animals; science probes are named after birds; and communication satellites for authors. So a craft saved as \u0022Du.LRC4 - Fermi\u0022 would be a four crew science vessel capable of landing on Duna and reentering on Kerbin. But the \u0022Mo.FP - Raven\u0022 would be an unmanned flyby probe to Moho that\u0027s never coming back.\n\u003C/p\u003E\n\u003Cp\u003E\nLaunchers are saved as subassemblies with a prefix to indicate tonnage to 100km Kerbin orbit, the payload diameter, and a series name. The \u0022L020T-2.5 - Enterprise\u0022 is a lifter that can carry 20 tons to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. Lifters are named after famous ships, real or fictional and may get A, B, C designations for minor variants such as extra solid rocket boosters or different fairing sizes.\n\u003C/p\u003E\n\u003Cp\u003E\nSpace stations and surface bases get more fanciful names based on the titles from books, films or television. \u0022The Restaurant and the End of the Universe\u0022 may be a space hotel, for example, or \u0022The Devil in the Dark\u0022 an ore mining base.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-10T05:32:51Z\u0022 title=\u002202/10/2019 05:32  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 10, 2019\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MisterKerman","CreatedById":189407,"CreatedDateTime":"2019-02-10T05:37:58Z","Content":"\n\u003Cp\u003E\nIf final version of craft:\n\u003C/p\u003E\n\u003Cp\u003E\nCODENAME MISSION#\n\u003C/p\u003E\n\u003Cp\u003E\nIf in experimental phases of construction:\n\u003C/p\u003E\n\u003Cp\u003E\nCODENAME MISSION# DESIGN-ITERATION-LETTER\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2019-02-10T06:01:02Z","Content":"\n\u003Cp\u003E\nUp-Goer #\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2019-02-10T08:40:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223537721\u0022 data-ipsquote-contentid=\u0022182050\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549730084\u0022 data-ipsquote-userid=\u0022184990\u0022 data-ipsquote-username=\u0022Fraktal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Fraktal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cul\u003E\u003Cli\u003E\n \n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ENo designations for STS analogues yet, because I\u0027m yet to produce a flyable tailsitter shuttle. My last attempt made suborbital, but it was very small and instead of being a tailsitter, it had the tanks and engines symmetrically attached on the top and bottom instead of only at the bottom.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can be twice as efficient and just do that instead \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002248362193_2063303633738630_18290122739731\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://scontent-waw1-1.xx.fbcdn.net/v/t1.0-9/fr/cp0/e15/q65/48362193_2063303633738630_1829012273973166080_o.jpg?_nc_cat=111\u0026amp;efg=eyJpIjoidCJ9\u0026amp;_nc_ht=scontent-waw1-1.xx\u0026amp;oh=d04d8042f31596dd75c03781a5cb1410\u0026amp;oe=5D012E17\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI built this in literally ten minutes and made it to orbit without issues and back with both shuttles\n\u003C/p\u003E\n"},{"CreatedByName":"Jon Tash","CreatedById":2681,"CreatedDateTime":"2019-02-10T11:59:51Z","Content":"\n\u003Cp\u003E\nI had a very complicated one before but now since 1.5 I use a more simple.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst letter is what type of craft it is. Like,\n\u003C/p\u003E\n\u003Cp\u003E\nF for Flyer meaning anything that flies in atmosphere like planes.\n\u003C/p\u003E\n\u003Cp\u003E\nO for Orbiter, anything that can land and can get to orbit, mostly on low gravity bodies. They are mostly landers.\n\u003C/p\u003E\n\u003Cp\u003E\nST for Stations\n\u003C/p\u003E\n\u003Cp\u003E\nS for Satellite and Relays\n\u003C/p\u003E\n\u003Cp\u003E\nP for Probes, anything that I launch that is supposed to go to a specific target and get data of it.\n\u003C/p\u003E\n\u003Cp\u003E\nR for Rovers\n\u003C/p\u003E\n\u003Cp\u003E\nV for Vessel meaning anything that transport Kerbals, get to orbit do whatever mission it is supposed to do then get back to Kerbin in a capsule. \n\u003C/p\u003E\n\u003Cp\u003E\nThen I add its name that I take mostly from ancient gods or names I like. Then a roman numeric number to tell which version it is.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd you get something like this : S - Deimos II or ST - Mirai I.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2019-02-10T20:16:22Z","Content":"\n\u003Cp\u003E\nFor stuff with wings, they get a standard number/letter designation plus a random name.\n\u003C/p\u003E\n\u003Cp\u003E\nCF-##@     Fighter-like  aircraft   (CF-01A Vampire is a Mig-15-ish early game single seat jet with a Wheesley, the -01B has a Panther instead)\n\u003C/p\u003E\n\u003Cp\u003E\nCFP-##@   Prop or turboprop fighter-like aircraft\n\u003C/p\u003E\n\u003Cp\u003E\nCB-##@   Bomber-like aircraft\n\u003C/p\u003E\n\u003Cp\u003E\nCP-##@   Passenger aircraft\n\u003C/p\u003E\n\u003Cp\u003E\nCS-##@    Spaceplanes\n\u003C/p\u003E\n\u003Cp\u003E\nCSP-##@   Seaplanes\n\u003C/p\u003E\n\u003Cp\u003E\nCT-##@   In theory trainers, but only ever used for my barely starting the tech tree, barely flyable fixed gear \u0026amp; Juno aircraft\n\u003C/p\u003E\n\u003Cp\u003E\nFor stuff that departs from the launch pad:\n\u003C/p\u003E\n\u003Cp\u003E\nNon-interplanetary craft:         \u0026lt;Launcher\u0026gt; \u0026lt;Description\u0026gt;    ie Titan Mun Lander for a lander on top of a 1.875m launcher.\n\u003C/p\u003E\n\u003Cp\u003E\nMy launchers are:  1.25m - Jabbit, 1.875m Titan, 2.5m Olympic (Expendable) or Nexus V (Reusable), 3.75m Goliath (Expendable) or Nexus VI (Reusable), I don\u0027t have a \u0022standard\u0022 5m launcher to give it a name.  Each launcher typically has several variants saved as subassemblies - with \u0026amp; without radial boosters of different types, core length \u0026amp; engine choice, etc.  The Olympic series is probably the most versatile, with standard (Mainsail), Heavy (Twin Boar)  \u0026amp; Light (SpaceY Moa, 965 kN) variants, each with multiple radial booster setups. \n\u003C/p\u003E\n\u003Cp\u003E\nInterplanetary:     Planetary \u0026lt;Description\u0026gt;   ie Planetary Lander \u0026amp; Relay Mk 1V for a combination relay satellite \u0026amp; probe lander, earliest version (mk 1), for vacuum worlds (V).   That way everything for interplanetary ops is grouped together in the load menu.\n\u003C/p\u003E\n\u003Cp\u003E\nSome standard description abbreviations:   STM-#: Station Transfer Module, for swapping crews to/from stations, # indicates crew capacity.  OTV-# - Orbital Tourist Vehicle, # indicates passenger load.   OMV - Orbital Maneuver Vehicle, pod with small amount of fuel \u0026amp; snacks \u0026amp; \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E.  Only used for early tech rendezvous \u0026amp; dock missions before I develop the tech for my the more capable:. MPV-# - Multi-purpose vehicle, basically a pod of whatever size with power generation, docking, snacks, \u0026amp; a good amount of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for whatever mission it\u0027s needed for.   # indicates version (MPV-1 is lower tech than MPV-2), usually made in standard \u0026amp; ER versions with extra \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSpecial purpose craft - big stations or bases, just about anything for Eve or Tylo, etc just get a descriptive name (Eve Pancake Lander or Laythe Floating Base)\n\u003C/p\u003E\n"},{"CreatedByName":"Mr. Peabody","CreatedById":173591,"CreatedDateTime":"2019-02-10T21:26:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223537532\u0022 data-ipsquote-contentid=\u0022182050\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549686721\u0022 data-ipsquote-userid=\u0022152223\u0022 data-ipsquote-username=\u0022Aperture Science\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎2‎/‎8‎/‎2019 at 11:32 PM, Aperture Science said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOut of curiosity, what\u0027s your craft naming scheme?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe\u0027re supposed to have one of them? \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spraki","CreatedById":155616,"CreatedDateTime":"2019-02-10T21:41:39Z","Content":"\n\u003Cp\u003E\nI can\u0027t quite remember the\u003Cem\u003E naming policy \u003C/em\u003Efor my vacuum-related crafts. But standard kerbin (space)planes go by two letters, then numbers (no system behind that one really) and some kerby name:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E~IIRC, that is xD\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSizes goes from A, B, C, D and J\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022A\u0022 being small cute ones to \u0022J\u0022 being very big planes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPurpose goes A or F, B, C and J\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022A or F\u0022ighter as being small for taxi flights, C and J being long range and/or utility (like cargo transport).\n\u003C/p\u003E\n\u003Cp\u003E\nI think I had a letter specifically for supersonic vs long range capabilities.\n\u003C/p\u003E\n\u003Cp\u003E\n(Like, if \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E is below 30k or above, as hi-bypass turbofans easily can stack some \u002B70k \u0022of range\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI had a CJ transport plane (left) a fuel truck to another airfield:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mN5rtAS.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/mN5rtAS.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNumbers have no purpose really, which for sure would serve more for space-related stuff. I can\u0027t remember since the last time I did true career plays was in 2016 \u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon2.png\u0022 title=\u0022:o\u0022\u003E . Been wanting to upload the recordings and do more career stuff, but ehh, RL is annoying \u003Cspan\u003E:v. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLastly, I just add a kerby name if possible.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRovers get \u0022R\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nLanders, I can\u0027t remember. Although I do tie in the mission name.\n\u003C/p\u003E\n\u003Cp\u003E\nLike EKOO - Expeditionary Kerbin Orbital, regarding Kerbin\u0027s orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nor such like Expeditionary Mun Orbital/Surface.\u003Cbr\u003E\nCan\u0027t remember much, but it was kinda like that.\u003Cbr\u003E\u003Cbr\u003E\nSo far, I only had done flybys/orbits to Dres (who?) and Mojo. So the naming stuff was quite limited from then on.\u003Cbr\u003E\nWas 1.0.5 with mods back then. Need to do a \u003Cem\u003Emostly-stock \u003C/em\u003Eone and get back into career shennanigans!\n\u003C/p\u003E\n\u003Cp\u003E\nI also wanted to use a bit of those classifications as in the real world with airplanes. IIRC, some digits meant the number of engines and whatnots.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-10T21:50:31Z\u0022 title=\u002202/10/2019 09:50  PM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 10, 2019\u003C/time\u003E by Spraki\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2019-02-11T06:13:51Z","Content":"\n\u003Cp\u003E\nSimple descriptive names.  Usually of the [Destination] [Function] [Craft Type] format.  For example, \u0022Mun Science Lander\u0022, or \u0022Duna Communication Satellite\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s very dry.  On rare occasions I might get a little more creative.  For example, I had a vessel that was designed to extract ore on the Mun.  It was propelled by a pair of Vector engines mounted on either side of it, and their high thrust and high gimble range caused the craft to \u0022wobble\u0022 a bit back and forth in flight as it kept correcting itself.  Because of this characteristic, I nicknamed it the \u0022Duck Driller\u0022, because it reminded me of how duck\u0027s look when they walk.\n\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2019-02-11T06:32:25Z","Content":"\n\u003Cp\u003E\nI was surprised to see there are so many people using abbreviated codes to designate a spacecraft\u0027s purpose. Kinda reads like part numbers, not that there\u0027s anything wrong with that. I can see it being very efficient for finding what you need, or knowing what a crafts capabilities are without having to try to remember, or having to actually look at the design.\n\u003C/p\u003E\n\u003Cp\u003E\nI used to name all craft after their purpose, like \u003Cstrong\u003EUnmanned Mun Lander 1\u003C/strong\u003E. I still do that for relays, like \u003Cstrong\u003EMinmus Relay 1\u003C/strong\u003E, since I always plan to have 3 orbiting every planet and moon.\n\u003C/p\u003E\n\u003Cp\u003E\nLately though I\u0027ve tried to get more creative and name spacecraft after plants and animals. Example:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EPolar Bear\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EIvy\u003C/strong\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERiver Willow\u003C/strong\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI also have an unmanned flyby-and-return vehicle appropriately named \u003Cstrong\u003EBoomerang\u003C/strong\u003E. The one I sent to Duna is named \u003Cstrong\u003EDunarang\u003C/strong\u003E \u003Cspan\u003E\u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHonestly I\u0027m not very creative when it comes to language, and it\u0027s actually really hard for me to name things in an artistic instead of purely pragmatic way. Same goes for rocket designs themselves. I see so many beautiful KSP creations on the forums and YouTube and think, \u0022why can\u0027t I do that?\u0022 I\u0027m usually building purely for efficiency and or practicality, so my ships are rather spartan. I\u0027m truly envious of people who seem to have a boundless well of artistic creativity.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-11T06:34:45Z\u0022 title=\u002202/11/2019 06:34  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 11, 2019\u003C/time\u003E by Xavven\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Roartal","CreatedById":194340,"CreatedDateTime":"2019-02-11T09:51:28Z","Content":"\n\u003Cp\u003E\nI have a very simple yet effective naming scheme:\n\u003C/p\u003E\n\u003Cp\u003E\n{\u003Cstrong\u003EAbbreviation of Agency\u003C/strong\u003E}{\u003Cstrong\u003E- Additional information\u003C/strong\u003E} \u002B {\u003Cstrong\u003E\u0022MEANINGFUL AND CREATIVE NAME\u0022\u003C/strong\u003E} \u002B \u003Cstrong\u003EIteration or random letter\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs you can see, the random and meaningful name of whatever agency I am playing as has a great impact on the naming of my spacecraft. There\u0027s also additional information added to the abbreviation, \u003Cstrong\u003EU \u003C/strong\u003Estands for Unmanned, \u003Cstrong\u003EC \u003C/strong\u003Estands for Crewed and so on.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the examples below, I am roleplaying as the \u0022Tree Planting Society\u0022, a company that keeps an eye on the environment and focuses on reusable rockets.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nTP-U \u0022Munissima\u0022 V (Unmanned probe, probably headed to the Mun)\n\u003C/li\u003E\n\u003Cli\u003E\nTP-C \u0022Orion\u0022 X (Crewed vessel)\n\u003C/li\u003E\n\u003Cli\u003E\nTP-U \u0022Butan\u0022 Z (Unmanned probe)\n\u003C/li\u003E\n\u003Cli\u003E\nTP-R \u0022Buckshot\u0022 II (Unmanned rescue vessel, carries multiple capsules, thus called \u0022Buckshot\u0022)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI usually waste a ton of time coming up with purely artistic names for my vessels, it\u0027s part of the experience to have proper names for the ships and their mission. This creative naming process combined with practical and aesthetically pleasing naming schemes is wonderful. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"bigcalm","CreatedById":143587,"CreatedDateTime":"2019-02-11T10:46:53Z","Content":"\n\u003Cp\u003E\nFor me, unique vessels get a unique name (\u0022Tylo Lander\u0022) but vessels that have similar functions get a particular class / naming scheme, though they\u0027re not identical - it\u0027s more about function than form...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESatellite Network\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n--  Named after Football Grounds.\n\u003C/p\u003E\n\u003Cp\u003E\n-- Examples: Stamford Bridge, Highbury, Moss Rose\n\u003C/p\u003E\n\u003Cp\u003E\n-- \n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EVessel consisting of 3-5 probes, all of which have their own propulsion, a large satellite dish and various ScanSat equipment. Designed to establish a communications network around a body\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ERover Bus\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-- Named after Chordates\n\u003C/p\u003E\n\u003Cp\u003E\n-- Examples:  Kangaroo, Turtle, Gecko\n\u003C/p\u003E\n\u003Cp\u003E\n-- \n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EVessel consisting of 2-4 rovers all with their own fuel ready to land on a particular body  Some theming - marsupials for Duna; Amphibians for Laythe, etc.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E\u003Cstrong\u003EBase\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- \u003C/span\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EFemale Scientists\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- Examples:  Ida Noddack, Emmy Noether, Lynn Margulis\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:13.3333px;\u0022\u003E-- \u003C/span\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003ESurface base designed with good habitation and facilities to keep Kerbals supplied and in good health. Often sent in tandem with other vessels (manufacturing,refinery,inflatables,launchpad)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E\u003Cstrong\u003EEV-24\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- Dog and Cat breeds.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- Examples:  Alsatian, Persian, Corgi\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- \u003C/span\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EShort for \u0022Eternal Voyager\u0022, all EV-class vessels have an on-board \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, can land, and have ore capacity. This variant seats two and has wheels and can be used as a rover if necessary\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEV-25\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-- Bands\n\u003C/p\u003E\n\u003Cp\u003E\n-- Examples:  Oasis, Destiny\u0027s Child, Scissor Sisters\n\u003C/p\u003E\n\u003Cp\u003E\n-- \n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E-lander with crew capacity of 8, serves to ferry crews from surface to orbit and vice-versa\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E\u003Cstrong\u003ECrew Transport\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-- Mathematicians\n\u003C/p\u003E\n\u003Cp\u003E\n-- Examples:  Leonard Euler, Eratosthenes, Omar Khayyam\n\u003C/p\u003E\n\u003Cp\u003E\n-- \n\u003Cspan style=\u0022font-size:10pt;\u0022\u003ETransit vessel that gives good habitation ratings to kerbals whilst on their journey.  Some theming - Greek for Duna, Calculus-related for Jool, etc.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10pt;\u0022\u003EReturner\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-- Footballers\n\u003C/p\u003E\n\u003Cp\u003E\n-- Examples: Lionel Messi, Divock Origi, Gareth Bale.\n\u003C/p\u003E\n\u003Cp\u003E\n-- \n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EA returner is designed to complete the \u0022worlds first\u0022 requirement of having a vessel land on the surface and return to Kerbin, normally by detaching a landing portion, having it land, rendezvous back with the parent and then ditch almost all of it for the return\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10pt;\u0022\u003EMun Tourist\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-- \n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EShakespeare plays or quotations\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- Examples:  As you like it, Henry VI, Comedy of Errors.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- \u003C/span\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EVessel designed to land 4-10 tourists on either the Mun or Minmus for contract purposes\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E\u003Cstrong\u003ESun Peeker\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-- \n\u003Cspan style=\u0022font-size:10pt;\u0022\u003ETerry Pratchett books\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- Examples: Feet of Clay, Good Omens, Monstrous Regiment\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003E-- \u003C/span\u003E\n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EDesigned to peek out of Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and return immediately, seats six tourists.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10pt;\u0022\u003EEve Landers\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-- Classical Music\n\u003C/p\u003E\n\u003Cp\u003E\n-- Examples:  Ritt der Walkuren, Ruslan and Lyudmilla, Zadok the Priest\n\u003C/p\u003E\n\u003Cp\u003E\n-- \n\u003Cspan style=\u0022font-size:10pt;\u0022\u003EDesigned to reach and return from the surface of Eve\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003C/p\u003E\n"}]}