{"TopicId":18260,"ForumId":32,"TopicTitle":"Engines on top of craft... Handling Issues!","CreatedByName":"Carthaginian","CreatedById":40635,"CreatedDateTime":"2012-08-31T07:43:07Z","PageNum":1,"Articles":[{"CreatedByName":"Carthaginian","CreatedById":40635,"CreatedDateTime":"2012-08-31T07:43:07Z","Content":"\n\u003Cp\u003EOk, I intended to build a ship to drop off a hab base on the Mun.\u003C/p\u003E\u003Cp\u003EI put an underslung hab module with top-mounted engines and fuel tanks.\u003C/p\u003E\u003Cp\u003EIs this a recipe for a bad-handling ship?\u003C/p\u003E\u003Cp\u003EWill post some pics in the morning... maybe the ship file as well.\u003C/p\u003E\n"},{"CreatedByName":"AD-Edge","CreatedById":1045,"CreatedDateTime":"2012-08-31T07:46:42Z","Content":"\n\u003Cp\u003EWhy not just try it...?\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2012-08-31T09:59:33Z","Content":"\n\u003Cp\u003EYes, absolutely. If your point of thrust is not on plane with your center of gravity, your ship will tumble end over end in space. Sucks I know :/ I had to scrap so many designs because of it. Star trek-like designs don\u0027t work sadly. Either move the thrust colser to the center, or add a counterweight!\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2012-08-31T16:01:51Z","Content":"\n\u003Cp\u003EFor some reason it works for me though. Check the kuriosity rover in my sig. I landed without testing any component.\u003C/p\u003E\n"},{"CreatedByName":"Carthaginian","CreatedById":40635,"CreatedDateTime":"2012-08-31T16:44:52Z","Content":"\n\u003Cp\u003ENot working on anything Trek-like... think more like a giant version of the Saturn V\u0027s escape tower. Thrust is \u0027on plane\u0027 with the center of gravity- just using radial engines arrayed around the rocket rather than a single engine behind it.\u003C/p\u003E\u003Cp\u003EHere\u0027s the CRAFT file if anyone would like to give me any advice on how to land her.\u003C/p\u003E\u003Cp\u003E[ATTACH]32267[/ATTACH]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-31T17:05:43Z\u0022 title=\u002208/31/2012 05:05  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 31, 2012\u003C/time\u003E by Carthaginian\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2012-08-31T17:08:42Z","Content":"\n\u003Cp\u003EOH you mean like a skycrane? Then no, it is not. Making sure thrust is adequate and symmetrical should do the trick. Cannot work on any craft files but it should fly fine. DonÃ‚Â´t forget RCS!\u003C/p\u003E\n"},{"CreatedByName":"Carthaginian","CreatedById":40635,"CreatedDateTime":"2012-08-31T18:02:09Z","Content":"\n\u003Cp\u003EI kill myself every time that I use RCS.\u003C/p\u003E\u003Cp\u003EMy problem with this design is when I try to use SCS (currently near the ship\u0027s CoG) at a low altitude, instead of steadying me, it flips the ship end over end!!! I\u0027m 10,000m over the Mun with a ship that randomly starts tumbling out of control, and three Kerbanauts screaming their heads off. There isn\u0027t any time to correct. This happens whether \u0027fine\u0027 or \u0027gross\u0027 controls engaged, and only occurs above \u002B/-33% thrust.\u003C/p\u003E\n"}]}