{"TopicId":183551,"ForumId":32,"TopicTitle":"RAPIER engine drag in 1.6.1, with tailcone attachments","CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2019-04-09T07:05:23Z","PageNum":1,"Articles":[{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2019-04-09T07:05:24Z","Content":"\n\u003Cp\u003E\nThe RAPIER engine is unique among jets, as many of us have found when building SSTOs.  It has an attachment node on the back, like most rocket engine parts, but unlike any other air-breathing engine.  The way KSP\u0027s aerodynamic drag model works this node, when left open, is meant to look like a draggy, untapered, flat plate.  With vertically launched rockets, that\u0027s no big deal - you get out of the atmosphere quickly enough that the drag hardly matters.  Problem is, spaceplanes flying single-stage-to-orbit spend a LOT of time cruising at high speed, suffering from this drag that doesn\u0027t afflict any other jet engine.  Since the long-long-ago, many have found that placing a reversed nosecone on that node (essentially giving the engine a smooth tapered profile) and clipping it forward into the engine, so it doesn\u0027t block the exhaust, brings the total drag down to a level similar to the other jets.\n\u003C/p\u003E\n\u003Cp\u003E\nIs this an exercise in splitting hairs on an already-overpowered part?  Perhaps.  But sometimes the building and tuning of an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E (particularly efficient, underpowered ones) can be a delicate thing, and drag reduction always helps.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway I got curious to look at this drag with a variety of possible rear attachments.  So I built a \u003Ca href=\u0022https://kerbalx.com/fourfa/Rapier-tailcone-test-2\u0022 rel=\u0022external nofollow\u0022\u003E120 ton spaceplane\u003C/a\u003E with seven pairs of RAPIERs, each with a different tailcone, capable of lifting an 36T orange tank to orbit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iMVfmi4.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/iMVfmi4.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n  Typical flight pattern for a powerful, heavy, inefficient \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E - constant steep trajectory (15 degrees, any less and it\u0027ll burn up) until flameout, then follow prograde on rocket mode until 100km apoapsis, then circularize and deploy:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ma8BRkc.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/ma8BRkc.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn the way up I monitored and screenshotted the aerodynamic drag of all engines and tailcone parts (Alt-F12 -\u0026gt; Physics -\u0026gt; Aero -\u0026gt; Display Aero Data in Action Menus):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jOuoxeO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/jOuoxeO.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nthen plotted the total drag of each combination through the whole trajectory to space (in logspace to amplify the differences):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KYt8jXp.png\u0022 class=\u0022ipsImage\u0022 height=\u0022632\u0022 src=\u0022https://i.imgur.com/KYt8jXp.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTested options were: bare RAPIER, RAPIER with a small 0.625m nose cone directly on the 1.25m rear node, small nose cone with A10 structural adaptor, circular jet intake, aerodynamic nose cone, advanced nose cone A, and shock cone.  As you\u0027d expect, peak drag occurs at transonic speeds (approaching Mach 1) then declines.  The shape of the curve is plotted against speed directly, though really the drag number reflects both \u003Ca href=\u0022https://en.wikipedia.org/wiki/Dynamic_pressure\u0022 rel=\u0022external nofollow\u0022\u003Espeed and density\u003C/a\u003E.  The downward knee in the curve at Mach 4.5 is where jets flame out and switch to rocket mode, then the massive power of 14 RAPIERs pushes the craft into less dense air very quickly.  The final small uptick in drag happens when setting apoapsis, having reached orbital velocity while still in atmo before MECO and coast to apo.\n\u003C/p\u003E\n\u003Cp\u003E\nNevertheless, the interesting result is the differences between these curves.  The bare RAPIER obviously has considerably more drag: all of these tailcones are effective.  There are some unexpected reversals - for instance, the small nose cone does poorly in the initial climb out but is one of the best performers at high speed and high altitude.  Then the small nose cone with the A10 adaptor starts out good, becomes the worst combination at Mach 3, the best at Mach 4, then second worst at high speed.  The shock cone and circular intake perform very well.  The plain nose cone outperforms the advanced nose cone.\n\u003C/p\u003E\n\u003Cp\u003E\nNone of this takes into account the mass of the parts.  Whether that matters to you will be highly dependent on the craft in question; with this 156T sledgehammer it matters not at all.  On an efficiency-challenge nuclear-powered SSTA, it really might.  The plain nose cone and circular intake do very well for their mass (and cost); the point of the shock cone sticking out in the back undeniably looks the coolest \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E.  \u003C/span\u003EThe others are probably better avoided.\n\u003C/p\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2019-04-09T10:05:31Z","Content":"\n\u003Cp\u003E\nThank you for this. I\u0027ve been sticking with the nosecones based on some anecdotal information, good to have confirmation that this is still the case.\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2019-04-10T20:10:57Z","Content":"\n\u003Cp\u003E\nReally this brings to light the major issues with the drag cube system regarding engines, and the discrepancies between them (or rather, the issue with basing drag on attach nodes at all; it should be entirely geometry based, nodes shouldn\u0027t figure into it).  Sadly, it really just makes me want to start putting nosecones on the back end of my rockets\u0027 engines as well....\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2019-04-10T21:50:35Z","Content":"\n\u003Cp\u003E\nThe drag isn\u0027t caused by the empty attach node on the back of the engine. It is caused by that engine\u0027s drag cube, which reflects the very flat surface on the back of that engine. If you look at most of the other jet engines they are tapered more like a cone in the back, and their drag cube values reflect that. There is one other engine, the Whiplash, which has a relatively flat back and a relatively high drag coefficient on its back end, I would guess that one also generates excess drag, though not as much as the Rapier. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to test this you can just delete the attach node at the back of the Rapier (node_stack_bottom in the config), and compare its drag to the standard version with nothing attached.\n\u003C/p\u003E\n\u003Cp\u003E\nPutting a nose cone on the back of the Rapier just blocks the drag on the back of the Rapier and instead presents a nose cone, which is similarly shaped to other engines, to the airstream.\n\u003C/p\u003E\n\u003Cp\u003E\nMore on drag in the spoiler:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nRapier drag cube, the drag on the \u0022back\u0022 of the engine is reflected by the bold values, the middle value in particular, 0.7808, the drag coefficient, is probably the biggest driver of excess drag for this part:\n\u003C/p\u003E\n\u003Cp\u003E\ncube = Default, 1.495,0.7777,0.7375, 1.495,0.7777,0.7375, 1.304,0.9318,1.384,\u003Cstrong\u003E 1.304,0.7808,0.7056,\u003C/strong\u003E 1.499,0.7745,0.738, 1.499,0.7754,0.9021, -7.272E-05,0.3494,0.0002167, 1.292,1.184,1.294\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the drag cube for the Panther, which has a much more tapered back side, its corresponding drag coefficient value is much lower than the Rapier\u0027s, even though the surface area (the first bolded value) is similar :\n\u003C/p\u003E\n\u003Cp\u003E\ncube = Default, 1.661,0.7782,0.7165, 1.661,0.7782,0.7165, 1.218,0.9522,0.163, \u003Cstrong\u003E1.218,0.45,1.493\u003C/strong\u003E, 1.661,0.7778,0.7165, 1.661,0.7786,0.7165, -2.384E-07,-0.6688,2.384E-07, 1.25,1.463,1.25\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe only way to really fix this is for Squad to stop relying on automatically generated drag cubes for almost all of their parts. Engines could be massaged to reduced this tail-end drag (and to fix a number of issues caused by engine variants). And a number of parts are out-right bugged (structural tubes) because they don\u0027t have their drag cubes setup right.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-10T22:01:29Z\u0022 title=\u002204/10/2019 10:01  PM\u0022 data-short=\u00225 yr\u0022\u003EApril 10, 2019\u003C/time\u003E by DMagic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2019-04-10T21:54:01Z","Content":"\n\u003Cp\u003E\nI feel like KSP needs a kind of \u0022aerodynamic shroud\u0022 attachment for sticking on the rear of engines that\u0027ll let the exhaust breath through while providing some straking that will break up the air and make less of an induced vortex behind attachable engines like this.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, it might look good as an aesthetic feature on some rocket designs.\n\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2019-04-10T22:00:51Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133397-fearless-son/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133397\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133397-fearless-son/\u0022 rel=\u0022\u0022\u003E@Fearless Son\u003C/a\u003E Kind of like these things:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022trailertail_oragami.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022293\u0022 src=\u0022http://www.stemco.com/qadmin/js/kcfinder/upload/images/trailertail_oragami.jpg\u0022 width=\u0022670\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022stemco-trailertail-airflow.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022364\u0022 src=\u0022http://www.stemco.com/qadmin/js/kcfinder/upload/images/stemco-trailertail-airflow.jpg\u0022 width=\u0022676\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fraston","CreatedById":188565,"CreatedDateTime":"2019-04-11T13:56:12Z","Content":"\n\u003Cp\u003E\nCan’t help you now, 1.7 is out \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn all seriousness, it could be fixed by switching to 1.7.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-11T13:56:58Z\u0022 title=\u002204/11/2019 01:56  PM\u0022 data-short=\u00225 yr\u0022\u003EApril 11, 2019\u003C/time\u003E by Fraston\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2019-04-11T17:42:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223580088\u0022 data-ipsquote-contentid=\u0022183551\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221554933651\u0022 data-ipsquote-userid=\u002257416\u0022 data-ipsquote-username=\u0022DMagic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, DMagic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133397-fearless-son/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133397\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133397-fearless-son/\u0022 rel=\u0022\u0022\u003E@Fearless Son\u003C/a\u003E Kind of like these things:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022trailertail_oragami.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022293\u0022 src=\u0022http://www.stemco.com/qadmin/js/kcfinder/upload/images/trailertail_oragami.jpg\u0022 width=\u0022670\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLegitimately, yes.  I can think of other uses for them too.  Imagine a mk 1 passenger module that still has it\u0027s rear hatch accessible without causing a ton of drag.  Heck, give it some variable geometry articulation and you can make it a small control surface or airbrake by changing how the edges of it are inclined.  \n\u003C/p\u003E\n\u003Cp\u003E\nWould be good for non-gimbling boosters on ascent vehicles too.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-11T17:42:56Z\u0022 title=\u002204/11/2019 05:42  PM\u0022 data-short=\u00225 yr\u0022\u003EApril 11, 2019\u003C/time\u003E by Fearless Son\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2019-04-12T08:14:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223580582\u0022 data-ipsquote-contentid=\u0022183551\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221554990972\u0022 data-ipsquote-userid=\u0022188565\u0022 data-ipsquote-username=\u0022Fraston\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Fraston said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn all seriousness, it could be fixed by switching to 1.7.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow so?\n\u003C/p\u003E\n"},{"CreatedByName":"Aeroboi","CreatedById":186653,"CreatedDateTime":"2019-04-12T11:23:44Z","Content":"\n\u003Cp\u003E\nI\u0027m not to fond of this technique due to it having very little savings. IMO the reversed nosecone trick has a effect in practice beyond a graph but it is incredibly negligible and only offers any benefit in terms of drag reduction if the space plane has draggy outer parts to begin with. It is much more effective to change your wing incidence by 1 degree so that your nose is directly through the velocity reticle and you gain much more effect.\u003Cbr\u003E\u003Cbr\u003E\nThere\u0027s a general consensus that the weight limit per rapier to push a vessel into orbit is 20 Ton\u0027s per rapier, with the expected higher limit is in the area of 25 Tons.\u003Cbr\u003E\nThis is false. While it requires many optimizations I found out that I could do \u003Cstrong\u003E\u003Cu\u003E37.4 Tons per Rapier\u003C/u\u003E\u003C/strong\u003E and probably more using more wings.\n\u003C/p\u003E\n\u003Cp\u003E\nThis vessel has \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E with \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E\u0027s (to visit Jool and Eeloo) with 7700m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E with \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E only tanks and can reach moho\u0027s surface from Kerbin albeit with a good launch window and a Eve assist. It Weighs almost 75 Tons.\u003Cbr\u003E\nI share the following vessel because it has \u003Cstrong\u003Ejust\u003C/strong\u003E enough thrust to stay above sea level after exiting the runway during takeoff using the LV-N as assist. However, it is so aerodynamic that it can get past 400m/s while climbing at 4 degrees when above 300m/s.\u003Cbr\u003E\u003Cbr\u003E\nThe reversed nosecone trick would cut the total \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E budget (regardless of how low weight it is \u0022and 2 extra parts\u0022) so I couldn\u0027t be bothered. To reiterate another way, the reversed nosecone trick would deduce the \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E budget while not requiring the trick in any case because the takeoff thrust is just barely high enough not to sink into the sea after liftoff. Mind you that I have optimized the craft completely and can reach Minmus with 3/5 Tank in which case it can race to orbit whereby the nosecone has even less effect. That\u0027s less reason to bother.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bwn0Yun.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022428\u0022 src=\u0022https://i.imgur.com/bwn0Yun.jpg\u0022 width=\u00221024\u0022\u003E\u003Cimg alt=\u0022wZnJkWJ.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022428\u0022 src=\u0022https://i.imgur.com/wZnJkWJ.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221wOzpFu.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022428\u0022 src=\u0022https://i.imgur.com/1wOzpFu.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI only wanted to share this so people understand that the reversed nosecone trick isn\u0027t always a added benefit. I only use it when a nearly capable vessel fails to accelerate past Mach 1.20. If I try to optimize a craft for drag it never fails to do so, and when it is a interplanetary \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E/SSTA the nosecone cripples the budget, albeit marginally.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-04-12T11:25:32Z\u0022 title=\u002204/12/2019 11:25  AM\u0022 data-short=\u00225 yr\u0022\u003EApril 12, 2019\u003C/time\u003E by Aeroboi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"IronMaiden","CreatedById":193062,"CreatedDateTime":"2019-05-02T04:58:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223581445\u0022 data-ipsquote-contentid=\u0022183551\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221555068224\u0022 data-ipsquote-userid=\u0022186653\u0022 data-ipsquote-username=\u0022Aeroboi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/12/2019 at 4:23 AM, Aeroboi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere\u0027s a general consensus that the weight limit per rapier to push a vessel into orbit is 20 Ton\u0027s per rapier, with the expected higher limit is in the area of 25 Tons.\u003Cbr\u003E\nThis is false. While it requires many optimizations I found out that I could do \u003Cstrong\u003E\u003Cu\u003E37.4 Tons per Rapier\u003C/u\u003E\u003C/strong\u003E and probably more using more wings.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve found the optimal mass to be 30-35t per RAPIER depending on the design, more mass would require substantially more liquid fuel during the open cycle ascent phase, with the maximum mass around 50t per RAPIER, but by then it\u0027s way past the point where it\u0027s more efficient to have 2 RAPIERs.\n\u003C/p\u003E\n"},{"CreatedByName":"Aeroboi","CreatedById":186653,"CreatedDateTime":"2019-05-02T06:50:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223592116\u0022 data-ipsquote-contentid=\u0022183551\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221556773126\u0022 data-ipsquote-userid=\u0022193062\u0022 data-ipsquote-username=\u0022IronMaiden\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, IronMaiden said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve found the optimal mass to be 30-35t per RAPIER depending on the design, more mass would require substantially more liquid fuel during the open cycle ascent phase, with the maximum mass around 50t per RAPIER, but by then it\u0027s way past the point where it\u0027s more efficient to have 2 RAPIERs.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n50Ton\u0027s wow, I think I could do that. Such planes would have substantially more wings i\u0027d presume, eventually you\u0027ll be adding so much wing\u0027s that another rapier is similarly in weight.\n\u003C/p\u003E\n"}]}