{"TopicId":185858,"ForumId":32,"TopicTitle":"How the Hec do XBox/PS4 players even play this game ?","CreatedByName":"Gavin786","CreatedById":196260,"CreatedDateTime":"2019-06-27T09:02:20Z","PageNum":1,"Articles":[{"CreatedByName":"Gavin786","CreatedById":196260,"CreatedDateTime":"2019-06-27T09:02:21Z","Content":"\n\u003Cp\u003E\nMods are not allowed on the console version of this game.\n\u003C/p\u003E\n\u003Cp\u003E\nI do not know how it is possible to get even past the most basic level of design and flight without some essential features which are not in stock.\n\u003C/p\u003E\n\u003Cp\u003E\nMost glaring one is the ability to test a craft by moving it directly to any orbit or position.\n\u003C/p\u003E\n\u003Cp\u003E\nLet us take for example a lander for Mun.  Without this mod, every time the designer wishes to test an iteration of the design, it has to be packed onto a rocket, then flown to Mun, then deployed and tested.  Does this not drive one nuts ?\n\u003C/p\u003E\n\u003Cp\u003E\nQuality craft just cant be created with this method of having to fly to Mun every time.  Small refinements cant be readily made and tested, every time there is a full commitment to flying out there be it sandbox or career mode it matters not, it must be a terrible ball ache for those who are not members of the PC Master Race.\n\u003C/p\u003E\n\u003Cp\u003E\nNot being able to test a craft in the proper environment it was designed to operate in is a huge handicap.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat about in-flight information, quickly see one\u0027s apoapsis and periapsis, the time to both, how much deltav a manouver node will use, horizontal and vertical velocities, and a myriad of other essential information all need Kerbal Engineer(or some other tool).\n\u003C/p\u003E\n\u003Cp\u003E\nLearning to land on Mun is not so easy on its own and certainly took me a few tries just to learn the skill, even though I split the manouver into 3 parts and was able to independently learn each one, suicide/landing burn, surface landing, and takeoff/reorbit.  And that is AFTER I had to redesign the craft a few times so it could even land, not to mention the phase next of optimising performance..\n\u003C/p\u003E\n\u003Cp\u003E\nEssential tools like Kerbal Engineer, calculations of \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E on various bodies.  Thankfully DeltaV is stock now.  Any type of precise adjustments to manouever nodes or parts in editor needs a 3rd party tool.  \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E build aid, another great tool if you actually want your ship to be controllable on \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a system whereby I categorize mods. \u0022White\u0022 mods are what I restrict myself to.\n\u003C/p\u003E\n\u003Cp\u003E\nWhite mods are informational or assist in the use of core functionality.  They never do anything that would not allow a craft to fly and have full function in stock.  Nor do they fundamentally alter gameplay by providing functions to automatically perform any flight operations which must be done manually in stock.  Temporary parts or functions which allow testing of vehicles before they are deployed such as the move anywhere and NRAP test weights are included in my category as long as the line of not using these when in career mode on any deployed vehicle is adhered to(they are for design and testing purposes only).\n\u003C/p\u003E\n\u003Cp\u003E\nSo I am discussing here mods which only augment core functionality/assist stock ship design, tools that by any sensible thinking really AUGHT to be in the stock game.  I just dont know how people can build, test and fly without these things.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously there are exceptions and certain specific craft and categories can be built and deployed out of the box and there are certain exceptional people also who have internalized into their subconscious a lot of what is needed to build these things and can do it with pure intuition, but some people just need to see the numbers.\n\u003C/p\u003E\n\u003Cp\u003E\nGavin786\n\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2019-06-27T09:36:53Z","Content":"\n\u003Cp\u003E\nOther than Scatterer \u0026amp; other audio/graphics mods I used to use, I have not really used any mods since .24 or thereabouts. I like trial and error as well and don\u0027t spend any time crunching numbers, I even used to ruffle feathers around here by being firmly against adding \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E calculators to the base game. Mods are not in any way needed to enjoy playing this game.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-27T09:50:27Z\u0022 title=\u002206/27/2019 09:50  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 27, 2019\u003C/time\u003E by r4pt0r\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Loskene","CreatedById":141778,"CreatedDateTime":"2019-06-27T10:18:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625951\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561626141\u0022 data-ipsquote-userid=\u0022196260\u0022 data-ipsquote-username=\u0022Gavin786\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Gavin786 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI just dont know how people can build, test and fly without these things.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell there\u0027s yer problem...\n\u003C/p\u003E\n"},{"CreatedByName":"Gavin786","CreatedById":196260,"CreatedDateTime":"2019-06-27T10:23:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625968\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561630697\u0022 data-ipsquote-userid=\u0022141778\u0022 data-ipsquote-username=\u0022Loskene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Loskene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell there\u0027s yer problem...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell put your money where your mouth is.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is your solution to problem of building landers without being able to readily test them ?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625958\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561628213\u0022 data-ipsquote-userid=\u002290471\u0022 data-ipsquote-username=\u0022r4pt0r\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, r4pt0r said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOther than Scatterer \u0026amp; other audio/graphics mods I used to use, I have not really used any mods since .24 or thereabouts. I like trial and error as well and don\u0027t spend any time crunching numbers, I even used to ruffle feathers around here by being firmly against adding \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E calculators to the base game. Mods are not in any way needed to enjoy playing this game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNext guy who is building the bridge you are about to drive across - lets hope he didn\u0027t have the same design philosophy.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-06-27T10:31:29Z","Content":"\n\u003Cp\u003E\nConsole doesn’t have the cheat menu? Well that’s a bummer. Yer, you kinda need that for testing. If you have to launch and send something to say Jool the long way just to test it, iteration would be pretty time consuming.\n\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2019-06-27T10:33:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625970\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561631038\u0022 data-ipsquote-userid=\u0022196260\u0022 data-ipsquote-username=\u0022Gavin786\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, Gavin786 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNext guy who is building the bridge you are about to drive across - lets hope he didn\u0027t have the same design philosophy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I\u0027ll leave the number crunching to him. But if I am playing a bridge building game I will happily enjoy trial and error game-play. Elitism isn\u0027t needed in either to be enjoyed. Just because you can compute some numbers in a game doesn\u0027t mean its the only way to have fun.\n\u003C/p\u003E\n"},{"CreatedByName":"Loskene","CreatedById":141778,"CreatedDateTime":"2019-06-27T10:40:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625970\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561631038\u0022 data-ipsquote-userid=\u0022196260\u0022 data-ipsquote-username=\u0022Gavin786\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, Gavin786 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell put your money where your mouth is.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is your solution to problem of building landers without being able to readily test them ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou said you don\u0027t know how to do that. Other people do.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m one for supporting adding mods to the base game in order to make testing \u003Cem\u003Eeasier \u003C/em\u003E(I even want the MH mission editor made available in career games for exactly this), but if you think it\u0027s impossible or prohibitively difficult without them right now... nah mate. That\u0027s on you. The rest of us figured out the rules of the game by playing until we ran into their limits.\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2019-06-27T10:41:32Z","Content":"\n\u003Cp\u003E\nI would wager most console players fall into the casual category and thus rarely go further than Kerbins moons.\n\u003C/p\u003E\n\u003Cp\u003E\nTrial and error is fine for that sort of gameplay.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyone who gets serious about KSP will likely want to move over to the PC.\n\u003C/p\u003E\n"},{"CreatedByName":"mikey117","CreatedById":169509,"CreatedDateTime":"2019-06-27T10:59:32Z","Content":"\n\u003Cp\u003E\nWell i personally  do a lot out side Kerbins \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. I\u0027ve been to Duna and eve multiple times. Atm I am designing a flotilla of craft  to head to the jool system.\n\u003C/p\u003E\n\u003Cp\u003E\nYeah I can vouch for the nightmare of having to manually fly test runs to destination orbits.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the way I go about It, means I generally only need one test flight to any given body before launching. I usually do a test flight with heaviest payload then I use the same transfer stage to other craft to be sent. Whereby I just make sure all payloads are less mass than the one tested.(ie. Relay payload,lander payload,return craft etc)\n\u003C/p\u003E\n\u003Cp\u003E\nHowever this is very time consuming and frustrating. I\u0027m really hoping we can get the delta v calculator soon as this will take a lot of the guesswork away and mean more time actually flying missions rather than being In the simulator.(That\u0027s what I\u0027ll pretend these test flight are lol)\n\u003C/p\u003E\n"},{"CreatedByName":"Dafni","CreatedById":149636,"CreatedDateTime":"2019-06-27T11:42:53Z","Content":"\n\u003Cp\u003E\nOh, I never knew the console version doesn\u0027t have the f12 cheat menu available. Is there a reason for this? I hope there is, otherwise they should at least get the cheat menu too.\n\u003C/p\u003E\n\u003Cp\u003E\nMods is a different story, of course, with all the licensing stuff etc. But personally I probably would have quit KSP by now if it weren\u0027t for the amazing mods we have. I can and will play fully stock from time to time, but the long term entertainment definitely comes from all the mods and different game play experiences they bring to the table.\n\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2019-06-27T12:15:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625951\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561626141\u0022 data-ipsquote-userid=\u0022196260\u0022 data-ipsquote-username=\u0022Gavin786\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Gavin786 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMods are not allowed on the console version of this game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou could have stopped there.\n\u003C/p\u003E\n"},{"CreatedByName":"Cruss","CreatedById":194533,"CreatedDateTime":"2019-06-27T12:21:27Z","Content":"\n\u003Cp\u003E\nHah, it\u0027s just tedious on a console. But if i had acces to mods I\u0027d be making the same stuff pc players can and do make. \n\u003C/p\u003E\n\u003Cp\u003E\nI usually stop pursuing an idea because of lag. As in my ps4 did not like a quad heli carrier. In fact it did not even like a small scale heli carrier. \n\u003C/p\u003E\n\u003Cp\u003E\nBut for what it\u0027s worth, i\u0027ve made things ranging from 1100-1400kn thrust turboprops, all kinds of \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u0027s, \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003Evtol\u003C/abbr\u003E hinge systems and real life shuttle and apollo replica\u0027s. You can do most things a pc player can too, and it does not always take considerably more effort. \n\u003C/p\u003E\n\u003Cp\u003E\nI never calculate delta v for any of my craft. I trial and error until I have something that works. I\u0027ve played so much that i do have a pretty good idea what does and what does not work.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re miniaturizing and seek to do missions with perfect accuracy and only the exact bare minimum fuel, then no that is not really possible. You can get very close though, even more so with a bit of math. \n\u003C/p\u003E\n\u003Cp\u003E\nI think it\u0027s a very playable game but it takes quite some time to get used to the controls and even then, there is no proper system for making small changes. The controller deadzones and response curves feel less than optimal at times and make a great deal up of my frustrations with ksp. ( i use a nacon pro rev 2 so I can adjust that which is pretty useless given current possibilities).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: console DOES have a debug menu and it can be a blessing lol\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-27T12:22:29Z\u0022 title=\u002206/27/2019 12:22  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 27, 2019\u003C/time\u003E by Cruss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tonka Crash","CreatedById":189552,"CreatedDateTime":"2019-06-27T12:21:28Z","Content":"\n\u003Cp\u003E\nI originally bought KSP for the Xbox just over a year ago. I hadn\u0027t gamed on PC for over a decade. I thought the game was interesting but the gui was not intuitive with the controller. I went looking for tips, found that it was reviewed as a mediocre port from a much better PC game. Tried the PC version on my 5 year old laptop, then bought a new PC. My Xbox hasn\u0027t been turned on since.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-27T12:23:25Z\u0022 title=\u002206/27/2019 12:23  PM\u0022 data-short=\u00225 yr\u0022\u003EJune 27, 2019\u003C/time\u003E by Tonka Crash\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SecondChance","CreatedById":196731,"CreatedDateTime":"2019-06-27T12:23:25Z","Content":"\n\u003Cp\u003E\nConsole player here, never played on PC so never spoiled by mods \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWe can use the cheat menu if we want to disable trophies permanently.\n\u003C/p\u003E\n\u003Cp\u003E\nI have played over 400 hours on console and visited every planet/ moon. I Generally eyeball my designs and tend to send multiple launches in one transfer window.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sure  its easier with mods on PC but KSP IMO is meant to be tough and learning from past mistakes, I feel, is core to the experience.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso we now have the mun launch site if we want to test our landers.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2019-06-27T12:46:07Z","Content":"\n\u003Cp\u003E\nI\u0027m a PC player but play without mods. I had landed and returned manned and collected almost all science from every planet and moon before they had biomes, circa version 0.24. I did it using a delta-v calculating spreadsheet in Excel. I imagine if I played console I\u0027d have my laptop next to me to run Excel. \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E would have been more convenient, and since 1.6 I\u0027ve ditched my spreadsheet now that \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E calculation is stock.\n\u003C/p\u003E\n\u003Cp\u003E\nI will say that it added a lot more tension landing and returning from planets, not be able to hyperedit them first to test or \u0022simulate\u0022. For me, I have to design something that would \u003Cem\u003Etheoretically \u003C/em\u003Ework, and then put in the time and effort to get it there and back. I usually test using unmanned probes first so that I don\u0027t put Kerbals at risk, and then if it works, come back for the real deal manned. My first Tylo landing and Eve return were both extremely intense because of that factor of the unknown, and it made success that much sweeter.\n\u003C/p\u003E\n\u003Cp\u003E\nI realize this playstyle isn\u0027t for everybody. I guess the point of my post is that different players enjoy this game differently. There isn\u0027t a \u0022correct way\u0022 to play this game.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2019-06-27T13:45:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625951\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561626141\u0022 data-ipsquote-userid=\u0022196260\u0022 data-ipsquote-username=\u0022Gavin786\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Gavin786 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMods are not allowed on the console version of this game.\n\u003C/p\u003E\n\u003Cp\u003E\nI do not know how it is possible to get even past the most basic level of design and flight without some essential features which are not in stock.\n\u003C/p\u003E\n\u003Cp\u003E\nMost glaring one is the ability to test a craft by moving it directly to any orbit or position.\n\u003C/p\u003E\n\u003Cp\u003E\nLet us take for example a lander for Mun.  Without this mod, every time the designer wishes to test an iteration of the design, it has to be packed onto a rocket, then flown to Mun, then deployed and tested.  Does this not drive one nuts ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI bet if the mods weren\u0027t there, you wouldn\u0027t touch this game with a three meter long stick.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, I tell you one thing - you can test BOTH a lifter AND a lander, how they fly, how they act in orbit, if they have enough \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E to do their job, how the lander performs in low gravity after it\u0027s hopefully successfully carried all the way to the Mun. \n\u003C/p\u003E\n\u003Cp\u003E\nWhy would I cheat a lander (I didn\u0027t know NASA had alt\u002BF12 menu for their Apollo program) and then put it on top of a untested rocket, only to realize that it actually can\u0027t go to space?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E stats are most likely on their way to console, so it might be even easier, but you can\u0027t tell me it\u0027s not possible now.\n\u003C/p\u003E\n"},{"CreatedByName":"Epicdreamer","CreatedById":167797,"CreatedDateTime":"2019-06-27T17:42:48Z","Content":"\n\u003Cp\u003E\nPlaying pc since version 1.1.2. I\u0027ve never used the cheat menu..or well, once to have a look at it. I like launching craft and test them during real missions. If it doesn\u0027t work out, then that\u0027s a bummer. Sometimes it takes a lot of time to get a craft functional. But when it does, I find the sense of achievement very rewarding and I\u0027m a happy chappy. So basically I\u0027m playing like on a console, but with mods...\n\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2019-06-27T19:40:34Z","Content":"\n\u003Cp\u003E\nback when I first started playing (0.16 ish) I didn\u0027t know of any mods for hacking something into orbit, so lander testing just seeing if I could make it hover above the pad for a few mins. I figured, if it\u0027s got enough \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E to hover on Kerbin, it\u0027ll have enough for Mun and if I can make it hover for a few minutes then that\u0027ll probably do.  Back then I didn\u0027t know anything about the different efficiencies of atmo vs vac for engines....actually, back then was there any difference? It was an approach that mostly worked, but yeah, I did spent a lot of time flying something all the way to Mun, just to test it (and that was in the days before maneuver nodes, so Mun transfers and rendezvous were all by eye....and I still think everyone should try to do rendezvous without using nodes at least once, just for the practice and the understanding it brings).  \u003Cbr\u003E\nBack then it seemed like that was the only way, and I had so much fun doing it that....well, I\u0027m still here!  Also all that mucking about was darn good training.\u003Cbr\u003E\nThese days, yeah, it does seem just a bit too much hassle to haul all the way to another planet, just to test the finer details of your rovers suspension settings, but I can imagine how someone playing for just some casual fun can still get a lot out of it.\n\u003C/p\u003E\n"},{"CreatedByName":"purpleivan","CreatedById":120081,"CreatedDateTime":"2019-06-27T21:22:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625951\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561626141\u0022 data-ipsquote-userid=\u0022196260\u0022 data-ipsquote-username=\u0022Gavin786\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Gavin786 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLet us take for example a lander for Mun.  Without this mod, every time the designer wishes to test an iteration of the design, it has to be packed onto a rocket, then flown to Mun, then deployed and tested.  Does this not drive one nuts ?\n\u003C/p\u003E\n\u003Cp\u003E\nQuality craft just cant be created with this method of having to fly to Mun every time.  Small refinements cant be readily made and tested, every time there is a full commitment to fl\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027d been playing the game for months before I installed any mods. You think a Mun landing is time consuming without Hyperedit et al, try designing an Eve return mission when you have to fly out prototypes each time to test them.\n\u003C/p\u003E\n"},{"CreatedByName":"sturmhauke","CreatedById":190611,"CreatedDateTime":"2019-06-28T00:53:04Z","Content":"\n\u003Cp\u003E\nI played for a few months with no mods, and got as far as Munar orbit and a few landing attempts. I could have made a successful landing with no mods, but I started to get frustrated so I installed \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E as my first mod for the data readouts. I didn\u0027t start using HyperEdit until I was trying to go to other planets and wanted to test my landers first. By then I had been to the Mun and Minmus several times.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you really want to see what\u0027s possible with no mods and minimal upgrades, check out the Caveman Challenge:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022173591\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed1217123687\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/167195-the-ksp-caveman-challenge-14x-16x-re-booted/\u0026amp;do=embed\u0022 style=\u0022height:211px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2019-06-28T01:55:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223626260\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561670566\u0022 data-ipsquote-userid=\u0022120081\u0022 data-ipsquote-username=\u0022purpleivan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, purpleivan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027d been playing the game for months before I installed any mods. You think a Mun landing is time consuming without Hyperedit et al, try designing an Eve return mission when you have to fly out prototypes each time to test them.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne of the (many) worst things about Eve testing is that launch windows take a lot of time warping to get. Same with Duna.\n\u003C/p\u003E\n"},{"CreatedByName":"purpleivan","CreatedById":120081,"CreatedDateTime":"2019-06-28T05:10:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223626347\u0022 data-ipsquote-contentid=\u0022185858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561686958\u0022 data-ipsquote-userid=\u0022100398\u0022 data-ipsquote-username=\u0022Xavven\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Xavven said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne of the (many) worst things about Eve testing is that launch windows take a lot of time warping to get. Same with Duna.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGot to say I was so pleased when I finally discovered the existence of Hyperedit... saved sooooo much time.\n\u003C/p\u003E\n"}]}