{"TopicId":189774,"ForumId":32,"TopicTitle":"KSP Related reading list?","CreatedByName":"GungaDin","CreatedById":92717,"CreatedDateTime":"2019-11-13T18:52:07Z","PageNum":1,"Articles":[{"CreatedByName":"GungaDin","CreatedById":92717,"CreatedDateTime":"2019-11-13T18:52:07Z","Content":"\n\u003Cp\u003E\nI\u0027ve looked around the webs but have not found a user generated list or forum topic that covers a KSP reading list.  I\u0027m an avid reader of early space history which would be one category to share but another would be readable books on orbital mechanics.  I\n\u003C/p\u003E\n\u003Cp\u003E\nl\u0027ll start a thread myself here if one does not exist but I didn\u0027t want to be duplicatory...  Danke.\n\u003C/p\u003E\n"},{"CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2019-11-13T22:24:43Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003EIgnition\u003C/em\u003E (by John Drury Clark) would be the first book I\u0027d recommend if you\u0027re interested in history of rocketry.  Rockets are no good without propellants, every rocket designer since Goddard has known that.  Goddard\u0027s own biography, and Willy Ley\u0027s autobiography, should also be on the list.  I think there was an equivalent work for von Braun.\n\u003C/p\u003E\n\u003Cp\u003E\nFor orbital mechanics, I don\u0027t know if there can be a combination of accurate and readable.  I\u0027m pretty good at transfers in KSP, and I still can\u0027t do the math to actually calculate things like the phase angle, transfer time, and so on for Hohmann transfers -- fortunately, for a game that\u0027s supposed to be fun as well as scientific, the game lets me just noodle at it until it works.\n\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2019-11-13T22:33:05Z","Content":"\n\u003Cp\u003E\nNot a book but this covers all the maths you need for KSP \u003Ca href=\u0022http://www.braeunig.us/space/orbmech.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.braeunig.us/space/orbmech.htm\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}