{"TopicId":189858,"ForumId":32,"TopicTitle":"When is a Lunar impact not a Lunar impact?","CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2019-11-17T23:18:23Z","PageNum":1,"Articles":[{"CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2019-11-17T23:18:23Z","Content":"\n\u003Cp\u003E\nI\u0027m playing 1.6.1, \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E, \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E, and RP-1 (installed recently, within the past couple months).  After making two successful Lunar flyby missions, I accepted the first (of three available) Lunar impact missions.  These require that a craft of at least 40 kg, with at least one unit (W*s?) of Electrical Charge, impact the Moon.\n\u003C/p\u003E\n\u003Cp\u003E\nMy vessel was 350 kg in final configuration (give or take some nitrous oxide monopropellant for the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E -- I\u0027d burned about half of that adjusting orbit), and the batteries were full, more than 6500 units of EC (40 tiny solar panels produce more power than the avionics and helical omni antenna consume).  However, my impact was beyond the Moon\u0027s limb, several minutes after losing contact with Mission Control because the Moon itself was in the way.\n\u003C/p\u003E\n\u003Cp\u003E\nApparently, this doesn\u0027t count to close the contract.\n\u003C/p\u003E\n\u003Cp\u003E\nWould have been handy if they\u0027d specified that I needed to hit the \u003Cem\u003Evisible hemisphere\u003C/em\u003E of the Moon in the contract wording -- if they had, I\u0027d have had plenty of time and \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to adjust my orbit (a couple m/s just after transfer insertion would have done the job -- a couple dozen as a mid-course correction).\n\u003C/p\u003E\n\u003Cp\u003E\nNow I have to build and launch another entire craft (okay, it only costs about \u003Cimg alt=\u0022:funds:\u0022 data-emoticon=\u0022\u0022 data-ratio=\u0022100.00\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Funds.png\u0022 title=\u0022:funds:\u0022 width=\u002220\u0022\u003E6500, but it takes about six months to build and roll out), and make sure I impact the near side...\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2019-11-18T01:01:46Z","Content":"\n\u003Cp\u003E\nYou could also alt-f12 complete the contract. I do it all the time when the game and I disagree that I fulfilled a contact\u0027s specifications.\n\u003C/p\u003E\n"},{"CreatedByName":"Zeiss Ikon","CreatedById":174016,"CreatedDateTime":"2019-11-18T11:53:22Z","Content":"\n\u003Cp\u003E\nWell, in fact, sometime during the construction of the replacement craft, the contract \u003Cem\u003Edid\u003C/em\u003E complete out -- and I didn\u0027t notice until the new rocket was rolled out on the pad, so that cost me another six months of construction time, because a vessel on the pad doesn\u0027t count as a \u0022new vessel\u0022 for contract purposes -- taking the next contract would give a launch that would never close the contract.  Grrr.\n\u003C/p\u003E\n"},{"CreatedByName":"Mahnarch","CreatedById":114432,"CreatedDateTime":"2019-11-24T01:09:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223706584\u0022 data-ipsquote-contentid=\u0022189858\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221574038906\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/17/2019 at 8:01 PM, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n~ when the game and I disagree that I fulfilled a contact\u0027s specifications.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n*Contract to fly to Jool*\n\u003C/p\u003E\n\u003Cp\u003E\n*Blow up*\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Missed it by \u003Cem\u003Ethat\u003C/em\u003E much.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You blew up on the launch pad...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022...\u0022 *alt-f12*\n\u003C/p\u003E\n"}]}