{"TopicId":199144,"ForumId":32,"TopicTitle":"Modaholics Anonymous","CreatedByName":"Kerminator K-100","CreatedById":204357,"CreatedDateTime":"2020-12-28T16:27:25Z","PageNum":1,"Articles":[{"CreatedByName":"Kerminator K-100","CreatedById":204357,"CreatedDateTime":"2020-12-28T16:27:25Z","Content":"\n\u003Cp\u003E\nI\u0027m \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204357-kerminator-k-100/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204357\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204357-kerminator-k-100/\u0022 rel=\u0022\u0022\u003E@Kerminator K-100\u003C/a\u003E and I am addicted to mods. \n\u003C/p\u003E\n\u003Cp\u003E\nKSP has an amazing community of modders who are all brilliant and never fail to come out with amazing mods. And the mods are all free! Last time I checked \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E had about 3000 mods total and there are more on the forums, github, spacedock, and curseforge. But when I see a mod that looks cool, I instantly download it. But the mods do have a price. Cluttered part lists, ridiculous loadtimes, paralyzing amounts of options and features to keep track of. And also when an update comes out, I can either remove all mods and risk the kraken\u0027s wrath or update and pray, and risk the kraken\u0027s wrath.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve found that there are cycles to modding my game. When a new update comes out, I trim my list to a few essential mods. But as more are updated my list balloons again, increasing loading times to unbearable amounts. \n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027ve come up with a simple questionnaire for you to ask yourself next time you see that amazing new mod that will solve every problem, or if you want to trim your mod list and can\u0027t decide what to get rid of.\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\n How often do I complain about this problem? For example a part mod: Do you find yourself saying randomly, if only I had a Starship replica to go to Jool, it would make life so much simpler. \n\u003C/li\u003E\n\u003Cli\u003E\nHow often do you actually do what the mod is supposed to fix? Mech-Jeb is one of my essential mods because I use it to auto-dock. I rendezvous and dock all the time so to me Mech-Jeb is worth it.\n\u003C/li\u003E\n\u003Cli\u003E\nIf you do decide to install the mod, ask yourself, how often do I use this mod? It will vary for each person but you need to set a benchmark for how frequently you need to use a mod, or else its just deadweight. For example I used \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E twice when I first got it. Once to fix a broken spaceship, and once to build a space station. The rest of the time it just sat in my Game Data folder, taking up RAM. So I removed it. However when I started wishing that I could build ships and rovers, I decided to reinstall it.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nI hope this guide helps you cure your mod addiction and saves your computer from being choked with mods. Please note this is not an attack on modders, you guys are amazing!\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want please comment how many mods you usually play with or just your tips on how to cut back on excessive modding.\n\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2020-12-30T20:33:42Z","Content":"\n\u003Cp\u003E\nI used to use a ton of mods.  Then almost every mod I used ended up becoming a stock feature.  Now I use 3: TAC Life Support, Kerbal Alarm Clock, and Planetary Base Systems.  The first is to add an extra element of challenge, the second is a major convenience feature, the third supplements the game\u0027s rather lackluster base-building options.  Other than those, I don\u0027t really need any other mods.\n\u003C/p\u003E\n"},{"CreatedByName":"Blasty McBlastblast","CreatedById":164020,"CreatedDateTime":"2020-12-31T08:01:19Z","Content":"\n\u003Cp\u003E\ni like to do BIG career playthroughs (stations \u0026amp; bases on every planet, hundreds of probe landers and communication satellites, tourists everywhere, etc..) so for the sake of my CPU, and to avoid game breaking glitches, i try to keep my mod count to a bare minimum...  so about 30 \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-12-31T10:15:40Z","Content":"\n\u003Cp\u003E\nI use a lot of mods, and not just because my latest career is RP-1 which has oodles of dependencies and recommendations- I have a JNSQ career game with about 90 mods installed via \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E plus some extras added manually, plus the first career I ever started which is so overloaded with mods that it once managed to teleport Val from Kerbin to inside a probe core on a hovercraft on Laythe when I loaded the save \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//s3.us-west-2.amazonaws.com/kerbal-forum-uploads/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI often remove parts from mods that I don’t want or like (e.g. the lithium-powered stuff from NF Propulsion or parts that duplicate what another mod already adds like small \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters) and some mods that I use a lot have one or two parts in them so they aren’t really the same as something like SSPX with its huge array of station parts and those massive centrifuge modules (or the fish tanks!).\n\u003C/p\u003E\n\u003Cp\u003E\nI sometimes delete interiors for large parts to save on RAM and improve the performance, especially when they’re on a big ship with lots of parts and lots of Kerbals, and am a prolific mod modifier who writes patches for existing mods to e.g. swap the engines in Cryo Engines to burn methane rather than hydrogen, or extend NF Solar’s solar cell switching to the stock solar panels.\n\u003C/p\u003E\n"}]}