{"TopicId":20011,"ForumId":32,"TopicTitle":"A tragedy for Kerbalkind","CreatedByName":"CkGordon","CreatedById":51332,"CreatedDateTime":"2012-09-23T11:52:20Z","PageNum":1,"Articles":[{"CreatedByName":"CkGordon","CreatedById":51332,"CreatedDateTime":"2012-09-23T11:52:20Z","Content":"\n\u003Cp\u003EI\u0027m a little devestated. I got this game this morning and spent my entire day off fascinated. My first rocket attempts were hilarious failures full of huge explosions. Eventually i managed a successful flight and landing. Shortly after, my first taste of space as I finally send an astronaut to orbit and safely return him. Not long after that I had perfected a rocket that could actually leave Kerbins influence! That brave soul still floats in deep space but will always be remembered as a hero for science! Tonight I took it to the next level. I built a landing capsule, fitted it to a rocket, timed my launch to intersect the moon, and blasted off into space. As I approached I kept fine tuning my trajectory over and over and finally the blue line went right through the Mun on my map. I spent the last of my second stage fuel perfecting the meeting and decoupled. I then spun my lander around and started slowing down as I approached the lunar surface. I managed to get 2 screenshots of this momentous event as I prepared to touch down hoping to exit my space capsule victorious but then the unthinkable happened. I ran out of fuel and was still going too fast. At about 900m/s I smashed into the lunar surface and watched in horror as all that hard work went up in a huge explosion. Has anyone else had failure after coming so close to success? What could I do different next time? I cant really pack more fuel on my lander or the ladder wont reach the ground. Also what is the max speed you can touch down and survive?\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2012-09-23T12:30:04Z","Content":"\n\u003Cp\u003EI\u0027m guessing your lander is too heavy. Make a smaller lander, and give it one of the efficient engines. NERVA \u002B 400L fuel tank \u002B 1 man command module \u002B parachute can land and get back if you land without horizontal velocity on a flat area.\u003C/p\u003E\n"},{"CreatedByName":"Cby","CreatedById":26505,"CreatedDateTime":"2012-09-23T12:35:31Z","Content":"\n\u003Cp\u003EThe same thing happened way to many times to me\u003C/p\u003E\n"},{"CreatedByName":"wired2thenet","CreatedById":18275,"CreatedDateTime":"2012-09-23T12:46:45Z","Content":"\n\u003Cp\u003EWelcome to KSP! The only game where failure means success!\u003C/p\u003E\u003Cp\u003ESeriously though, the final insertion and de-orbit requires a less-heavy stage, with steady thrust (usually, but it depends on the lander design). My best Munar landings happened with one pod, one regular 1m tank, and the gimbal engine.\u003C/p\u003E\u003Cp\u003ETo LEARN how to land, get the mechjeb autopilot, which has a landing feature (may be currently broken in .17). Watch what it does and when, and then figure out why it does it. Practice the landing a few times, and then ditch the mechjeb entirely. That\u0027s what I did, and I can land currently on almost any body in the system as a result.\u003C/p\u003E\u003Cp\u003EI had a very hard time landing on the Mun and Minmus in the beginning, but I started using mechjeb and watch what it did and when, and then figured out WHY it did what it did at those particular moments. After that, I only used mechjeb for the mundane stuff, and for information gathering. It (mechjeb) is not 100% efficient in it\u0027s landings, but it\u0027s so darn close you can practically do it in your sleep once you realize why it\u0027s doing what it does.\u003C/p\u003E\n"},{"CreatedByName":"p512","CreatedById":31584,"CreatedDateTime":"2012-09-23T13:05:59Z","Content":"\n\u003Cp\u003ELanding @ Duna:\u003C/p\u003E\u003Cp\u003E100m above the ground - fuel runs out. Last hope are the parachutes. Deploy them.\u003C/p\u003E\u003Cp\u003EStill going 60m/s - spacecrafts smashes into the ground. Only the capsule has survived.\u003C/p\u003E\u003Cp\u003ELet\u0027s see if I can rescue this.\u003C/p\u003E\u003Cp\u003EBut wired2thenet is right - failure means success in this game. You\u0027ll often learn new things how you can do this or that better.\u003C/p\u003E\n"},{"CreatedByName":"flyfire2002","CreatedById":50236,"CreatedDateTime":"2012-09-23T13:17:07Z","Content":"\n\u003Cp\u003EI donno but I think maybe the best way to land is to enter a low orbit(20K or so) and then decelerate? I thought fuel used to enter 20K from .5M is much lower than it needed to drop vertically from .5M.\u003C/p\u003E\n"},{"CreatedByName":"Dweller_Benthos","CreatedById":15418,"CreatedDateTime":"2012-09-23T13:30:45Z","Content":"\n\u003Cp\u003EWatch the videos here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/15652-Orbital-Mechanics-101-A-Kerbal-Space-Program-Tutorial\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/15652-Orbital-Mechanics-101-A-Kerbal-Space-Program-Tutorial\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou will have many an \u0022AHA\u0022 moment. At least I did.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2012-09-24T10:47:01Z","Content":"\n\u003Cp\u003EAbout mun lander - I think that design presented bellow is best for learning to practice efficient and precise landing (lander is even an little overkill, because he\u0027s able to get to mun,land on it and get back on return trajectory with dry tank), it\u0027s very simple, stable and easy to control without any support \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh4.googleusercontent.com/-R35dyJG3Qvo/UGAZyOJOm8I/AAAAAAAABvg/LRWk9nfGByA/s1280/MunarOrbiter1.png\u0022 alt=\u0022MunarOrbiter1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh6.googleusercontent.com/-WQm_oCVceJg/UGAZy8RzPQI/AAAAAAAABvo/VNfoGqqa52c/s1280/OrbiterSeperation1.png\u0022 alt=\u0022OrbiterSeperation1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh5.googleusercontent.com/-U0lu7JYsmwg/UGA50qeDdjI/AAAAAAAABwA/gG5Tk-n_jA4/s1280/Lander2.png\u0022 alt=\u0022Lander2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Whatshtisthis","CreatedById":42775,"CreatedDateTime":"2012-09-24T12:08:02Z","Content":"\n\u003Cp\u003EMy first lander for the Mun ran out of fuel while retroburning and I switched to IVA, and looked out of the window as the ground approaches and... boom.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2012-09-24T13:46:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CkGordon\u0022 data-cite=\u0022CkGordon\u0022\u003E\u003Cdiv\u003EI managed to get 2 screenshots of this momentous event as I prepared to touch down hoping to exit my space capsule victorious but then the unthinkable happened. I ran out of fuel and was still going too fast. At about 900m/s I smashed into the lunar surface and watched in horror as all that hard work went up in a huge explosion. Has anyone else had failure after coming so close to success? What could I do different next time? I cant really pack more fuel on my lander or the ladder wont reach the ground. Also what is the max speed you can touch down and survive?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMake sure you are launching to the east, heading 090. Launching to the west puts you in retrograde orbit, where you run into the Mun head-on rather than encountering it moving in the same direction. Both of these things cost you a lot of fuel to overcome.\u003C/p\u003E\u003Cp\u003EI try to land at or below 5 m/sec, with as close to no horizontal speed as I can get.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2012-09-24T13:47:06Z","Content":"\n\u003Cp\u003EKarolus\u0027 lander looks good, probably even a little too good \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. But for a total beginner, I\u0027d use at least six legs, it\u0027s easy to tip over in the low gravity with only four.\u003C/p\u003E\u003Cp\u003EAnd CkGordon, you described pretty much my first ten landing attempts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. The trick is to slow down in time, and then lower your minimum speed as you get closer to the surface. At 10,000m it\u0027s OK to be going pretty fast, at 1,000m you should be descending more or less straight down and your speed should be low enough so that you can slow to a hover in a few seconds. What speeds to use depends on your lander, but the last 1,000-500m I usually try to remain at 10m/s or less vertical speed.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2012-09-24T14:23:00Z","Content":"\n\u003Cp\u003EIn this lander 4 legs are enough, with small legs it has pretty low center of weight, so it shouldn\u0027t tip over \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EAlso most people make major mistake by killing their orbital velocity on high orbit or performing direct descent (that limit selection of landing site and need good timing).\u003C/p\u003E\u003Cp\u003EIMHO, best method (you can use vehicle presented above as an example):\u003C/p\u003E\u003Cp\u003EGet to the \u003Cstrong\u003E25 Km\u003C/strong\u003E Parking orbit around the Mun, it\u0027s good for rendezvous if you use multiple modules and this is lowest orbit with good warp rates if you need wait little more. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESeparate from departure stage\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESet IVA camera in comfortable position (you can\u0027t see anything from inside so, you are forced to cycle between views)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDeploy gear and ladder\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPerform plane corrections if necessary \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETransfer to lower orbit, I recommend transfer to \u003Cstrong\u003E5k\u003C/strong\u003E meters in \u003Cstrong\u003E3\u003C/strong\u003E burns: \u003Cbr\u003E#1st burn change perigee to \u003Cstrong\u003E10-13 Km\u003C/strong\u003E\u003Cbr\u003E#2nd burn (in perigee) change perigee to \u003Cstrong\u003E~5000m\u003C/strong\u003E (little more) \u003Cbr\u003E#3rd burn circularization for in \u003Cstrong\u003E~5000-5200m\u003C/strong\u003E orbit\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EPRESS F5\u003C/strong\u003E\u003C/span\u003E to quick-save before go next\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhen you 1/4 orbit from target perform deorbit burn - your target should be on the middle betwen impact site and your ship position.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EVertical speed shouldn\u0027t be more than \u003Cstrong\u003E-10m/s\u003C/strong\u003E \u002B/-5 (and that all the way to the landing site)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EObserve landing radar to know your altitude - try not fall bellow \u003Cstrong\u003E1500m\u003C/strong\u003E before your speed is over \u003Cstrong\u003E200m/s\u003C/strong\u003E and don\u0027t fall bellow \u003Cstrong\u003E1000m\u003C/strong\u003E before your speed are hit \u003Cstrong\u003E~100m/s\u003C/strong\u003E (or you toast \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReduce throttle to \u003Cstrong\u003E2/3\u003C/strong\u003E and go to \u003Cstrong\u003E40-60*\u003C/strong\u003E when you go bellow \u003Cstrong\u003E200-100m/s\u003C/strong\u003E (depending from distance from target)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPerform no more than \u003Cstrong\u003E20*\u003C/strong\u003E tilt for heading corrections during landing site approach\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReduce throttle to \u003Cstrong\u003E1/3\u003C/strong\u003E if possible\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETry don\u0027t kill all lateral velocity before 500 meters, better slow down \u003Cstrong\u003E2/3 km\u003C/strong\u003E from target and slowly kill most of lateral velocity during hovering to target at \u003Cstrong\u003E60*\u003C/strong\u003E \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReduce vertical speed to \u003Cstrong\u003E-5m/s\u003C/strong\u003E before touchdown and kill lateral velocity (100meters) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBurst the engines to kill nearly all (not go up) vertical velocity before touchdown and cut the engines \u003Cstrong\u003Efew\u003C/strong\u003E meters above ground \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EYou can send good news to kerbin and do EVA \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-24T14:26:32Z\u0022 title=\u002209/24/2012 02:26  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 24, 2012\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"}]}