{"TopicId":202081,"ForumId":32,"TopicTitle":"Well that contract didn’t work out well…","CreatedByName":"Rylant","CreatedById":211132,"CreatedDateTime":"2021-04-29T15:40:07Z","PageNum":1,"Articles":[{"CreatedByName":"Rylant","CreatedById":211132,"CreatedDateTime":"2021-04-29T15:40:07Z","Content":"\n\u003Cp\u003E\nSo in my latest career, I have nearly maxed out the science tree and have been to Eve / Gilly and Duna / Ike. One of the last contracts I took was establishing a surface base on Duna. It was your typical “Capacity for 9 Kerbals, Stable for 10 seconds, etc”. There was a couple of other criteria. I have a similar base on Minmus and the Mun, but obviously the distance to, and landing on Duna makes it significantly more difficult. So I modify my current surface station and booster and take a couple hours planning and executing the mission. Everything worked pretty well with only a few fairly minor hiccups.\n\u003C/p\u003E\n\u003Cp\u003E\n So, I land on Duna. Everything looks great. And I see the contract doesn’t complete for some reason.  I look a little closer and realize that I don’t have the right docking port on the station. I have a few docking ports on the station, just not the right one as part of the contract criteria. I consider getting an engineer to just mount the correct docking port, but I realize one of the other criteria for the contract is that the station be complete on launch, which I assume will prevent that?\n\u003C/p\u003E\n\u003Cp\u003E\n Well that sucks lol. I imagine I am far from the only one who has done this though?\n\u003C/p\u003E\n\u003Cp\u003E\n Rylant\n\u003C/p\u003E\n"},{"CreatedByName":"Dientus","CreatedById":209823,"CreatedDateTime":"2021-04-29T17:21:45Z","Content":"\n\u003Cp\u003E\nWell, maybe, possibly, I might have done that once or twice...\n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t done it since the addition of engineers being able to attach things. I would assume the same thing, that it won\u0027t complete the contract however since you\u0027re already there what\u0027s the harm in trying? \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-04-29T18:04:15Z","Content":"\n\u003Cp\u003E\nAFAIK it should still complete as the vessel was launched new as opposed to using an existing one . One of the few welcome bugs in KSP (if you consider it that).\n\u003C/p\u003E\n\u003Cp\u003E\nTBH I’d have Alt-F12’d that one at the first sign of trouble as you have multiple ports on and realistically if the port type was so important, wouldn’t the Co have checked the designs or even looked at it pre-launch? Why would they wait till you got all the way to Duna before deciding? So it’s not cheating, it’s just more realistic \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"}]}