{"TopicId":204575,"ForumId":32,"TopicTitle":"Building Bigger?","CreatedByName":"spacedoctor42","CreatedById":138696,"CreatedDateTime":"2021-08-30T00:26:46Z","PageNum":1,"Articles":[{"CreatedByName":"spacedoctor42","CreatedById":138696,"CreatedDateTime":"2021-08-30T00:26:46Z","Content":"\n\u003Cp\u003E\nDoes anyone have any links to good guides on building large payload/high delta V rockets/spaceplanes? I\u0027m really itching to build big stations and do long-haul flights but my skills pretty much start and end with litte in-and-out missions and comms satellites.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-08-30T00:27:07Z\u0022 title=\u002208/30/2021 12:27  AM\u0022 data-short=\u00222 yr\u0022\u003EAugust 30, 2021\u003C/time\u003E by spacedoctor42\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ffx","CreatedById":200313,"CreatedDateTime":"2021-08-30T03:57:37Z","Content":"\n\u003Cp\u003E\nAdd more boosters\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2021-08-30T04:48:35Z","Content":"\n\u003Cp\u003E\nBig stations? Send in parts and assemble in orbit. More \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E? Moar boosters, add more stages, with really heavy payloads 3 or more core stages of different sizes plus side mounted srbs are a must sometimes. Just keep adding fuel until the most powerful engine of chosen size can\u0027t keep up, then increase the size, repeat.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2021-08-30T17:36:54Z","Content":"\n\u003Cp\u003E\nLook around The Exchange sub and KerbalX for ideas. Maybe download some and try them, not to use instead of your own, but to see how they work? \n\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2021-09-02T22:00:16Z","Content":"\n\u003Cp\u003E\nIs \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/71402-whackjob/\u0026amp;do=hovercard\u0022 data-mentionid=\u002271402\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/71402-whackjob/\u0022 rel=\u0022\u0022\u003E@Whackjob\u003C/a\u003E still playing KSP? You could look up some of his videos on YouTube. Looks like he stopped uploading KSP stuff 6 years ago, so it\u0027s missing a lot of improvements like the Making History parts (including 5m parts and engines), stock autostruts and joint reinforcement, but his principles still apply. Look at how he arranges rockets, girders/panel, and struts them together.\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2021-09-02T23:10:04Z","Content":"\n\u003Cp\u003E\ndon\u0027t forget autostruts, else your rocket is likely to fall apart. that\u0027s perhaps the one complicated thing about large rockets. everything else is just\u003Cem\u003E moar boosters\u003C/em\u003E and \u003Cem\u003Emoar engines\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"ave369","CreatedById":174958,"CreatedDateTime":"2021-09-06T08:23:32Z","Content":"\n\u003Cp\u003E\nHaving Making History and thus access to the 5m size helps. There is no 5m single engine in the game, but there is a fuel tank/engine assembly part that can serve as the basis for your custom 5m super-engine. It has 5 nodes: 4 size 1 nodes and one size 3 node. A Mastodon should go into each of the size 1 nodes. An engine plate with 5 Vectors should go to the size 3 node. So you have a super-Mammoth with 4 Mastodons and 5 Vectors, and no nozzle clipping. This will be your lower stage engine.\n\u003C/p\u003E\n\u003Cp\u003E\nTo boost it into the orbit, add 4 asparagus staged boosters. Each should be a Size 3 Kerbodyne with a Mammoth as the engine. So you\u0027ll have a Size 4 central stage and four size 3 asparagus staged booster stages. This alone is enough to launch really big payloads into space. Whole stations, or interplanetary cruisers with 10k delta-v, you name it. I can imagine very few payloads too big for this rocket; for example, it won\u0027t launch a whole \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003E\u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E\u003C/abbr\u003E Orion (mod) engine with a bomb storage unit into orbit. Anything smaller than that is fair game.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-06T08:28:59Z\u0022 title=\u002209/06/2021 08:28  AM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 6, 2021\u003C/time\u003E by ave369\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wcmille","CreatedById":151345,"CreatedDateTime":"2021-09-07T05:55:30Z","Content":"\n\u003Cp\u003E\nI do inefficient orbits by doing poor gravity turns to get out of atmosphere. It’s more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to get to orbit than a good gravity turn, but more forgiving on your payloads.\n\u003C/p\u003E\n"}]}