{"TopicId":20475,"ForumId":32,"TopicTitle":"[UNOFFICIAL/FANMADE] 0.18 Discussion thread","CreatedByName":"kacperrutka26","CreatedById":18849,"CreatedDateTime":"2012-09-26T16:43:51Z","PageNum":5,"Articles":[{"CreatedByName":"Polar Bear","CreatedById":31751,"CreatedDateTime":"2012-09-30T06:11:37Z","Content":"\n\u003Cp\u003EI think they will make the interiors for the two remainig cockpits, other then that...\u003C/p\u003E\u003Cp\u003EHmmm...\u003C/p\u003E\u003Cp\u003EPerhaps some tweaks to the launch pad (Becase people might want to launch bigger rockets with the new planets and stuff, and I\u0027m aware of the mod that removes the launch tower).\u003C/p\u003E\u003Cp\u003EBug fixes, and maybe some other things...\u003C/p\u003E\n"},{"CreatedByName":"Shuttle","CreatedById":5225,"CreatedDateTime":"2012-09-30T06:14:55Z","Content":"\n\u003Cp\u003E0.16 - 0.3 fps, 0.17 - 30 fps, great work on optimization by development team! I guess that\u0027s why this update took 1.5 months to release.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EPlease note, my previous statement that I knew the plan is now false. Plans were changed, and a new direction chosen for the update\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENova said that there would be no docking and no new planets in the next update. Developers are constantly saying docking requires too many things to implement first such as modular ship structure, interiors, multiple command pods on one rocket, fuel transfer, merging ships together, reworked stage control, advanced IVA...\u003C/p\u003E\u003Cp\u003ESo it is unlikely that docking will be in 0.18. There is also something I wanted to know for a long time: are there any other programmers in Squad who are working on docking or all the job is done only by Harvester? There are other programmers in titles but nobody ever told what they were working on. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tofuturkey","CreatedById":20358,"CreatedDateTime":"2012-09-30T06:56:14Z","Content":"\n\u003Cp\u003EI see lot\u0027s of people here saying that there is going to be no docking implemented in 0.18, but so far I haven\u0027t found a single dev post supporting this statement. Would someone be so kind as to post a link here for all us innocent bystanders who don\u0027t want to get our hands dirty in the quagmire of forum flame wars? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-09-30T07:01:02Z","Content":"\n\u003Cp\u003EThe only dev post supporting the \u0022no docking\u0022 thing was Nova, explicitly saying \u0022docking won\u0027t be in 0.18\u0022.\u003C/p\u003E\u003Cp\u003EBut since he just said plans had changed, we are left in speculation as always \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shuttle\u0022 data-cite=\u0022Shuttle\u0022\u003E\u003Cdiv\u003E0.16 - 0.3 fps, 0.17 - 30 fps, great work on optimization by development team! I guess that\u0027s why this update took 1.5 months to release.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis seems to depend on people, some have better frame rates, some are having more trouble with 0.17...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-30T07:03:04Z\u0022 title=\u002209/30/2012 07:03  AM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 30, 2012\u003C/time\u003E by Cykyrios\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EleSigma","CreatedById":11215,"CreatedDateTime":"2012-09-30T07:20:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EPlease note, my previous statement that I knew the plan is now false. Plans were changed, and a new direction chosen for the update.\u003Cp\u003EAddendum:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/575558/disgonbgud.gif\u0022 alt=\u0022disgonbgud.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you had the roadmap upside down?\u003C/p\u003E\n"},{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2012-09-30T20:09:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KAO\u0022 data-cite=\u0022KAO\u0022\u003E\u003Cdiv\u003EI think the frame rate improved personally :/ but that\u0027s just my computer \u003Cp\u003EI just hope the team mobilizes on docking already, Erkle has got plenty of headway on the concept but it\u0027s current stage is pretty buggy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy Ksp is running better than in 0.16\u003C/p\u003E\n"},{"CreatedByName":"a1fonzo","CreatedById":35942,"CreatedDateTime":"2012-09-30T22:06:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RageCookie\u0022 data-cite=\u0022RageCookie\u0022\u003E\u003Cdiv\u003EYeah, the game is in a pre Alpha state for which they charge 18 Bucks. A bit of pushing and complaining is not really missplaced. Again, funny phenomenon...in no industry customers have so much tolerance for failure as in the electronics arts business.\u003Cp\u003EAs much as i like KSP, for my taste 18 bucks is overpriced. Minecraft as an other Indie example, is about 27 bucks in its current state. In the alpha it was free and in late beta is was about 8 Dollars and not to flame too much but Notch and Co updated way more often then Squad. But just my opinion. I bought KSP when it was way cheaper and I recommeded it then to two of my friends. As of it got really expensive for an alpha I wont recomend it again unless the game progresses much better.\u003C/p\u003E\u003Cp\u003EI have every respect for Squad and Nova and all the other people working on this but the developement has to speed up if they want to justify the high price.\u003C/p\u003E\u003Cp\u003EThe game is missing key aspects as docking ( which was by the way anounced about 3 updates ago or something), proper mission planing (simulations ) and a lot of tweaks about the physical parameters.\u003C/p\u003E\u003Cp\u003EJust my opinion. I am open for flame now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but you also have to look at the quality of game Minecraft really is, while I for one am a very big Minecraft fan and play the game almost every day, to be honest if you look at the amount of bugs and everything that get overlooked and have never been fixed compared to KSP then yeah.\u003C/p\u003E\n"},{"CreatedByName":"RC1062","CreatedById":10709,"CreatedDateTime":"2012-09-30T22:19:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022a1fonzo\u0022 data-cite=\u0022a1fonzo\u0022\u003E\u003Cdiv\u003EYes, but you also have to look at the quality of game Minecraft really is, while I for one am a very big Minecraft fan and play the game almost every day, to be honest if you look at the amount of bugs and everything that get overlooked and have never been fixed compared to KSP then yeah.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd (not to put Notch and Co down) updating Minecraft was relatively simple. The basic premise of the regular updates was \u0027add a block, block code used from previous work, done\u0027 then \u0027add one new item with a different feature, more coding needed\u0027 and finally \u0027fix some bugs\u0027.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-09-30T22:24:57Z","Content":"\n\u003Cp\u003EMinecraft does not really have a lot to do with KSP 0.18 guys, Mojang kinda ignored the whole \u0027alpha, beta, final release\u0027 thing common in the industry and really aren\u0027t a good example of this sort of thing at all.\u003C/p\u003E\u003Cp\u003ERemember, the topic of this thread is 0.18, if you\u0027d like to start a Minecraft development oddities discussion in Off-Topic though, go right ahead \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-09-30T23:20:59Z","Content":"\n\u003Cp\u003EThere won\u0027t be any docking. Remember how everyone was absolutely certain that docking was coming, for the last 3 updates? Yeah, no. It didn\u0027t come then, and it won\u0027t come this time. I doubt we will see any form of docking until next year.\u003C/p\u003E\n"},{"CreatedByName":"RayneCloud","CreatedById":11227,"CreatedDateTime":"2012-09-30T23:40:10Z","Content":"\n\u003Cp\u003EMany many off topic posts, dup thread. Locked.\u003C/p\u003E\n"}]}