{"TopicId":209425,"ForumId":32,"TopicTitle":"KSP1 Computer Building/Buying Megathread","CreatedByName":"Leonov","CreatedById":51498,"CreatedDateTime":"2013-04-20T02:28:51Z","PageNum":223,"Articles":[{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2020-06-01T06:16:02Z","Content":"\n\u003Cp\u003E\nFrom what i know you would need to install Linux on it first, assuming you have an x86 CPU. But even then it will be realy slow since Chromebooks come with the slowests CPUs available, often a dual core Atom one. You could try the demo before a purchase, but i doubt you will have any fun with this.\n\u003C/p\u003E\n"},{"CreatedByName":"Hoozemans","CreatedById":198643,"CreatedDateTime":"2020-06-04T12:29:36Z","Content":"\n\u003Cp\u003E\nHi.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m running KSP on an old office notebook, a MacBook Pro 15, with an i9\u003Cspan style=\u0022background-color:#ffffff;color:#000000;font-size:14px;\u0022\u003E-8950HK, 32G of RAM at 2400Mhz and a \u003C/span\u003ERadeon Pro 560X with 4 GB. It\u0027s a pretty good piece of hardware for the work that I\u0027m doing, especially since most development is being done in clouds anyway, but now that my KSP vessels have grown beyond 500 parts (after launch), I\u0027m starting to feel the pain: FPS is down to single digits most of the time; the mission clock doesn\u0027t ever show green anymore. I\u0027m not sure what KSP does to my CPU, but it sure as hell gobbles up all the memory, to the point where I\u0027m having trouble running an 8G VM alongside it. Docking a 500 part exploration vessel to an 800 part space station for refuelling is an \u003Cem\u003Eamazing\u003C/em\u003E experience even without the Kraken intervening...\n\u003C/p\u003E\n\u003Cp\u003E\nSince removing all competing software from my office notebook isn\u0027t an option - I do have to occasionally do some work - I figured it\u0027s about time to start thinking of a machine specifically for playing KSP, on which I can tinker with the game\u0027s configuration and settings without that nagging feeling that I really shouldn\u0027t be doing this on my office laptop. This would be a machine that\u0027s designed around KSP, that has the sole purpose of making me not-eat-my-fingernails during docking manoeuvres.\n\u003C/p\u003E\n\u003Cp\u003E\nI want to explore two options:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nA notebook: I figure it\u0027ll give you less bang for buck than a desktop solution, but I like being able to drag it along to the back yard and sit in the sun for a bit, with my game of KSP and a cold beer.\n\u003C/li\u003E\n\u003Cli\u003E\nA desktop: less mobile, but more easily upgradeable, and more power for the same money.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThings to consider:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCPU: AMD or Intel? Which has the best IPC and clock speed? Which models have a good cache speed? Where can I get the best single core performance for the notebook and the desktop solution? There\u0027s plenty of benchmarks to be found on the web, but which ones are useful for gauging KSP performance?\n\u003C/li\u003E\n\u003Cli\u003E\nMainboard: in case of desktop, I\u0027ll have to think about the mainboard under my CPU. There\u0027s plenty of options for most CPUs on the bench mark lists. What should I look for in a mainboard that\u0027s relevant to KSP performance?\n\u003C/li\u003E\n\u003Cli\u003E\nRAM: more is better; faster is better - I think I will be able to manage that part.\n\u003C/li\u003E\n\u003Cli\u003E\nGFX card: I\u0027m getting mixed messages from the boards about how much and in what ways KSP performance is affected by which items, but most people seem to agree that if you\u0027re not playing with all graphics and visual mods maxed out, then CPU performance is probably more of a limiting factor than GFX card performance. So I\u0027m going to go with a budget card. What affordable cards are available that perform okay for KSP? What should I look for?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nOf course I\u0027ve been reading through these forums, trying to glean some understanding from the discussions here, but there\u0027s so many contradicting and/or confusing opinions that I thought I should add some more to the mix. Most of those threads are pretty old anyway - very little info on the most recent Intel/AMD releases, yesno?\n\u003C/p\u003E\n\u003Cp\u003E\n(Which brings me to another question: why isn\u0027t there a section of the forum dedicated to hardware discussions? Or is there and did I just have the wrong glasses on? Should I move my question somewhere more appropriate?)\n\u003C/p\u003E\n\u003Cp\u003E\nSo if anyone wants to tell me what hardware they\u0027re using to get a decent framerate with 500\u002B part vessels, or what characteristics I should look at in the bits of hardware I need to purchase for a dedicated KSP machine, I\u0027d appreciate the input!\n\u003C/p\u003E\n\u003Cp\u003E\nGr, H.\n\u003C/p\u003E\n"},{"CreatedByName":"Cant think of a username","CreatedById":204905,"CreatedDateTime":"2020-06-04T15:45:31Z","Content":"\n\u003Cp\u003E\nI use a laptop(mac pro) and it crashed 1/4 of the times I tried to run the app. The computer also turns the fan like crazy\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-04T15:55:44Z\u0022 title=\u002206/04/2020 03:55  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 4, 2020\u003C/time\u003E by Cant think of a username\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2020-06-04T16:07:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022198643\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0022 rel=\u0022\u0022\u003E@Hoozemans\u003C/a\u003E I would recommend a desktop because they don\u0027t have to compromise power for portability and are more cost effective. Having a beer in your backyard while playing KSP sounds great, but not if you have to put up with 9 frames per second. Besides, you already have a laptop. If you want to do the beer/backyard thing then do it with some smaller ships, then come inside with your desktop when you are ready for the serious 500-part monsters.\n\u003C/p\u003E\n\u003Cp\u003E\nIntel had been kicking AMD\u0027s behind for a good decade or so, and despite being an AMD fan since the early 2000\u0027s even I switched to Intel in 2013, but AMD is back with a vengeance now. I upgraded my PC in March 2020 and went with the Ryzen 3600. That\u0027s a popular choice for gamers who are budget conscious.\n\u003C/p\u003E\n\u003Cp\u003E\nMainboards aren\u0027t a huge consideration unless you are an overclocker. Get a reliable brand like Gigabyte or ASRock and you\u0027ll be happy. Something in the $150 range will ensure you are buying enough quality that it works but not spending extra money for no reason. I never had the need to break the bank on $500\u002B mainboards.\n\u003C/p\u003E\n\u003Cp\u003E\nFor graphics, tomshardware has been my go-to for advice. They have a \u0022best for the money\u0022 at different budget levels here: \u003Ca href=\u0022https://www.tomshardware.com/reviews/gpu-buying-guide,5844.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.tomshardware.com/reviews/gpu-buying-guide,5844.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: PM me with one of your 500 part ships and I\u0027ll test-launch it, and tell you my specs and what framerate I\u0027m getting, and on what graphics settings. That can give you an idea of what to expect as you shop for your parts.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-04T17:35:59Z\u0022 title=\u002206/04/2020 05:35  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 4, 2020\u003C/time\u003E by Xavven\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2020-06-04T16:12:20Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022198643\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0022 rel=\u0022\u0022\u003E@Hoozemans\u003C/a\u003E, your question has been merged into the master thread for this kind of discussion, and I hope you find helpful answers here. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2020-06-04T17:32:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022198643\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0022 rel=\u0022\u0022\u003E@Hoozemans\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIm not sure if you can check the current clockspeed of the CPU during KSP on a Mac, you would need some kind of overlay for that and i have no idea if that stuff is possible on a Mac. But that i9 isnt much slower in single-core speed than even the fastest desktop CPUs, its only possible that it throttles due to bad cooling in the laptop. So if there is no throtteling you wont get a noticable gain with even an i9-10900k since that runs only about 10% faster...\n\u003C/p\u003E\n"},{"CreatedByName":"Hoozemans","CreatedById":198643,"CreatedDateTime":"2020-06-05T12:02:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223797000\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591286841\u0022 data-ipsquote-userid=\u0022100398\u0022 data-ipsquote-username=\u0022Xavven\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, Xavven said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022198643\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0022 rel=\u0022\u0022\u003E@Hoozemans\u003C/a\u003E PM me with one of your 500 part ships and I\u0027ll test-launch it\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would love to, but I\u0027ll have to dig for the actual launch files of the bugger. It\u0027s a 555 part exploration vessel, and assembling it from its constituent parts in orbit was such a hellish experience that I chucked the craft files, so it only exists fully assembled in a savefile right now. Thanks for the advice, though!\n\u003C/p\u003E\n\u003Cp\u003E\n(EDIT: I did find some of the staging files, though - they\u0027re older versions than the ones I eventually launched, though.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-05T12:05:36Z\u0022 title=\u002206/05/2020 12:05  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 5, 2020\u003C/time\u003E by Hoozemans\u003C/strong\u003E\n\u003Cbr\u003Eupdate\n\u003C/span\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2020-06-05T13:02:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223797627\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591358550\u0022 data-ipsquote-userid=\u0022198643\u0022 data-ipsquote-username=\u0022Hoozemans\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, Hoozemans said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI would love to, but I\u0027ll have to dig for the actual launch files of the bugger. It\u0027s a 555 part exploration vessel, and assembling it from its constituent parts in orbit was such a hellish experience that I chucked the craft files, so it only exists fully assembled in a savefile right now. Thanks for the advice, though!\n\u003C/p\u003E\n\u003Cp\u003E\n(EDIT: I did find some of the staging files, though - they\u0027re older versions than the ones I eventually launched, though.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.kerbaltek.com/craftkitchen\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.kerbaltek.com/craftkitchen\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBottom of page.  Last time I tried this, it still worked.  Upload your save file, and it will pop out a zip folder with individual .craft files of all the ships in flight in the entire save.\n\u003C/p\u003E\n"},{"CreatedByName":"Hoozemans","CreatedById":198643,"CreatedDateTime":"2020-06-05T19:21:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223797663\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591362142\u0022 data-ipsquote-userid=\u0022179753\u0022 data-ipsquote-username=\u0022Geonovast\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Geonovast said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.kerbaltek.com/craftkitchen\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.kerbaltek.com/craftkitchen\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI tried that shortly after I chucked the craft files, but I can\u0027t load the results. My game was stock plus both DLC\u0027s, and a single mod that allows you to reconfigure tanks (Configurable Containers). I haven\u0027t tried to debug the code yet, but I\u0027m guessing that mod is what kills the export.\n\u003C/p\u003E\n\u003Cp\u003E\nSoit. Since I\u0027m a couple of hundred bucks away from my savings target for the new machine, I can think about whether I want a desktop or flaptop a bit longer. And perhaps find other ways to optimize the game as well. I\u0027ve always wanted a bit more realistic gameplay (ie. limited life support etc.) but at the same time play as stock as possible - but all of this has made me set up a few new copies of the game for checking out \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E/MKS and such.\n\u003C/p\u003E\n\u003Cp\u003E\nWouldn\u0027t it be something if I end up buying this complete beast of a computer, only to have KSP2 solve all the issues I was having a few months later? Nah, who am I kidding: I\u0027m doing this for the joy of buying spiffy new kit as well as playing games \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-05T19:23:08Z\u0022 title=\u002206/05/2020 07:23  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 5, 2020\u003C/time\u003E by Hoozemans\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"Hoozemans","CreatedById":198643,"CreatedDateTime":"2020-06-05T19:32:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223797080\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591291941\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/4/2020 at 7:32 PM, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022198643\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198643-hoozemans/\u0022 rel=\u0022\u0022\u003E@Hoozemans\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo if there is no throtteling you wont get a noticable gain with even an i9-10900k since that runs only about 10% faster...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I\u0027m keeping that in mind as well: it\u0027s likely that new kit will help a bit, but that we really need a software breakthrough to make it work. I wonder how the KSP2 dev team are hoping to tackle the issue. I have some vague ideas for using GPU\u0027s for physics calculation based on how libraries like Tensorflow do their thing, but I\u0027m likely to be miles off \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAnyway, it\u0027s still not a bad idea to have a dedicated machine, optimized for playing KSP.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"superscooper123","CreatedById":205177,"CreatedDateTime":"2020-06-05T21:35:41Z","Content":"\n\u003Cp\u003E\nI was just wondering if Kerbal Space Program will run well (at least 30 fps, 1080 by 720 resolution, medium settings (low if needed)) on my low spec laptop.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSPECS:\n\u003C/p\u003E\n\u003Cp\u003E\nOS: Windows 10 pro, version 2004, build 19640.1\n\u003C/p\u003E\n\u003Cp\u003E\nCPU: 2-core intel i3-8130U (clock speed: 2.208 ghz), 4 logical processors\n\u003C/p\u003E\n\u003Cp\u003E\nSystem Type: x64 64 bit\n\u003C/p\u003E\n\u003Cp\u003E\nLaptop Model: HP Laptop 14-cf0xxx\n\u003C/p\u003E\n\u003Cp\u003E\nInstalled RAM: 8.00 gigabytes (7.87 GB usable)\n\u003C/p\u003E\n\u003Cp\u003E\nVRAM: 128 megabytes\n\u003C/p\u003E\n\u003Cp\u003E\nGPU: intel UHD graphics 620\n\u003C/p\u003E\n\u003Cp\u003E\nStorage: samsung MZNLN128HAHQ-000H1 SATA SSD (118.01 GB, 56.22 GB free) (NTFS file system)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAll windows settings and intel graphics settings are set to max performance.\n\u003C/p\u003E\n\u003Cp\u003E\nI just want to know if KSP will run well, I don\u0027t want to spend $40 on a game that will run at like 10 fps or something.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for any replies!\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2020-06-05T21:48:40Z","Content":"\n\u003Cp\u003E\nI ran KSP for years until recently on a slightly lesser machine.   Your definition of \u0022well\u0022 will vary.   But the 30fps with any reasonably sized ship is a pipe dream. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-05T21:49:16Z\u0022 title=\u002206/05/2020 09:49  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 5, 2020\u003C/time\u003E by Gargamel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"superscooper123","CreatedById":205177,"CreatedDateTime":"2020-06-05T21:59:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223797989\u0022 data-ipsquote-contentid=\u0022194488\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591393720\u0022 data-ipsquote-userid=\u002264714\u0022 data-ipsquote-username=\u0022Gargamel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, Gargamel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI ran KSP for years until recently on a slightly lesser machine.   Your definition of \u0022well\u0022 will vary.   But the 30fps with any reasonably sized ship is a pipe dream. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n thanks! I will consider buying. I wish the demo still existed though...\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nP.S. wdym by \u0022reasonably sized ship\u0022\n\u003C/p\u003E\n\u003Cp\u003E\ndo you mean this:\u003Cimg alt=\u0022A small step for Jebediah, a giant step for Kerbinkind « Otaku ...\u0022 data-ratio=\u002250.84\u0022 width=\u00221127\u0022 src=\u0022https://beust.com/pics/ksp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nthis:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Mun/Minmus rocket for beginners - The Spacecraft Exchange - Kerbal ...\u0022 data-ratio=\u002262.50\u0022 width=\u0022512\u0022 src=\u0022https://lh3.googleusercontent.com/proxy/x_TQBIXl88yLePfnYSxPY2cZD7Ty1_TGZJa4Ldgpt_JDuY40HK3B0PhWGo-UvM21LeSoqL6wjBRU8VRKn_-hJg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nthis:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Kerbal Space Program - Sacred Space Astronomy\u0022 data-ratio=\u002274.44\u0022 width=\u0022403\u0022 src=\u0022https://i2.wp.com/www.vofoundation.org/blog/wp-content/uploads/2015/07/Rocket-going-into-orbit-e1435750053533-300x223.jpg?resize=403%2C300\u0026amp;ssl=1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nthis:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Share your ships. - Kerbal Space Program - Giant Bomb\u0022 data-ratio=\u002264.15\u0022 width=\u00221200\u0022 src=\u0022https://static.giantbomb.com/uploads/original/7/76728/2293845-moon0.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nor this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022What\u0027s the highest mass you\u0027ve ever put into Kerbin orbit with a ...\u0022 data-ratio=\u002256.25\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6sxQ2kg.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-05T22:08:00Z\u0022 title=\u002206/05/2020 10:08  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 5, 2020\u003C/time\u003E by superscooper123\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2020-06-05T22:15:42Z","Content":"\n\u003Cp\u003E\nSomewhere around ship #2 you will notice some lag.  You don\u0027t need high frame rates to have fun with KSP.  I used auto pilots a lot to do most of the flying once I had learned to do them manually, that way I avoided most of the lag headaches. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"superscooper123","CreatedById":205177,"CreatedDateTime":"2020-06-05T22:30:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798005\u0022 data-ipsquote-contentid=\u0022194488\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591395342\u0022 data-ipsquote-userid=\u002264714\u0022 data-ipsquote-username=\u0022Gargamel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Gargamel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSomewhere around ship #2 you will notice some lag.  You don\u0027t need high frame rates to have fun with KSP.  I used auto pilots a lot to do most of the flying once I had learned to do them manually, that way I avoided most of the lag headaches. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nif i wanted bigger ships, i could probably turn down the graphics settings and resolution\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2020-06-06T16:26:14Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205177-superscooper123/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022205177\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/205177-superscooper123/\u0022 rel=\u0022\u0022\u003E@superscooper123\u003C/a\u003E, we have a master thread for this kind of question, and your question has been merged into it. Good luck. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2020-06-06T23:30:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798014\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591396254\u0022 data-ipsquote-userid=\u0022205177\u0022 data-ipsquote-username=\u0022superscooper123\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/6/2020 at 12:30 AM, superscooper123 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nif i wanted bigger ships, i could probably turn down the graphics settings and resolution\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot realy, large partcounts will mostly stress the CPU. But even high end PCs are not able to launch something like in your last picture smoothly...\n\u003C/p\u003E\n\u003Cp\u003E\nThere is also a Demo of KSP which is quite old (Version 1.0), you could try that. Not sure where to find it, though.\n\u003C/p\u003E\n"},{"CreatedByName":"LandSeerZzZ","CreatedById":201751,"CreatedDateTime":"2020-06-07T08:55:08Z","Content":"\n\u003Cp\u003E\nHello Everyone! I want to buy a new comp that will be good for playing ksp with visual mods but also with ksp ie, usi... I really don\u0027t know what comp under 500\u003Cspan\u003E€\u003C/span\u003E will be good for games like KSP, Stellaris, Overwatch and Fallout. Please Help!\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2020-06-07T09:23:40Z","Content":"\n\u003Cp\u003E\nHello \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201751-landseerzzz/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022201751\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/201751-landseerzzz/\u0022 rel=\u0022\u0022\u003E@LandSeerZzZ\u003C/a\u003E, your question has been merged into this thread, dedicated to PC build advice for KSP and other games.\n\u003C/p\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2020-06-07T22:28:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223798708\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591520108\u0022 data-ipsquote-userid=\u0022201751\u0022 data-ipsquote-username=\u0022LandSeerZzZ\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, LandSeerZzZ said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHello Everyone! I want to buy a new comp that will be good for playing ksp with visual mods but also with ksp ie, usi... I really don\u0027t know what comp under 500\u003Cspan\u003E€\u003C/span\u003E will be good for games like KSP, Stellaris, Overwatch and Fallout. Please Help!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy personal cheap wishlist looks like this: \u003Ca href=\u0022https://geizhals.de/?cat=WL-1434413\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://geizhals.de/?cat=WL-1434413\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe GPU is a already discontinued model and you could swap the CPU for a 3300X which has less cores but more power per core. I guess you can\u0027t go much cheaper without sacrificing some vital component.\n\u003C/p\u003E\n"},{"CreatedByName":"LandSeerZzZ","CreatedById":201751,"CreatedDateTime":"2020-06-08T09:38:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223799005\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591568920\u0022 data-ipsquote-userid=\u0022119953\u0022 data-ipsquote-username=\u0022Harry Rhodan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Harry Rhodan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy personal cheap wishlist looks like this: \u003Ca href=\u0022https://geizhals.de/?cat=WL-1434413\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://geizhals.de/?cat=WL-1434413\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe GPU is a already discontinued model and you could swap the CPU for a 3300X which has less cores but more power per core. I guess you can\u0027t go much cheaper without sacrificing some vital component.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks man! Looks great!\n\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2020-06-08T10:06:05Z","Content":"\n\u003Cp\u003E\nYou could try to save some money with buying a used GPU or CPU, there should be lots of Ryzen 1000/2000 available since a lot of people upgraded to an 3000 series one. Similary with RX 470/480/570/580.\n\u003C/p\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2020-06-09T10:25:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223799214\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591610765\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/8/2020 at 12:06 PM, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nlots of Ryzen 1000\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI wouldn\u0027t buy a first generation Ryzen because their memory controllers are extremely picky. And just to be clear: the 1600 [12nm]/[AF] from the list posted above is actually a second generation Ryzen with a horribly confusing name.\n\u003C/p\u003E\n"},{"CreatedByName":"luizsilveira","CreatedById":202087,"CreatedDateTime":"2020-06-13T12:35:06Z","Content":"\n\u003Cp\u003E\n[Edit3] \n\u003C/p\u003E\n\u003Cp\u003E\nNever mind! I was just about to post on the tech support forums, but tried to fire it up again to test I don\u0027t even remember what and it worked perfectly. 1080p, settings all on very high or max, plenty of mods (yet none visual), and 80~90 fps. I\u0027m a happy camper. Apparently all it needed was a few Windows restarts to update all the drivers and all that.\n\u003C/p\u003E\n\u003Cp\u003E\nIt hiccups a bit on load but maybe it\u0027ll one day be fixed by upgrading to an SSD (SSD is life).\n\u003C/p\u003E\n\u003Cp\u003E\nSweet!\n\u003C/p\u003E\n\u003Cp\u003E\nSo after all, it\u0027s an old and cheap system, but apparently I can be one more to recommend the Ryzen 3 2200g with Vega 8 onboard graphics for a budget yet very decent KSP experience.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been reading that a second RAM stick on dual channel (alternate slots(1 and 3 or 2 and 4) can vastly improve performance, so that should be the next step. \n\u003C/p\u003E\n\u003Cp\u003E\n[/Edit3] \n\u003C/p\u003E\n\u003Cp\u003E\nOh boy, talk about disappointment. \u003Cbr\u003E\u003Cbr\u003E\nI play KSP on a potato (a laptop with a celeron and onboard graphics so you get the gist). After my save grew too much I was getting tired of playing with 6fps on larger vessels (even though I got 20~30 on small ones, which was good enough).\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, so after reading a lot of reviews etc. and even watching benchmark videos, I went out and got a Ryzen 3 2200g (edit and 8Gb RAM /edit). I wasn\u0027t expecting stellar performance or anything, and maybe one day I could just stick a dedicated GPU in there for more demanding games. But KSP was my focus and I\u0027m not desperate for heavy/visual mods so I thought it was a good compromise.\n\u003C/p\u003E\n\u003Cp\u003E\nLoad the game up on first launch and... 5fps on the menu screen. After changing resolution from 1080p to 720p, it went up to 7. Changed most if not all settings to a minimum and, alas, 10~12 fps. What? I don\u0027t get it. \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit2: and the problem seems to be with KSP. I fired up Portal 2 to test it. I got 60 fps with 720p and no AA; and 30 fps with either 1080p no AA or with 720p and 2x AA. Not stellar but within what I expected as a ballpark. \u003Cimg alt=\u0022:science:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/science.png\u0022 title=\u0022:science:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-06-13T14:13:50Z\u0022 title=\u002206/13/2020 02:13  PM\u0022 data-short=\u00224 yr\u0022\u003EJune 13, 2020\u003C/time\u003E by luizsilveira\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2020-06-13T20:30:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223802239\u0022 data-ipsquote-contentid=\u0022187327\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221592051706\u0022 data-ipsquote-userid=\u0022202087\u0022 data-ipsquote-username=\u0022luizsilveira\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, luizsilveira said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve been reading that a second RAM stick on dual channel (alternate slots(1 and 3 or 2 and 4) can vastly improve performance, so that should be the next step. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAlso fast RAM (3000-3200MHz). Especially the GPU part is starving if you don\u0027t give it enough memory bandwidth to work with.\n\u003C/p\u003E\n"}]}