{"TopicId":21967,"ForumId":32,"TopicTitle":"Units of measurement.","CreatedByName":"Deltac","CreatedById":12493,"CreatedDateTime":"2012-10-11T19:43:38Z","PageNum":1,"Articles":[{"CreatedByName":"Deltac","CreatedById":12493,"CreatedDateTime":"2012-10-11T19:43:38Z","Content":"\n\u003Cp\u003EThis has been bugging me, but what are all the units for measurement used in KSP? I know what speed is (says it right there), and height, and diameter of rockets (though that seems slightly implied, but works all the same). What about the thrust for our engines? pounds, newtons, so on and so forth? I\u0027m also now wondering how many times this has been posted \u0026gt;_\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-10-11T19:54:27Z","Content":"\n\u003Cp\u003EAccording to the Wiki, everything is in \u003Ca href=\u0022http://kspwiki.nexisonline.net/wiki/Parts\u0022 rel=\u0022external nofollow\u0022\u003ENewtons and Kilograms\u003C/a\u003E, probably because Kerbals are supposed to be so small.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2012-10-11T20:03:14Z","Content":"\n\u003Cp\u003ENotwithstanding what is in the Wiki reference that sal_vager gives above, there seems to be two camps. Units of kilo Newtons (kN) and metric tonnes (t) also work out. In my opinion, it makes more sense to use kN and t because it fits the scale of the parts. Typical Kerbal rockets are on the order of tens of metres tall. It makes sense that rockets of that size would have a mass of several thousand kilograms, rather than several kilos.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-10-11T20:06:51Z","Content":"\n\u003Cp\u003EI agree with PakledHostage on this, it does seem that parts of only a few kilos would be far too light, but I think that ultimately the units used are ambiguous.\u003C/p\u003E\u003Cp\u003EAlso, they are all without doubt Metric.\u003C/p\u003E\n"},{"CreatedByName":"Deltac","CreatedById":12493,"CreatedDateTime":"2012-10-11T20:33:50Z","Content":"\n\u003Cp\u003Ekn makes sense, and so far, I haven\u0027t seen an engine with the same amount of thrust as the Saturn V S-IC stage, however, the use of multiple engine designs, that can probable be obtained. 33,400 kN! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, I forgot about weight. We\u0027ll go with kilo grams then? Not too sure about that as I don\u0027t remember the numbers being that high for the heavier parts I have.\u003C/p\u003E\u003Cp\u003EADDITIONAL: So I looked at the wiki, and the weight measurements seem all wrong. On the 1 meter large fuel tank, it only weighs 2.25kg when full? That\u0027s only 4.96 pounds, and I can safely lift way more than that. I doubt in real life, I\u0027d be able to lift that much fuel by myself. So, they say kilograms, but the measurements just do not seem proper. I think Pakled alluded to that already, but I\u0027m just flabergasted x3\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-11T20:42:27Z\u0022 title=\u002210/11/2012 08:42  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 11, 2012\u003C/time\u003E by Deltac\u003C/strong\u003E\n\u003Cbr\u003ENew information, didn\u0026#039;t want to double post.\n\u003C/span\u003E\n"},{"CreatedByName":"G Addict","CreatedById":2730,"CreatedDateTime":"2012-10-11T21:03:41Z","Content":"\n\u003Cp\u003ESince thrust is kilonewtons according to mechjeb, I\u0027d say masses are in tonnes, which makes sense considering the relative size of the rockets. No way those masses are in kg.\u003C/p\u003E\n"},{"CreatedByName":"Bluejayek","CreatedById":18471,"CreatedDateTime":"2012-10-11T21:32:39Z","Content":"\n\u003Cp\u003EYou have to remember that the laws of physics as they pertain to density and strength of materials in the KSP universe are clearly different. The simplest example: Kerbin has a density of 58.489 g/cm^3. By comparison, in our universe the densest element, osmium, only has a density of 22.6g/cm^3. Hence, kerbin is either some engineered construct of superdense matter, or some physical laws are different. \u003C/p\u003E\u003Cp\u003ETherefore, we can assume that the laws of physics are different enough that a 20m spaceship could weigh 5kg since the materials are strong enough! That being said, 5 tons makes more sense.\u003C/p\u003E\n"},{"CreatedByName":"Deltac","CreatedById":12493,"CreatedDateTime":"2012-10-11T21:54:33Z","Content":"\n\u003Cp\u003EAlso, the laws of physics in a beta are only temporary \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bekiekutmoar","CreatedById":23500,"CreatedDateTime":"2012-10-11T22:11:47Z","Content":"\n\u003Cp\u003EA full fuel tank of 2,25 kg is in my \u0027imagination\u0027 2,25 tons, or 2250 kg. So the small capsule is 800 kg, the large one 4000 kg. A large landing leg 100 kg, just like a small parachute package. And so on ...\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-11T22:12:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EAlso, they are all without doubt Metric.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe the Metric System specifically refers to the SI system and close antecedents (as in poetry, \u0027metric\u0027 relates to the metre) rather than a modular power of ten system in general.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2012-10-12T04:02:30Z","Content":"\n\u003Cp\u003Etonnes an kilograms could be shown in game, depending of order of magnitude, but standard unit for parts should be in kilograms. \u003C/p\u003E\u003Cp\u003ESome conversions on UI level could be useful... for example launch mass could be shown in tons for cleaner readout, but it\u0027s more cosmetic change than necessity.\u003C/p\u003E\n"}]}