{"TopicId":225044,"ForumId":32,"TopicTitle":"Share your custom system (Stock, RSS, a rescale, JNSQ, GPP, other?)","CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2024-06-06T12:19:24Z","PageNum":1,"Articles":[{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2024-06-06T12:19:24Z","Content":"\n\u003Cp\u003E\nI\u0027m just wondering, of the people on the forum, how many out there still use the stock system. If you don\u0027t what do you use?\n\u003C/p\u003E\n\u003Cp\u003E\nMyself, I use my own custom system, that I\u0027ve slowly built up over time, the whole thing overall is 2.25x rescaled:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZQdJC5b.jpeg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022155.25\u0022 height=\u0022562\u0022 width=\u0022362\u0022 src=\u0022https://i.imgur.com/ZQdJC5b.jpeg\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA little description of my changes:\n\u003C/p\u003E\n\u003Cp\u003E\nMoho\u0027s surface gravity was increased\n\u003C/p\u003E\n\u003Cp\u003E\nEve is no 0.95x the radius of kerbin, 0.9G surface G, 4x atmospheric pressure (20 atms)\n\u003C/p\u003E\n\u003Cp\u003E\nDamokli is a Mun sized body at Kerbin\u0027s \u0022psuedo L4\u0022, its right on the edge of stability, like a sword of Damocles hanging over Kerbin, providing the impetus to colonize other worlds.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin: no changes aside from the rescale\n\u003C/p\u003E\n\u003Cp\u003E\n-Mun: moved to where Minmus was, radius decreased to 80% its previous radius (closer to a real Luna analogue)\n\u003C/p\u003E\n\u003Cp\u003E\nDuna: Has gilly as a Mun now, surface gravity increased by 25%, atmospheric pressure decreased by a factor of 3. Voronoi craters have been added, its much more pockmarked, goes along with the thinner atmosphere. Its a closer Mars analogue now\n\u003C/p\u003E\n\u003Cp\u003E\nDres: size and gravity adjusted ot be a better ceres analogue\n\u003C/p\u003E\n\u003Cp\u003E\n-Two more bodies, as Pallas and Vesta analogue, with similar orbits to Dres\n\u003C/p\u003E\n\u003Cp\u003E\nJool: surface G increased to 2.5G, a better Jupiter monologue. \n\u003C/p\u003E\n\u003Cp\u003E\n-Jool moons: Laythe is elsewhere now, Eeloo stands in for it. SMA of moons 1.5x larger than before (on top of the 2.25x rescale), size and gravity tweaked to be better Gallilean moon analogues\n\u003C/p\u003E\n\u003Cp\u003E\nSoong: Obvious stand in for Saturn, Minmus stands in for Enceledus, Ike stands in for Iaptus (and gets voronoi crater treatment), size and gravity tweaks for both.\n\u003C/p\u003E\n\u003Cp\u003E\nNew moon added as a Titan analogue (Brumo, I forgot to change it in the table above, previously called Fuzzo)\n\u003C/p\u003E\n\u003Cp\u003E\nUrtun: a stand in for \u003Cstrong\u003EUr\u003C/strong\u003Eanus and Nep\u003Cstrong\u003Etun\u003C/strong\u003Ee, based on the average stats of the two.\n\u003C/p\u003E\n\u003Cp\u003E\n-Lucita: Stand in for the moon Oberon of Uranus... \n\u003C/p\u003E\n\u003Cp\u003E\n-An asteroid ring/belt, because I can\u0027t be bothered to make more moons\n\u003C/p\u003E\n\u003Cp\u003E\nThen, 1000 KU away is the star Ifasla, Alsafi spelled backwards (alternate name of Sigma Draconis, but in the end, I based it on Tau Ceti)\n\u003C/p\u003E\n\u003Cp\u003E\nCalu - Like Moho, but tidally locked, with an icy backside\n\u003C/p\u003E\n\u003Cp\u003E\nLaythe - now a proper planet around another star\n\u003C/p\u003E\n\u003Cp\u003E\nRald - Mars topo data, with oceans, I used ot have this be a binary planet with Duna, its now in another star system\n\u003C/p\u003E\n\u003Cp\u003E\n-Hobo, based on Mars\u0027 moon P\u003Cstrong\u003Ehobo\u003C/strong\u003Es, in a very low orbit over Rald.\n\u003C/p\u003E\n\u003Cp\u003E\nNeptine: Based on a super-Earth / mini-Neptune. Basically the gas giant of this system, but not that giant and its got an ocean that can be landed on\n\u003C/p\u003E\n\u003Cp\u003E\n-Charo: Based on Triton, orbits retrograde\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n* I initially was using 3x rescale, then 4x, then it felt too grindy, and I settled on 2.25x when I added bodies really far away, and when I needed higher time warp\n\u003C/p\u003E\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2024-06-08T03:26:42Z","Content":"\n\u003Cp\u003E\nI\u0027m a JNSQ player, but also nerf my engines in atmospheres.  I also push the Mun out a little.\n\u003C/p\u003E\n\u003Cp\u003E\nIf i do play a stock sized system i nerf engines still further (see SIMPLEX Propulsion).\n\u003C/p\u003E\n\u003Cp\u003E\nI like your idea of a personally modded system.  I wonder if having a smaller scaled system but with even more nerfed engines would work\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2024-06-08T08:17:05Z","Content":"\n\u003Cp\u003E\nAt what scale do you feel the need to nerf?\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s hard to come to a good number. I figure real chemical rockets can get 450 Isp, and in stock, you get 350, so that\u0027s a 7/9 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E multiplier, and \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E needed scales with the sqrt of the size multiplier, so no nerf needed at 6x (roughly 60% \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E scale)\n\u003C/p\u003E\n\u003Cp\u003E\nExcept that stock tank mass ratios, engine TWRs, and assorted part dry weight are terrible compared to real stuff.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s why I settled on 4x, and was happy with that until I added the system 1000 KU away.... takes a long time to get there, even at max time warp with a ship packing 120km/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E (60 km to get there, 60km to stop)\n\u003C/p\u003E\n\u003Cp\u003E\nGoing to 2.25x already cut that by almost half and made everything less grindy\n\u003C/p\u003E\n\u003Cp\u003E\nFor a career, I plan on duplicating the nuclear lightbulb engine, calling it an Epstein drive, and using KRnD to buff it, and only it - the buffs only go towards the interstellar engine \n\u003C/p\u003E\n\u003Cp\u003E\nInterstellar here is a weak sauce version, but something not to ambitious.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I\u0027ve read, most multi-star systems are much closer (too close to have a solar system like ours around one of them). On the other hand, Proxima centauri is 13000 AU away from Alpa centauri, so 1000 KU seems like a reasonable compromise to me given gameplay limitations \n\u003C/p\u003E\n"},{"CreatedByName":"simonh","CreatedById":57952,"CreatedDateTime":"2024-07-03T20:24:59Z","Content":"\n\u003Cp\u003E\nI\u0027m playing GPP at the moment, but as with the stock system I ignore the home planet\u0027s second moon. Minmus makes stock science mode way too easy, and GPP is also a more fun challenge this way.\n\u003C/p\u003E\n"},{"CreatedByName":"Bellabong","CreatedById":204875,"CreatedDateTime":"2024-07-08T05:48:12Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/gallery/rks-real-kerbolar-system-final-UkzxLbg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/gallery/rks-real-kerbolar-system-final-UkzxLbg\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn short, it\u0027s all the Solar Systems bodies above a certain size cobbled together from various planet mods at 3.2x scale with Principia. A 1:1 copy of the Solar System but \u0022Kerbalized\u0022. \n\u003C/p\u003E\n"},{"CreatedByName":"Lonelykermit","CreatedById":234243,"CreatedDateTime":"2024-07-11T00:00:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224405491\u0022 data-ipsquote-contentid=\u0022225044\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221720417692\u0022 data-ipsquote-userid=\u0022204875\u0022 data-ipsquote-username=\u0022Bellabong\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/8/2024 at 1:48 AM, Bellabong said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/gallery/rks-real-kerbolar-system-final-UkzxLbg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/gallery/rks-real-kerbolar-system-final-UkzxLbg\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn short, it\u0027s all the Solar Systems bodies above a certain size cobbled together from various planet mods at 3.2x scale with Principia. A 1:1 copy of the Solar System but \u0022Kerbalized\u0022. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh my that looks amazing! What planet mods are you using here. I\u0027m able to identify some of them but not others.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-07-11T00:02:32Z\u0022 title=\u002207/11/2024 12:02  AM\u0022 data-short=\u00225 dy\u0022\u003EThursday at 12:02 AM\u003C/time\u003E by Lonelykermit\u003C/strong\u003E\n\u003Cbr\u003EI\u0026#039;m a sucker for proper grammar :p\n\u003C/span\u003E\n"}]}