{"TopicId":22867,"ForumId":32,"TopicTitle":"Colonisation/terraforming - Eve vs Duna","CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-19T15:28:05Z","PageNum":2,"Articles":[{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-04-19T19:56:41Z","Content":"\n\u003Cp\u003EYep, Eve is about 25 times less hostile than Venus.\u003C/p\u003E\u003Cp\u003EAnyway, here\u0027s my completed habitability table:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VrWGWSF.png\u0022 alt=\u0022VrWGWSF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETake conclusions from that if you will, I\u0027m too tired of making tables to number crunch this thing right now.\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-04-19T19:58:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003EI just checked, and it looks like Gilly is a nice and warm 41.38 C (it says 0 in-game, but that\u0027s because the thermometer measures atmospheric temperature. I worked out this value from the luminosity and distance from the Sun). Much more pleasant that the sweltering 150 C summers on Eve.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut it means problems with cooling (which is said to going to be added). Wouldn\u0027t the Ike be better? Colder, yes, but you can build a base and cover it with the regolith plus use the energy from the solar panels to warm it a little bit. And you have quite habitable planet few m/s away. And to make journey even more cheaper in terms of delta-V, you can perform a reverse gravity assist (\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:_Gravity_Assist\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Tutorial:_Gravity_Assist\u003C/a\u003E)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-19T20:01:36Z\u0022 title=\u002204/19/2013 08:01  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 19, 2013\u003C/time\u003E by czokletmuss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-04-19T20:10:22Z","Content":"\n\u003Cp\u003ELooking at my table, in order of habitability, are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EKerbin\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELaythe\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGilly\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ethe Mun\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMinmus\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDuna\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIke\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDres\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMoho\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EVall\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETylo\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBop\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPol\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEeloo\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEve\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis doesn\u0027t take gravity or radiation into account yet, so take these with a grain of salt.\u003C/p\u003E\u003Cp\u003ETL;DR: Gilly is good, Eve is terrible, Duna\u0027s better than most other things\u003C/p\u003E\u003Cp\u003EEDIT: New chart. I\u0027ve added habitability scores (out of ten), the type of the body and whether it has breathable atmosphere.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JJ29syo.png\u0022 alt=\u0022JJ29syo.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-19T20:49:01Z\u0022 title=\u002204/19/2013 08:49  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 19, 2013\u003C/time\u003E by Holo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-04-19T22:00:44Z","Content":"\n\u003Cp\u003EThat\u0027s interesting but since we are speculating in a quasy realistic way we have to take radiation into consideration. Here\u0027s what the neighbourhood of the Jupiter-like planets looks like:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/2/2d/Jupiter_magnetosphere_schematic.jpg\u0022 alt=\u0022Jupiter_magnetosphere_schematic.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou see this ring which connect the innermost moon with the gas giant? This is a plasma torus which provides Io - or in our version, Laythe - with a deadly 3,600 rem (36 Sv) of radiation per day.\u003C/p\u003E\u003Cp\u003EWe should also include distance and inclination - maybe on Moho there is plenty of energy but getting there is a very, very difficult task. The same thing goes for Jool and his moons, not to mention the Eeloo. I would also say that the Dres is not worthy the energy - more or less the same conditions as on the Mun but less energy from the Sun and much more distant target.\u003C/p\u003E\u003Cp\u003ESo effectively we are reduced to the inner planets and not all of them:\u003C/p\u003E\u003Cp\u003E1) Eve - absolutely deadly enviroment, crazy delta-V requirements means this is a one way trip, no solar energy on the surface (90km of clouds folks), high temp and pressure\u003C/p\u003E\u003Cp\u003E2) Gilly - not worth the risk; why go so far if you can effectively have the same conditions (low G) on Minmus? However you get more solar power but less or no water at all, plus the distance between the Kerbin and the settlement is huge\u003C/p\u003E\u003Cp\u003E3) Kerbin SOI - Mun and Minmus are obvious targets, all the minuses are negated by the very close distance to the KSC; few days and you have your supplies/crew\u003C/p\u003E\u003Cp\u003E4) Duna and Ike - like Mun and Minmus but further away\u003C/p\u003E\u003Cp\u003ESo that\u0027s it - Kerbin\u0027s moons, Duna and Ike, maybe Gilly and maybe - if you can deal with the radiation and enormous distance (more or less one year) - Laythe. The rest is a joke \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh and we don\u0027t know whether you can breathe on Laythe - there is a highly reactive oxygen but we (and Kerbals also?) don\u0027t use the pure oxygen to breathe. In fact only 21% of our atmosphere is oxygen, the rest is nitrogen. But this is a big plus since we can use jets on this pretty moon.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-04-19T22:02:47Z","Content":"\n\u003Cp\u003ELaythe\u0027s OK, as long as you don\u0027t want to reproduce ever. Although yeah, there\u0027s way too much radiation. I\u0027ll see if I can calculate some radiation levels for the Joolian moons. I\u0027ll also add gravity to the equation.\u003C/p\u003E\n"},{"CreatedByName":"Elemental","CreatedById":58070,"CreatedDateTime":"2013-04-19T22:34:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022M5000\u0022 data-cite=\u0022M5000\u0022\u003E\u003Cdiv\u003E Eve\u0027s delta-V requirements are simply not sufficient to maintain anything other than a prison. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow THAT is a GREAT plan!\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-19T23:48:30Z","Content":"\n\u003Cp\u003EWith Eve and colonies in general, what exactly are you going to return to Kerbin? Surely not some kind of interplanetary trade in Blutonium? Kerbin is self sufficient and does not really need any kind of resources from offworld colonies given the expenses involved in getting them back to Kerbin (particularly in Eve\u0027s case). So really the only thing you may consider returning from colonies are people. Us humans are already toying with the idea that \u003Ca href=\u0022https://en.wikipedia.org/wiki/Mars_to_Stay\u0022 rel=\u0022external nofollow\u0022\u003Eastronauts going to Mars should stay on Mars\u003C/a\u003E. Given the bravado of Kerbals when it comes to space travel surely they would run their own \u0022Eve to Stay\u0022 colonisation program. So if the requirement becomes \u0022once in a while we may need to lift people into orbit, starting from a 6.5km mountaintop colony\u0022 then it\u0027s not as difficult. Before forum got eaten the most successful ship in the SERV challenge managed to loft two Kerbals back to Eve orbit with around 14 tons of rocket. It was an \u0022open air\u0022 rocket without a command pod, something like:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i36.tinypic.com/2i7l0gn.jpg\u0022 alt=\u00222i7l0gn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo we don\u0027t know how practical it is when we consider it realistically, but still it shows that 7500m/s is within current engineering capabilities. For comparison it takes about 9400m/s to reach LEO from here on Earth.\u003C/p\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-04-19T23:52:46Z","Content":"\n\u003Cp\u003EHolo, turn that spreadsheet into a google doc, I would like to do some work on it.\u003C/p\u003E\n"},{"CreatedByName":"Itsdavyjones","CreatedById":57605,"CreatedDateTime":"2013-04-20T01:16:39Z","Content":"\n\u003Cp\u003EResource transfer will happen. If you\u0027ve read the Mars trilogy, they mine the rare materials like gold and platinum group metals and other rare materials on earth and send it back once a space elevator was built, since it made it many times cheaper than with rocket launches. But if space elevators aren\u0027t introduced, than it would be much cheaper to mine asteroids then planets due to the gravity well. Assuming that asteroids get introduced.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-04-20T07:27:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022czokletmuss\u0022 data-cite=\u0022czokletmuss\u0022\u003E\u003Cdiv\u003EThat\u0027s interesting but since we are speculating in a quasy realistic way we have to take radiation into consideration. Here\u0027s what the neighbourhood of the Jupiter-like planets looks like:\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/2/2d/Jupiter_magnetosphere_schematic.jpg\u0022 alt=\u0022Jupiter_magnetosphere_schematic.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou see this ring which connect the innermost moon with the gas giant? This is a plasma torus which provides Io - or in our version, Laythe - with a deadly 3,600 rem (36 Sv) of radiation per day.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is just a thought and I only have a very basic understanding of planetary physics, but I was thinking Laythe seems pretty far away from the sun considering it\u0027s temperature and it has huge unfrozen oceans. Is it possible it has a very active interior which heats it up (and has many underwater geothermal vents heating the oceans) and this also gives it a very strong magnetic field, protecting it from the massive doses of radiation it would get from Jool to some degree?\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-04-20T08:18:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ROFLCopter64bit\u0022 data-cite=\u0022ROFLCopter64bit\u0022\u003E\u003Cdiv\u003EHolo, turn that spreadsheet into a google doc, I would like to do some work on it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, here\u0027s the google doc: \u003Ca href=\u0022https://docs.google.com/spreadsheet/ccc?key=0AkQSKd3qq9H_dF9CbDBDcEZiSGhxZjhzX0J2SnBtX0E\u0026amp;usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/spreadsheet/ccc?key=0AkQSKd3qq9H_dF9CbDBDcEZiSGhxZjhzX0J2SnBtX0E\u0026amp;usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou just edit it how it is, it\u0027s a copy of the main one.\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-04-20T08:32:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbface\u0022 data-cite=\u0022Kerbface\u0022\u003E\u003Cdiv\u003EIs it possible it has a very active interior which heats it up (and has many underwater geothermal vents heating the oceans) and this also gives it a very strong magnetic field, protecting it from the massive doses of radiation it would get from Jool to some degree?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne doesn\u0027t imply the other. Moons of gas giants can have very active interiors, but it\u0027s not for the same reasons Earth\u0027s interior is active. Instead, it\u0027s because the tidal forces from the gas giant pull on the moon so hard that the center stays warm from the stretching and contraction; this is why it\u0027s commonly thought that Europa\u0027s oceans are liquid, underneath a thin layer of ice, and several other moons have geysers or volcanoes. The liquid oceans on Europa do affect the magnetic field caused by Jupiter, but the amount it does this is thousands of times smaller than the strength of Earth\u0027s magnetic field, so it wouldn\u0027t have any real effect on the amount of radiation.\u003C/p\u003E\u003Cp\u003ELaythe isn\u0027t exactly a perfect analogue of Europa, but it\u0027s meant to be similar. Regardless, the amount of energy coming off any gas giant would be enough to cause problems.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-04-20T08:36:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spatzimaus\u0022 data-cite=\u0022Spatzimaus\u0022\u003E\u003Cdiv\u003EOne doesn\u0027t imply the other. Moons of gas giants can have very active interiors, but it\u0027s not for the same reasons Earth\u0027s interior is active. Instead, it\u0027s because the tidal forces from the gas giant pull on the moon so hard that the center stays warm from the stretching and contraction; this is why it\u0027s commonly thought that Europa\u0027s oceans are liquid, underneath a thin layer of ice, and several other moons have geysers or volcanoes. The liquid oceans on Europa do affect the magnetic field caused by Jupiter, but the amount it does this is thousands of times smaller than the strength of Earth\u0027s magnetic field, so it wouldn\u0027t have any real effect on the amount of radiation.\u003Cp\u003ELaythe isn\u0027t exactly a perfect analogue of Europa, but it\u0027s meant to be similar. Regardless, the amount of energy coming off any gas giant would be enough to cause problems.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo it\u0027s not possible that the moon could have a strong enough magnetic field to protect it from lethal radiation doses?\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-04-20T08:53:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbface\u0022 data-cite=\u0022Kerbface\u0022\u003E\u003Cdiv\u003ESo it\u0027s not possible that the moon could have a strong enough magnetic field to protect it from lethal radiation doses?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t say IMPOSSIBLE, but with what we\u0027ve seen, it probably can\u0027t. Laythe is in a tidal lock with Jool, so it wouldn\u0027t be spinning fast enough to generate a magnetic field from any metal content. (Even if it had much metal content to begin with, which many moons don\u0027t. Our own moon is very metal-poor.) Europa\u0027s magnetic field is basically an induced effect from coupling with Jupiter\u0027s own field through its salt water content. But salt water isn\u0027t THAT conductive, and the amount of water on the planet isn\u0027t much compared to the size of the interior. Europa\u0027s magnetic field strength is only about 400 nanoTeslas, while Earth\u0027s magnetic field at the equator is about a hundred times stronger than that (31 microTeslas).\u003C/p\u003E\u003Cp\u003ERealistically, what\u0027ll save Laythe from hard solar radiation would be the fact that it\u0027s well inside Jool\u0027s magnetic field; Jupiter\u0027s magnetic field is far stronger than Earth\u0027s, and it\u0027s not unreasonable to expect the same of Jool, so Laythe would be protected from the high-energy solar particles that Earth\u0027s Van Allen belts stop. But, that wouldn\u0027t help it survive the massive amount of high-energy particles contained within Jool\u0027s field itself, so Laythe should be completely inhospitable to life.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-04-20T08:58:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spatzimaus\u0022 data-cite=\u0022Spatzimaus\u0022\u003E\u003Cdiv\u003EI wouldn\u0027t say IMPOSSIBLE, but with what we\u0027ve seen, it probably can\u0027t. Laythe is in a tidal lock with Jool, so it wouldn\u0027t be spinning fast enough to generate a magnetic field from any metal content. (Even if it had much metal content to begin with, which many moons don\u0027t. Our own moon is very metal-poor.) Europa\u0027s magnetic field is basically an induced effect from coupling with Jupiter\u0027s own field through its salt water content. But salt water isn\u0027t THAT conductive, and the amount of water on the planet isn\u0027t much compared to the size of the interior. Europa\u0027s magnetic field strength is only about 400 nanoTeslas, while Earth\u0027s magnetic field at the equator is about a hundred times stronger than that (31 microTeslas).\u003Cp\u003ERealistically, what\u0027ll save Laythe from hard solar radiation would be the fact that it\u0027s well inside Jool\u0027s magnetic field; Jupiter\u0027s magnetic field is far stronger than Earth\u0027s, and it\u0027s not unreasonable to expect the same of Jool, so Laythe would be protected from the high-energy solar particles that Earth\u0027s Van Allen belts stop. But, that wouldn\u0027t help it survive the massive amount of high-energy particles contained within Jool\u0027s field itself, so Laythe should be completely inhospitable to life.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELaythe does have some life on it. It just can\u0027t support multicellular life.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-04-20T09:28:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spatzimaus\u0022 data-cite=\u0022Spatzimaus\u0022\u003E\u003Cdiv\u003EI wouldn\u0027t say IMPOSSIBLE, but with what we\u0027ve seen, it probably can\u0027t. Laythe is in a tidal lock with Jool, so it wouldn\u0027t be spinning fast enough to generate a magnetic field from any metal content. (Even if it had much metal content to begin with, which many moons don\u0027t. Our own moon is very metal-poor.) Europa\u0027s magnetic field is basically an induced effect from coupling with Jupiter\u0027s own field through its salt water content. But salt water isn\u0027t THAT conductive, and the amount of water on the planet isn\u0027t much compared to the size of the interior. Europa\u0027s magnetic field strength is only about 400 nanoTeslas, while Earth\u0027s magnetic field at the equator is about a hundred times stronger than that (31 microTeslas).\u003Cp\u003ERealistically, what\u0027ll save Laythe from hard solar radiation would be the fact that it\u0027s well inside Jool\u0027s magnetic field; Jupiter\u0027s magnetic field is far stronger than Earth\u0027s, and it\u0027s not unreasonable to expect the same of Jool, so Laythe would be protected from the high-energy solar particles that Earth\u0027s Van Allen belts stop. But, that wouldn\u0027t help it survive the massive amount of high-energy particles contained within Jool\u0027s field itself, so Laythe should be completely inhospitable to life.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAw, well that\u0027s a bit of a shame. I thought the idea of landing a colony on Laythe or finding some sort of life in it\u0027s oceans would be pretty cool...\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-04-20T09:46:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmappedout\u0022 data-cite=\u0022allmappedout\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://www.lsbu.ac.uk/water/phase.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.lsbu.ac.uk/water/phase.html\u003C/a\u003E\u003Cp\u003EHigher pressure causes water to stay liquid even beyond its normal boiling point. Not sure of the exact point (guessing that 2atm probably isn\u0027t enough to counterbalance the 50 degree temperature difference), but it\u0027s not impossible.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhh I see thanks, I was wondering about that.\u003C/p\u003E\u003Cp\u003EAs to the original question I think Duna would be the more habitable due it being easier to return from, although given the choice of planets and moons Laythe would be the obvious logical choice for a colony in the game.\u003C/p\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-04-20T10:01:17Z","Content":"\n\u003Cp\u003EHospitality isn\u0027t the only reason you want to set up camp places; it\u0027s the shiny things that make you want them.\u003C/p\u003E\u003Cp\u003EAs far as scarcity goes, Eve is best place to get expensive stuff. Even though that it was the worst rated in the Kerbal Holiday Reviews.\u003C/p\u003E\n"},{"CreatedByName":"azazel1024","CreatedById":44262,"CreatedDateTime":"2013-04-20T10:56:31Z","Content":"\n\u003Cp\u003EOne thing to take in to consideration is that Laythe also has a moderate atmosphere, and this would do a fair amount to screen some of the high energy particles. It would not be as effective as a good magnetic field, but it would reduce some of the impacts of the radiation contained within Jools magnetic field.\u003C/p\u003E\n"},{"CreatedByName":"drakesdoom","CreatedById":57297,"CreatedDateTime":"2013-04-20T11:03:17Z","Content":"\n\u003Cp\u003EHas anyone stopped to consider that this is not NASA but KSP, the main difference being we are using kerbals. It seems to me that their think green hide skin and large overly think lead laced skull would protect them from significant radiation doses. Also what If I told you the only way to fuel your nerva rockets was with eveian fuel? We here at KSP believe in the jeb way, if there is a problem MOAR BOOSTERS!!!\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-04-20T11:03:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022azazel1024\u0022 data-cite=\u0022azazel1024\u0022\u003E\u003Cdiv\u003EOne thing to take in to consideration is that Laythe also has a moderate atmosphere, and this would do a fair amount to screen some of the high energy particles. It would not be as effective as a good magnetic field, but it would reduce some of the impacts of the radiation contained within Jools magnetic field.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know it\u0027s tidal locked in the game, this is all what if, but if Laythe did have a significant spin, would my earlier suggestion be possible?\u003C/p\u003E\n"},{"CreatedByName":"azazel1024","CreatedById":44262,"CreatedDateTime":"2013-04-20T12:59:49Z","Content":"\n\u003Cp\u003EYes it would.\u003C/p\u003E\u003Cp\u003ETo expand, even without a significant magnetic field of its own, it is likely to have low enough radiation to have life. Or at least the possibility of life. Especially within its oceans where received radiation doses would be significantly less than on the surface.\u003C/p\u003E\u003Cp\u003EThe atmosphere would provide a fair amount of protection, even if doses would be dozens-hundreds of times higher than background radiation on Earth. Light protection could still do for you and light construction techniques would be all you\u0027d need for buildings. Just make sure you don\u0027t sunbathe too much (err, well stand under exposed skys). At least not with a light protective suit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T13:02:25Z\u0022 title=\u002204/20/2013 01:02  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by azazel1024\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-20T13:07:38Z","Content":"\n\u003Cp\u003EEven if the surface of Laythe is scarred by ionising radiation life would be able to survive in the oceans. Remember every 7 cm of water cuts radiation by 50%. You can safely swim in nuclear reactor\u0027s spent fuel pool. In fact diving into the spent fuel pool will actually cause you to receive less radiation than you would in everyday life from background radiation, as long as you don\u0027t dive to the bottom where the spent rods are:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://what-if.xkcd.com/imgs/a/29/pool_danger.png\u0022 alt=\u0022pool_danger.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://what-if.xkcd.com/29/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://what-if.xkcd.com/29/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve seen a few suggestion where deep space spacecrafts should have a \u0022radiation shelter\u0022 where it\u0027s a small room completely surrounded (except for the entrance tunnel) by the ship\u0027s water storage tank.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T13:11:16Z\u0022 title=\u002204/20/2013 01:11  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-04-20T13:19:40Z","Content":"\n\u003Cp\u003EYeah, but it\u0027s like building a base on Europa and Mars. Due to distance and hence the cost, you will always be able to send more payload to Mars then to Europa. Which means you could either have a decent size base on the Red Planet or a small outpost on Europa. Tyranny of the rocket equation - you can\u0027t just ignore the delta-V requirements for Laythe, especially with comparison to Duna, which is the closest planet to Kerbin in terms of m/s.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-20T13:35:29Z","Content":"\n\u003Cp\u003EEve actually has a slightly lower delta-V requirement compared to Duna. Being an inferior planet it also has a shorter travel time.\u003C/p\u003E\n"}]}