{"TopicId":22920,"ForumId":32,"TopicTitle":"The Grand Tour - Landing Jeb on every body in the system using only one ship","CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2013-04-19T19:31:19Z","PageNum":1,"Articles":[{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2013-04-19T19:31:19Z","Content":"\n\u003Cp\u003ESo after doing a few missions with gravity assists, I began to think if it would be possible to have a single ship leave low Kerbin orbit and take Jeb to every landable planet and moon in the Kerbal system without refueling. This is my attempt.\u003C/p\u003E\u003Cp\u003EJeb would stay in a single capsule the entire time. The capsule could be docked with landers that would detach from the main ship and take him down to every planet and moon, while the main ship stayed in orbit.\u003C/p\u003E\u003Cp\u003ESo first I designed some landers for every body. A large lander with parachutes that could land and take off from the highest point on Eve, a medium lander that could land and take off from Tylo, a medium lander with parachutes that could land and take off from Laythe and Duna, and a small lander that could land and take off from everywhere else. Then I docked with a truss structure and a large nuclear interplanetary stage in Kerbin orbit to make a single ship (which was not too large, only about 300 parts and about).\u003C/p\u003E\u003Cp\u003EI used a lot of gravity assists to save fuel. I went to Eve first, to get rid of the heaviest lander, then to Jool\u0027s moons, then to Eeloo, Dres, Duna and Ike, Moho, Minmus, Mun, and Kerbin. I would first establish a very elliptical orbit around a body before detaching a lander and landing on it, for maximum delta-v savings. I used aerobraking whenever I could. But I failed. I still couldn\u0027t make it all the way without refueling. I refueled a total of 3 times, each time with 720 units of fuel (1/4 of an orange tank), the first time being at Duna, and I arrived at Kerbin with about 300 units of fuel. If I didn\u0027t waste about 1000 m/s delta-v to leave Jool\u0027s SoI, and used the small lander to land on Duna instead of dragging the heavy Laythe lander all the way there, I could have definitely gone to all the moons and planets except Moho with this ship. But including Moho adds a lot of delta-v that would have required a bigger ship (maybe adding a copy of the interplanetary nuclear stage to the front and using it as a first stage).\u003C/p\u003E\u003Cp\u003EAnyway, it was still fun and a great experience. Here are the pictures. (warning, about 300 images total)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/sLTel\u0022 rel=\u0022external nofollow\u0022\u003EPart 1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/w5lDN\u0022 rel=\u0022external nofollow\u0022\u003EPart 2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/tU7qm\u0022 rel=\u0022external nofollow\u0022\u003EPart 3\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJust the design of the ship (I ended up using 1 nuclear engine per fuel tank instead of 3):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mzCYuEs.jpg\u0022 alt=\u0022mzCYuEs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./?vxsg0xukxr7qu9w\u0022 rel=\u0022external nofollow\u0022\u003EThis is the craft file\u003C/a\u003E. (only the assembly, not the rockets used to take every part into Kerbin orbit)\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2013-04-19T19:51:37Z","Content":"\n\u003Cp\u003EExcellent work sir, I kept on starting such an endeavor but tended to give up and play with other things.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-04-19T20:07:33Z","Content":"\n\u003Cp\u003Ewow, nice job, even thou you had to re-fuel. But trying to do it without refuelling is quite a task you set yourself.\u003C/p\u003E\n"}]}