{"TopicId":23778,"ForumId":32,"TopicTitle":"Cemetery of Kerbals.","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2013-04-24T00:27:58Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2013-04-24T00:27:58Z","Content":"\n\u003Cp\u003EA moment to rest for your fallen Kerbals.\u003C/p\u003E\u003Cp\u003ENow, please name some of the Kerbals that you have brutally murdered or had an inadvertent death. Please post why they were awesome, how they died, what mission, all the details. Please no Jebs, Bills, or Bobs unless they were really meaningful to you. (I.E., First kerbal in space, first kerbal on the Mun, first on anything, did something awesome).\u003C/p\u003E\u003Cp\u003EI miss Billy-Bobfred Kerman\u003C/p\u003E\u003Cp\u003EHe was trying to fly a 5-part airplane and he died because the center of lift was off of the center of mass. He was my first Kerbal to perform a Trans-Munar-Injection, but he did not have the fuel to land, so he returned. He is one of my special Kerbals.\u003C/p\u003E\n"},{"CreatedByName":"Custard Donut (In Space)","CreatedById":58058,"CreatedDateTime":"2013-04-24T00:36:35Z","Content":"\n\u003Cp\u003EOrwig \u0022Icarus\u0022 Kerman pushed down a little too hard on his jetpack accelerator while on the Mun, flew too high and too fast and came down again with a splat, making a little crater of his own which is now named in his honour.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-24T00:40:29Z\u0022 title=\u002204/24/2013 12:40  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 24, 2013\u003C/time\u003E by Custard Donut (In Space)\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Antaxus","CreatedById":59557,"CreatedDateTime":"2013-04-24T00:52:12Z","Content":"\n\u003Cp\u003EJebediah Kerman, ran out of fuel in the middle of a landing.\u003C/p\u003E\u003Cp\u003EBill kerman, (he is still missing) missing after going into EVA while orbiting the mun. Some people say that he is still there waiting for rescue, but we don\u0027t have the money to send a rescue mission.\u003C/p\u003E\n"},{"CreatedByName":"Xionis","CreatedById":59696,"CreatedDateTime":"2013-04-24T00:59:48Z","Content":"\n\u003Cp\u003EFirst kerbal to break orbit. \u003C/p\u003E\u003Cp\u003EBill Kerman. \u003C/p\u003E\u003Cp\u003EBroke orbit so hard he left the solar system. (Technically not dead yet but seriously how much food could their be in that 1 man pod....)\u003C/p\u003E\n"},{"CreatedByName":"Curs0r","CreatedById":60051,"CreatedDateTime":"2013-04-24T01:02:30Z","Content":"\n\u003Cp\u003EMilkin Kerman. Fondly remembered as the first of our heroes to be crushed by the force of his own ship\u0027s acceleration.\u003C/p\u003E\n"},{"CreatedByName":"Warscribe","CreatedById":58388,"CreatedDateTime":"2013-04-24T01:16:00Z","Content":"\n\u003Cp\u003EBilory Kerman and Alzer Kerman; testers of the on-kerbin crew retriever ship Sysiphos III and IV. Bilory splashed into the ocean, as the engines failed to a lack of fuel crossfeed cables, but survived. Alzer Kerman rescued him with the water-retriever ship Sysiphos IV, everything went fine, but when they tried to get back to land, the ship hit the velocity breakdown at 40m/s in the water, which not only did destroy the engines, but pulverzied both crew compardments.\u003C/p\u003E\u003Cp\u003EKirk Kerman, pilot of the Hermes II, an explorer ship, died of what seemed to be suicide. As the fuel ran low, he first aimed for a stanrd landing, but as his fuel ran out, he realized he would crash into the ground at 150m/s. Then, the unthinkable happened. he realized that his parachutes where deployed at the starting point for some reason... So he opened the crew hatch, got out and embraced death at hitting the ground with Hermes II and the resulting explosion.\u003C/p\u003E\n"},{"CreatedByName":"Peenvogel","CreatedById":59022,"CreatedDateTime":"2013-04-24T01:26:42Z","Content":"\n\u003Cp\u003ENow that I play with the crew manifest mod, my Kerbals mean significantly more to me. I like to start out with a team of ten Kerbals that I all name after famous astronauts and play in DID mode, just to see how far I can come. Neil and Buzz Kerbal both made it to the Mun and back (after a rescue operation) and were later involved in the testing of a new escape tower. After some unmanned test flights, Buzz voluntarily applied for the manned test flight. I had balanced the whole tower, but forgot to add up the weight for a Kerbal passenger (didn\u0027t know they weigh anything, but they do!) When the pod came down, the chutes were torn off and the whole contraption crashed into the ground with a velocity of over 150 m/s. There was not even a need for burying him anymore. \u003C/p\u003E\u003Cp\u003EYour thread title gave me the idea that it would actually be very cool to have a cemetry or a memorial ground (maybe somewhere near the KSC monolith) with headstones that have the deceased Kerbal\u0027s name on it.\u003C/p\u003E\n"},{"CreatedByName":"viktorserecros","CreatedById":58331,"CreatedDateTime":"2013-04-24T01:55:26Z","Content":"\n\u003Cp\u003EDunner Kerbal\u003C/p\u003E\u003Cp\u003EHis flight after dinner\u003C/p\u003E\u003Cp\u003EWas no winner\u003C/p\u003E\u003Cp\u003EAnd now late at night,\u003C/p\u003E\u003Cp\u003EYou can see ol\u0027 Dunner\u003C/p\u003E\u003Cp\u003EWishing he could have his Dinner\u003C/p\u003E\u003Cp\u003EO.I.P Dunner Kerbal\u003C/p\u003E\u003Cp\u003E(orbit in peace)\u003C/p\u003E\n"},{"CreatedByName":"willneu97","CreatedById":14989,"CreatedDateTime":"2013-04-24T02:00:11Z","Content":"\n\u003Cp\u003ELembas Kerman.\u003C/p\u003E\u003Cp\u003EHe was the first kerbal to successfully land on Tylo.\u003C/p\u003E\u003Cp\u003EHe would have been the first to set foot on it, but when he did the game glitched and he was blasted out of the solar system at 9x the speed of light.\u003C/p\u003E\u003Cp\u003EWhat a way to go out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-24T02:09:11Z\u0022 title=\u002204/24/2013 02:09  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 24, 2013\u003C/time\u003E by willneu97\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2013-04-24T02:08:32Z","Content":"\n\u003Cp\u003ERodlin Kerman.\u003C/p\u003E\u003Cp\u003EGot hit in the head by a 100 ton rocket.\u003C/p\u003E\u003Cp\u003EThe last thing he saw:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TnO97Jm.png\u0022 alt=\u0022TnO97Jm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat happened? I made him lie down on the ramp to watch a rocket launch, but as soon as I switched focus, the liquid engines shut down and the solids kept burning. The rocket ran out of fuel and crashed. On his head. Sentence fragments.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-24T02:14:34Z\u0022 title=\u002204/24/2013 02:14  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 24, 2013\u003C/time\u003E by Giggleplex777\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-04-24T02:17:02Z","Content":"\n\u003Cp\u003EThe cool thing about a Kerbal cemetery, is rather than having R.I.P. on their graves, they just have R.I: \u003C/p\u003E\u003Cp\u003ERespsawn In!\u003C/p\u003E\u003Cp\u003EWhen a Kerbal dies, everyone misses him, but we know he will rise again.\u003C/p\u003E\u003Cp\u003EI believe in Jesus as my lord and savior, and it\u0027s a bit like that for me in real life. Friends and relatives die, but I know I will see them again in the new creation.\u003C/p\u003E\u003Cp\u003EExcept for Kerbals, it\u0027s more of a cross between Doctor Who style regeneration, and coming back as a zombie.\u003C/p\u003E\u003Cp\u003ESo rest in piece, brave Kerbalnauts. For you will rise again!\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-04-24T02:41:52Z","Content":"\n\u003Cp\u003ELozon Kerman, lost after the first successful SSTO spaceplane re-entered and overshot the KSC by a few (50 or so) Kilometers, with only very minimal fuel remaining... Hit the ocean at 120m/s\u003C/p\u003E\n"}]}