{"TopicId":24069,"ForumId":32,"TopicTitle":"A file is put on your desk.","CreatedByName":"NuclearWarfare","CreatedById":42325,"CreatedDateTime":"2013-04-25T17:40:01Z","PageNum":1,"Articles":[{"CreatedByName":"NuclearWarfare","CreatedById":42325,"CreatedDateTime":"2013-04-25T17:40:01Z","Content":"\n\u003Cp\u003E\u0022Sir/Ma\u0027am, the mining tools have arrived,\u0022 your assistant says. Where do you decide to start your mining operations?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-25T17:42:55Z\u0022 title=\u002204/25/2013 05:42  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 25, 2013\u003C/time\u003E by NuclearWarfare\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"musicpenguin","CreatedById":57938,"CreatedDateTime":"2013-04-25T17:41:22Z","Content":"\n\u003Cp\u003EHmm, Mun then minmus and then on to duna. Then wherever fate brings me.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-04-25T17:44:45Z","Content":"\n\u003Cp\u003E*with matching pose* \u0022MINE ALL THE PLERNERTS!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Torham234","CreatedById":58574,"CreatedDateTime":"2013-04-25T17:45:47Z","Content":"\n\u003Cp\u003Eshelve them until the career mode is implemented\u003C/p\u003E\n"},{"CreatedByName":"tiger336","CreatedById":5175,"CreatedDateTime":"2013-04-25T17:47:20Z","Content":"\n\u003Cp\u003EStart with the mun then the min then dune and lathe\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-04-25T17:47:22Z","Content":"\n\u003Cp\u003EI seriously read the title as \u0022A fire is put on your desk.\u0022 \u003C/p\u003E\u003Cp\u003EI start mining on Mun, Minmus, Gilly, and Pol.\u003C/p\u003E\u003Cp\u003EMun: Close as hell to Kerbin. High deposits of Kethane, so I imagine the other resources would be abundant there as well, and if not, whatever I COULD get from the Mun is, you know, right on my doorstep, no multi-month mining missions.\u003C/p\u003E\u003Cp\u003EMinmus: Basically the same reasons as the Mun, except the color is much more annoying.\u003C/p\u003E\u003Cp\u003EGilly: Pretty much the lowest delta-V cost to get to interplanetary. Easy to take off and land on, though rendezvous with the huge captured asteroid is a bit tricky. Easy to map, I\u0027m guessing. \u003C/p\u003E\u003Cp\u003EPol: Similar reasons to Gilly, as it\u0027s the SECOND lowest gravity planet currently in the game. However, preliminary mapping shows that Kethane deposits are scarce (yet present), and if resource density is assumed to be the same for other resources, it may be limiting in the places we can mine.\u003C/p\u003E\u003Cp\u003EDuna is another viable option, as the atmosphere allows for parachute landing (shut up, it does, I\u0027ve had a design fail because the skycrane touched down safely with parachutes and had to be thrown away so the rover can be deployed.) So, a parachute landing would rid a lot of delta-V, and it just seems like a friendly place to set up a base. Like, it just feels /right/.\u003C/p\u003E\n"},{"CreatedByName":"SteevyT","CreatedById":6183,"CreatedDateTime":"2013-04-25T17:53:14Z","Content":"\n\u003Cp\u003ERight next to the launch pad so I can test how they work.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-04-25T17:56:17Z","Content":"\n\u003Cp\u003EI\u0027d probably have gas refinery ships around Jool, and a huge mining base on Minmus.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-04-25T17:57:28Z","Content":"\n\u003Cp\u003EEve for the fuel. Who knows, a fully fueled ship might make it back from Eve\u0027s surface...\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-04-25T18:01:11Z","Content":"\n\u003Cp\u003EIke, to support Duna missions.\u003C/p\u003E\n"},{"CreatedByName":"NuclearWarfare","CreatedById":42325,"CreatedDateTime":"2013-04-25T18:01:49Z","Content":"\n\u003Cp\u003EI will probably mine on Ike after getting my barrings by mining on Minmus\u0027s frozen ice lakes.\u003C/p\u003E\u003Cp\u003EI need to get to Ike..\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-25T18:14:57Z","Content":"\n\u003Cp\u003EJust spitballing here, but how about where the resources are?\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-04-25T18:32:34Z","Content":"\n\u003Cp\u003EI guess scanning all the planets will probably be my first mission, just to see which world has what. My first landed mission beyond Kerbin will be Minmus, then the Mun.\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2013-04-25T18:33:11Z","Content":"\n\u003Cp\u003EMun, Dres, Vall and minmus, vall as it looks cool, Dres as it is easy to get to and Mun for practicality\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2013-04-25T18:59:30Z","Content":"\n\u003Cp\u003EI would practice right next to the launch pad, then head straight to the Laythe colony lagoon.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-04-25T19:19:39Z","Content":"\n\u003Cp\u003EFirst Kerbin - to learn the ropes. Then Mun or Minmus - depending on what my probes find. Then Ike - to have handy center of operations for Duna. Then Vall or Bop - to have outpost in Jool sector. Next? Depends...\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-04-25T19:31:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EI guess scanning all the planets will probably be my first mission, just to see which world has what. My first landed mission beyond Kerbin will be Minmus, then the Mun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame. When we thought we were getting mining in 0.19, I had already designed my scanning satellite, had a few launch vehicles so I could get it anywhere, etc.\u003C/p\u003E\u003Cp\u003EAs for Minmus first... absolutely. Less gravity than the Mun means that the same amount of work yields more results in LKO. Then again, I should check out how well the new rover wheels work on Minmus first. For some reason, I\u0027ve been slacking on playing around with the new rover wheels.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2013-04-25T19:36:09Z","Content":"\n\u003Cp\u003EKSC, then MÃƒÂ¼n/Minmus, then... we\u0027ll see.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-04-25T19:50:02Z","Content":"\n\u003Cp\u003EHas used kertane a lot, Minmus is the most obvious target as the low gravity makes it cheap to get stuff up, an perfect waystation for refueling ships who leaves the system. Mun has higher gravity making it harder to get heavy loaded miners off, larger engines and you burn more of the fuel. \u003C/p\u003E\u003Cp\u003EGilly is another nice target for filling up Eve landers before they go down. \u003C/p\u003E\u003Cp\u003EThis depend a bit on how the resources are distributed. Gilly might be poor of resources. Laythe on the other hand will be easy as you can just crack seawater.\u003C/p\u003E\n"},{"CreatedByName":"Nemoricus","CreatedById":4141,"CreatedDateTime":"2013-04-25T20:17:43Z","Content":"\n\u003Cp\u003EGilly if at all possible. An Eve lander is one of the only things I haven\u0027t done in this game, and the ability to draw resources from that moon would make it much easier.\u003C/p\u003E\n"},{"CreatedByName":"Agent30632","CreatedById":58734,"CreatedDateTime":"2013-04-25T21:28:11Z","Content":"\n\u003Cp\u003EEve, and Minmus. Eve is because I heard that there is blutonium or something in the oceans.\u003C/p\u003E\u003Cp\u003EMinmus because I can.\u003C/p\u003E\n"},{"CreatedByName":"NannerManCan","CreatedById":27019,"CreatedDateTime":"2013-04-25T21:34:00Z","Content":"\n\u003Cp\u003EI would start my mining right under the launch pad. Enough so that the launch pad starts sinking into the ground \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ROFLCopter64bit","CreatedById":58314,"CreatedDateTime":"2013-04-25T21:39:10Z","Content":"\n\u003Cp\u003EThe North Pole. Who knows what goodies are hidden under there, and I might just catch myself a santa claus \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-04-25T22:20:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022M5000\u0022 data-cite=\u0022M5000\u0022\u003E\u003Cdiv\u003EI seriously read the title as \u0022A fire is put on your desk.\u0022 \u003Cp\u003E*snip*\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eso, that\u0027s your standard Monday morning too then?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003EMun, Dres, Vall and minmus, vall as it looks cool, Dres as it is easy to get to and Mun for practicality\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was beginning to wonder if I was mad cos I was thinking Dres, glad to see at least one other suggest it.\u003C/p\u003E\u003Cp\u003EObv the real low grav moons like Ike, Gily, Bop, Pol are winners as you can lift things up from them easily, but Dres is a nice place to mine too. Of all the \u003Cem\u003Eplanets\u003C/em\u003E I think it would be the easiest to mine, being a planet rather than a moon and being bigger than any moon (I think) it may have more resources and also its good halfway point on your way out to Jool or Eeloo. \u003C/p\u003E\u003Cp\u003EDuna has the advantage of being able to parachute down to the mining site, but with Ike right there, why bother with Duna when lifting loads.\u003C/p\u003E\u003Cp\u003Etbh eventually I will prob set up small mining colonies on most places.\u003C/p\u003E\n"},{"CreatedByName":"leopardenthusiast","CreatedById":26084,"CreatedDateTime":"2013-04-25T22:50:53Z","Content":"\n\u003Cp\u003EKerbin. Why? Well, I\u0027m getting closer to a working SSTO, and I want to actually reuse my reusable spacecraft. This means payloads must be attached by docking ports, and moved into position by rovers. It also means that I need a proper fuel supply - and I refuse to just \u0022launch\u0022 orange tanks with wheels and Kerbal Attachment System parts onto the launchpad, I have to go mining! It\u0027s essential!\u003C/p\u003E\u003Cp\u003EIn unrelated news, I see a lot of Damned Robotics and Kerbal Attachment System in my future.\u003C/p\u003E\n"}]}