{"TopicId":24150,"ForumId":32,"TopicTitle":"Precision landing","CreatedByName":"flyin_ruski","CreatedById":60421,"CreatedDateTime":"2013-04-26T03:42:09Z","PageNum":1,"Articles":[{"CreatedByName":"flyin_ruski","CreatedById":60421,"CreatedDateTime":"2013-04-26T03:42:09Z","Content":"\n\u003Cp\u003EIs quite difficult but I think I have become somewhat good at it. I can land a craft within 2km of my target. My best so far was today while trying to fly a second module to my mun base. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uSecfV0.jpg\u0022 alt=\u0022uSecfV0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/41oMcJs.jpg\u0022 alt=\u002241oMcJs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FriSTVE.jpg\u0022 alt=\u0022FriSTVE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe third picture shows the two modules docked together after driving the module a short distance from the landing site to the base.\u003C/p\u003E\u003Cp\u003EI had to quick load multiple times and realized that my skycrane wasnt functional so actually landing the module upright became more difficult than try to land within a few km of the target. \u003C/p\u003E\u003Cp\u003EAnyone have any tips on precision landing? Please no Mechjeb.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-04-26T04:11:24Z","Content":"\n\u003Cp\u003EIf you don\u0027t want MechJeb for precision guidance (which works great for hand-flown landings), the only other solution is practice. Lots and lots of practice.\u003C/p\u003E\n"},{"CreatedByName":"Superluminaut","CreatedById":58963,"CreatedDateTime":"2013-04-26T04:12:48Z","Content":"\n\u003Cp\u003ENo atmosphere landings are all about suicide burns. Bring your periapsis really low about where you want to land, and then burn out all that velocity. However I\u0027m terrible at suicide burns so I have a procedure that is not the most fuel efficient, but works. \u003C/p\u003E\u003Cp\u003EI plot a series of burns, about 5, with the last burn before landing being about 500 meters above the surface, almost overshooting the target. Each burn is adjusted from map view to make up for body rotation. What comes out at the end is a very low altitude with zero lateral velocity, and landing on target becomes as simple as that old moon lander game. I typically get within 100 meters using this method.\u003C/p\u003E\u003Cp\u003EThe advantage: highly adjustable and user error friendly. \u003C/p\u003E\u003Cp\u003EThe disadvantage: for me about 200 more delta V.\u003C/p\u003E\n"},{"CreatedByName":"flyin_ruski","CreatedById":60421,"CreatedDateTime":"2013-04-26T04:16:35Z","Content":"\n\u003Cp\u003EThanks for the info Super!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-26T04:18:39Z\u0022 title=\u002204/26/2013 04:18  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 26, 2013\u003C/time\u003E by flyin_ruski\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-04-26T04:28:35Z","Content":"\n\u003Cp\u003ELike docking, precision landing can be divided into two parts: an orbital phase and a \u0022visual range\u0022 phase.\u003C/p\u003E\u003Cp\u003EBefore you start the orbital phase, switch your navball to surface mode\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOrbital phase:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m going to assume you know what powered descent and reverse gravity turn is if you\u0027re attempting precision landing. You should be at least able to safely land on the body you\u0027re targeting 9/10 times before you attempt precision landing.\u003C/p\u003E\u003Cp\u003EAnyway the idea of the orbital phase is to setup your suborbital trajectory so that you \u003Cstrong\u003Eoverfly\u003C/strong\u003E the target at low lateral velocity. You don\u0027t want your suborbital trajectory to end exactly at your target as this makes the visual range phase much more difficult as you have to deal with both lateral and vertical velocity. Setting up your trajectory is pretty simple, thrust normal/anti-normal to fix drift tangent to the target, thrust prograde/retrograde to increase/decrease your downrange distance.\u003C/p\u003E\u003Cp\u003EUse free cam and look below for your target, once you feel you\u0027re about right on top of it fire retrograde to cancel out all lateral velocity. Your retrograde indicator should be on the roof of the navball and you should be falling down more or less right on top of your target. At this point you if you open up map view you should now see your orbit end right on your target. Keep your craft pointed up and use the engines to control your rate of descent.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVisual Range phase:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI usually count this phase to start when physics for your target kicks in, in other words when you\u0027re within 2.3km of your target. Hopefully that 2.3km is pure vertical distance but more likely than not you will have some offset. Visual range phase is about correcting for this offset so you land right next to your target.\u003C/p\u003E\u003Cp\u003ENow then, imagine your craft as a helicopter. For a helicopter the only thrust it has is the main rotor propelling you upwards (let\u0027s ignore tail rotor as it doesn\u0027t apply here to spacecrafts). So if you only point your engine up you either go up, go down or hover depending on your thrust level. If you look at how helicopters fly they move around by pitching/rolling so that some of that thrust upwards is redirected sidewards. So for example if they pitch down, the main rotor is now facing diagonally backwards and the helicopter flying forward. Likewise if a helicopter wants to slow down to a hover while it\u0027s flying forwards it will pitch up so that the thrust is directed forwards.\u003C/p\u003E\u003Cp\u003EThis is the exact same concept as visual range phase flying for precision landing. But there is one catch: You want to set it up so you only manoeuvring on one flight axis instead of two.\u003C/p\u003E\u003Cp\u003ESay for example you\u0027re near the surface and you see your target 500m in front and to the left. If we consider roll and pitch as our two flight axis, we can use hover to move closer to the target by rolling first to the left to introduce a left-moving motion, \u003Cstrong\u003Ethen return the craft to vertical for hover while it drifts left \u003C/strong\u003E (this is very important!) and then rolling to the right to cancel the lateral movement. Then a pitch forward to move forward, return to vertical and then pitch backwards to stop forward motion followed by a final touch down.\u003C/p\u003E\u003Cp\u003EBut this is more complicated than what it needs to be. Instead you could just yaw your craft so that the target lies directly ahead of you, then pitch down to go forward, return to vertical, pitch up once you\u0027re near the target to cancel lateral movement and then touch down. Unlike helicopters you have (hopefully) the one advantage of RCS system which allows you to introduce small lateral motion without tilting the craft at all. Use them for small adjustments and then touch down gently near your target.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-26T04:31:50Z\u0022 title=\u002204/26/2013 04:31  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 26, 2013\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mog","CreatedById":60872,"CreatedDateTime":"2013-04-26T04:37:21Z","Content":"\n\u003Cp\u003EI like that Rover in the last pic! Nice job using the scaffolds to extend the wheels downward. Might just need to borrow that idea! Cheers!\u003C/p\u003E\n"},{"CreatedByName":"flyin_ruski","CreatedById":60421,"CreatedDateTime":"2013-04-26T04:42:05Z","Content":"\n\u003Cp\u003EOutstanding information! Im very familiar with landing already but am now trying to build on the surface of the mun to practice for .20 (if mining is implemented). Thanks I will apply these methods when I land the next module.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2013-04-26T05:45:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temstar\u0022 data-cite=\u0022Temstar\u0022\u003E\u003Cdiv\u003ELike docking, precision landing can be divided into two parts: an orbital phase and a \u0022visual range\u0022 phase.\u003Cp\u003EBefore you start the orbital phase, switch your navball to surface mode\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had a near disaster yesterday because I forgot this. I like to select a target on the ground so I have the marks on the navball. When I got closer, it changed to target and I failed to notice. I was cancelling my velocity, going down, and about 100 meters off the ground, my retro marker was straight up and I see the ground moving below me, fairly fast, and I\u0027m thinking what\u0027s going on. I changed to surface and I had 45m/s to burn at a 45 degree angle!\u003C/p\u003E\u003Cp\u003EMy normal method is to burn to get a flyover to land a few kilometers past my target. Then I set up a maneuver marker almost directly above it to give myself an almost vertical descent. From there I go manual, just controlling my speed. I\u0027ll burn outside the retro marker to adjust where I land as needed.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-04-26T05:51:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Merinsan\u0022 data-cite=\u0022Merinsan\u0022\u003E\u003Cdiv\u003EI had a near disaster yesterday because I forgot this. I like to select a target on the ground so I have the marks on the navball. When I got closer, it changed to target and I failed to notice. I was cancelling my velocity, going down, and about 100 meters off the ground, my retro marker was straight up and I see the ground moving below me, fairly fast, and I\u0027m thinking what\u0027s going on. I changed to surface and I had 45m/s to burn at a 45 degree angle!\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHa, I remember losing two Mun landers (and 4 kerbals) before because of that \u003Cem\u003Efairly simple\u003C/em\u003E screw-up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}