{"TopicId":24186,"ForumId":32,"TopicTitle":"CPU/GPU \u0026amp; PhysX","CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-04-26T12:59:13Z","PageNum":1,"Articles":[{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-04-26T12:59:13Z","Content":"\n\u003Cp\u003EHi\u003C/p\u003E\u003Cp\u003Ewhile my station keep on growing the framerate keep on lowering, nothing new here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E, but I was trying to mess around with the the option in nvidia control panel to force gpu take care of simulation (as I recall unity rely on nvidia physx...right? ).\u003C/p\u003E\u003Cp\u003EBut, forcing cpu or gpu to take care oh physx calculation do not seem to change the outcome at all!\u003C/p\u003E\u003Cp\u003EI have a quad core @ 2,5 Ghz and as you can see it look like ksp is using more than one core, also I was expecting 25% cpu not 46% for single thread application anyway these results are the same even with GPU as PhysX processor, only the CPU reach 52% while GPU remain the same ( should have been the opposite )\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i41.tinypic.com/apdvew.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i41.tinypic.com/apdvew.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo what are your experince about?\u003C/p\u003E\n"},{"CreatedByName":"Camelotking524","CreatedById":58776,"CreatedDateTime":"2013-04-26T14:30:15Z","Content":"\n\u003Cp\u003EUnity doesn\u0027t support hardware acceleration Physx.\u003C/p\u003E\n"},{"CreatedByName":"Cronos1082","CreatedById":57180,"CreatedDateTime":"2013-04-26T14:42:42Z","Content":"\n\u003Cp\u003EHi, I really hope the next patch will optimize the game. Around 300 parts my gpu have 10% and CPU 30% for 5 FPS \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-04-26T15:14:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cronos1082\u0022 data-cite=\u0022Cronos1082\u0022\u003E\u003Cdiv\u003EHi, I really hope the next patch will optimize the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMulti-threading and GPU PhysX are major rewrites, not optimisations. The latter may not be appropriate for KSP anyway, the GPU isn\u0027t just a faster CPU - it has downsides as well.\u003C/p\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-04-26T15:16:11Z","Content":"\n\u003Cp\u003EAlright then no physx support and looking at the dev blog next patch will bring optimization only to database, so it will speedup the loading time not the simulation, so nothing yet cronos1082\u003C/p\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-04-26T15:18:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EndlessWaves\u0022 data-cite=\u0022EndlessWaves\u0022\u003E\u003Cdiv\u003EMulti-threading and GPU PhysX are major rewrites, not optimisations. The latter may not be appropriate for KSP anyway, the GPU isn\u0027t just a faster CPU - it has downsides as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree, GPU are much more suited for physics simulation than a general purpose cpu\u003C/p\u003E\n"},{"CreatedByName":"Stealth2668","CreatedById":57377,"CreatedDateTime":"2013-04-26T15:25:02Z","Content":"\n\u003Cp\u003EIt seems like Unity doesn\u0027t support jack all. I\u0027m surprised it supports colour! xD\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-04-26T16:01:44Z","Content":"\n\u003Cp\u003EUnity... Jack of all Systems, Master of NONE!\u003C/p\u003E\u003Cp\u003EWhile it can run on multiple systems it does seem a poor choice for a heavy physics based game.\u003C/p\u003E\n"},{"CreatedByName":"jfx","CreatedById":37282,"CreatedDateTime":"2013-04-26T16:18:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022brusura\u0022 data-cite=\u0022brusura\u0022\u003E\u003Cdiv\u003EI disagree, GPU are much more suited for physics simulation than a general purpose cpu\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot necessarily pushing gameplay physics to the gpu means you have to communicate it back to the cpu for every rendered frame which can be quite slow. It also means the GPU requirements will go up since the GPU will have to run a (depending on your Vessel) very demanding workload which means the same people who now complain because they have a slow CPU will complain because their GPU is too weak. Another problem is the lack of a standardized approach to the problem. Use physX - Radeon users are left out. Use OpenCl, users with older cards are left out. Meaning: You have to to the same work three times, without even reaching all customers (and we haven\u0027t even talked about mac and linux - some driver has weird quirks? -\u0026gt; gl with the hate mail). Its just plain wishful thinking to say that squad can implement what AAA studios (let\u0027s say crytek and dice since they write their own engines) have not done because it is just not feasible as of today due to the splintered landscape that are gaming PCs ... or \u0022laptops\u0022 ... or whatever.\u003C/p\u003E\u003Cp\u003EBest course would be when unity will utilitze a multithreading enabled physics solver (physx supports this too, or another library such as havok or bullet). This would balance CPU and GPU demands out - especially since GPU demands will propably rise due to new features such as clouds, etc.\u003C/p\u003E\u003Cp\u003EAlso Keep in mind that most of the \u002210x speedup over cpu\u0022or \u0022awesome effects\u0022 claims were just inflated marketing talk by nVidia since they deliberately limited cpu-physx to ancient x87 code and single threading to manufacture a marketing advantage for their cards.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-26T16:25:52Z\u0022 title=\u002204/26/2013 04:25  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 26, 2013\u003C/time\u003E by jfx\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-04-26T16:28:32Z","Content":"\n\u003Cp\u003Edo you mean x86 right? You are right jfx not \u0022necessarily\u0022 but the type of calculation involved ( mostly floiting point operations used in 3d calculation and physics ) are processed faster anyway by the gpu.\u003C/p\u003E\n"},{"CreatedByName":"jfx","CreatedById":37282,"CreatedDateTime":"2013-04-26T17:30:05Z","Content":"\n\u003Cp\u003ENo, i meant x87 which is the floating point part originating back with the 8086 (!). Using this ancient instruction set to do performance heavy sp-floating point math is like driving your porsche and using only the first two gears. SSE2 is somewhat standard (every 64bit capable CPU is guaranteed to have it - starting by Pentium4 and Athlon64 with the sole exception being the Atom).\u003C/p\u003E\u003Cp\u003Emain source with conclusive benchmark and profiling results:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.realworldtech.com/physx87/4/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.realworldtech.com/physx87/4/\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Eusing two cores for physics could easily yield a 2X performance gain. Combined with the benefits of vectorized SSE over x87, it is easy to see how a proper multi-core implementation using 2-3 cores could match the gains of PhysX on a GPU.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENote that utilizing AVX or AVX2 could gain an even larger speedup - they doubled the width of the units again to 256 bits.\u003C/p\u003E\u003Cp\u003Eand a somewhat lame escuse from an nvidia rep:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.itproportal.com/2010/07/08/nvidia-were-not-hobbling-cpu-physx/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.itproportal.com/2010/07/08/nvidia-were-not-hobbling-cpu-physx/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2013-04-26T17:35:36Z","Content":"\n\u003Cp\u003EI see, look fishy indeed.\u003C/p\u003E\n"},{"CreatedByName":"Nobody_1707","CreatedById":42582,"CreatedDateTime":"2013-04-26T17:42:23Z","Content":"\n\u003Cp\u003ENo, he meant x87 which is the floating point co-proccessor for the x86. They implemented more efficient vector math instructions like MMX and SSE, but the x87 instructions and floating point stack are still there for backwards compatibility. While you can\u0027t use MMX and SSE for all kinds of calculations they are good at the same kind of things as the GPU, just a bit less efficiently.\u003C/p\u003E\u003Cp\u003EWhile restricting the CPU code to x87 would increase the disparity between CPU and GPGPU the GPU is still much faster at easily parallelizable calculations because it can run more of them at the same time. Moving from their custom physics engine to a GPU based engine isn\u0027t a simple thing to do though, and if they have to shuffle a lot more data out to the graphics card per frame then they currently do then they might only break even on the switch to the GPU. Memory is slow.\u003C/p\u003E\n"},{"CreatedByName":"TooManyErrors","CreatedById":57113,"CreatedDateTime":"2013-04-26T19:29:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camelotking524\u0022 data-cite=\u0022Camelotking524\u0022\u003E\u003Cdiv\u003EUnity doesn\u0027t support hardware acceleration Physx.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://unity3d.com/unity/quality/physics\u0022 rel=\u0022external nofollow\u0022\u003EUnity supports Physx.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ThatBum","CreatedById":57405,"CreatedDateTime":"2013-04-26T19:50:26Z","Content":"\n\u003Cp\u003EAs I understand it, KSP wouldn\u0027t benefit from PhysX too much anyway. It\u0027s good for oddball stuff like cloth simulations and particles, but not much else, it seems.\u003C/p\u003E\u003Cp\u003EThere was a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entry.php/245-C7-DevBlog-4-23-13\u0022 rel=\u0022external nofollow\u0022\u003Edev post\u003C/a\u003E this week showing preliminary optimization in the form of memory usage and scene loading.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2013-04-26T21:10:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TooManyErrors\u0022 data-cite=\u0022TooManyErrors\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://unity3d.com/unity/quality/physics\u0022 rel=\u0022external nofollow\u0022\u003EUnity supports Physx.\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut it doesn\u0027t support gpu Physx, it\u0027s all done on the cpu and unfortunately just on one core.\u003C/p\u003E\n"},{"CreatedByName":"TooManyErrors","CreatedById":57113,"CreatedDateTime":"2013-04-26T21:47:23Z","Content":"\n\u003Cp\u003EI\u0027m pretty sure that Nvidia Physx will work on GPUs.\u003C/p\u003E\n"},{"CreatedByName":"macintux","CreatedById":12804,"CreatedDateTime":"2013-04-26T22:09:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TooManyErrors\u0022 data-cite=\u0022TooManyErrors\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure that Nvidia Physx will work on GPUs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENvidia PhysX does work on GPU\u0027s with CUDA, but Unity uses an older version of PhysX that doesn\u0027t support GPU\u0027s, multithreading, or even the old Ageia PhysX cards.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-04-26T23:24:03Z","Content":"\n\u003Cp\u003Ewhenever they make the physics run on alteast 2 cores then I will be a happy camper, for now i\u0027m just content.\u003C/p\u003E\n"},{"CreatedByName":"Superfish1000","CreatedById":116025,"CreatedDateTime":"2014-07-20T02:48:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jfx\u0022 data-cite=\u0022jfx\u0022\u003E\u003Cdiv\u003EIt also means the GPU requirements will go up since the GPU will have to run a (depending on your Vessel) very demanding workload which means the same people who now complain because they have a slow CPU will complain because their GPU is too weak.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t mean to be rude or anything but thats an extremely stupid argument that I see thrown around a lot. No one cares about the people with genuinely [slow] systems. Saying that they shouldn\u0027t bother to fix a serious problem just because some people playing on their grandmothers old Win 2000 won\u0027t be able to actually play it at a faster frame rate is an absolutely ed argument. Those people will have horrible frame rates regardless, to which you tell them, \u0022Your PC is a piece of [not very nice]. Deal with it.\u0022 Why would you argue for a worse gameplay experience only because \u0022the same people who now complain because they have a slow CPU will complain because their GPU is too weak.\u0022 I have one of the fastest CPU\u0027s on earth and it\u0027s still not playable if I put too many parts on my ship.\u003C/p\u003E\u003Cp\u003EAlso, I don\u0027t know your background and I don\u0027t know a particularly large amount about rendering physics with a GPU but I can tell you that is bull. Nvidia and others have had extremely complicated water simulations running in real time on a GPU\u0027s with no problem. Doing KSP like physics on a GPU would be child\u0027s play. As for transfer speed from CPU to GPU, a PCI-e 16x 2.0(which I have and am using for my GPU) slot has 8GB/s of transfer speed both directions simultaneously. So I\u0027m going to have to call bull on that one too.\u003C/p\u003E\u003Cp\u003ENext, here is some actual information on the benefits of GPU acceleration. \u003Ca href=\u0022http://blogs.nvidia.com/blog/2010/06/23/gpus-are-only-up-to-14-times-faster-than-cpus-says-intel/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://blogs.nvidia.com/blog/2010/06/23/gpus-are-only-up-to-14-times-faster-than-cpus-says-intel/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd I would like to point out that there is a reason why super computers are being built with GPU\u0027s now instead of CPU\u0027s.\u003C/p\u003E\u003Cp\u003ELastly, use Open CL. Only people with awful/old GPU\u0027s wouldn\u0027t be able to support it and there would be no need to stop using the current system anyway. Just have it as a fall back for the people who have crap systems.\u003C/p\u003E\u003Cp\u003ECUDA is Nvidia only, Mantle is, as of now, AMD only. Open CL might not be perfect on every card but it is the best alternative I see. I don\u0027t know how they have physics implemented at the moment, ie, if it is custom code or through Unity itself, but if it is custom code then it should \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Etheoretically\u003C/span\u003E\u003C/strong\u003E just be a matter of translating it to Open CL and debugging any problems. It would probably also require threading to be implemented unless Open CL handles that already... I don\u0027t know.\u003C/p\u003E\u003Cp\u003EI won\u0027t claim that any of this is easy to achieve for a smaller studio but I\u0027m just trying to point out that it is completely possible and they should put some actual effort into achieving it because the game is a lot less fun when you can\u0027t actually have much more than two rockets docked or a few hundred parts.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-07-20T07:16:53Z","Content":"\n\u003Cp\u003ECareful with the language there, Superfish1000. I\u0027ve edited out some of the words as you\u0027ll have noticed, and the forum software does a good job of censoring the rest. At the same time, necro posts are frowned on unless they bring anything substantially new to the table, and I\u0027ll be closing this thread as it\u0027s 15 months old.\u003C/p\u003E\u003Cp\u003EKeep it kid-friendly, and do be civil. As you\u0027re new, I\u0027d recommend reading \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/30064-Community-Rules-October-27th-2013\u0022 rel=\u0022external nofollow\u0022\u003Ethe forum rules\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EOther than that, welcome and have fun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i34.photobucket.com/albums/d126/brazzos6/threadlock.jpg\u0022 alt=\u0022threadlock.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-20T07:22:06Z\u0022 title=\u002207/20/2014 07:22  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 20, 2014\u003C/time\u003E by technicalfool\u003C/strong\u003E\n\u003C/span\u003E\n"}]}