{"TopicId":25164,"ForumId":32,"TopicTitle":"Any value in having SRBs after stage one?","CreatedByName":"The Ideal Gas Lawyer","CreatedById":60804,"CreatedDateTime":"2013-05-02T18:46:54Z","PageNum":1,"Articles":[{"CreatedByName":"The Ideal Gas Lawyer","CreatedById":60804,"CreatedDateTime":"2013-05-02T18:46:54Z","Content":"\n\u003Cp\u003EThey\u0027re so heavy when not firing it seems to me like they\u0027re only good for the first stage to give your ship a kick in the pants and get some initial velocity. After that, is there any good reason to use them instead of liquid fuel engines? Especially if you can asparagus the tanks and constantly be dumping dry weight.\u003C/p\u003E\u003Cp\u003EI\u0027ve stayed away from using boom trashcans after the start every since some early disasters\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/omJ5P.jpg\u0022 alt=\u0022omJ5P.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"robly18","CreatedById":37651,"CreatedDateTime":"2013-05-02T19:52:42Z","Content":"\n\u003Cp\u003EThey\u0027re probably gonna be a hecka lot more useful on career mode. The main reason NASA uses those is because they\u0027re cheaper to make than liquid fuel boosters. So you can expect these to cost like 100 of whatever the currency is while liquid boosters (fuel\u002Bengine) might cost up to 1K.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-02T20:05:28Z","Content":"\n\u003Cp\u003ERight now, no, they are really only useful for getting off the pad up to terminal velocity quickly. And they\u0027re of questionable value for that.\u003C/p\u003E\u003Cp\u003EWhen we\u0027re spending money on parts in career mode, though, SRBs are going to be very popular.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-02T20:22:37Z","Content":"\n\u003Cp\u003EMy attempts at using SRB\u0027s to supplement upper stages have had scattered success. As in successfully scattering the launch vehicles across Booster Bay.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-02T20:28:10Z","Content":"\n\u003Cp\u003E\u0022Booster Bay\u0022\u003C/p\u003E\u003Cp\u003EOh, I\u0027m definitely going to be using that name from now on. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BeefTenderloin","CreatedById":25612,"CreatedDateTime":"2013-05-02T20:48:16Z","Content":"\n\u003Cp\u003EIf I\u0027m not mistaken, the Orbital Industries launch vehicle uses a second stage that utilizes solid fuel. I believe this is due to the original design being capable of reusing old \u0022Minuteman\u0022 parts.\u003C/p\u003E\n"},{"CreatedByName":"spacecake","CreatedById":58662,"CreatedDateTime":"2013-05-02T20:55:06Z","Content":"\n\u003Cp\u003ESpeaking of old, how old is that screenshot? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceCowboy","CreatedById":61934,"CreatedDateTime":"2013-05-02T20:56:21Z","Content":"\n\u003Cp\u003EThe Delta III had nine SRBs: six that ignited on the ground and three that were air-lit and started after the first six were jettisoned.\u003C/p\u003E\n"},{"CreatedByName":"lobsterbark","CreatedById":57253,"CreatedDateTime":"2013-05-02T21:00:43Z","Content":"\n\u003Cp\u003EIf making an icbm, then using srbs for stage 2 is actually quite useful.\u003C/p\u003E\n"},{"CreatedByName":"erkha343","CreatedById":1957,"CreatedDateTime":"2013-05-02T21:29:59Z","Content":"\n\u003Cp\u003ESRB\u0027s are cheap, you\u0027ll be using them more once career mode is implemented.\u003C/p\u003E\u003Cp\u003EThey have much higher twr too\u003C/p\u003E\n"},{"CreatedByName":"Westo454","CreatedById":12702,"CreatedDateTime":"2013-05-02T21:35:14Z","Content":"\n\u003Cp\u003ERight now, I don\u0027t use SRBs unless I absolutely must. I am definitely going to start seeing an increase in my SRB count once I get Career mode though.\u003C/p\u003E\n"},{"CreatedByName":"HGGundamReviews","CreatedById":57099,"CreatedDateTime":"2013-05-02T21:44:27Z","Content":"\n\u003Cp\u003EIn my case I find them very useful. On most of my heavy lifters I add a layer of the large SRB\u0027s on radial decouplers, and then on top of them and set of the small SRB\u0027s on decouplers. The combination work very well together. The overall small amount of thrust the small SRB\u0027s give add just enough extra efficiency to the over all craft that the large one\u0027s will last generally at least 3 to 4km higher than without the smaller ones to kick the whole ship up just that extra little nudge.\u003C/p\u003E\n"},{"CreatedByName":"Noticeably FAT","CreatedById":43401,"CreatedDateTime":"2013-05-02T22:08:52Z","Content":"\n\u003Cp\u003EI\u0027ve been considering adding small \u0027booster packs\u0027 to the bottom of my interplanetary drives if I know I\u0027m going to need more than 1km/s for the transfer just to save on that precious liquid fuel. I suspect that they will be more trouble than they are worth, but I still wanna try.\u003C/p\u003E\n"},{"CreatedByName":"Elemental","CreatedById":58070,"CreatedDateTime":"2013-05-02T22:29:05Z","Content":"\n\u003Cp\u003EI like to use them for impact probes. It just feels way more cool to light the solid booster and send it careening at the object.\u003C/p\u003E\n"},{"CreatedByName":"Scoundrel","CreatedById":15369,"CreatedDateTime":"2013-05-02T23:15:17Z","Content":"\n\u003Cp\u003ESRBs are best used \u0026lt;13km altitude to keep your 2gs of acceleration through the thickest part of the atmosphere. Once you\u0027re at about 13km the atmosphere significantly starts to thin out and you should be starting your gravity turn if you haven\u0027t already. Once the gravity turn has been performed, small SRBs may help if you want to throttle back on your main engines to conserve fuel for orbital maneuvers. The problem with doing that though is that they will sort of hinder you as you need gimballing engines to finish your turn since aero control surfaces will be less than useful, and RCS is kind of wasted on anything except translation. And anyways, at high altitudes, you\u0027re better off staging liquid engines than hauling up srbs.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-05-02T23:22:23Z","Content":"\n\u003Cp\u003Eyou could make some sort of solid booster \u0022crane\u0022 to slow your decent in a landing, no not really any other use.\u003C/p\u003E\n"},{"CreatedByName":"SunJumper","CreatedById":27062,"CreatedDateTime":"2013-05-02T23:33:52Z","Content":"\n\u003Cp\u003EThere\u0027s one use. Jeb\u0027s will states that he wants to be launched directly into the sun using only the RT-10s. That would make a grand challenge.\u003C/p\u003E\n"},{"CreatedByName":"Designer225","CreatedById":48514,"CreatedDateTime":"2013-05-02T23:37:16Z","Content":"\n\u003Cp\u003EThus booster be important, thus rocket shall explode! --- Jeb\u003C/p\u003E\u003Cp\u003EI don\u0027t use boosters often, but I usually use them to boost the rocket. Yeah, when we are playing in Career mode, this would be a whole lot of heck of usefulness and cheapness.\u003C/p\u003E\n"},{"CreatedByName":"Catullus","CreatedById":51486,"CreatedDateTime":"2013-05-03T00:16:06Z","Content":"\n\u003Cp\u003EUsing SRBs in space isn\u0027t a good idea, they\u0027ve got miserable Isp.\u003C/p\u003E\n"},{"CreatedByName":"Designer225","CreatedById":48514,"CreatedDateTime":"2013-05-03T00:31:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Catullus\u0022 data-cite=\u0022Catullus\u0022\u003E\u003Cdiv\u003EUsing SRBs in space isn\u0027t a good idea, they\u0027ve got miserable Isp.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah. Besides, you just can\u0027t cut off the motors once they\u0027re activated. I think in space we should use liquid engines in space, and use combined liquid engines and solid boosters for launch, to save money.\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2013-05-03T00:43:01Z","Content":"\n\u003Cp\u003ESRB\u0027s are always fueled up so for a military missile they are great, you can launch them straight away. For civilian use they have one big advantage and a lot of drawbacks.\u003C/p\u003E\u003Cp\u003EFirst up, they don\u0027t cost very much with is good right? However:\u003C/p\u003E\u003Cp\u003E1) They can\u0027t be controlled, which means once lit they burn until they run out of fuel. This limits what you can do with them and means they can\u0027t be turned off in a emergency or throttled.\u003C/p\u003E\u003Cp\u003E2) The fuel and exhaust gas is really toxic, which has an environmental impact. The area around Kennedy Space Center is a nature reserve and is measurably damaged by every launch using SRB. Cars close to the launch site have their paint damaged!\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2013-05-03T03:03:44Z","Content":"\n\u003Cp\u003EThere actually are good IRL reasons to have a solid non-first stage; many satellites are placed in their final orbits by a solid booster, for example. Solid rockets are, typically, much less complex than liquid ones, and they are also far more energy dense (in terms of MJ/m^3) than liquids because of their far denser fuel. This means they can be made much more compact.\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2013-05-03T03:32:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022foamyesque\u0022 data-cite=\u0022foamyesque\u0022\u003E\u003Cdiv\u003EThere actually are good IRL reasons to have a solid non-first stage; many satellites are placed in their final orbits by a solid booster, for example. Solid rockets are, typically, much less complex than liquid ones, and they are also far more energy dense (in terms of MJ/m^3) than liquids because of their far denser fuel. This means they can be made much more compact.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwww you\u0027re talking about \u003Ca href=\u0022https://en.wikipedia.org/wiki/Payload_Assist_Module\u0022 rel=\u0022external nofollow\u0022\u003EPayload Assist Module\u003C/a\u003E. The reason why solids are sometimes used for final stage is because:\u003C/p\u003E\u003Cp\u003E1. As mentioned, they\u0027re compact for the amount of energy they carry so they can fit inside small spaces like payload fairings or shuttle cargo by\u003C/p\u003E\u003Cp\u003E2. They\u0027re very reliable because they\u0027re simple and have few parts that can go wrong. You won\u0027t want to have a situation where shuttle has got the payload to LEO but then have the PAM fail to fire\u003C/p\u003E\u003Cp\u003E3. They can be designed as \u0022spinners\u0022 where no guidance is needed at all and the PAM \u002B payload is only stabilised by gyroscopic forces like a rifle bullet. This makes them very easy to install as an additional stage onto things not originally designed for them. You can\u0027t spin liquid stages because the fuel will vortex and behave unpredictably.\u003C/p\u003E\n"},{"CreatedByName":"SwagBoiFresh","CreatedById":57140,"CreatedDateTime":"2013-05-03T04:10:10Z","Content":"\n\u003Cp\u003EI reject all your realities and substitute Scott Manley\u0027s.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/tXU67_cE3ss?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Scoundrel","CreatedById":15369,"CreatedDateTime":"2013-05-03T04:13:08Z","Content":"\n\u003Cp\u003EHahahaha! TouchÃƒÂ© SwagBoiFresh. TouchÃƒÂ©.\u003C/p\u003E\n"}]}