{"TopicId":25508,"ForumId":32,"TopicTitle":"Heartbreak","CreatedByName":"Ogre","CreatedById":61074,"CreatedDateTime":"2013-05-05T03:25:41Z","PageNum":1,"Articles":[{"CreatedByName":"Ogre","CreatedById":61074,"CreatedDateTime":"2013-05-05T03:25:41Z","Content":"\n\u003Cp\u003EMy first manned mission to Duna. Everything has been tested on the Mun and worked fine (well, I drove the rover too fast and it exploded when I flipped it... but it got there fine!). I have two landers, one small one at the upper left, one big one at the bottom right. The big one carries a manned rover underneath. The ship was assembled in orbit from two big sections (plus the small lander). I used a 3-port docking scheme for the big pieces for great stability.\u003C/p\u003E\u003Cp\u003EGot all the way to Duna. Filled up the big lander. Undocked one port. Undocked the next one, at which point it split the ship in two, which is bad because it was docked on all three ports when I left. Backed away from the command module and saw the problem...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://rumsey.org/kerbal/Wildcat3%20Duna%20Orbit%20Broken%20Engine.jpg\u0022 alt=\u0022Wildcat3 Duna Orbit Broken Engine.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E#!\u0026amp;$@#\u003C/p\u003E\u003Cp\u003EThat engine pod at a weird angle is broken off its I-beam in my quicksave, I loaded several times to try again, the same engine winds up this way every time. I can\u0027t fly it straight even if I switch off the other two atomic engines (it has 3 atomic and 3 liquid, I can usually use it with either set burning, or both). I don\u0027t know when it broke, it was fine when I docked \u0027em up, but it\u0027s clearly broken before I undock it, I can\u0027t right click to check the fuel on that pod either.\u003C/p\u003E\u003Cp\u003EI\u0027m about to take my small lander down, but I have no way to get my rover down \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-05-05T16:14:37Z","Content":"\n\u003Cp\u003EIt\u0027s rescue time! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sporkafife","CreatedById":38208,"CreatedDateTime":"2013-05-05T16:25:27Z","Content":"\n\u003Cp\u003EMy main interplanetary tug type thing has 4 LV-N\u0027s all attached with decouplers. That way, in the event of crazy unplanned destruction of an engine, the engine on the other side can be jettisoned keep the symmetry and let it limp on with it\u0027s mission with just two engines...\u003C/p\u003E\u003Cp\u003ELesson of the day - redundancy is important on space missions! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2013-05-05T16:29:10Z","Content":"\n\u003Cp\u003EI know how it feels. I once mounted a decoupler upside down on a rover so that it blocked the RCS ports that powered it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ogre","CreatedById":61074,"CreatedDateTime":"2013-05-05T16:31:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sporkafife\u0022 data-cite=\u0022sporkafife\u0022\u003E\u003Cdiv\u003EMy main interplanetary tug type thing has 4 LV-N\u0027s all attached with decouplers. That way, in the event of crazy unplanned destruction of an engine, the engine on the other side can be jettisoned to let it limp on with it\u0027s mission with just two engines...\u003Cp\u003ELesson of the day - redundancy is important on space missions! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a good idea. I have two sets of three engines (different types) on there. I could easily put both sets on decouplers in case this happens again.\u003C/p\u003E\u003Cp\u003EI did land my small lander on Duna, so it wasn\u0027t a total loss. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen on the next ship I sent, with the same lander except (of course) MORE STRUTS, the rover had gone missing by the time I got to Duna. I don\u0027t know why. But I\u0027d copied a quicksave off before I made my transfer burn, and the rover is intact in that one, so I\u0027m trying again right now. I\u0027m about halfway through my transfer burn as I post this and the rover is still there. I\u0027ll save another one off once the burn is done and keep trying.\u003C/p\u003E\u003Cp\u003EThese ships are actually the first time I\u0027ve even reloaded saves at all. I\u0027ve been playing on \u0022hardcore\u0022 mode until now (Except I\u0027m using Mechjeb, so Hardcore Easy Mode I guess \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\n"}]}