{"TopicId":25517,"ForumId":32,"TopicTitle":"Military Weapons in KSP","CreatedByName":"sounthernrebel78","CreatedById":38590,"CreatedDateTime":"2013-05-05T04:40:10Z","PageNum":5,"Articles":[{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2013-07-12T11:57:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jack Wolfe\u0022 data-cite=\u0022Jack Wolfe\u0022\u003E\u003Cdiv\u003EWar is a method of domination, one party\u0027s way of imposing its will upon another\u0027s by means of force. Creativity and refinement of engineering practices are not dependent upon warfare to progress.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, competition is a primary evolutionary force, and many if not most of the wonderful technological advancements we enjoy are directly descended from war time necessities or inventions.\u003C/p\u003E\u003Cp\u003EAdapt or die, and as a creature with no natural predators left, in general, we compete amongst ourselves, creativity and refinement are very much a part of that, whether people like to accept that fact or not.\u003C/p\u003E\u003Cp\u003EIf there was no possibility of war, no competition, the likelihood we would have sent people to space when and how we did initially is quite low.\u003C/p\u003E\u003Cp\u003EPeople don\u0027t like to think of it that way, but competition and death have been primary evolutionary spurs for all of the history that we know of.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kialar\u0022 data-cite=\u0022Kialar\u0022\u003E\u003Cdiv\u003EThat\u0027s why I associate weapons with real weapons/violence.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI say this as respectfully as can be done, but, that IS an odd association, and one that doesn\u0027t hold up much to scrutiny, violence in real life is nothing at all like violence in a game, nor are the two related.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kialar\u0022 data-cite=\u0022Kialar\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMost people of my age around me are very rejective when it comes to weapons, military and such stuff.\u003C/p\u003E\u003Cp\u003EI stop arguing now, that will escalate for sure. I think, I made clear what I am about.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWho\u0027s arguing? I also think it\u0027s odd that people seem to have lost the ability to disagree without thinking it to be an argument.\u003C/p\u003E\u003Cp\u003EI\u0027ll say this though, pacifism isn\u0027t the greatest idea, and this aversion to violence makes people easy targets for those that lack it, either through political manipulation or more direct enactments of physical violence.\u003C/p\u003E\u003Cp\u003EAvoiding it completely isn\u0027t the answer, responsibly using, or in most situations, choosing not to use it, is a more realistic and useful stance. In appropriate situations (self defense, defense of loved ones or the weak) it can be beneficial and not just on a personal and morally \u0022wrong\u0022 level.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-12T12:04:24Z\u0022 title=\u002207/12/2013 12:04  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 12, 2013\u003C/time\u003E by _Aramchek_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kialar","CreatedById":60893,"CreatedDateTime":"2013-07-12T12:37:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EI say this as respectfully as can be done, but, that IS an odd association, and one that doesn\u0027t hold up much to scrutiny, violence in real life is nothing at all like violence in a game, nor are the two related.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK. If you poke me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor sure you are right that real violence is not related to violence in a game.\u003C/p\u003E\u003Cp\u003EThar has nothing to do with an association.\u003C/p\u003E\u003Cp\u003EKSP has nothing to do with real space travel, but I associate it with space travel. That\u0027s the reason I like the game so much.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EWho\u0027s arguing? I also think it\u0027s odd that people seem to have lost the ability to disagree without thinking it to be an argument.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EI\u0027ll say this though, pacifism isn\u0027t the greatest idea, and this aversion to violence makes people easy targets for those that lack it, either through political manipulation or more direct enactments of physical violence.\u003Cp\u003EAvoiding it completely isn\u0027t the answer, responsibly using, or in most situations, choosing not to use it, is a more realistic and useful stance. In appropriate situations (self defense, defense of loved ones or the weak) it can be beneficial and not just on a personal and morally \u0022wrong\u0022 level.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere do you get the idea from, that I am a pacificst or relate my expressions as pacifistic? Where do you get the idea from, that I am avoiding violence at all costs? Where did you get the idea from, that I do put morals in?\u003C/p\u003E\u003Cp\u003EWhat I tried to communicate are three things:\u003C/p\u003E\u003Cp\u003E1) I have a problem with violence and all related things, because it is destructive. Do not mistake that for \u0022I am lean back and getting beaten up for the sake of being nonviolent\u0022. Be sure, that self-defense, nutrition, defense of the weak can be reasons for violence. But even if they are reasonable, I don\u0027t have to like it. An aversion to violence and pacifism are not quite the same. That is like \u0022You don\u0027t like beer, so you are abstinent to all alcoholics\u0022.\u003C/p\u003E\u003Cp\u003E2) I can not get Kerbals and violence together. That\u0027s why I wouldn\u0027t like it to see weapons in the game.\u003C/p\u003E\u003Cp\u003E3) A homo sapiens is a omnivorous (I used carnivorous above, don\u0027t nail me on that ^^), hunting, basically violent life form. I never denied, that the species made most of it\u0027s progress due to weapons or violence. That is totally detached from morals. I never said something about \u0022wrong\u0022 and \u0022right\u0022. I tried to transport, that: I don\u0027t like violence, I don\u0027t like getting hurt, I don\u0027t like to hurt others. But I don\u0027t like winter, too. I have to deal with it and some things are as they are.\u003C/p\u003E\n"},{"CreatedByName":"Wiracho","CreatedById":69847,"CreatedDateTime":"2013-07-12T12:40:00Z","Content":"\n\u003Cp\u003Ebecause, we are humans... thats why\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-07-12T12:52:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EActually, competition is a primary evolutionary force, and many if not most of the wonderful technological advancements we enjoy are directly descended from war time necessities or inventions.\u003Cp\u003EAdapt or die, and as a creature with no natural predators left, in general, we compete amongst ourselves, creativity and refinement are very much a part of that, whether people like to accept that fact or not.\u003C/p\u003E\u003Cp\u003EIf there was no possibility of war, no competition, the likelihood we would have sent people to space when and how we did initially is quite low.\u003C/p\u003E\u003Cp\u003EPeople don\u0027t like to think of it that way, but competition and death have been primary evolutionary spurs for all of the history that we know of.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll accept that as a justification of why things are the way they are, not an explanation of why they have to be so. We\u0027ll simply have to agree to disagree on the matter, because it\u0027s pretty clear neither of us are going to change our views. That\u0027s fine. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFundamentally, KSP is about curiosity, creativity, and exploration. In my mind you don\u0027t need bombs to satisfy those things. If people want to make military-themed mods, that\u0027s their business. Just as long as it\u0027s never a mandatory part of this game.\u003C/p\u003E\n"},{"CreatedByName":"Sid","CreatedById":72855,"CreatedDateTime":"2013-07-12T13:12:23Z","Content":"\n\u003Cp\u003EI absolutely love weapons in the real world - I\u0027m a gunsmith, knifemaker and hunter - but they honestly don\u0027t do anything for me in the virtual world. \u003C/p\u003E\u003Cp\u003EEspecially in KSP, where I spend most of my time ensuring things DON\u0027T explode \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t reckon KSP is a good base for a space combat sim anyway - it would be like trying to train a horse to be a dog. There\u0027s no AI or multiplayer to provide an opponent for one thing. I like the building and exploring aspects - I hope the developers and modders keep creating new things to find and new places to go.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2013-07-12T13:45:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kialar\u0022 data-cite=\u0022Kialar\u0022\u003E\u003Cdiv\u003EOK. If you poke me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003E1) I have a problem with violence and all related things, because it is destructive. Do not mistake that for \u0022I am lean back and getting beaten up for the sake of being nonviolent\u0022. Be sure, that self-defense, nutrition, defense of the weak can be reasons for violence. But even if they are reasonable, I don\u0027t have to like it. An aversion to violence and pacifism are not quite the same. \u003C/p\u003E\u003Cp\u003E2) I can not get Kerbals and violence together. That\u0027s why I wouldn\u0027t like it to see weapons in the game.\u003C/p\u003E\u003Cp\u003E3) A homo sapiens is a omnivorous (I used carnivorous above, don\u0027t nail me on that ^^), hunting, basically violent life form. I never denied, that the species made most of it\u0027s progress due to weapons or violence. That is totally detached from morals. I never said something about \u0022wrong\u0022 and \u0022right\u0022. I tried to transport, that: I don\u0027t like violence, I don\u0027t like getting hurt, I don\u0027t like to hurt others. But I don\u0027t like winter, too. I have to deal with it and some things are as they are.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1.) I was not speaking of you directly, even though it was in response to you.\u003C/p\u003E\u003Cp\u003E\u0022That is like \u0022You don\u0027t like beer, so you are abstinent to all alcoholics\u0022.\u0022\u003C/p\u003E\u003Cp\u003EThat\u0027s a straw man argument.\u003C/p\u003E\u003Cp\u003E2.) Which is perfectly ok, the devs have already stated weapons will never be part of the stock game, however, you did respond directly to my statement that I found it odd people liken in game violence to real world violence and proceeded from a stance that made it seem like you did indeed feel that way.\u003C/p\u003E\u003Cp\u003E3) See number one.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jack Wolfe\u0022 data-cite=\u0022Jack Wolfe\u0022\u003E\u003Cdiv\u003EI\u0027ll accept that as a justification of why things are the way they are, not an explanation of why they have to be so. We\u0027ll simply have to agree to disagree on the matter, because it\u0027s pretty clear neither of us are going to change our views. That\u0027s fine. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t get me wrong, I wouldn\u0027t mind if things were different, I\u0027m just not sure realistically that any other impetus would work as well or that we\u0027re capable of being co-operative on a scale that would enable that to change.\u003C/p\u003E\u003Cp\u003EI\u0027m not saying it \u0022has to be that way\u0022 or should, but so far it would seem to be the only thing that \u0022works\u0022. \u003C/p\u003E\u003Cp\u003EI\u0027d like to state I\u0027m not trying to change your view. lol\u003C/p\u003E\u003Cp\u003EFundamentally, KSP is about curiosity, creativity, and exploration. In my mind you don\u0027t need bombs to satisfy those things. If people want to make military-themed mods, that\u0027s their business. Just as long as it\u0027s never a mandatory part of this game.\u003C/p\u003E\n"},{"CreatedByName":"Kialar","CreatedById":60893,"CreatedDateTime":"2013-07-12T14:06:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u0022That is like \u0022You don\u0027t like beer, so you are abstinent to all alcoholics\u0022.\u0022\u003C/p\u003E\u003Cp\u003EThat\u0027s a straw man argument.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBasically yes.\u003C/p\u003E\u003Cp\u003EIn fact, it was intended to be a provocation.\u003C/p\u003E\u003Cp\u003EYou see, I am not pacifistic at all.\u003C/p\u003E\u003Cp\u003EOverall: Happy launching and may you always be on the cooler side of the rocket exhaust. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Atomictank","CreatedById":37393,"CreatedDateTime":"2013-07-12T14:16:49Z","Content":"\n\u003Cp\u003EOh for God\u0027s sake! You run a bloody space program- it should be easy enough for you threaten someone with crashing you space station through their mum\u0027s living room! In am seriousness you don\u0027t need it you have SRB\u0027s.\u003C/p\u003E\n"},{"CreatedByName":"Robbii6","CreatedById":69855,"CreatedDateTime":"2013-07-12T14:23:14Z","Content":"\n\u003Cp\u003ETo be honest im with \u0027no weapons\u0027 here. Is there really any point in having them? the only thing you are going to use them on is the space centre or you own creations which to be perfectly honest what is the point in that? However thats just my opinion. I guess it could be kind of cool for the jets but there is no point, and plus you could just strap on some fuel tanks and some seprotrons.\u003C/p\u003E\n"},{"CreatedByName":"ScramblesTD","CreatedById":72796,"CreatedDateTime":"2013-07-12T14:26:52Z","Content":"\n\u003Cp\u003EThe pioneering spirit behind spaceflight is innovation and invention. Nothing gets technology moving and drives people to invent and innovate like a good ol\u0027 fashioned war. \u003C/p\u003E\u003Cp\u003EBesides, it\u0027s fun trying to use SRBs and sepratron powered missiles to \u0022dispose\u0022 of failed space plane designs. Or using my Mun station to launch an orbital strike on KSC (managed to get with in 500 meters of my target on that one. not bad for doing nearly 3k/s entering the atmosphere.)\u003C/p\u003E\n"},{"CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2013-07-12T14:40:47Z","Content":"\n\u003Cp\u003EI kind of view KSP like a set of Lego. You follow the instructions, put everything together meticulously, and then, when it\u0027s done, get to play with it. But after a while, it gets boring. And you get ideas for what you could build with the bricks from the set, other than the original model. So you decide to destroy it. Either you can take it apart slowly and carefully, or you can throw it on the floor and watch it explode into a hundred bits. The latter is always more fun.\u003C/p\u003E\u003Cp\u003EI do the same thing with KSP, except I use weapons as my method of \u0022throwing\u0022 my work on the ground. It\u0027s fun to design the ships, fun to fly them, and fun to use them. And it gets rid of the old and makes way for the new. Of course in KSP destroying the original isn\u0027t needed to get more parts. But it\u0027s still fun.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-07-12T14:43:23Z","Content":"\n\u003Cp\u003EThe main reason I play KSP is for the engineering challenge. I enjoy the designing whether its a boat, rover, jet fighter or an Apollo replica. Some of the things I enjoy building are military and watching the new building techniques that evolve over time is fascinating. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t mind if other players make weapons or not as long as they just enjoy the game.\u003C/p\u003E\u003Cp\u003EAs there is no multiplayer there is no risk of one player wrecking anothers stuff.\u003C/p\u003E\n"},{"CreatedByName":"cesarcurado","CreatedById":60073,"CreatedDateTime":"2013-07-12T14:56:40Z","Content":"\n\u003Cp\u003EBecause making something to destroy your ship is better than leaving it there or clicking End Flight. \u003C/p\u003E\u003Cp\u003EI hardly do weapons in KSP but when I do they are mostly missiles to practice rocket designs.\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-07-12T15:31:42Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/peVRudf.png\u0022 alt=\u0022peVRudf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/a55KzHf.png\u0022 alt=\u0022a55KzHf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y5uWAAF.png\u0022 alt=\u0022Y5uWAAF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne hit can sever a capital ship in two.\u003C/p\u003E\n"},{"CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2013-07-12T16:27:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zekes\u0022 data-cite=\u0022zekes\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E-awesome massive missile frigate-\u003C/p\u003E\u003Cp\u003EOne hit can sever a capital ship in two.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI assume when you say \u0022capital ship\u0022 you mean Macey-Dean style?\u003C/p\u003E\u003Cp\u003EIf so that\u0027s awesome. If not that\u0027s still awesome. Those are MASSIVE missiles. I\u0027ve never needed anything that big, they must pack a damn powerful punch.\u003C/p\u003E\n"},{"CreatedByName":"camulus777","CreatedById":77385,"CreatedDateTime":"2014-07-29T07:47:36Z","Content":"\n\u003Cp\u003EBecause no one has posted in this thread for over a year I want to say that I hope that KSP stays peaceful focusing on the engineering. If in the future the weapons mods get better then I may add one but until then I will be making all my weapons stock.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-07-30T01:49:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI want to say that I hope that KSP stays peaceful focusing on the engineering. \u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey intend to. Squad has said that stock KSP will not be militarized. And since that\u0027s settled, let\u0027s let this tired old thread go on to its heavenly reward, eh? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}