{"TopicId":25819,"ForumId":32,"TopicTitle":"YRSA Monthly Progress Report","CreatedByName":"Morokth","CreatedById":62433,"CreatedDateTime":"2013-05-07T02:16:20Z","PageNum":1,"Articles":[{"CreatedByName":"Morokth","CreatedById":62433,"CreatedDateTime":"2013-05-07T02:16:20Z","Content":"\n\u003Cp\u003EThe Yaren Republican Space Administration announced today an update to the general public regarding its efforts in gaining a better, higher understanding of the universe in which we live. Direction Salizar Thorin, in a brief press conference, outlined the successes of the Alarim Project which culminated in several manned orbits of the world that ultimately validated not only its existence but also the viability of the Prince class command module. A second model, outfitted with a docking port whee the previous version had not had one, is expected to be field tested in the coming days. \u003C/p\u003E\u003Cp\u003EAdditionally, a few satellites already in other are expected to be joined by four more communications satellites. This new project is believed by many outside observers of the YRSA to be the precursor to probe launchers that will be targeting the Mun. \u003C/p\u003E\u003Cp\u003EFor more information, please renew your subscriptions to the Republican News Gazette, available now at your news stands and book stores.\u003C/p\u003E\n"},{"CreatedByName":"Dr. Muttonstache","CreatedById":55896,"CreatedDateTime":"2013-05-07T02:58:18Z","Content":"\n\u003Cp\u003EDo you mind if I ask...what?\u003C/p\u003E\n"},{"CreatedByName":"lobsterbark","CreatedById":57253,"CreatedDateTime":"2013-05-07T03:02:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dr. Muttonstache\u0022 data-cite=\u0022Dr. Muttonstache\u0022\u003E\u003Cdiv\u003EDo you mind if I ask...what?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts a reference to the fictional world created by an indie game developer, who is currently most famous for making Papers, Please.\u003C/p\u003E\n"},{"CreatedByName":"Morokth","CreatedById":62433,"CreatedDateTime":"2013-05-07T03:14:14Z","Content":"\n\u003Cp\u003EThe YRSA (Yaren Republican Space Administration - or Agency as I tend to use the term interchangeably) is what I call my personal endeavors in the KSP game. In my mind the Yaren Republic is a counterpoint to the kerbals. Same race of kerbaloids, just a different nation vying for supremacy in a manner similar to the old school Cold War era experienced between the US and the USSR. I tend to get a bit creative and like a little artistic jog to the overall game experience, and therefore take and express my own little creative liscence of a sort. (Nothing legal or what not, tho. Just how I enjoy this game)\u003C/p\u003E\n"}]}