{"TopicId":26119,"ForumId":32,"TopicTitle":"Is asparagus the best staging system? (might contain science)","CreatedByName":"Pbhead","CreatedById":64465,"CreatedDateTime":"2013-05-09T04:45:35Z","PageNum":4,"Articles":[{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-08-15T18:09:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LameLefty\u0022 data-cite=\u0022LameLefty\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENow, having said that, the F9 suffered an engine failure on a previous flight and it wasn\u0027t a turbo pump failure, but rather (apparently) a manufacturing or metallurgical problem in the fuel dome above the combustion chamber. Given the scale at which they have to produce Merlin engines (10 for each flight - 9 first stage, 1 second; 28 for each F9H) they are building at a scale not seen since the height of the Space Race. They are more likely to have manufacturing issues as they ramp up, as opposed to say PW/Rocketdyne who essentially hand-build their products at a much slower pace.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen again, the engine that failed was a Merlin1-c. Which is no longer in use. All future launches will use the 1-d which is, I think, %40 more powerful while also having fewer parts and easier to produce. In fact, with the 1-d they have taken to building the turbopumps in house as opposed to using a third party supplier.\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-08-15T19:23:48Z","Content":"\n\u003Cp\u003EOk, I will say one thing about the failures of a rocket in a vegi stage, in real life they would have trained to shut the opposite engine off. In the game we are to busy laughing or screaming in horror to actually do anything about it.\u003C/p\u003E\u003Cp\u003EThey simulate engine failures to prepare for it. We induce them for the fun of it.....\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-15T19:25:57Z\u0022 title=\u002208/15/2013 07:25  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 15, 2013\u003C/time\u003E by Donziboy2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-08-15T20:48:31Z","Content":"\n\u003Cp\u003EIt would be nice if we could pause the game and change settings on parts inflight. It would more closely mimic the split second responses of computer control in real life.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2013-08-15T20:55:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sojourner\u0022 data-cite=\u0022sojourner\u0022\u003E\u003Cdiv\u003EIt would be nice if we could pause the game and change settings on parts inflight. It would more closely mimic the split second responses of computer control in real life.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe DynamicWarp mod (search for it) can slow down time as far as 1/128 speed, which is pretty close to being paused\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-08-15T21:24:03Z","Content":"\n\u003Cp\u003EAh, of course there\u0027s a mod. And after I went through the trouble to make a suggestion thread.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-18T00:28:58Z","Content":"\n\u003Cp\u003EBased on \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/28248-Is-asparagus-the-best-staging-system-%28might-contain-science%29?p=346702\u0026amp;viewfull=1#post346702\u0022 rel=\u0022external nofollow\u0022\u003ETemstar\u0027s post back on page 1\u003C/a\u003E, I\u0027ve created an \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/46569-WEB-Online-engine-stack-calculator\u0022 rel=\u0022external nofollow\u0022\u003Eonline engine stack layout calculator\u003C/a\u003E that does exactly that.\u003C/p\u003E\u003Cp\u003EPlease note that of course it isn\u0027t perfect. For example, it does not take radially-attached engines into account at all. On the other hand, it finds a better solution for Temstar\u0027s example \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOver time, I will expand the calculator with more engines from popular packs.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-08-18T02:36:34Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E God I love this community!\u003C/p\u003E\u003Cp\u003ETemstar, Packled_Hostage (sp?) , Giggleplex, Nhifong, etc.\u003C/p\u003E\u003Cp\u003EAnd now you. This is cool stuff \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-18T16:36:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EOver time, I will expand the calculator with more engines from popular packs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo I did. The calculator now has 46 more engines available.\u003C/p\u003E\n"},{"CreatedByName":"Jarnis","CreatedById":884,"CreatedDateTime":"2013-08-18T16:49:06Z","Content":"\n\u003Cp\u003EThis has been rehashed several times over; The main reason why Asparagus staging is not used in real life is the complexity of plumbing. While in KSP the fuel lines weigh zero and transfer as much as the next tanks down the line can gobble up, in real life such plumbing and inevitable pump hardware weighs real kilograms and add quite a bit to the complexity. Large number of engines is not such a huge deal. Large number of engines interconnected to each other through fuel crossfeed is much more complicated. \u003C/p\u003E\u003Cp\u003EStill, Falcon Heavy is planned to do so at some point (side boosters also fueling core engines until staging so core continues on at full tank) so I guess we\u0027ll see how practical it is at that point.\u003C/p\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2013-09-01T01:56:48Z","Content":"\n\u003Cp\u003EI know that my ships that go from Kerbin to Duna go on an asparagus stage of six mainsail/orange tanks and two stacked mainsail/orange tank combo. That gets me a TWR of around 3.17 to start and never drops below 1.76. Gets to Duna with over 2000 delta-v left for setting my orbit. Oh and that is launching around an 80t payload.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-09-01T16:56:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeGoat\u0022 data-cite=\u0022ComradeGoat\u0022\u003E\u003Cdiv\u003EThat makes sense to me. People talk about how a decent drag model would kill asparagus, but I\u0027m far from convinced. We\u0027re only that concerned with drag for the first 8-10,000 metres anyway, and to a first approximation an asparagus rocket is just a load of individual rockets flying in formation.\u003C/div\u003E\u003C/blockquote\u003E I would not make much of a difference for asparagus designs that have only a few asparagus stages. Wrt drag two asparagus stages is indeed no different than 2 lateral boosters. It would make more of a difference for designs that have many stages, some have multiple layers of asparagus stages.\n"},{"CreatedByName":"LarryWallwart","CreatedById":99622,"CreatedDateTime":"2014-01-14T15:53:14Z","Content":"\n\u003Cp\u003EFor any kind of load at all (like if I want to have enough fuel to return from another planet) I use a modified asparagus. I have found that with a true asparagus as a lower stage, once it sheds all the outer stages the remaining center engine (or center cluster) doesn\u0027t have the thrust to get the payload into orbit. Shedding weight is good, but you are also shedding engines. What I have ended up doing is allowing the final outside stage share fuel (both ways, 2 lines) with the center tank. This leaves me some additional engines to get into orbit.\u003C/p\u003E\n"},{"CreatedByName":"CleverClothe","CreatedById":60997,"CreatedDateTime":"2014-01-14T17:40:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LarryWallwart\u0022 data-cite=\u0022LarryWallwart\u0022\u003E\u003Cdiv\u003EFor any kind of load at all (like if I want to have enough fuel to return from another planet) I use a modified asparagus. I have found that with a true asparagus as a lower stage, once it sheds all the outer stages the remaining center engine (or center cluster) doesn\u0027t have the thrust to get the payload into orbit. Shedding weight is good, but you are also shedding engines. What I have ended up doing is allowing the final outside stage share fuel (both ways, 2 lines) with the center tank. This leaves me some additional engines to get into orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, don\u0027t necro. It is bad form.\u003C/p\u003E\u003Cp\u003ESecond, if you are lacking thrust at any point, your asparagus is poorly designed. Even so, once you are horizontal you only need about 1.0 TWR.\u003C/p\u003E\n"},{"CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2014-01-14T19:25:08Z","Content":"\n\u003Cp\u003E- Screw realism.\u003C/p\u003E\u003Cp\u003E - Screw staging.\u003C/p\u003E\u003Cp\u003E - Screw asparagus\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdd more boosters. \u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"LarryWallwart","CreatedById":99622,"CreatedDateTime":"2014-01-14T19:40:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CleverClothe\u0022 data-cite=\u0022CleverClothe\u0022\u003E\u003Cdiv\u003EFirst, don\u0027t necro. It is bad form.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConsidering I am new to KSP, an old post is just as informative as a new post.\u003C/p\u003E\u003Cp\u003Eregarding the bad design, asparagus will easily lift itself and a capsule, but if you have much more in an upper stage it requires major tweaks.\u003C/p\u003E\n"},{"CreatedByName":"Bane1998","CreatedById":99447,"CreatedDateTime":"2014-01-14T23:40:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeGoat\u0022 data-cite=\u0022ComradeGoat\u0022\u003E\u003Cdiv\u003EInteresting stuff. Quite often I design asparagus rockets with some stages as drop tanks, to avoid the \u0022dropping engines early\u0022 problem. ISTM that the most efficient thing to do is use small fuel tanks and drop them individually as they deplete, and drop engines as they are no-longer needed. This has to be balanced with the increased complexity and decreased structural integrity over fewer, larger boosters, \u003Cstrong\u003Eand the layginess of the launch vehicle\u003C/strong\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI \u003Cstrong\u003Ehate\u003C/strong\u003E that I have to consider laggyness in my designs. It\u0027s perhaps the first part of KSP that has caused me to lose interest. It\u0027s infuriating to have an awesome base/station design with multiple missions over time to build the thing up, and at a certain point it just becomes to laggy to be worth it even if everything is stable and engineered correctly.\u003C/p\u003E\u003Cp\u003EIt seems like a simple fix is some kind of welding mod like system built into the game, where as you start getting lag, the game automatically starts welding parts together or simulating less of it. I\u0027d far rather trade off physics becoming an approximation rather than experience horrendous lag.\u003C/p\u003E\u003Cp\u003EWhen I have 1000 part station does the game really need to simulate each part interacting individually anymore? Just treat it as one massive object and dynamically weld/unweld parts together.\u003C/p\u003E\n"},{"CreatedByName":"SDEngineer","CreatedById":101148,"CreatedDateTime":"2014-01-17T08:22:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LarryWallwart\u0022 data-cite=\u0022LarryWallwart\u0022\u003E\u003Cdiv\u003EConsidering I am new to KSP, an old post is just as informative as a new post.\u003Cp\u003Eregarding the bad design, asparagus will easily lift itself and a capsule, but if you have much more in an upper stage it requires major tweaks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou need to use more thrust on the center stack. Although, if your payload is light enough (\u0026lt;15t) it\u0027s usually more trouble to build an asparagus launcher than it\u0027s worth. But I launch complete, fully fueled, multi-Kerbal (10\u002B) interplanetary mission craft with 5K\u002B dV and weighing around 100 tons into orbit with my heaviest asparagus launchers - and no major tweaking required.\u003C/p\u003E\u003Cp\u003EFor anything really heavy, it\u0027s definitely more efficient to do a full asparagus. I\u0027ve built literally hundreds of different launch stages (playing since 0.18), trying various methods, and in the end, my asparagus launch stages get more to orbit, with more dV remaining than any other design. They are simply a bit more complex to build. I don\u0027t quite use as much rocket science as Temstar on the first page did, but I have about a dozen different launch stages saved, capable of getting anything from 15t (my smallest true asparagus - anything smaller there\u0027s really no need) up to just over 100t into 100km orbit without touching any fuel in the payload (my 100t launch uses a clustered design of 6 LVT30s surrounding a central LVT45 in the center stack, and 6 mainsails in the outer stacks - it\u0027s actually well below a 1.0 TWR when the final boosters drop off, but by then, it\u0027s high enough and going fast enough that it makes 100km circular orbit with enough dV left in the tank for the center stack to do a deorbit burn once the payload has been dropped off). All of them are capable of a payload to weight ratio (to 100km) of at least 14%, which you won\u0027t match with any other form of booster staging.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-01-17T10:52:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SDEngineer\u0022 data-cite=\u0022SDEngineer\u0022\u003E\u003Cdiv\u003E...anything from 15t (my smallest true asparagus - anything smaller there\u0027s really no need)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile \u0022no need\u0022 is subjective, I\u0027m messing around with minimalist launchers at the moment and reduced a simple 1t payload/100km orbit launcher from some 7.9t - 12.66% payload ratio - to 6.52t - 15.34% - using optimal asparagus staging - which for such a small vehicle includes 2 slack-tank stages because more engines aren\u0027t worth their weight. Almost any staging will lift far more than just a capsule, asparagus just does it better. \u0027Tuning\u0027 works better for larger craft because you have more options (there\u0027s only really 2 engines to choose from for something this small). Almost certainly more effort than anyone would want to save less than 1.5t but I\u0027m testing my understand, and the effect, of all the design tips I found here.\u003C/p\u003E\u003Cp\u003ESo thanks to everyone who is posting them :-)\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-01-17T11:16:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Plur303\u0022 data-cite=\u0022Plur303\u0022\u003E\u003Cdiv\u003EHere is a detailed test I did of the same rocket using different staging methods. Sorry if the size is too big. I wanted to fit everything in 1 frame so I could post this on other forums and discussions about the game, not just here.\u003Cp\u003EI used mechjeb to remove human error. It flies the exact same ascent program for all the flights. As you can see, asparagus staging greatly increases the performance of the exact same rocket.\u003C/p\u003E\u003Cp\u003ELink to full size. Small text is visible in full size \u003Ca href=\u0022http://i.imgur.com/XDlDujR.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/XDlDujR.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/XDlDujR.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/XDlDujR.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t read through the whole thread, but I didn\u0027t see this mentioned in the first few pages; am I the only one surprised and slightly confused that the simple crossfeed was outperformed by the two-stager? The only reason I\u0027m coming up with is that it has to do with a sudden drop in TtW when the boosters cut out, but at twenty or thirty km, would that matter? What am I missing?\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-01-17T11:26:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bane1998\u0022 data-cite=\u0022Bane1998\u0022\u003E\u003Cdiv\u003EI \u003Cstrong\u003Ehate\u003C/strong\u003E that I have to consider laggyness in my designs. It\u0027s perhaps the first part of KSP that has caused me to lose interest. It\u0027s infuriating to have an awesome base/station design with multiple missions over time to build the thing up, and at a certain point it just becomes to laggy to be worth it even if everything is stable and engineered correctly.\u003Cp\u003EIt seems like a simple fix is some kind of welding mod like system built into the game, where as you start getting lag, the game automatically starts welding parts together or simulating less of it. I\u0027d far rather trade off physics becoming an approximation rather than experience horrendous lag.\u003C/p\u003E\u003Cp\u003EWhen I have 1000 part station does the game really need to simulate each part interacting individually anymore? Just treat it as one massive object and dynamically weld/unweld parts together.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s the main reason I installed KJR. I \u003Cem\u003Ecould\u003C/em\u003E build whatever rocket I wanted, strut it up, and it would be stable, however, the lag was godawful. KJR allowed me to cut the part count in half, and made building the damn thing a lot less tedious.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-17T11:28:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LarryWallwart\u0022 data-cite=\u0022LarryWallwart\u0022\u003E\u003Cdiv\u003EFor any kind of load at all (like if I want to have enough fuel to return from another planet) I use a modified asparagus. I have found that with a true asparagus as a lower stage, once it sheds all the outer stages the remaining center engine (or center cluster) doesn\u0027t have the thrust to get the payload into orbit. Shedding weight is good, but you are also shedding engines. What I have ended up doing is allowing the final outside stage share fuel (both ways, 2 lines) with the center tank. This leaves me some additional engines to get into orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPoints of asparagus staging are:\u003C/p\u003E\u003Cp\u003E- every time you stage, you get a rocket full of fuel. So you\u0027re not carrying any dead weight of half empty fuel tanks\u003C/p\u003E\u003Cp\u003E- engine capacity (and TWR) available scales well with the rocket size. With each stage you have control over how much thrust you are dropping along with empty fuel tanks and how much you keep\u003C/p\u003E\u003Cp\u003EIf under \u0022true asparagus\u0022 you understand seven stacks of Jumbo tanks with a mainsail at the bottom then your perception of asparagus is too narrow. Your \u0022modified asparagus\u0022 is just asparagus where you merged two last stages into one because you need to keep the TWR high. That can be achieved many different ways and it will still be asparagus.\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-01-17T11:34:41Z","Content":"\n\u003Cp\u003EAFAIK asparagus is the most efficient staging method, period. However, I rarely use it and prefer to use radial boosters without crossfeed. It looks much more realistic. When I do use asparagus, I only do it with two radial boosters.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-01-17T12:14:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bsalis\u0022 data-cite=\u0022bsalis\u0022\u003E\u003Cdiv\u003EOne thing to be mindful of when using asparagus-style staging is that if all the stacks are the same, the payload becomes proportionally heavier as you drop stages. So the TWR will go down. That is not what you want at, say, around 10Km where you clear the thickest of the atmo and want to start hammering it east. This can be fixed if you make the stacks smaller (less fuel, same engine, more TWR) as you progress the staging sequence.\u003Cp\u003EOr... just don\u0027t use asparagus-style staging. I do not. Sure it\u0027s more efficient, but more complicated and harder to build robust large craft.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnother way to do it it and one I often do with three stage aspargus rockets is an heavy first stage, two booster who has a twr of close to 1 alone, an fuel tank with an engine who carries it. after dropping at second stage the twr is far higher and it goes down again for the single engine 3rd stage.\u003C/p\u003E\u003Cp\u003Ei tend to use trashcans to help the rocket up to 100 m/s fast after takeoff.\u003C/p\u003E\u003Cp\u003EThis is an more advanced 5 stage version who lift close to 5 orange tanks to orbit, you notice the long first stage booster, the shorter second stage and stager 3 and 4, fuel carrier itself finish circulate. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/CMq56W8\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/CMq56W8.jpg\u0022 alt=\u0022CMq56W8.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe reason to use asparagus over normal serial staging in KSP is that engines has poor TWR, so you want all engines to burn to increase TWR, yes this can be solved with standard side boosters but you then has to carry the empty fuel tank with you.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-17T12:20:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iRommel\u0022 data-cite=\u0022iRommel\u0022\u003E\u003Cdiv\u003Ei used staged asparagus. \u003Cp\u003Ebasically its an asparagus rocket ON TOP of asparagus stages.\u003C/p\u003E\u003Cp\u003Eso i have 7 mainsails at the bottom... 2 tanks drop off and expose 2 more mainsails at the middle of the rocket which then fire. the key is terminal velocity and TWR. i use mechjeb and i can see that this configuration keeps my rocket just under terminal velocity nearly the whole time minimizing loss due to gravity and drag because it moves quickly to get out of the air.\u003C/p\u003E\u003Cp\u003Emy previous long asparagus rockets would drop off a stage...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re carrying extra engine weight though, use longer tanks I would think. I have a long tail fed core of 4 central boosters which are fed in a type of swastika arrangement. Right in the middle is my heaviest that stages last.\u003C/p\u003E\n"},{"CreatedByName":"wilt57","CreatedById":64653,"CreatedDateTime":"2014-01-17T19:08:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EI didn\u0027t read through the whole thread, but I didn\u0027t see this mentioned in the first few pages; am I the only one surprised and slightly confused that the simple crossfeed was outperformed by the two-stager? The only reason I\u0027m coming up with is that it has to do with a sudden drop in TtW when the boosters cut out, but at twenty or thirty km, would that matter? What am I missing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnless I have misidentified the engines, Plur303 was using Mainsails. For each Mainsail he/she had two X200-32s and the payload wasn\u0027t very much. This is way too small of a ship for asparagusing Mainsails, they can lift way more than that. I saw that MechJeb was using auto-throttle, and 6 Mainsails provide plenty of thrust through most (actually all) of the ascent, let alone a seventh fed through cross-feeding. There was really no benefit to cross-feeding the center engine unless that extra thrust was actually needed. The two-stage saved what? Eight units of fuel, I think? Yes, the \u0022onion\u0022 staged should have out performed it, but it is really close all told because it should be for this particular situation. Get a situation where that 7th engine is needed to maintain enough TWR over the entire life (or the vast majority) of that first stage, and you\u0027ll see the cross-feeding advantages more clearly.\u003C/p\u003E\n"}]}