{"TopicId":26553,"ForumId":32,"TopicTitle":"Can anyone make sense of this trajectory?","CreatedByName":"Boffinbox","CreatedById":64687,"CreatedDateTime":"2013-05-12T16:53:42Z","PageNum":1,"Articles":[{"CreatedByName":"Boffinbox","CreatedById":64687,"CreatedDateTime":"2013-05-12T16:53:42Z","Content":"\n\u003Cp\u003ESo i\u0027m adjusting my trajectory around Duna, and then I get this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0rRITLs.jpg\u0022 alt=\u00220rRITLs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been playing for a while now, but I haven\u0027t had that happen until now.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6zBOr9i.jpg\u0022 alt=\u00226zBOr9i.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDoes anyone wanna try and make sense of what it wants to do with the vehicle?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FNC2I3T.jpg\u0022 alt=\u0022FNC2I3T.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2013-05-12T16:55:59Z","Content":"\n\u003Cp\u003EYou vehicle is going to go out, enter the influence of the moon, and then it will get slingshotted back into Duna orbit. Basically the moon will capture you ship and then give it extra speed and a different direction.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-12T17:08:42Z","Content":"\n\u003Cp\u003EYeah, moon slingshots are fun... I went for a straightforward run from Kerbin to Minmus using MechJeb\u0027s Transfer orbit system.... and ended up crashing on Moho lol.\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2013-05-12T17:29:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EYeah, moon slingshots are fun... I went for a straightforward run from Kerbin to Minmus using MechJeb\u0027s Transfer orbit system.... and ended up crashing on Moho lol.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow. I\u0027ve never actually used slingshots to that extent. They\u0027ve always been more of a pain in the ass when I want to go into orbit around Duna or something.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-05-12T17:29:38Z","Content":"\n\u003Cp\u003EIt looks like your ship will get a gravity assist from Ike, come back around Duna and Encounter Ike again. Its a double gravity Assist!\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-05-12T17:33:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EYeah, moon slingshots are fun... I went for a straightforward run from Kerbin to Minmus using MechJeb\u0027s Transfer orbit system.... and ended up crashing on Moho lol.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Wow. If only there where easy ways to replicate that. My attempt to use a gravity assist to get to Moho cost more than a direct transfer, even with everything lined up. (As far as I could tell.)\u003C/p\u003E\n"},{"CreatedByName":"Boffinbox","CreatedById":64687,"CreatedDateTime":"2013-05-12T17:38:42Z","Content":"\n\u003Cp\u003Eoh right, i see. i got thrown off by the \u0022Ike Apoapsis\u0022 marker because it doesn\u0027t make sense :/\u003C/p\u003E\u003Cp\u003Ei was wondering if anyone has had similar conditions before, or whether my game is just bugged or something...\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2013-05-12T17:44:52Z","Content":"\n\u003Cp\u003ENo, happens all the time with me.\u003C/p\u003E\n"},{"CreatedByName":"SmallChange","CreatedById":3519,"CreatedDateTime":"2013-05-12T17:45:19Z","Content":"\n\u003Cp\u003EIt\u0027s pretty amazing how much velocity you can gain from gravity assists.\u003C/p\u003E\u003Cp\u003EThat\u0027s the only way Voyager was able to get as far out as it is. There was a launch window where they were able to just chain the gravist assists, one after the other.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pkbDU0v.png\u0022 alt=\u0022pkbDU0v.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-05-12T20:21:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketPilot573\u0022 data-cite=\u0022RocketPilot573\u0022\u003E\u003Cdiv\u003EIt looks like your ship will get a gravity assist from Ike, come back around Duna and Encounter Ike again. Its a double gravity Assist!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E assist might be streaxhing it, n less your goal is to excape.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-05-12T21:16:40Z","Content":"\n\u003Cp\u003EI think Ike is incredibly easy to get an encounter on; as I always manage to get one accidently when I visit the Duna system. I think your spacecraft is in a partially synchronous orbit with the moon, which is why you\u0027re getting that non-elliptical brown trajectory. Then, of course it fires you away with a gravity assist.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-13T06:44:33Z","Content":"\n\u003Cp\u003EI think the best gravity assist I ever had was from Ike too... I managed to get one of my mining pods into Duna orbit without even having to aerobrake because Ike caused my orbit to flip and forced me into a figure 8, came back around and then Ike slowed me again. Unfortunately I had accelerated time so fast that all this happened before I could stop it so I couldn\u0027t replicate it which was annoying because I spent about 4 hours trying to do so lol. Total accident and I got a perfect circular orbit with NO aerobrake and NO retrograde burn. The ultimate in fuel economy. Did get some good slingshots though and learned a lot about getting into the right orbit after aerobraking without having to do orbit alignment changes. \u003C/p\u003E\u003Cp\u003ESometimes accidents are the best teachers.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-05-13T06:48:10Z","Content":"\n\u003Cp\u003Ethink of it as a cheap way to change your inclination.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-05-13T15:36:13Z","Content":"\n\u003Cp\u003EThe reason this looks so strange is since Ike is so large relative to Duna, it\u0027s sphere of influence is quite large relative to its orbit. And your trajectory has a rather low Ike-relative velocity at the SoI transition, so you are orbiting Ike for a good long time. Blue is in Duna\u0027s SoI, yellow is in Ike\u0027s SoI for what looks like more than one full Ike orbit around Duna. Purple is back in Duna\u0027s SoI again.\u003C/p\u003E\n"}]}