{"TopicId":26800,"ForumId":32,"TopicTitle":"So, my vehicle keeps blowing up","CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-05-14T09:10:37Z","PageNum":1,"Articles":[{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-05-14T09:10:37Z","Content":"\n\u003Cp\u003EI build a nice moblie base/munrover for my munbase and it works perfectly fine...The first time I launch it from the SPH everything works fine, except that I canÃ‚Â´t go back to the spacecenter, only end the flight.\u003C/p\u003E\u003Cp\u003EBut if I then decide to restart the flight hell breaks loose. Some parts of my vehicle instantly blow up and destroy my vehicle. Even if I turn unbreackable joints and no colisiondamage in debugmode on parts of my vehicle still blow up. I have tryed deattaching the parts blowing up, but this only results in other parts blowing up.\u003C/p\u003E\u003Cp\u003EDoes anyone have clue what could cause this?\u003C/p\u003E\u003Cp\u003E(PS: No pictures right now, you will have to wait until I get home)\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-05-14T09:15:17Z","Content":"\n\u003Cp\u003EWas your mobile vehicle fully stopped (setting the parking brake is a good idea) when you tried to go back to the Space Center?\u003C/p\u003E\u003Cp\u003EBut I have no idea why you then get explosions.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-14T09:33:48Z","Content":"\n\u003Cp\u003EThis problem happens with rockets too. I usually go back to space center and then select the VAB and check the vehicle out again. I guess you could do the same with the SPH.\u003C/p\u003E\n"},{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-05-14T09:39:33Z","Content":"\n\u003Cp\u003EYes it is fully stopped, throttle is down. I can drive wherever I want, but not exit the flight wihtout ending it. With other flights nothing specil happens, so this is most likely something related to this craft. I will try to post screens and the .craft file once I am Home.\u003C/p\u003E\n"},{"CreatedByName":"Klajan","CreatedById":64866,"CreatedDateTime":"2013-05-14T09:41:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EThis problem happens with rockets too. I usually go back to space center and then select the VAB and check the vehicle out again. I guess you could do the same with the SPH.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, this way I can launch it without instantly blowing up, but I sill can not exit the flight without ending it. I also suspect, that it will blow up once I reload it during a mission.\u003C/p\u003E\n"}]}