{"TopicId":26920,"ForumId":32,"TopicTitle":"Getting back into KSP with a trans-Kerbin airship","CreatedByName":"JacobT11","CreatedById":11673,"CreatedDateTime":"2013-05-15T03:17:30Z","PageNum":1,"Articles":[{"CreatedByName":"JacobT11","CreatedById":11673,"CreatedDateTime":"2013-05-15T03:17:30Z","Content":"\n\u003Cp\u003EHaving been away from KSP for a few months (thanks a bunch life) I\u0027ve decided to finally get back into the game. I\u0027m amazed by how much the mods have come along recently, I\u0027m especially impressed with Hooligan Labs airships, the Kerbal Attachment System, and Firespitter\u0027s parts. So, I decided to go ahead and use all three of these mods to reacquaint myself with Kerbin. Explore some of the terrain a bit. \u003C/p\u003E\u003Cp\u003EI spent a good portion of the day playing with those three mods, figuring out how they all work, and finally it was time to build the airship I\u0027d be using to traverse the world. I\u0027ve taken a good bit of inspiration from the airship shown in the KAS image on the SpacePort, but tweaked quite a bit. For this flight I\u0027ve allowed myself infinite fuel/rcs fuel, otherwise, no cheats.\u003C/p\u003E\u003Cp\u003EI built one airship, but forgot some crucial things, like EVA ladders and lights, so I landed it on the western shore of the continent that the spaceport is on. I figured I could modify the ship, then rendezvous with the first ship. So, without further delay, here\u0027s the first flight of Tranquility II.\u003C/p\u003E\u003Cp\u003ESitting on the runway before launch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9a7rz2w.png\u0022 alt=\u00229a7rz2w.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAirborne, but the tethers are holding tight.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iewopXC.png\u0022 alt=\u0022iewopXC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETethers are free, starting to climb.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gbztSW0.png\u0022 alt=\u0022gbztSW0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinally at the cruising altitude of 7245 meters.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/A86qyiA.png\u0022 alt=\u0022A86qyiA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHalf-way across the continent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/X9EXLmR.png\u0022 alt=\u0022X9EXLmR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETranquility I is in sight.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AVzwxwa.png\u0022 alt=\u0022AVzwxwa.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHigh angle during final descent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gW7N81Q.png\u0022 alt=\u0022gW7N81Q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere we go, parked next to Tranquility I.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VDfps7m.png\u0022 alt=\u0022VDfps7m.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETotal mission time was 1 hour 7 minutes. Not too bad.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sDf3Ed2.png\u0022 alt=\u0022sDf3Ed2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext up, I\u0027ll be heading across the ocean towards the deserts of the next continent. Might also move the Tranquility I back to the spaceport.\u003C/p\u003E\n"}]}