{"TopicId":27139,"ForumId":32,"TopicTitle":"Crazy experiences.","CreatedByName":"gompasta","CreatedById":560,"CreatedDateTime":"2013-05-16T17:40:35Z","PageNum":1,"Articles":[{"CreatedByName":"gompasta","CreatedById":560,"CreatedDateTime":"2013-05-16T17:40:35Z","Content":"\n\u003Cp\u003EI have just had the most nuttiest experience i have had on KSP for a LONG time.\u003C/p\u003E\u003Cp\u003EBasically, i was testing out a new plane design, and strapped a parachute to the side of it that should have deployed and destroyed the rear section of the plane, to simulate catastrophic emergencies.\u003C/p\u003E\u003Cp\u003EWhen I took off, the parachute deployed long before i wanted it to, even though it was not on any active stages. What i did was, turned on the avionics, and let the plane fly itself, and mid-flight, i got Jeb to climb out of the plane, and make his way back to the tail section of the craft to repack the chute. However, he managed to make it to the engine block (Where the parachute was), but got himself wedged between the engine and the fuselage. Now there was no pilot. Mechjeb was on-board, but i was not going to use it for these tests. Luckily the engines cut out when i EVA\u0027d, and the avionics was holding a steady angle, so all jeb could do was hold on and hope.\u003C/p\u003E\u003Cp\u003EAll jeb had control of was the parachutes. Deploying and cutting it when needed to slow the plane down. Slowly, but surely, the plane was descending and at a nice angle. Eventually, the ground was in reaching distance, and the plane made a bit of a hard contact with the ground, making it bounce slightly, but fully intact. Eventually, the plane slowed and made it to a stop. Jeb is one lucky thrillseeker.\u003C/p\u003E\u003Cp\u003EUnfortunately, i had no pictures of the actual incident. The only witnesses were the Kerbal Live Feed community. Jeb made these recreations after landing for his AAR.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://screenshu.com/static/uploads/temporary/og/io/wf/id7fim.jpg\u0022 alt=\u0022id7fim.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb doing his publicity pose.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8olpIUR.jpg\u0022 alt=\u00228olpIUR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHave any of you had anything crazy that happened to you? Anything that you had difficulty believing actually happened?\u003C/p\u003E\n"},{"CreatedByName":"SmallChange","CreatedById":3519,"CreatedDateTime":"2013-05-16T18:31:36Z","Content":"\n\u003Cp\u003EThe getting wedged part is pretty common, but the landing?\u003C/p\u003E\u003Cp\u003EWOW! I would have been rolling on the floor!\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-05-16T18:51:48Z","Content":"\n\u003Cp\u003EVery Kerbal,\u003C/p\u003E\u003Cp\u003ELet me guess, he was laughing the hole way down?\u003C/p\u003E\n"},{"CreatedByName":"tstehler1","CreatedById":61706,"CreatedDateTime":"2013-05-16T20:54:13Z","Content":"\n\u003Cp\u003EThis is making me wish so hard that you could record video from the first-person view of a Kerbal... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-05-16T21:12:34Z","Content":"\n\u003Cp\u003EConsider Kerbals\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-06T13:17:14Z\u0022 title=\u002206/06/2013 01:17  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 6, 2013\u003C/time\u003E by dr_jt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptinKornflake","CreatedById":61355,"CreatedDateTime":"2013-05-16T23:17:03Z","Content":"\n\u003Cp\u003EThat\u0027s amazing\u003C/p\u003E\u003Cp\u003Ethe amount of skill like omg\u003C/p\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-05-16T23:36:05Z","Content":"\n\u003Cp\u003EIt\u0027s for reasons like this that I add an unmanned probe controller to all manned vessels. That way, if the pilot goes EVA, I\u0027ll still have full control of the vehicle. The new squashed controller is really handy for this, although I prefer the appearance of the BOMP mod\u0027s stack controllers; their energy costs are small (and I put an RTG on my designs on general principle), the extra torque is handy, and they don\u0027t take up much room or weight. It\u0027s also allowed me to do things like send an empty spaceplane to meet up with Jeb over Eve, so he can fly it down and back up instead of having to find a way to get my normal interplanetary rocket to make the ascent.\u003C/p\u003E\u003Cp\u003EBut yeah, if you put enough wing area on a design, it\u0027s amazing how easy it is to land, even uncontrolled. The aerodynamic model in KSP needs to be overhauled, but for now it makes it really easy to build something that can glide in unpowered and mostly uncontrolled. Still impressive that everything worked, though.\u003C/p\u003E\n"},{"CreatedByName":"gompasta","CreatedById":560,"CreatedDateTime":"2013-05-17T12:33:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deadpangod3\u0022 data-cite=\u0022Deadpangod3\u0022\u003E\u003Cdiv\u003EVery Kerbal,\u003Cp\u003ELet me guess, he was laughing the hole way down?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup. He looked at this as a challenge for his intelligence... Forgetting the fact that he got himself stuck in the first place.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2013-05-17T12:51:41Z","Content":"\n\u003Cp\u003EThe only way this would have been more impressive would be if Jeb somehow got that plane into orbit while stuck there.\u003C/p\u003E\u003Cp\u003EI had a similar experience, but with a rover on the Mun. I had dropped it off with a sky crane and it started rolling away. I quickly got a Kerbal flying after it to gain control. He somehow tripped up on it and got stuck on the rover, going about 4km away. It got some decent speed up too, I was surprised it didn\u0027t roll and kill him.\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-05-17T12:53:21Z","Content":"\n\u003Cp\u003ENice ballistic flight.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-06T13:15:03Z\u0022 title=\u002206/06/2013 01:15  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 6, 2013\u003C/time\u003E by dr_jt\u003C/strong\u003E\n\u003C/span\u003E\n"}]}