{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":208,"Articles":[{"CreatedByName":"NoPanShabuShabu","CreatedById":91327,"CreatedDateTime":"2014-02-14T02:15:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003EWent to bed before posting about it but yesterday, I finished and did a shake-down run of a science supply chain to easily harvest the rest of the science from Mun. It consists of a low-orbiting Munar station; a reusable lander that can detach from the station, land, collect data, then bring itself back up, re-dock, transfer science (via Kerbal) to the station, refuel, and repeat; and the key element, a \u0022Science Shlepper\u0022 craft with a bunch of extra command pods allowing it to bring large amounts of data back to Kerbin for maximum credit.\u003Cp\u003EI\u0027m gonna find out if it\u0027s possible to clear the tech tree without leaving Kerbin\u0027s SOI (except maybe a little bit for \u0022high over the Sun\u0022 data).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETotally possible. All of the Mun science should be about 12,000. All Minmus is 9,702. Not including stuff like \u0022Recovered a ship from Mun orbit.\u0022\u003C/p\u003E\n"},{"CreatedByName":"NoPanShabuShabu","CreatedById":91327,"CreatedDateTime":"2014-02-14T02:30:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003EHaha. I\u0027m ok with that. \u003Cp\u003E Some good ones there already.\u003C/p\u003E\u003Cp\u003EI\u0027ve had that happen. I planted one on the VAB roof, found it on the side building, fallen over.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I\u0027ve had them glitch over before too, and that\u0027s probably what happened to the KSC Runway flag. The Island however I think is when Jeb (may he rest in peace) tried landing IVA on the island. Since we know that the Island runway is at 133 m above sea level, he was shooting for that level. Unfortunately, that doesn\u0027t work when you are watching the above ground level altimeter... He survived that one.\u003C/p\u003E\u003Cp\u003EEdit: You would think that it means that you were OK since you were actually higher than you thought. It went more like this: Ok, coming in at a decent level... Woah? I am totally not dropping like a stone! Holy crap, that\u0027s the AGL! How high are we? I can\u0027t tell from the cockpit! Fly up! Bam! How did you survive that Jeb?\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-14T02:35:15Z\u0022 title=\u002202/14/2014 02:35  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 14, 2014\u003C/time\u003E by NoPanShabuShabu\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mr.Rocket","CreatedById":80241,"CreatedDateTime":"2014-02-14T03:29:29Z","Content":"\n\u003Cp\u003EWhat did i do in KSP today? Well, i downloaded the city lights and cloud mod. Noticed Eve looked very cool. So i sent my second ever kerbaled mission there. one way of course, with a rover. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ohlo0\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-02-14T05:47:40Z","Content":"\n\u003Cp\u003EToday I upgraded the Jebulon Station with liquid fuel and RCS reserves, as well as a pair of space cars to keep the crew entertained, and did another science strip-mining run on the Mun - at the same time.\u003C/p\u003E\u003Cp\u003ENo pics because this thread has way too many pics already.\u003C/p\u003E\n"},{"CreatedByName":"spinomonkey","CreatedById":102142,"CreatedDateTime":"2014-02-14T05:58:36Z","Content":"\n\u003Cp\u003EActually that brings up a really good question. Why aren\u0027t there clouds already in the game? I mean heck, even it were a camera trick that vanished when you got close \u0026gt;.\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-14T07:40:04Z","Content":"\n\u003Cp\u003EWell, I lost patience, so after landing my - strangely slow - Mun rover and taking a quick stroll around my Kethane site there, I put the universe into overdrive to get my Duna scouting probe and Duna Expedition One to their destination.\u003C/p\u003E\u003Cp\u003EThe scout arrived at SOI only to suddenly miss the encounter??\u003C/p\u003E\u003Cp\u003EWill have to revert to a backuped save file ...\u003C/p\u003E\u003Cp\u003EI dabbled with the crew taxi again, but I just cannot space plane for the life of a Kerbal ...\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2014-02-14T08:07:11Z","Content":"\n\u003Cp\u003EToday I visited space ;D\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/8JTi4\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-02-14T08:12:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe scout arrived at SOI only to suddenly miss the encounter??\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow fast were you warping during the SOI change?\u003C/p\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2014-02-14T11:45:10Z","Content":"\n\u003Cp\u003EOverfloater, that little shuttle\u0027s, well there\u0027s no other word for it, cute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve continued to experiment with my shuttles, and managed to get a side mounted design working well. It\u0027ll be ferrying Jebidiah back down to Kerbin\u0027s surface once he\u0027s back from his Duna expedition.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-02-14T12:05:38Z","Content":"\n\u003Cp\u003EPlaying with the laggy unpredictable donuts tank rocket. No braces allowed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Aul5Riz.jpg\u0022 alt=\u0022Aul5Riz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMatched with the right engine, flight becomes quite stable where the 100 tank donuts can almost do a SSTO.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Q5b6jcg.jpg\u0022 alt=\u0022Q5b6jcg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJust don\u0027t accelerate time. The slinky effect will rip it apart.\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-02-14T12:11:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003EPlaying with the laggy unpredictable donuts tank rocket. No braces allowed.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Aul5Riz.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Aul5Riz.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMatched with the right engine, flight becomes quite stable where the 100 tank donuts can almost do a SSTO.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Q5b6jcg.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Q5b6jcg.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJust don\u0027t accelerate time. The slinky effect will rip it apart.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s really... phallic.\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2014-02-14T12:50:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DunaRocketeer\u0022 data-cite=\u0022DunaRocketeer\u0022\u003E\u003Cdiv\u003EOverfloater, that little shuttle\u0027s, well there\u0027s no other word for it, cute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EI\u0027ve continued to experiment with my shuttles, and managed to get a side mounted design working well. It\u0027ll be ferrying Jebidiah back down to Kerbin\u0027s surface once he\u0027s back from his Duna expedition.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just don\u0027t understand what is it with the big orange thing \u0026amp; the 2 SRB\u0027s people keep attaching to it... xD\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003EPlaying with the laggy unpredictable donuts tank rocket. No braces allowed.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Aul5Riz.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Aul5Riz.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMatched with the right engine, flight becomes quite stable where the 100 tank donuts can almost do a SSTO.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Q5b6jcg.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Q5b6jcg.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJust don\u0027t accelerate time. The slinky effect will rip it apart.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh my lard, it\u0027s almost like the floppy rocket from uToob ;D\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-02-14T13:11:32Z","Content":"\n\u003Cp\u003EInstalled KAS. Played around with it a bit. Mainly spent the evening farting around attempting to build a crash cart for the Auk VIII, something to refuel it and haul it back to the end of the runway after it lands (just \u0027cause). Had issues with it - probably because I\u0027ve never attempted to build a rover that massive before (case in point, the Burning Hearse 7, my large Kerbal bus, came in at about ten tonnes. This thing was topping fifty before it was set and done.\u003C/p\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-02-14T13:18:45Z","Content":"\n\u003Cp\u003EIÃ‚Â´m compelled to create my own SSTO after seing those \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-14T13:21:12Z\u0022 title=\u002202/14/2014 01:21  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 14, 2014\u003C/time\u003E by Wooks\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-02-14T13:19:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003EPlaying with the laggy unpredictable donuts tank rocket. No braces allowed.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Aul5Riz.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Aul5Riz.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMatched with the right engine, flight becomes quite stable where the 100 tank donuts can almost do a SSTO.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Q5b6jcg.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Q5b6jcg.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJust don\u0027t accelerate time. The slinky effect will rip it apart.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had to. I just had to do it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh5.googleusercontent.com/-MNc6WKUobcA/Uv4XmZRUBBI/AAAAAAAAAOk/OPtZ4HOrTJI/w798-h497-no/139238718689715.jpg\u0022 alt=\u0022139238718689715.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Zatie12","CreatedById":57823,"CreatedDateTime":"2014-02-14T14:51:40Z","Content":"\n\u003Cp\u003EGregdorf attmpted to land his space plane on Duna today. Things didn\u0027t quite go as planned....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Bb7kqJB.jpg\u0022 alt=\u0022Bb7kqJB.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Poynting","CreatedById":103397,"CreatedDateTime":"2014-02-14T14:55:11Z","Content":"\n\u003Cp\u003ECrater jumping in a manned rover on the Mun. Low gravity makes for some good air! (And the time to roll yourself back over if you flip upside down on launch \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-02-14T15:17:25Z","Content":"\n\u003Cp\u003EYesterday I landed my Mun Science lander for my career mode series on youtube, but somehow the recording software buggered up so I lost all of the stuff before the landing. I have the rest of the video though so I will post what I have, but I am disappointed with what happened though. I guess I should have waited for my my online class to be done so I was not as distracted while trying to do the filming. The whole mission though was a bit of a mess as my fuel lines on my side tanks were not connected and caused me to have to work more as I left Mun. One bright side to the mission though was that I got to see the Mun Arch as I was leaving, I thought I seen it as I was landing, but I was not sure at the time.\u003C/p\u003E\n"},{"CreatedByName":"Hofnarr","CreatedById":102860,"CreatedDateTime":"2014-02-14T15:38:36Z","Content":"\n\u003Cp\u003EAfter a long time reading, i decided to post here too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EStarted my first attempt on getting any ship back to Kerbin after Orbitig another Planet.\u003C/p\u003E\u003Cp\u003ESo, I launched my Artreus (Transport vessel, with dockable stages (Apargus Staging) with lots of dV (3 Stages with an overall dV of about 15000m/s) a huge dV overkill vor orbiting duna, ike and back to Kerbin.\u003C/p\u003E\u003Cp\u003EAnyway instead of a lander or Satelite i docked a Sience module containing a few Material Bay\u0027s, Goo containers and so forth. I intended to leave Artreus in LKO for refueling (and redocking, as I used up one of the stages) and deorbit the Sience Module.\u003C/p\u003E\u003Cp\u003EBack in Kerbin Orbit i recognized i forgot any propulsion on this module.. so I decided to try aerobrakeing with the artreus, so i can undock and circularize Artreus\u0027s orbit afterwards and let the module deorbit.\u003C/p\u003E\u003Cp\u003EWith my balls of steel I forgot to quicksave, and crushed the artreus on Kerbin. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E (I thougt \u0022I\u0027m going fast, i need to aerobrake deep into the atmosphere\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E ) Luckily the module survived(parachutes ftw) with its 2k sience on board. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext Mission: do the same to Eve and Gilly.\u003C/p\u003E\n"},{"CreatedByName":"Jank","CreatedById":97123,"CreatedDateTime":"2014-02-14T17:06:21Z","Content":"\n\u003Cp\u003EStationed my Minmus Orbital Science Station in orbit around the green cheese moon. Next up is sending a lander and mining out the science from the new biomes to complete my tech tree. Also it is a test for future interplanetary science-extraction efforts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://imagizer.imageshack.us/v2/1193x746q90/208/5pdh.jpg\u0022 alt=\u00225pdh.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Concentric","CreatedById":103320,"CreatedDateTime":"2014-02-14T17:48:07Z","Content":"\n\u003Cp\u003EMade yet another vacuum lander, and did some Minmus biome hopping. An extremely overpowered lifting stage - basically the same thing I used to lift the big tank module to Station Aleph - and some planned fuel redundancy meant that reports, samples, temperature readings and seismic data could all be gathered from three separate biomes and still be able to return with a whole spare tank of fuel when landing. Just a small tank though, the one initially available. So that was 1200 science in one mission, a new PB.\u003C/p\u003E\u003Cp\u003EAfterwards, continued work on my first space station (Station Aleph), adding a command module with a Cupola, and a little extra length which also had my new Gigantor arrays. Not sure what else I\u0027m going to put on that thing, but so far in making it I\u0027ve learned quite a bit about docking and station design. Still need a shuttle-thing, and possibly a better SSTO. Might do those together.\u003C/p\u003E\n"},{"CreatedByName":"irongut","CreatedById":97315,"CreatedDateTime":"2014-02-14T17:59:36Z","Content":"\n\u003Cp\u003ELast night I launched the core module for Elysium Station, my first LKO station, into a nice circular 150km orbit:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/3335217092224523535/CFDFF9E969748AF11A8C4161BA60ADC70E329091/1024x576.resizedimage\u0022 alt=\u00221024x576.resizedimage\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe core module comprises liquid fuel storage, mono-propellant storage, electricity generation and storage and the docking arms for other modules and ships. It also has an engine and OKTO core that will be useful if I need to move the station to avoid debris or for decommissioning.\u003C/p\u003E\u003Cp\u003ETonight I plan to launch the crew habitat module comprised of cupola, hitchhiker crew quarters and a science lab. Bill and Bob refused to man anything piloted by Jeb so I\u0027ve recruited 5 new \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Evictims\u003C/span\u003E brave Kerbonaughts for the mission.\u003C/p\u003E\n"},{"CreatedByName":"Mr.Rocket","CreatedById":80241,"CreatedDateTime":"2014-02-14T19:03:41Z","Content":"\n\u003Cp\u003EI went to Moho for the first time today. I got extremely lucky. As it was doing the burn from Kerbin to Moho, i got an Eve ecounter too. So i went to Eve to wait for a Moho launch window there. While i was slowing down to Eve orbit, i got a Moho ecounter, without even getting into Eve orbit yet. Now, i have officially landed everywhere, except on Jool. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Rq0Xx\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-02-14T22:36:00Z","Content":"\n\u003Cp\u003EUploaded my first \u0022real KSP video\u0022 on the YouTubes. I tried to put in explanations to why I did certain things. Also, I used some more Kevin Macleod music (along with another piece).\u003C/p\u003E\u003Cp\u003EThe previous \u0022video\u0022 I uploaded consisted mostly of a slide show with some video at the end.\u003C/p\u003E\u003Cp\u003EWarning - Easter Egg / Anomaly SPOILERS in the video.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/34Ex30d1li4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThe rest of the mission report for anyone interested, in the... Mission Reports subforum: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64251-Jool-Mission-Discovery-2-A-Space-Oddity-%28updated-2-14-with-better-video%21%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/64251-Jool-Mission-Discovery-2-A-Space-Oddity-%28updated-2-14-with-better-video%21%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-02-14T22:42:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wooks\u0022 data-cite=\u0022Wooks\u0022\u003E\u003Cdiv\u003EI had to. I just had to do it.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is NOT the Austin Powers villain\u0027s rocket. It does not have the bulbous fuel cans at the base.\u003C/p\u003E\n"}]}