{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":769,"Articles":[{"CreatedByName":"Jetenginestar","CreatedById":77797,"CreatedDateTime":"2015-10-10T04:17:11Z","Content":"\n\u003Cp\u003EThe KSC campus is worth A LOT of science actually \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OqtCLAB.png\u0022 alt=\u0022OqtCLAB.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/m0YbWa3.png\u0022 alt=\u0022m0YbWa3.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2015-10-10T04:32:11Z","Content":"\n\u003Cp\u003ESomething really powerfull, but dangerous...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/A9l7j9S.jpg\u0022 alt=\u0022A9l7j9S.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-10-10T04:38:31Z","Content":"\n\u003Cp\u003EToday, in my continuing efforts to land Kerbals on Duna (Once I get my heavy cargo launcher going I\u0027ll be all set! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E) I worked some more on what I call the Duna Exploration Vehicle, a pressurized rover for exploring Duna, because duh. I took the overall design look from the Martian (because its not totally obvious) and took one particular element from a certain video about the Constellation program in KSC (Guess which bit).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ftqZQi6.jpg\u0022 alt=\u0022ftqZQi6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EPoor, poor Dunfree there in the cockpit gave his life for the program, when his attempt to scale the mountains of Kerbin failed due to improperly manufactured winches, sending his test rover plummeting into the valley. His last words were muffled, because he was apparently eating a donut.\u003C/p\u003E\n"},{"CreatedByName":"-M-TheDoctor","CreatedById":141408,"CreatedDateTime":"2015-10-10T05:11:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003EToday\u0027 date=\u0027 in my continuing efforts to land Kerbals on Duna (Once I get my heavy cargo launcher going I\u0027ll be all set! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E) I worked some more on what I call the Duna Exploration Vehicle, a pressurized rover for exploring Duna, because duh. I took the overall design look from the Martian (because its not totally obvious) and took one particular element from a certain video about the Constellation program in KSC (Guess which bit).\u003Cp\u003E[url\u0027]\u003Ca href=\u0022http://i.imgur.com/ftqZQi6.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ftqZQi6.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPoor, poor Dunfree there in the cockpit gave his life for the program, when his attempt to scale the mountains of Kerbin failed due to improperly manufactured winches, sending his test rover plummeting into the valley. His last words were muffled, because he was apparently eating a donut.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell.... now you know you can\u0027t take it up a mountain, and remember what G.I. Jose says:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimage.org/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s3.postimg.org/lcjbbr50j/oie_0_EWii35l_TYfb.jpg\u0022 alt=\u0022oie_0_EWii35l_TYfb.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-10-10T05:42:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETheDoctor;2237945\u0027]Well.... now you know you can\u0027t take it up a mountain\u0027 date=\u0027 and remember what G.I. Jose says:\u003Cp\u003E\u003Ca href=\u0022http://postimage.org/\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://s3.postimg.org/lcjbbr50j/oie_0_EWii35l_TYfb.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://s3.postimg.org/lcjbbr50j/oie_0_EWii35l_TYfb.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah but after I fired the winch manufacturer and had new ones delivered I now can scale most inclines \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E(IE, I modified KAS\u0027 winches so that they would actually be useful for scaling any particular incline. The cables were too short and didn\u0027t launch our far enough, but now they do)\u003C/p\u003E\n"},{"CreatedByName":"-M-TheDoctor","CreatedById":141408,"CreatedDateTime":"2015-10-10T06:01:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003EYeah but after I fired the winch manufacturer and had new ones delivered I now can scale most inclines \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003E(IE\u0027 date=\u0027 I modified KAS\u0027 winches so that they would actually be useful for scaling any particular incline. The cables were too short and didn\u0027t launch our far enough, but now they do)[/quote\u0027]\u003C/p\u003E\u003Cp\u003ESo what do you do? Do you have 2 winches on there and have an engineer place a mounting block and attach one winch, pull up the rover, then repeat the process with the other one? I feel like the breaks wouldn\u0027t hold if you have to winch your way up, so you would have to essentially belay up the slope, step by step. Sounds like fun, but I could see problems if you used a life support mod.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"EliasDanger","CreatedById":151803,"CreatedDateTime":"2015-10-10T08:04:01Z","Content":"\n\u003Cp\u003EUsed my new nuke powered kerbin system transport vessel to rescue a kerbal in orbit beyond the mun. Brought him back to my LKO space station. Then I was trying to figure away to get him back on the ground without sending a rocket up just for him. So I took a contract for a 4 person tour to the mun and minmus. Sent them up with 2 extra seats (wanted to have room to bring back the unneeded pilot on the space station too). Docked with the space station, transferred the tourists to my kerbin system transport and the rescued kerbal to the ship they came up in. Sent the tourists off, completed the tour, brought them back to the station, loaded them all back into the ship that got them there, with the rescued kerbal and the pilot, and brought the lot of them back to kerbin\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-10-10T08:39:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETheDoctor;2237980\u0027]So what do you do? Do you have 2 winches on there and have an engineer place a mounting block and attach one winch\u0027 date=\u0027 pull up the rover, then repeat the process with the other one? I feel like the breaks wouldn\u0027t hold if you have to winch your way up, so you would have to essentially belay up the slope, step by step. Sounds like fun, but I could see problems if you used a life support mod.[/quote\u0027]\u003Cp\u003ENope its even simpler. I just use the KAS Hook. Attach it to the winch and eject it. It\u0027ll latch into the ground 200m off (or however far it landed) and then you can hit retract to have the winch pull you towards the hook. If you ever played with Arkham Knight\u0027s Batmobile, its the same principle. \u003C/p\u003E\u003Cp\u003EAnd for another example of how it works, here\u0027s a KSP video which I shamelessly stole the idea from:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Tp6yj2k0Fpc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAt around the 20 minute mark you\u0027ll see how it works. Much like how he had to do it, I too had to go in and modify the .cfg\u0027s for the winches so that they could actually be useful for this sort of thing. (and honestly it should be an in-game option anyway, even if it means a heavier bigger winc)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2015-10-10T09:08:37Z","Content":"\n\u003Cp\u003EVisited Hale. Unfortunately the lander \u0022disappeared\u0022 after i switched to the pack of probes and scanners entering the Sarnus system to distribute them over the moons. Which is a lot of work so i rather sacrificed the lander than herding all those probes again. When i switched back to fly the lander over to Ovok it was gone. So, these are the last pictures from the mission, the crew is missing.\u003C/p\u003E\u003Cp\u003EAm not sure whether ksp\u0027s stability really supports running a 1.1-style relay system with many probes and stations over a longer time without having to replace the kraken fodder from time to time. Which really costs time (10 years) and probably temper in case of a planet like Sarnus.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/roLYf5M.png\u0022 alt=\u0022roLYf5M.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nicROsl.png\u0022 alt=\u0022nicROsl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/C9LSlYn.png\u0022 alt=\u0022C9LSlYn.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-10T09:36:18Z\u0022 title=\u002210/10/2015 09:36  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 10, 2015\u003C/time\u003E by kemde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-10-10T13:08:33Z","Content":"\n\u003Cp\u003EThe testing continues \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/TSGZn\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m more or less ready to get started on going to Duna. My first task is to send some Wayfarer orbiters to Duna, which will provide comms and mapping services for the future landings. After that, I\u0027m going to do an Apollo-like landing to test out the Duna Ascent Vehicle, utilizing an expendable deep space habitat in lieu of the future transport craft. This mission will be a relatively short stay (about 3 days on the surface) with the rest of the waiting for the return window spent in orbit around Duna and Ike. This is to serve as a transition point from the Apollo-style moon landings I\u0027ve been constantly repeating for 2000 hours to actual interplanetary missions. \u003C/p\u003E\u003Cp\u003EAfter that comes the first expedition, Inspiration. The mission itself will consist of 8 phases. \u003C/p\u003E\u003Cp\u003EThe first phase is to send ahead the Inspire Base modules and support modules. This will consist of the 4 main base modules, 2 D.E.V rovers, 1 Supply Module, and 2 Duna Ascent Vehicles. One of the DAV\u0027s, upon arrival to Duna will immediately set out to land at a pre-selected landing site and begin fueling its ascent stage using in-situ resources while the other remains in orbit as an emergency rescue option. The rest of the modules will also remain in Duna Orbit to await the crew. \u003C/p\u003E\u003Cp\u003EPhase 2 is construction of the IPC (Interplanetary Craft) in Kerbin Orbit. Beyond the simple launch and docking of the different sections, the craft will also require some additions by astronauts. This will mostly include some struts to ensure the full stability of the ship, as well as some science experiments, among some other additions I\u0027ve yet to decide upon. By keeping Kerbals with the ship as I construct it, it will also help ensure that it is constructed efficiently during any Comms downtime. \u003C/p\u003E\u003Cp\u003EPhase 3 has 3 parts. First is the final inspection of the IPC (at this point now referred to by its mission name, Inspiration) and a shakedown run with a flyby of Mun and Minmus. Using a skeleton crew this 12 day mission will ensure that Inspiration is at full operational status. After Inspiration is refueled, it will remain in orbit as the Duna Descent Vehicle is launched to rendezvous and dock with Inspiration. This pairing will remain in orbit until the Duna transfer window has opened. \u003C/p\u003E\u003Cp\u003EAnd finally, once the window opens, there will be two Orion launches to bring the first Inspiration crew to the ship, upon which they will depart for Duna.\u003C/p\u003E\u003Cp\u003EPhase 4 begins once Inspiration comes into Duna orbit. At this point, the base modules are deployed and sent in for landing. Before the crew will make a landing, the Hab/Logistics pairing at least must make a safe landing within a reasonable distance of one another and the DAV, as the other two modules are not mission critical. The close proximity of the 3 core modules is, however, as they will be running on relatively limited power. Presuming all goes well and the base components are ready to be set up, the Inspiration crew will transfer into their DDV and come down for a landing. The first task after stepping onto the surface is to get into the DAV and verify it is functioning. \u003C/p\u003E\u003Cp\u003EPresuming a safe landing and functional DAV, phase 5 begins. This is the initial construction of the base to be carried out over one Duna day. Once the base modules are connected and up and running, the DEV rovers and the supply module will deploy and come in for a landing. These modules, much like the base modules, are capable of automated travel and as such do not need to be precisely landed. Once these final components are linked up with the crew, the base is to be considered at Initial Operational Capacity, and as such is now designated Inspire Base. \u003C/p\u003E\u003Cp\u003EPhase 6 is the actual mission itself. During this 30 day period the area around Inspire Base will be explored, and science will be had. Using components landed in the Supply module, additional infrastructure will be placed at strategic points ranging from a large solar field to an extensive ground Comm\u0027s network. The main goal for the first Inspiration expedition is to test in-situ resource generation in order to test the feasibility of a permanently manned base. During this period, the DAV will also be entered periodically and verified to be working correctly. \u003C/p\u003E\u003Cp\u003EPhase 7 begins 3 days before the crew is to ascend from the surface. At this point, base operations are wrapped up and the base is set to bunker down until its next crew arrives. At this point, the crew enters the DAV and launches to rendezvous and dock with Inspiration, whereupon they begin on-orbit operations in the Duna-Ike sytem until the transfer window back to Kerbin opens up. At this point, the Emergency DAV lands at another pre-selected landing site to await the arrival of its mission components and crew, at this point slated to be named \u003Cem\u003EResolution\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EPhase 8 is quite simple. Bring. Them. Home. Inspiration departs the Duna system for Kerbin, and once back in LKO, the crew splits up into their respective Orion\u0027s to go back home. Meanwhile, Inspiration boosts itself into a higher orbit to await its next crew, slated to arrive sometime after Inspirations sister mission Resolution has begun its own Phase 6. \u003C/p\u003E\u003Cp\u003ENow, obviously a lot of how I set up this mission comes from Mars Direct and a couple of other sources. Because of course it does! Who isn\u0027t copying the Martian right now anyway? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat being said, I am still very excited about this, as the Apollo-style mission is going to be my first full on legitimate landing on Duna with a manned spacecraft. The bases I\u0027m going to construct afterwords are more or less what I want to do just because. At this point I only have two bases planned, and then at some point I\u0027m going to figure out how and where I\u0027m going to do the perma-manned base. At this point though I\u0027m just torn on the name. Right now I\u0027m torn between calling it Endurance or Atlantis. I\u0027m totally open to suggestions!\u003C/p\u003E\u003Cp\u003EBut anyway, thats what I did today was completely layout my plans for Duna as well as finish up testing everything. Right now I could actually start these missions (as my launchers and everything are all ready to go) but right now I am just all kinds of tired and want to sleep. So it\u0027ll have to wait until later on today \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"-M-TheDoctor","CreatedById":141408,"CreatedDateTime":"2015-10-10T14:00:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003ENope its even simpler. I just use the KAS Hook. Attach it to the winch and eject it. It\u0027ll latch into the ground 200m off (or however far it landed) and then you can hit retract to have the winch pull you towards the hook. If you ever played with Arkham Knight\u0027s Batmobile\u0027 date=\u0027 its the same principle. \u003Cp\u003EAnd for another example of how it works, here\u0027s a KSP video which I shamelessly stole the idea from:\u003C/p\u003E\u003Cp\u003E[url\u0027]\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Tp6yj2k0Fpc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAt around the 20 minute mark you\u0027ll see how it works. Much like how he had to do it, I too had to go in and modify the .cfg\u0027s for the winches so that they could actually be useful for this sort of thing. (and honestly it should be an in-game option anyway, even if it means a heavier bigger winc)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t even think the winch would do that lol. Then again, I mostly use the winches as an umbilical for EVAs so my Kerbanauts don\u0027t stray too far.\u003C/p\u003E\n"},{"CreatedByName":"Jett_Quasar","CreatedById":117851,"CreatedDateTime":"2015-10-10T15:28:03Z","Content":"\n\u003Cp\u003EI can\u0027t seem to stop making big beautiful infinite range SSTO starships... it\u0027s like I\u0027m addicted or something. This one is a remake of a Jool-5 ship I originally did back in 0.90 that I named the Argo. There will need to be a few more tweaks before I can land this puppy on Tylo though - and 29 engines is getting a bit out of hand.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/po739V7.png\u0022 alt=\u0022po739V7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mr2LpXh.png\u0022 alt=\u0022mr2LpXh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJR\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-10T15:49:56Z\u0022 title=\u002210/10/2015 03:49  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 10, 2015\u003C/time\u003E by Jolly_Roger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Itsdavyjones","CreatedById":57605,"CreatedDateTime":"2015-10-10T15:47:30Z","Content":"\n\u003Cp\u003EOn the bus home yesterday, I rendezvoused with an A class asteroid, only waited half a Kerbin year for one to spawn. Currently waiting for he craft with the roid to get to the right orbital positions to fire the ion engines to change its inclination again and again to get as close to 0 as possible, and I am finding that I NEED to remove some mods just so I can have more than one scene change before crashing.\u003C/p\u003E\u003Cp\u003EAlso, on the same bus, I ran into a fellow KSP player, first time running into a player that wasn\u0027t my friends that I got into it.\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-10-10T16:08:21Z","Content":"\n\u003Cp\u003ELots of logistics missions in preparation for windows to Jool, Duna, and Eeloo all coming up at the same time. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lCuSVXr.jpg?1\u0022 alt=\u0022lCuSVXr.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Mega Aqualung (tweakscaled 5-meter tanker ship) landed at the Coalwood mining rig on Minmus. Although the landing was successful, barely, it is proving too ungainly to be practical; for now it\u0027s parked in Minmus orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XIpb62Z.jpg?1\u0022 alt=\u0022XIpb62Z.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003ETwo new Super Aqualungs went up from KSC; I\u0027ve finally got a lifter configuration that doesn\u0027t explode when the boosters separate. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/671EncN.jpg?1\u0022 alt=\u0022671EncN.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EDecided to start color-coding them to make them easier to keep track of. Here Super Aqualung \u003Cem\u003ERed\u003C/em\u003E departs for Minmus after refueling \u003Cem\u003ESilver\u003C/em\u003E for a transfer to Duna with a space station core module. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o5tkwNA.jpg?1\u0022 alt=\u0022o5tkwNA.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinally, \u003Cem\u003EDres Orbiter 1 \u003C/em\u003Eburned into orbit, checking off the last unvisited body in the solar system. So I\u0027ve accomplished my original goal for this career of visiting every planet and moon (plus asteroids) with at least a flyby probe. Now to set about landing Kerbals everywhere.\u003C/p\u003E\n"},{"CreatedByName":"nsgallup","CreatedById":136892,"CreatedDateTime":"2015-10-10T17:07:23Z","Content":"\n\u003Cp\u003EI decided to take a contract to rescue some rube that got stuck in Eve Orbit.\u003C/p\u003E\u003Cp\u003ELaunching to orbit, the craft is a command pod with a guidance module, it is unmanned until picking up it\u0027s passenger.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132198689/2802CA8DC0DFA4C18EDC43EB7BE0291480B019B0/\u0022 alt=\u00222802CA8DC0DFA4C18EDC43EB7BE0291480B019B0\u0022\u003E\u003C/p\u003E\u003Cp\u003ECirculation Burn\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132198934/33F85DC35CE83F6B2C5FA2B0C92504CE7B9F1717/\u0022 alt=\u002233F85DC35CE83F6B2C5FA2B0C92504CE7B9F1717\u0022\u003E\u003C/p\u003E\u003Cp\u003EOff to Eve!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132199110/63848C365326550A8F376BA9DFB956BE6C8449C6/\u0022 alt=\u002263848C365326550A8F376BA9DFB956BE6C8449C6\u0022\u003E\u003C/p\u003E\u003Cp\u003EApproaching\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132199388/94FAF69F1FA0258F405112C4C54A878C8C969B4A/\u0022 alt=\u002294FAF69F1FA0258F405112C4C54A878C8C969B4A\u0022\u003E\u003C/p\u003E\u003Cp\u003ECapturing and adjusting inclination to match target orbit\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132199559/0D93B1A94118B86EF2D447730DFDDD8BA706FCCA/\u0022 alt=\u00220D93B1A94118B86EF2D447730DFDDD8BA706FCCA\u0022\u003E\u003C/p\u003E\u003Cp\u003EKel Kerman exits her capsule and prepares to match the rescue ship on approach, 300m and closing. We are a little close on fuel so every bit saved counts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132199719/032AA96CFD185BBFBF6B34BEB00F7D94C4A76B85/\u0022 alt=\u0022032AA96CFD185BBFBF6B34BEB00F7D94C4A76B85\u0022\u003E\u003C/p\u003E\u003Cp\u003ESLOW DOWN!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132199880/FFE0A0A2760DB685FCC2C9B2B2C6920B3C9F109D/\u0022 alt=\u0022FFE0A0A2760DB685FCC2C9B2B2C6920B3C9F109D\u0022\u003E\u003C/p\u003E\u003Cp\u003ERescued! I think.. Kel grabs science and moves it to the command pod.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132200149/B4D4BAE0128BC1A29C21353B2FF7C13147F62EF7/\u0022 alt=\u0022B4D4BAE0128BC1A29C21353B2FF7C13147F62EF7\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinal stage separation, approach orbit is good.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132200316/1D2B0BA7AB797DE3219F606413971E5074343D43/\u0022 alt=\u00221D2B0BA7AB797DE3219F606413971E5074343D43\u0022\u003E\u003C/p\u003E\u003Cp\u003EEntering the atmosphere\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132200694/2DAD159868DB9F662BBD1ECED64804D203058E0C/\u0022 alt=\u00222DAD159868DB9F662BBD1ECED64804D203058E0C\u0022\u003E\u003C/p\u003E\u003Cp\u003EHome sweet home!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/393295171132201110/4BF12E96071B84AB72991645379630ED9AD2AB9D/\u0022 alt=\u00224BF12E96071B84AB72991645379630ED9AD2AB9D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bekiekutmoar","CreatedById":23500,"CreatedDateTime":"2015-10-10T17:47:47Z","Content":"\n\u003Cp\u003ECompleted a rather uneventfull return mission to Dres. Though life support (TAC Life Support) ran rather low; the mission began with around 1350 days of oxygen, water and food available to two Kerbals, but only 5 days was left when entering the SOI of Kerbin again. Gotta say I had to \u0027force\u0027 my return trajectory a lot to get back in time. Otherwise, the Kerbals would suffocate, die due to dehydration and starve to death. That means three deaths per Kerbal, so with two Kerbals onboard I avoided 6 deaths ... !\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-10-10T18:31:57Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/136387-Yet-Another-Duna-Colony?p=2238529#post2238529\u0022 rel=\u0022external nofollow\u0022\u003EStarted a thread for all my Duna Colony stuff\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EYup.\u003C/p\u003E\n"},{"CreatedByName":"-M-TheDoctor","CreatedById":141408,"CreatedDateTime":"2015-10-10T18:54:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bekiekutmoar\u0022 data-cite=\u0022Bekiekutmoar\u0022\u003E\u003Cdiv\u003ECompleted a rather uneventfull return mission to Dres. Though life support (TAC Life Support) ran rather low; the mission began with around 1350 days of oxygen, water and food available to two Kerbals, but only 5 days was left when entering the SOI of Kerbin again. Gotta say I had to \u0027force\u0027 my return trajectory a lot to get back in time. Otherwise, the Kerbals would suffocate, die due to dehydration and starve to death. That means three deaths per Kerbal, so with two Kerbals onboard I avoided 6 deaths ... !\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m so afraid to leave Kerbin\u0027s SOI because of that right there. I sent an Apollo style mission to the Mun with 60 days worth of life support. The mission\u0027s total time was, like 3 or 4 days. I feel like if I sent Kerbals to Jool or even further (OPM system) I would have a massive life support module on my ship: \u003C/p\u003E\u003Cp\u003EDesign Engineer: \u0022There\u0027s enough life support on this ship to keep 40 Kerbals alive for 20 years, we\u0027re only sending 4 of them out to Duna for 6 months.\u0022\u003C/p\u003E\u003Cp\u003EProject Lead: \u0022IT\u0027S NOT ENOUGH!! WE NEED MORE!!\u0022\u003C/p\u003E\u003Cp\u003EPropulsion Engineer: \u0022If we add any more life support to this thing we won\u0027t have enough space to add more boo-\u0022\u003C/p\u003E\u003Cp\u003EJeb: \u0022ADD MORE BOOSTERS!!!!!\u0022\u003C/p\u003E\u003Cp\u003EProp. Eng: \u0022That won\u0027t do-\u0022\u003C/p\u003E\u003Cp\u003EJeb: \u0022MORE BOOSTERS!!!!!!!!!!!\u0022\u003C/p\u003E\u003Cp\u003E***End scene, fade to launch pad, 3,2,1 ignition annnnnddd....... big explosion***\u003C/p\u003E\n"},{"CreatedByName":"Treldon","CreatedById":128860,"CreatedDateTime":"2015-10-10T19:58:32Z","Content":"\n\u003Cp\u003EAfter a long time away from the game (10 months or so) I began playing KSP again today.\u003C/p\u003E\u003Cp\u003EThe result: the Albatros-B\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/yUOo5\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022http://imgur.com/a/yUOo5\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/blockquote\u003E\u003Ca href=\u0022http://imgur.com/a/yUOo5\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Cp\u003EWhen it\u0027s not carrying its 40t baby it\u0027s quite maneuverable and fun to fly. And in case of problems the cockpit can separate from the craft and land safely\u003C/p\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-10-10T20:22:15Z","Content":"\n\u003Cp\u003EI am launching my first probe to Mars\u003C/p\u003E\n"},{"CreatedByName":"hendrack","CreatedById":142754,"CreatedDateTime":"2015-10-10T21:27:55Z","Content":"\n\u003Cp\u003EOne month break from KSP. \u003C/p\u003E\u003Cp\u003EPut a 4-dish long range satellite into kolniya orbit for further missions. \u003C/p\u003E\u003Cp\u003EFulfilled a contract to map 18 asteroids dangerous to Kerbin with SENTINEL. Quite big for simple satellite, large fuel resources to rellocate and act as satellite relay once mission accomplished. \u003C/p\u003E\u003Cp\u003EAlso tried infernal robotics and fooled around with it, quite nice for further design considerations.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/zBe8q\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2015-10-10T23:22:11Z","Content":"\n\u003Cp\u003EMade a video of my mission to the moon using SLS. First actuall mission I was able to do with the SLS besides the Europa lander.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/d2200YGSeKM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-11T00:02:22Z\u0022 title=\u002210/11/2015 12:02  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 11, 2015\u003C/time\u003E by maccollo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-10-11T00:18:04Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/RY09h\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-10-11T01:05:14Z","Content":"\n\u003Cp\u003EBroke the game for the first time. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/0VzKT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-11T01:19:58Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ENooooooooooooo...\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/zAXrx1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm6.staticflickr.com/5806/22055351266_def95c55b4_h.jpg\u0022 alt=\u002222055351266_def95c55b4_h.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI have \u003Cstrong\u003Eten\u003C/strong\u003E probe landers like this.\u003C/p\u003E\n"}]}