{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":214,"Articles":[{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2014-02-19T07:24:44Z","Content":"\n\u003Cp\u003EI did a lot today...I designed and launched three probe landers to Dres, Jool, and Eve. Arrived at eve and did an aero capture. Dropped my two atmosphere analysis divers.Then visited gilly and dropped off my gilly lander, later deciding to also land my eve lander there. Then I took off and attempted Landing on eve. Finding out after 6 failed attempts, that ~50 m/s was too fast for my lander to handle the chute fully deploying. So now just the probe core is resting on eve\u0027s surface next to an impressively stacked pile of debris. Dres landed is a day away from encounter, will work on that tomorrow, along with my jool probe which is 100 days away.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-19T07:27:25Z\u0022 title=\u002202/19/2014 07:27  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 19, 2014\u003C/time\u003E by Endersmens\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-19T08:01:01Z","Content":"\n\u003Cp\u003EArrived at Duna: Com-Scan-Sat already mapping away and sending Data back to KSC; surface probe\u0027s parachutes opened very late, very tumbley landing due to remaining horizontal speed and landing on its side now - lost one solar array, but the remaining one sits on top, sufficient to send back data of the two Goo experiments. Data shows no immediate hazards, manned landing is a go.\u003C/p\u003E\u003Cp\u003EDune Expedition Ship entered the planets SOI and plotted a node to slowed down so Ike may pass without disturbing orbital insertion. Going for a powered insertion only at 60x60km. Minor problems with the nukes, they can no longer fire at 100% without overheating, KSC engineers are thinking - hard.\u003C/p\u003E\u003Cp\u003EBefore executing its last course correction DES released to small probes, exploiting the chance encounter to take readings high and low above Ike. They will then most likely leave Duna\u0027s SOI and continue sending back whatever data they can find.\u003C/p\u003E\u003Cp\u003EBill had the lab crew do some experiments and take some readings. He himself went on EVA to retrieve the final results and stored them for further analysis after the return to Kerbin.\u003C/p\u003E\u003Cp\u003EDES will enter orbit in a few hours. KSC is calculating if the crew should go for aerobraking after all - fuel calculations might have been a bit to tight, yet the docked and not so small lander poses a volatile factor during such risky maneuvers.\u003C/p\u003E\u003Cp\u003EJeb filed todays crew report: he is happy - as usual.\u003C/p\u003E\u003Cp\u003ESupplemental: Intern at KSC showed up late, no one felt responsible to jump in, no readings from atmospheric instruments during decent of surface probe - CEO most unhappy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-19T08:07:27Z\u0022 title=\u002202/19/2014 08:07  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 19, 2014\u003C/time\u003E by KerbMav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-02-19T09:20:40Z","Content":"\n\u003Cp\u003EExperimented. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/N2pLdz2.png\u0022 alt=\u0022N2pLdz2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDid I go to space today? Experiment report to come!\u003C/p\u003E\n"},{"CreatedByName":"TerLoki","CreatedById":30301,"CreatedDateTime":"2014-02-19T10:36:17Z","Content":"\n\u003Cp\u003EGot through nearly all of my first manned interplanetary mission, a Duna fly-by. I say \u0022nearly all\u0022 because I still have to return the crew and deorbit the ship, but it\u0027s currently parked in a nice LKO waiting for a crew transfer vehicle. I\u0027m calling this a success right now though, docking and deorbiting will be a cakewalk. I was going to reuse the ship for an Eve fly-by at some point, but every module of it needs tweaking of some kind.\u003C/p\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2014-02-19T11:51:52Z","Content":"\n\u003Cp\u003E^ I\u0027m almost in the exact same place in my Duna Mission, returning the ship back to an LKO station, where a crew return shuttle will pick up my astronaut. Funnily enough, I think my next mission will be an Eve flyby too!\u003C/p\u003E\u003Cp\u003EIn real life, KSP has inspired me to get my lego back out of the attic, and I\u0027ll be making rovers and shuttles before long \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-19T11:56:06Z","Content":"\n\u003Cp\u003EI finally started my Laythe colonization program by sending a scout ship there. It was also my first manned mission beyond Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/laythe_launch.jpg\u0022 alt=\u0022laythe_launch.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIVA view was quite useful during the long transfer burn.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/laythe_navball.jpg\u0022 alt=\u0022laythe_navball.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinally approaching Jool. I spent a while tweaking the maneuver nodes to get directly to Laythe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/laythe_approach.jpg\u0022 alt=\u0022laythe_approach.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA succesful landing about 300 meters from the sea.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/laythe_landing.jpg\u0022 alt=\u0022laythe_landing.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter the disappointing mission to Duna, Merman Kerman finally found what he was looking for.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/stuff/laythe_merman.jpg\u0022 alt=\u0022laythe_merman.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sido","CreatedById":78339,"CreatedDateTime":"2014-02-19T14:44:30Z","Content":"\n\u003Cp\u003EI made a Rover mission to Hecate :\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/XT9GR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2014-02-19T15:14:28Z","Content":"\n\u003Cp\u003EFinally put a craft on Eve that has the potential to return to orbit, and hopefully home to Kerbin. My other Eve ventures were all One-Way-Trips (OWTs). This is the first time I\u0027ve planned a trip to actually come home. And I\u0027m not doing it the traditional way, either. I first landed a Kethane refinery on Eve. Landed my return ship using all the fuel inside close to the refinery. Drove it over to the refinery. Refuelled my ship, and I\u0027ll be hitting launch to return home soon. Probably tonight.\u003C/p\u003E\u003Cp\u003EThis was a massive venture that took multiple ships over multiple days. First the satellite to scan for Kethane. Then rovers to pick out a suitable landing site. Then the refinery itself. And lastly, the actual space ship rocket thing. I\u0027m using two mods, Kethane and Kerbal Attachment System (KAS) as fuel lines.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/PL4Zf\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-02-19T16:01:51Z","Content":"\n\u003Cp\u003EPlayed around with my tow cart some more for the Auk VIII; tried KAS pipe attachments instead of the winch cable and that seemed to work really well. Was able to refuel the Auk and tow it from the SPH taxiway about halfway back to the start of the runway. Got to going too fast - \u0027splosions were involved.\u003C/p\u003E\u003Cp\u003EWent ahead and flew a different Auk to orbit for good measure. Tonight I\u0027ll do an operational run of the tow cart refueling system after dumping the Auk\u0027s supplies off on a Thunderbolt in orbit.\u003C/p\u003E\n"},{"CreatedByName":"karolk","CreatedById":26764,"CreatedDateTime":"2014-02-19T18:08:53Z","Content":"\n\u003Cp\u003EFinally got to jool. Tried it only 2 times before so i thought i\u0027d give it a shot again. After aerobraking in jool i forgot the solars on the first probe and it ran out of power... Before i quicksaved without noticing it. The second one didn\u0027t have that design flaw.\u003C/p\u003E\u003Cp\u003EFerram Aerospace Research and Deadly Reentry installed!\u003C/p\u003E\u003Cp\u003EGravity assist from Vall\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0scR1Tq.png\u0022 alt=\u00220scR1Tq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAerobraking in Jool\u0027s atmosphere\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/43a6deJ.png\u0022 alt=\u002243a6deJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinal orbit around Laythe, I had to pull an aerobrake into orbit going at 6000\u002B m/s. Deadly Reentry did not make it easy! I lost my orbital stage which can be seen on the other pictures. That heatshield i put in between it and the probe just in case paid off.\u003C/p\u003E\u003Cp\u003E*SNAP, FORGOT TO ATTACH THE IMAGE*\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HHbYj3g.png\u0022 alt=\u0022HHbYj3g.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-20T18:06:54Z\u0022 title=\u002202/20/2014 06:06  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 20, 2014\u003C/time\u003E by karolk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Commissar","CreatedById":97416,"CreatedDateTime":"2014-02-19T19:30:23Z","Content":"\n\u003Cp\u003Emoved the existing component of my duna base up the hill to the plateau where my base will be located. power station was already moved there. now I need to get my utility rover to duna, so I can hook up the parts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GofxzGf.jpg\u0022 alt=\u0022GofxzGf.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Impatience","CreatedById":103914,"CreatedDateTime":"2014-02-19T19:42:24Z","Content":"\n\u003Cp\u003EI would like to ask for a moment of silence for Jeb. During a risky high speed, high altitude EVA maneuver to gather critical science data, Jeb found himself detached from the Command Module. Unfortunately, Jeb found himself plummeting helpless to the planets surface below.\u003C/p\u003E\u003Cp\u003EOur space program is in it\u0027s infancy, and unfortunately Jeb is our first casualty of progress. We will remember you always. Thank you for your service and dedication to the cause.\u003C/p\u003E\u003Cp\u003ER.I.P.\u003C/p\u003E\u003Cp\u003E--Impatience\u003C/p\u003E\n"},{"CreatedByName":"Biker Joe","CreatedById":82495,"CreatedDateTime":"2014-02-19T20:19:50Z","Content":"\n\u003Cp\u003EI started building the ship I\u0027m gonna make to send to Duna, problem is I keep changing my mind so the design keep changing!\u003C/p\u003E\n"},{"CreatedByName":"Redrobin","CreatedById":93744,"CreatedDateTime":"2014-02-20T01:05:26Z","Content":"\n\u003Cp\u003EGot wrekt:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oTD5CVT.png\u0022 alt=\u0022oTD5CVT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/llNlXxz.png\u0022 alt=\u0022llNlXxz.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-02-20T01:31:00Z","Content":"\n\u003Cp\u003EFirst Tylo landing: Take 2:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OcNnWLt.png\u0022 alt=\u0022OcNnWLt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHard landing when I ran out of fuel for my auxiliary power \u0022emergency rockets\u0022 destroyed my landing gear and LV-N\u0027s. Probably wouldn\u0027t have had enough dV to make orbit again anyways, even with the nukes. For \u0022Take 3\u0022 tomorrow I\u0027ll dump more fuel in the nearly empty transfer stage I use for the initial deorbit burn. Should give me enough to make orbit after. At least he left the Jool system science in the lab this time.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-20T06:34:18Z","Content":"\n\u003Cp\u003EMy colonization efforts at Laythe continue. I had some luck, as a probe found kethane deposits surrounding a crater lake at an equatorial island, making it a promising place for the colony. Next I\u0027m going to send a lander to investigate the area. As I didn\u0027t expect to find such useful deposits on Laythe itself, I also have to figure out the best way to exploit them.\u003C/p\u003E\u003Cp\u003EOf course, Pol or Bop will be better for major refueling operations. I\u0027ll have to send another probe to investigate.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-02-20T07:59:06Z","Content":"\n\u003Cp\u003EDid my first unshielded aerocapture under FAR/DREC/RSS. Took three tries to find a good altitude.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yzUoUvF.jpg\u0022 alt=\u0022yzUoUvF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MZiB4RS.jpg\u0022 alt=\u0022MZiB4RS.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AlteranEmpire","CreatedById":34035,"CreatedDateTime":"2014-02-20T08:06:31Z","Content":"\n\u003Cp\u003EMy 3 kerbal Duna mission finished its stay at Duna after one kerbal landed with a rover. After a long burn home I discovered I didn\u0027t bring enough fuel, so I had to ditch my small 3-man transport and what was left of the lander to drop the mass. Tomorrow I see if I remembered enough life support and then aerobraking, putting her in a stable orbit to wait for transport back to the space center.\u003C/p\u003E\n"},{"CreatedByName":"NoPanShabuShabu","CreatedById":91327,"CreatedDateTime":"2014-02-20T08:17:09Z","Content":"\n\u003Cp\u003EThe other day I started a new \u0022hard mode\u0022 career. Went for a first Mun landing today, and just *had* to try for that second biome. Like an idiot I said \u0022Eh, we can at least make orbit.\u0022 Wrong. Actually, more wrong that I thought. Jeb pushed the pod to orbit since he didn\u0027t think 1/2 a day was enough time to get a rescue together and he didn\u0027t want to be the first blue skeleton orbiting the Mun in a suit. Could push for Kerbin, but luckily we had the foresight to give him 20 days of supplies and (as a last minute thought) a solar panel on the pod. He\u0027ll hold a new record after Bill or Bob come and get him.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/tFLXk0u\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/tFLXk0u.png\u0022 alt=\u0022tFLXk0u.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sido","CreatedById":78339,"CreatedDateTime":"2014-02-20T09:23:50Z","Content":"\n\u003Cp\u003EI made an Apollo Style Moon Mission :\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cRwz9uH.png\u0022 alt=\u0022cRwz9uH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the album :\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/c1vUN\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"NoPanShabuShabu","CreatedById":91327,"CreatedDateTime":"2014-02-20T09:36:35Z","Content":"\n\u003Cp\u003EBill and Bob are going to get some serious ribbing from Jeb about running into transfer stage in Mun orbit. Having knocked off the parachute, 1 RCS tank, 1 solar panel, and 1 lifesupport module, they will need pickup from Kerbin orbit. Also, lots of paperwork, and appearances before the investigative committee.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/40xNPVK\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/40xNPVK.png\u0022 alt=\u002240xNPVK.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-02-20T11:00:59Z","Content":"\n\u003Cp\u003EI discovered the future.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/E1VFESM.png\u0022 alt=\u0022E1VFESM.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-20T12:59:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Felsmak\u0022 data-cite=\u0022Felsmak\u0022\u003E\u003Cdiv\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDont say that this is some form of new propulsion?\u003C/p\u003E\u003Cp\u003ENothing to report today on my side, winter was coming.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-02-20T13:05:32Z","Content":"\n\u003Cp\u003EAuk-delivered Thunderbolt refuel and landing again. First operational test of the crash cart - tow and refuel went well right up until I unhooked the pipe; the rear engine was clipped into the front of the crash cart, so it promptly fell off. Alas. I still think the design can make it into orbit on six engines; I\u0027ll make the attempt at re-launch this evening (knock on wood).\u003C/p\u003E\n"},{"CreatedByName":"Biker Joe","CreatedById":82495,"CreatedDateTime":"2014-02-20T13:08:13Z","Content":"\n\u003Cp\u003ENothing yet, but I have a few missions in the planning stages, I\u0027ve hardly any kerbals not on missions, looked in the astronaut complex and there\u0027s a few assigned to Mun Base Alpha which I\u0027m planning on decommissioning so I\u0027m putting together a craft to go to the mun, deploy a lander, and pick them up to bring them back to Kerbin for a while before they go off to Duna!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-20T14:08:27Z\u0022 title=\u002202/20/2014 02:08  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 20, 2014\u003C/time\u003E by Biker Joe\u003C/strong\u003E\n\u003C/span\u003E\n"}]}