{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":774,"Articles":[{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-10-15T18:06:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EI\u0027ve had drive failures in Windows 7 installs. I don\u0027t believe it\u0027s anything to do with Windows as such, just that a new install involves a lot of writes which could push a drive at the end of its life \u0022over the edge\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOddly enough, this was a new HDD, ordered to replace the last one that, also oddly, died within 24 hours of installing Win 10. The new HDD lasted, I think 3 weeks or so before kicking the bucket. Obviously correlation does not equal causation, but... c\u0027mon, really? I hadn\u0027t even come close to filling the drive yet.\u003C/p\u003E\u003Cp\u003EIs it possible that it got to a bad spot on the HDD and just got screwed up? Is it also possible that any potential flaws with the HDD would slip by unnoticed til this point?\u003C/p\u003E\u003Cp\u003ESo... coincidence? I really really hope so, because I\u0027m otherwise planning to buy an old copy of Win 7.\u003C/p\u003E\u003Cp\u003EEdit: Also, taking this to Computer Megathread.\u003C/p\u003E\n"},{"CreatedByName":"Vermil","CreatedById":122726,"CreatedDateTime":"2015-10-15T21:38:58Z","Content":"\n\u003Cp\u003EToday I\u0027ve been confused.\u003C/p\u003E\u003Cp\u003EI\u0027ve put myself under a lot of pressure for a long time, to do and succed with a manned Laythe expedition. I hated to work on the Kronos rocket. It was frustrating and slow. Always another problem. It seemed I would never get ready.\u003C/p\u003E\u003Cp\u003EAnd I was scared for the journey. I do my damnest to keep my astronauts alive.\u003C/p\u003E\u003Cp\u003E But I forced myself. The idea was that then, once it was done, I would start enjoying KSP agin. I would do all the other things I thought I should. Learn to dock. Develop more modern rockets with the Mk3 spaceplane cockpit. Build and deploy rovers.\u003C/p\u003E\u003Cp\u003ESo now it was done, and right enough, all pressure was gone. A relief. I\u0027m relaxed. The knot in the stomach is gone...\u003C/p\u003E\u003Cp\u003E...There is only one problem...\u003C/p\u003E\u003Cp\u003EThe forum posting is screwed up today. So f... this!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EToday I\u0027ve been confused.\u003C/p\u003E\u003Cp\u003EI\u0027ve put myself under a lot of pressure for a long time, to do and succed with a manned Laythe expedition. I hated to work on the Kronos rocket. It was frustrating and slow. Always another problem. It seemed I would never get ready.\u003C/p\u003E\u003Cp\u003EAnd I was scared for the journey. I do my damnest to keep my astronauts alive.\u003C/p\u003E\u003Cp\u003E But I forced myself. The idea was that then, once it was done, I would start enjoying KSP agin. I would do all the other things I thought I should. Learn to dock. Develop more modern rockets with the Mk3 spaceplane cockpit. Build and deploy rovers.\u003C/p\u003E\u003Cp\u003ESo now it was done, and right enough, all pressure was gone. A relief. I\u0027m relaxed. The knot in the stomach is gone...\u003C/p\u003E\u003Cp\u003E...There is only one problem...\u003C/p\u003E\u003Cp\u003EThe forum posting is screwed up today. So f... this!\u003C/p\u003E\n"},{"CreatedByName":"xub313","CreatedById":57408,"CreatedDateTime":"2015-10-15T21:55:37Z","Content":"\n\u003Cp\u003EI completed an unmanned Ike sample return today.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/VUbFI\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only thing that I did wrong was not getting a temperature scan near Duna.\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2015-10-15T22:54:01Z","Content":"\n\u003Cp\u003EAfter fixing some structural issue (apparently, gear placed on these wings summons Kraken and disassembles the ship on touchdown) I finally managed to land my SSTO back on Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s017.radikal.ru/i407/1510/2f/994d3f7f7810.png\u0022 alt=\u0022994d3f7f7810.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s017.radikal.ru/i413/1510/e9/9ca5e60b802f.png\u0022 alt=\u00229ca5e60b802f.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s020.radikal.ru/i718/1510/82/e304647513aa.png\u0022 alt=\u0022e304647513aa.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, it took off, got into the orbit, flew around the planet and landed back on the runway. \u003C/p\u003E\u003Cp\u003EStrangely, this is the only SSTO plane I made to work in 1.0 so far. Experiments with smaller crafts were... less successful.\u003C/p\u003E\n"},{"CreatedByName":"Melonfish","CreatedById":90990,"CreatedDateTime":"2015-10-15T23:07:20Z","Content":"\n\u003Cp\u003ESave Kraken ate my homework, so new save and I cheated to get all my science back to where it was because it ain\u0027t fair to steal it all off me.\u003C/p\u003E\u003Cp\u003Eran a training mission first to get the guys up to speed:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/O7s6xar.png\u0022 alt=\u0022O7s6xar.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethen started my Ares like mission, this is the remote DAV (Duna Ascent Vehicle) having made it to Duna. this will be landed shortly and when the time is right produce fuel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FlSNclx.png\u0022 alt=\u0022FlSNclx.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI placed a science pod on the top of the DAV, the plan is to link it up with the tug vehicle and ferry it back home along with the kerbals and their samples (assuming everything goes to plan with the mission)\u003C/p\u003E\n"},{"CreatedByName":"Gods315Pawn","CreatedById":97772,"CreatedDateTime":"2015-10-15T23:11:23Z","Content":"\n\u003Cp\u003ESo, I just stranded the lovely and brave Isaalla Kerman on the Mun. She was the first to step foot on the Mun (in this career). However, upon the return things went... badly.\u003C/p\u003E\u003Cp\u003ENow, when I say I stranded her on the Mun, I don\u0027t mean her craft doesn\u0027t have enough fuel to return home. I mean she doesn\u0027t have a craft to return home IN.\u003C/p\u003E\u003Cp\u003EThis is a picture of her with what remains of her lander and return craft.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/395547605765600256/D36AF41B529144661B0CB5A2105E1D9C8EC3FC85/\u0022 alt=\u0022D36AF41B529144661B0CB5A2105E1D9C8EC3FC85\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see from her expression she is either completely indifferent or barely managing to keep from freaking the heck out. I really can\u0027t tell which.\u003C/p\u003E\u003Cp\u003EAnyway, what happened was this. While descending for the landing I made a slight whoopsie that left one of the four engines with slightly less fuel than the others. The \u0022slightly\u0022 is literal. Maybe a full \u0022unit\u0022 of fuel.\u003C/p\u003E\u003Cp\u003EWasn\u0027t a problem, the excellent piloting of Isaalla was able to cope and I landed safely. She did Science, got out, retrieved Science, planted flag and prepared to go home. While ascending I realized I would not have enough fuel to return home. I decided to land in case it wasn\u0027t enough fuel to orbit safely. This turned out to be a good idea as it, in fact, wasn\u0027t enough fuel. The engineers and mathematicians (this agency employs no actual mathematicians, instead opting for the Trial and Error methodology) are still being berated for this failure of a design.\u003C/p\u003E\u003Cp\u003EWhile descending, Isaalla realized that she would run out of fuel before she returned to the Munar surface and would need to bail out and RCS her way down safely the rest of the way. She prepared to do so as her fuel gauge dropped, but as her craft burned the last of the fuel it was suddenly sent into a rapid flip, end over end. One engine had run out of fuel first since some had been accidentally used before. Still falling towards the Mun, Isaalla kept her head, righted the craft, and climbed out. Daringly she grabbed the Science from the capsule before leaping clear and propelling herself away from the Munar surface as much as she could as she rapidly descended. Her ship exploded below her as she descended. She hit the ground hard and bounced back, high over the surface. Regaining her bearings, she took her RCS controls back and safely guided herself back down as secondary explosions went off from her doomed lander. She touched down safely and chased after the only remaining piece she could see, still bouncing away. It ended up 400m away in the end. She used a scant amount of precious RCS fuel to reach it and found it was only a landing leg and no use to her in her predicament. Unable to contact KSC or do anything more to save herself, she waits for a rescue.\u003C/p\u003E\u003Cp\u003EUpdate: Isaalla is saved!\u003C/p\u003E\u003Cp\u003EMy first rescue craft lacked solar panels. I built in haste. It is currently drifting around in an elliptical orbit thanks to its flyby of the Mun. No idea how long it will take it to crash. While the craft was en route I had Isaalla climb out of the crater to gain higher elevation. Every little bit helps.\u003C/p\u003E\u003Cp\u003EMy second one safely made it, but by the time I had gotten a second rescue craft to reach the Mun Isaalla\u0027s position had been engulfed in darkness. I hadn\u0027t thought to put lights on it because, again, I built in haste. I used Isaalla\u0027s targeting marker as a rough indication of elevation change (I had to estimate because I landed a kilometer away from her). The landing went safely and Isaalla EVA\u0027d her way over to the craft. We can\u0027t see her face in this picture, but I imagine her smile was massive.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/395547605766026368/C4B5CD72372C4CA11B896C4004A9B58E159D7E10/\u0022 alt=\u0022C4B5CD72372C4CA11B896C4004A9B58E159D7E10\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe return was relatively uneventful. I used the last of the fuel as I was approaching Kerbin to slow down enough to prevent too much reentry heat since I neglected to put a heat shield on it (BUILT IN HASTE!). She landed in sunny fields quite near a beach. The Kerbin sand was a welcome comfort after the Munar regolith. You can see the... complete indifference in her expression. Or maybe she is just about to fall to her knees weeping with joy? I really can\u0027t tell which.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/395547605766026737/56D28B4B6F66FF648FA8D6DC04B7EC648AF1F858/\u0022 alt=\u002256D28B4B6F66FF648FA8D6DC04B7EC648AF1F858\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith the Science she boldly retrieved from the original lander I was able to unlock the larger command module and medium size docking ports. Now, I should be able to do Apollo style missions which hopefully will make future missions safer.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-16T01:43:13Z\u0022 title=\u002210/16/2015 01:43  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 16, 2015\u003C/time\u003E by Gods315Pawn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-15T23:41:22Z","Content":"\n\u003Cp\u003EA second Leouch landing, and then on to Nolas where I went trench running.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/zR3mnn\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm6.staticflickr.com/5755/22214740391_cdd7dea198_h.jpg\u0022 alt=\u002222214740391_cdd7dea198_h.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI can safely say that \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/114092\u0022 rel=\u0022external nofollow\u0022\u003ENew Horizons\u003C/a\u003E is my favourite mod in KSP.\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-10-15T23:49:36Z","Content":"\n\u003Cp\u003ESweet victory. Two moons down, three to go. Everything after this should be a cakewalk.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eMu2KBu.png\u0022 alt=\u0022eMu2KBu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"BJ Quest","CreatedById":58716,"CreatedDateTime":"2015-10-16T01:05:51Z","Content":"\n\u003Cp\u003EAfter building several different model rocket helicopter recover designed from scratch I thought what about KSP designs. Below is a test of the concept using the air break devise as helicopter blades. it works quite well through the atmosphere although some kerbals might get a bit sick from the tremendous amount of spinning. Perhaps a note needs to be stuck on the dashboard \u0022Do not attempt right after eating\u0022 :-)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4XBfhEF.png\u0022 alt=\u00224XBfhEF.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-10-16T01:23:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003EYou\u0027re selling yourself short - looks to me like you \u0027\u003Cstrong\u003E\u003Cem\u003Ecloaked\u003C/em\u003E\u003C/strong\u003E\u0027 it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrust me, it crashed. I couldn\u0027t get it to work until I restarted the game which subsequently made my computer run out of memory. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"samwiseiam25","CreatedById":89962,"CreatedDateTime":"2015-10-16T02:17:49Z","Content":"\n\u003Cp\u003EToday I strapped together a rocket and lander out of low tech parts, flew it to the Mun without SAS, rescued Jeb from an elliptical orbit, landed on the mun without electrical power or RCS, and finished my return burn to Kerbin with Jeb\u0027s EVA jetpack, all in one mission.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/wVh9b\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-10-16T03:27:28Z","Content":"\n\u003Cp\u003ELaunched Duna Driller mk2.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.gyazo.com/3bce5b70a5f765000b0e9987a00e9cac.png\u0022 alt=\u00223bce5b70a5f765000b0e9987a00e9cac.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe other one was waaaaaay too small, but I managed once I figured out I could refine my own fuel. Unfortunately on one return, that refining caused an engine to stall, and I couldn\u0027t recover in time. Mk1 was destroyed :/\u003C/p\u003E\n"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-10-16T05:41:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gods315Pawn\u0022 data-cite=\u0022Gods315Pawn\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EUpdate: Isaalla is saved!\u003C/p\u003E\u003Cp\u003EMy first rescue craft lacked solar panels. I built in haste. It is currently drifting around in an elliptical orbit thanks to its flyby of the Mun. No idea how long it will take it to crash. While the craft was en route I had Isaalla climb out of the crater to gain higher elevation. Every little bit helps.\u003C/p\u003E\u003Cp\u003EMy second one safely made it, but by the time I had gotten a second rescue craft to reach the Mun Isaalla\u0027s position had been engulfed in darkness. I hadn\u0027t thought to put lights on it because, again, I built in haste. I used Isaalla\u0027s targeting marker as a rough indication of elevation change (I had to estimate because I landed a kilometer away from her). The landing went safely and Isaalla EVA\u0027d her way over to the craft. We can\u0027t see her face in this picture, but I imagine her smile was massive.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://images.akamai.steamusercontent.com/ugc/395547605766026368/C4B5CD72372C4CA11B896C4004A9B58E159D7E10/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://images.akamai.steamusercontent.com/ugc/395547605766026368/C4B5CD72372C4CA11B896C4004A9B58E159D7E10/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe return was relatively uneventful. I used the last of the fuel as I was approaching Kerbin to slow down enough to prevent too much reentry heat since I neglected to put a heat shield on it (BUILT IN HASTE!). She landed in sunny fields quite near a beach. The Kerbin sand was a welcome comfort after the Munar regolith. You can see the... complete indifference in her expression. Or maybe she is just about to fall to her knees weeping with joy? I really can\u0027t tell which.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://images.akamai.steamusercontent.com/ugc/395547605766026737/56D28B4B6F66FF648FA8D6DC04B7EC648AF1F858/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://images.akamai.steamusercontent.com/ugc/395547605766026737/56D28B4B6F66FF648FA8D6DC04B7EC648AF1F858/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWith the Science she boldly retrieved from the original lander I was able to unlock the larger command module and medium size docking ports. Now, I should be able to do Apollo style missions which hopefully will make future missions safer.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat Rescue! And my space agency employs the same (lack of) mathematicians that yours does. My first Munar attempt was a near disaster due to a gross disregard of A) testing \u0026amp; \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E designing balanced craft, but I made it back on a free return. 4 years, 200 days in, and no rescues needed yet! *knock on wood*\u003C/p\u003E\n"},{"CreatedByName":"Hessu","CreatedById":116263,"CreatedDateTime":"2015-10-16T07:18:08Z","Content":"\n\u003Cp\u003EDid my first Tylo landing yesterday. Went smooothly. \u003C/p\u003E\u003Cp\u003EFirst I messed my transfer from Kerbin, but got enough fuel to get my mothership in high-elliptic Tylo orbit. I sent initially some tankers so no worries.\u003C/p\u003E\u003Cp\u003EGot my Tylo lander with a tug in a 30km circular orbit bit after. Crew transferred in smaller lander as the mother ship is a bit low on fuel and the small lander is able to refill at Tylo-tug. \u003C/p\u003E\u003Cp\u003EThen to the business...\u003C/p\u003E\u003Cp\u003EFirst attempt from 30km orbit went kaboom. One continuous burn aiming retrograde beginning from 30x30km didn\u0027t do. The lander had plenty of fuel and speed left on ground impact. So not enough TWR I guess. Lander descent stage is on single aerospike, some drop tanks. Separate ascent stage with single terrier and more drop tanks. Alcor pod on top with the usual crew. \u003C/p\u003E\u003Cp\u003EChanged plans and managed to land by aiming thrust below retrograde to gain more time to burn through all the fuel. That did it after some tries.\u003C/p\u003E\u003Cp\u003EJeb planted a flag. The he was not able to climb the ladders to the top of a tank, even though I had tested that on the pad. Then I figured out to raise one landing leg and tilt the craft and Jeb got back to pod. \u003C/p\u003E\u003Cp\u003EAt ascent, I then realized just after take-off that my ascent stage was drained. Probaply the tug eptied it through a docking port. So nothing more to comment on that ascent. \u003C/p\u003E\u003Cp\u003ESo reloaded a save, refilled the lander, and eventually managed to land again. Planted \u0022second\u0022 flag. \u003C/p\u003E\u003Cp\u003EThen I did the trick with the landing leg and got ready to take off. Landing had cutted my fuel margins thin. I had to stage almost immediately after take off and switch to single terrier ascent engine.\u003C/p\u003E\u003Cp\u003EAnd then I ran out of fuel later. Fired monoprop. Bailed out Bill and Bop with jetpacks to safe orbit. Jeb didn\u0027t have enough time to jetpack to orbit. \u003C/p\u003E\u003Cp\u003EI decided that the ascent was not so optimal and there was possibility to success. So I reloaded a save. This had nothing to do with the fact that I hadn\u0027t refilled ALL ascent stage tanks. So refilled two Oscar tanks also. I guess that I lose some delta-v on ascent as I can\u0027t aim the prograde when it\u0027s near horizontal like on Mun ascents. I have to aim higher to gain altitude. Not enough TWR here also.\u003C/p\u003E\u003Cp\u003EThen I did a new descent, with just slightly better piloting and all full tanks to begin with. Planted \u0022third\u0022 flag. This time no landing leg trickery as I was on nice slope. \u003C/p\u003E\u003Cp\u003EAdjusted staging to get rid off landing legs and empty tanks right at take off. Had to switch to terrier again too soon. \u003C/p\u003E\u003Cp\u003EAimed for hopefully better trajectory, fired monoprop almost immediately to get rid of weight and optimize delta-v. \u003C/p\u003E\u003Cp\u003EAgain ran out of fuel. Bill was ready to bail out. Then Bob right after. Also Jeb managed to get out in time to jetpack for orbit. \u003C/p\u003E\u003Cp\u003ENow all three crew members are orbiting in suits in safe altitude. I plan to pick the guys with the small lander and then proceed with the mission as usual.\u003C/p\u003E\u003Cp\u003ENow thinking it I should have used the tug for the initial descent. It at least has some tiny amount of fuel left. Also firing the monoprop right at the beginning of the descent instead on ascent might have gained something. Anyway, the flag is planted and crew is in safe orbit, so I call my first Tylo crewed landing a success. \u003C/p\u003E\u003Cp\u003ENext on schedule is testing out my first Laythe plane, arriving in few days. I expect nothing to go wrong with that.\u003C/p\u003E\n"},{"CreatedByName":"algwat","CreatedById":137609,"CreatedDateTime":"2015-10-16T10:50:19Z","Content":"\n\u003Cp\u003ERunning MUN tests for the ASTAR Mining Company....with a relocatable mining base..testing lander docking functions, some pilot errors..8) My other mobile miner was a brick could not make it fly... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://2.bp.blogspot.com/-I-nJdiGC8Do/ViDUZbD7peI/AAAAAAAABXQ/JUDKjZrG_OE/s1600/screenshot85.png\u0022 alt=\u0022screenshot85.png\u0022\u003E\u003Cimg src=\u0022https://4.bp.blogspot.com/-FRyIpmCHai0/ViDUZRIAiRI/AAAAAAAABXU/oXVx74R_MLQ/s1600/screenshot89.png\u0022 alt=\u0022screenshot89.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-10-16T12:38:35Z","Content":"\n\u003Cp\u003ELast night began with the Mun Sojourner\u0027s resource scan. Mun, as it turns out, is not as good of a place to do mining as Minmus, but there are still some areas on the surface that have concentrations in the 80-90% range, so there is that.\u003C/p\u003E\u003Cp\u003EI spent the bulk of my playing time last night landing my fully-tourist-loaded \u003Cem\u003ERaven 7\u003C/em\u003E spaceplane. Re-entry went well enough, but I had problems sticking the landing; in naval parlance, I committed a \u0022ramp strike\u0022 twice on the landward end of the Runway. Took me four tries to get the plane down intact. But, I did ultimately get it down. Fully cleared two tourist contracts in the process and between the six of them made over Ã¢Ë†Å¡500k in one thwack. I also brought home 304 science points from the two surface samples I brought back from Mun aboard the plane. The proceeds immediately went to unlocking the Level 3 Tracking Station - my KSC is now fully upgraded - as well as Large Landing Gear.\u003C/p\u003E\u003Cp\u003EThe Large Gear were immediately fitted aboard my \u003Cem\u003EAlbatross 7\u003C/em\u003E refueling plane, which I\u0027ve been fiddling with, and I did finally get it airborne; the plane is too stable and she exhibits some pretty nasty roll characteristics. I\u0027ll probably make more tweaks when I unlock RAPIERs; she was designed as a RAPIER plane, so at the lower levels those Turbojets give her excess thrust.\u003C/p\u003E\u003Cp\u003EA refinery module was launched towards Mun last night, which will be added to the Munport space station. I need to get some basic mining equipment to Mun as soon as I can. I\u0027m not sure if I shouldn\u0027t have waited to upgrade the Tracking Station; the equipment I\u0027ve got for mining is pretty expensive...\u003C/p\u003E\n"},{"CreatedByName":"hendrack","CreatedById":142754,"CreatedDateTime":"2015-10-16T13:11:44Z","Content":"\n\u003Cp\u003ELaunched 4 satellites. Duna and Ike have now 100% coverage. After ressource scanning unmanned drones and supplies for manned expedition follow.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/42726\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-10-16T13:47:36Z","Content":"\n\u003Cp\u003EI decided to completely rebuild something I was days away from releasing just to improve a single part of it...\u003C/p\u003E\u003Cp\u003E I have invented a new method of doing something that is unlike anything seen before. Now I just have to get it to work..\u003C/p\u003E\n"},{"CreatedByName":"Generalstarwars333","CreatedById":151938,"CreatedDateTime":"2015-10-16T13:55:42Z","Content":"\n\u003Cp\u003EI put a ramjet on the aeris 3A. It was awesome. It can go straight up and take off in about a 4th of the runway, maybe less. and I landed it. first landing. and I managed it with a plane that had been going supersonic seconds ago on a horribly planned landing. had maybe 3o yards left of the runway. awesome.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAnd also added multiple airbrakes to my see research laboratory. It uses hover peices from KF and a jet engine to send it out to the sea. My first version had no airbrakes, so I had to do a retrograde burn. The only of steering it was the rcs that comes with the KF rover chassis in it that has 10k electricity. the airbrakes should help it so it can slow down quickerish and maybe not take as long so I ccan get to scienceing quicker...may take longer since less data for the mpl thingy since the instruments have been used before...but added another thing, and then rambled on for a while in class while typing this...\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-10-16T14:03:11Z","Content":"\n\u003Cp\u003EWas going in for a landing in a B-17, all seemed good (Except approaching from ~20 degrees) until a few drum barrels by the side of the runway ripped the aircraft apart.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XdV5b0T.png\u0022 alt=\u0022XdV5b0T.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NP0cbLJ.png\u0022 alt=\u0022NP0cbLJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IMfCZAP.jpg\u0022 alt=\u0022IMfCZAP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/clSVGqN.jpg\u0022 alt=\u0022clSVGqN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/q62K1l5.png\u0022 alt=\u0022q62K1l5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bVaFHOD.png\u0022 alt=\u0022bVaFHOD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESorry for the long post.\u003C/p\u003E\n"},{"CreatedByName":"MaxwellsDemon","CreatedById":147660,"CreatedDateTime":"2015-10-16T14:28:50Z","Content":"\n\u003Cp\u003EScouted out a likely position on the Mun for a surface station/drilling rig, and fulfilled a couple of satellite launch contracts to keep the money flowing in. (What are the units of money called? I\u0027ve been thinking of them as \u0022kerbits\u0022....)\u003C/p\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2015-10-16T14:53:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MaxwellsDemon\u0022 data-cite=\u0022MaxwellsDemon\u0022\u003E\u003Cdiv\u003E (What are the units of money called? I\u0027ve been thinking of them as \u0022kerbits\u0022....)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI still vote for \u0027Kesos\u0027 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2015-10-16T15:05:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Columbia\u0022 data-cite=\u0022Columbia\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESorry for the long post.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI quite enjoyed it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2015-10-16T15:19:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MaxwellsDemon\u0022 data-cite=\u0022MaxwellsDemon\u0022\u003E\u003Cdiv\u003E (What are the units of money called? I\u0027ve been thinking of them as \u0022kerbits\u0022....)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome call them \u0027roots\u0027 as the money symbol looks a bit like a square root sign.\u003C/p\u003E\u003Cp\u003EGot Kerbinn station \u002B Minmus station contracts along with a \u0027test twin boar around Minmus\u0027 and Explore Minus contracts in my new game so I sent up a station to test a decoupler(used asparagus staging to have a reason to decouple around 11km) and get the twin boar booster into orbit around Minmus (finished off the fuel of that stage in getting the orbit more circular), then went ahead and landed in several biomes before heading home(Landed in 4 biomes including the poles, jet-packed to 4 others for EVA and surface samples). Failed to get the decoupler contract, but got the others. \u003C/p\u003E\u003Cp\u003EThen I sent up a similar rocket(without side tanks) to rescue from LKO and 2 from mun orbit plus an orbital tourist. Hoping that last rescuee is a scientist so I can re-set my goo and materials study making a Mun landing more worthwhile.\u003C/p\u003E\n"},{"CreatedByName":"Melonfish","CreatedById":90990,"CreatedDateTime":"2015-10-16T16:01:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MaxwellsDemon\u0022 data-cite=\u0022MaxwellsDemon\u0022\u003E\u003Cdiv\u003EScouted out a likely position on the Mun for a surface station/drilling rig, and fulfilled a couple of satellite launch contracts to keep the money flowing in. (What are the units of money called? I\u0027ve been thinking of them as \u0022kerbits\u0022....)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOooh battlestarish I like that.\u003C/p\u003E\n"}]}