{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":324,"Articles":[{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2014-06-11T08:11:33Z","Content":"\n\u003Cp\u003E@Overfloater: That plane is really, really impressive! Thanks for the video!\u003C/p\u003E\u003Cp\u003EI haven\u0027t played KSP the whole weekend, since I was busy working on my GCW Zero port of The Ur-Quan Masters. \u003C/p\u003E\u003Cp\u003EWell, that one\u0027s nearly done, so I could do another refuelling mission for my Eve lander. This leaves just one tank empty, so that ship will be ready for departure probably today in the evening. Then I\u0027ll have to refill the tankers which are already in LKO, and send up some more tankers to go along to Eve. Also the test flight of my 14000 dV ship is nearing its end. Jebbediah did some crazy maneuvers over minmus to test how usable the ship is and is now on his way back to Kerbin. The first stage is not capable of docking, so it will be burnt in the atmosphere (with all remaining fuel in it). The second and third stages fuel will be used to refill the tankers mentioned previously. \u003C/p\u003E\u003Cp\u003EMeanwhile I think that the ship that\u0027ll go to Moho is done. The lander has relatively little dV, but it should be sufficient if the landing is done carefully. I\u0027ll post screenshots when that ship is launched.\u003C/p\u003E\n"},{"CreatedByName":"J4CKAL2014","CreatedById":111883,"CreatedDateTime":"2014-06-11T09:09:21Z","Content":"\n\u003Cp\u003ECompleted my first manned mission to Jool yesterday after 2 day working in it. Lasted almost 23 years but all Kerbals returned safely \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E don\u0027t have the heart to de-orbit the spacecraft that took them there, though\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-06-11T11:00:21Z","Content":"\n\u003Cp\u003EAfter having installed Interstellar I started a new career game. . . seemed like the thing to do.\u003C/p\u003E\u003Cp\u003EI forgot how irritating the lack of batteries / solar panels is early on. . . when I finally manged to get Z100\u0027s I strapped 9 of them onto a ship for a mere mun flyby. . . it wasn\u0027t enough. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI now have Ox-STAT\u0027s. . . thank god.\u003C/p\u003E\u003Cp\u003EEdit: I also miss the hell out of the small cubic octagonal strut . . . that thing is the single most useful part EVER and is WAAAAAAAY up the tech tree for some reason.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-06-11T11:46:00Z","Content":"\n\u003Cp\u003EI continued my experiments with SSTO rockets. Building a rocket for a 100-tonne payload is trivial, but returning the launcher back from orbit still requires a lot of quickloading. Horizontal landing would probably be much easier.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/ksp/ssto_lifter_16.jpeg\u0022 alt=\u0022ssto_lifter_16.jpeg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rogu3ish","CreatedById":112748,"CreatedDateTime":"2014-06-11T16:35:44Z","Content":"\n\u003Cp\u003EToday I drove my Munar rover about 22km from its original landing site to scout out a good location for my first Munar base / Kethane extractor.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://photos-1.dropbox.com/t/0/AACHC2ppHzFjZv9LNEPd6w_bbqnbNe9GiwRtUQPAIJ4Akg/12/235243856/jpeg/1024x768/3/1402509600/0/2/munarrover.jpg/6lx3BanppLww0D_lRqiPt9h4Y_dRo84XIrUa8SctpW8\u0022 alt=\u00226lx3BanppLww0D_lRqiPt9h4Y_dRo84XIrUa8SctpW8\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2014-06-11T16:43:36Z","Content":"\n\u003Cp\u003EI put together some more of the pieces for my new Duna mission. But this isn\u0027t just any old mission to Duna! No sir, this mission will be 100% reuseable! \u003C/p\u003E\u003Cp\u003EEverything is lifted by SSTO, with most of the heavy lifting done by my Kylon (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79535-The-Kylon-my-best-high-capacity-SSTO-so-far\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/79535-The-Kylon-my-best-high-capacity-SSTO-so-far\u003C/a\u003E), which broke its own record for mass-to-orbit today, carrying a \u002B21 ton cargo, seen here:\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022http://i.imgur.com/2AHWDoy.png\u0022 alt=\u00222AHWDoy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe mission craft, named \u0022Tirek\u0022 is assembled in LKO\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/L0hjzP7.png\u0022 alt=\u0022L0hjzP7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe craft currently consists of five modules as seen below. In the middle at the bottom we have the propulsion unit, which will be doing all of the burns. Above it we have the docking array, which is the only part not carried into orbit on a Kylon but rather a Thunderlane Mk-5 (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65968-Thunderlane-Mk-5-Becausethe-old-one-needed-an-upgrade\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/65968-Thunderlane-Mk-5-Becausethe-old-one-needed-an-upgrade\u003C/a\u003E) due to lenght issues (and even then it had to angled awkwardly). On the left we have the lander, a very simple affair, and pretty self-explanatory, and to the right we have the rover, known as \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EIce Dentist 2.1 \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3NHjnaX.png\u0022 alt=\u00223NHjnaX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zqyuPrP.png\u0022 alt=\u0022zqyuPrP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rover Ice Dentist is interesting because it is the result of having to have a rover that is reusable. Don\u0027t wanna leave this thing behind, and to do this i had to design a clever self-rightening mechanism. It uses the landing legs to achieve this before takeoff, as demonstrated below: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VCDtEg7.png\u0022 alt=\u0022VCDtEg7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mwC08ez.png\u0022 alt=\u0022mwC08ez.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nUX0KiT.png\u0022 alt=\u0022nUX0KiT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eK2NXQ6.png\u0022 alt=\u0022eK2NXQ6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m still not quite ready to take Tirek to Duna yet though. The fuel tank in the docking array needs a refill, the probe on the top needs to be taken back to Kerbin, and I want to include a habitation module on the top.\u003C/p\u003E\n"},{"CreatedByName":"corvustech","CreatedById":111036,"CreatedDateTime":"2014-06-11T20:14:36Z","Content":"\n\u003Cp\u003EToday I took on the task of sorting out how to make a space station to all but replace Ground Control as my mission start point. After coming up with an elegant solution I realized my only unlocked docking port so far is the Klaw....\u003C/p\u003E\n"},{"CreatedByName":"smysha","CreatedById":103125,"CreatedDateTime":"2014-06-11T20:24:52Z","Content":"\n\u003Cp\u003EToday I launched a beghemoth lander to Mun. I still didn\u0027t gathered data from all biomes. My target was Poles biome.\u003C/p\u003E\u003Cp\u003E\u0026lt;iframe class=\u0022imgur-album\u0022 width=\u0022100%\u0022 height=\u0022550\u0022 frameborder=\u00220\u0022 src=\u0022http://imgur.com/a/cFaA0/embed\u0022\u0026gt;\u0026lt;/iframe\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2014-06-11T20:37:08Z","Content":"\n\u003Cp\u003EWell last night. I had fun landing close to a probe rover I had on MÃƒÂ¼n:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/3278932873102944742/9871AEEE80CE0BF474138BC4EFC30BB49FF04511/\u0022 alt=\u00229871AEEE80CE0BF474138BC4EFC30BB49FF04511\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd here is a shot with the brave crew by the probe rover:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://cloud-3.steampowered.com/ugc/3278932873103429324/CED78ABD52BA7ACD8301CD74565F358E5DFB523E/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://cloud-3.steampowered.com/ugc/3278932873103429324/CED78ABD52BA7ACD8301CD74565F358E5DFB523E/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso prior to this. I have a Kerbal that is terrified in all situations it seems: \u003Ca href=\u0022http://cloud-2.steampowered.com/ugc/3278932873103469880/2B6BFCA74532352CC8053103ECC0E4B530CA6A8C/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://cloud-2.steampowered.com/ugc/3278932873103469880/2B6BFCA74532352CC8053103ECC0E4B530CA6A8C/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"rennsport27","CreatedById":108383,"CreatedDateTime":"2014-06-11T20:54:42Z","Content":"\n\u003Cp\u003EMy Sundiver probe made it back to Kerbin yesterday. It came screaming through the atmosphere at something like 11,000 m/s, a record for me. I think I ended up dipping to 20,000m for aerocapture, and it left a nice big fireball. Sadly, I didn\u0027t think to take any pictures at the time.\u003C/p\u003E\n"},{"CreatedByName":"Concentric","CreatedById":103320,"CreatedDateTime":"2014-06-11T21:07:38Z","Content":"\n\u003Cp\u003EOne burn.\u003C/p\u003E\u003Cp\u003ESpecifically, FourJade\u0027s mid-trajectory adjustment burn, so the FourJade ship now has only a little over a year and a half until its Jool-Laythe encounter. I had to redisable fuel crossfeed on the docking ports, because it had somehow turned itself back on and started to drain the Laythe lander component.\u003C/p\u003E\u003Cp\u003EAlso, some messing about with rovers that never really got anywhere, and some fiddling with my most recent spaceplane to try and move its dry centre of mass closer to its centre of lift - hopefully I\u0027ll be able to practice and land it properly at some point.\u003C/p\u003E\n"},{"CreatedByName":"Mister Kingdom","CreatedById":105121,"CreatedDateTime":"2014-06-11T21:35:31Z","Content":"\n\u003Cp\u003EI took a probe I\u0027ve had in orbit since I started the save file, and put it somewhere less troublesome, namely a geostationary/kerbostationary/keostationary/standy-still-orbit/whatever we call it now orbit. I managed to get it from 72 k orbit with only an ion engine, one single battery and 8 static solar panels, over about an hour. I left my session as the new \u0022gliding rocket\u0022 (space vehicle that can theoretically glide in atmosphere, and has the bonus of looking like an X-Wing) was in orbit, ready to test my capabilities with the inline docking port on my disembodied engines orbiting Kerbin; a full report of the mission will eventually be available when we finish the mission, for those who are sufficiently brain dead and/or high to be able to read such drivel as is available from a sleep-deprived kerbal.\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-06-11T22:02:31Z","Content":"\n\u003Cp\u003EThe mission: bring up a new Scansat for higher resolution imaging of the planet, using my new SSTO courtesy of Spaceplane Plus. Bonus: Retrieve the old Scansat.\u003C/p\u003E\u003Cp\u003EOff to find this satellite. I have to say, compared to the (few) other spaceplanes I\u0027ve built, this thing handles like a dream. Just don\u0027t pull up too hard right after take off and you\u0027ll be fine. Except for this flight where something else happened that I didn\u0027t anticipate. I had done some tweaking to the design which not only messed up my action keys but disconnected one of my fuel lines running to the center. I didn\u0027t even notice it until I switched the the NERVAs and then it started pulling the fuel out of one side and leaving it in the other. Once I figured out what the heck was going on it was a simple enough fix (just periodically balance the fuel until there\u0027s enough to put it all in the central tank).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1116-48-25-70.jpg~original\u0022 alt=\u0022KSP2014-06-1116-48-25-70.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003ETarget acquired, and deployment is succe-- DARNIT. The Ion engine separated from the probe when it decoupled. Oh well, I guess it\u0027ll just have to stay put.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1117-31-04-36.jpg~original\u0022 alt=\u0022KSP2014-06-1117-31-04-36.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003ERounding up the old probe...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1117-37-59-22.jpg~original\u0022 alt=\u0022KSP2014-06-1117-37-59-22.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhile this mission was a success in principle, it failed on a technicality. I successfully captured the old probe and closed the bay doors on it, but as soon as I timewarped to select where I\u0027d deorbit the plane, it clipped and escaped (as I should have expected). If I had thought to bring a KAS winch this would have been a complete success. I think from a roleplaying perspective alone I\u0027m justified (this time) to deorbit the ship and delete the probe it was supposed to pick up, because if it wasn\u0027t for physics on rails I would have completed it without a hitch.\u003C/p\u003E\u003Cp\u003EEdit: Or maybe not. Guess I was assuming I landed safely, which didn\u0027t happen. I came down over the ocean and was going to fly to KSC but I lost control. The nose pitched up and caused a stall and spin. It wasn\u0027t pretty... RIP Calory and Thomprim.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1118-18-52-44.jpg~original\u0022 alt=\u0022KSP2014-06-1118-18-52-44.jpg~original\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-11T22:21:24Z\u0022 title=\u002206/11/2014 10:21  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 11, 2014\u003C/time\u003E by Duke23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GeneralMDBK","CreatedById":72407,"CreatedDateTime":"2014-06-11T22:31:55Z","Content":"\n\u003Cp\u003EI spent all day today and yesterday and the day before that going through the entire forum since I haven\u0027t taken a look at it since my laptop went belly up on me, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E and I just now was able to remember my login. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E Plan on starting fresh with a brand new desktop in the beginning of next month. Until then I shall continue to torture myself with the desire to fly with Jeb and the gang by being on this forum every single day. Lol. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"McFarnsworth","CreatedById":73984,"CreatedDateTime":"2014-06-11T22:44:45Z","Content":"\n\u003Cp\u003EBuilt a reusable 20t to LKO jet-assisted SSTO rocket. For lighter payloads it can even do a powered landing, but for the full 20t payload it needs parachutes to land safely. Ironically, if I remove the parachutes I might save just enough weight to do a landing without them, but I don\u0027t have the balls to cut them from the design. (the parachutes, not the balls)\u003C/p\u003E\u003Cp\u003EShould come in handy once budgets become a concern, depending on how they\u0027ll implement them.\u003C/p\u003E\u003Cp\u003EI also went through my crafts folder, and updated and optimized some of my older ships while deleting a lot of prototypes and crappy designs. It was fun going through all of my designs from my early ksp days and seeing how I\u0027ve improved. I kept a few terrible ones for nostalgia\u0027s sake.\u003C/p\u003E\n"},{"CreatedByName":"RobertR","CreatedById":111049,"CreatedDateTime":"2014-06-11T22:54:17Z","Content":"\n\u003Cp\u003EI sent Bill on a trip to Jool with the intention of landing on one of the moons. Unfortunately I didn\u0027t send him with enough fuel and ran out just after I got into orbit around Jool. This is the first time I\u0027ve sent a manned mission to Jool so I think I did alright. I\u0027m planning on sending a rescue mission eventually but I decided to start assembling a space station first. Bill\u0027s mission changed from landing on a moon to taking pictures for several years. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ljJmC\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"brianorca","CreatedById":109756,"CreatedDateTime":"2014-06-11T23:11:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SofusRud\u0022 data-cite=\u0022SofusRud\u0022\u003E\u003Cdiv\u003EThe rover Ice Dentist is interesting because it is the result of having to have a rover that is reusable. Don\u0027t wanna leave this thing behind, and to do this i had to design a clever self-rightening mechanism. It uses the landing legs to achieve this before takeoff, as demonstrated below: \u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/VCDtEg7.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/VCDtEg7.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/mwC08ez.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/mwC08ez.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/nUX0KiT.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/nUX0KiT.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/eK2NXQ6.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/eK2NXQ6.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESit, Rover. Good dog.\u003C/p\u003E\n"},{"CreatedByName":"TrooperCooper","CreatedById":110599,"CreatedDateTime":"2014-06-12T05:32:14Z","Content":"\n\u003Cp\u003ERestarted the career with some mods (mainly BTSM, combined with KWR, DRE, FF, Kethane and some others) a week ago or so. Today I finally had the tech together to start goofing arround Duna.\u003C/p\u003E\u003Cp\u003EUnmanned probe SoftEx IV arriving at the red planet...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/i7VT2L5.jpg\u0022 alt=\u0022i7VT2L5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBeginning to release the probe, shortly before entering the atmosphere...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Zu0RAgO.jpg\u0022 alt=\u0022Zu0RAgO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGathering data and transmitting through the huge antenna while hanging on the chutes at high, speed... no problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XgK0eyU.jpg\u0022 alt=\u0022XgK0eyU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESomehow it made it to the ground in one piece, though it kept rolling like forever. But who cares, doesnt have to look pretty, all we want is the science. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iz83zyd.jpg\u0022 alt=\u0022iz83zyd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter that has been done, I am now beginning to plan and design for a first Kerbal-landing and return trip. I am probably going to have three seperate launches with a crew-travel vehicle, a lander and a service module that will all come together in Duna orbit at some point. Here is the lander atop its travel-stage on a test launch with a new lifter for the job.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eGbdNcT.jpg\u0022 alt=\u0022eGbdNcT.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launch and lifter worked nicely. The following re-entry test of the lander didnt look as promissing though.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gZOtH86.jpg\u0022 alt=\u0022gZOtH86.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut I expect it to behave slightly better within the thin atmosphere of Duna. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-06-12T05:39:56Z","Content":"\n\u003Cp\u003EI did a Grand-Flyby-tour around Duna, Jool, Vall, Tylo and Laythe with a Science-Lab and all instruments available. Laythe kicked me way beyond out of Jools Orbit and timewarping till apoapsis took about 500days... 10 minutes of max. Timewarp \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell... I did the dishes and the laundry in the meantime \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut the whole Thing gave me about 4000 science Points.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-06-12T05:51:31Z","Content":"\n\u003Cp\u003EPrepared the U.K.S. \u003Cem\u003ERenown\u003C/em\u003E for its mission to Eeloo tomorrow. My first visit to that particular rock. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Looking forward to it.\u003C/p\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2014-06-12T08:39:29Z","Content":"\n\u003Cp\u003EI finished refueling the lander for Eve. Well, at least the refueling before it will go to Eve orbit. When it\u0027s there it will be between 10 and additional 15 refueling missions, depending on how much fuel is needed for the transfer of the lander and the tankers (of which probably 10 will be sent along with the lander during the next transfer window). When talking about tankers: I deorbited all the empty tankers that were parked in Kerbin orbit, since I realized that it\u0027s rather useless to send up non-reusable tankers to fill the tanks of other non-reusable tankers of about the same weight...\u003C/p\u003E\u003Cp\u003EAfterwards I played around with a space plane design that is supposed to be able to lift small LV-N powered ships up to LKO. While it does take off (aka \u0022stays in the air after the runway ends\u0022) and flies more or less, I still need to make sure it doesn\u0027t stall as easy as it does now (it didn\u0027t make it to orbit in my test flight yesterday).\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-06-12T08:39:35Z","Content":"\n\u003Cp\u003EI tried to chase down an anomaly for a while. First I dropped a Kerbal in a capsule over it from space because that sounded like a winning idea, except I missed it by about 30km. At least that part was fun! ...Don\u0027t ask.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1122-17-35-70.jpg~original\u0022 alt=\u0022KSP2014-06-1122-17-35-70.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I sent a rover to the Kerbal, except I screwed that up too and missed by almost 80km this time (obviously using a newly configured joystick instead of the MJ module which would have been easier lol). After sending the rover, it got stuck under the repurposed Minmus lander so I had to use the \u0022emergency\u0022 decouplers on the lander. Meh. After finally getting the rover to the Kerbal I got almost to the anomaly (about 5km away give or take?) and flipped the effing rover! GRR! No screenshots of that because I was irritated, and it might sort of give away the location I was poking around in, no one likes a spoiler.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1202-53-21-43.jpg~original\u0022 alt=\u0022KSP2014-06-1202-53-21-43.jpg~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter giving up on that I made a variant of the SSTO with the crew cabin for 4 to test and sent it up to my station to be refueled. Tomorrow it\u0027s going to Mun to collect 3 idiots who decided to run out of fuel while circularizing... I didn\u0027t realize this ship was quite this big, I had it at a 90 degree angle on approach and almost took out my solar panels with a wing. Well I guess it\u0027s about 37 tons at takeoff so it has a right to be kind of big. Anyway if all goes well (as in I\u0027m not sending a third ship to rescue all 5 of them) I\u0027ll be sending a SCANSat next trip.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-06-1204-21-42-16.jpg~original\u0022 alt=\u0022KSP2014-06-1204-21-42-16.jpg~original\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-12T08:43:00Z\u0022 title=\u002206/12/2014 08:43  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 12, 2014\u003C/time\u003E by Duke23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-06-12T14:00:03Z","Content":"\n\u003Cp\u003ETried to probe the depth of the oceans on Eve. Eve did not take it kindly.\u003C/p\u003E\n"},{"CreatedByName":"Danish_Savage","CreatedById":49194,"CreatedDateTime":"2014-06-12T14:12:44Z","Content":"\n\u003Cp\u003EI have returned from the dead to this forum.....\u003C/p\u003E\u003Cp\u003E(that counts as something right?)\u003C/p\u003E\u003Cp\u003EWhat updates have we had. I left right before the Asteroid thingy\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-06-12T14:25:52Z","Content":"\n\u003Cp\u003EFirst off, here\u0027s TOMRV (The Orbital Mockingbird Rescue Vessel), made with the awesome SP\u002B mod. It\u0027s capable of (theoretically) rescuing up to three Kerbals from LKO and taking them back home \u0022safely\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/71082419/KSP%20Photos/screenshot0.png\u0022 alt=\u0022screenshot0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s is it during an attempt ascent:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/71082419/KSP%20Photos/screenshot1.png\u0022 alt=\u0022screenshot1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd a nuclear SSTAO (Almost Orbit) plane. I\u0027m yet to test how much payload it can carry:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/71082419/KSP%20Photos/screenshot3.png\u0022 alt=\u0022screenshot3.png\u0022\u003E\u003C/p\u003E\n"}]}