{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":422,"Articles":[{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2014-09-22T21:57:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003Eiframes (or any other straight-up html) worked ever in this forum? That\u0027s weird.\u003Cp\u003EWhat you want is the imgur tag.\u003C/p\u003E\u003Cp\u003E[noparse]\u003Ca href=\u0022http://imgur.com/a/drYNc\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/drYNc\u003C/a\u003E[/noparse]\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you, I didn\u0027t know that was an available command. And yes, I\u0027ve been using the iframe so far.\u003C/p\u003E\u003Cp\u003E-edit-\u003C/p\u003E\u003Cp\u003E@Felsmak: That made me laugh so hard, you have no idea. Great achievement there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-22T21:59:46Z\u0022 title=\u002209/22/2014 09:59  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 22, 2014\u003C/time\u003E by Kowgan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BDelacroix","CreatedById":121050,"CreatedDateTime":"2014-09-22T22:00:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI am having problems with the locks, though (the non-spoke bits that are supposed to fit between the modules). Getting them into position has proven difficult; I don\u0027t know what I\u0027m doing wrong but NavyFish\u0027s Docking Alignment Indicator does NOT like the craft I\u0027m using to put them in place, the one I did get in place came un-done when I reloaded the station back up (though it still says it\u0027s docked - despite there being a visible gap) and my second lock won\u0027t dock on one side. I suspect I\u0027m having some alignment issues with the ports and may toss the station\u0027s persistence code to the community to verify.\u003C/p\u003E\u003Cp\u003EThe ships putting the locks in place look......bad. Very bad. How bad? Take a Rockomax Adapter, put a Rockomax Adapter 2 on the bottom of it, stick a TR-18A on that, then a small probe core, then a Z-100 battery, then a small RCS tank, then an FL-T400, then an X200-8 and end it with a Poodle. Then take a look at what you\u0027ve created and hang your head in shame.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had the devil of a time with the assembly. It doesn\u0027t quite line up at the end of the ring, so I approximated it as best I could and then strutted the segments together. That held. Being I figured the segments wouldn\u0027t like docking up, I built it as one big ring. It fills the assembly building. The launcher is a monster but also very well strutted. It bogs down the frame rate even on my computer and I built it (the computer, not that ring) this summer out of just about the newest parts one can get. Landing the thing on Mun wasn\u0027t nearly as bad as last night\u0027s endeavour which was the Duna landing. Oy veh!\u003C/p\u003E\u003Cp\u003EI don\u0027t know what I\u0027ll do today yet. Will see about it.\u003C/p\u003E\u003Cp\u003EIf I use this any more it will at most be Laythe where my poor kerbin there will be glad to see some friends come live at his lonely beach, there is plenty of room. The second place might be Eve. However, those spokes do not like being jerked around as parachutes tend to do. I learned that on Duna.\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2014-09-23T00:25:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Felsmak\u0022 data-cite=\u0022Felsmak\u0022\u003E\u003Cdiv\u003EI built my coolest craft yet.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/33gq9kU.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/33gq9kU.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/aVnGeTP.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/aVnGeTP.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI expected a frisbee to travel a bit farther. The launch pylon looks a little stunned as well.\u003C/p\u003E\n"},{"CreatedByName":"Fr8monkey","CreatedById":76199,"CreatedDateTime":"2014-09-23T01:06:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jean Deaux\u0022 data-cite=\u0022Jean Deaux\u0022\u003E\u003Cdiv\u003EI expected a frisbee to travel a bit farther. The launch pylon looks a little stunned as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aVnGeTP.png\u0022 alt=\u0022aVnGeTP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooks more disappointed to me...\u003C/p\u003E\n"},{"CreatedByName":"Fenris","CreatedById":11162,"CreatedDateTime":"2014-09-23T01:12:57Z","Content":"\n\u003Cp\u003EGlad I\u0027m not the only one who thought the launch stabilizer looked sad in the second pic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EWas starting to think I\u0027ve been playing KSP too much when I start to give inanimate objects feelings.\u003C/p\u003E\n"},{"CreatedByName":"Khorso","CreatedById":106976,"CreatedDateTime":"2014-09-23T01:26:20Z","Content":"\n\u003Cp\u003EWith lack of science being a hindrance in interplanetary travel for my space company, a long term science extraction mission with Minmus in mind was cobbled together. And I do mean cobbled together- who forgets RCS for docking rigs? Oh right, it\u0027s Kerbal Space Program.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/P9AiO\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E-Khorso\u003C/p\u003E\n"},{"CreatedByName":"Fenris","CreatedById":11162,"CreatedDateTime":"2014-09-23T01:55:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Khorso\u0022 data-cite=\u0022Khorso\u0022\u003E\u003Cdiv\u003EWith lack of science being a hindrance in interplanetary travel for my space company, a long term science extraction mission with Minmus in mind was cobbled together. And I do mean cobbled together- who forgets RCS for docking rigs? Oh right, it\u0027s Kerbal Space Program.\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/P9AiO\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/P9AiO\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E-Khorso\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI got all the way to Jool once with an unmanned rocket that had one goo container and science jr for Jool and another one for each moon, I had enough delta v for a one way trip. After I got there is when I found out I\u0027d forgot to include an antenna \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-09-23T03:09:09Z","Content":"\n\u003Cp\u003EI\u0027m still shaking my head at myself. First off, I\u0027ve put my Minmus Kethane mining operation on a very brief hold so I can load up a vaguely Sojourner-ish rover for a one way Duna trip just because. But I don\u0027t like the probe core I have right now so I wanted to research the Okto-2 before sending it. Enter the Data Retrieval Pod. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2222-33-38-33.jpg\u0022 alt=\u0022KSP2014-09-2222-33-38-33.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was a great idea. Lightweight, plenty of DV (or so I thought). Plan was to skim by the Mun to complete a contract, meet up with the orbital fuel depot at Minmus and hit the surface once or twice for science, stop by the fuel depot again, and head home, while also finishing a second contract. Not so fast.\u003C/p\u003E\u003Cp\u003EProblem 1: I didn\u0027t pack QUITE enough fuel. I mean, I was off by about 30m/s (the lander has ~2300m/s DV with a full tank). I thought I\u0027d have a bit to spare, but I didn\u0027t actually factor in passing by the Mun when I was setting everything up. No problem I thought, I\u0027ll just burn off some of this excess monopropellant to finish my burn and meet up with the depot. But...\u003C/p\u003E\u003Cp\u003EProblem 2: I somehow, and still haven\u0027t figured out how, put it into a retrograde orbit. I could have sworn I lined everything up so that wouldn\u0027t happen. So I need about another ~130m/s to turn around and head the proper direction and altitude, not counting any correction burns for the actual rendezvous. No way my monopropellant reserve is going to be enough for that.\u003C/p\u003E\u003Cp\u003EAfter banging my head on the desk a few times (figuratively this time) I thought \u0022Duh, I have a small tanker/lander for the depot anyway.\u0022 So I tossed a little fuel into that and met up with the DRP. Hey, that\u0027s perfect. DeRP. Anyway, my depot is far enough out that orbital speed is ~65m/s so it\u0027s no big deal for the relatively small tanker to swing by and drop off some fuel. Just still scratching my head. Anyway all was good on that front so I hit a new biome on the surface and if all goes well on the return trip I should complete both contracts and get a much needed few hundred thousand funds that I can burn on my Duna rover mission. I decided not to do any more exploration on this trip since I don\u0027t have all the science equipment I\u0027d like to. This was supposed to be light and cheap, so I\u0027ll send a bigger lander later and a lab for the depot to soak up all the data I haven\u0027t collected.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2221-59-03-73.jpg\u0022 alt=\u0022KSP2014-09-2221-59-03-73.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2222-22-07-00.jpg\u0022 alt=\u0022KSP2014-09-2222-22-07-00.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf anyone was wondering, here\u0027s the placeholder design of the rover I\u0027m sending to Duna. The telescope piece is mostly just for looks but I\u0027ll of course use it when approaching Duna. Design subject to change completely or not at all at my discretion. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2222-45-52-72.jpg\u0022 alt=\u0022KSP2014-09-2222-45-52-72.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-09-23T03:45:03Z","Content":"\n\u003Cp\u003EToday I designed a probe/satellite that will be destined for Ike/Duna, it will have one of each on each body. I would have done a rover for that landings but I only have access to the retractable landing wheels, so it would make a silly rover that could not drive anywhere. I may use the same idea for Jool and Eve in future missions to be my funds generators, but I have a different idea for Jool that I may do once I have the full tech tree unlocked. One thing I realized is that I need to remember to put antenna\u0027s on crafts so that I can send back science data. One thing that maybe someone could help me with though is how would I make it so the temp, grav, atmo, and barometer scans send back 100% of data but the mat bays and goo cans send back 0? I know it is a config file but not sure how to write them. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2014-09-23T04:02:12Z","Content":"\n\u003Cp\u003EI did a challenge...\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/jYylq\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EEnded up going quite fast with antimatter powered thermal turbojets.\u003C/p\u003E\n"},{"CreatedByName":"Parallax","CreatedById":104180,"CreatedDateTime":"2014-09-23T05:13:12Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ZjjifDE9zYQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"JenBurdoo","CreatedById":98099,"CreatedDateTime":"2014-09-23T05:35:57Z","Content":"\n\u003Cp\u003ELanded on Gilly via extreme EVA: \u003Ca href=\u0022https://www.dropbox.com/s/lq5d8r2tdqspfqn/Screenshot%202014-09-21%2003.29.00.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/lq5d8r2tdqspfqn/Screenshot%202014-09-21%2003.29.00.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd launched an airbreathing jet into space: \u003Ca href=\u0022https://www.dropbox.com/s/u01n047fzszqffb/Screenshot%202014-09-22%2021.39.09.png?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/u01n047fzszqffb/Screenshot%202014-09-22%2021.39.09.png?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe trick is landing it without killing the pilot.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-09-23T06:45:18Z","Content":"\n\u003Cp\u003EI\u0027ve been putting off my latest RSS escapade (involving 18 years of life support and some 36km/s of delta-V) and playing a career game (which I actually find a lot of fun). I\u0027ve been cracking out on spaceplanes recently; here\u0027s one doing a burn on a flyby past Eve to get me back into Kerbin SOI.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wlxyDor.jpg\u0022 alt=\u0022wlxyDor.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-09-23T07:37:55Z","Content":"\n\u003Cp\u003ELong story short I got my Duna probe and rover ready finally, and made some pretty good progress.\u003C/p\u003E\u003Cp\u003EHere\u0027s what the rover ended up looking like. It\u0027s kind of a bad shot but the better ones are before I did a few modifications to it. Nothing major, but it\u0027s different. Also before I launched it I stuck a headlight on the front.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2300-33-07-19.jpg\u0022 alt=\u0022KSP2014-09-2300-33-07-19.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for the rest... Here\u0027s some more on the mission itself:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EA shot of my wobbly rocket standing by. If I had been smart I could have saved money and dropped by my fuel depot at Minmus before leaving, but I decided to just head out.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2301-53-50-17.jpg\u0022 alt=\u0022KSP2014-09-2301-53-50-17.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooking good so far\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2302-03-08-29.jpg\u0022 alt=\u0022KSP2014-09-2302-03-08-29.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI swear I didn\u0027t even plan this, I just built and launched. The window was about as good as I could have asked for.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2302-26-37-86.jpg\u0022 alt=\u0022KSP2014-09-2302-26-37-86.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFast forward through a ~6m burn, a couple minor corrections, and a long ride and here we are right after attempting to aerocapture. I got as low as 13km and ran out of testosterone, so I had to burn coming out of it to finish the capture.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2302-47-31-24.jpg\u0022 alt=\u0022KSP2014-09-2302-47-31-24.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter adjusting the orbit and ditching the transfer stage, here we are running the initial scans of the planet to see if there\u0027s anything worth checking out down there.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i19.photobucket.com/albums/b161/duke396/KSP2014-09-2303-12-41-61.jpg\u0022 alt=\u0022KSP2014-09-2303-12-41-61.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf my scanning orbit was good enough here (meaning I don\u0027t have to use much / any fuel to correct it) I\u0027m gonna head over to Ike and scan that too while I\u0027m here. After dropping the rover of course, that blasted thing is heavy. I got a little paranoid with the descent system and I really don\u0027t want to destroy this thing that took me so long to build (but that was my fault for being indecisive). Now I\u0027m a little disappointed because there\u0027s no BTDT on the rover... I was gonna say I \u0022forgot\u0022 it, but where the heck would I have put it anyway? Oh well. \u003C/p\u003E\u003Cp\u003ETune in next time for wheels on the ground.\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"JebNeedsHelp","CreatedById":117002,"CreatedDateTime":"2014-09-23T07:57:10Z","Content":"\n\u003Cp\u003EToday I successfully completed the \u003Cem\u003E\u003Cstrong\u003EExplore Pol\u003C/strong\u003E\u003C/em\u003E contract. I dropped a tiny satellite into orbit for those later contracts that want science in the space around Pol, then my 6-Kerbal base landed to do some science and break out the board games (I think they prefer Kingsburg). I also got a cool-looking arrangement of the Joolian system when I landed.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s83.photobucket.com/user/Goof112/media/screenshot16-2.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i83.photobucket.com/albums/j314/Goof112/screenshot16-2.png\u0022 alt=\u0022screenshot16-2.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFred thought he\u0027d zip up to the top of one of those spikes, but he clipped right through it. Next up: Bop.\u003C/p\u003E\n"},{"CreatedByName":"Fellow314","CreatedById":76781,"CreatedDateTime":"2014-09-23T10:59:55Z","Content":"\n\u003Cp\u003EToday I made a Seahorse.\u003C/p\u003E\u003Cp\u003EAnd then I tried a runway landing using only Mechjeb\u0027s altimeter and the cockpit view...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/doeO2yI.jpg\u0022 alt=\u0022doeO2yI.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Brapness","CreatedById":73986,"CreatedDateTime":"2014-09-23T11:50:44Z","Content":"\n\u003Cp\u003EI constructed a new shuttle to assist in crew transfer. Significantly lowers the cost of rotating my station crew and has enough spare fuel to reliably deorbit to the KSC by following a steep descent path (because I\u0027m terrible at judging aerobraking).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Lt6s24x.jpg\u0022 alt=\u0022Lt6s24x.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/umpn0oG.jpg\u0022 alt=\u0022umpn0oG.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"hellion13","CreatedById":66719,"CreatedDateTime":"2014-09-23T12:45:09Z","Content":"\n\u003Cp\u003EI looked at the forum...:\u0027(\u003C/p\u003E\n"},{"CreatedByName":"Alpha8624","CreatedById":112751,"CreatedDateTime":"2014-09-23T13:11:11Z","Content":"\n\u003Cp\u003EI flew a mission to the Mun in Apollo style. Everything was stowed in one rocket. I have the parts from the latest KW Rocketry version and i used some other mods lika KAS for the lander and rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/k2TWeXQ.jpg\u0022 alt=\u0022k2TWeXQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9wWfdlt.jpg\u0022 alt=\u00229wWfdlt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HuAs5dw.jpg\u0022 alt=\u0022HuAs5dw.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-09-23T13:17:26Z","Content":"\n\u003Cp\u003EDidn\u0027t have a lot of time to play today. Decided given the problems I\u0027d been having with Mere to adjust the position of the docking ports on the locks to see if that would fix the problem at all. Also, since I use KAS, I decided to add winches to the interior of the locks. I sent Jeb up with some radial port connectors to add to the station; what I figure I might do is get the lock pieces close, get a Kerbal to go EVA, grab the end piece of the winch, hook it into the connector and then use the winch to help guide the locks into place. The station is more massive than the winch, so it should be a case of the lock being pulled to the station (and not the other way around). A long shot at best; really I think I just need to do better next time I want to realign the things.\u003C/p\u003E\u003Cp\u003EKAS does let you put RCS blocks on structures...makes me wonder if I could get the spokes to steer better if I added a few in some strategic points. I\u0027d need to know where the center of mass a loaded spoke is, though. Sounds like I need to spend some time in the VAB.\u003C/p\u003E\n"},{"CreatedByName":"smysha","CreatedById":103125,"CreatedDateTime":"2014-09-23T15:02:46Z","Content":"\n\u003Cp\u003ETried to do some science. Managed to launch lab for my Minmus mission and failed to launch the lander. Ugh.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/hmKgr\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-23T15:07:08Z\u0022 title=\u002209/23/2014 03:07  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 23, 2014\u003C/time\u003E by smysha\u003C/strong\u003E\n\u003Cbr\u003EThat Imgur gallery is pain in the ass\n\u003C/span\u003E\n"},{"CreatedByName":"Alpha8624","CreatedById":112751,"CreatedDateTime":"2014-09-23T16:10:53Z","Content":"\n\u003Cp\u003EI tried the asteroid redirect mission like NASA would do it. I\u0027ve sent an unmanned probe to capture the asteroid around Kerbin and then i brought it into a high retrograde Mun orbit. After that I\u0027ve launched a crewed spaceship, which docked to the capture probe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lLKvvo5.jpg\u0022 alt=\u0022lLKvvo5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECapture burn 1 in high Kerbin parabolic orbit. Periapsis is at 6000km. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hSUgMVO.jpg\u0022 alt=\u0022hSUgMVO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECapture burn 2 in low Mun orbit to archieve a circular retrograde Mun orbit at 500km.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jwsRdbK.jpg\u0022 alt=\u0022jwsRdbK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ECollecting samples with manned spaceship docked to the capture vehicle.\u003C/p\u003E\n"},{"CreatedByName":"Jon Tash","CreatedById":2681,"CreatedDateTime":"2014-09-23T16:58:13Z","Content":"\n\u003Cp\u003ESo today, the \u003Cem\u003EKRSS Explorer I\u003C/em\u003E landed on Pol, Bill was happy to plant a flag on it. After that, the ship made a path to go to Duna (using 3 course correction during the 2 and a half kerbal year of travel).\u003C/p\u003E\u003Cp\u003EThey said goodbye to the Mighty Jool. Jeb, Bill and Bob aren\u0027t coming back there until the next update.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh3.googleusercontent.com/-QYCUN9UfKPE/VCF6HL-myhI/AAAAAAAABg4/wmngwTadJis/w984-h553-no/screenshot256.png\u0022 alt=\u0022screenshot256.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh3.googleusercontent.com/-VVCcSPYOCr0/VCGfbFAe4sI/AAAAAAAABh0/pe1EIxZyLzs/w984-h553-no/screenshot262.png\u0022 alt=\u0022screenshot262.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo make orbit around Duna I did make an aerocapture using the very thin atmosphere of the planet. But I was really too fast and did not made orbit just by passing trough the atmosphere so I had to fire the engine in retrograde. An interesting note to put here, the ship passed trough the atmosphere at just about 4000 m of altitude of the ground (ASL) and at the same time I was listening to the soundtrack of the movie Gravity.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh4.googleusercontent.com/--Xylaa21KzE/VCGfezMwxrI/AAAAAAAABjI/m-moa9V2agc/w984-h553-no/screenshot272.png\u0022 alt=\u0022screenshot272.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh4.googleusercontent.com/-LFGJCM-qXmE/VCGffjAH1LI/AAAAAAAABjQ/d6JNtfSa7Fc/w984-h553-no/screenshot275.png\u0022 alt=\u0022screenshot275.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGot to a circular orbit around Duna and lanched the lander to Ike and put a flag on it. It was really dark, wished I had chose a better landing spot.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh6.googleusercontent.com/-Of1PY3P6R9Q/VCGfhIi3YeI/AAAAAAAABnE/ac0WAKSVhUU/w984-h553-no/screenshot279.png\u0022 alt=\u0022screenshot279.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh4.googleusercontent.com/-VyFxMnkv-WM/VCGfiHyhuII/AAAAAAAABkI/dghaehBdFUk/w984-h553-no/screenshot283.png\u0022 alt=\u0022screenshot283.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe lander got back to Duna and I landed on one of my favorite spot, inside the beginning of the canyon.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh4.googleusercontent.com/-J2H-QAUw3ks/VCGfipDzUVI/AAAAAAAABkQ/5C3fpMujQQY/w984-h553-no/screenshot284.png\u0022 alt=\u0022screenshot284.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh6.googleusercontent.com/-wDOijeh1Vk8/VCGflupJJ9I/AAAAAAAABlQ/weCG1LDmye8/w984-h553-no/screenshot292.png\u0022 alt=\u0022screenshot292.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://lh3.googleusercontent.com/-lLgLbGz0gGQ/VCGfm9Brs8I/AAAAAAAABlg/U21Nwuft2CA/w984-h553-no/screenshot295.png\u0022 alt=\u0022screenshot295.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb was crazy happy to step on his favorite planet.\u003C/p\u003E\u003Cp\u003EThe mission will continue, the next destination will be Eeloo and after that it will be the last destination, Eve. I\u0027m almost done!\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-09-23T19:13:46Z","Content":"\n\u003Cp\u003EI have spent countless hours refining my cool little craft. Now it barely moves at all!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2xvGruW.png\u0022 alt=\u00222xvGruW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CP8z5PZ.png\u0022 alt=\u0022CP8z5PZ.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2014-09-23T19:24:15Z","Content":"\n\u003Cp\u003EFinished my Asteroid Base... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ir0l0Qa.png\u0022 alt=\u0022Ir0l0Qa.png\u0022\u003E\u003C/p\u003E\n"}]}