{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":2065,"Articles":[{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2019-12-02T22:20:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223712613\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221575319213\u0022 data-ipsquote-userid=\u0022181783\u0022 data-ipsquote-username=\u0022Cavscout74\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Cavscout74 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRescue at less than 5000 meters around Minmus\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nImpressed you made it! I had some crew reports between 5400 and 5700m, and the darn thing kept hitting terrain after a few orbits... Eventually I developed a suborbital-dive strategy.\n\u003C/p\u003E\n\u003Cp\u003E\n(Amusingly, one of the impacts was such a glacing blow that even at orbital speeds, only one antenna broke off and the rest of the vessel pinged away into space.)\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2019-12-02T22:50:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223712647\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221575325220\u0022 data-ipsquote-userid=\u0022127483\u0022 data-ipsquote-username=\u0022eddiew\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, eddiew said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nImpressed you made it! I had some crew reports between 5400 and 5700m, and the darn thing kept hitting terrain after a few orbits... Eventually I developed a suborbital-dive strategy.\n\u003C/p\u003E\n\u003Cp\u003E\n(Amusingly, one of the impacts was such a glacing blow that even at orbital speeds, only one antenna broke off and the rest of the vessel pinged away into space.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m pretty sure the only reason I did was the initial rendezvous was over the flats, and I was just getting into the hills as I was finishing up.  I didn\u0027t actually look at the target\u0027s orbit altitude other than thinking \u0022wow, that\u0027s really close to the surface\u0022 until I was matching his velocity and actually saw how low we were.  I\u0027m not certain what my exact altitude was - I had the altimeter set to AGL, and it was running from 5000-something over the flats (probably about what you\u0027ve had) to under 1000m getting into the hills.  The lowest I saw was between 500 \u0026amp; 600 meters as the rescuee was boarding the rescue pod, and as soon as he was in, I was boosting \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E to something saner. \n\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2019-12-03T08:53:55Z","Content":"\n\u003Cp\u003E\nWith the success of Mundog IV, the R\u0026amp;D team find themselves in a good position to propose an even larger, bolder vessel, one that will carry not only 3 crew, but a more comprehensive science package.\n\u003C/p\u003E\n\u003Cp\u003E\nSeeing as we\u0027ve received a distress call from one of those cheap knock-off space programs, we decide to head back to Minmus and give it a darn good scienceing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022d6Y6arZ.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/d6Y6arZ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBetween them, Val, Bob and new recruit Yuki manage to tap up five biomes, gathering surface samples and collecting data from the premium materials experiment. While Bob did spot and investigate one of the \u0027mossy boulders\u0027 as reported by Jeb, he too failed to make sense of it with the tools he had at his disposal. Evidently we are going to have to come up with something more advanced if we want to learn about these mysterious structures.\n\u003C/p\u003E\n\u003Cp\u003E\nHappily, the team came back with over 1300 data points, which should help a lot with that!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2019-12-03T14:53:14Z","Content":"\n\u003Cp\u003E\n(1.6.1) There was really only one thing I wanted to accomplish yesterday, and that was to get the \u003Cem\u003ERogue 7 \u003C/em\u003Ebase-seeding rover to the Midlands on Mun from its starting point. Didn\u0027t happen on account of my box being stupid and Unity garbage collection being utter crap. If anybody\u0027s got a suggestion for a good SD card to slip into a Dell Latitude E5470 office laptop (with 8GB RAM) for ReadyBoost purposes, I\u0027d love to hear it. When the game gets up to around 5.5 GB usage for no real reason...well.........\n\u003C/p\u003E\n\u003Cp\u003E\nDay began yesterday with some refueling mass driver shots - the \u003Cem\u003ESouth Base\u003C/em\u003E outpost near \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E shot monopropellant, liquid fuel and oxidizer to space station \u003Cem\u003EKerbinport\u003C/em\u003E (taking the opportunity to do so while there weren\u0027t any planes parked there) and to LSV \u003Cem\u003EHouse Corrino\u003C/em\u003E recently returned from the initial exploration missions of Dres. \u003Cem\u003ESouth Base\u003C/em\u003E also shot up some replacement Rocket Parts to \u003Cem\u003ECorrino\u003C/em\u003E; the ship had pretty much used up its entire supply in the printing of five probes while still at Dres. Resupplied, \u003Cem\u003ECorrino \u003C/em\u003Eprinted up a\u003Cem\u003E G-LOC 7a\u003C/em\u003E return-to-Kerbin craft for the next phase of exploration; construction time was estimated at 23 minutes and 34 seconds, which decreased to about twenty minutes once engineer Necale Kerman transferred from her seat aboard \u003Cem\u003EG. Grant \u003C/em\u003Edocked to \u003Cem\u003ECorrino \u003C/em\u003Eand resumed her post in one of \u003Cem\u003ECorrino\u0027s \u003C/em\u003EBigby workshops. When completed, monopropellant was transferred aboard and the \u003Cem\u003EG-LOC\u003C/em\u003E was released; it promptly maneuvered to dock at one of \u003Cem\u003ECorrino\u0027s \u003C/em\u003Ecenterline ports. \u003Cem\u003ECorrino \u003C/em\u003Ethen began the print of a \u003Cem\u003ETBD 7e Mun\u003C/em\u003E base-seeding rover/lander, with total construction time estimated at 8.5 hours. This craft will ultimately be responsible for the creation of the upcoming Dres outpost. Speaking of which, I went ahead and put the target coordinates I\u0027d gathered over the Thanksgiving break for the Dres outpost into Waypoint Manager and was able to verify visually that I\u0027d gotten them input correctly this time (avoiding the 850 kilometer debacle I had with the \u003Cem\u003EUsumacinta \u003C/em\u003Ebase on Tylo...). With the \u003Cem\u003ETBD \u003C/em\u003Eunder construction, I finally got over to SL \u003Cem\u003EShai Hulud\u003C/em\u003E in \u003Cabbr title=\u0022High Kerbin Orbit\u0022\u003EHKO\u003C/abbr\u003E to transfer Alcubierre Drive fuel supplies - Xenon Gas and Exotic Matter - to \u003Cem\u003ECorrino \u003C/em\u003Evia mass driver, and after ordering up a new \u003Cem\u003EScanSat \u003C/em\u003Efor Mun at the\u003Cem\u003E Non Caseus Yards\u003C/em\u003E in orbit (the old one - a \u003Cem\u003E\u003Cstrong\u003Every\u003C/strong\u003E\u003C/em\u003E old design - had no M4435 narrow-band scanners installed and therefore couldn\u0027t give me specific biome readings), I finally made it over to \u003Cem\u003ERogue 7\u003C/em\u003E to do some driving.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XPp6jYQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/XPp6jYQ.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u0022Squishy things\u0022. Kind of a vague warning - does it mean that there are squishy things in it, or things that are squishy should stay out of it? Can\u0027t imagine it\u0027d work too well with fuel refining if there were squishy things in it...\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMade it all of 11.4 kilometers before I had to shut the game down for the day.\n\u003C/p\u003E\n\u003Cp\u003E\nThis morning I have had some time to play - I went ahead and ordered up a \u003Cem\u003EHellhound 7 \u003C/em\u003Erover aboard LSV \u003Cem\u003EHouse Harkonnen\u003C/em\u003E currently in \u003Cabbr title=\u0022High Kerbin Orbit\u0022\u003EHKO\u003C/abbr\u003E; it\u0027ll be done in 7.75 hours. The idea is to have the rover available for an initial scouting survey of the target region on Dres - the hope is to put the base there fairly close to a Highlands/Midlands boundary so that going to get Exotic Minerals (absent in Highlands but present in Midlands) won\u0027t be too big of a hassle. I also finally got around to printing up and reinstalling a new Rangeland launch pad at \u003Cem\u003EUsumacinta\u003C/em\u003E; the old pad was destroyed during last week\u0027s launch of the \u003Cem\u003ENomina Perplexa Yards\u003C/em\u003E. That done, it was back to driving - \u003Cem\u003ERogue 7 \u003C/em\u003Edid another 7.5 kilometers before I once again had to shut the game off (this time to start doing my paying job of course), but for the hell of it I decided to have scientist Stadous Kerman EVA from the rover and jetpack ahead until he could find the equatorial Midlands. He was able to do so before running out of jetpack fuel and took the opportunity to use Kerbal Konstructs to Plowshare the target site into level-grade goodness. \u003Cem\u003ERogue 7\u003C/em\u003E doesn\u0027t have all that much further to go as it turns out.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xJFf2WE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xJFf2WE.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EJust one serious into-a-crater-on-Mun cliff between here and there. No problem, right?\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo my priority today is to finish \u003Cem\u003ERogue 7\u0027s \u003C/em\u003Edrive - it\u0027s got 6.6 kilometers to go before meeting up with Stadous and there\u0027s a nice flat region already set up there. It is at the bottom of a crater (which has the potential to cause headaches of course), but I should be okay as long as I drive carefully. Kinda miffed that I missed the mark by a mere 25 klicks, but on the other hand, that could be a lot worse (850 klicks on Tylo was one thing but 850 on Mun would\u0027ve been cause for me putting a discount brick through someone else\u0027s laptop, methinks). I should also have the new Mun \u003Cem\u003EScanSat \u003C/em\u003Eready before too long; it\u0027d be nice to get some better readings for Mun although if I find a more suitable biome for base-building in the process I\u0027m liable to be quite angry about it. \u003Cem\u003ECorrino \u003C/em\u003Eand \u003Cem\u003EHarkonnen\u003C/em\u003E should be able to finish up their respective prints today as well, and so they should both be heading to Dres in the very near future. Not much else going on at the moment; I have a new tourist expedition to get under way, I have some ore hauling to do at Duna, a seismic survey at Eve and some science to collect from Laythe - all of which I have yet to get started. Still got a probe heading to its target orbit over Dres, still have to replace the one I screwed up out there, still need to get another engineer out to Vall, still tracking asteroids and still got four colonization missions already stewing. Hope to have more to report for y\u0027all tomorrow.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-03T18:00:10Z\u0022 title=\u002212/03/2019 06:00  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 3, 2019\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Retro Starship","CreatedById":200667,"CreatedDateTime":"2019-12-03T15:15:07Z","Content":"\n\u003Cp\u003E\n(1.8.1) Nothing too extreme last night other than 4 contracts done at once. Jeb did a parachute, a protective shell, launched a flea booster and tested a decoupler.\n\u003C/p\u003E\n\u003Cp\u003E\nHmm Jeb is an OK kerbonaut but it seems Valentina always does more and has better success! What is it about that girl?\u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Jebstask1.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.32\u0022 height=\u0022612\u0022 width=\u0022982\u0022 src=\u0022http://u.cubeupload.com/Saturn5tony/Jebstask1.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-03T15:15:51Z\u0022 title=\u002212/03/2019 03:15  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 3, 2019\u003C/time\u003E by Saturn5tony\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NHunter","CreatedById":190849,"CreatedDateTime":"2019-12-03T22:18:14Z","Content":"\n\u003Cp\u003E\nI\u0027ve launched a satellite to collect precious Graviolium from Rhode\u0027s orbit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aj5paonunw3v5jjzg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022http://www.mediafire.com/convkey/1efc/aj5paonunw3v5jjzg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso used this craft to test a new engine layout with 4 Thor-tech aerospikes in NFA radial engine pods attached to an upside-down Kerbodyne ADTP-2-3 fuel tank. Actually quite workable design when you need a 3.75m (collector) satellite with engines that don\u0027t get in your way when you try to dock with it.\n\u003C/p\u003E\n"},{"CreatedByName":"Ratwerke_Actual","CreatedById":189744,"CreatedDateTime":"2019-12-03T22:51:49Z","Content":"\n\u003Cp\u003E\n[JNSQ] Rendesvous and careful approach... 600m diameter Glimmeroid.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224bnl9qwfxh241.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.redd.it/4bnl9qwfxh241.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Triop","CreatedById":145841,"CreatedDateTime":"2019-12-04T01:04:56Z","Content":"\n\u003Cp\u003E\nToday, we play. \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/z6obZIyoNYo?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nNow on KerbalX:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Triop/RC-Tamiya-Grasshopper\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Triop/RC-Tamiya-Grasshopper\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-04T03:39:52Z\u0022 title=\u002212/04/2019 03:39  AM\u0022 data-short=\u00224 yr\u0022\u003EDecember 4, 2019\u003C/time\u003E by Triop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nelso","CreatedById":105793,"CreatedDateTime":"2019-12-04T02:10:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223711234\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221575034806\u0022 data-ipsquote-userid=\u0022184648\u0022 data-ipsquote-username=\u0022putnamto\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/29/2019 at 5:40 AM, putnamto said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthen tried to figure out why it crashes every 10-15 minutes for an hour\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI had problems with scatterer crashing in 1.7.3.  Removed it and haven\u0027t had any crashes since.\n\u003C/p\u003E\n"},{"CreatedByName":"nelso","CreatedById":105793,"CreatedDateTime":"2019-12-04T09:38:35Z","Content":"\n\u003Cp\u003E\nDid a bunch of missions in the Jool system.  I used the nuclear engines and I can\u0027t say I\u0027m too fond of them, although they served their purpose and let me be lazy in maneuver planning.  My main vehicle was a modification of one I landed on Tylo, so it had all the bells and whistles.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220OvlfR8.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022107.95\u0022 height=\u0022353\u0022 width=\u0022327\u0022 src=\u0022https://i.imgur.com/0OvlfR8.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch vehicle \u0026amp; staging.  It\u0027s a mammoth engine and 8 kickback SRBs.  My final launch had nosecones on the SRBs which stopped them from colliding with things upon decoupling.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227vewQxV.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022117.55\u0022 height=\u0022768\u0022 width=\u0022653\u0022 src=\u0022https://i.imgur.com/7vewQxV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OijtwnE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002241.48\u0022 height=\u0022424\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/OijtwnE.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA decoupler on a structural support on the fairing was the attachment method I used.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226S48Sml.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002246.65\u0022 height=\u0022477\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/6S48Sml.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBop refeuling after Pol.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KiHdPYI.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KiHdPYI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSome of a Bop -\u0026gt; Tylo -\u0026gt; Laythe capture maneuvers.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DfTYGMj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022104.67\u0022 height=\u0022673\u0022 width=\u0022643\u0022 src=\u0022https://i.imgur.com/DfTYGMj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMy exit out of Jool \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E using Tylo (this is probably not the best way to gravity assist).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LBTDkBX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002265.80\u0022 height=\u0022673\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/LBTDkBX.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nComing back to kerbin and burned about 5000 delta v slowing down (due to not planning too well - initially I came in at 5700m/s and needed almost a 20 minute burn to slow down), but at least the mission was faster for the kerbals.  I had plenty of delta v, was able to land and got lots of funds, like 2-3 million.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Lb6tvNt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002266.23\u0022 height=\u0022504\u0022 width=\u0022761\u0022 src=\u0022https://i.imgur.com/Lb6tvNt.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Okhin","CreatedById":201182,"CreatedDateTime":"2019-12-04T12:07:35Z","Content":"\n\u003Cp\u003E\nHad an \u0022interesting\u0022 startup of my Minmus base in my carreer with Snacks\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022201182\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed7343959661\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/189943-18x-progressive-union-of-neo-kerbals/\u0026amp;tab=comments\u0026amp;do=embed\u0026amp;comment=3710883\u0026amp;embedComment=3710883\u0026amp;embedDo=findComment#comment-3710883\u0022 style=\u0022height:268px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nTL;DR: Planning mission at 2am is bad for my kerbals. Also, I need to give them more breethable air.\n\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2019-12-04T15:20:38Z","Content":"\n\u003Cp\u003E\n(1.6.1) Fairly good past 24 hours to report to y\u0027all this morning. Screenie-heavy post with relatively little other substance ahead; fair warning.\u003Cbr\u003E\u003Cbr\u003E\nThe day began with the \u003Cem\u003ERogue 7\u003C/em\u003E base-seeding rover on Mun, which had (as reported at the end of my last post) sent out scientist Stadous Kerman to find the boundary between the Munar equatorial Lowlands and the Midlands; Stadous had found it about 6.5 kilometers ahead. \u003Cem\u003ERogue 7\u003C/em\u003E proceeded as carefully as possible to Stadous\u0027s position, a drive made more interesting by the fact that it was already known that Stadous was at the bottom of a crater...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022d2Z678o.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/d2Z678o.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EThis is not the sort of thing you really want to see when you\u0027re driving a fifty tonne rover...pretty much anywhere......\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAside from one end-over-end flip which I was able to recover (for a tonne of bonus points in games that are not KSP), no mishaps occurred and soon the rover arrived at Stadous\u0027s location. Engineer Linbo Kerman got out of the rover and began unpacking the equipment, beginning the construction of the \u003Cstrong\u003E\u003Cem\u003EBoot Hill\u003C/em\u003E\u003C/strong\u003E outpost on Mun.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VXilJGv.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/VXilJGv.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EAttach an upchuckwagon to the side of the rover, move all the garbage over there, grab the Saddle and Pondy, hook it up. Simple as pie - the beginnings of a new base.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLinbo attached and inflated the stowed Casa module along with three Haciendas and three of the four Chuckwagons, and Stadous helped with the installation of four of the six stowed SAFER reactors before boarding the new outpost. Engineer Giller Keman and scientist Roddon Kerman also boarded at that point, after which the remaining Equipment resources were transferred over and Linbo detached the new outpost from rover and stowed all the parts used for the initial base establishment.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gPWLkvl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/gPWLkvl.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EBase establishment is fun (at least to me). It\u0027s even better when you get paid for it...\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLinnbo went ahead and moved the rover\u0027s Micro \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E unit to the base and that point and attached a few exterior lights, another Casa unit and the remaining two SAFER reactors (with Stadous\u0027s help once again). Base construction continued throughout the day yesterday and into this morning.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cimg alt=\u00223OIVDwO.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/3OIVDwO.png\u0022\u003E\u003C/em\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003EBoot Hill\u003Cem\u003E\u003Cem\u003E \u003C/em\u003Eoutpost on Mun as it looks as of this morning.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWith no Exotic Minerals at the site, the plan is to forego the presence of anything that requires them for structure construction - so no lab modules, ground transmitter or central Castillo hub. I do have the Rangeland launch pad that came with the rover; god willing I either never have to use it as a launch pad or, assuming I do, nothing blows it up. Won\u0027t be able to build a new one without an infusion from somewhere else...\n\u003C/p\u003E\n\u003Cp\u003E\nWhile base construction proceeded, I got notice from the \u003Cem\u003ENon Caseus Yards \u003C/em\u003Ein Munar orbit that the print of \u003Cstrong\u003E\u003Cem\u003EScanSat Mun-2\u003C/em\u003E\u003C/strong\u003E was complete. After fueling, the new probe was released and immediately burned for a polar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tiGXNSX.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/tiGXNSX.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003E2° to 90°? No problem. Helps that the shipyard is already oriented in the correct direction.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe new \u003Cem\u003EScanSat \u003C/em\u003Eburned to an initial 100 by 24.6 kilometer orbit at 90.00° inclination, later burning to 101.8 by 100.4 kilometers. I got some confusing readings at first - I thought I\u0027d detected Exotic Minerals in the Lowlands at first and started to get excited for \u003Cem\u003EBoot Hill\u003C/em\u003E - maybe I could build a normal base after all. Alas, the readings I picked up were for the Midland Craters; the closest of those was fifty kilometers away in either direction (but I could\u0027ve done it had I\u0027d driven \u003Cstrong\u003Ewest \u003C/strong\u003Efrom \u003Cem\u003ERogue 7\u0027s\u003C/em\u003E original landing point instead of \u003Cstrong\u003Eeast\u003C/strong\u003E).\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00225xVIaXL.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002254.17\u0022 height=\u0022554\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5xVIaXL.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EBreaks my heart...and annoys me that it took me four days to drive 25 kilometers in the first place...\u003C/em\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nStill, it was enough for me to get Stadous out to go verify the reading.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022426FCML.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/426FCML.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EPlenty of reasons why the base isn\u0027t 500 meters further east, boss...\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter Stadous returned to the base, it was time for me to conduct an alignment burn for the \u003Cem\u003EBoop Boop 7x \u003C/em\u003Eprobe over Dres; the burn put the node over the apoapsis. The probe is still fifteen degrees off the target orbit but at this point I should be able to take care of the rest of it and circularize at the same time. The probe will not reach apoapsis for another 105 hours though, so that\u0027s a while off.\n\u003C/p\u003E\n\u003Cp\u003E\nI noted that my \u0022midpoint\u0022 alarm to check in with LSV \u003Cem\u003EHouse Corrino\u003C/em\u003E in high Kerbin orbit had gone off while I was fiddling with the probe, so I went straight to \u003Cem\u003ESouth Base\u003C/em\u003E and transferred up a full load of Rocket Parts via mass driver. Going to \u003Cem\u003ECorrino \u003C/em\u003Eto verify delivery of the payload, however, I discovered that rather than having four more hours of construction ahead, the ship\u0027s crew had finished the \u003Cem\u003ETBD 7e Mun\u003C/em\u003E base-seeding rover/lander they were building; I happily mashed the button to finalize the construction.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022y4j3cNh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/y4j3cNh.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EGas up and then it\u0027s time to head to Dres.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI still need to send up the remaining supplies to \u003Cem\u003ECorrino\u003C/em\u003E, but once that\u0027s done the ship can depart for Dres once more. I\u0027m still waiting for LSV \u003Cem\u003EHouse Harkonnen\u0027s\u003C/em\u003E crew (i.e. just engineer Beamon Kerman right now) to complete her build of a \u003Cem\u003EHellhound 7 \u003C/em\u003Erover to scout the intended target area on Dres - that\u0027s still a little under five hours off. Once that\u0027s done, though, the process of the first landing on Dres and outpost construction there will commence.\n\u003C/p\u003E\n\u003Cp\u003E\nToday I plan to continue building out \u003Cem\u003EBoot Hill \u003C/em\u003Eand, if construction finishes, to send my two warp ships out to Dres. I\u0027ll likely wrap things up at \u003Cem\u003EBoot Hill \u003C/em\u003Ebefore switching gears to Dres. Warps and building a base (possibly two bases) should keep me plenty busy for the foreseeable future; I\u0027ll worry about all the other stuff later and let y\u0027all know how everything goes tomorrow.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-04T16:02:30Z\u0022 title=\u002212/04/2019 04:02  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 4, 2019\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003Cbr\u003Ehad another screenie to add...\n\u003C/span\u003E\n"},{"CreatedByName":"NHunter","CreatedById":190849,"CreatedDateTime":"2019-12-04T21:56:55Z","Content":"\n\u003Cp\u003E\nToday I got my steam install to work and then experimented a bit with KFS:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022l74tnuky9oebuspzg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022http://www.mediafire.com/convkey/5b1d/l74tnuky9oebuspzg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cem\u003E\u0022Upwards bound\u0022\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2019-12-04T22:16:33Z","Content":"\n\u003Cp\u003E\nJust been working on my career - a Duna probe just arrived, and I finished testing the nearly acquired 2.5m launch vehicles.  Full report \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/189821-out-of-the-sands/\u0026amp;do=findComment\u0026amp;comment=3713377\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224FKpzu7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.47\u0022 height=\u0022578\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/4FKpzu7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn-flight abort test of 2.5m pod\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225a69SvK.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002254.84\u0022 height=\u0022561\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5a69SvK.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFlight test of full Girrok launch vehicle with empty pod\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yhRe4Di.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002260.02\u0022 height=\u0022614\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/yhRe4Di.png?1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kapteenipirk","CreatedById":141386,"CreatedDateTime":"2019-12-04T23:16:57Z","Content":"\n\u003Cp\u003E\nPlanning on turning this into a 3D printable model similar to the \u0022Barnstormer\u0022 cropduster.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EKTP-715 Falcon\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022JAvQPLa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/JAvQPLa.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n(whoops, forgot to remove the RAF stripes from the tail when i changed the roundels to US ones)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u002205notNB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/05notNB.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022PSiGkY9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/PSiGkY9.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWanted to create something in style of the Super Constellation and the DC-6.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s part of the same family of protected transport planes as the Raven, and was actually created around a modified version of it\u0027s custom cockpit.\n\u003C/p\u003E\n\u003Cp\u003E\nThis particular aircraft has been outfitted as a navy Airborne Early Warning aircraft.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIm putting this here, as i don\u0027t know if im gonna be properly releasing this one.\n\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2019-12-04T23:35:59Z","Content":"\n\u003Cp\u003E\nWith a goodly amount of data and samples recovered from Minmus, mission control decides that it might be time to set our sights on other targets.\n\u003C/p\u003E\n\u003Cp\u003E\nOr, well... one more. The mossy boulders have been preying on everyone\u0027s mind, and even though nobody can be bothered going back to tackle them kermanually, the engineering team was able to put together a micro-probe to do the job. Sadly it turns out that the moss is mineral deposits. A lovely green mineral, but only a mineral. An inedible one at that.\n\u003C/p\u003E\n\u003Cp\u003E\nFollowing on from this tiny lander, we send another tiny lander to another planet entirely; Dunamite enters Dunan orbit. Leaving it\u0027s relay stage at high altitude with barely a whiff of fumes left in the tank, the little probe drops to a lower orbit and prepares for descent.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile back on kerbin, our engineers have discovered a powerful new way of fitting bulky objects into rocket fairings. They tell us these strange devices are called \u0027hinges\u0027 and they will soon solve all our problems.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#999999;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E(To be honest, the new robotic parts aren\u0027t exactly perfect. The arms really didn\u0027t want to deploy symmetrically, and a lot of manual toggling of autostruts was required before they finally locked straight. I\u0027d sort of hoped this sort of thing would have been polished out by now, but ok, we\u0027ll work with it. It seems like there are workarounds and fiddles to get things to behave properly if you\u0027re patient.)\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RXOFKWA.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/RXOFKWA.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYet another instalment of the Mundog series is launched, first saying a quick hello to Pielab in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E because apparently the newspapers thought that would be cool, and then swiftly heading for Mun itself.\n\u003C/p\u003E\n\u003Cp\u003E\nThe original plan had been to send a fuel delivery to Pielab Station once it reached munar orbit, but since the ascent stage turned out to be a viable transfer stage, a robotic fuel tanker was instead dispatched to refuel it. No sense sending additional fuel cans when there are already some attached.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pYwRoRZ.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/pYwRoRZ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce both Pielab and Mundog V were in position, the lander made a brief but fruitful descent into the Mun\u0027s Twin Craters biome, setting up a surface experiment package and gathering useful data for return to the station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022color:#999999;\u0022\u003E(While I have historically tended to tap every biome on every body, I\u0027m not going to be doing that with this career. My tech tree is much simpler, and I just don\u0027t need to be maximising my science returns. Current plans are to land in the major craters that fall under Pielab\u0027s equatorial orbit.)\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-04T23:39:42Z\u0022 title=\u002212/04/2019 11:39  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 4, 2019\u003C/time\u003E by eddiew\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Triop","CreatedById":145841,"CreatedDateTime":"2019-12-05T03:45:02Z","Content":"\n\u003Cp\u003E\nToday, Jeb found the fireworks we bought for new year....\u003Cimg alt=\u0022\u0026lt;_\u0026lt;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_dry.png\u0022 title=\u0022\u0026lt;_\u0026lt;\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022ubevMZC.png\u0022 src=\u0022https://i.imgur.com/ubevMZC.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022U0eDqP6.png\u0022 src=\u0022https://i.imgur.com/U0eDqP6.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2019-12-05T06:41:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223713532\u0022 data-ipsquote-contentid=\u002227292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221575517502\u0022 data-ipsquote-userid=\u0022145841\u0022 data-ipsquote-username=\u0022Triop\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Triop said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nToday, Jeb found the fireworks we bought for new year....\u003Cimg alt=\u0022\u0026lt;_\u0026lt;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_dry.png\u0022 title=\u0022\u0026lt;_\u0026lt;\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAKA \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/145841-triop/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022145841\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/145841-triop/\u0022 rel=\u0022\u0022\u003E@Triop\u003C/a\u003E \u003Cem\u003ECubed\u003C/em\u003E, more bang for your bucks! \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"aagun123","CreatedById":153929,"CreatedDateTime":"2019-12-05T11:30:04Z","Content":"\n\u003Cp\u003E\ngive up on 181 and back to 173 today\n\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2019-12-05T12:49:55Z","Content":"\n\u003Cp\u003E\n(1.6.1) I got the shortest log entry I\u0027ve had in quite some time. Basically, aside from LSV \u003Cem\u003EHouse Harkonnen\u003C/em\u003E in \u003Cabbr title=\u0022High Kerbin Orbit\u0022\u003EHKO\u003C/abbr\u003E finishing up its print of the \u003Cem\u003EHellhound 7\u003C/em\u003E rover and a pair of refueling mass driver shots from the \u003Cem\u003ESouth Base\u003C/em\u003E outpost near \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to \u003Cem\u003EHarkonnen \u003C/em\u003Eand LSV \u003Cem\u003EHouse Corrino\u003C/em\u003E (fuel to both, Material Kits to \u003Cem\u003ECorrino \u003C/em\u003Eand Rocket Parts to \u003Cem\u003EHarkonnen\u003C/em\u003E), I spent the entire day working on the nascent \u003Cem\u003EBoot Hill\u003C/em\u003E outpost on Mun. I\u0027m happy to report as of this morning that construction of the base is 100% complete after nine in-game days.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cimg alt=\u00226VBt9h7.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/6VBt9h7.png\u0022\u003E\u003C/em\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003EBoot Hill \u003Cem\u003Eoutpost on Mun.\u003C/em\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nTold y\u0027all yesterday that this was liable to keep me plenty busy, and I was right...\n\u003C/p\u003E\n\u003Cp\u003E\nSo, both \u003Cem\u003ECorrino \u003C/em\u003Eand \u003Cem\u003EHarkonnen \u003C/em\u003Eare ready to head to Dres and that\u0027ll be my focus for today. \u003Cem\u003EHarkonnen\u0027s\u003C/em\u003E rover will scout an area I\u0027ve pre-selected for a base on the surface and if all looks good, \u003Cem\u003ECorrino\u003C/em\u003E will be supplying the rover/lander. That\u0027s liable to take care of things today. I did also manage to finish one of the colonization missions I\u0027ve got ongoing yesterday so I\u0027ll probably be replacing it in the near future, and then I should probably turn my attention back to getting contracts finished up. Lost a fair amount of time there with \u003Cem\u003EBH\u0027s\u003C/em\u003E construction...\u003Cbr\u003E\u003Cbr\u003E\nI hope to have something more substantial for y\u0027all tomorrow.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-05T14:29:44Z\u0022 title=\u002212/05/2019 02:29  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 5, 2019\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Retro Starship","CreatedById":200667,"CreatedDateTime":"2019-12-05T15:55:23Z","Content":"\n\u003Cp\u003E\n(1.8.1) Man I love this game. Now I got some real stuff happening!\n\u003C/p\u003E\n\u003Cp\u003E\nA bit disappointing but as we know from some real rocket launches things can go wrong. Had 2 career tasks to do. \n\u003C/p\u003E\n\u003Cp\u003E\n1) Get into orbit to test a protective shell.\n\u003C/p\u003E\n\u003Cp\u003E\n2) Land into a splashdown area for a minor decoupler test. (very easy)\n\u003C/p\u003E\n\u003Cp\u003E\nGot the shell done with a very nice orbit at 330,000m or so (as was needed by the contract) Then...\n\u003C/p\u003E\n\u003Cp\u003E\nBANGG!!! Was doing a re-entry maneuver back into a nice place near the ocean for the last test and my engine MALFUNCTIONED! Had at least 20% more of fuel as well to do it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Malfunction22.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022111.02\u0022 height=\u0022423\u0022 width=\u0022381\u0022 src=\u0022http://u.cubeupload.com/Saturn5tony/Malfunction22.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFortunately the maneuver just got below the 70km area before it stopped, so I was able to get Val home but only into a land area, not the ocean as I was planning for the last test. I had enuff fuel to pick anywhere really but no... it.... stopped.\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the mission.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Malfunction0.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022http://u.cubeupload.com/Saturn5tony/Malfunction0.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Malfunction1.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.17\u0022 height=\u0022564\u0022 width=\u00221024\u0022 src=\u0022http://u.cubeupload.com/Saturn5tony/Malfunction1.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n1st time ever seeing a yellow engine! I knew I was trouble...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Malfunction3.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.36\u0022 height=\u0022566\u0022 width=\u00221024\u0022 src=\u0022http://u.cubeupload.com/Saturn5tony/Malfunction3.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGot Val home, but not near any splashdown area but only on land. No problem, I did it later for the TT38 decoupler but like in real life, parts can go bad, especially rocket related ones. It could have been worse. Val could have been (lost in space)!\n\u003C/p\u003E\n"},{"CreatedByName":"Triop","CreatedById":145841,"CreatedDateTime":"2019-12-05T23:16:27Z","Content":"\n\u003Cp\u003E\nToday, we\u0027ve set a new record on the Kerbal 1 race track. \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/fZmcmipnYMw?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Mars-Bound Hokie","CreatedById":192121,"CreatedDateTime":"2019-12-06T07:34:01Z","Content":"\n\u003Cp\u003E\nI sent 12 different spacecraft to three different places in my career save.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022V3dYpoU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002257.11\u0022 height=\u0022562\u0022 width=\u0022984\u0022 src=\u0022https://i.imgur.com/V3dYpoU.png\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n6 TO DUNA\n\u003Cul\u003E\u003Cli\u003E\nSmall tourist transport destined for Jool\n\u003Cul\u003E\u003Cli\u003E\nMaking a refueling stop at Ike\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nLarge docking-capable tourist transport\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/186703-the-neptune-mission-files/\u0026amp;do=findComment\u0026amp;comment=3708514\u0022 rel=\u0022\u0022\u003ENeptune IV\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nMass ore transport\n\u003Cul\u003E\u003Cli\u003E\nCan hold up to 1500 units of ore.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n35-person surface outpost for Ike\n\u003C/li\u003E\n\u003Cli\u003E\nModule to expand a space station.\n\u003Cul\u003E\u003Cli\u003E\nPURPOSE: to make it easier for large planes to dock with the station.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n3 to Jool\n\u003Cul\u003E\u003Cli\u003E\nAerial Probe\n\u003C/li\u003E\n\u003Cli\u003E\nMass ore transport for Vall\n\u003Cul\u003E\u003Cli\u003E\nNecessary to refuel Poseidon-class planes since their \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E is too low for that moon.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/186703-the-neptune-mission-files/\u0026amp;do=findComment\u0026amp;comment=3710640\u0022 rel=\u0022\u0022\u003ELaythe surface outpost\u003C/a\u003E\n\u003Cul\u003E\u003Cli\u003E\nNot pictured since, at the time the picture was taken, the Laythe surface base hadn\u0027t made its escape burn yet.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n3 to Eve\n\u003Cul\u003E\u003Cli\u003E\nSpace Station (for contract)\n\u003C/li\u003E\n\u003Cli\u003E\nModule to expand a space station\n\u003Cul\u003E\u003Cli\u003E\nSame design as the one heading for Duna\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nStandby Gilly lander\n\u003Cul\u003E\u003Cli\u003E\nNo way I\u0027m risking a bouncy refueling for that plane.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-06T15:34:32Z\u0022 title=\u002212/06/2019 03:34  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 6, 2019\u003C/time\u003E by Mars-Bound Hokie\u003C/strong\u003E\n\u003Cbr\u003EForgot to mention that it was in Career Mode\n\u003C/span\u003E\n"},{"CreatedByName":"nelso","CreatedById":105793,"CreatedDateTime":"2019-12-06T07:37:48Z","Content":"\n\u003Cp\u003E\nDid a mission to test the Vector engine landed on minmus.  I used this funny looking craft which took off with 2 kickback boosters strapped to it.  Coming back from minmus was where it got interesting, since I had only 200 m/s delta v in orbit of minmus which isn\u0027t enough to get back to Kerbin directly, so I used a mun gravity assist to get into a low kerbin orbit, so it took about 110 m/s instead of 300 m/s.  Unfortunately due to bad time warps I had to revert it, but I got screenshots.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WaDdKFb.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/WaDdKFb.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUsing mun to get to kerbin since I had almost no delta v.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xlzzKCh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xlzzKCh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"putnamto","CreatedById":184648,"CreatedDateTime":"2019-12-06T14:10:18Z","Content":"\n\u003Cp\u003E\nSet up a mun comnet,  watched it fall apart,  learned up on orbital periods,  set up a kerbal comnet right outside minmus.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFinally got to actually fly to minmus for the first time on this save,  took bill,  Bob and octo.  Set up some ground science,  did a lot of orbital science. \n\u003C/p\u003E\n\u003Cp\u003E\nOn the way home I realized 31km was to low for a re-entry and decoupled the pod moments before it all blew up,  thankfully the science was in the pod,  earning me 930sci. \n\u003C/p\u003E\n\u003Cp\u003E\nTomorrow is going to be like christmas on kerbin,  I\u0027m finally going to get those bigger boosters that jeb\u0027s been hinting at all year\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOh and I found out goo cans that aren\u0027t attached to your ship can still be scienced and collected \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-06T14:13:03Z\u0022 title=\u002212/06/2019 02:13  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 6, 2019\u003C/time\u003E by putnamto\u003C/strong\u003E\n\u003C/span\u003E\n"}]}