{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":748,"Articles":[{"CreatedByName":"TheGeekno72","CreatedById":151159,"CreatedDateTime":"2015-09-21T08:59:01Z","Content":"\n\u003Cp\u003EDestroyed two buildings with some missiles. and planes. and rockets. \\\u0027o\u0027/\u003C/p\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2015-09-21T09:02:08Z","Content":"\n\u003Cp\u003EWOW manek22 !\u003C/p\u003E\u003Cp\u003EYou keep the style of the \u0022Bunch Of Bananas\u0022, but with a lot of very good improvments ideas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECongrat\u0027s !\u003C/p\u003E\n"},{"CreatedByName":"manek22","CreatedById":99501,"CreatedDateTime":"2015-09-21T09:07:18Z","Content":"\n\u003Cp\u003EThanks! I toyed with about ever engine and finally said screw it, it\u0027ll be a 2 stage system. I just wanted better fuel consumption in space but needed the thrust for lift off. Didnt want to drag around a 15 ton engine for nothing. Yours is still a better explorer. Mine is just to gas up the other ships.\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-09-21T09:49:41Z","Content":"\n\u003Cp\u003EToday I created this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.alternatehistory.com/lib/exe/fetch.php/timelines/acv.png?w=750\u0026amp;tok=07dcd3\u0022 alt=\u0022acv.png?w=750\u0026amp;tok=07dcd3\u0022\u003E\u003C/p\u003E\u003Cp\u003Ein KSP. I was always interested in the ACV of ETS but I never had a good enough cockpit or pod that could fit the bill, until it hit me like a brick that B9 had one almost exactly like it.\u003C/p\u003E\u003Cp\u003EAnd lo and behold, it actually works!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/3F6uQ\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, my landing struts did burn up during reentry (Somehow...) but after some config edits to make up for it it should presumably work as fully intended.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-09-21T10:05:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xebx\u0022 data-cite=\u0022xebx\u0022\u003E\u003Cdiv\u003EFast travel Mission to Eeloo is going well. (24000 m/s deltaV ship).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1 year 34 days to Eeloo... excellent mission, looking forward to the landing report \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BenG","CreatedById":150816,"CreatedDateTime":"2015-09-21T10:38:36Z","Content":"\n\u003Cp\u003EI\u0027ve been playing a bit with SSTO spaceplanes for shifting Cargo to LKO. I think I\u0027ve finally got the hang of it, and I\u0027ve got a plane that will deliver an Orange tank to LKO. After some sandbox testing, I loaded up my career save and headed to what\u0027s there so far of the new space station I\u0027m building in LKO.\u003C/p\u003E\u003Cp\u003EFirst up, an orange tank delivered to the KSS. Unfortunately due to a poor ascent, I had to rob a little fuel from the payload - but sucessfully docked it nonetheless to my space station. The second payload delivered was a hab module for the KSS. Once again, successfully delivered. I still need to tweak and play with the fuel loads required a bit - I have a habit of taking far too much oxidiser.\u003C/p\u003E\u003Cp\u003EAnd then to top it all off - a safe and successful landing on the KSC runway - I\u0027m definitely starting to get the hang of these spaceplanes!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/lMlUF\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2015-09-21T10:55:11Z","Content":"\n\u003Cp\u003ETested some power solutions for the future B.O.B. ISRU Explorer Mk2, finally 3 Big Fuel Cells seems to be the best way to go \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eabout 15 Days to fully refuel on Minmus !\u003C/p\u003E\u003Cp\u003EAnd no solar panels problems even if you are far away of Kerbol...\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-09-21T13:25:17Z","Content":"\n\u003Cp\u003EDidn\u0027t have a lot of time to play over the weekend. I got Jeb\u0027s \u003Cem\u003EStratofortress 7a\u003C/em\u003E craft refueled and affected a successful rendezvous and docking with the Kerbinport space station; I renamed the craft \u003Cem\u003EBockscar\u003C/em\u003E for good measure. Jeb swapped out his current compliment of tourists for a new load and they\u0027re back on their way out towards Minmus; they should arrive in 12 days. I also put a Ballista satellite around Kerbin for a contract; I should probably land its launch plane now...\u003C/p\u003E\u003Cp\u003EThe rest of my weekend got...reverted. I had a contract to go do some gravity readings about 150 klicks southwest of KSC and I designed a multi-mode rover to do the job. Naturally I got it going too fast when it hit the highlands and it nosed into the terrain. Did a revert...and it took me back to \u003Cem\u003EBockscar\u003C/em\u003E getting ready to make the transfer burn to Minmus. Facepalm moment there. Decided to decline that gravity reading contract the second time around and it was replaced with a \u0022haul crap from orbit\u0022 contract. The crap in this case turned out to be a Mk2 Lander Can, which wigged out my Claw when I freed the pivot point and caused the whole thing to snap off. That flight\u0027s been reverted to launch; I\u0027ll make another attempt at it hopefully tonight if possible.\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-09-21T14:23:34Z","Content":"\n\u003Cp\u003ESent a lander to my career Minmus station... and the station\u0027s docking fuselage suddenly exploded as I got within physics range. Again. Sigh. So, Kernne (who should have gone to the lab on the station) is now in the lander on the surface of the moon, and Valentina is still in the station awaiting a new one, or a rescue, or something. \u003C/p\u003E\u003Cp\u003EI think she was smoking in the docking tube, which being next to the monopropellant wasn\u0027t such a good idea. At least she\u0027s OK. You have any idea how much it costs to hire new Kerbonauts?\u003C/p\u003E\n"},{"CreatedByName":"-M-TheDoctor","CreatedById":141408,"CreatedDateTime":"2015-09-21T15:15:23Z","Content":"\n\u003Cp\u003EThe Kraken struck my career for the first time last night. I had a ore processing station in lunar orbit. I was preparing to send my first drilling team to the mun to complete a contract. I went to check on the crew onboard the refinery when it just went to bits! The science lab and the command module went in separate directions and all power supplies were destroyed in the explosion. 4 kerbals were now stranded in lunar orbit in a field of debris. A crack team of engineers quickly refitted the Excelsior 2 lunar lander for a new mission: rescue the stranded crew. Jeb launched flawlessly. He got into lunar orbit, but making the rendezvous proved difficult. After a lot of tinkering with the orbit, Jeb finally got close enough for the team in the command pod to EVA to the Excelsior 2. One kerbal was still in the science module. A retrograde burn put Jeb within 200 m of the doomed ship for a final EVA. Jeb and the Excelsior 2 returned to Kerbin uneventfully with an additional 4 kerbals for a an utterly perfect rescue. We can rebuild the lunar station. We can\u0027t replace kerbals.\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-09-21T15:21:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETheDoctor;2206875\u0027]The Kraken struck my career for the first time last night. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid your design by any chance involve structural fuselages or 2.whatever meter service bays?\u003C/p\u003E\u003Cp\u003EIt seems like we\u0027re having the same issues.\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2015-09-21T18:08:30Z","Content":"\n\u003Cp\u003EI put 4 full thrust F9 cores on the SLS.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Iu2yXtuYvAI?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2015-09-21T18:10:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pandaman\u0022 data-cite=\u0022pandaman\u0022\u003E\u003Cdiv\u003ETechnically \u0027today\u0027 is after midnight - so 2:30am counts right ?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMeh, I just give an update on what I have done since my last update, usually 2-3 a week depending on how much play time I get.\u003C/p\u003E\u003Cp\u003EManaged to get my Grand Tour vessel back to the low-delta-v domain of Gilly from Moho.\u003C/p\u003E\u003Cp\u003EAfter many burns, I finally decided I had to do my ejection burn using my nuclear engines, and using up a lot of that fuel might improve my acceleration using the VASMIR.\u003C/p\u003E\u003Cp\u003EAfter doing 80% of the ejection burn on nukes, I flipped the ship and finished up with the low-thrust VASMIR engine(now at 0.24 m/s/s instead of the 0.22 it was before I used all that liquid fuel)\u003C/p\u003E\u003Cp\u003EInclination burn, Eve Capture burn, all the way up to Gilly capture burn were done with the high-isp engines of the rescue vessel(VASMIR), then I refilled all the tanks from on-board ore and left the rescue probe in orbit of Gilly should there be a future need.\u003C/p\u003E\u003Cp\u003EA bit of refueling, refueling the Eve Scansat in orbit over Gilly(eve and Gilly both fully scanned now), and then I sent my Grand Tour vessel back towards Kerbin for it\u0027s triumphant return(with a fly-by of the mun for contract purposes)\u003C/p\u003E\u003Cp\u003EThen I sent my Eve scansat off towards Moho so that should I return I can find the lowland and canon biomes I did not see in my first visit.\u003C/p\u003E\u003Cp\u003E(Mk2 body with a single nuke engine, Mk2 drop-tanks with additional fuel on the sides. Drop-tanks(~5km/s) were enough to get to and scan Eve then head towards Gilly, so just kept them in place during the Gilly scan so the Grand Tour could refill the probe to the full ~12km/s and I could then send it off to Moho)\u003C/p\u003E\u003Cp\u003EOuter grand tour arrived at Duna and is now on an intercept course for the high-orbit rescue before heading over to Ike for the other rescue and a refuel stop.\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-09-21T18:27:19Z","Content":"\n\u003Cp\u003ERedesigned my lunar rocket for the fifth time before the launch that will take it to the Moon:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7ZxPybQ.png\u0022 alt=\u00227ZxPybQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EKickback for scale, and yes it is on the same plane as the rocket.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-21T18:30:38Z\u0022 title=\u002209/21/2015 06:30  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 21, 2015\u003C/time\u003E by Gaarst\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GarrisonChisholm","CreatedById":146403,"CreatedDateTime":"2015-09-21T18:31:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kuansenhama\u0022 data-cite=\u0022Kuansenhama\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://i.imgur.com/ztLdtAQ.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ztLdtAQ.png\u003C/a\u003E\u003Cp\u003EI have so many questions...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA new \u0027Big Bang\u0027 event obviously, as a quantum bubble expanded exponentially to create a new universe. ...or, a really lame graphics glitch.\u003C/p\u003E\n"},{"CreatedByName":"tf58","CreatedById":10899,"CreatedDateTime":"2015-09-21T19:30:51Z","Content":"\n\u003Cp\u003EAdding the standard gravitational parameters (G x mass) for all the Kerbol planets/moons as user defined constants for the scientific calculator app on my phone.\u003C/p\u003E\n"},{"CreatedByName":"Trann","CreatedById":83801,"CreatedDateTime":"2015-09-21T19:58:39Z","Content":"\n\u003Cp\u003EAfter putting satellites around everything I could (that was the easy part), I finally finished landing a probe on the surface of every body (save Jool and Kerbol, of course) this past weekend. Though it was fun watching the extra satellite (for balance) descend into the atmosphere of Jool.\u003C/p\u003E\u003Cp\u003EA few missions failed due to bad delta-v planning (I\u0027m looking at you, Moho and Tylo).\u003C/p\u003E\u003Cp\u003EOne succeeded despite its flawed design (landing on Eve intact and functional but upside down; I should post a picture, I suppose).\u003C/p\u003E\u003Cp\u003EThe most satisfying were Eeloo and Moho. Each were a horrible waiting game, attempting to hit them on AN/DN (for Eeloo) and AP (for Moho) to save delta-v.\u003C/p\u003E\u003Cp\u003EMy Jool satellite/probe delivery ship is the largest thing I\u0027ve built so far (mostly due to frame rate issues) and was also pretty satisfying because it\u0027s assembled in orbit (main body launch, 6 separate launches for probe attachment, refuelled and ready to go; again, I\u0027ll try to remember a picture tonight).\u003C/p\u003E\u003Cp\u003ENow, after a contract to mine X units of ore on Eeloo went far easier than expected (for my first mining op ever), I\u0027m working on designing a ship that can deliver an orbit-to-surface-to-orbit fuel processor for most moons. If that works, I may seriously consider a Jool-5 mission for the first time ever. Frame rate be damned.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-21T20:22:21Z\u0022 title=\u002209/21/2015 08:22  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 21, 2015\u003C/time\u003E by Trann\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"percyPrune","CreatedById":130676,"CreatedDateTime":"2015-09-21T21:05:12Z","Content":"\n\u003Cp\u003ETinkering around with landers to fit the Mk3 cargo bay in the QV III mothership (yup, the QV II went bang. The QV III only has room for 64 kerbals but now has 10,000m/s dV)) and doing test flights to the Mun. Aiming for 3500m/s dV to give a useful range.\u003C/p\u003E\u003Cp\u003EVersion 1. Interesting but unfortunately too long to fit the bay:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/sClOZB2\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/sClOZB2.png\u0022 alt=\u0022sClOZB2.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EVersion 2. Shorter and room for 4 kerbals:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/UmmaygI\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/UmmaygI.png\u0022 alt=\u0022UmmaygI.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EStowed for interplanetary flight:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/uY4EIkY\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/uY4EIkY.png\u0022 alt=\u0022uY4EIkY.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2015-09-21T21:31:07Z","Content":"\n\u003Cp\u003EI\u0027m planning on building a drill/fuel base on Duna so I can start a small (manned) plane and/or rover expedition on the surface of the planet to get all the science. Heck.. I may even try to circumnavigate the globe if I feel like it. However, I didn\u0027t have the cash to finance the upgrade of the scientific facilities in order to get to the drilling tech... So this evening I did an Ike 3 and Ike 4 flyby mission which would give me more than enough dough to get things going. I kinda over-engineered the delta-v budget, but I guess that\u0027s not the end of the world. \u003C/p\u003E\u003Cp\u003EFirst I flew by the Mun, followed by Minmus, Gilly, Ike and finally Duna, where I put the satellite in an poler orbit so I could it scan for resources. It was a nice and easy ride! Here are some pictures of the mission:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/scJTA\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E it\n"},{"CreatedByName":"hellblazer","CreatedById":131384,"CreatedDateTime":"2015-09-21T23:15:27Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/CPztzyNpiwA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-09-22T00:14:38Z","Content":"\n\u003Cp\u003ESent off another interplanetary mission, a little probe rover to Asclepius. And continued to milk the rewards of my Mun science station with another 500 science in about 60 days.\u003C/p\u003E\n"},{"CreatedByName":"Trann","CreatedById":83801,"CreatedDateTime":"2015-09-22T00:28:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trann\u0022 data-cite=\u0022Trann\u0022\u003E\u003Cdiv\u003EAfter putting satellites around everything I could (that was the easy part), I finally finished landing a probe on the surface of every body (save Jool and Kerbol, of course) this past weekend. Though it was fun watching the extra satellite (for balance) descend into the atmosphere of Jool.\u003Cp\u003EA few missions failed due to bad delta-v planning (I\u0027m looking at you, Moho and Tylo).\u003C/p\u003E\u003Cp\u003EOne succeeded despite its flawed design (landing on Eve intact and functional but upside down; I should post a picture, I suppose).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EForgot the engine and drained the fuel so the weight distribution was completely wrong which means I Kerbal so good.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i2.photobucket.com/albums/y4/PokerTrann/KSP/eve-lander_zps9bcdm3oj.jpg\u0022 alt=\u0022eve-lander_zps9bcdm3oj.jpg\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe most satisfying were Eeloo and Moho. Each were a horrible waiting game, attempting to hit them on AN/DN (for Eeloo) and AP (for Moho) to save delta-v.\u003Cp\u003EMy Jool satellite/probe delivery ship is the largest thing I\u0027ve built so far (mostly due to frame rate issues) and was also pretty satisfying because it\u0027s assembled in orbit (main body launch, 6 separate launches for probe attachment, refuelled and ready to go; again, I\u0027ll try to remember a picture tonight).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Mk I satellite drive required another launch to attach a solar panel array I forgot to build on the main body. The Mk II probe drive did not have these problems.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i2.photobucket.com/albums/y4/PokerTrann/KSP/jool-drives_zpslh2lbsw6.jpg\u0022 alt=\u0022jool-drives_zpslh2lbsw6.jpg\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENow, after a contract to mine X units of ore on Eeloo went far easier than expected (for my first mining op ever), I\u0027m working on designing a ship that can deliver an orbit-to-surface-to-orbit fuel processor for most moons. If that works, I may seriously consider a Jool-5 mission for the first time ever. Frame rate be damned.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Kokanee","CreatedById":93886,"CreatedDateTime":"2015-09-22T01:51:04Z","Content":"\n\u003Cp\u003ESpent the afternoon perfecting a swing-wing atmo fighter design.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0iHZ1Dr.jpg\u0022 alt=\u00220iHZ1Dr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iFooIhA.jpg\u0022 alt=\u0022iFooIhA.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWent wings are forward the COL moved forward to match the COM to make takeoffs/landings easier and improve maneuverability. When the wings sweep back drag is reduced and the COL moves behind the COM making the plane more stable, top speed goes up but at the expense of maneuvering.\u003C/p\u003E\n"},{"CreatedByName":"Aegeas","CreatedById":109879,"CreatedDateTime":"2015-09-22T02:38:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Val\u0022 data-cite=\u0022Val\u0022\u003E\u003Cdiv\u003EIf you mount the main landing sufficiently close to the CoM, so there\u0027s only minimal weight on the nose wheel, then it is still possible to steer, just barely, using the command pod reaction wheels, as long as you\u0027re not stationary. Maneuvering back to the runway is certainly doable. Turning on to the Taxiways, probably not.\u003Cp\u003EAnother bonus of this weight distribution, is that the gear can take much more punishment before buckling and veering off the runway, during take-off. Can launch a 400 t aircraft on a single pair of stock Heavy Landing Gear as mains and a Medium as nose gear (edit: with no struts used).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m guessing they will add lights and steering to the new wheels in coming updates, as for a work around for the steering problems for now - if you have two engines you can disable one and steer it like a tank, or just reduce the thrust on one.\u003C/p\u003E\n"},{"CreatedByName":"Dnaha","CreatedById":137983,"CreatedDateTime":"2015-09-22T03:30:47Z","Content":"\n\u003Cp\u003EAdded the Piosk module on the ISS as seen here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1qTe5Qt.jpg\u0022 alt=\u00221qTe5Qt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGoing to see if I can send more modules tonight.\u003C/p\u003E\n"}]}