{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":519,"Articles":[{"CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2015-01-04T23:02:56Z","Content":"\n\u003Cp\u003EI \u003Cem\u003Ewas\u003C/em\u003E going to put a rover on the MÃƒÂ¼n, but I realized that I had not set up a RT2 satellite network. I will be spending my the rest of today building one.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-01-04T23:16:46Z","Content":"\n\u003Cp\u003EOn the second try, landed on Tylo \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/qp7pkH\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm8.staticflickr.com/7571/16014091027_8309df001d_o.png\u0022 alt=\u002216014091027_8309df001d_o.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECloser lander shot: \u003Ca href=\u0022https://flic.kr/p/qDfeAb\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://flic.kr/p/qDfeAb\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMission album: \u003Ca href=\u0022https://flic.kr/s/aHsk35yz63\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://flic.kr/s/aHsk35yz63\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFlown in FAR\u002BDRE\u002BTACLS, and with my custom KIDS preset that gives the engines 85% of their normal Isp.\u003C/p\u003E\u003Cp\u003ENow to see if I can get off again! I may be a shade short on delta-V, but that\u0027s what the jetpack is for \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2015-01-04T23:35:12Z","Content":"\n\u003Cp\u003EI started my mission named Alpollo 13 (Alp from German Alptraum - nightmare) today. It\u0027s an orbital station based study of several biomes of the MÃƒÂ¼n (whenever there\u0027s a \u0022Plant a flag on the Mun\u0022 contract...). While some time ago I did a similar mission with an ion engine based lander, this time I went for a traditional chemical rocket design. The most expensive part to bring to mÃƒÂ¼nar orbit was the big orange fuel tank, which should contain sufficient fuel for landing 10 times. Sadly a little bit of fuel had to be wasted for docking it, but I\u0027m still optimistic that it will last for 10 landings at least.\u003C/p\u003E\u003Cp\u003EThe cool thing was, that I had two contracts for building new orbital stations, one for Kerbin, and one for the MÃƒÂ¼n. By launching the station core to low Kerbin orbit, the first contract was completed, and by bringing it to mÃƒÂ¼nar orbit the second one was done... \u003C/p\u003E\u003Cp\u003EWhile returning from the first landing of the mission, I stumbled across one of the easter eggs on the MÃƒÂ¼n. I\u0027ve been playing for quite some time now, but this is the first easter egg (not counting the island airfield) that I found.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003ELeaving Kerbin\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/1S89orM.jpg\u0022 alt=\u00221S89orM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFull station: The return shuttle isn\u0027t docked yet, but as the station is now, it can be moved using the nuclear engines mounted on the orange tank - their COT is more or less aligned with the stations COM.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/LYJqjF0.jpg\u0022 alt=\u0022LYJqjF0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst landing site\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/nLJXhLk.jpg\u0022 alt=\u0022nLJXhLk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBefore docking the lander again\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/UBdgmNx.jpg\u0022 alt=\u0022UBdgmNx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aofrCTF.jpg\u0022 alt=\u0022aofrCTF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EOff topic: Has the option to embed iframes been removed from the KSP forums? I couldn\u0027t embed the imgur album any more, yet I remember doing this previously...\u003C/p\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2015-01-05T00:02:16Z","Content":"\n\u003Cp\u003EPresenting the S4 Gunship, packing a pair of HEKV void-combat missiles and two fully gimballed 30mm chain guns. A flight crew of two are safely housed in rear-mounted cockpit, and a further six can be carried in the mid-mounted crew tank, for any rapid deployment needs.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/tCnrG\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ELots of B9, plus the optional B9 Mk1 inline cockpit, BahmutoD\u0027s Armory and Adjustable Gear, Infernal Robotics, MechJeb and Bac9\u0027s new procedural wings.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/yg026712g4cy872/S4.craft\u0022 rel=\u0022external nofollow\u0022\u003ECraft file\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EYou\u0027ll need FAR. Also, it helps if you stow the middle (ie the adjustable) gear and instead use the rearmost ones for landing. Don\u0027t try taking off on them though; they\u0027re way too far from the centre of mass.\u003C/p\u003E\u003Cp\u003EAction groups:\u003C/p\u003E\u003Cp\u003E1 - toggle engine modes and intakes\u003C/p\u003E\u003Cp\u003E2 - toggle window shields\u003C/p\u003E\u003Cp\u003E3 - arm weapons systems, toggle chain guns and weapons bay doors\u003C/p\u003E\u003Cp\u003E4 - cycle through weapons\u003C/p\u003E\u003Cp\u003E5 - fire\u003C/p\u003E\u003Cp\u003Eo/p - raise/lower chain guns\u003C/p\u003E\u003Cp\u003EABORT - toggle air brakes\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-05T00:08:07Z\u0022 title=\u002201/05/2015 12:08  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 5, 2015\u003C/time\u003E by SufficientAnonymity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TrooperCooper","CreatedById":110599,"CreatedDateTime":"2015-01-05T00:05:42Z","Content":"\n\u003Cp\u003EI been working over the holidays on another attempt of colonizing the red planet. And it seems like I might get a chance of completing it this time before Squad rolls out a new patch again. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb, Bill and Bob plus a few scientists leaving Kerbin on the way to Duna...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/biEZudT.jpg\u0022 alt=\u0022biEZudT.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA couple month later the team arrives at the new outpost in Dunas orbit...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DLapOtV.jpg\u0022 alt=\u0022DLapOtV.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe station after the first permanent crew has docked up:\u003C/p\u003E\u003Cp\u003Ecenter cross: station\u003C/p\u003E\u003Cp\u003Eleft: travel ship to move passengers between Kerbin orbit and Duna orbit\u003C/p\u003E\u003Cp\u003Ebottom: Duna/Ike - Lander\u003C/p\u003E\u003Cp\u003Eright: fuel supply tanker\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6U43KaB.jpg\u0022 alt=\u00226U43KaB.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile on Ike my mobile Karbonite refinery is busy harvesting and converting more fuel for future needs...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iGkoTmt.jpg\u0022 alt=\u0022iGkoTmt.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-01-05T00:37:02Z","Content":"\n\u003Cp\u003EStarted a reverse science mode... all tech unlocked but starting off with 10,000 funds and trying to play like that.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2015-01-05T03:10:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LABHOUSE\u0022 data-cite=\u0022LABHOUSE\u0022\u003E\u003Cdiv\u003EStarted a reverse science mode... all tech unlocked but starting off with 10,000 funds and trying to play like that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk I\u0027ll bit, how does this work? Do you get limited amount of parts you can use before eliminating nodes as you progress or something else?\u003C/p\u003E\n"},{"CreatedByName":"mdkendall","CreatedById":114550,"CreatedDateTime":"2015-01-05T03:24:44Z","Content":"\n\u003Cp\u003EThe unfortunate situation with Bill and Dunfurt\u0027s Duna lander:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ro7dNnPl.jpg\u0022 alt=\u0022ro7dNnPl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ehas been rectified:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ix41UnOl.jpg\u0022 alt=\u0022Ix41UnOl.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2015-01-05T03:32:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mdkendall\u0022 data-cite=\u0022mdkendall\u0022\u003E\u003Cdiv\u003EThe unfortunate situation with Bill and Dunfurt\u0027s Duna lander:\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003Ehas been rectified:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow did you manage to get your lander back upright?\u003C/p\u003E\u003Cp\u003Elooks like a tricky procedure from the first screenshot\u003C/p\u003E\n"},{"CreatedByName":"Fleb","CreatedById":63851,"CreatedDateTime":"2015-01-05T05:30:27Z","Content":"\n\u003Cp\u003EToday I did what everyone seems to be doing and made a shuttle with the lovely MK3 parts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/R4QJR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-05T06:28:03Z\u0022 title=\u002201/05/2015 06:28  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 5, 2015\u003C/time\u003E by Fleb\u003C/strong\u003E\n\u003Cbr\u003EAdded pics\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Kerman","CreatedById":166398,"CreatedDateTime":"2015-01-05T05:47:44Z","Content":"\n\u003Cp\u003EI launched a long range survey mission on Kerbin. I used drop tanks with wings attached to them, and seperatrons to aid staging them. I wasn\u0027t terribly efficient on my way to the three points and barely made it back to the west shore of the peninsula KSC is located on.\u003C/p\u003E\u003Cp\u003EAs I landed I ran completely out of fuel. Today I learned exactly how much throttle you need to generate enough lift with my craft to coast. That\u0027s the kind of thing you learn on the edge of your seat!\u003C/p\u003E\u003Cp\u003EPlanes are a lot scarier than rockets surprisingly!\u003C/p\u003E\n"},{"CreatedByName":"mdkendall","CreatedById":114550,"CreatedDateTime":"2015-01-05T06:15:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MartGonzo\u0022 data-cite=\u0022MartGonzo\u0022\u003E\u003Cdiv\u003EHow did you manage to get your lander back upright?\u003Cp\u003Elooks like a tricky procedure from the first screenshot\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tried a lot of RCS and reaction wheel torque first but it was not strong enough to lift the weight of all the fuel in the upper tank. I also tried nudging the nose of the rover under the docking port at the top of the lander, then using the rover\u0027s landing engines to lift it, but that was not strong enough either.\u003C/p\u003E\u003Cp\u003EIn the end I fired the central decoupler to separate the habitation module from the return-to-orbit stage. The habitation module fell upright of its own accord due being bottom-heavy, and a bit of fiddling with the landing struts got it to sit nicely. I had parked the rover at the top end of the return stage to stop it falling over when the decoupler fired. I was then able to get it to fall over on to its base with reaction wheel torque.\u003C/p\u003E\u003Cp\u003ELuckily the return stage had radial engines so it is happy to sit flat on its base, and it appears that nothing got damaged during the procedure.\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2015-01-05T06:21:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mdkendall\u0022 data-cite=\u0022mdkendall\u0022\u003E\u003Cdiv\u003EI tried a lot of RCS and reaction wheel torque first but it was not strong enough to lift the weight of all the fuel in the upper tank. I also tried nudging the nose of the rover under the docking port at the top of the lander, then using the rover\u0027s landing engines to lift it, but that was not strong enough either.\u003Cp\u003EIn the end I fired the central decoupler to separate the habitation module from the return-to-orbit stage. The habitation module fell upright of its own accord due being bottom-heavy, and a bit of fiddling with the landing struts got it to sit nicely. I had parked the rover at the top end of the return stage to stop it falling over when the decoupler fired. I was then able to get it to fall over on to its base with reaction wheel torque.\u003C/p\u003E\u003Cp\u003ELuckily the return stage had radial engines so it is happy to sit flat on its base, and it appears that nothing got damaged during the procedure.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBrilliant! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003Eimprovisation is the Kerbal way\u003C/p\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2015-01-05T13:08:35Z","Content":"\n\u003Cp\u003EI built my first plane for this save, hired a new pilot, put that thing on the \u0022runway\u0022, pushed the throttle up without realizing that the \u0022runway\u0022 isn\u0027t even remotely level, and booom. First casualty since I started playing 0.90... I think I\u0027ll ignore planes as long as I\u0027m playing with reverting disabled...\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-01-05T13:16:36Z","Content":"\n\u003Cp\u003EBit the bullet and downloaded 0.90 along with my current mod list. Spent the first half hour getting the game\u0027s graphics settings turned down. Still need to ge all my flags transferred over, and I obviously need something to replace LOD for the time being.\u003C/p\u003E\u003Cp\u003EMade a few preliminary contract launches. I can see what everybody\u0027s been talking about - making money in the early going has gotten quite a bit more difficult, particularly given the limitations imposed on the lower level buildings. Thank goodness for KER - without maneuver nodes it\u0027s my only real way of telling when to make orbital insertion burns...\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-01-05T13:24:09Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/E8hlQFm.png\u0022 alt=\u0022E8hlQFm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003EWe choose to go to the moon, not because it is easy, but because it is-What the hell?\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003E -J.F.Kerman\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dr-Drunk","CreatedById":132802,"CreatedDateTime":"2015-01-05T14:47:48Z","Content":"\n\u003Cp\u003EI made a horribly under-designed Mun lander in carreer mode. I figured I had more then enough Dv to go to the Mun and land back on Kerbin. I was wrong....\u003C/p\u003E\u003Cp\u003EOn the bright side though, I did get an orbit around the Mun after landing and managed to get back to Kerbin with about 0.71 units of monoprop left. I\u0027ve never felt so connected with Bob\u0027s terrified little face.\u003C/p\u003E\u003Cp\u003ENow back off to build an orbital power plant using interstellar!\u003C/p\u003E\n"},{"CreatedByName":"DBT85","CreatedById":114980,"CreatedDateTime":"2015-01-05T15:08:40Z","Content":"\n\u003Cp\u003EI started a new career as my last one on Hard was frankly too difficult! This is on Normal but with all the reload/respawn stuff turned off.\u003C/p\u003E\u003Cp\u003EFirst launch with Jeb in a capsule and a SRB set to low thrust and fuel to just barely make 5k altitude. Engine and chute in same stage. Jeb dies. FFS.\u003C/p\u003E\u003Cp\u003ENew Career and learn from that mistake! Jeb died on the mission to attain 56k. I didn\u0027t use a decoupler so the pod/SRB came in nose first and overheated and he slammed into the ground. The very next flight my new rookie attempted the Reach Atmo contract and the same thing happened. Need a decoupler!\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2015-01-05T15:48:30Z","Content":"\n\u003Cp\u003EI built my first real space plane. Like, it works and everything! I\u0027ve played with space planes previously, but I\u0027ve honestly never been able to make anything that worked at all. I tried a space shuttle, but it keeps tipping over and imolating itself on the pad from being too unbalanced. So I mounted 4 of the large 1.5m tanks around the space plane with 4 of the regular SRBs and it makes it to space BARELY and I can put a satellite in to orbit from the payload bay. I think if I reduced the thurst on the SRBs to more like 60% or so from 75% (going WAY to fast in the 8k\u002B range and wasting fuel on aerodrag), it\u0027d give me the extra dV to either haul a more substantial satellite (IIRC, it is around .75t what I tested on the launch) or more comfortably achieve orbit (I manages a 105x81km orbit with zero fuel left, but enough RCS to retro-\u0022burn\u0022 and return after launching the satellite).\u003C/p\u003E\u003Cp\u003Ebalanced enough with enough glide rate that I can pretty easily set it down. Only breaks off the engines 1 in 3 times (if I am not careful), but I have had zero crashes which broke up the entire space plane!!! It is a bit unbalanced if there is still fuel in the space plane though, which is a bit of a bummer, but between 80-100% full and 0-10% full (just the onboard fuel) it is extremely well balanced.\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-01-05T16:27:30Z","Content":"\n\u003Cp\u003EI finished upgrading my Hard Mode save buildings except for the Admin building (who needs overpowered strategies).\u003C/p\u003E\u003Cp\u003EThen set off to design a standard, simple and low cost crew launch and re-entry system which can get a 3 keb crew into a 130km orbit with manoeuvre capability. This as a result of getting tired of constructing each one from scratch every time. Making it slightly \u0022Orion-like\u0022 with stock parts.\u003C/p\u003E\u003Cp\u003EAlso finished my 1st gen \u0022Multi-module Operational National Multi-purpose Space Station\u0022 (A 1960\u0027s vision of what a space station could look like...) Launched as one unit with minor orbital assembly. Housing up to 37 Kerbals. Need these in orbit around everything :-)\u003C/p\u003E\u003Cp\u003EMaybe some pics later on... EDIT: Here they are only 2...\u003C/p\u003E\u003Cp\u003EThe station...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iKewYQO.png\u0022 alt=\u0022iKewYQO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESomeone didn\u0027t turn off the lights...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8TQMK4D.png\u0022 alt=\u00228TQMK4D.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-05T18:49:30Z\u0022 title=\u002201/05/2015 06:49  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 5, 2015\u003C/time\u003E by Wallygator\u003C/strong\u003E\n\u003Cbr\u003Ecan\u0026#039;t count and added pics.\n\u003C/span\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2015-01-05T17:28:42Z","Content":"\n\u003Cp\u003EJeb \u0026amp; Bob landed at the East Farside Crater Munar arch. Bob flew to the top and placed a flag.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/XF2EV9H.jpg\u0022 alt=\u0022XF2EV9H.jpg\u0022\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"ROXunreal","CreatedById":133129,"CreatedDateTime":"2015-01-05T18:08:20Z","Content":"\n\u003Cp\u003ESpent more than an hour yesterday reverting flights in career mode trying to get a poodle and a T45 to orbit to fulfill two test contracts. Just barely made it in the end with the right combo of SRB\u0027s, I only have the 45 science nodes unlocked and an once-upgraded launch pad. Best part is that one prior try I made it to orbit, was just a few hundred meters under the target altitude for the test, decoupled the poodle after the test, and my orbit rose by those few hundred meters above the minimum test orbit for the T45 just because of the decoupling inertia \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E So many little things kept screwing me up yesterday, had I not enabled reverting flights I\u0027d be at game over within hours of starting career.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sqqbY1m.jpg\u0022 alt=\u0022sqqbY1m.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Treldon","CreatedById":128860,"CreatedDateTime":"2015-01-05T19:13:22Z","Content":"\n\u003Cp\u003EStarted a new (my second ever) career save, this time with severl reality/difficulty mods (DRE, NEAR, Remote tech). The lack of souposphere really changes things...\u003C/p\u003E\u003Cp\u003E(Also reset ribbons)\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-01-05T19:17:52Z","Content":"\n\u003Cp\u003EI created these crafts and the image to show the initial progression/choices when using my new \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/106130\u0022 rel=\u0022external nofollow\u0022\u003ESETI BalanceMod\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EFrom left to right: High Altitude Probe (SRB), Manned Rocket (SRB), Space Capable Probe (SRB), Recoverable/Lander Probe (SRB), Basic Jet, Orbiter Probe (Liquid Fuel \u002B SRBs)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yegKVla.jpg\u0022 alt=\u0022yegKVla.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-05T19:20:51Z\u0022 title=\u002201/05/2015 07:20  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 5, 2015\u003C/time\u003E by Yemo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DBT85","CreatedById":114980,"CreatedDateTime":"2015-01-05T19:18:18Z","Content":"\n\u003Cp\u003EJust put Samvan on the Mun for the first time in 0.90 and in career mode. I\u0027ve got the Launch pad and Tracking station at lvl 2 so still no manoeuvre nodes. Only 188m/s dV remaining so he shan\u0027t be coming home \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MPO3a79.png\u0022 alt=\u0022MPO3a79.png\u0022\u003E\u003C/p\u003E\n"}]}