{"TopicId":27292,"ForumId":32,"TopicTitle":"What did you do in KSP1 today?","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-05-17T21:06:45Z","PageNum":2025,"Articles":[{"CreatedByName":"NHunter","CreatedById":190849,"CreatedDateTime":"2019-09-11T21:28:53Z","Content":"\n\u003Cp\u003E\nWith my Stock\u002BOPM career essentially completed, I decided that it\u0027s about time to do stuff in the GPP one. And, today, my probes began arriving to Gauss:\n\u003C/p\u003E\n\u003Cp\u003E\n- As usual, the forward relay arrives first:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022e5se5k0p991hk4pzg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022http://www.mediafire.com/convkey/57d2/e5se5k0p991hk4pzg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uf4d1hp07poysc1zg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022http://www.mediafire.com/convkey/901e/uf4d1hp07poysc1zg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lg4yzw8rrrtjn8ezg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022http://www.mediafire.com/convkey/6eca/lg4yzw8rrrtjn8ezg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n- It was followed by one of the mapping satellites a few days later:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224hsmqosntpyt6kozg.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022http://www.mediafire.com/convkey/b68d/4hsmqosntpyt6kozg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:11px;\u0022\u003E^ That while dot right next to the edge of antenna dish is Ciro, the system\u0027s sun. It\u0027s so tiny and dim out there...\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2019-09-12T02:35:13Z","Content":"\n\u003Cp\u003E\n(1.6.1) Spent much of my day trying to get \u003Cem\u003EStrange Cargo\u003C/em\u003E, which had delivered a group of colonists to Gilly several days ago, to a point where it could dock with LSV \u003Cem\u003EHouse Atreides\u003C/em\u003E in Eve orbit. \u003Cem\u003ESC \u003C/em\u003Ehad arrived over Eve yesterday but it was clear the ship would not have sufficient fuel to affect a safe rendezvous, so my day began by dispatching \u003Cem\u003EAndrea Doria\u003C/em\u003E from space station \u003Cem\u003EEveport \u003C/em\u003Efor a rendezvous, which was set for three hours and 35 minutes after \u003Cem\u003EDoria\u003C/em\u003E departed the station. While that was pending, the crew aboard LSV \u003Cem\u003EHouse Harkonnen\u003C/em\u003E in a nasty orbit of Bop completed the print of a lab module, which was used to level up everybody aboard. Engineer Beamon Kerman achieved five star status as planned, and all of the colonists that \u003Cem\u003EHarkonnen \u003C/em\u003Eis scheduled to deliver to the \u003Cem\u003EBohai 2 \u003C/em\u003Eoutpost on the surface reached level 4 status.\n\u003C/p\u003E\n\u003Cp\u003E\nI checked in with the \u003Cem\u003EEnchova Central\u003C/em\u003E outpost on Duna next, which was producing Xenon Gas for delivery to the nascent warp tanker SL \u003Cem\u003EShai Hulud\u003C/em\u003E in orbit. The outpost delievered a full tank\u0027s worth, after which I went up to \u003Cem\u003EShai Hulud\u003C/em\u003E to begin making Exotic Matter for her Alcubierre Drive and to start converting the Xenon Gas into Liquid Xenon for storage and delivery. That 1800 unit tank of Xenon Gas translated to a little over 60 units of Liquid Xenon, which was enough to convince me that I was going to have to revert to other means to fill the Liquid Xenon tank.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore I could begin making plans there, \u003Cem\u003EDoria \u003C/em\u003Erendezvoused with \u003Cem\u003EStrange Cargo\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022W6yvuNd.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/W6yvuNd.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003ELook kids, I took a screenie today!\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOnce \u003Cem\u003EStrange Cargo \u003C/em\u003Edocked up to\u003Cem\u003E Andrea Doria\u003C/em\u003E, a refueling mass driver shot was sent up from the \u003Cem\u003EAlexander L. Kielland\u003C/em\u003E outpost on the surface, refueling both craft to full capacity. Refueled, \u003Cem\u003EStrange Cargo\u003C/em\u003E undocked and headed to a rendezvous with \u003Cem\u003EHouse Atreides\u003C/em\u003E, scheduled to take place a little under three hours later. \u003Cem\u003EDoria \u003C/em\u003Efor her part burned to return to \u003Cem\u003EEveport\u003C/em\u003E, where she arrived and docked about 1.5 hours later. \n\u003C/p\u003E\n\u003Cp\u003E\nAt that point I had time to plan to fill up \u003Cem\u003EShai Hulud\u0027s\u003C/em\u003E Liquid Xenon tank - the plan I came up with was to make a supply available at the \u003Cem\u003ESouth Base\u003C/em\u003E outpost on Kerbin near \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and to shoot it up directly with the outpost\u0027s mass driver. For this plan to work of course, \u003Cem\u003EShai Hulud\u003C/em\u003E would need to be in orbit of Kerbin, and to that end I lit the craft\u0027s conventional drive and burned it into a 182.5 x 182 kilometer, 0.03° inclined orbit over Duna. Unfortunately, the conventional drive set up a bit more in terms of vibration than I\u0027d anticipated when I designed the craft, and when the final burn completed I discovered that one of the ship\u0027s SAFER reactors had come off mid-burn. I\u0027m lucky it didn\u0027t blow up anything. I was already having issues providing sufficient power to operate the craft\u0027s Exotic Matter generator continuously; this is likely to exacerbate those issues. I should still be able to operate the Alcubierre Drive to get the craft to Kerbin, assuming I\u0027m careful about the XM generation. Meanwhile, I fitted a \u003Cem\u003EWisent 7\u003C/em\u003E utility rover with a Liquid Xenon tank from IFS, and drove it the three kilometers out to \u003Cem\u003ESouth Base\u003C/em\u003E. At this point it\u0027s parked nearby awaiting \u003Cem\u003EShai Hulud\u0027s \u003C/em\u003Earrival before I go to hook it up to the outpost.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EStrange Cargo \u003C/em\u003Eaffected a successful docking with \u003Cem\u003EHouse Atreides\u003C/em\u003E, and with no further business to conduct at Eve I began the process of returning the craft to Kerbin, stopping by Jool first to bleed off much of its speed; the craft arrived at Jool going 8,632 m/s and settled into a 5,750 x 5128.6 kilometer, 7.13° inclined orbit after one warp-back maneuver. The ship should reach optimal position for a final warp to Kerbin in just over 1.5 hours from now. The aforementioned colonization contract - the one where \u003Cem\u003EStrange Cargo\u003C/em\u003E acted as the delivery ship - completed itself just as I was closing out business today; I\u0027ll go out to \u003Cem\u003EOcean Ranger\u003C/em\u003E to finalize the completion first thing tomorrow.\n\u003C/p\u003E\n\u003Cp\u003E\nTomorrow I hope to be able to get \u003Cem\u003EHouse Atreides\u003C/em\u003E and LSV \u003Cem\u003EHouse Corrino\u003C/em\u003E to Kerbin and to put \u003Cem\u003EHouse Harkonnen\u003C/em\u003E in a better orbit of Bop. I\u0027m also hoping to be able to get \u003Cem\u003EShai Hulud\u003C/em\u003E out to Duna, though that one will depend on how much free time I get to play and the real extent of the damage it took today. It\u0027s entirely possible I\u0027ll be forced to send up a repair mission to \u003Cem\u003EShai Hulud\u003C/em\u003E before everything is said and done. I\u0027m also thinking very hard about reinstalling Kerbal Konstructs so I can get access to Runway parts; intent there is to put a Runway out by the \u003Cem\u003EC. P. Baker\u003C/em\u003E outpost on Laythe. Not much else going on right now; I picked up a second satellite contract for Dres so I\u0027m pretty sure that\u0027s where the game is planning on sending me next at this point. Won\u0027t actually go out there until I have the exploration contract to do so, of course...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-09-12T02:53:56Z\u0022 title=\u002209/12/2019 02:53  AM\u0022 data-short=\u00224 yr\u0022\u003ESeptember 12, 2019\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003Cbr\u003Eposted early, apparently.\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-09-12T06:37:10Z","Content":"\n\u003Cp\u003E\nAfter finishing work on the Elvira, I relaxed by playing around a bit with prop planes. I slapped together one I called Kerbules, it\u0027s a ridiculously overpowered four-engine with a big wing and control surfaces; maybe I\u0027ll publish it later after I make it a bit prettier. It is a lot of fun to fly already -- I made a prop preset that has it take off from a really short runway and then climb at, like, 45 degrees while accelerating; it\u0027ll also drop out of the sky if I reverse the props and is super controllable low-and-slow by using the throttle on that prop preset -- I can skim the ground at ca 40 m/s, climb over terrain, and what have you. \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I\u0027m really digging the handling characteristics of these prop planes -- they\u0027re super stable, super coordinated, and the power delivery is instant, like on a rocket plane, but they have all the endurance you want. Easily the easiest and most fun to fly craft I\u0027ve made in KSP; if you\u0027re new to flight sims or planes one of these would be a perfect way to learn.\n\u003C/p\u003E\n\u003Cp\u003E\nQuestion to any of you who have played with the Breaking Ground props though: what\u0027s the top speed of your planes in straight and level flight? I got Kerbules up to 255 m/s, which is the fastest I\u0027ve reached. The Elvira went up to 240 or so with half the power and much more mass. I think it\u0027s constrained by prop aerodynamics (as it should be...).\n\u003C/p\u003E\n"},{"CreatedByName":"catloverjerrygarcia","CreatedById":171766,"CreatedDateTime":"2019-09-12T08:07:59Z","Content":"\n\u003Cp\u003E\nI just accomplished this in my sandbox game(The Simulator/s for my Career game).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://flic.kr/p/2hei11o\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u002248720832206_e377a7b637_o.jpg\u0022 src=\u0022https://live.staticflickr.com/65535/48720832206_e377a7b637_o.jpg\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://flic.kr/p/2hei11o\u0022 rel=\u0022external nofollow\u0022\u003ELookie Lookie\u003C/a\u003E by \u003Ca href=\u0022https://www.flickr.com/photos/183843241@N08/\u0022 rel=\u0022external nofollow\u0022\u003EAdmFranzvonHippie\u003C/a\u003E, on Flickr\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-09-12T14:48:44Z","Content":"\n\u003Cp\u003E\nA technology demonstration was prepared to gather support for upcoming near-Kerbin asteroid missions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ee7d19c794.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.00\u0022 height=\u0022400\u0022 width=\u0022800\u0022 src=\u0022https://puu.sh/EglHl/ee7d19c794.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt did not go to space today.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-09-12T16:35:16Z","Content":"\n\u003Cp\u003E\nI finished a fun little side project, the BAK-130 Kerbules. It\u0027s for parachute training. It\u0027s also a ton of fun to fly, with an absurd amount of power on tap at low speeds, while being at the same time manoeuvrable without being twitchy. It\u0027ll climb almost straight up at 80-90 m/s, and stop like it\u0027s slamming into a wall if you reverse thrust, and you have to make an actual effort to crash it. Perfect for trainee pilots... and parachutists.\n\u003C/p\u003E\n\u003Cp\u003E\nTop speed is ca 255 m/s which is the best I\u0027ve managed with a prop plane.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Brikoleur/BAK-130-Kerbules\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Brikoleur/BAK-130-Kerbules\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rQXOWXA.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/rQXOWXA.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zgFzBIX.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/zgFzBIX.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NMWXCO","CreatedById":157542,"CreatedDateTime":"2019-09-12T17:00:08Z","Content":"\n\u003Cp\u003E\nDid some minor stuff yesterday.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI started off building a ship to carry the replacement crew back to the KSS horizon to resume research and add 2 recently unlocked experiments using \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E....the vessel was called the Halley2,  all resupply and station shuttling missions will carry that designation from here on. .... this mission was completely cursed and i ended up doing it 3 times over. On first approach to the KSS horizon it mysteriously exploded 2km out when it loaded in because the robotics on the solar arrays freaked out. ... on the next run i realized i comletely forgot a cupola for a science experiment meant to be done on station. ... On the next run the docking proceeded again but i realized i had not read the contract and i in fact needed to run my observations on the very first KSS-1 station.... however the Halley2 did not have a probe core so i needed to keep atleast one kerbal in the command pod and that i needed to take a extra docking port with me and engineer because the KSS-1 used older ones....\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022K041UGh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/K041UGh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022l1T0Nml.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/l1T0Nml.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Gy84bGQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.47\u0022 height=\u0022578\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Gy84bGQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022u3X99Mx.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.47\u0022 height=\u0022578\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/u3X99Mx.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GFSy50Z.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.47\u0022 height=\u0022578\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/GFSy50Z.png\u0022\u003E\u003Cimg alt=\u0022QUZ9fwZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.47\u0022 height=\u0022578\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/QUZ9fwZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225rHHwqo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.47\u0022 height=\u0022578\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/5rHHwqo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI sucessfull performed the rendezvous with the KSS-1 and managed to dock after bouncing off once. .... In my ultimate wisdom i decided to attach a scaled down \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E connector between the vessels for \u0027\u0027extra stability\u0027\u0027.... then move it.\u003Cstrong\u003E this was a mistake\u003C/strong\u003E. the pod shook violently then turned sharply and destroyed the main fuel tank on the KSS-1 and some other hardware. i decided to reload the last quicksave which took me back quite far so i had to move all my kerbals and prep for the redevouz again.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next round around i did succeed though. the science report was sucessfull performed.... but in my ultimate wisdom i decided to move the observation port, with the data in it to the KSS-1 and forgot i had to recover it on kerbin. I then re-docked with the KSS horizon to make the final crew selection and transfer some things. The container that carried the items with the halley2 was bolted it to the KSS Horizon by a engineer wielding a electric screwdriver and the brave engineer from the KSS-1 was moved into the return pod as he was overdue for a break. The kerbals waved goodbye through the windows and the halley2 then returned home, completing the crew rotation contract.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter this i was completely and utterly broke and had to wait 6 days for the monthly funding to come along and increase my funds from 12.000 to 1.200.000 funds.\n\u003C/p\u003E\n\u003Cp\u003E\nThe next mission after this was a survey scan mission of kerbin, the mun and minmus....it turns out i did not carry enough batteries so i changed the transmitter to allow partial transmission. this made it possible to eventually finish the scanning. Because of transfer windows and the time it took to recharge the batteries during transmissions it took all in all around 20 kerbin days to map all 3 bodies, with the minmus leg of the journey being the longest.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022azUmD7m.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.47\u0022 height=\u0022578\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/azUmD7m.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-09-12T17:01:28Z\u0022 title=\u002209/12/2019 05:01  PM\u0022 data-short=\u00224 yr\u0022\u003ESeptember 12, 2019\u003C/time\u003E by NMWXCO\u003C/strong\u003E\n\u003Cbr\u003Eforgot a image.\n\u003C/span\u003E\n"},{"CreatedByName":"coyotesfrontier","CreatedById":181596,"CreatedDateTime":"2019-09-12T18:33:53Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022H4BD3zs.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/H4BD3zs.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGot the Propulsion, Science, and Life Support Modules of Rust Spear into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, but when rendezvousing the Habitation Module, I discovered that the solar panel arrays on the LS Module were somehow spinning extremely fast, as if they were mounted on a motor set to maximum speed.\n\u003C/p\u003E\n\u003Cp\u003E\nI had to abort the docking due to spinning-caused ghost forces moving the craft, and decided to see if I could somehow get rid of the kraken-possessed arrays. Fortunately, the spinning reached a point where the arrays each ejected themselves from Rust Spear, though that was only after I had reverted the Hab Module flight.\n\u003C/p\u003E\n\u003Cp\u003E\nAs there was only a single docking port open on RS (for connecting the LS module to the Hab), I sent up 2 kerbals on a mission to attach two new ports for new solar arrays, using \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022w9LTlou.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/w9LTlou.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI currently have to send up the hab module, 4 refueling missions, and the crew shuttle, and after that Rust Spear will depart on its 3 year mission to Duna orbit and back. Despite playing since 0.90, this is the first time I\u0027ve stuck with a science save long enough for interplanetary missions, so I\u0027m super excited to get this done.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2019-09-12T19:20:32Z","Content":"\n\u003Cp\u003E\nI didn\u0027t get much done other than a handful of course corrections for the probes going to Duna and the outpost going to Minmus arrived in orbit.  The only other thing was a passenger airline contract from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to the desert field \u0026amp; back.  I used my new Comet jetliner which performed perfectly.\n\u003C/p\u003E\n\u003Cp\u003E\nClimbing over \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NpmujsQ.png?2\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.20\u0022 height=\u0022575\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/NpmujsQ.png?2\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEven with 4 Juno\u0027s, it\u0027s climb rate is pretty bad fully loaded - I actually had to go around the mountains west of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E for the first time rather than over them. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UZlGsYy.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002253.75\u0022 height=\u0022550\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/UZlGsYy.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u0022If you look out the left windows, you\u0027ll see ruins of an ancient civilization hidden in the mountains\u0022\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qgHkUMW.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002259.61\u0022 height=\u0022610\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/qgHkUMW.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nReturning to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E at dusk\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZMFpn17.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002253.62\u0022 height=\u0022549\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ZMFpn17.png?1\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-09-12T19:20:51Z\u0022 title=\u002209/12/2019 07:20  PM\u0022 data-short=\u00224 yr\u0022\u003ESeptember 12, 2019\u003C/time\u003E by Cavscout74\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2019-09-12T20:38:49Z","Content":"\n\u003Cp\u003E\nBehold!\n\u003C/p\u003E\n\u003Cp\u003E\nMy genius 5 burn plan to Moho (which uses 4600m/s out of 4800m/s available, 3100 of which are for capture)!\u003Cbr\u003E\u003Cimg alt=\u0022xSRMmhw.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/xSRMmhw.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo it turns out that I\u0027ve done my parking orbit wrong. The obit\u0027s ascending node lined up with Moho\u0027s descending node, so the orbits were flipped in inclination (one is \u002B20°, the other -20°). I decided to employ the help of Eve to not only correct my inclination, but also get to Moho\u0027s orbit with a fraction of the speed and a fraction of the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause I\u0027m using a gravity assist which, by the way, takes me very close to Eve\u0027s atmosphere, and because Moho is a fairly small target, all of these 5 burns will have to be done with extreme precision, something I do \u003Cu\u003Enot\u003C/u\u003E look forward to!\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, the final orbit will be circular at 75km, with ~200m/s to spare.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:8px;\u0022\u003EWhy does the universe have to be \u003Cem\u003Ethis\u003C/em\u003E chaotic...\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Castille7","CreatedById":101668,"CreatedDateTime":"2019-09-13T00:05:35Z","Content":"\n\u003Cp\u003E\nToday it\u0027s \u003Cstrong\u003ECheryl\u0027s Chichier she shed\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThanks to Juggernoob for letting me put his little \u003Ca href=\u0022https://kerbalx.com/Juggernoob/Fachwerkhaus-Style-1\u0022 rel=\u0022external nofollow\u0022\u003EFachwerkhaus House\u003C/a\u003E on fire here! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022PPlHJlE.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/PPlHJlE.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2019-09-13T14:44:51Z","Content":"\n\u003Cp\u003E\n(1.6.1) Got my trainee flying solo this morning, so I figured I\u0027d try to sneak in a report real quick for y\u0027all...\n\u003C/p\u003E\n\u003Cp\u003E\nBegan my day yesterday with acknowledging the completion of a colonization contract at the \u003Cem\u003EOcean Ranger\u003C/em\u003E outpost on Gilly. The contract was only for four days, and as might be expected the delivery ship - \u003Cem\u003EStrange Cargo\u003C/em\u003E in this case - had only just made it back to the warp ship LSV \u003Cem\u003EHouse Atreides\u003C/em\u003E for delivery back to Kerbin. I will be re-training five of the eight colonists, three as engineers and two as pilots as soon as I get the chance.\n\u003C/p\u003E\n\u003Cp\u003E\nTo make up for the loss of a SAFER reactor during a standard burn into higher orbit of Duna, I decided to print up a \u003Cem\u003EHodor 7\u003C/em\u003E nuclear battery and add it to the docking stack of SL \u003Cem\u003EShai Hulud\u003C/em\u003E. To that end, one was ordered up at the \u003Cem\u003EBi-La Kaifa Shipyards\u003C/em\u003E over Duna, with total printing time expected to take six hours. \n\u003C/p\u003E\n\u003Cp\u003E\n \u003Cimg alt=\u0022rOJmaXW.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/rOJmaXW.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EDid try a mock up of the \u003C/em\u003EShai Hulud\u0027s\u003Cem\u003E stack in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E with the \u003C/em\u003EHodor\u003Cem\u003E added, and I\u0027m worried this plan isn\u0027t going to work. At least, not whilst still leaving the mass driver unit intact...\u003C/em\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nI discovered that when \u003Cem\u003EShai Hulud\u003C/em\u003E departed BLK after the launch of the craft\u0027s mass driver prow, it took all the available Enriched Uranium with it - the station\u0027s batteries would\u0027ve been completely drained had it not been daylight at the time with the solar panels deployed. I quickly rectified that situation by shooting up more nuclear good stuff from the \u003Cem\u003EEnchova Central\u003C/em\u003E outpost on the Dunan surface via mass driver.\n\u003C/p\u003E\n\u003Cp\u003E\nThe bulk of my day was spent with a double-warp (against my usual disposition towards attempting such a maneuver), with LSV H\u003Cem\u003Eouse Corrino\u003C/em\u003E warping over to Jool from Laythe and then both her and LSV \u003Cem\u003EHouse Atreides \u003C/em\u003Epreparing to warp to Kerbin from there.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ictFkq0.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ictFkq0.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003ETo get to Kerbin from Jool, you\u0027ve got to speed up. So both warp ships are headed \u003Cstrong\u003Eat \u003C/strong\u003EJool in this screenie. Had to carefully manage their altitudes here - if either one had gotten below 3,000,000m, it\u0027d\u0027ve been some form of lithobraking (hydrobraking?) time......\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EHouse Corrino\u003C/em\u003E got to the point where she was going fast enough for the warp first, so she departed Jool\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and warped most of the way back to Kerbin. With \u003Cem\u003EHouse Atreides\u003C/em\u003E still in free fall towards Jool at the time, I didn\u0027t want to get to maneuvering \u003Cem\u003ECorrino\u003C/em\u003E into Kerbin orbit just yet and have \u003Cem\u003EAtreides\u003C/em\u003E get too low to activate the Alcubierre Drive as a result. \u003Cem\u003EAtreides\u003C/em\u003E reached a decent point to warp to Kerbin in short order, though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GPPJBar.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/GPPJBar.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003EHouse Atreides\u003Cem\u003E pointed directly away from Jool in preparation for departure, with two of the moons visible.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EAtreides\u003C/em\u003E warped directly to Kerbin and wound up arriving at 3,357.5 m/s, a hair too fast for orbital entry. Two warp-backs later, the craft settled into a 628.5 x 606.5 kilometer, 1.67° inclined orbit. Another colonization delivery mission is already lined up for her. Meanwhile, House Corrino was allowed to proceed to Kerbin, where I was rather delighted to discover that I\u0027d gotten her going kinda slow - she arrived at 1,033 m/s. I had had the thought to send her to Mun both for the sake of getting the crew aboard 2-3 extra XP and to load some extra Xenon stores, so that worked out nicely.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jTeLRYi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/jTeLRYi.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EDid have to deal with the issue of the target body having another celestial object in the way, but that turned out to be no big deal.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI did need to do just a little maneuvering to bleed off about half that speed so she could orbit Mun, and then proceeded to warp to Mun directly from there, where she settled immediately into a 347.2 x 270.5 kilometer, 2.09° inclined orbit. Supplies of fuel and Xenon were shot up to \u003Cem\u003ECorrino\u003C/em\u003E from the \u003Cem\u003EPiper Alpha \u003C/em\u003Eoutpost in orbit, after which \u003Cem\u003ECorrino\u003C/em\u003E broke Munar orbit and returned to Kerbin, speeding up a little bit before settling into an 804.9 x 751.2 kilometer, 6.64° inclined orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nUpon arrival in orbit, the\u003Cem\u003E G-LOC 7a \u003C/em\u003Ereturn-to-Kerbin craft that I\u0027d printed up at the \u003Cem\u003EC. P. Baker \u003C/em\u003Eoutpost on Laythe departed \u003Cem\u003ECorrino\u003C/em\u003E with rescuee pilot Gregeny Kerman aboard. The craft made its way into a lower orbit over Kerbin before final deorbiting.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BKjPwnQ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/BKjPwnQ.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003EAt night, of course. At least the numbers from Trajectories are looking mighty good...\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe craft came down safely about 2.19 kilometers north-northwest of the space center. It fulfilled \u003Cem\u003EGregeny\u0027s\u003C/em\u003E rescue contract in the process but I was dismayed to find it didn\u0027t settle the current exploration contract.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CPNzgRa.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/CPNzgRa.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EHmm...I would\u0027ve thought it would\u0027ve counted as having \u0022flown by\u0022 Laythe by entering orbit. Apparently I\u0027m going to need to try something else...\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI have yet to make plans for another shot at fulfilling the other half of the contract; going to be doing that today. Finished up my day yesterday with the transmission of an EVA report at \u003Cem\u003EEnchova Central \u003C/em\u003Efor contract, and I began work on finishing up an ore con job over Eve and Gilly. I did drill up the necessary amount of ore for the contract at the \u003Cem\u003EAlexander L. Kielland\u003C/em\u003E outpost on Eve, but discovered that neither of my orbital space stations over Gilly already had the prerequisite amount of ore in them. I\u0027ll probably be working to rectify that situation first chance I get to play this morning. Have yet to check new contracts as well, so I don\u0027t know what shape my day (and by extension my weekend) is going to take. LSV \u003Cem\u003EHouse Harkonnen\u003C/em\u003E over Bop is just about in position to attempt to improve her orbit, though, so I\u0027m liable to be working on finally getting her tourists down to the \u003Cem\u003EBohai 2\u003C/em\u003E outpost on the surface over the coming days. Only been trying to get that done all week, so I know I\u0027ll be working on that at least...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"catloverjerrygarcia","CreatedById":171766,"CreatedDateTime":"2019-09-13T18:50:57Z","Content":"\n\u003Cp\u003E\nBasic non-fancy shmancy update.  In my sandbox mode save I learned how to use MechJeb to execute rendezvous and docking.\n\u003C/p\u003E\n"},{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2019-09-13T19:33:23Z","Content":"\n\u003Cp\u003E\nThis just in: Kraken enraged over in-game \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E reload:\u003Cbr\u003E\u003Cimg alt=\u0022C3qYDXH.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/C3qYDXH.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWho knew oceans could be upside down?\u003Cbr\u003E\u003Cimg alt=\u0022dHsYmXj.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/dHsYmXj.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEven space is flooded!\u003Cbr\u003E\u003Cimg alt=\u00228k0rjhn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/8k0rjhn.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-09-13T19:38:29Z\u0022 title=\u002209/13/2019 07:38  PM\u0022 data-short=\u00224 yr\u0022\u003ESeptember 13, 2019\u003C/time\u003E by Delay\u003C/strong\u003E\n\u003Cbr\u003EThis just keeps getting better!\n\u003C/span\u003E\n"},{"CreatedByName":"ThatGuyWithALongUsername","CreatedById":140817,"CreatedDateTime":"2019-09-13T20:11:31Z","Content":"\n\u003Cp\u003E\nAh, KSP... your wonders never cease...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gBcEv9k.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/gBcEv9k.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2019-09-14T01:33:53Z","Content":"\n\u003Cp\u003E\nFinally made a little more progress in career after things calmed down some today.  My Minmus outpost landed yesterday and the first crew arrived today to set up surface experiments and start their month long stay on Minmus.  I still need to get a rover launched for them to explore and hopefully find a nice rock formation to scan.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nVj3orR.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002252.60\u0022 height=\u0022538\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/nVj3orR.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI also had a load of tourists make an orbit around the Mun \u0026amp; back for a pretty nice paycheck.   During reentry, apparently the orbital stage was draggier than the crew module, because I had already staged it away a few seconds before this image \u0026amp; the two parts stayed like this for quite a while after. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lkuTAFR.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002250.88\u0022 height=\u0022521\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/lkuTAFR.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd I launched another Minmus lander, this time with a tourist on board in addition to a pilot \u0026amp; scientist.  They are carrying an extra surface solar panel assembly for the Minmus outpost (since the engineer I sent was only 1 star)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eFNnsBv.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.04\u0022 height=\u0022563\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/eFNnsBv.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinally, Val went on a solo trip to investigate the last Mun monolith.  The science she brought back got me up to 160.6 science points, allowing me to purchase the Mk1-3 pod so I can start on larger missions now.  I didn\u0027t have time to put a craft together tonight, but I already have a pair of \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E rescues lined up for the first mission with the larger pod.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022I4KhT80.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.56\u0022 height=\u0022579\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/I4KhT80.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CdH7AqX.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.50\u0022 height=\u0022578\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/CdH7AqX.png?1\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-09-14T01:35:12Z\u0022 title=\u002209/14/2019 01:35  AM\u0022 data-short=\u00224 yr\u0022\u003ESeptember 14, 2019\u003C/time\u003E by Cavscout74\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-09-14T03:01:50Z","Content":"\n\u003Cp\u003E\nI entered LMO today and landing on moho will be tomorrow after I launch real rockets \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-09-14T03:41:02Z","Content":"\n\u003Cp\u003E\nMy website has changed a little bit to make a more up to date site icon\n\u003C/p\u003E\n\u003Cp\u003E\nGo look yourself\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalanders.wordpress.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalanders.wordpress.com/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"catloverjerrygarcia","CreatedById":171766,"CreatedDateTime":"2019-09-14T06:27:12Z","Content":"\n\u003Cp\u003E\nI mostly did design work, simulations, redesign work, and more simulations.  But it resulted in these designs for my Mun landing mission.\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch preparations are well on their way, the Sanshoo will be the first to launch from pad C followed by the Washi IV on pad A..\n\u003C/p\u003E\n\u003Ca href=\u0022https://flic.kr/p/2hf8M93\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022Sanshoo launch vehicle.\u0022 class=\u0022ipsImage\u0022 src=\u0022https://live.staticflickr.com/65535/48730349406_7a2b58a014_b.jpg\u0022\u003E\u003C/a\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Ca href=\u0022https://flic.kr/p/2hf765Q\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022Washi IV Mun launch vehicle assembly.\u0022 class=\u0022ipsImage\u0022 src=\u0022https://live.staticflickr.com/65535/48730019548_77ea9da961_b.jpg\u0022\u003E\u003C/a\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2019-09-14T11:02:36Z","Content":"\n\u003Cp\u003E\nI spent this morning working on a replica of SpaceX\u0027s Starship Mk1, examples of which are currently under construction in Texas and Florida.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lKw0G42.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/lKw0G42.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI even replicated the actuating fins utilising Breaking Ground hinges, which worked nicely until...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LkQwEYo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/LkQwEYo.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEventually, however, I decided to replace the small hinges I had been using with the huge alligator hinges, and the flaperons\u0027 kraken tendencies disappeared. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KmSVcKG.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/KmSVcKG.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2019-09-14T13:54:13Z","Content":"\n\u003Cp\u003E\nHadn\u0027t played in a long time, but recently heard of KSP 2 and decided to try again. Started a new career, messed around with the Mun and Minmus, played with some new toys that had been added. Did an Apollo-style Duna landing, was only after the orbiter was on a trajectory out of Duna\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and back to Kerbin that I realized all of the surface science was in the lander.\n\u003C/p\u003E\n"},{"CreatedByName":"catloverjerrygarcia","CreatedById":171766,"CreatedDateTime":"2019-09-14T14:56:40Z","Content":"\n\u003Cp\u003E\nThis morning I launched two spacecraft for a Mun mission, and docked them in orbit over Kerbin.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/l2J_0ZXK0dk?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"WooDzor","CreatedById":72106,"CreatedDateTime":"2019-09-14T15:06:47Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022p.gif?fv_content=true\u0026amp;size_mode=5\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002299.67\u0022 height=\u0022300\u0022 width=\u0022301\u0022 src=\u0022https://previews.dropbox.com/p/orig/AAjytEksMnuFK_0_II3iTrOe_oMuhM3ugZUx6RyijaKIa5Dz6mcJJhxkEOJisj-x8UFOjTrQIiPkiv1DXMnVfLCf0Z5_Vwr7-LGMdRPN_6DOlzuzbJOxb9uBMH9i8FeL-nCGjdqhamCPNTwv3k7i8G0g6jR00T1joE-nFomJ9mbzuqR09VN1RvuxVfNsVkdV4_rXwUkTqgCndqRpVyu6LFvC49NoBt5EZUhKopXl0_GYSF0lXt-FB4NMTe6bP5xjvuKBlHKISi6dUOmyDxVXyh5OugjQQnXBRczgftJmrTSt8HBgg5kTy2r7egHdbCMDmnWfam6lA9EvyZYBHm4omDUd6mW1SHNbM4-761MvcCguyXcZsA6oxR-xU2fkRd54zAs/p.gif?fv_content=true\u0026amp;size_mode=5\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb almost dodged a rover.\n\u003C/p\u003E\n"},{"CreatedByName":"Ratwerke_Actual","CreatedById":189744,"CreatedDateTime":"2019-09-14T17:18:03Z","Content":"\n\u003Cp\u003E\nThe final braking burn of a 128,000 ton Class \u0027A\u0027  asteroid.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tpgi5n6sdlm31.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.redd.it/tpgi5n6sdlm31.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt 90% ore it will refuel anything I ever desire.\n\u003C/p\u003E\n\u003Cp\u003E\nThis took about 3-1/2 hours of total burn time from 45 nuclear engines.\n\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2019-09-14T17:45:10Z","Content":"\n\u003Cp\u003E\n(1.6.1) Fairly minimal day to report for y\u0027all yesterday; didn\u0027t have much more than 90 minutes real-time to play though, so that\u0027s to be expected.\n\u003C/p\u003E\n\u003Cp\u003E\nStarted the day at the \u003Cem\u003EOcean Ranger\u003C/em\u003E outpost on Gilly, where I shot up 2000 units of Ore via mass driver to the \u003Cem\u003ESamwell Tarly Yards\u003C/em\u003E in orbit; switching over to the Yards completed a contract to deliver said ore to Gilly orbit. Granted, that ore was supposed to come from Eve, but if the game isn\u0027t going to keep track of that, I sure ain\u0027t (in fairness, I had drilled up that much from the \u003Cem\u003EAlexander L. Kielland\u003C/em\u003E outpost on Eve on Thursday). Followed that up with a delivery of fuel supplies and Rocket Parts via mass driver from the \u003Cem\u003ESouth Base\u003C/em\u003E outpost near \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to LSV \u003Cem\u003EHouse Atreides\u003C/em\u003E in orbit, the ship having freshly arrived from Eve and Jool the previous day. After that it was to Mission Control for some fresh contracts.\n\u003C/p\u003E\n\u003Cp\u003E\nI picked up a tourist contract where one of my tourists was headed to the surface of Eve, and a two-kerbal colonist contract for Minmus. With no ferry ships currently available at space station \u003Cem\u003EKerbinport\u003C/em\u003E to begin conducting these missions and with enough colonists headed out otherwise to warrant doing so (I already had another nine-kerbal colonist contract for Duna), I reluctantly ordered up the construction of the \u003Cem\u003EMinnow 7b\u003C/em\u003E touring craft \u003Cstrong\u003E\u003Cem\u003ERoy Hinkley\u003C/em\u003E\u003C/strong\u003E at the \u003Cem\u003EDystopia Planitia\u003C/em\u003E orbital shipyard over Kerbin. Shipyard engineer Ceri Kerman will have the craft finished in 34 hours. Meanwhile, \u003Cem\u003EStrange Cargo\u003C/em\u003E departed \u003Cem\u003EHouse Atreides\u003C/em\u003E and set course for space station \u003Cem\u003EKerbinport\u003C/em\u003E, reaching an intercept point 25 minutes later and burning to set a rendevous then - flight time to the rendezvous will be 58 minutes.\n\u003C/p\u003E\n\u003Cp\u003E\nRest of my play time was spent over Bop, beginning by moving LSV \u003Cem\u003EHouse Harkonnen\u003C/em\u003E from the ugly orbit that I put her in a few days ago into something a little more operationally better. Had to use the ship\u0027s conventional engines for the job, and it was definitely slow going.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ge2PJzo.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/Ge2PJzo.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E\u003Cem\u003EYou can barely see the flames of the ship\u0027s twin Poodle engines, but they\u0027re definitely there if you look hard enough. In this screenie, \u003C/em\u003EHarkonnen \u003Cem\u003Ehad burned below the safe altitude for Bop; burning radially out to rectify that.\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUltimately the ship settled into a 68.5 x 26.8 kilometer, 3.39° inclined orbit, which was good enough. Fuel was transferred back into the main tanks of \u003Cem\u003ENext Objective\u003C/em\u003E, \u003Cem\u003EJ. G. Backus\u003C/em\u003E and \u003Cem\u003EGilligan\u003C/em\u003E all docked to \u003Cem\u003EHarkonnen\u003C/em\u003E, and one by one the craft departed the ship. Both \u003Cem\u003ENext Objective\u003C/em\u003E and \u003Cem\u003EJ.G. Backus\u003C/em\u003E burned for individual rendezvous with space station \u003Cem\u003EBopport\u003C/em\u003E, with the two scheduled to arrive in a little over 70 minutes; there\u0027s about ninety seconds worth of spread between the scheduled arrival times of the two craft. \u003Cem\u003EGilligan \u003C/em\u003Eburned to rendezvous with the \u003Cem\u003EImo Pyramis Shipyards\u003C/em\u003E; Jeb will be dropping off engineer Luddorf Kerman there, where the latter will be taking up his permanent post and bring the shipyard permanently online.\n\u003C/p\u003E\n\u003Cp\u003E\nI also availed myself of the opportunity to send the \u003Cem\u003EBill Clinton 7c\u003C/em\u003E probe hauling \u003Cem\u003EDeoly\u0027s Pod\u003C/em\u003E these last few weeks over to rendezvous with \u003Cem\u003EHarkonnen\u003C/em\u003E. After an hour\u0027s flight time, the probe arrived and docked at \u003Cem\u003EHarkonnen \u003C/em\u003Esafely.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022i1gKgDl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/i1gKgDl.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003EI bet Deoly\u0027s really ready to get out of that box by now. Incidentally, about five seconds after I took this screenie, the two craft crossed the terminator into night and I lost my light...it happened just as the probe docked. Glad I got this screenshot when I did...\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMy day ended with the completion of the \u003Cem\u003EHodor 7\u003C/em\u003E nuclear battery being built at the \u003Cem\u003EBi-La Kaifa Shipyards\u003C/em\u003E over Duna. First thing on the agenda for my next play session is to fuel the thing up and then get it over to SL \u003Cem\u003EShai Hulud \u003C/em\u003Estill in Duna\u0027s orbit. I\u0027m still not confident that the addition of the battery to \u003Cem\u003EShai Hulud\u0027s \u003C/em\u003Estack will solve the ship\u0027s power issues nor do I yet know if the mass driver will break off the first time I go to activate the warp bubble (on account of it not being wholly contained within the bubble - a big no-no with the Alcubierre Drive mod). Only time will tell there...\u003Cbr\u003E\u003Cbr\u003E\nI\u0027ll also be sending up the next batch of tourists and colonists. I have sixteen kerbals to send up at the moment, so an \u003Cem\u003EAuk VII\u003C/em\u003E spaceplane flight will be in order - I seem to recall having done some changes to the craft\u0027s \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E systems after the last \u003Cem\u003EAuk VII\u003C/em\u003E flight, so hopefully docking won\u0027t be horribly slow. Only four of those kerbals will be heading back to the surface eventually, so at some point I\u0027ll want to make an \u003Cem\u003EAuk IX \u003C/em\u003Eflight as well - that need not happen today if higher priority items come up. I\u0027ve got my kerbal colonists headed to the \u003Cem\u003EBohai 2\u003C/em\u003E base on Bop, and I\u0027d like to be able to get \u003Cem\u003EHarkonnen \u003C/em\u003Eback to Kerbin ASAP - got to get my three ferry ships back to dock with the warp ship before that can happen, of course. I\u0027m considering sending my two scientists currently at \u003Cem\u003EKerbinport\u003C/em\u003E over to go help Ceri build \u003Cem\u003ERoy Hinkley\u003C/em\u003E; Ceri is a 5-star engineer (believe it or not), and even though they\u0027re scientists I\u0027ve learned that they can provide some productivity boost with an engineer present. It would be nice to not have the construction job take 5\u002B Kerbin days.  \n\u003C/p\u003E\n\u003Cp\u003E\nChores at home today, so I don\u0027t anticipate having too much to show for the rest of my weekend; I\u0027ll be sure to let y\u0027all know if anything interesting happens on Monday, though, if not sooner.\n\u003C/p\u003E\n"}]}