{"TopicId":27426,"ForumId":32,"TopicTitle":"Multiplayer (Hear me Out)","CreatedByName":"Stephen Stiles","CreatedById":66592,"CreatedDateTime":"2013-05-18T16:40:54Z","PageNum":1,"Articles":[{"CreatedByName":"Stephen Stiles","CreatedById":66592,"CreatedDateTime":"2013-05-18T16:40:54Z","Content":"\n\u003Cp\u003ESo, many people have brought up the topic of multiplayer and many have said they don\u0027t want it or will get griefed, this if my proposal for how it should work if ever implemented.\u003C/p\u003E\u003Cp\u003E It might be a good idea to only allow two player servers, this would have the main KSC and the other space center, this would lead to a space race close to that of Russia and America and maybe even more. Now, the time acceleration would go like this, you request to time accelerate and then the other player has to accept, after this you can tweak the acceleration all you want and then when you have managed all you need to, press some (I\u0027m done TA button). Now, back to the griefing, you do not have to play with someone you don\u0027t want to or even online at all, just play with your friend, if you don\u0027t have one start a server and maybe ask them some questions and if you don\u0027t like them leave, as simple as that. I would also propose that there is a private option for the server or at least a memory of the players it\u0027s meant for so no one else can join it. This means, if you and your friend agree (This option can be turned on or off depending on your agreement) one of you can expand what they are doing while the other is away, (again with the griefing don\u0027t pick bad partners). And this is my proposal for multiplayer which I find to be workable.\u003C/p\u003E\u003Cp\u003E (Do it so Jeb has a challenge) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003E(I did post this in another section but I thought it might be better suited here.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-18T16:44:48Z","Content":"\n\u003Cp\u003EThe Problem is not griefing but M\u003C/p\u003E\u003Cp\u003Emany technical isssues that make Multiplayer virtualy imposible.\u003C/p\u003E\n"},{"CreatedByName":"ShachonianX","CreatedById":62805,"CreatedDateTime":"2013-05-18T16:44:50Z","Content":"\n\u003Cp\u003EThis is an interesting idea for multiplayer.\u003C/p\u003E\n"},{"CreatedByName":"OdinYggd","CreatedById":26917,"CreatedDateTime":"2013-05-18T16:45:12Z","Content":"\n\u003Cp\u003EMultiplayer will not be implemented in the near future, due to a very severe limitation in that it currently is not possible to move multiple vessels with any kind of accuracy. \u003C/p\u003E\u003Cp\u003EIf it happens, it will be done as a mod developed by the game community- a lot of people are already working on the problem. \u003C/p\u003E\u003Cp\u003EThere are lots of threads about this scattered about, please read through them as nearly every aspect of what multiplayer for KSP should be like has been gone over.\u003C/p\u003E\n"}]}