{"TopicId":27676,"ForumId":32,"TopicTitle":"What is the hardest aspect of this game?","CreatedByName":"that1guy","CreatedById":14276,"CreatedDateTime":"2013-05-20T03:22:50Z","PageNum":1,"Articles":[{"CreatedByName":"that1guy","CreatedById":14276,"CreatedDateTime":"2013-05-20T03:22:50Z","Content":"\n\u003Cp\u003EI am just trying to figure out what people think the hardest thing to do in KSP is.\u003C/p\u003E\n"},{"CreatedByName":"Specula","CreatedById":27367,"CreatedDateTime":"2013-05-20T03:28:47Z","Content":"\n\u003Cp\u003EI\u0027d also add \u0027docking large vessels\u0027 to that list, but that\u0027s just me. For me, especially getting a BIG space plane up there, an SSTO is hard work.\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2013-05-20T03:43:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specula\u0022 data-cite=\u0022Specula\u0022\u003E\u003Cdiv\u003EI\u0027d also add \u0027docking large vessels\u0027 to that list, but that\u0027s just me. For me, especially getting a BIG space plane up there, an SSTO is hard work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, this would be a candidate. \u003C/p\u003E\u003Cp\u003EAnyways, SSTOs that serve any function other than to get in to space have been the biggest challenge for me.\u003C/p\u003E\n"},{"CreatedByName":"Splode","CreatedById":57337,"CreatedDateTime":"2013-05-20T03:44:19Z","Content":"\n\u003Cp\u003ESSTO is easy, SSTO plane is hard.\u003C/p\u003E\u003Cp\u003EI voted for deep space manned missions though, because getting those planetary encounters without mods is painful, and you end up using a huge amount of fuel if you get it wrong.\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2013-05-20T06:22:37Z","Content":"\n\u003Cp\u003EI\u0027d say, triple docking an orange tank to a 4-nuke drive stage, looking through your hands as you start the transfer burn with a mainsail ( I was getting about 20 degrees of flex), then sitting through all of it.\u003C/p\u003E\u003Cp\u003EAlthough triple docking isn\u0027t too hard, as long as you have a clean final approach, you do need to get to know fine controls.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-05-20T06:26:04Z","Content":"\n\u003Cp\u003EGetting a spaceplane into orbit will kill more time (and kerbals!) than all those others combined, I\u0027ve found. Getting a vertically launched SSTO into orbit is a lot easier, however.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-20T06:28:09Z","Content":"\n\u003Cp\u003EThe only reason spaceplanes is hard is due to the physics model. If we had a proper physics model based on aerodynamics it would help a lot.\u003C/p\u003E\u003Cp\u003EI think the only real hard part is matching orbits and docking as we see a TON of these \u0022Help me to dock\u0022 threads.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-05-20T06:32:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EThe only reason spaceplanes is hard is due to the physics model. If we had a proper physics model based on aerodynamics it would help a lot.\u003Cp\u003EI think the only real hard part is matching orbits and docking as we see a TON of these \u0022Help me to dock\u0022 threads.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know about the aerodynamics model...I\u0027ve tried FAR and I couldn\u0027t even get a plane off the ground. That could just be me though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think the main reason behind all those docking help threads is simply that docking requires you to have some technical know-how and a bit of skill, but after you\u0027ve mastered the basics you can dock with ease. Spaceplanes require you to have super piloting skills, as a design that got into orbit one attempt can\u0027t even get into space on another, depending on your piloting skill.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-05-20T06:50:10Z","Content":"\n\u003Cp\u003ESSTO spaceplanes by far. I\u0027m a pretty seasoned veteran of KSP and I have done pretty much everything on the list. However, I will always remember building my first SSTO spaceplane as one of my crowning achievements in the game.\u003C/p\u003E\n"},{"CreatedByName":"Krizzen","CreatedById":60464,"CreatedDateTime":"2013-05-20T07:01:21Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Single-stage-to-orbit\u0022 rel=\u0022external nofollow\u0022\u003ESSTO\u003C/a\u003E: A single-stage-to-orbit (or SSTO) vehicle reaches orbit from the surface of a body without jettisoning hardware, expending only propellants and fluids. The term usually, but not exclusively, refers to reusable vehicles.\u003C/p\u003E\u003Cp\u003EI build these all the time. SSTO spaceplanes are a different story.\u003C/p\u003E\n"},{"CreatedByName":"Tristavius","CreatedById":60879,"CreatedDateTime":"2013-05-20T07:32:22Z","Content":"\n\u003Cp\u003EReally haven\u0027t had ANY problems with most of the above... I\u0027m one of life\u0027s over-designers, as is necessary in my career. My friend showed me KSP for the first time and was amazed when my first 3 minute attempt at building a rocket launched, made orbit, landed on Mun and returned my Kerbal safely to Kerbin. Getting my head round some of the concepts, docking, interplanetary transfers, oberth effect etc has been a challenge, but actual rocket design is so, so simple when there\u0027s no budget (I\u0027d be terrible at it in career mode). Have never had a crash landing or had a mission objective fail, again always through over design. Hell, my \u0027Small Load\u0027 lifter is rated for nearly 40 tons, and it\u0027s very rare I\u0027d ever launch anything less than 25 tons into orbit... don\u0027t think I\u0027ve ever made anything smaller other than satellites, and I launch those in clusters of 6\u002B with a transfer carrier \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ESSTO however. Wow. I SUCK at SSTO. Been trying to build a crew transfer shuttle for WEEKS with absolute zero success. I also suck at flying in atmosphere. So yeah, the real challenge in KSP for me will be SSTO, until such times as I have a budget constraint, which I suspect I\u0027ll also be terrible at.\u003C/p\u003E\n"},{"CreatedByName":"elkar","CreatedById":57130,"CreatedDateTime":"2013-05-20T07:50:27Z","Content":"\n\u003Cp\u003EDocking. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E W/o any autopilot or docking cameras.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-20T09:01:39Z\u0022 title=\u002205/20/2013 09:01  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 20, 2013\u003C/time\u003E by elkar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Reavermyst","CreatedById":65325,"CreatedDateTime":"2013-05-20T08:30:30Z","Content":"\n\u003Cp\u003EI\u0027m saying SSTO basically because of reusable space program challenges. That\u0027s hard to accomplish without skill!\u003C/p\u003E\n"},{"CreatedByName":"AkalaÃƒÂ«l","CreatedById":58210,"CreatedDateTime":"2013-05-20T08:57:13Z","Content":"\n\u003Cp\u003EI\u0027ve voted for ssto, but the hardest thing I\u0027ve ever done is to learn docking (no MechJeb, no nothing, just my will and my sanity raises \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"Echostatic","CreatedById":59603,"CreatedDateTime":"2013-05-20T08:59:57Z","Content":"\n\u003Cp\u003EHardest thing for me so far has been getting onto Moho.\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2013-05-20T09:10:52Z","Content":"\n\u003Cp\u003EI\u0027m not gonna vote.\u003C/p\u003E\u003Cp\u003EBecouse nothing is hard! (not to sound like i\u0027m invinsible or on god mode or anything \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) and why??!\u003C/p\u003E\u003Cp\u003EIMO it just takes GOOD planning and patience, a calm mind and hand, and an iron will to get things done right the first time! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-05-20T09:14:47Z","Content":"\n\u003Cp\u003EYeah... biggest requirement for this game is... PATIENCE and lots of it or your Kerbonauts end up a PATIENTS instead... if they don\u0027t pop that is.\u003C/p\u003E\u003Cp\u003EActually, Kerbals should limp away from crash landings. Would give us even more empathy for them.\u003C/p\u003E\n"},{"CreatedByName":"MBobrik","CreatedById":59889,"CreatedDateTime":"2013-05-20T09:21:41Z","Content":"\n\u003Cp\u003ELanding jets. Landing jets accounts for most of my kerbal life loss.\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2013-05-20T09:25:01Z","Content":"\n\u003Cp\u003ESSTOs all the way. Actually, any SPH-built vehicle gives me trouble simply because no matter how much it looks like it will fly, it just doesn\u0027t (blames aerodynamics). I\u0027ve never even performed more than a sub-orbital hop with a spaceplane I built myself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanding a plane is also difficult for me. Once again, this is probably because what I make doesn\u0027t actually work and ends up hitting the ground too fast no matter how hard I try to slow the descent, engines or otherwise.\u003C/p\u003E\u003Cp\u003EApparently the hardest aspect of the game is docking, but I don\u0027t find it difficult at all.\u003C/p\u003E\n"},{"CreatedByName":"nats","CreatedById":58316,"CreatedDateTime":"2013-05-20T09:34:03Z","Content":"\n\u003Cp\u003EI havent voted because I cant believe you dont have docking on there - by far the most difficult, and frustrating, thing in the game! \u003C/p\u003E\u003Cp\u003EAnd also simply \u0027getting into space\u0027 is often difficult and requires me trying several times with a new rocket design so that should be on there as well.\u003C/p\u003E\u003Cp\u003EThirdly I would say just \u0027flying a plane\u0027 is very difficult to do in the game because of the terrible aerodynamics and lack of any drag. Without ASAS its impossible. So that should be on there.\u003C/p\u003E\u003Cp\u003EBut after that I would say landing on a planet.\u003C/p\u003E\u003Cp\u003EI havent tried any of the other things so I wouldnt know about them yet.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-20T09:39:39Z\u0022 title=\u002205/20/2013 09:39  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 20, 2013\u003C/time\u003E by nats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Francesco","CreatedById":58274,"CreatedDateTime":"2013-05-20T09:46:25Z","Content":"\n\u003Cp\u003Ecan\u0027t answer, you need to be more specific.\u003C/p\u003E\u003Cp\u003ESSTOs? yes and no, quite hard at the beginning, you need to learn a couple of tricks about planes.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003Erocket-only\u003C/em\u003E SSTOs (no jet engines)? with enough delta-v to escape the Sun, or reach another planet? then yes, definitely hard.\u003C/p\u003E\u003Cp\u003Elanding on other planets? yes and no.\u003C/p\u003E\u003Cp\u003ETylo and Moho are quite painful. Duna and Eve are a breeze. But try to come back from Eve...\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-05-20T10:35:18Z","Content":"\n\u003Cp\u003Evoted for SSTO\u0027s because, as others have mentioned, getting an SSTO that does anything \u0027useful\u0027 is really tricky. Best I\u0027ve managed so far is a SSTO plane that can deliver around 7tons to orbit, but its so impractical, takes ages to get into orbit and is way more complex compared to a rocket capable of delivering the same payload. Fun challenge thou.\u003C/p\u003E\n"},{"CreatedByName":"Truga","CreatedById":65006,"CreatedDateTime":"2013-05-20T11:44:30Z","Content":"\n\u003Cp\u003EEVE. Get there, land, get back with stock parts. Takes so much bloody time, just getting all the fuel there :\u0026lt;\u003C/p\u003E\n"},{"CreatedByName":"Kerolyov","CreatedById":62002,"CreatedDateTime":"2013-05-20T11:49:23Z","Content":"\n\u003Cp\u003ESSTO spaceplanes for me. Never managed a successful flight and landing yet.....\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Francesco\u0022 data-cite=\u0022Francesco\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESSTOs? yes and no, quite hard at the beginning, you need to learn a couple of tricks about planes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny good tutorials you can recommend? Thanks :-)\u003C/p\u003E\n"},{"CreatedByName":"CosmicX1","CreatedById":35008,"CreatedDateTime":"2013-05-20T12:03:20Z","Content":"\n\u003Cp\u003EDidn\u0027t vote because I find rendezvous the most difficult. Docking fairly straightforward if you\u0027re going very slow, however rendezvous is the only thing in KSP that I\u0027ve been able to unlearn!\u003C/p\u003E\n"}]}