{"TopicId":28308,"ForumId":32,"TopicTitle":"Duna Direct [Image Heavy]","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-05-23T03:21:33Z","PageNum":1,"Articles":[{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-05-23T03:21:33Z","Content":"\n\u003Cp\u003EFollowing the successful colonisation of Laythe, the Kerbal government decided to embark upon a new project: The colonisation of Duna. The Kerbal Space Agency had learnt much from the colonisation of Laythe, spacecraft designs capable of delivering large payloads to Duna were readily available and many proven vessels would only require minor modifications to Duna\u0027s slightly less hospitable environment. This mission was not solely a colonisation project, however, the KSA was eager to discover if there was evidence of liquid water having existed on the surface at some time in Duna\u0027s past in order to discover if Duna might previously have hosted life.\u003C/p\u003E\u003Cp\u003EIn order to facilitate this discovery, the University of Kerbridge offered to send their two foremost experts in the fields of Geology and Soil Microbiology to Duna: Meltop and Robald Kerman respectively. Unfortunately, the KSA had up to now primarily operated as a one-way space program, sending out Kerbals to colonise but only ferrying them up and down between the surface and the starbases of their respective planets. While the KSA would have loved to retain the expertise of these two towering intellects, the loss to the planet Kerbin of these two Kernobel prize winning scientists would be staggering. These Kerbals had to come home.\u003C/p\u003E\u003Cp\u003EAs Meltop and Robald underwent their astronaut training, the boffins at KSA got to work with a mission plan. Three ships would be sent to Duna. The first would be a rover carrying Meltop and Robald, this rover would survey the chosen landing site, an impact basin known as Celestia Planitia. The second ship would be a standard civilian tug carrying colonists and a Duna-capable SSTO VTVL rocket. The third was a further standard tug carrying the colony habitat.\u003C/p\u003E\u003Cp\u003EWith plans made, the mission began:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/E6iOa62.png\u0022 alt=\u0022E6iOa62.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rover is released from under its fairing before the commencement of the interplanetary burn.\u003C/p\u003E\u003Cp\u003EMeaningwhile, the SSTO, a modified standard shuttlecraft that simply shedded its jets once reaching LKO docked with a standard tug (the \u003Cem\u003EMaxwell\u003C/em\u003E) for the voyage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zrURyla.png\u0022 alt=\u0022zrURyla.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA shortwhile later, the colony module is dispatched, conveniently flying by the Mun to assist out to Duna orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LE0PBXs.jpg\u0022 alt=\u0022LE0PBXs.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAbout 100 days later....\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EMeltop and Robald are, of course, the first to arrive in system and get a glimpse of the planet first hand.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6I9G4mw.png\u0022 alt=\u00226I9G4mw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMission control talks them through the aerobrake...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rGMkhcz.jpg\u0022 alt=\u0022rGMkhcz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...and they are captured into Duna orbit. One more orbit and they are coming into land at the Celestia Planitia basin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/e3Nxepx.jpg\u0022 alt=\u0022e3Nxepx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was all worth it for this: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bDfvTba.png\u0022 alt=\u0022bDfvTba.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ratings suggest that over a billion Kerbals were watching KSA TV to witness the first two Kerbals on Duna. What is not in question is the fact that the KSA received over 10,000 job applications within a 10 minute period shortly after the broadcast. It was a day of togetherness amongst Kerbalkind, where all Kerbals could forget about their differences and reflect upon what they could accomplish when united.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMeanwhile:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAs Meltop and Robald got to work on the surface, the return vessel commenced its aerobrake into Duna orbit:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Q3B2KWz.jpg\u0022 alt=\u0022Q3B2KWz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E..and shortly after that, the colony follows suit:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0NADxy7.jpg\u0022 alt=\u00220NADxy7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe colonists aboard the Colony Tug \u003Cem\u003EBoltzmann\u003C/em\u003E disembark and board the colony for landing on the Duna surface, leaving the \u003Cem\u003EBoltzmann\u003C/em\u003E in orbit should any ship in the area be in need of refueling.\u003C/p\u003E\u003Cp\u003EAnd the colony performs a semi-powered landing on the surface: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FPwQXl3.jpg\u0022 alt=\u0022FPwQXl3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe colony is relocated to the site indicated by Meltop and Robald, where its engines and wheels are jettisoned for permanent placement and the parts recycled. One of the colonists was so excited he was jumping up and down in all of the pictures!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HUHw2PN.png\u0022 alt=\u0022HUHw2PN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETheir work close to completion and the colony set up, the modified shuttlecraft departs from the Tug \u003Cem\u003EMaxwell\u003C/em\u003E for landing near the colony site:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pnpDCye.jpg\u0022 alt=\u0022pnpDCye.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESome ferrying backward and forward of the colonists begins between the landing site and the colony, via the rover, though fortunately adaquate piloting placed the two just over 3km apart.\u003C/p\u003E\u003Cp\u003EMeltop and Robald board the shuttlecraft while Genefurt Kerman climbs atop the rover to wave them off:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/k3dMs06.png\u0022 alt=\u0022k3dMs06.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe two of them blast off back to orbit, waving goodbye to the base:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PwX3k23.jpg\u0022 alt=\u0022PwX3k23.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBack in orbit, they rendezvous with the \u003Cem\u003EMaxwell\u003C/em\u003E and Sonberry Kerman to pilot the heroes home. Not content to simply be passengers, the two astronauts hop aboard the bridge of the \u003Cem\u003EMaxwell\u003C/em\u003E to help out.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Kos2aKx.png\u0022 alt=\u0022Kos2aKx.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA short while later and after some chatter with mission control, the return burn is plotted and the 3 Kerbals set out for home.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bef5X8B.jpg\u0022 alt=\u0022bef5X8B.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Have we done it?! Is that home?!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UpvEdJc.png\u0022 alt=\u0022UpvEdJc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EExcitement becomes trepidation as mission control, eager to preserve all that fuel they still have in space (almost enough for another Duna round-trip), gives the order to aerobrake back into Kerbin orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AWqsmES.jpg\u0022 alt=\u0022AWqsmES.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMeltop and Robald hop back aboard the shuttle, leaving Sonberry to return the \u003Cem\u003EMaxwell\u003C/em\u003E to the Starbase for refueling and maintainance. They immediately commence their descent into KSC.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/f0NK0lI.png\u0022 alt=\u0022f0NK0lI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022Remind me again where the chute controls are! Quickly!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/whjc54n.jpg\u0022 alt=\u0022whjc54n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETouchdown overlooking KSC.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IhVsmyr.jpg\u0022 alt=\u0022IhVsmyr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThankfully, they hadn\u0027t been forgotten, indeed KSC was well prepared for their return and a welcoming party soon arrived. Every Kerbal on the planet wanted to be the first to welcome these intrepid individials but these three were those bestowed with that highest of honours.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/j6UTCf0.jpg\u0022 alt=\u0022j6UTCf0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEveryone at KSC breathes a sigh of relief, mission accomplished and with enough rocks and soil samples returned to keep scientists all over Kerbin occupied for the next decade. After a success like this, the University of Kerbridge might even trust KSA with more of its distuinguished yet surprisingly adventurous professors.\u003C/p\u003E\u003Cp\u003ESo, full of pride in the accomplishments of our brave Kerbals, I leave you with the plaque inscribed on the Celestia Planitia colony on Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Tiqq0ph.png\u0022 alt=\u0022Tiqq0ph.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dictator Dan","CreatedById":62863,"CreatedDateTime":"2013-05-23T05:01:13Z","Content":"\n\u003Cp\u003EI like the wheels on everything, and that rover on Kerbin is awesome!\u003C/p\u003E\n"}]}