{"TopicId":28639,"ForumId":32,"TopicTitle":"Thankyou Forums for solving my performance issues","CreatedByName":"Splode","CreatedById":57337,"CreatedDateTime":"2013-05-24T00:44:21Z","PageNum":1,"Articles":[{"CreatedByName":"Splode","CreatedById":57337,"CreatedDateTime":"2013-05-24T00:44:21Z","Content":"\n\u003Cp\u003EHi guys\u003C/p\u003E\u003Cp\u003EI was getting terrible frame rates on the launchpad upon installing .20.\u003C/p\u003E\u003Cp\u003EThen I read somewhere that subassembly loader could cause these problems.\u003C/p\u003E\u003Cp\u003EI remembered I hadn\u0027t actually cleaned up my mods folder, so I went in and deleted sub-assembly loader and the other plugins that weren\u0027t working.\u003C/p\u003E\u003Cp\u003ENow it runs better than it ever has.\u003C/p\u003E\u003Cp\u003EThankyou Squad for this optimisation,\u003C/p\u003E\u003Cp\u003Eand thankyou forums for being useful in spite of the community mostly degenerating into frustrated bronies.\u003C/p\u003E\n"},{"CreatedByName":"Pursuedtank","CreatedById":50078,"CreatedDateTime":"2013-05-24T01:01:47Z","Content":"\n\u003Cp\u003ENo Problemo. This forum has always been rather nice, which is a result of the game itself and the steep learning curve along with not appealing to everyone. It is refreshing to be on a forum where you don\u0027t see hundreds of threads of someone asking a question and people just posting Noob.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-05-24T01:47:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Splode\u0022 data-cite=\u0022Splode\u0022\u003E\u003Cdiv\u003E...the community mostly degenerating into frustrated bronies.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha, that\u0027s one way of describing the forum\u0027s current state. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I laughed when I read that!\u003C/p\u003E\u003Cp\u003EGlad to know you solved your problem; I\u0027m realizing how much I miss SubAssembly myself; I\u0027m just rebuilding launchers all the time. Something like that should be integrated into the stock game.\u003C/p\u003E\n"},{"CreatedByName":"unphased","CreatedById":66968,"CreatedDateTime":"2013-05-28T22:29:08Z","Content":"\n\u003Cp\u003EThanks for posting this!!! I was suffering from this same issue. \u003C/p\u003E\u003Cp\u003ENow there\u0027s no longer a chance for me to get any real work done anymore! Wohoooo!\u003C/p\u003E\n"}]}