{"TopicId":28732,"ForumId":32,"TopicTitle":"what kind of parts would you guys want? (beyond 0.20)","CreatedByName":"Veshpa","CreatedById":57786,"CreatedDateTime":"2013-05-24T07:10:14Z","PageNum":2,"Articles":[{"CreatedByName":"SZDarkhack","CreatedById":57439,"CreatedDateTime":"2013-05-24T12:01:35Z","Content":"\n\u003Cp\u003E-New aero parts, they really need an update even without new aerodynamics.\u003C/p\u003E\u003Cp\u003E-More stuff from KSPX.\u003C/p\u003E\u003Cp\u003E-Movable stuff, like the hinges from damned robotics.\u003C/p\u003E\u003Cp\u003E-I\u0027d like to see some propellers as well, to use with airplanes, helicopters and maybe even boats. Even better, the propellers should be separate from the engines exposing their axle, so we can attach whatever we want on it and have it spin around. For instance, artificial gravity sections that spin with electrical motors instead of radially attached rockets (in conjunction with some sort of bearings).\u003C/p\u003E\n"},{"CreatedByName":"Naiba","CreatedById":3221,"CreatedDateTime":"2013-05-24T12:06:21Z","Content":"\n\u003Cp\u003EAll the adapter parts from KSPX. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-05-24T12:10:10Z","Content":"\n\u003Cp\u003EThe lists of parts i\u0027d like to see is pretty much endless! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ERealisticly next update or two though; Probrably either mining parts of a redo of the areodynamics parts / mechanics. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-05-24T12:12:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wbcundiff\u0022 data-cite=\u0022wbcundiff\u0022\u003E\u003Cdiv\u003Edo you mean SAS parts? they have more torque than capsules don\u0027t they?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs it is, SAS modules provide \u003Cem\u003Eanti\u003C/em\u003Erotational torque. I.e. when you turn SAS on, more SAS torque will stop your rotation faster. However, there are no modules that provide \u003Cem\u003Erotational\u003C/em\u003E torque beside pods themselves, i.e. let you turn the ship faster without turning RCS on.\u003C/p\u003E\u003Cp\u003EShips using these new 0.20 probe cores will turn no better than ships using the smallest and lightest probe cores, as they provide the same amount of rotational torque despite the extra weight and power requirements.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-05-24T12:13:46Z","Content":"\n\u003Cp\u003EI think they need a wider selection of landing gear for planes.\u003C/p\u003E\u003Cp\u003EAfter that I want that rover from the new video, preferably fold-able and stow-able on the side of a lander.\u003C/p\u003E\n"},{"CreatedByName":"JSD","CreatedById":57153,"CreatedDateTime":"2013-05-24T12:27:56Z","Content":"\n\u003Cp\u003EI want..\u003C/p\u003E\u003Cp\u003EThis;\u003C/p\u003E\u003Cp\u003E(Detecor)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9ivHBht.png\u0022 alt=\u00229ivHBht.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Other view)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Za388qlh.png\u0022 alt=\u0022Za388qlh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Small version)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3QEHQdc.jpg\u0022 alt=\u00223QEHQdc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENova\u0027s amazing work. Can\u0027t wait to see that on one of my crafts to detect some resources \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-05-24T12:32:10Z","Content":"\n\u003Cp\u003EI would rather have parts or features that make satilites useful. Like a mapping device of sorts.\u003C/p\u003E\n"},{"CreatedByName":"Matticus88","CreatedById":30754,"CreatedDateTime":"2013-05-24T12:37:52Z","Content":"\n\u003Cp\u003EI think the game needs more of the existing parts, but in more sizes. its annoying adding a huge SAS to a tiny rover.\u003C/p\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-05-24T12:40:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Matticus88\u0022 data-cite=\u0022Matticus88\u0022\u003E\u003Cdiv\u003EI think the game needs more of the existing parts, but in more sizes. its annoying adding a huge SAS to a tiny rover.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy do you need an SAS on a rover? If you\u0027re on the ground you don\u0027t need it.\u003C/p\u003E\n"},{"CreatedByName":"Kerbface","CreatedById":58573,"CreatedDateTime":"2013-05-24T12:52:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rage097\u0022 data-cite=\u0022Rage097\u0022\u003E\u003Cdiv\u003EI would rather have parts or features that make satilites useful. Like a mapping device of sorts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf they ever introduced wind, maybe a weather sattelite could tell you when a wind was headed your way so you could know whether launches were safe or not.\u003C/p\u003E\n"},{"CreatedByName":"comham","CreatedById":43245,"CreatedDateTime":"2013-05-24T13:00:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rage097\u0022 data-cite=\u0022Rage097\u0022\u003E\u003Cdiv\u003EI would rather have parts or features that make satilites useful. Like a mapping device of sorts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey generally only add parts to the stock game when there\u0027s a mechanic which uses them.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-05-24T13:05:21Z","Content":"\n\u003Cp\u003EPressurised cockpit and tracks for the rovers. More science equipment. Personal parachutes for kerbals. Radar!\u003C/p\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-05-24T13:07:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EPressurised cockpit and tracks for the rovers. More science equipment. Personal parachutes for kerbals. Radar!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDude...we can make a paratrooper science tank!\u003C/p\u003E\n"},{"CreatedByName":"AkalaÃƒÂ«l","CreatedById":58210,"CreatedDateTime":"2013-05-24T13:10:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Kalawang\u0022 data-cite=\u0022Captain Kalawang\u0022\u003E\u003Cdiv\u003E\u003Cem\u003Eworking\u003C/em\u003E science parts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree !\u003C/p\u003E\u003Cp\u003EThing that I need now is parts making sens to the game : doing sience, search for resources, gather resources, use those resources to... whatever ! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cypher_00","CreatedById":61486,"CreatedDateTime":"2013-05-24T13:12:58Z","Content":"\n\u003Cp\u003EYes i agree more working science parts would give me some nice new goals in the game.\u003C/p\u003E\n"},{"CreatedByName":"Specula","CreatedById":27367,"CreatedDateTime":"2013-05-24T13:18:39Z","Content":"\n\u003Cp\u003EI\u0027d love to see the old small liquid fuel tanks come back... I loved those things... =\\\u003C/p\u003E\n"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2013-05-24T13:22:07Z","Content":"\n\u003Cp\u003ELittle SAS/ASAS (0.65m)\u003C/p\u003E\u003Cp\u003EPayload fairings (maybe with improved aerodynamics? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003EBetter IVA implementation\u003C/p\u003E\u003Cp\u003EA sort of hot air balloons \u003C/p\u003E\u003Cp\u003EBigger engines \u002B fuel tanks (5m would be perfect)\u003C/p\u003E\u003Cp\u003EMore EVA actions\u003C/p\u003E\n"},{"CreatedByName":"PolecatEZ","CreatedById":58008,"CreatedDateTime":"2013-05-24T13:35:19Z","Content":"\n\u003Cp\u003EMy wishlist:\u003C/p\u003E\u003Cp\u003E- Lighter Landing Gear (little fixed wheels, like tail-draggers use)\u003C/p\u003E\u003Cp\u003E- Rectangular air intakes like on 80\u0027s era fighter jets\u003C/p\u003E\u003Cp\u003E- Drop tanks of various sizes and types\u003C/p\u003E\u003Cp\u003E- Giant and mini versions of the nuke and ion engine\u003C/p\u003E\u003Cp\u003E- Propeller in 2 sizes, airplane prop size and helicopter blade size\u003C/p\u003E\u003Cp\u003E- Station modules, including hydroponics and science lab types\u003C/p\u003E\u003Cp\u003EFeature\u003C/p\u003E\u003Cp\u003E- EVA boosters remain active when on a ladder (so Kerbals can grab small things and move them around in orbit)\u003C/p\u003E\n"},{"CreatedByName":"legodragonxp","CreatedById":7204,"CreatedDateTime":"2013-05-24T13:41:04Z","Content":"\n\u003Cp\u003EA gyro driven automatic vehicle orientation system. Basically this is an SAS type unit that can be targeted at an object so that whatever the orientation of that object it, it remains so with the targeted object. This would be a power consuming device. The reason I want this is so that I can orient satellites and stations with Kermin (or a moon) so that they are always oriented the right way (like a geosync sat so that its antenna always points at Kermin).\u003C/p\u003E\u003Cp\u003EProgrammable counter-weights. Either as an item of its own or a function of the symmetry system, when I place something on one side of a craft, it will place a weight of equal mass on the other side of the craft. Example: I don\u0027t need a ladder on both sides of my Mun lander, but if I don\u0027t do it it is unbalanced. \u003C/p\u003E\u003Cp\u003E-Lego\u003C/p\u003E\n"},{"CreatedByName":"Momentosis","CreatedById":66309,"CreatedDateTime":"2013-05-24T13:42:57Z","Content":"\n\u003Cp\u003EMore Utility Parts.\u003C/p\u003E\u003Cp\u003EAnd more/better IVAs.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-05-24T13:43:33Z","Content":"\n\u003Cp\u003EMy top 7 list:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EHollow parts like Fairings and inter-stages \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore engines and thrusters\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGrapple based robotic arms\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECables and umbilicals (resources transfer)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInflatable/expandable modules (trans-hab, inflatable heat shields) and structures (trusses, ISS size panels)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Elarger diameter parts (engines no larger than 2.5m)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESegmented Srb\u0027s \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAbout IVA spaces - I would like to see trough front windows (designed for docking ?) of MK1-2 pod like in planes (can\u0027t see anything bellow horizon) what is in front of me... kerbals are short and their eye-level is not matching windows so it feels like driving a car when sitting on car floor (no seat), You had nice view of the sky but no visual feedback \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-24T14:00:12Z\u0022 title=\u002205/24/2013 02:00  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 24, 2013\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2013-05-24T13:45:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022karolus10\u0022 data-cite=\u0022karolus10\u0022\u003E\u003Cdiv\u003EMy top 7 list:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EHollow parts like Fairings and inter-stages \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore engines and thrusters\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGrapple based robotic arms\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003ECables\u003C/strong\u003E and umbilicals\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInflatable/expandable modules (trans-hab, inflatable heat shields) and structures (trusses, ISS size panels)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Elarger diameter parts\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESegmented Srb\u0027s \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, i forgot this, it would be epic to connect for example the different module of Mun Base (Like on Moonbase Alpha)\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2013-05-24T13:49:40Z","Content":"\n\u003Cp\u003EHere is my vision for stuff that is kind of sort of necessary\u003C/p\u003E\u003Cp\u003E1) Base packs. We need stuff to really build ground side bases. Modules that \u0022make sense\u0022 for the ground, but not so much up in space. Things like like the horizontal inflatable habs here\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://2.bp.blogspot.com/-mORElcl8KBc/T8lQ4Jnm34I/AAAAAAAAVJE/e7eVha0vQhU/s320/marsone2.png\u0022 alt=\u0022marsone2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://4.bp.blogspot.com/-aUap2h_zXMI/UPdZHjSUYtI/AAAAAAAAJfQ/QwiHJRx0esQ/s1600/Bigelow%2Blunar.jpg\u0022 alt=\u0022Bigelow%2Blunar.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThose can also be used on stations and stuff. They should also be able to contain Kerbals when inflated (but not when they are in travel mode). Some of the base parts would be nice if they were half cylinders or hemispherical domes so you could rest them directly on the ground. A couple of \u0022cool\u0022 pieces like a partially transparent hydroponics module and maybe a (top) transparent observation/recreation dome would be neat (for when your Kerbals want to hang out in style and enjoy the view). Rover garages with closeable doors?\u003C/p\u003E\u003Cp\u003E2) Moar station parts. Those inflatable modules would be cool for stations as well. An inflatable ring that rotates would be cool (yeah, Bobcat has one, I know). The Ring should also be able to contain Kerbals when inflated. What would be nice for stations (and bases) is a probe sized solid \u0022tunnel\u0022 connector with 1.5m adapters on each side. You can use them to connect parts together (roughly half large truss size in length maybe? Or have both half size and full length versions) and they can act as \u0022tunnels\u0022 between modules for your Kerbals. A partially transparent hydroponics module would be neat.\u003C/p\u003E\u003Cp\u003E3) Some more realism parts. Maybe a couple of additions of asthetic parts, like high gain antennas (yes, I know there is already one, but a bigger size would be cool too, or maybe a 4 panel high gain, kind of like the Apollo one). Docking cameras would be VERY nifty for a whole slew of reasons (such as some cool realism for probes, but also to aid in docking). Radiators to dissipate heat would be nice as well. I think Nova did a folding one awhile back that was purely cosmetic around .16 or something. It would be nice to see that back, but actually reducing heat at least slightly from ships (so maybe you could run the NERVA engines full steam or something)\u003C/p\u003E\u003Cp\u003E4) New capsules and lander cans. Something roughly Apollo like would be cool for a 2 person lander can. A 2 man capsule, either longer 1.5m, but heavier than the 1 man or a shorter 2.5m, but lighter would be nice (Gemini like). A spherical 3 kerbal 1.5m capsule (1.5m connector maybe, but 2.5m in diameter) similar to the spherical probe for things like stations and deep space vessels would rock my world.\u003C/p\u003E\u003Cp\u003E5) Working docking bays. Not a whole lot more to explain on that one, but working 1.5m and 2.5m docking bays, maybe in two lengths for 1.5m and three lenghts for 2.5m (1.5m in both \u0022standard fuel tank\u0022 and \u0022jumbo\u0022 lengths and 2.5m in short, standard and jumbo lengths). The smaller bays can be for probes basically and the larger sized ones can be for big probes or very small 1.5m diameter ships.\u003C/p\u003E\u003Cp\u003E6) Working robotic arms. Very cool and very useful for things like orbital and base construction (so long as moderately strong with a real grasper on them). To bolster this one, grasper handles that you can attach to things to make it easy for the robotic arm to grab it\u003C/p\u003E\u003Cp\u003E7) Nukes! Err, I mean nuclear power plants. This is mostly for later on with resources to provide high power for refining stuff\u003C/p\u003E\u003Cp\u003E8) Parts for extracting and mining resources\u003C/p\u003E\u003Cp\u003E9) Moar science. It would be cool to see a few new science instruments. Ones that occur off the top of my head are magnometer, geiger counter, radar, docking radar and soil sample tester. The former I\u0027d think would be rather easy to implement. Just add a stat to planets where some generate magnetic fields and have it vary with the distance from the planet (it doesn\u0027t have to be uber realistic). Geiger counters could either be done super simple (higher readings the closer to the sun, drops down in the shade and maybe one or more planets are rather radioactive) or you could make them a little more complex, where planets with magnetic fields have van alan belts that you model simplistically. Radar...well, I am guessing something like that is needed for resource extraction, but it would be cool to stock be able to \u0022map\u0022 each planetary body. Docking radar, you could have it set up so that any object (debris or ship) that isn\u0027t part of the existing ship will generate a \u0022ping tone\u0022 that is within physics modeling range (the roughly 2.2km or whatever it is). It is generated based on the closest ship and only when the docking radar is activated. The closer the ship the faster the ping. So far away it might be a beep/ping every 30s or something, but get to like 100m and it is up to maybe 1 per 2s, then at 10m it is more like 2 beeps per second and faster and faster until it stops when you\u0027ve docked solid. Soil sample tester...to be implemented with resources?\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-05-24T13:56:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BuzzKerman\u0022 data-cite=\u0022BuzzKerman\u0022\u003E\u003Cdiv\u003Edynamically sizeable fuel tanks. The diameter can be fixed, and selectable from the parts lists, but you would be able to adjust length according to your mission profile.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was thinking the same\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2013-05-24T13:57:24Z","Content":"\n\u003Cp\u003E- Payload fairings\u003C/p\u003E\u003Cp\u003E- Robotic Arms and/or Hinges\u003C/p\u003E\u003Cp\u003E- Mining/Gathering Equipment\u003C/p\u003E\u003Cp\u003E- Nuclear Engine w/o need for oxidizer \u002B Fuel Tanks with configuration fuel type (Liquid vs Liquid \u002B Oxidizer)\u003C/p\u003E\u003Cp\u003E- FLAT clamp-o-tron/Jr. docking ports (like the new Sr. port)\u003C/p\u003E\u003Cp\u003E- Smaller Lights\u003C/p\u003E\u003Cp\u003E- More variety of Monopropellant tanks (capacity, size and shape)\u003C/p\u003E\u003Cp\u003E- Life support systems (oxygen/food/water)\u003C/p\u003E\u003Cp\u003E- More variety of \u0022hitch-hiker\u0022 type modules\u003C/p\u003E\u003Cp\u003E- More science equipment: robotic arm/grabber, telescope, camera, oven, microscope, smaller parabolic dish, etc.\u003C/p\u003E\n"}]}