{"TopicId":28872,"ForumId":32,"TopicTitle":"Why do SRBs burn out so quick?","CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2013-05-24T19:45:23Z","PageNum":1,"Articles":[{"CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2013-05-24T19:45:23Z","Content":"\n\u003Cp\u003EI was watching some NASA footage and SRBs last like, 2 minutes...\u003C/p\u003E\u003Cp\u003Eis it because kerbin is smaller so they tried to balance them out? i think longer lasing SRBs would lead to people making ships with a lot less staging, and really help with heavy lifters. it might even help the people with weak computers. idk.\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2013-05-24T19:53:19Z","Content":"\n\u003Cp\u003EI believe you answered your question. Everything is smaller scale.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-05-24T19:56:31Z","Content":"\n\u003Cp\u003EWoth some clever designing choices, you can make it to orbit with as few as 2 or 3 stages.\u003C/p\u003E\n"},{"CreatedByName":"legoheli","CreatedById":47640,"CreatedDateTime":"2013-05-24T19:59:57Z","Content":"\n\u003Cp\u003EYou can make it to orbit in one stage with no problem at all using throttling and simple design.\u003C/p\u003E\u003Cp\u003EThe SRBs in KSP are only \u0022really\u0022 useable for showing off. Using liquid boosters is much more effecient, and the real world limitation of liquid boosters being expensive is something we are completely able to ignore. Of course it\u0027s a lot easier to throw SRBs on than LFBs.\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2013-05-24T20:09:03Z","Content":"\n\u003Cp\u003EI disagree, IMHO, they are really rather useful, as they have a massive ISP, and they, have an enormous thrust, and they can get you past the first 200 metres really easily.\u003C/p\u003E\n"},{"CreatedByName":"Anglave","CreatedById":62706,"CreatedDateTime":"2013-05-24T20:19:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llamatoes\u0022 data-cite=\u0022llamatoes\u0022\u003E\u003Cdiv\u003EI disagree, IMHO, they are really rather useful, as they have a massive ISP, and they, have an enormous thrust, and they can get you past the first 200 metres really easily.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou think 230-250 ISP is \u0022massive\u0022?\u003C/p\u003E\u003Cp\u003EThey\u0027re sometimes useful as first-stage boosters (as they\u0027re intended to be). Where high thrust and low ISP are best. But carrying \u003Cem\u003Eany\u003C/em\u003E low efficiency engine longer into your flight or mission is a bad idea. Boosters are no exception.\u003C/p\u003E\n"},{"CreatedByName":"llamatoes","CreatedById":57750,"CreatedDateTime":"2013-05-24T20:24:50Z","Content":"\n\u003Cp\u003EThey still have a great TWR, and that\u0027s good enough for me.\u003C/p\u003E\n"},{"CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2013-05-24T20:29:18Z","Content":"\n\u003Cp\u003Eyeah i guess that makes sense, real life liquid fuel and engines are hella expensive\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-05-24T21:26:08Z","Content":"\n\u003Cp\u003EI find two stage to orbit with stage zero boosters to be sufficient for most missions. If you think SRBs are underpowered now, you should have seen them pre-0.17; they were horrible in every sense of the word\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-05-25T04:19:49Z","Content":"\n\u003Cp\u003EDoes anyone know the scale height of the Earth v Kerbin atmosphere and the typical burn out altitude for the STS SRBs v Kerbal SRBs? Maybe it\u0027s in good scale.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-25T04:47:38Z","Content":"\n\u003Cp\u003EOK, for KSP SRB\u0027s to have a comparable burn time to STS SRB\u0027s, they would have to burn for ~76 seconds. Has anyone clocked stock SRB burn time? No, I haven\u0027t compared ISP data. It\u0027s late and I\u0027m knackered.\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2013-05-25T04:57:24Z","Content":"\n\u003Cp\u003E28s / 46s\u003C/p\u003E\u003Cp\u003EBut remember that kerbin is 10.6x smaller... so scale should be a bit similar.\u003C/p\u003E\n"},{"CreatedByName":"Brofessional","CreatedById":2080,"CreatedDateTime":"2013-05-25T05:29:41Z","Content":"\n\u003Cp\u003EI still use them on my first stage. The fact that they always burn for the same length of time makes it easier to time separations with them. With LFB\u0027s you have to do more work to make sure your mainsails don\u0027t burn through fuel faster than the boosters.\u003C/p\u003E\n"},{"CreatedByName":"biggles1","CreatedById":67622,"CreatedDateTime":"2013-05-25T06:15:52Z","Content":"\n\u003Cp\u003EUsually I build a 3-stage liquid boosted rocket, then slap some big SRB\u0027s on for lolz and giggles. Plus it looks hella impressive.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-25T06:20:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fel\u0022 data-cite=\u0022Fel\u0022\u003E\u003Cdiv\u003E28s / 46s\u003Cp\u003EBut remember that kerbin is 10.6x smaller... so scale should be a bit similar.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was working from the standpoint of the real world SRBs burning for 120 seconds, then took 64% of that for the relative differential, and came up with ~76 seconds. Feel free to skewer my maths, as I\u0027m not that attached to them anyway (meaning, I\u0027ll gladly accept informed correction since I was purely spitballing). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-05-25T06:23:51Z","Content":"\n\u003Cp\u003ESRBs represent \u0022free\u0022 boost out of lower atmosphere, in that the containers and engines are considered disposable (at least in KSP). I think the initial thinking in adding the boosters was along the same lines, but players quickly figured out you can toss out whole liquid fuel engines just as easily anyway and get better lower atmosphere performance in the process.\u003C/p\u003E\u003Cp\u003EWait until Career Mode makes an appearance. You won\u0027t be so quick to pounce on those orange tank/mainsail combo boosters after that! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-05-25T11:32:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deadweasel\u0022 data-cite=\u0022Deadweasel\u0022\u003E\u003Cdiv\u003ESRBs represent \u0022free\u0022 boost out of lower atmosphere, in that the containers and engines are considered disposable (at least in KSP). I think the initial thinking in adding the boosters was along the same lines, but players quickly figured out you can toss out whole liquid fuel engines just as easily anyway and get better lower atmosphere performance in the process.\u003Cp\u003EWait until Career Mode makes an appearance. You won\u0027t be so quick to pounce on those orange tank/mainsail combo boosters after that! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think a lot of designs will have to be rethought if price/performance ratio is an issue. A SRB is really cheap for what it does. eight of them is like having two extra main engines for the hardest bit of the launch. The extra performance of the liquid engines probably comes with a high cost premium.\u003C/p\u003E\u003Cp\u003EI think the CORE engine expansion has SRBs that last about 2 minutes. I use them and then stack a stock SRB to the outside of that to get a more realistic looking craft (which will fly better when they introduce more realistic aerodynamics)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-25T12:29:57Z\u0022 title=\u002205/25/2013 12:29  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 25, 2013\u003C/time\u003E by John FX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-05-25T12:22:30Z","Content":"\n\u003Cp\u003EBurn time of SRB depend from 2 variables: diameter and fuel grain burn rate. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://engineering.purdue.edu/~propulsi/propulsion/images/rockets/solids/schematic.jpg\u0022 alt=\u0022schematic.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESRB burn from center shaft to booster walls, so thicker layer of fuel (this green stuff on picture) = longer burn time, so both 1.25m boosters should had nearly identical burn time if they used same fuel inside.\u003C/p\u003E\u003Cp\u003EIncreasing only length of the booster (or stacking more fuel segments if we had modular one) can\u0027t increase burn time - it\u0027s increasing chamber pressure (more fuel burning at once) causing increase of thrust (longer booster = more thrust).\u003C/p\u003E\u003Cp\u003ESecond variable changing burn time is fuel grain size (other structural and chemical composition, pretty much different variants of solid fuel), different fuel is burning at different pace.\u003C/p\u003E\u003Cp\u003EFor example we can use faster burning fuel to increase SRB trust in expense of burn time (and risk of too large pressure/heat inside =\u0026gt; explosion) or slower burning fuel to get longer (but weaker) burning boosters or to avoid blowing up modular SRB with too many segments (every next fuel segment add-up pressure and trust to SRB) stacked up.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-25T12:35:54Z\u0022 title=\u002205/25/2013 12:35  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 25, 2013\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"}]}