{"TopicId":28974,"ForumId":32,"TopicTitle":"Your Biggest Fail in KSP!","CreatedByName":"gmpd2000","CreatedById":37101,"CreatedDateTime":"2013-05-25T03:56:40Z","PageNum":4,"Articles":[{"CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2013-06-23T23:46:29Z","Content":"\n\u003Cp\u003EAttempting to go to Minmus, and having my transfer stage explode entirely right as I separate it from the previous stage. (It was a base I was taking there)\u003C/p\u003E\u003Cp\u003EI still made it there... barely.\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-06-24T01:09:57Z","Content":"\n\u003Cp\u003EPressing shift instead of caps lock on approach to a space station. With the main engine activated.\u003C/p\u003E\n"},{"CreatedByName":"Sir Nahme","CreatedById":57378,"CreatedDateTime":"2013-06-24T01:23:33Z","Content":"\n\u003Cp\u003EMy only regret is that... I have... boneitis...\u003C/p\u003E\n"},{"CreatedByName":"M83","CreatedById":68926,"CreatedDateTime":"2013-06-24T03:43:08Z","Content":"\n\u003Cp\u003EMy biggest fail in KSP had to be my failed Eve rover that missed landing by 2-3 units of liquid fuel. I\u0027d set it up to just enter Eve\u0027s SOI and land but I could only get my periapsis down to 200,000m before the fuel ran out.\u003C/p\u003E\n"},{"CreatedByName":"ninjakids","CreatedById":70896,"CreatedDateTime":"2013-06-24T06:33:41Z","Content":"\n\u003Cp\u003EI landed on Duna. But it started tilting. Then it fell over and BOOM! All Kerbals died.\u003C/p\u003E\n"},{"CreatedByName":"Kialar","CreatedById":60893,"CreatedDateTime":"2013-06-24T07:04:20Z","Content":"\n\u003Cp\u003EAttempting a SSTO, I found out that it should read \u003Cstrong\u003ESingle Stage To Ocean\u003C/strong\u003E.\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2013-06-24T07:57:20Z","Content":"\n\u003Cp\u003ECreating a big interplanetary vessel to go to Jool and all it\u0027s moons, only to realize way to late that i\u0027m going the wrong way around Jool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Valanthe","CreatedById":64388,"CreatedDateTime":"2013-06-24T08:35:06Z","Content":"\n\u003Cp\u003EWell I don\u0027t have any pics, because I didn\u0027t know how to take them back then (I do now). but my biggest fail was in making my Mun mining base, I had sent up a Mapsat and a Kethane Scanner satellite to pick a good landing site near a kethane pocket. my next mission was to send up a lander with a rover to scout the area. Ran out of fuel in the lander, so I crash landed, miraculously, the pod and the rover survived, but ended up almost 20km from my proposed landing site, So I said \u0022Hey I can still do this,\u0022 loaded Jeb into the rover, got it onto its wheels, and began scooting towards the site. Then it all went horribly wrong when I skipped off an errant bump, my rover flipped into the air, I managed to eject Jeb in time and soft land him thanks to his jet pack, but the rover was a complete loss. So now I have Jeb stuck in the middle of nowhere, and Bill and Bob are sitting in what\u0027s left of the lander, all awaiting me to build a rescue ship.\u003C/p\u003E\n"},{"CreatedByName":"Cordeos","CreatedById":70178,"CreatedDateTime":"2013-06-24T14:17:38Z","Content":"\n\u003Cp\u003EMy most recent project has been trying to get a probe into orbit around the sun. I have had so many mission failures during this project. I have run out of electricity while warping to maneuver nodes, accidentally separated stages way too early, had engines fall off, forgotten to put RCS thrusters, forgotten RCS fuel on and most recently released solid fuel boosters before they were empty. They promptly flew up and at the center of my ship causing everything to explode and rain debris on the space center.\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-06-24T14:28:05Z","Content":"\n\u003Cp\u003EOn three separate occasions on the same day, I managed to ruin a mission by running out of electricity.\u003C/p\u003E\u003Cp\u003EStandard interplanetary probe launches. Once I arrive at the destination, I get into a proper orbit and separate the probe from the remaining propulsion. But I kept forgetting to extend the solar panels once I reached space, so a few hours later I\u0027d end up wondering why the ship wasn\u0027t responding and see that it had run out of power.\u003C/p\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-06-24T15:30:08Z","Content":"\n\u003Cp\u003ESending my first \u0022realistic\u0022 mission to another planet. And forgot the landing gear.\u003C/p\u003E\n"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-06-24T16:43:34Z","Content":"\n\u003Cp\u003EForgetting to stage my SRB\u0027s correctly, and not putting them on decouplers but right next to decouplers\u003C/p\u003E\n"},{"CreatedByName":"Gojira","CreatedById":10884,"CreatedDateTime":"2013-06-24T16:56:28Z","Content":"\n\u003Cp\u003ESo I built this three part interplanetary ship, which took hours even with MechJeb. I flew it to Duna and got into Duna orbit. I crashed the lander module on Duna\u0027s surface, losing an important module needed for interplanetary return (Protractor). So I decided to go into Ike orbit for a bit. I detached the first Ike probe and crashed it. Luckily I brought a spare, so I successfully landed that one and returned to Duna orbit. While awaiting Kerbin return, the remaining two parts (crew/nuclear reactor and propulsion module) of the ship got captured by Ike (turns out my orbit was just a bit too high) and I was on a very elliptical impact trajectory with Ike. Unable to correct in time because a) I was going at 500\u002B m/s and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E I was on 5x warp seconds before the ship was hit, I lost 10 Kerbals, 2 in the lander, and 8 in the crew module.\u003C/p\u003E\n"},{"CreatedByName":"Gamercow","CreatedById":71765,"CreatedDateTime":"2013-06-24T18:11:41Z","Content":"\n\u003Cp\u003EBiggest fail was not realizing I had only put one strut on my lander until it was too late, and I was in Mun orbit. There are other things wrong with that vehicle, but even Jeb seems to be laughing at me. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://pbs.twimg.com/media/BMhoWKxCUAELJsh.png:large\u0022 alt=\u0022BMhoWKxCUAELJsh.png:large\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Klingon Admiral","CreatedById":69090,"CreatedDateTime":"2013-06-24T18:53:37Z","Content":"\n\u003Cp\u003EOn my first mission to Eve, the entire rocket relied on the power created by 4 static solar panels on the atmospheric probe it was carrying. Unfortunately, when it had it\u0027s encounter with the planet, the rocket was aligned rimward, and was therefor out of power. The mission was promptly abandoned and a superior second version featuring RTGs on the interplanetary vehicle was launched.\u003C/p\u003E\n"},{"CreatedByName":"Kabloosh","CreatedById":72155,"CreatedDateTime":"2013-06-24T19:27:27Z","Content":"\n\u003Cp\u003EI have so many failures due to my newbieness to this game. I spent like 4 hours trying to just get 2 ships lined up. I don\u0027t know how many times I\u0027ve horribly failed at doing that.\u003C/p\u003E\n"},{"CreatedByName":"matt3526","CreatedById":72260,"CreatedDateTime":"2013-06-25T14:14:23Z","Content":"\n\u003Cp\u003EFirst time attempting to send a lander to the mun, I timewarp to interception but overshoot, luckily I\u0027m still on course for a second so I time warp to it and miss it again. Those two fly-bys give me enough energy to leave the mun SOI and also Kerbal SOI. Don\u0027t have enough fuel to slow down to two Kerbals go into a Sun centred orbit. On the second attempt to fly to the mun, I again overshoot the interception and end up on a free-return trajectory back to Kerbal. On my first attempt to EVE, I made it into EVA SOI after about 300 days and then accidentally ended the mission. On my first mission to Duna I managed to enter the SOI but Ike was strategically placed for a slingshot perpendicular to my trajectory. After trying to avoid said slingshot I ended up crashing straight into it. Since then though I have had better luck. I have flags on the mun and minmus \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I have full orange tankers in orbit around Kerbal thanks to a nice onion staging tutorial and I\u0027m Currently prepping to go back to Duna\u003C/p\u003E\n"},{"CreatedByName":"Bloodbunny","CreatedById":67274,"CreatedDateTime":"2013-06-25T19:01:44Z","Content":"\n\u003Cp\u003EBuilding the ultimate Mun base, packing it all into a realistic rocket, calculating dV, refueling in orbit, only to have the base smash the surface and be turned into dust and debris because the lander design turned out to be uncontrollable (couldn\u0027t test on Kerbin, too low TWR)...\u003C/p\u003E\u003Cp\u003EYeah, it wasn\u0027t pretty, debris was found as far as 26 km away from the landing site... was such an epic fail that it corrupted my save game (srs)\u003C/p\u003E\n"},{"CreatedByName":"frash23","CreatedById":69988,"CreatedDateTime":"2013-06-25T19:10:44Z","Content":"\n\u003Cp\u003EDownloading every mod i saw \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe game would take 10 minutes to load, and crash at a 90% rate.\u003C/p\u003E\u003Cp\u003EI now like to stick with stock.\u003C/p\u003E\n"},{"CreatedByName":"Bloodbunny","CreatedById":67274,"CreatedDateTime":"2013-06-25T21:20:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022frash23\u0022 data-cite=\u0022frash23\u0022\u003E\u003Cdiv\u003EDownloading every mod i saw \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003Cp\u003EThe game would take 10 minutes to load, and crash at a 90% rate.\u003C/p\u003E\u003Cp\u003EI now like to stick with stock.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou were using too many mods. Launching this game is a bit like launching a space mission, pack as light as you can, and trim stuff down wherever possible. Me? I\u0027ve culled the Squad folder down by nearly half, I rarely use any stock parts.\u003C/p\u003E\n"},{"CreatedByName":"apfelbeck","CreatedById":64706,"CreatedDateTime":"2013-06-25T21:32:01Z","Content":"\n\u003Cp\u003ESpent hours building a huge refueling base. Couldn\u0027t dock a ship with it \u0027cus my clamp-o-trons were on backwards...\u003C/p\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-06-25T21:54:58Z","Content":"\n\u003Cp\u003EOh god. Just last night.\u003C/p\u003E\u003Cp\u003EFinally made my first mission to the internal planets. Reached Eve with my satellite deployment ship, carrying 4 satellites intending to deploy two of them around Eve before determining if we had fuel for a Moho or should we return home.\u003C/p\u003E\u003Cp\u003Einstead of hitting Tracking Station, I hit \u003Cstrong\u003EEND FLIGHT\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-06-25T22:11:11Z","Content":"\n\u003Cp\u003EFinally wanted to get my five Kerbals (three the famous trio!) in failed mission pods without any fuel orbiting Kerbal back home - burned the wrong way while trying to get closer by pure engine power, wondering why I didnt get closer all the while ... this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KLDMy4m.png\u0022 alt=\u0022KLDMy4m.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo another more complicated rescue mission on my hands - luckily only one man ... but Squad is to blame! why cant we place empty lander cans when starting out with a probe!! This loyal Kerbals exile is on your hands!! *shakes fist in the air*\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-06-25T22:14:24Z","Content":"\n\u003Cp\u003EI forgot the struts...wings have never been so elastic at 15m/s\u003C/p\u003E\n"},{"CreatedByName":"TYRT","CreatedById":72285,"CreatedDateTime":"2013-06-26T00:03:25Z","Content":"\n\u003Cp\u003EI was going to the mun, 2 days ago, I was landing very very beautiful, But I saw I have forgotten landing gears:D\u003C/p\u003E\n"}]}