{"TopicId":29463,"ForumId":32,"TopicTitle":"You Will Not Go To Space Today - Post your fails here!","CreatedByName":"Mastodon","CreatedById":57231,"CreatedDateTime":"2013-04-19T19:54:10Z","PageNum":21,"Articles":[{"CreatedByName":"Nabiscovinco","CreatedById":64592,"CreatedDateTime":"2013-08-21T18:39:07Z","Content":"\n\u003Cp\u003ESo I attempted my first Apollo style Mun landing. However, the \u0022get up into orbit stage\u0022 did not get me into orbit, so after dipping into Mun transfer stage, I was cronically short on fuel. (I did land on the Mun, however) The return trip landed me with a Kerbin orbit of 500,000m and 13,750,000m at a 4.8 degrees off the equator.... I blame Jeb.\u003C/p\u003E\u003Cp\u003EAfter a super complicated encounter, I ran out of fuel on the deorbit burn. I did, however, have almost 5000 units of RSC (don\u0027t ask), so after 5 minutes of RCS burning, all Kerbals are saftely back on Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2013-08-21T19:11:07Z","Content":"\n\u003Cp\u003EAttempt #1 at a Mun landing, 1 way trip\u003C/p\u003E\u003Cp\u003EUsing MJ2. Landing autopilot engaged. Plenty of fuel left. Coming in for a landing. Final descent. Time to see where the landing is. OH SNAP, CRATER. Well, I guess I\u0027ll let it go on. 50 meters. 40 meters. 30 meters. 25 meters. 20. 15. 10. 5. Touchdown. Leaning quite a bit. Starting to slide down the hill. Going a bit faster. Almost down there. Damn, the leg broke. I\u0027M FALLING!! The command module is exploding. The kerbals are dying. The flames have devoured the kerbals. The command module is gone. End the mission.\u003C/p\u003E\n"},{"CreatedByName":"rasheed","CreatedById":29903,"CreatedDateTime":"2013-08-22T01:35:35Z","Content":"\n\u003Cp\u003EWhile testing out a top secret plane, it crashed and fragments destroyed my rocket on pad that i was gonna launch later.\u003C/p\u003E\u003Cp\u003ENot to mention i wasnt pointing at it\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-08-22T01:47:30Z","Content":"\n\u003Cp\u003EUpon orbiting Mun for the first time, I moved my Kerbalnauts to the M.E.M (Munar Excursion Module) from the command module and prepared to decouple for the journey to the surface. I then discovered my M.E.M had no power (no solar panels, no battery) and no RCS nozzles (I did have an RCS fuel tank). Thus, no landing...\u003C/p\u003E\u003Cp\u003EI returned home in shame.\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2013-08-22T06:28:28Z","Content":"\n\u003Cp\u003EI was testing a Duna lander design.\u003C/p\u003E\u003Cp\u003EAt least I know the ascent stage works.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/56154768/KSP.21/screenshot858.png\u0022 alt=\u0022screenshot858.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-24T05:41:15Z","Content":"\n\u003Cp\u003EI ditched my abort system too soon!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SrFcDjo.png\u0022 alt=\u0022SrFcDjo.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EAfter emergency dropping of everything.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ECome on! I can still save them! We can still make orbit!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThey did. But there was no cliff climbing on the Mun for those guys.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-24T05:43:33Z\u0022 title=\u002208/24/2013 05:43  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 24, 2013\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mikey661","CreatedById":80093,"CreatedDateTime":"2013-08-24T08:12:30Z","Content":"\n\u003Cp\u003EA lost photo from my first voyage to Minmus, a successful landing. Jebediah Kerman looks as if he doesn\u0027t even know that his decapitated spaceship is useless to return to kerbin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iVJveV3.jpg\u0022 alt=\u0022iVJveV3.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Psycho529","CreatedById":68105,"CreatedDateTime":"2013-08-26T13:34:57Z","Content":"\n\u003Ca href=\u0022http://imgur.com/a/QLzUs\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/QLzUs\u003C/a\u003E I made a number of attempts to take ans SSTO to the mun, all ended in failure... they either ran out of fuel or blew up during landing or take-off to get home \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2013-08-29T14:28:38Z","Content":"\n\u003Cp\u003EDon\u0027t you just love it when you have a heavy-ass ship and forget to throttle up before launching?\u003C/p\u003E\n"},{"CreatedByName":"AIux","CreatedById":80197,"CreatedDateTime":"2013-08-30T09:05:20Z","Content":"\n\u003Cp\u003EBefore I even launched.. One of the SRBs fell off and this winglet started floating slowly and endlessly away from my ship.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D4Z71Jv.jpg\u0022 alt=\u0022D4Z71Jv.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hav0c13","CreatedById":80771,"CreatedDateTime":"2013-08-30T11:31:29Z","Content":"\n\u003Cp\u003EI had just bought KSP, I spent hours designing a rocket to get my first probe to orbit Kerbin, realized I completely botched up the staging, spent minutes re-organizing the staging, took off and everything went great! ....Until I decoupled the rocket boosters a little too soon...\u003C/p\u003E\u003Cp\u003EThe \u0022disassembling\u0022 of my rocket was quite fascinating to watch I might add. If I can figure out how to share the vid, I\u0027ll post it.\u003C/p\u003E\u003Cp\u003EEdit: So apparently my computer doesn\u0027t like taking screenshots of videos. What happened was I decoupled the solid rocket boosters while they still had some fuel and one of them happened to punch right into the middle of my rocket. Fun times!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-30T12:10:51Z\u0022 title=\u002208/30/2013 12:10  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 30, 2013\u003C/time\u003E by Hav0c13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Securus","CreatedById":77088,"CreatedDateTime":"2013-08-30T12:44:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AIux\u0022 data-cite=\u0022AIux\u0022\u003E\u003Cdiv\u003EBefore I even launched.. One of the SRBs fell off and this winglet started floating slowly and endlessly away from my ship.\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D4Z71Jv.jpg\u0022 alt=\u0022D4Z71Jv.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022I must go. My people need me.\u0022\u003C/p\u003E\n"},{"CreatedByName":"TimMartland","CreatedById":68334,"CreatedDateTime":"2013-08-30T17:34:29Z","Content":"\n\u003Cp\u003EI built a multipurpose unmanned Duna \u0027Round Trip\u0027, a ship with 2 probes and a rover that I could just eject and deploy once I was in LDO (Low Duna Orbit). The probes went off fine, so I proceeded to launch the rover and its retrorockets so it could land.\u003C/p\u003E\u003Cp\u003EUnfortunately for me, I soon realised that I had no rover control. Looking around at it I saw it had no probe core. After face palming suitably I abandoned the debris and destroyed the rover from the tracking station (I usually leave debris up for realism, but this was just annoying and I wanted rid of the thing).\u003C/p\u003E\u003Cp\u003EI proceeded to the VAB to create a new rover, and whilst adapting the launch stage from the previous mission I saw that I had indeed had a core on the rover-I had been in docking mode and, due to a lack of RCS my angry WASD and space bar bashing had proven fruitless. I once again face palmed profusely and then sat in front of the TV watching Game of Thrones and hating myself for deleting the rover.\u003C/p\u003E\u003Cp\u003EThe moral is: DON\u0027T BE STUPID LIKE ME-BE SMRT.\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2013-08-30T22:40:14Z","Content":"\n\u003Cp\u003EWhile testing my Long March 3A\u0027s staging, I accidentally made its second stage engine clip too much into the decoupler thgot it got stuck to it after separation, bringing the whole rocket down.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RHpD4z8.jpg\u0022 alt=\u0022RHpD4z8.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-08-31T05:23:50Z","Content":"\n\u003Cp\u003EIt dint werk. \u003Cimg src=\u0022http://i.imgur.com/prH1jZH.jpg\u0022 alt=\u0022prH1jZH.jpg\u0022\u003EIt dint werk. \u003Cimg src=\u0022http://i.imgur.com/XXk2DlM.jpg\u0022 alt=\u0022XXk2DlM.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SeventhArchitect","CreatedById":80982,"CreatedDateTime":"2013-09-02T01:48:00Z","Content":"\n\u003Cp\u003EThe only failures I can recall, espacially one in particular, was when I was all like: \u0022I\u0027m freaking noob! I\u0027mma make me a space station, btu **** the clamps, and learning how to dock altoghter, I\u0027ll just make this one thang, and worry bout it later!\u0022\u003C/p\u003E\u003Cp\u003EUpon launch the rockomax jumbo 64 tanks fly off the rocket, explode, AND destory anything next to and above them, destroying all but the bottom most piece, a single Mainsail\u003C/p\u003E\n"},{"CreatedByName":"Designer225","CreatedById":48514,"CreatedDateTime":"2013-09-02T18:19:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AIux\u0022 data-cite=\u0022AIux\u0022\u003E\u003Cdiv\u003EBefore I even launched.. One of the SRBs fell off and this winglet started floating slowly and endlessly away from my ship.\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D4Z71Jv.jpg\u0022 alt=\u0022D4Z71Jv.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour rocket is woefully unbalanced. Try symmetry (and struts) to keep your rocket in one piece.\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2013-09-03T09:29:29Z","Content":"\n\u003Cp\u003EIn my first .21 Duna mission, I had attached a drogue chute to a docking port to help with aerobraking to establish orbit. It never deployed during the maneuver but I was able to economically establish a nice orbit. Then I took my lander down, and that was when the drogue deployed. As soon as it caught enough air, however, it left my craft, taking the docking port with it. The very docking port I planned to use to dock a remote fueler I would send to the planet later, as I expected to have only enough fuel to re-establish orbit. The two main chutes I had included and deployed for the landing engaged just fine and stayed right on the craft where I put them.\u003C/p\u003E\u003Cp\u003ESo now any mission to bring back the Duna crew just got a lot more expensive. (Lately, I have been getting in the habit of becoming budget-minded with my ships, to prepare myself for campaign mode. It has made things a bit more challenging. And fun.)\u003C/p\u003E\u003Cp\u003EWhat have we learned? Drogue chutes are out to screw you, and docking ports are stronger than some may let on. I\u0027d have to imagine that with further physics application, half the capsule would have been torn away along with the docking port. Good thing kerbals are in the habit of wearing helmets inside space capsules.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-09-03T13:05:30Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://s786.photobucket.com/user/peadar1987/media/Mani17.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i786.photobucket.com/albums/yy142/peadar1987/Mani17.png\u0022 alt=\u0022Mani17.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is what happens when I try to land in the dark.\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-09-05T11:59:35Z","Content":"\n\u003Cp\u003EI had two catastrophic missions: One was a Laythe Probe Lander which landed, but the landing legs were too weak and fell off the probe. It flipped over.\u003C/p\u003E\u003Cp\u003ESecond was a huge mission, one rocket bringing a one-man-lander to Duna and back. My first try failed: I landed on a hillside, the.lander flipped over and couldn\u0027t start off again...\u003C/p\u003E\n"},{"CreatedByName":"Astraph","CreatedById":80902,"CreatedDateTime":"2013-09-06T23:44:02Z","Content":"\n\u003Cp\u003EMy first space station had to be brought down from orbit because I installed all the docking ports upside-down... Imagine my facepalm when I right-clicked on the empty docking port, saw the \u0022undock\u0022 button... And then watched as the whole Clamp-o-Tron Sr flew away from the station after undocking into deep space...\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-09-08T13:06:45Z","Content":"\n\u003Cp\u003EI had just build an insanely powerful asparagus-less lifter.\u003C/p\u003E\u003Cp\u003EStage 0: Payload.\u003C/p\u003E\u003Cp\u003EStage 1: Single Skipper.\u003C/p\u003E\u003Cp\u003EStage 2: 4 Skippers, 2 Mainsails.\u003C/p\u003E\u003Cp\u003EStage 3: 10 Mainsails.\u003C/p\u003E\u003Cp\u003EThe launch clamps obstucted most of the struts I had placed, resulting in a fiery kaboom when half of stage 3 fell off at engine ignition/clamp declamping.\u003C/p\u003E\n"},{"CreatedByName":"rasheed","CreatedById":29903,"CreatedDateTime":"2013-09-08T18:51:52Z","Content":"\n\u003Cimg src=\u0022http://i.imgur.com/uwgaLMg.png\u0022 alt=\u0022uwgaLMg.png\u0022\u003E My probe falling from the tower after accidently placing it too close to the edge. There goes my multi million dollar Camera taking machine ;-;\n"},{"CreatedByName":"Sesni","CreatedById":50625,"CreatedDateTime":"2013-09-08T19:16:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rasheed\u0022 data-cite=\u0022rasheed\u0022\u003E\u003Cdiv\u003E My probe falling from the tower after accidently placing it too close to the edge. There goes my multi million dollar Camera taking machine ;-;\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027d you do to the buildings????????\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2013-09-09T19:22:17Z","Content":"\n\u003Cp\u003EYou know you\u0027re screwed when you aren\u0027t getting any further away from your previous stage despite having your engines at full throttle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Jfo1b52.png\u0022 alt=\u0022Jfo1b52.png\u0022\u003E\u003C/p\u003E\n"}]}