{"TopicId":29463,"ForumId":32,"TopicTitle":"You Will Not Go To Space Today - Post your fails here!","CreatedByName":"Mastodon","CreatedById":57231,"CreatedDateTime":"2013-04-19T19:54:10Z","PageNum":77,"Articles":[{"CreatedByName":"Grover","CreatedById":11972,"CreatedDateTime":"2015-05-12T14:53:14Z","Content":"\n\u003Cp\u003EIts possible, you just need to keep your periapse below 70km, so pointing a big rocket at minmus and whacking the throttle open should do the trick\u003C/p\u003E\n"},{"CreatedByName":"macdjord","CreatedById":5630,"CreatedDateTime":"2015-05-12T16:01:05Z","Content":"\n\u003Cp\u003EOh, I know it\u0027s \u003Cem\u003Epossible\u003C/em\u003E, I just can\u0027t imagine \u003Cem\u003Ewhy\u003C/em\u003E anyone would do it. The advantage of a sub-orbital trajectory is that it lets you get into space for less delta-v than you need to get into orbit; there\u0027s no reason at all to go higher than 250km (where the In Space High science starts). Besides, beyond about halfway to Keosynchronous orbit, it\u0027s actually \u003Cem\u003Emore\u003C/em\u003E efficient to go into orbit first than it is to keep burning straight up.\u003C/p\u003E\n"},{"CreatedByName":"Timm638","CreatedById":143358,"CreatedDateTime":"2015-05-12T16:41:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022macdjord\u0022 data-cite=\u0022macdjord\u0022\u003E\u003Cdiv\u003EOh, I know it\u0027s \u003Cem\u003Epossible\u003C/em\u003E, I just can\u0027t imagine \u003Cem\u003E\u003Cstrong\u003Ewhy\u003C/strong\u003E\u003C/em\u003E anyone would do it. The advantage of a sub-orbital trajectory is that it lets you get into space for less delta-v than you need to get into orbit; there\u0027s no reason at all to go higher than 250km (where the In Space High science starts). Besides, beyond about halfway to Keosynchronous orbit, it\u0027s actually \u003Cem\u003Emore\u003C/em\u003E efficient to go into orbit first than it is to keep burning straight up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy not?\u003C/p\u003E\n"},{"CreatedByName":"Michaelo90","CreatedById":98783,"CreatedDateTime":"2015-05-14T01:02:59Z","Content":"\n\u003Cp\u003EMy supercompact 11000t launch weight SSTO is having some problems...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/i1v7bfu.png\u0022 alt=\u0022i1v7bfu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlmost all of those pieces are 140t SpaceY tanks, in some explosions, some have flown over 8 km high or over 20 km from the launchpad \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-05-14T04:42:33Z","Content":"\n\u003Cp\u003EJeb had a small accident in the rover today...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/avtp0Iq.jpg\u0022 alt=\u0022avtp0Iq.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-05-14T07:43:41Z","Content":"\n\u003Cp\u003EMy payload fell out of my fairing. Nothing else needs to be said\u003C/p\u003E\n"},{"CreatedByName":"icedown","CreatedById":129659,"CreatedDateTime":"2015-05-14T15:40:39Z","Content":"\n\u003Cp\u003EI think Jeb has been looking into how to fly better in the new atmosphere and keeps getting distracted...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.gyazo.com/efa356283553cac08ed1a636e14a6931.png\u0022 alt=\u0022efa356283553cac08ed1a636e14a6931.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2015-05-14T17:22:18Z","Content":"\n\u003Cp\u003EHmmm .. Fried Gravity Turn Trajectories *grwalbalbwblb* (Homer Simpson gargle noise)\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-05-22T00:03:37Z","Content":"\n\u003Cp\u003EPlaying sandbox mode last few days, so more pictures for this thread than usual...\u003C/p\u003E\u003Cp\u003ESo I was experimenting with Kerbal Joint Reinforcement settings, trying to build an unstable rocket that would flip so I could see if it would break up or not. First rocket I built was a Mark 1-2 pod on a Mark 3 fuselage with a Mainsail--far from being unstable, it went straight into orbit. Cool, I thought, forgetting about the instability experiment--I\u0027ll build this into an operational SSTO for my career save! So I refined the design a bit and launched it again. This was the result:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Wb0DCAg.jpg?1\u0022 alt=\u0022Wb0DCAg.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis one I liked to look on less as an unsuccessful test of a new rocket and more as a successful test of a new Launch Escape System:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vs6qwcv.jpg?1\u0022 alt=\u0022vs6qwcv.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EWorking on a cargo plane. It flies great, and lands great most of the time, but every now and again I get impatient and set it down a little too hard. Then this happens:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vDApMhC.jpg?1\u0022 alt=\u0022vDApMhC.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn this run my land speed record rocket managed to at least burn out all its boosters before exploding. The ejector seat worked, though:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UG9kZ7Q.jpg?1\u0022 alt=\u0022UG9kZ7Q.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003ETesting a new Aerospike SSTO. I foresee a problem:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wfJf9WE.jpg?1\u0022 alt=\u0022wfJf9WE.jpg?1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-05-22T00:07:47Z","Content":"\n\u003Cp\u003EManeuvering with airbrakes is awesome!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/i3SXSg8.jpg\u0022 alt=\u0022i3SXSg8.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2015-05-22T20:46:57Z","Content":"\n\u003Cp\u003EWherein Bob is forever scarred:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/67872682/KSP/screenshot0.png\u0022 alt=\u0022screenshot0.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-05-23T10:43:58Z","Content":"\n\u003Cp\u003ETorus station R\u0026amp;D. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6rwGjrE.jpg?1\u0022 alt=\u00226rwGjrE.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3ftY5Qa.jpg?1\u0022 alt=\u00223ftY5Qa.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gtkNHhF.jpg?1\u0022 alt=\u0022gtkNHhF.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/304hCeI.jpg?1\u0022 alt=\u0022304hCeI.jpg?1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-05-23T10:57:49Z","Content":"\n\u003Cp\u003ESmall variation in the you will not return from space today series ; )\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cb3HX5b.jpg\u0022 alt=\u0022cb3HX5b.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2015-05-23T12:52:05Z","Content":"\n\u003Cp\u003EI had my first brush with the Kraken for Version 1.0.2!\u003C/p\u003E\u003Cp\u003EApparently when you get into orbit, your ship turns into very viscous jelly. Who knew? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(No pictures - I was too flabbergasted to take a screenie!)\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-05-23T13:10:12Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/26239284379365067/64462B389E7DDCE04E15893A39AD73EA63847EF5/\u0022 alt=\u002264462B389E7DDCE04E15893A39AD73EA63847EF5\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe rover survived? Mission Accomplished!\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2015-05-24T04:30:35Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Vrbhw\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the same slideshow as I put in a thread I made about an aerodynamics tip - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/122198-Aerodynamics-Lesson-Of-The-Day\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/122198-Aerodynamics-Lesson-Of-The-Day\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-05-24T04:42:15Z","Content":"\n\u003Cp\u003EDamn you, horrid KSP Hydrodynamics.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/2lLPIgL\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2lLPIgL.png\u0022 alt=\u00222lLPIgL.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"BurningLegion","CreatedById":142799,"CreatedDateTime":"2015-05-24T23:04:03Z","Content":"\n\u003Cp\u003ESo after my successful 2k science Minmus landing with three biome hops (I say successful, but it only worked as well as it did because I failed my Mun intercept and then accidentally got Kerbin escape while biome-hopping on Minmus), I decided it was time for me to try to land on another planet proper. The technology windfall from Minmus exploration unlocked a huge amount of new stuff, and I focused on larger rockets and fuel tanks, including the LV-N.\u003C/p\u003E\u003Cp\u003ESo I checked potential transfer windows, realized it would be ages before I could go to Dres, I didn\u0027t want to fight Eve, I didn\u0027t want to go to Duna, and I wouldn\u0027t be able to generate power effectively enough if I went to Eeloo (Because the height of my sustainable power generation was the small 1x6 \u0026amp; 3x2 solar panels, and I didn\u0027t want the hassle of trying to use fuel cell power when I might need that fuel to get home). This is a Science game, so I had no limitations for how big and expensive my rocket could be. At the final weight check, it was 2,188 tons of Moho Expedition.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gnsOEPk.jpg\u0022 alt=\u0022gnsOEPk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe expedition ship is fueled in multiple stages. The first stage consists of 27 Kerbodyne solid fuel boosters, mounted in nine clusters of three, firing simultaneously with 13 liquid fuel boosters consisting of a Mainsail engine attached to a Rockomax X96 fuel tank (Equivalent in every way to a Jumbo plus an X32, I\u0027m using a few parts mods to build on a larger scale with the same weight, cost, and other performance factors as if I\u0027d used multiple instances of the same part. So my PC doesn\u0027t fry).\u003C/p\u003E\u003Cp\u003EWhen the Kerbodyne boosters stop firing, they are jettisoned. But no further engines fire until the Rockomax Mainsails use all their fuel. At that point, the next stage (Nine integrated large-scale boosters I\u0027m rather proud of. Each one is a Rockomax mainsail with a radial battery, an aerodynamic cap, an integrated 2.5M reaction wheel, and 12,000 units of LFO. I\u0027m probably going to save them as a subassembly and just apply them to anything that needs moar boosters.) fires and is SUPPOSED to carry what\u0027s left of the contraption into orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DTXuJeY.jpg\u0022 alt=\u0022DTXuJeY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen in stable orbit, I can make a judgment call about either topping up the integrated boosters for the transfer burn to Moho in 150 days, or I can dump them and use the three clusters of quad LV-Ns to make the 5K burn with style and efficiency. I\u0027d probably have topped them off. With that much time to play with, no reason not to. Unfortunately, Siexie Kerman ran out of fuel for the boosters before achieving LKO, so we attempted to correct using the LV-Ns.\u003C/p\u003E\u003Cp\u003ESpoiler: It did not work.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3H5ocgp.jpg\u0022 alt=\u00223H5ocgp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen it became obvious it would not work, I oriented retrograde to kill velocity and land in as intact a fashion as possible, just to see if I could do it. Yes I am burning nuclear engines above Kerbin\u0027s seas. The plan for the nuclear stage involved asparagus staging - drain three tanks, dump them, keep burning. Drain three more tanks, dump them, keep burning. If the tanks mounted directly above the LV-N clusters had still had fuel during Moho landing, we would have dumped them. LV-N TWR peaked at .23 for the Moho Expedition.\u003C/p\u003E\u003Cp\u003EThe pride of Kerbalkind, being torn asunder by the simplest of all forces. Stop being so happy, Siexie!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8xnAyTH.jpg\u0022 alt=\u00228xnAyTH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanding on Moho was tricky. Gravity is estimated to be weaker than on Kerbin itself. Based on experience with Minmus, it was decided that landing TWR on Moho had to be at least 5 to 1, to allow for a minimum altitude burn, and the ability to use any leftover fuel in the landing stage for ascent from Moho. The landing stage, accordingly, has a Delta-V of 3,300 and consists of three Skippers attached to orange tanks with caps totaling 11.2k LFO per landing engine. Each landing engine has three landing legs, and three spotlights in case of night landing, as well as an integrated reaction wheel. The landing engines were never meant to be fired while the LV-Ns were burning, but they were technically clear, so in the interest of saving Siexie Kerman\u0027s life, I attempted to gimick the staging sequence to dump the extra nuclear fuel tanks, dump the science module, and fire both the landing and ascent engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y0blwS8.jpg\u0022 alt=\u0022Y0blwS8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ascent stage was required to have a minimum of 3300 Delta V, a TWR of 5.0 or better relative to Moho, drop the science pod before ascent, and be designed under the assumption the landing stage engines would be destroyed upon Moho impact. It was equipped with an LV-T45 engine. As stated, the intent was to gimick staging to drop extra nuclear fuel tanks, the science pod, and bring all seven rockets to focus on slowing Siexie down before she burned up.\u003C/p\u003E\u003Cp\u003EThat\u0027s not what happened. While I was gimicking the staging sequence, I forgot that some decouplers were tied to the ignition of certain engines, resulting in releasing the LV-N clusters at full throttle. And then releasing the landing stage engines at full throttle. Thankfully, both sets of engines had clear flight paths away from the Moho Expedition.\u003C/p\u003E\u003Cp\u003EThe return stage was required to have a minimum of 2700 Delta V, a retractable solar panel (To survive Moho atmospheric drag), a weight less than 5T, and incorporate a parachute. TWR was considered irrelevant for a stage primarily intended to be fired in HKO. It was mounted directly on top of the 1.25M to 2.5M connector making up the top of the Ascent Stage. In my decoupler-spawned panic, I accidentally decoupled the Ascent Stage from the Return Stage while the Ascent Stage engine was firing at full throttle. This resulted in the Return Stage being jammed on top of an uncontrollable Ascent Stage.\u003C/p\u003E\u003Cp\u003EI don\u0027t have any pictures because I was too busy doing everything I could with reaction wheels to get off that crazy train, but here is the outcome:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4eEazvS.jpg\u0022 alt=\u00224eEazvS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VB1vxek.jpg\u0022 alt=\u0022VB1vxek.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/q7Jk6XC.jpg\u0022 alt=\u0022q7Jk6XC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMoho Expedition: $5,000,000.\u003C/p\u003E\u003Cp\u003EDropping 30 boosters directly onto the Launchpad: $400,000 to repair launchpad and bribe OSHA inspectors.\u003C/p\u003E\u003Cp\u003EDumping 40 tons of radioactive material in Kerbin\u0027s seas: $4,000,000 for civil suit from Fisher\u0027s Union.\u003C/p\u003E\u003Cp\u003EReleasing three uncontrollable explosive missiles: Stern lecture from Kerbin Armed Forces, $800,000 fine.\u003C/p\u003E\u003Cp\u003EJettisoning scientific equipment: Stern lecture from R\u0026amp;D, $45 for beer.\u003C/p\u003E\u003Cp\u003EReleasing three uncontrollable explosive radiation-spewing nuclear-powered missiles: Censure from United Kerbal Nations \u0026amp; $5,000,000 fine.\u003C/p\u003E\u003Cp\u003EReleasing a fourth uncontrollable explosive missile: Weary sigh from Kerbin Armed Forces, $300,000 bribe.\u003C/p\u003E\u003Cp\u003ESurvival of pilot: $600,000 ransom paid to Fisher\u0027s Union.\u003C/p\u003E\u003Cp\u003ERecovering crew and being allowed to continue attempts at spaceflight: Priceless.\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-05-25T00:20:37Z","Content":"\n\u003Cp\u003EI will not go to space today. I will not even go to London today.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OXbq31p.png\u0022 alt=\u0022OXbq31p.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2015-05-25T16:24:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BurningLegion\u0022 data-cite=\u0022BurningLegion\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMoho Expedition: $5,000,000.\u003C/p\u003E\u003Cp\u003EDropping 30 boosters directly onto the Launchpad: $400,000 to repair launchpad and bribe OSHA inspectors.\u003C/p\u003E\u003Cp\u003EDumping 40 tons of radioactive material in Kerbin\u0027s seas: $4,000,000 for civil suit from Fisher\u0027s Union.\u003C/p\u003E\u003Cp\u003EReleasing three uncontrollable explosive missiles: Stern lecture from Kerbin Armed Forces, $800,000 fine.\u003C/p\u003E\u003Cp\u003EJettisoning scientific equipment: Stern lecture from R\u0026amp;D, $45 for beer.\u003C/p\u003E\u003Cp\u003EReleasing three uncontrollable explosive radiation-spewing nuclear-powered missiles: Censure from United Kerbal Nations \u0026amp; $5,000,000 fine.\u003C/p\u003E\u003Cp\u003EReleasing a fourth uncontrollable explosive missile: Weary sigh from Kerbin Armed Forces, $300,000 bribe.\u003C/p\u003E\u003Cp\u003ESurvival of pilot: $600,000 ransom paid to Fisher\u0027s Union.\u003C/p\u003E\u003Cp\u003ERecovering crew and being allowed to continue attempts at spaceflight: Priceless.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis cracked me up. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2015-05-25T17:18:45Z","Content":"\n\u003Cp\u003ESomehow a kerbal had gotten herself stuck in orbit around the Mun. The request was if KSP could mount a rescue. We would also get money. Fine.\u003C/p\u003E\u003Cp\u003EThere were some other Mun contracts as well: returning some science from the surface and some surveys here and there. It seemed only efficient if we could string these contracts together. Our new R5 first stage was performing phenomenally and would be well able to do a rescue and also touch at least some of the survey points. The rescued astronaut could do some EVA\u0027s as well. The R5 Lander was retrieved out of storage. With the addition of probe core, so it could fly unmanned, and an little extra fuel for the lander we set sail. Towards the skies. An subsequently space.\u003C/p\u003E\u003Cp\u003EThe tranfer burn was a little more work than usual because our unmanned rescue and mission vessel had to line up with Cassidy\u0027s ship. This wasn\u0027t really nessecary there was plenty of fuel in the craft, but the latest upgrade to the tracking station allowed mission control to set up a splendid transfer with both plane and apsis lining up reasonably well. It wasn\u0027t completly perfect, mind you, there would have to be a small plane change on Munar orbit. A plane change which upon arrival at the Mun ended up being a little bigger than expected because the rescue and mission vessel was travelling in the opposite direction of the vessel to be rescued. We had plenty of fuel.\u003C/p\u003E\u003Cp\u003ECassidy was quickly briefed on the rest of the mission after her rescue from her wreck ship. In one low altitude pass she managed to do two thermometer surveys readings and the rotation of the Mun set her right up to do the only surface survey point. The transfer stage ran dry during the descent. On previous missions, with a less powerful launch stage, it had done so already during the transfer burn to the Mun, so I was good.\u003C/p\u003E\u003Cp\u003EI set lander down near the area and ordered Cassidy set outside to do the EVA. \u003C/p\u003E\u003Cp\u003EOn the map I could see where the survey point in relation to the lander, or so I thought, and decided to move the Lander there on autopilot. It was so close Cassidy could easily make it later by jetpack. However I fumbled the hop and found out way to late I was moving in the wrong direction. (These navigation points really need an opposite side marker on the NAV-ball.) Waisting more fuel while I switched between map mode to get my bearings I started heading in the right direction. As a message appeared I was entering and a moment later leaving survey point \u0022Kerbin\u0027s Courage\u0022 I decided to put the lander down fast. No need risking Cassidy being stranded here, since I was going to need a second mission anyway to complete the survey.\u003C/p\u003E\u003Cp\u003EUnfortunately the landing was a bit to fast causing the lander to toppled over. \u003C/p\u003E\u003Cp\u003EA rescue mission was required. It would be an unmanned vessel which would first do the other remaining survey point, retrieve Cassidy, who would place herself on \u0022Kerbin\u0027s Courage\u0022 to guide the vessel in. All went well.\u003C/p\u003E\u003Cp\u003EWith Cassidy rescued, the survey completed, all the science retrieve from toppled landed we were ready to head home. There was however a lot of fuel left in the lander to do a small hop to the Muns pole and the new lander had some yet unused Goo experiments on board. No need to let those go to waste.\u003C/p\u003E\u003Cp\u003EAs we descended from the hop towards the pole I already noticed it was extremely rough terrain. But instead of giving up, like some less courages Space Program Administrator might do, I went on!\u003C/p\u003E\u003Cp\u003EThis heroism, after wasting \u0022a little\u0022 fuel looking for a flat surface to land, cumulated in Cassidy being stranded on her return voyage in a ship without fuel in a very high orbit around Kerbin.\u003C/p\u003E\u003Cp\u003EA rescue mission was required. It would be an unmanned vessel which would rendezvous with Cassidy\u0027s ship. Cassidy would move herself and all the experiments to the rescue vessel an return home in the most straightforward manner possible. The mission was a complete success, Bringing Cassidy home after three separate rescue missions!\u003C/p\u003E\u003Cp\u003EThe moral of the story: if there is still plenty fuel left to return home, return home.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-25T17:22:52Z\u0022 title=\u002205/25/2015 05:22  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 25, 2015\u003C/time\u003E by PrivateFlip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-05-27T09:45:59Z","Content":"\n\u003Cimg src=\u0022http://i.imgur.com/SQtgibh.jpg?1\u0022 alt=\u0022SQtgibh.jpg?1\u0022\u003E\n"},{"CreatedByName":"Plume \u0026amp; Akakak","CreatedById":142955,"CreatedDateTime":"2015-05-27T17:15:33Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u0022Lights on, Bob !\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.hostingpics.net/viewer.php?id=165757KSPstumbled853x480.gif\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://img15.hostingpics.net/pics/165757KSPstumbled853x480.gif\u0022 alt=\u0022165757KSPstumbled853x480.gif\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"kelmv","CreatedById":90534,"CreatedDateTime":"2015-05-30T09:19:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mohole\u0022 data-cite=\u0022Mohole\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://i.imgur.com/bmS45kR.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/bmS45kR.jpg\u003C/a\u003E Why is Bill SMILING WHY!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnytime Bill smiles, I start checking everything. I know no other fear than Bill\u0027s smile. It\u0027s like he\u0027s being praised by some rocket-hating demon that told him to do something...\u003C/p\u003E\u003Cp\u003EIs Bill a Kraken worshipper?\u003C/p\u003E\n"},{"CreatedByName":"marza","CreatedById":11730,"CreatedDateTime":"2015-05-30T13:57:34Z","Content":"\n\u003Cimg src=\u0022http://i455.photobucket.com/albums/qq272/roborob112/struts_zpsbkfcabvr.png\u0022 alt=\u0022struts_zpsbkfcabvr.png\u0022\u003E\n"}]}