{"TopicId":29463,"ForumId":32,"TopicTitle":"You Will Not Go To Space Today - Post your fails here!","CreatedByName":"Mastodon","CreatedById":57231,"CreatedDateTime":"2013-04-19T19:54:10Z","PageNum":67,"Articles":[{"CreatedByName":"mdkendall","CreatedById":114550,"CreatedDateTime":"2014-12-29T18:53:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003EWhat\u0027d you use to record that gif?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had \u003Ca href=\u0022https://obsproject.com/\u0022 rel=\u0022external nofollow\u0022\u003EOBS\u003C/a\u003E running capturing the video. Later I played it back using \u003Ca href=\u0022http://www.videolan.org/\u0022 rel=\u0022external nofollow\u0022\u003EVLC\u003C/a\u003E and used the screenshot function to grab frames at about 1s intervals. Then I used \u003Ca href=\u0022http://gifmaker.me/\u0022 rel=\u0022external nofollow\u0022\u003EGIFMaker\u003C/a\u003E to turn the frames into an animated GIF.\u003C/p\u003E\u003Cp\u003EAnd just to keep things on-topic, here\u0027s an excerpt from the video showing a less-than-successful attempt.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/D0KwVcY7Oy4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Mystique","CreatedById":95628,"CreatedDateTime":"2014-12-29T20:46:40Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/t5f9lfvqf/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s23.postimg.org/t5f9lfvqf/screenshot9.jpg\u0022 alt=\u0022screenshot9.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMy.. Err.. Return mission to Eve. Thing with lots of cone chutes is a lander and other thing with biomass reactors is my old mobile resupply base. I was trying to resupply that tine lander in LKO after launch, but it never got to Eve, because resupply was taking eternity and I also forgot to put RCS block on both monstrocities (that initial docking was performed using some of main engines only) and even a tiny movement was causing making whole assembly wobble too much around the docking ports. So after spending about real life hour waiting on time warp for growing enough fuel I entered enraged Jeb state and smash all that into KSC =\\\u003C/p\u003E\u003Cp\u003EApproximately the same happened to my first biomass growth station because I used too much parts (especially solar panels and other tiny things) so it became home for physics Kraken and made it almost impossible to dock with bigger ships. Too bad I wasn\u0027t using Deadly reentry back then so it just went down to ocean\u0027s bottom.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/ouw8ly4nz/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s27.postimg.org/ouw8ly4nz/screenshot13.jpg\u0022 alt=\u0022screenshot13.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"GeneralMDBK","CreatedById":72407,"CreatedDateTime":"2014-12-29T21:32:18Z","Content":"\n\u003Cp\u003EJust a few of my favorites:\u003C/p\u003E\u003Cp\u003EThe glitchy station model.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XMOYePk.jpg\u0022 alt=\u0022XMOYePk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe bad Kerbal stuck outside on timeout for breaking expensive, important equipment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NBk3csh.jpg\u0022 alt=\u0022NBk3csh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe unbreakable yet broken joints.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aimxIDm.jpg\u0022 alt=\u0022aimxIDm.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"2001kraft","CreatedById":120475,"CreatedDateTime":"2014-12-30T02:27:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GeneralMDBK\u0022 data-cite=\u0022GeneralMDBK\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe bad Kerbal stuck outside on timeout for breaking expensive, important equipment.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/NBk3csh.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/NBk3csh.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGG m9. \u003C/p\u003E\u003Cp\u003EI had much worse situations where I had plans for a booster and it ended in a catastrophic failure due to my noobiness at controlling Kerbals.\u003C/p\u003E\n"},{"CreatedByName":"Heimdall5008","CreatedById":114990,"CreatedDateTime":"2014-12-30T11:50:09Z","Content":"\n\u003Cp\u003EActually I got to space. But it ended in a big explosion...\u003C/p\u003E\u003Cp\u003ETo start from the beginning: I\u0027m just at launching my basic orbiter for small part tests and rescue missions. The ascend is standard. I\u0027m just waiting for the Ap to do the circulization burn. From one moment to the other everything explodes. First I have no idea, what happend. But then I can put it together. My craft was hit by a LV-1 engine that I ejected during an part test some time before. At this time it was my only debris in orbit. I do not know how great your luck has to be that the only debris in space will hit your single other craft, but I managed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2014-12-30T12:03:10Z","Content":"\n\u003Cp\u003EJeb returning safely from orbit trip, aerobraking everything is fine, engaging parachutes.\u003C/p\u003E\u003Cp\u003EGood thing: I\u0027m landing near the KSC.\u003C/p\u003E\u003Cp\u003EBad thing: I\u0027m slowly descending above a 70% slope of THE MOUNTAINS near the KSC.\u003C/p\u003E\u003Cp\u003EHere lies Jebediah Kerman\u003C/p\u003E\u003Cp\u003E19XX - 2014\u003C/p\u003E\u003Cp\u003E\u0022Why do my chutes keep disappearing as soon as I touch a solid object?\u0022\u003C/p\u003E\n"},{"CreatedByName":"Cobalt60","CreatedById":101465,"CreatedDateTime":"2014-12-31T15:02:24Z","Content":"\n\u003Cp\u003EJust going out for a test flight of the Arion Mk 2 with my friend Genesby Kerman! The Arion is supposed to be an SSTO. However, I only got to 14,000m before I ran out of fuel on the rocket engines. Well, now it\u0027s going to be an SSTC (Single Stage To Continent). Ok, running low on jet fuel as I finally spot a coast in the distance. Land ho! We won\u0027t run out of fuel over the ocean. Now be careful with the landing, Genesby.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qTE1d2j.png\u0022 alt=\u0022qTE1d2j.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBe gentle. Gentle! GENTLE! Oh no...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kkqTJNP.png\u0022 alt=\u0022kkqTJNP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo everything but the pilot and copilot cabins have been destroyed. Oh, joy. He seems pretty indifferent about the whole thing considering I said I\u0027d rescue him \u0022When I get around to it\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/m2XouhP.png\u0022 alt=\u0022m2XouhP.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ddenis","CreatedById":89784,"CreatedDateTime":"2014-12-31T15:46:40Z","Content":"\n\u003Cp\u003Etrying to launch a new station module with SRBs. Forget to snap SRBs to separators, not central rocket...\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/tnHjH\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Redhotita1","CreatedById":90870,"CreatedDateTime":"2014-12-31T15:55:38Z","Content":"\n\u003Cp\u003EI... I don\u0027t even... gah\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uBmjnNq.png\u0022 alt=\u0022uBmjnNq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt works better as Retro-Booster...\u003C/p\u003E\n"},{"CreatedByName":"[email\u0026#160;protected]","CreatedById":80529,"CreatedDateTime":"2014-12-31T19:02:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redhotita1\u0022 data-cite=\u0022Redhotita1\u0022\u003E\u003Cdiv\u003EI... I don\u0027t even... gah\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/uBmjnNq.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/uBmjnNq.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt works better as Retro-Booster...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure one of those is pointed in the direction of space, and thats all that matters...right? No? Oh, well..at least its pretty.\u003C/p\u003E\n"},{"CreatedByName":"InF3RNo","CreatedById":72307,"CreatedDateTime":"2014-12-31T19:12:28Z","Content":"\n\u003Cp\u003EOh I guess I will be posting lot of self fails here when I get back home.\u003C/p\u003E\n"},{"CreatedByName":"Cobalt60","CreatedById":101465,"CreatedDateTime":"2014-12-31T23:49:49Z","Content":"\n\u003Cp\u003EJust had a few a couple of minutes ago.\u003C/p\u003E\u003Cp\u003ESo I have just installed MechJeb to compensate for my utter incompetence in getting to orbit and rendevousing. Launched my space station core with no difficulties to an 80km orbit, so I tried my power station next. I turn on complete auto pilot to my specifications, and walk away to read a book for a while.\u003C/p\u003E\u003Cp\u003EI come back a bit later and find my entire power station rocket plummeting through the atmosphere. Crap, I must have forgotten static solar panels, so the probe core ran out of charge. So I put some static panels on and launch \u003Cstrong\u003Ein the middle of the night\u003C/strong\u003E. There was much facepalming.\u003C/p\u003E\u003Cp\u003ESo I finally think I\u0027ve solved the problem by launching in the daytime. I launch it, turn it over to MechJeb, and it does the \u003Cem\u003Eexact same thing.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThere were many baffled, confused, and irate looks given to my computer screen. \u0022MechJeb autopilot used to work. Then it took a very large power station to the knee.\u0022 \u003Cspan style=\u0022font-size:8px;\u0022\u003E(Yes, I play skyrim)\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commoble","CreatedById":125856,"CreatedDateTime":"2015-01-01T03:11:28Z","Content":"\n\u003Cp\u003EI wasn\u0027t trying to go to space, but I didn\u0027t quite make it to the survey site either.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ACakF5f.png\u0022 alt=\u0022ACakF5f.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Freshmeat","CreatedById":111048,"CreatedDateTime":"2015-01-01T23:12:38Z","Content":"\n\u003Cp\u003EFor some reason, I cannot land my 8t nuclear mun lander anymore. It was my workhorse of .25, but I just lost control over two of them in a row. Is SAS changed when you have a higher level probe on board? I fly with an inline stabilizer to have reaction wheel overkill, but steering feels way harder.\u003C/p\u003E\n"},{"CreatedByName":"DaRocketCat","CreatedById":32377,"CreatedDateTime":"2015-01-02T07:48:21Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y8pTci1.jpg\u0022 alt=\u0022Y8pTci1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI decided to try out the new mk2 spaceplane parts. Threw something together, upon takeoff I tore off one of the rear landing gear. After a few tower buzzes I decided to bring it in for a landing. Jeb seems happy enough with the result.\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-01-02T13:18:35Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/26226449318031201/A45314B450BE90D86C8AC9A1FC4776B3AB370F0C/\u0022 alt=\u0022A45314B450BE90D86C8AC9A1FC4776B3AB370F0C\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhoops.\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-01-02T13:53:16Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/U9vu0or.png\u0022 alt=\u0022U9vu0or.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewoopsies\u003C/p\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2015-01-02T15:26:15Z","Content":"\n\u003Cp\u003EOnly a partial fail today, as I got the plane down in one piece.\u003C/p\u003E\u003Cp\u003EFirst though, some context from yesterday: it was the first test flight of my new crew shuttle (a B9 S2-based SSTO, that looks, as with all my SSTOs, very much like Skylon). As it was the first test, I\u0027d forgotten some important features, like reaction wheels, air brakes and landing lights. Only having the gyros in the drone core made orientating for burns pretty tedious, but didn\u0027t really cause any issues in atmo. The other two omissions, however, did. Picture, if you will (and you\u0027re going to have to just do that, as I was far too busy to take a screencap), a sleek black and white plane dropping through the clouds then making a 300m/s low pass of the KSC, in the middle of the night. Eventually, I was able to swing it around and make a 200m/s landing on the grass next to the runway. I say \u0022landing.\u0022 I was more of a partially controlled crash - in the words of the excellent Clarke and Dawe,\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/WcU4t6zRAKg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. The back did too, if I\u0027m being totally honest. Good thing the crew tank was in the middle - anything you can walk away from, eh?\u003Cp\u003EAnyway, that brings me on to \u003Cem\u003Etoday\u0027s\u003C/em\u003E fail. Today was the maiden flight of my late-career light cargo SSTO. I had remembered landing lights, and reaction wheels, and air brakes. I\u0027d got it successfully into orbit. I\u0027d released both survey probes (they\u0027ll get flown off to their final destinations later). I\u0027d got some nice shots of the probe release. But did I time the landing to be in the day? Nope.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/PZ6bp\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EHopefully I\u0027ve learnt my lesson about landing in the light now, though with all the practice getting things down in the dark, I might just carry on not caring about the time I\u0027ll be landing - especially now I\u0027ve set up a MechJeb info window with my bearing and distance to the KSC and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/85353-0-25-NavUtilities-ft-HSI-Instrument-Landing-System-v0-4-3-*Oct-12-2014*\u0022 rel=\u0022external nofollow\u0022\u003Ekujuman\u0027s ILS/HSI\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2015-01-03T11:15:45Z","Content":"\n\u003Cimg src=\u0022http://www.imageupload.co.uk/images/2015/01/03/KSPnotspace.png\u0022 alt=\u0022KSPnotspace.png\u0022\u003E\n"},{"CreatedByName":"j-tk","CreatedById":29598,"CreatedDateTime":"2015-01-03T22:43:40Z","Content":"\n\u003Cp\u003EOMG that was insane!!!!!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003ETragedy yesterday.... first I lost the entire 3-Kerbal crew on my station due to a life support malfunction. Pressed onward with a civilian tour contract to get back some rep and another near disaster:\u003Cp\u003EAll engines fired, but due to a MechJeb glitch failed to develop any thurst. The rocket dropped onto the pad, exploding everything, moments after the launch escape system activated.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/1WjwgdU.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/1WjwgdU.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ilMgScn.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ilMgScn.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/efnXCUm.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/efnXCUm.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/mfZGWnu.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/mfZGWnu.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe LAS saved the crew, but not without some... irregularities. It went the wrong way and didn\u0027t gain enough altitude, nearly smashing into the VAB.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/8ePrxLm.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/8ePrxLm.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESomewhere in that cloud of braking rocket smoke, there\u0027s three very unhappy (but alive) Kerbals.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/j6Akw6O.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/j6Akw6O.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd then in looking over my roster I discovered that at some point I also lost some Kerbal named Jorrigh and I have no idea when or how...?\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Exxmorphing","CreatedById":84221,"CreatedDateTime":"2015-01-06T00:30:49Z","Content":"\n\u003Cp\u003EMy most recent fail wasn\u0027t in exactly in the form of a crash...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EI was about to rendezvous with a kerbal stuck in orbit. I was in a 77-71km orbit. The kerbal was in a 100km orbit. Completing this contract would put me in the last phase of needing advance conics to go to the Mun and Minmus. Just this, and a few last survey contracts, before I would make the grand endeavor. It would be my first lunar expedition in our current career mode, with the fund count on my back for each tank of fuel I added.\u003C/p\u003E\u003Cp\u003EI knew I had a high risk of going past my target kerbal when I approached it in our respective orbits. I pressed F5 to quicksave, held it down as long as my memory told me so. The \u0022Hold F5 to Quicksave\u0022 message appeared. I wasn\u0027t willing to waste some in-game days trying to fix my position to it if I did mess up; I had contracts that would expire soon.\u003C/p\u003E\u003Cp\u003EI headed to the tracking station to time accelerate. I accidentally came too close to my target. But I would give it a try. Besides, I quicksaved.\u003C/p\u003E\u003Cp\u003EI reached one of my major orbit distances. Apoapsis, periapsis, I don\u0027t remember. Looking back at how the nodes moved, or didn\u0027t move, it probably was the periapsis. It didn\u0027t matter at the time. I burned, with an LV-909 engine, until the apoapsis touched the orbit of the kerbal\u0027s. I hoped, knowing it was a practice in futility, that I wouldn\u0027t catch up ahead of my target before I reached the apoapsis. I did.\u003C/p\u003E\u003Cp\u003EI knew that I could still rendezvous even though I was ahead. However, I had never done it in such a way. It didn\u0027t matter that the procedure was pretty much the same as being behind my target. The irrational bug of the thought that I should be behind it prevailed. \u003C/p\u003E\u003Cp\u003EBesides, I had my quicksave.\u003C/p\u003E\u003Cp\u003EI was happy that I quicksaved before I went to the tracking station. I had something to fall back on, as reverting my flight was out of the option due to changing away from my vehicle. The horror stories of people reverting days of work came to mind, thinking that they had pressed F5 when they hadn\u0027t. Thankfully, I did. There was no observable error like that which I performed. I was calm. I knew what I was doing.\u003C/p\u003E\u003Cp\u003EI pressed F9.\u003C/p\u003E\u003Cp\u003EAnd I became yet another individual within the collection of horror stories.\u003C/p\u003E\u003Cp\u003EThe moment I saw the launch pad and the blue skies I knew that it went wrong. I knew that I had reverted my game data to an unintended date. And I knew that it wasn\u0027t good, as I was looking above the launchpad, where the average rocket would be towering, but the vehicle in focus was down \u003Cstrong\u003Ebelow\u003C/strong\u003E where I was looking. I knew it wasn\u0027t good when the vehicle in question was a small one.\u003C/p\u003E\u003Cp\u003EMy pupils shifted down. I almost instantaneously recognized the vehicle.\u003C/p\u003E\u003Cp\u003EIt was four LV-909s connected to standard fuel tanks that were all attached to an unfueled skipper engine. Its purpose was to fulfill the agonizing mission of carrying the engine to the water, intact, activating it for a test contract, and carrying it back.\u003C/p\u003E\u003Cp\u003EIt was a mission that I completed long ago.\u003C/p\u003E\u003Cp\u003EI mentally collected myself. I pressed alt-F9 to look for a more recent save. But, as I expected, albeit tried to deny, all the most recent saves were from 12/21/14. In my recent days of playing, I had abused the \u0022revert flight\u0022 option obsessively, but neglected the quicksave function.\u003C/p\u003E\u003Cp\u003EI looked online for solutions, knowing that it was yet another prime example of an exercise in futility. Soon, while doing so, I quickly figured out what happened:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI didn\u0027t hold down the quicksave button long enough.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFrom my previous memories, I knew that I under-held it only for a fraction of a second. But it didn\u0027t make a difference if I held it for only a minuscule bit less than I should have or if I tapped it. It never saved. \u003C/p\u003E\u003Cp\u003EAnd so, finding no viable solutions, I decided to take a vacation from the space program.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EI didn\u0027t hold down the quicksave button long enough, causing me to revert to a two week old save-state.\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-01-06T02:03:09Z","Content":"\n\u003Cp\u003EOh, do I have a doozy...\u003C/p\u003E\u003Cp\u003EI was sending a brave Kosmonaut of mine on a basic super-suborbital mission to test this new rocket I built. I sent him (can\u0027t remember his name, sadly ;-\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E up and up and up, and he ended up getting an apoapse greater than that of the Mun. Which shouldn\u0027t have been a problem, except that on the way back down, he unexpectedly got caught in the Mun\u0027s SOI and ended up getting flung all the way out to Minmus (thank the Kraken he didn\u0027t leave the Kerbin system!) and spending an extra two months in space when he was supposed to spend less than a day... Whoopsie!\u003C/p\u003E\n"},{"CreatedByName":"Dr-Drunk","CreatedById":132802,"CreatedDateTime":"2015-01-06T02:18:11Z","Content":"\n\u003Cp\u003ENot verry recent but a funny story either way...\u003C/p\u003E\u003Cp\u003EBack in the day, I used to use MechJeb a fair deal to do simple maneuvers such as circularizations so I could watch youtube videos in the meantime. This one time, I was sending up a module for my space station and had set up the node for MechJeb to execute but right before the craft reached Apoapsis it ran out of power. I had forgotten to deploy the solar pannels... Now this being a manned module, I decided to have Bob go on EVA to open up the panel to restore power to the craft. Bob completed his mission, only to have the auto-pilot re-engage, point itself prograde and burn away before Bob had a chance to re-enter the capsule. Poor basterd dropped back into the atmosphere never to be seen again.\u003C/p\u003E\u003Cp\u003EI\u0027ve never used Autopilot since. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mister Kerman","CreatedById":166398,"CreatedDateTime":"2015-01-06T04:20:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exxmorphing\u0022 data-cite=\u0022Exxmorphing\u0022\u003E\u003Cdiv\u003E \u003C/div\u003E\u003Cblockquote\u003E\u003Cdiv\u003EI didn\u0027t hold down the quicksave button long enough, causing me to revert to a two week old save-state.\u003C/div\u003E\u003C/blockquote\u003E\u003C/blockquote\u003E\u003Cp\u003EI did that the other day. I always do a save before I quit my game from KSC\u0027s menu now.\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2015-01-06T20:16:34Z","Content":"\n\u003Cp\u003EI allways drove down that ramp with a rover to collect the local science. But this was the first time that i did it while it\u0027s level 2 ... :-)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kiRKQrM.png\u0022 alt=\u0022kiRKQrM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen they got it out again, Jeb dropped the car key when picking fl... collecting a sample:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ctczN0T.png\u0022 alt=\u0022ctczN0T.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9aH0jag.png\u0022 alt=\u00229aH0jag.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-06T20:32:55Z\u0022 title=\u002201/06/2015 08:32  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 6, 2015\u003C/time\u003E by kemde\u003C/strong\u003E\n\u003C/span\u003E\n"}]}