{"TopicId":29778,"ForumId":32,"TopicTitle":"Star wars style ships in ksp.","CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-28T15:03:52Z","PageNum":1,"Articles":[{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-28T15:03:52Z","Content":"\n\u003Cp\u003EAfter reading through some posts, and being guilty of adding star wars style ships myself, I have this to say about it. It seems to me that star wars style sci fi ships are basically appealing in the sense that we all dream of these ships, and yes they are cool. But they are by no means practical for this game. Star wars style ships have the usefulness of a fleet of super carrier cargo ships that service the Hawaiian islands only. These ships are long range combat and haulers, the kerbal game is all based on short range discovery and colonization. I personally like the star wars line, and for that matter all the sci fi stuff, but still the limited range and system size takes away from them. Like the USS enterprise, a long range exploration ship. Someone. Even mentioned an imperial star destroyer. \u003C/p\u003E\u003Cp\u003EI have completed converting the rebel blockade runner to work in the game with 8 life pods that can be used, having done this, I can\u0027t see a use for it. My xwing conversion and all the other craft again pretty useless in the game, but fun to play with. I am by no means a talented modellers like some here rather I have learned how to limited convert models for usage. \u003C/p\u003E\u003Cp\u003EI guess what I\u0027m saying to all the modders out there, is please keep up your hard work and dedication to making this game fun. I will still tinker with converting and I will always get permissions to use others meshes. But to the real teams that make original stuff, kudos. \u003C/p\u003E\u003Cp\u003ENow,\u003C/p\u003E\u003Cp\u003ECan someone make me a delorean time machine?\u003C/p\u003E\u003Cp\u003ELol\u003C/p\u003E\u003Cp\u003ECaptain Morgan.\u003C/p\u003E\n"},{"CreatedByName":"techonce","CreatedById":35508,"CreatedDateTime":"2013-05-28T18:41:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThePyrateCaptain\u0022 data-cite=\u0022ThePyrateCaptain\u0022\u003E\u003Cdiv\u003EAfter reading through some posts, and being guilty of adding star wars style ships myself, I have this to say about it. It seems to me that star wars style sci fi ships are basically appealing in the sense that we all dream of these ships, and yes they are cool. But they are by no means practical for this game. Star wars style ships have the usefulness of a fleet of super carrier cargo ships that service the Hawaiian islands only. These ships are long range combat and haulers, the kerbal game is all based on short range discovery and colonization. I personally like the star wars line, and for that matter all the sci fi stuff, but still the limited range and system size takes away from them. Like the USS enterprise, a long range exploration ship. Someone. Even mentioned an imperial star destroyer. \u003Cp\u003EI have completed converting the rebel blockade runner to work in the game with 8 life pods that can be used, having done this, I can\u0027t see a use for it. My xwing conversion and all the other craft again pretty useless in the game, but fun to play with. I am by no means a talented modellers like some here rather I have learned how to limited convert models for usage. \u003C/p\u003E\u003Cp\u003EI guess what I\u0027m saying to all the modders out there, is please keep up your hard work and dedication to making this game fun. I will still tinker with converting and I will always get permissions to use others meshes. But to the real teams that make original stuff, kudos. \u003C/p\u003E\u003Cp\u003ENow,\u003C/p\u003E\u003Cp\u003ECan someone make me a delorean time machine?\u003C/p\u003E\u003Cp\u003ELol\u003C/p\u003E\u003Cp\u003ECaptain Morgan.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe best I did was make a somewhat functional AT-AT using the damned robotics mod. I kind of got it to walk, but it was pretty shakey.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-05-28T19:10:46Z","Content":"\n\u003Cp\u003EI thought about making a Tie Fighter using the new cupola part and some of the 2x2 meter panels, but I lack the technical expertise to make it fly effectively.\u003C/p\u003E\n"},{"CreatedByName":"Qumefox","CreatedById":43197,"CreatedDateTime":"2013-05-28T19:51:57Z","Content":"\n\u003Cp\u003EIMHO \u0027Sci-fi\u0027 ships lose a lot of their appeal in KSP due to well.. physics.. Most sci-fi movies/shows throw physics right out the window and spacecraft end up flying like planes... That isn\u0027t the case in KSP.. .or reality.\u003C/p\u003E\n"},{"CreatedByName":"White Rider","CreatedById":66087,"CreatedDateTime":"2013-05-28T19:58:39Z","Content":"\n\u003Cp\u003EI\u0027m in the process of turning a TIE fighter into an SSTO.\u003C/p\u003E\u003Cp\u003ERetaining its shape while keeping functionality is proving... Difficult.\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-28T22:13:12Z","Content":"\n\u003Cp\u003EYep, the physics blow it out. Hope your tie fighter works out, I did one on the spaceport, heavily dependent on antigravity for flight. Was working on other things, but most sci fi is outstanding in looks, but not to functional.\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-28T22:16:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Qumefox\u0022 data-cite=\u0022Qumefox\u0022\u003E\u003Cdiv\u003EIMHO \u0027Sci-fi\u0027 ships lose a lot of their appeal in KSP due to well.. physics.. Most sci-fi movies/shows throw physics right out the window and spacecraft end up flying like planes... That isn\u0027t the case in KSP.. .or reality.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E I agree, but I have always considered this option when watching sci fi craft. It would be far easier to adapt a space plane to fly like a plane, than to have to train separate pilots. I imagine that the people on these fictitious worlds have developed air flight first, and over time have simply modified the space planes to behave in a manner similar to the aircraft.\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-05-28T22:17:48Z","Content":"\n\u003Cp\u003EAround the end of this video, I attempted an X-Wing. Then I realised it wasn\u0027t really an 45 degree X, more like 25...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gS4TFEAyNA8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.plasmainfusion.com/EFX%20Xwing%201.jpg\u0022 alt=\u0022EFX%20Xwing%201.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"White Rider","CreatedById":66087,"CreatedDateTime":"2013-05-28T22:32:01Z","Content":"\n\u003Cp\u003EIts a pain. Mainly keeping it balanced and giving it enough power...\u003C/p\u003E\u003Cp\u003ETo maintain its shape I pretty much need to use the large variant fuel tanks which are heavy. I\u0027m using 4 sabre style engines just now, but even that is awkward at the moment.\u003C/p\u003E\u003Cp\u003EIll get it working... Its just going to be an engineering nightmare.\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-29T00:33:10Z","Content":"\n\u003Cp\u003EThat\u0027s the spirit, keep at it. I know I am. I am / was working on the UDL-4 and M577, from aliens then I discovered that devo was doing one, so I backed off. But I have completed my version and it\u0027s nice, it\u0027s a conversion. But for the sake of things, I won\u0027t be making it AVAILIBLE for uploads. Still it looks good.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1105.photobucket.com/albums/h349/pyratecaptmorgan/screenshot50_zps085e778c.png\u0022 alt=\u0022screenshot50_zps085e778c.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-29T00:39:40Z\u0022 title=\u002205/29/2013 12:39  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 29, 2013\u003C/time\u003E by ThePyrateCaptain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wait- Was That Important?","CreatedById":58359,"CreatedDateTime":"2013-05-29T01:09:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThePyrateCaptain\u0022 data-cite=\u0022ThePyrateCaptain\u0022\u003E\u003Cdiv\u003EAfter reading through some posts, and being guilty of adding star wars style ships myself, I have this to say about it. It seems to me that star wars style sci fi ships are basically appealing in the sense that we all dream of these ships, and yes they are cool. But they are by no means practical for this game. Star wars style ships have the usefulness of a fleet of super carrier cargo ships that service the Hawaiian islands only. These ships are long range combat and haulers, the kerbal game is all based on short range discovery and colonization.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESci-Fi ships will always hold some appeal in my mind, just as a figure of nostalgia. However, any argument of their being useless is pretty much null and void. This is a goal-less game at the moment, any argument of practicality is inherently invalidated. They\u0027re pretty great for just existing, as all things in KSP are.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThePyrateCaptain\u0022 data-cite=\u0022ThePyrateCaptain\u0022\u003E\u003Cdiv\u003E I personally like the star wars line, and for that matter all the sci fi stuff, but still the limited range and system size takes away from them. Like the USS enterprise, a long range exploration ship. Someone. Even mentioned an imperial star destroyer. I have completed converting the rebel blockade runner to work in the game with 8 life pods that can be used, having done this, I can\u0027t see a use for it. My xwing conversion and all the other craft again pretty useless in the game, but fun to play with. I am by no means a talented modellers like some here rather I have learned how to limited convert models for usage. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe developers have planned FTL and procedurally generated solar systems, you may one day get a destination for the good ship Enterprise.\u003C/p\u003E\n"},{"CreatedByName":"White Rider","CreatedById":66087,"CreatedDateTime":"2013-05-29T01:16:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThePyrateCaptain\u0022 data-cite=\u0022ThePyrateCaptain\u0022\u003E\u003Cdiv\u003EThat\u0027s the spirit, keep at it. I know I am. I am / was working on the UDL-4 and M577, from aliens then I discovered that devo was doing one, so I backed off. But I have completed my version and it\u0027s nice, it\u0027s a conversion. But for the sake of things, I won\u0027t be making it AVAILIBLE for uploads. Still it looks good.\u003Cp\u003E\u003Cimg src=\u0022http://i1105.photobucket.com/albums/h349/pyratecaptmorgan/screenshot50_zps085e778c.png\u0022 alt=\u0022screenshot50_zps085e778c.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDude that looks amazing.\u003C/p\u003E\u003Cp\u003EDoes it fly?\u003C/p\u003E\n"},{"CreatedByName":"Dweeb of Kerbin","CreatedById":66678,"CreatedDateTime":"2013-05-29T01:30:09Z","Content":"\n\u003Cp\u003EI messed around with this as well and my verdict was a tie fighter does not really work, however a Tie Interceptor shape does. It\u0027s certainly not an exemplary plane, but it works fine. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img541.imageshack.us/img541/434/2013052500003.jpg\u0022 alt=\u00222013052500003.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img268.imageshack.us/img268/4181/2013052500004.jpg\u0022 alt=\u00222013052500004.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-29T03:19:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022White Rider\u0022 data-cite=\u0022White Rider\u0022\u003E\u003Cdiv\u003EDude that looks amazing.\u003Cp\u003EDoes it fly?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup. I didn\u0027t model it, I converted the mesh to something ksp could handle, set up the cfg files, reworked the textures a bit, and viola. The Dropship flies, although its more designed for recently and VTOL flight. The APC, don\u0027t drive, haven\u0027t figured out carts yet. Again, I did not create the mesh, merely imported it. But yeah it\u0027s great.\u003C/p\u003E\n"},{"CreatedByName":"Montieth","CreatedById":57608,"CreatedDateTime":"2013-05-30T01:28:23Z","Content":"\n\u003Cp\u003ERemember, Star Wars craft had \u003Ca href=\u0022http://starwars.wikia.com/wiki/Repulsorlift\u0022 rel=\u0022external nofollow\u0022\u003Erepulser lift technology.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-30T03:34:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Montieth\u0022 data-cite=\u0022Montieth\u0022\u003E\u003Cdiv\u003ERemember, Star Wars craft had \u003Ca href=\u0022http://starwars.wikia.com/wiki/Repulsorlift\u0022 rel=\u0022external nofollow\u0022\u003Erepulser lift technology.\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is correct. I incorporated antigrav into it to simulate repulsors lift. Basically the antigrav spa with a B brake to stop and hold ascending. Works nicely. Then that coupled with hyperedit to kill forward velocity, and the likes makes em good enough. Lotsa people downloaded em. There on the star port. Last one I converted was the life pod, and now converting the ce90 corvette to hold eight of those, works so far.\u003C/p\u003E\n"},{"CreatedByName":"MinmusIndustries","CreatedById":61297,"CreatedDateTime":"2013-05-30T09:22:25Z","Content":"\n\u003Cp\u003Ecan anyone make a USS Enterprise for me please? I saw into darkness last night and got into Star Trek.\u003C/p\u003E\n"},{"CreatedByName":"Good_Apollo","CreatedById":46497,"CreatedDateTime":"2013-05-30T09:30:24Z","Content":"\n\u003Cp\u003EThese were fairly functional in both atmosphere and space using conventional aerodynamics and Newtonian physics. They utilized RCS thrusters and reduced forward velocity by retrograde burning. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.wikia.com/galacticafanon/images/a/a1/Viper_MarkII.jpg\u0022 alt=\u0022Viper_MarkII.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow as to the reality of space combat...less so. Though I thought the Mass Effect universe thoroughly explained practical space warfare even if it didn\u0027t visualize it properly. (Granted everything ran on only a semi-plausible capability of mass manipulation)\u003C/p\u003E\n"},{"CreatedByName":"Warscribe","CreatedById":58388,"CreatedDateTime":"2013-05-30T09:47:41Z","Content":"\n\u003Cp\u003EHere. It was hella unstable, though:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v699/BlackAnti/screenshot129_zps53f98363.png~original\u0022 alt=\u0022screenshot129_zps53f98363.png~original\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-30T14:46:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warscribe\u0022 data-cite=\u0022Warscribe\u0022\u003E\u003Cdiv\u003EHere. It was hella unstable, though:\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v699/BlackAnti/screenshot129_zps53f98363.png~original\u0022 alt=\u0022screenshot129_zps53f98363.png~original\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESweet, this must be how the empire got its start? Research and DEV.\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-30T14:48:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MinmusIndustries\u0022 data-cite=\u0022MinmusIndustries\u0022\u003E\u003Cdiv\u003Ecan anyone make a USS Enterprise for me please? I saw into darkness last night and got into Star Trek.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think someone already is making one, check the spaceport.\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-30T14:52:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Good_Apollo\u0022 data-cite=\u0022Good_Apollo\u0022\u003E\u003Cdiv\u003EThese were fairly functional in both atmosphere and space using conventional aerodynamics and Newtonian physics. They utilized RCS thrusters and reduced forward velocity by retrograde burning. \u003Cp\u003E\u003Cimg src=\u0022http://images.wikia.com/galacticafanon/images/a/a1/Viper_MarkII.jpg\u0022 alt=\u0022Viper_MarkII.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow as to the reality of space combat...less so. Though I thought the Mass Effect universe thoroughly explained practical space warfare even if it didn\u0027t visualize it properly. (Granted everything ran on only a semi-plausible capability of mass manipulation)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was always a fan of BSG, always liked the viper.\u003C/p\u003E\n"},{"CreatedByName":"Warscribe","CreatedById":58388,"CreatedDateTime":"2013-05-30T14:54:18Z","Content":"\n\u003Cp\u003Ei tried to make the viper too, but the thing is totally not made for athmospheric flight,\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-05-31T14:34:33Z","Content":"\n\u003Cp\u003EWell the thing about sci fi is, it has to look good, lucasology makes em fly.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1105.photobucket.com/user/pyratecaptmorgan/media/screenshot55_zps835fa9fc.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1105.photobucket.com/albums/h349/pyratecaptmorgan/screenshot55_zps835fa9fc.png\u0022 alt=\u0022screenshot55_zps835fa9fc.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETake that one for example, although a great design, making it fly was rather difficult, so i opted for a set of vtol engines that dont let thrust be seen, oh its there, but no damage, no effects, other than flight. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1105.photobucket.com/user/pyratecaptmorgan/media/screenshot65_zpsd62b6ab1.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1105.photobucket.com/albums/h349/pyratecaptmorgan/screenshot65_zpsd62b6ab1.png\u0022 alt=\u0022screenshot65_zpsd62b6ab1.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is it in the hanger with the APC stowed. The whole thing is quite amusing to use, \u003C/p\u003E\u003Cp\u003EAs stated in the thread, wont really be availible for use, but i have seen military style ships being done, and they get \u0022colorful\u0022 military equipment is plain, drab and ugly. Having served 8 years in an AB, i know this first hand.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1105.photobucket.com/user/pyratecaptmorgan/media/screenshot64_zpsbd22e742.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1105.photobucket.com/albums/h349/pyratecaptmorgan/screenshot64_zpsbd22e742.png\u0022 alt=\u0022screenshot64_zpsbd22e742.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENow if only i can get the CART thingy down. i dont have a clue how it works. But i will dismantle one and see.\u003C/p\u003E\n"},{"CreatedByName":"White Rider","CreatedById":66087,"CreatedDateTime":"2013-05-31T15:31:32Z","Content":"\n\u003Cp\u003ESlight update on the TIE SSTO design, made it lighter, added more engines: failed to reach high altitude but flew stable.\u003C/p\u003E\u003Cp\u003EAdded more weight and removed a set of engines: still very stable... Have to be very careful when gaining altitude and try and gain as much speed as possible. She\u0027s a big girl and takes a while to gain velocity.\u003C/p\u003E\u003Cp\u003EThink I pushed it up too hard to early. Had to nose down at about 12k to gain speed. Flameout at 22k. Remained stable. Managed to get sub orbital at 80k with some fuel left for the jets.\u003C/p\u003E\u003Cp\u003EEnded simulation.\u003C/p\u003E\n"}]}