{"TopicId":30057,"ForumId":32,"TopicTitle":"The ethics of Space","CreatedByName":"FollowingGhosts","CreatedById":68396,"CreatedDateTime":"2013-05-29T18:57:11Z","PageNum":5,"Articles":[{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2013-06-18T15:59:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Khrissetti\u0022 data-cite=\u0022Khrissetti\u0022\u003E\u003Cdiv\u003EDepends. Would rescuing a kerbal be fun or a grinding and frustrating waste of time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHave to say I\u0027m really not one for grind. In the X game series, I tend to trade-grind just far enough get my first station and then run SETA (Err.. Singularity Engine Time Accelerator - they made Time Warp a purchasable in-game object) overnight with my ship 200km above the ecliptic to avoid police checks. Come back in the morning to either an explodified, pirate-raped station, or enough credits in the bank to buy another station or half decent ship. Save or reload accordingly. The game gets a lot more fun once you have your own M6 (corvette) or M7 (frigate) class ship and a good enough income from stations and station-complexes to supply yourself frequently.\u003C/p\u003E\u003Cp\u003EAs for the Player Hub missions.. what kind of sado-masochist thought those up? An entire complex of 13 chip fabs and it still takes \u003Cem\u003Edays\u003C/em\u003E of 10x SETA to get the required resources where they need to be?\u003C/p\u003E\u003Cp\u003EKSP on the other hand, doesn\u0027t have much in the way of deliberately-introduced and frankly boring grind-work. It\u0027s all challenges that you set yourself at present, and every launch is a unique thing just waiting to screw up in a new and completely unexpected way. Whatever happens with career mode.. Squad, please avoid the temptation to Add More Grind in order to artificially extend gameplay. You\u0027ve already got gameplay by the ton!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-18T16:04:04Z\u0022 title=\u002206/18/2013 04:04  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 18, 2013\u003C/time\u003E by technicalfool\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-06-18T17:41:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Designer225\u0022 data-cite=\u0022Designer225\u0022\u003E\u003Cdiv\u003EWhat if the career mode is launched?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWill they add in life-support and consumable resources other than fuel? I imagine there would be a lot more dead Kerbals than the few I\u0027ve accidentally pancaked on the Mun\u0027s surface.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Kalawang\u0022 data-cite=\u0022Captain Kalawang\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://tvtropes.org/pmwiki/pmwiki.php/Main/VideoGameCrueltyPotential\u0022 rel=\u0022external nofollow\u0022\u003EVideo Game Cruelty Potential\u003C/a\u003E much? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t follow.\u003C/p\u003E\u003Cp\u003ERescue missions are pretty challenging but sometimes you just want to get on with testing the next iteration of your interplanetary craft. I suppose that\u0027s what \u0022End Flight\u0022 is for.\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-06-18T18:13:04Z","Content":"\n\u003Cp\u003EI generally shoot for a safe return, but sometimes it doesn\u0027t happen and I don\u0027t lose sleep over it.\u003C/p\u003E\u003Cp\u003EI have to admit, watching a rover roll over on Jeb and then his suit popping like a grape with an audible foomp! is pretty darn funny. It was a lonely drive for Bill back to the lander, though.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2013-06-18T18:50:01Z","Content":"\n\u003Cp\u003EI have thought about this problem to such an extent that I maintain two separate save files, one called \u0022Simulator\u0022 and one called \u0022Missions\u0022: though deaths are only \u0027real\u0027 on the latter, I\u0027m so attached to my Kerbals (especially the original trio) that I \u003Cem\u003Estill\u003C/em\u003E end flight before the crew dies when playing in the Simulator, and I\u0027d be so sad about losing even one that I haven\u0027t yet launched a craft in the Missions save. I also keep my orbital debris set to \u0022Unlimited\u0022 so that space junk will be a real concern in the Missions save.\u003C/p\u003E\u003Cp\u003EBut once I develop a rock-solid ship, I will launch it in the Missions save and bask in the glory. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"j-tk","CreatedById":29598,"CreatedDateTime":"2013-06-18T21:46:58Z","Content":"\n\u003Cp\u003EWait: some of you DON\u0027T use Kerbals AS Probes? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"drlambnz","CreatedById":70967,"CreatedDateTime":"2013-06-18T21:54:54Z","Content":"\n\u003Cp\u003EI use F5/F9 way too much, so all my Kerbals\u0027 deaths occur every single other parallel universe than the one they\u0027re in. Regarding space ethics though, the only issue that Kerbals might have a problem with in my space program is that I very rarely plan a return trip; the way I see it, we\u0027re trying to colonise other planets. Even with a single Kerbal. I do make sure they live out the rest of their lives in comfort though; I\u0027ve taken to creating little all-in-one bases adapted for the destination, that include living quarters, science quarters, and some sort of short range transportation.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2013-06-18T23:16:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022j-tk\u0022 data-cite=\u0022j-tk\u0022\u003E\u003Cdiv\u003EWait: some of you DON\u0027T use Kerbals AS Probes? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHa ha ha :/\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"pa1983","CreatedById":58328,"CreatedDateTime":"2013-06-18T23:21:17Z","Content":"\n\u003Cp\u003EI use F5 and F9 to save kerbals some times. But I try to build safe crafts, crap do happen. Sens I fly spaceplanes the most common cause of dead kerbals is landing on Duna. High speed landing at low grav can cause the plane to bounce and nose down and well the pod is the first to go. Im considering unmanned crafts in the future.\u003C/p\u003E\u003Cp\u003EMost of my New SSTO\u0027s do have ejection systems but when you crash when landing often the pod is the first to go. Most of the time bugs kill my kerbals.\u003C/p\u003E\n"}]}