{"TopicId":31011,"ForumId":32,"TopicTitle":"Kerbal Cold War Glass Ship Simulator?","CreatedByName":"Captiva","CreatedById":69059,"CreatedDateTime":"2013-06-02T22:25:24Z","PageNum":1,"Articles":[{"CreatedByName":"Captiva","CreatedById":69059,"CreatedDateTime":"2013-06-02T22:25:24Z","Content":"\n\u003Cp\u003EI have put around 80 hours or more into this game. It is awesome. \u003C/p\u003E\u003Cp\u003EBut WHY does everything fall apart all the time? I spend more time trying to get a ship to stay together then flying them. I like shuttles and being able to land and take off. So I test pretty much every design to make sure it wont fall apart when landing. Well unless I put 50 support beams on every single part they will all just fall to pieces pretty much for no reason. \u003C/p\u003E\u003Cp\u003EIt is BEYOND frustrating and is ruining an otherwise spectacular game for me. \u003C/p\u003E\u003Cp\u003EDo kerbals not know how to weld? I mean it is a joke when you land going 6 m/s and the ship falls apart at every connection point. Or your landing gear just falls off at the drop of a hat. Finally get your new lander to the moon and your cockpit just falls off... Seriously? \u003C/p\u003E\u003Cp\u003EI am open to any suggestions as to how to fix this if there is any.\u003C/p\u003E\u003Cp\u003EI also saw a thread mentioning this.. but why is everything so heavy and hard to get into orbit? Every cool design I build ends up stripped to bare bones and with 50 rockets strapped to it just to get into orbit. \u003C/p\u003E\u003Cp\u003EKerbals have a nice modern space center with modern tracking station... But seem stuck in the 1960\u0027s when it comes to rocket technology. \u003C/p\u003E\u003Cp\u003EI feel like I am playing Cold War glass ship simulator rather then a space exploration game. These limits seem very arbitrary and can ruin the game for people who just want to design and explore space, not sit around with a calculator trying to figure out mass to weight ratios based on the rocket burn efficiency vs the atmospheric pressure and gravity as well as fuel to lift ratio.... \u003C/p\u003E\u003Cp\u003EI understand these things are part of a space program... but in real life they have rocket scientists lots of them designing and calculating and whatnot in Kerbal you are supposed to do all this yourself which results in many many hours of boring tests (some can be fun though)... I did not buy this game to be a budding rocket scientist, I bought it to build and explore in space.\u003C/p\u003E\u003Cp\u003EI am not trying to dog on anyone who likes all the things I just said I didn\u0027t like, but would like there to be some sort of middle ground... and duct tape.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Octobomb","CreatedById":59265,"CreatedDateTime":"2013-06-02T23:44:36Z","Content":"\n\u003Cp\u003EMaking stable rockets is half the fun. There are also many ways to hide struts. Pull out mechjeb or Kerbal engineer redux for TWR. Having problems getting complex stuff up? Go peruse the Spacecraft Exchange, I recommend Temstar\u0027sstuff. Go watch some Scott Manley. Bolt everything down and then some. And if all else fails? Learn to fly better. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-06-02T23:44:56Z","Content":"\n\u003Cp\u003EI use modded struts. 220000 strength there like magic lol. The idea isn\u0027t cheating, but simply allows me to use less parts. Which makes for a smoother game. That and.. the difference is night and day when it comes to rigidity. I ripped the struts out of the Novapunch pack. The mods outdated, but the struts work. KW Rockets has them too. And remember when placing struts... triangles are your friend and will keep your craft together.\u003C/p\u003E\n"},{"CreatedByName":"Captiva","CreatedById":69059,"CreatedDateTime":"2013-06-02T23:59:23Z","Content":"\n\u003Cp\u003EI watch Scott Manley... and Macy Dean is spectacular at what he does. I especially like his last episode with the air braking maneuver he pulls off with his ships. \u003C/p\u003E\u003Cp\u003Eand I do agree building is half the fun but it seems needlessly frustrating... especially the ships falling apart at every seam. \u003C/p\u003E\u003Cp\u003EI am going to check out the modded stuts... haven\u0027t ran into them on the exchange yet or I would have added them for sure. \u003C/p\u003E\u003Cp\u003EThanks for the advice so far guys.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-03T02:04:15Z\u0022 title=\u002206/03/2013 02:04  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 3, 2013\u003C/time\u003E by Captiva\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-06-03T00:09:38Z","Content":"\n\u003Cp\u003EIf you are starting, wait to make space shuttles. KSP engines do not gimbal enough to make them easy to make, and imbalanced things are hard to launch anyway. Also, as said before, strut everything. If it bends, simplify the craft if possible and add struts.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-06-03T00:15:43Z","Content":"\n\u003Cp\u003ETwo words: MOAR STRUTS.\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-06-03T00:21:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captiva\u0022 data-cite=\u0022Captiva\u0022\u003E\u003Cdiv\u003EI have put around 80 hours or more into this game. It is awesome. \u003Cp\u003EDo kerbals not know how to weld? I mean it is a joke when you land going 6 m/s and the ship falls apart at every connection point. Or your landing gear just falls off at the drop of a hat. Finally get your new lander to the moon and your cockpit just falls off... Seriously? \u003C/p\u003E\u003Cp\u003EMetal is not indestructible. Depending on what system you use, 6m/s equals 13.5MPH or21.73kph. Two years ago I managed to physically bent the front axle of my mom\u0027s car by hitting the curb at less than 5MPH. Keep in mind that the mass of a spacecraft factors into landing speed. If your having problems with your rockets falling apart on touchdown, try adding more landing gear to farther absorb the shock of landing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-06-03T01:03:16Z","Content":"\n\u003Cp\u003EMOAR STRUTS. (Also, moar boosters.)\u003C/p\u003E\u003Cp\u003EBesides that, there are a few things you should be doing. One is simplifying; don\u0027t use ten small fuel tanks when one large one can do the same job. Don\u0027t just make gigantic stacks of small items attached end-to-end; try attaching everything to a single large core, to reduce the stresses. And as much as you might want to, you can\u0027t just place struts wherever you want, you have to actually pay attention to which directions the shear forces fall in.\u003C/p\u003E\u003Cp\u003EAlso, mods really help here. The best for this is KW Rocketry; it adds 3.75m parts, which greatly help with the simplification issue, but it also implements three levels of strut; the base stock strut is the \u0022light\u0022 version. The medium strut has a much higher strength, equivalent to ~10 regular struts, but weighs quite a bit more (which makes it a good choice for struts you expect to deal with high stresses); basically, you use it in cases where previously you\u0027d stick a half-dozen struts, but it\u0027s too heavy to use for those cases where you just need a small support to keep things from wobbling. The heavy strut is even more massive, with the kind of strength that can hold big 3.75m fuel tanks to each other, so you\u0027ll use it for those few places you KNOW experience huge forces on a regular basis.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-03T01:19:18Z","Content":"\n\u003Cp\u003ESmall KSP ships are quite strong and easy to build, but yes, the bigger a vehicle gets, the more engineering you\u0027re going to have to do to make sure it holds together and works properly. That\u0027s quite reasonable and part of the challenge of the game, and it\u0027s proportional to the size of the ship and the complexity of its mission. This isn\u0027t meant to be a SimCity-kind of a game where you just plop down a residential block and the housing plots, buildings, sewer pipes, and power connections fill themselves in. This is rocket science, where the government is putting up the resources and collecting the smartest people to achieve new technical feats, and YOU as director of the space program, have to figure out how to get it done. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Brenok","CreatedById":49609,"CreatedDateTime":"2013-06-03T01:21:02Z","Content":"\n\u003Cp\u003ESome things to consider:\u003C/p\u003E\u003Cp\u003E1- Really, really be sure that there are struts connecting things, specially when building radially. I usually use the radial decoupler together with struts, because the default connections are very weak.\u003C/p\u003E\u003Cp\u003E2- What exactly is the size of the spacecraft you\u0027re trying to launch? Pictures would be useful.\u003C/p\u003E\u003Cp\u003E3- This:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheDarkStar\u0022 data-cite=\u0022TheDarkStar\u0022\u003E\u003Cdiv\u003EIf you are starting, wait to make space shuttles.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe aerodynamics are pretty much broken on this stage of the game, and shuttles are not very recommended.\u003C/p\u003E\n"},{"CreatedByName":"Captiva","CreatedById":69059,"CreatedDateTime":"2013-06-03T01:43:53Z","Content":"\n\u003Cp\u003EJust FYI I have with all stock parts and no cheating put many ships and a station into orbit around Kerbal and managed to land on the Mun in one piece. All with ships and landers I personally built. So I do not mistake this game for Sim City and understand it takes effort... \u003C/p\u003E\u003Cp\u003EI have yet to go further then the Mun and is why I have been working a new lander for a Duna mission... put 5 hours of testing and still haven\u0027t got one I am happy with. Even with thrust and mass perfectly centered they still don\u0027t seem to want to fly straight up and down using vtol style setup, which can easily spell disaster on landing if cant stop horizontal velocity.... There is always parachutes for Duna, but only a one time use thing, I want to make a reusable lander which is why not falling apart is essential....\u003C/p\u003E\u003Cp\u003EI just feel needlessly frustrated with how \u0022simple\u0022 I have to make my designs to get them to not fall apart or get into orbit reasonably easy. I do appreciate all the info so far and am going to try out a few suggestions next time I give it a go.\u003C/p\u003E\n"},{"CreatedByName":"Captiva","CreatedById":69059,"CreatedDateTime":"2013-06-03T01:46:04Z","Content":"\n\u003Cp\u003EPlaying Dwarf Fortress at the moment, will put a picture up of my latest lander design here in a bit...\u003C/p\u003E\n"},{"CreatedByName":"Zaiyd","CreatedById":68516,"CreatedDateTime":"2013-06-03T02:42:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captiva\u0022 data-cite=\u0022Captiva\u0022\u003E\u003Cdiv\u003EThere is always parachutes for Duna, but only a one time use thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you watched videos or viewed the forums at all youd know that you can EVA and repair Wheels and repack parachutes with kerbals,\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captiva\u0022 data-cite=\u0022Captiva\u0022\u003E\u003Cdiv\u003Eput 5 hours of testing and still haven\u0027t got one I am happy with. Even with thrust and mass perfectly centered they still don\u0027t seem to want to fly straight up and down using vtol style setup[\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you use fins at the base of your rocket and an ASAS (initializing the ASAS before you even start anything else) your rocket should be able to its next stage without wobbling too much\u003C/p\u003E\u003Cp\u003Eand for your first post, the only reason rocketry has come along as far as it has is because of trial an error. Countries use very few lifters because they work and reliable to get to space some of the time. They still have to take weeks to prepare for a mundane launch so that a stray wind gust doesnt screw everything over. Things can and will go wrong just as fast as in the 50\u0027s and 60\u0027s. The only reason why it seems like we\u0027ve advanced with rocket tech is because as a whole we\u0027ve found a design or two that doesnt fail everytime and because of all of the preperation. To thought that NASA or the ESA can just put a rocket into orbit without a sweat is silly. There is an anology with rockets and it goes when you\u0027re on top of a rocket you\u0027re on a tin can full of gas. Just because you dont hear of their failures very often doesnt mean that it is any less likely. \u003C/p\u003E\u003Cp\u003EIf you want to only explore space then this prolly isnt the game for you. This is a rocket building simulator and the exploration is the reward. \u003C/p\u003E\u003Cp\u003EAnd please remember this is a single player game no one cares what you\u0027ve done especially if you\u0027re going to gloat. It doesnt matter how good you are it only matters how much you like the game. If you dont like the game dont play it and ask yourself if it was time well spent. (Hint: Hint: If you\u0027re think that you\u0027re good at the game and think it matters because you\u0027re using stock parts, you\u0027re silly again) You really should explore mods especially once more of them xfer over to .20. \u003C/p\u003E\u003Cp\u003EThe only thing that you\u0027re giving up by looking at resources or installing mods is that voice in the back of your head that is saying wouldnt it be so much more rewarding if i did it without help? If you\u0027re going to continue playing the game though you\u0027re going to have to balance that out with how much you\u0027re enjoying yourself. The game doesnt need to change because you want it to be different. IT is a single player experience and you are responsible for how you play the game.\u003C/p\u003E\n"},{"CreatedByName":"Rocketscience101","CreatedById":12864,"CreatedDateTime":"2013-06-03T03:56:48Z","Content":"\n\u003Cp\u003EWho said space travel was easy? You have to understand how hard it really is and enjoy your semi realistic game. Unless you work at NASA I see no reason to complain.\u003C/p\u003E\n"},{"CreatedByName":"BaneOfPilots","CreatedById":61884,"CreatedDateTime":"2013-06-03T04:10:49Z","Content":"\n\u003Cp\u003EWell, the second line of my signature certainly fits here...\u003C/p\u003E\n"},{"CreatedByName":"Captiva","CreatedById":69059,"CreatedDateTime":"2013-06-03T05:17:53Z","Content":"\n\u003Cp\u003EZaiyd... I do watch videos and have never seen those things done... thanks for the info, but not sure why you have to sound rude about it. \u003C/p\u003E\u003Cp\u003EGetting a ship into orbit around Kerban is only a fraction of the game and I highly doubt that the developers only added in the entire solar system as an afterthought. \u003C/p\u003E\u003Cp\u003EI only gave my opinion and was not looking to argue, as I am well aware some people enjoy building rockets... I enjoy building space stations and space ships, all of which are part of the game.\u003C/p\u003E\u003Cp\u003EAlso I was responding to the post about how this is not easy like sim city that is why I mentioned I had already went to the mun. I hardly consider that gloating especially since it is a very small accomplishment to the things I am sure most of the people on here have done. I do use mods as well usually, I was just mentioning I didn\u0027t use mod parts to go to the mun because some can be way overpowered.\u003C/p\u003E\u003Cp\u003EI didn\u0027t build a rocket I built a lander and yes it has asas on it. I like to build things that last and are reusable. My main complaint was about durability of connection of parts.\u003C/p\u003E\u003Cp\u003ETrolling me seems fruitless and pointless. I am entitled to my opinions the same as anyone and I am well aware of what the game is and how it can be played.\u003C/p\u003E\u003Cp\u003EThat said I do welcome constructive criticism and any help but am not trying to say any way of playing the game is better, just that there are more then one way to play.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-03T09:00:20Z\u0022 title=\u002206/03/2013 09:00  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 3, 2013\u003C/time\u003E by Captiva\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-03T08:09:04Z","Content":"\n\u003Cp\u003EAs for larger ships being less stable, it\u0027s also worth pointing out that so far the development of the game has a followed a cycle. We get a set of parts that are adequate for the destinations in the game, and then they add a new set of farther destinations that require larger rockets, and then those existing parts are kind of small for the new jobs we ask of them. So then we get some larger parts, and the cycle begins again. That means that often, we are pushing the limits of what the available parts can do, which can make them seem fragile.\u003C/p\u003E\n"},{"CreatedByName":"eurybaric","CreatedById":33541,"CreatedDateTime":"2013-06-03T09:27:44Z","Content":"\n\u003Cp\u003EActually my advice is quite contrary to most posts here. I say: go smaller! Large assemblies require a large amount of study as to where which part will go: weight distribution, thrust vectors, pressure points, etc. and remember that you\u0027ll be dealing with large numbers! so it\u0027s bound to collapse on itself if it\u0027s not perfectly designed!\u003C/p\u003E\u003Cp\u003EOn the other hand, if you dedicate yourself to making your vehicles smaller, you\u0027ll find that as your designs get better, you don\u0027t need large rockets to go anywhere! \u003C/p\u003E\u003Cp\u003Efor reference, check out these threads:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24017-Least-delta-v-to-orbit?highlight=challenge\u0022 rel=\u0022external nofollow\u0022\u003ELeast delta v to orbit\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27567-See-space-on-micro-parts/page2?highlight=challenge\u0022 rel=\u0022external nofollow\u0022\u003ESee space on micro-parts\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25468-SESRV-Smallest-Eve-Sample-Return-Vehicle?highlight=challenge\u0022 rel=\u0022external nofollow\u0022\u003ESESRV: Smallest Eve Sample Return Vehicle\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand there was this thread about smallest ship to Mun and back but i couldn\u0027t find it.\u003C/p\u003E\u003Cp\u003Eanyway, that\u0027s my two cents \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Echeers!\u003C/p\u003E\u003Cp\u003EEDIT: and if you\u0027re really in need of a large outpost or space vehicle, assemble it in space by launching several small parts and assembling them (docking) in orbit!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-03T09:30:11Z\u0022 title=\u002206/03/2013 09:30  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 3, 2013\u003C/time\u003E by eurybaric\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-06-03T10:31:27Z","Content":"\n\u003Cp\u003EIf your lander breaks at 6m/s, land slower. Or add moar struts. Unless you\u0027re pushing your flying abilities and only barely manage to slow down to 6m/s just before touchdown every time then landing at 1m/s or slower shouldn\u0027t be a problem. Some parts have hidden weaknesses, be it by design or bugs, that\u0027s just part of testing and learning what to use and how.\u003C/p\u003E\u003Cp\u003EAs has been mentioned, the atmospheric model is still under heavy development so SSTOs and VTOLs are hard to do. \u003C/p\u003E\u003Cp\u003ERandom stuff will happen, the game is still in development, you knew that when you bought the game so nothing to be frustrated about. And it doesn\u0027t matter why you bought the game, the game is what it is, you play it as such or find another one. Of course you\u0027re free to share your opinions, but if they don\u0027t share the vision of the developers or aren\u0027t close enough to them then I don\u0027t see the point.\u003C/p\u003E\u003Cp\u003EThere are plenty of space exploration / flight games out there to fill any and all of your easy fast fun needs, this game is all about the hard realism and I hope they keep it that way.\u003C/p\u003E\n"},{"CreatedByName":"the_bT","CreatedById":3876,"CreatedDateTime":"2013-06-03T11:14:26Z","Content":"\n\u003Cp\u003EJust to put things into perspective:\u003C/p\u003E\u003Cp\u003EYou will hit the ground with 6m/s after falling from a height of about 2m/6ft.\u003C/p\u003E\u003Cp\u003EThat\u0027s more crashing than landing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EOther than that I agree... Things get floppy to easily. Most KSP rockets are mostly cylindrical in shape. That would make them pretty rigid in real live. Jet the joints don\u0027t seem model that. They look more like a single one-point connection. I believe that should be fixed in some way. Might not be easy to do though, considering how physics engines in general work.\u003C/p\u003E\u003Cp\u003EFor now I would (as it seems everyone) stick to struts. If you put a bunch between tanks you get a pretty rigid multi-point connection. Trade off is the part count obviously...\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-06-03T11:41:18Z","Content":"\n\u003Cp\u003EI\u0027ve never watched anything. I just use trial-and-error, and once I find a rocket that is pretty stable, I use it for all my launches.\u003C/p\u003E\u003Cp\u003EI currently have three boosters.\u003C/p\u003E\u003Cp\u003EMoonshot-Derived Launcher (12 struts in total.)\u003C/p\u003E\u003Cp\u003EDeep Sky-Derived Light Launcher (No struts.)\u003C/p\u003E\u003Cp\u003EHLLV(Only 16 Struts.)\u003C/p\u003E\u003Cp\u003EFind a launcher that works, and use it over and over.\u003C/p\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2013-06-03T15:10:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captiva\u0022 data-cite=\u0022Captiva\u0022\u003E\u003Cdiv\u003EI have put around 80 hours or more into this game. It is awesome. \u003Cp\u003EBut WHY does everything fall apart all the time? I spend more time trying to get a ship to stay together then flying them. I like shuttles and being able to land and take off. So I test pretty much every design to make sure it wont fall apart when landing. Well unless I put 50 support beams on every single part they will all just fall to pieces pretty much for no reason. \u003C/p\u003E\u003Cp\u003EIt is BEYOND frustrating and is ruining an otherwise spectacular game for me. \u003C/p\u003E\u003Cp\u003EDo kerbals not know how to weld? I mean it is a joke when you land going 6 m/s and the ship falls apart at every connection point. Or your landing gear just falls off at the drop of a hat. Finally get your new lander to the moon and your cockpit just falls off... Seriously? \u003C/p\u003E\u003Cp\u003EI am open to any suggestions as to how to fix this if there is any.\u003C/p\u003E\u003Cp\u003EI also saw a thread mentioning this.. but why is everything so heavy and hard to get into orbit? Every cool design I build ends up stripped to bare bones and with 50 rockets strapped to it just to get into orbit. \u003C/p\u003E\u003Cp\u003EKerbals have a nice modern space center with modern tracking station... But seem stuck in the 1960\u0027s when it comes to rocket technology. \u003C/p\u003E\u003Cp\u003EI feel like I am playing Cold War glass ship simulator rather then a space exploration game. These limits seem very arbitrary and can ruin the game for people who just want to design and explore space, not sit around with a calculator trying to figure out mass to weight ratios based on the rocket burn efficiency vs the atmospheric pressure and gravity as well as fuel to lift ratio.... \u003C/p\u003E\u003Cp\u003EI understand these things are part of a space program... but in real life they have rocket scientists lots of them designing and calculating and whatnot in Kerbal you are supposed to do all this yourself which results in many many hours of boring tests (some can be fun though)... I did not buy this game to be a budding rocket scientist, I bought it to build and explore in space.\u003C/p\u003E\u003Cp\u003EI am not trying to dog on anyone who likes all the things I just said I didn\u0027t like, but would like there to be some sort of middle ground... and duct tape.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had this problem for a while, where every design ended up being massive, complicated, and largely prone to failure. I\u0027ve adopted two rules for all my builds now.\u003C/p\u003E\u003Cp\u003E1) No matter what you build, try to do it in 100 parts or less.\u003C/p\u003E\u003Cp\u003E2) Start small and build up in scale from there. If you can\u0027t build a small super sonic jet that is easy to fly and land, you have no chance of designing and using a much bigger one.\u003C/p\u003E\u003Cp\u003E3) Then, when you are ready: if you want to build something massive, utilize massive parts. Not massive quantities of small parts.\u003C/p\u003E\u003Cp\u003EThe stock parts are ideal for smaller creations and the physics engine is happy that way. You can use them to build larger creations, but then you end up with either a complete failure or a monstrosity with more struts than any other parts. And forget getting two of them on in close proximity or even docking. The best bet is to explore B9 and some other mods which give you much bigger parts to play with. They present their own challenges, but at lease you\u0027ll be able to go big without making the physics engine cry and killing the experience with jittery or stop motion gameplay.\u003C/p\u003E\n"}]}