{"TopicId":31947,"ForumId":32,"TopicTitle":"RCS - less is more?","CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-06-08T00:46:30Z","PageNum":1,"Articles":[{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-06-08T00:46:30Z","Content":"\n\u003Cp\u003EFor docking with other vessels in space, is it better to have fewer RCS thrusters? or more?\u003C/p\u003E\u003Cp\u003EI\u0027ve gone with the more is more philosophy, but I struggle so much docking. I\u0027ve even tried MechJeb docking assist, and it just seems that it dances all over the place. \u003C/p\u003E\u003Cp\u003EI\u0027m going to attemt to build a docking vessel with as few RCS thrusters as possible and see if that helps or hinders.\u003C/p\u003E\u003Cp\u003EWhat do you guys think? What have you found?\u003C/p\u003E\n"},{"CreatedByName":"deadshot462","CreatedById":13659,"CreatedDateTime":"2013-06-08T00:51:44Z","Content":"\n\u003Cp\u003EFor smaller ships/landers, fewer RCS thrusters is definetely better.\u003C/p\u003E\u003Cp\u003EFor bigger ships/rockets/boosters, just a few extra well placed RCS thrusters can make a big difference. On bigger ships, more RCS thrusters just help rotate faster.\u003C/p\u003E\u003Cp\u003EI would keep the number of thrusters low on any ship that has to do fine adjustments for docking/maneuvering\u003C/p\u003E\n"},{"CreatedByName":"Camelotking524","CreatedById":58776,"CreatedDateTime":"2013-06-08T00:58:20Z","Content":"\n\u003Cp\u003EYou can dock without RCS if you want a challenge, but placement matters more then number IMO.\u003C/p\u003E\n"},{"CreatedByName":"Atanar","CreatedById":59913,"CreatedDateTime":"2013-06-08T01:02:25Z","Content":"\n\u003Cp\u003EFor docking placement is key. See that you place the 4-thruster block at the height of the centre of mass in 4-symetry and align them with the cardinal directions, this makes it most controllable with the least amount of RCS.\u003C/p\u003E\u003Cp\u003EAnd yes, you can dock over 100 tons with those 4 thrusters:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/FVLjeXl\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/FVLjeXll.jpg\u0022 alt=\u0022FVLjeXll.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(the rock is 600 tons from a challenge and the craft itself about 130, the docking was the 2 big docking ports, docking was done manually using less than a 1m RCS contrainer, the thrusters are hidden on the middle tank)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-08T01:10:11Z\u0022 title=\u002206/08/2013 01:10  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 8, 2013\u003C/time\u003E by Atanar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-08T01:03:57Z","Content":"\n\u003Cp\u003EUse the gravity hack to balance your RCS above the launch pad.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/28983-How-To-Balance-RCS-On-Your-Payload?highlight=balance\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/28983-How-To-Balance-RCS-On-Your-Payload?highlight=balance\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Conarr","CreatedById":60613,"CreatedDateTime":"2013-06-08T01:12:46Z","Content":"\n\u003Cp\u003EI\u0027ve found that on smaller vessels putting the RCS blocks at the center of mass makes it pretty responsive, but on larger vessels the farther from the center of mass the better.\u003C/p\u003E\n"},{"CreatedByName":"Atanar","CreatedById":59913,"CreatedDateTime":"2013-06-08T01:22:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Conarr\u0022 data-cite=\u0022Conarr\u0022\u003E\u003Cdiv\u003EI\u0027ve found that on smaller vessels putting the RCS blocks at the center of mass makes it pretty responsive, but on larger vessels the farther from the center of mass the better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe\u0027s talking about docking. Having thrusters off center for translation is a waste of fuel. Turning is a diffrent thing of course.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-06-08T01:40:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003EFor docking placement is key. See that you place the 4-thruster block at the height of the centre of mass in 4-symetry and align them with the cardinal directions, this makes it most controllable with the least amount of RCS.\u003Cp\u003EAnd yes, you can dock over 100 tons with those 4 thrusters:\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith patience yes. For those that can\u0027t manage the patience do NOT use 8-symmetry, you\u0027ll waste a lot of RCS fuel that way. You\u0027ll want the same 4 symmetry above and below the center of mass by equal distances, and you\u0027ll want them at least 2.63 times as far above or below the center of mass as they are out from the center of mass. So if you\u0027re doing this on a 2.5m central stalk, you\u0027ll want the RCS quads at least 3.27 meters above/below the CoM. If you don\u0027t, then the quads can do odd things trying to compensate for the fact that the thrust they want isn\u0027t exactly on a cardinal direction. NOTE: I haven\u0027t done testing to see at what point the RCS quads start firing two at a time, so you may not actually need them that far, that\u0027s just the value I use to be sure.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003EHe\u0027s talking about docking. Having thrusters off center for translation is a waste of fuel. Turning is a diffrent thing of course.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think he\u0027s talking about balanced above and below the CoM, which doesn\u0027t change translation, only rotation. Not having your center of RCS thrust in the same place as your CoM is just plain bad in every way, if that\u0027s not what he\u0027s saying.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-08T01:46:06Z\u0022 title=\u002206/08/2013 01:46  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 8, 2013\u003C/time\u003E by Eric S\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pontiac","CreatedById":62216,"CreatedDateTime":"2013-06-08T01:45:26Z","Content":"\n\u003Cp\u003E@Atanar\u003C/p\u003E\u003Cp\u003EWouldn\u0027t that still depend on how you\u0027re docking and what you\u0027re docking with? If you\u0027re presumably lined up along the Z, with a momentum going towards the docking point, you\u0027ve got left, right, up and down to play with still. If you have RCS in the center, just as a pair or quad, and if you\u0027re positioning of the RCS is off by a little bit, you could introduce rotation. If you put a quad at the ends of your vessel equi-distance from the COM, you\u0027ll be able to evenly move the 4 directions with less chance of rotation.\u003C/p\u003E\n"},{"CreatedByName":"Conarr","CreatedById":60613,"CreatedDateTime":"2013-06-08T01:49:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003EHe\u0027s talking about docking. Having thrusters off center for translation is a waste of fuel. Turning is a diffrent thing of course.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoh! I sit corrected. Sorry guys.\u003C/p\u003E\n"},{"CreatedByName":"steveman0","CreatedById":64580,"CreatedDateTime":"2013-06-08T02:23:18Z","Content":"\n\u003Cp\u003EI usually do a set of 4 equally above and below the center of mass. Even with the largest of vessels this has proven to be enough for docking. I use the docking camera to get my rotation right first and then lock it in with ASAS and just the smallest burst of RCS will get the translation right given enough time. I\u0027ve docked \u0026gt;100 tons with just those 8 blocks and ~30 RCS fuel.\u003C/p\u003E\n"},{"CreatedByName":"Atanar","CreatedById":59913,"CreatedDateTime":"2013-06-08T02:40:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pontiac\u0022 data-cite=\u0022Pontiac\u0022\u003E\u003Cdiv\u003E@Atanar\u003Cp\u003EWouldn\u0027t that still depend on how you\u0027re docking and what you\u0027re docking with? If you\u0027re presumably lined up along the Z, with a momentum going towards the docking point, you\u0027ve got left, right, up and down to play with still. If you have RCS in the center, just as a pair or quad, and if you\u0027re positioning of the RCS is off by a little bit, you could introduce rotation. If you put a quad at the ends of your vessel equi-distance from the COM, you\u0027ll be able to evenly move the 4 directions with less chance of rotation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point. But what if you don\u0027t get the 2 distances exact? would that not rotate the craft as well? Is it really less chance? It all boils down how close you get the \u0022centre of thrust\u0022 of the RCS to the COM. Too bad we can\u0027t display that.\u003C/p\u003E\n"},{"CreatedByName":"steveman0","CreatedById":64580,"CreatedDateTime":"2013-06-08T04:03:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003EGood point. But what if you don\u0027t get the 2 distances exact? would that not rotate the craft as well? Is it really less chance? It all boils down how close you get the \u0022centre of thrust\u0022 of the RCS to the COM. Too bad we can\u0027t display that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can still end up with rotation but if they are far enough out it is easy to get it pretty close and then ASAS will keep you from turning with small corrections. When making a translation velocity adjustment the RCS remains on for another second or two after I let off to counter act the rotation and then the whole rocket just goes into a silent drift until the next manual correction is needed.\u003C/p\u003E\n"}]}