{"TopicId":33521,"ForumId":32,"TopicTitle":"What happened when you first landed on the Mun?","CreatedByName":"rhj91","CreatedById":37852,"CreatedDateTime":"2013-06-17T22:02:22Z","PageNum":4,"Articles":[{"CreatedByName":"Uberick","CreatedById":65954,"CreatedDateTime":"2013-06-20T14:28:45Z","Content":"\n\u003Cp\u003EMy first moon landing was stressful as all get out. I didn\u0027t know that I could autosave, so every action had significant consequences. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I got into orbit, and then burned off enough speed to drop my orbit to the planet. That put me into a very shallow descent, with very little vertical speed but a TON of horizontal speed. I wasn\u0027t able to burn off all of the horizontal speed, and my lander ended up bouncing off the mun and rolling end over end until it finally ground to a halt. The crew survived, but the vessel was not capable of re-achieving orbit.\u003C/p\u003E\n"},{"CreatedByName":"ThePyrateCaptain","CreatedById":57208,"CreatedDateTime":"2013-06-20T14:47:22Z","Content":"\n\u003Cp\u003EThe scientists on Kerbin dedicated a new crater to the brave and intrepid explorers that created it.\u003C/p\u003E\u003Cp\u003ECrater Dunn/Herman\u003C/p\u003E\n"},{"CreatedByName":"Subcidal","CreatedById":20751,"CreatedDateTime":"2013-06-20T14:52:00Z","Content":"\n\u003Cp\u003EFirst time i landed i came screaming in and wondered why my parachute wouldn\u0027t open.\u003C/p\u003E\u003Cp\u003EIt might be worth mentioning I was drunk at the time.\u003C/p\u003E\n"},{"CreatedByName":"LeonG17","CreatedById":65024,"CreatedDateTime":"2013-06-20T15:04:58Z","Content":"\n\u003Cp\u003EWell, the UNOFFICAL first time, so far unknown to the Kerbals as a result of quicksave, was disastrous.\u003C/p\u003E\u003Cp\u003EI had to much lateral movement, about 1m/s downwards and about 200 to the east. Yep! \u003C/p\u003E\u003Cp\u003EWhen the legs touched down, the high centre of mass and the 200m/s speed to the east made it to lots of flips! Parts went spinning of it each time it touched down.\u003C/p\u003E\u003Cp\u003EEventually, the command capsule survived and stopped, detached to everything and surrounded by a few pieces of debris.\u003C/p\u003E\u003Cp\u003ESubsequently, the quicksave button erased the Kerbals memories of that event.\u003C/p\u003E\n"},{"CreatedByName":"billybobsatan","CreatedById":68870,"CreatedDateTime":"2013-06-20T17:49:20Z","Content":"\n\u003Cp\u003E1st time, Jeb jumped out and died \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2013-06-20T18:14:18Z","Content":"\n\u003Cp\u003EAll I remember is that the crew was stranded in an eccentric orbit around Kerbin after leaving the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Thorbane","CreatedById":76234,"CreatedDateTime":"2013-08-09T20:55:50Z","Content":"\n\u003Cp\u003ECame in with about 50 m/s of horizontal velocity and bounced the command pod about 3-5 km. Then launched a rescue mission with mechjeb.\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-08-09T21:00:01Z","Content":"\n\u003Cp\u003EMy first mun landing went perfectly. The craft landed, I wandered about for a bit, took back off and headed for home. That is where things went wrong... I forgot the parachute and only had enough fuel to get myself back to kerbin, not land. \u003C/p\u003E\u003Cp\u003EEvery Mission to the Mun since then has going wrong in one way or another. Missions to Duna, Eve, Moho, Laythe, Eeloo... all go off without a hitch but the Mun? Somehow at least one kerbal dies, and another is stranded there every time.\u003C/p\u003E\n"},{"CreatedByName":"AlteranEmpire","CreatedById":34035,"CreatedDateTime":"2013-08-09T21:02:06Z","Content":"\n\u003Cp\u003EFirst time I landed WAY back when, my command pod just fell off.\u003C/p\u003E\n"},{"CreatedByName":"Itchylol","CreatedById":75424,"CreatedDateTime":"2013-08-09T21:04:29Z","Content":"\n\u003Cp\u003EThe engine fell off and then the ship fell over.\u003C/p\u003E\n"},{"CreatedByName":"Vespasianus","CreatedById":26881,"CreatedDateTime":"2013-08-09T21:05:05Z","Content":"\n\u003Cp\u003EThe *first* time I landed on the mun (without MJ) I sat back in my chair, let out a long, deep sigh of relief and then had to walk quickly around my room a few times to calm down. Then, I realised I had\u0027nt brought enough fuel for the return trip. Good times!\u003C/p\u003E\u003Cp\u003EHeh. I remember it as if it were yesterday \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2013-08-09T21:29:51Z","Content":"\n\u003Cp\u003EI jumped out of my chair and almost broke my arm.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-08-09T21:33:20Z","Content":"\n\u003Cp\u003EThe first lander I put on the Mun sank through the dust covering the regolith. So I launched a second one. That one also sank into the dust over the regolith. So I launched a third one. That one burned, fell over, THEN sank into the dust over the regolith. But the fourth one stayed up!\u003C/p\u003E\n"},{"CreatedByName":"RankWinner","CreatedById":9397,"CreatedDateTime":"2013-08-09T21:56:53Z","Content":"\n\u003Cp\u003EFirst time I landed was back in the good ol\u0027 days before we had, well, landing legs. I think I used fins as legs back then. Needless to say they broke off and everything ended horribly with me only having the capsule and a detached engine/fuel module.\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-09T22:09:14Z","Content":"\n\u003Cp\u003EFirst time i landed, my ship decided to dance\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-08-09T22:14:06Z","Content":"\n\u003Cp\u003EFirst time... perfect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E(apart from forgetting the ladder)\u003C/p\u003E\n"},{"CreatedByName":"Mr. Rogue Ace","CreatedById":68632,"CreatedDateTime":"2013-08-09T22:57:55Z","Content":"\n\u003Cp\u003EI had the demo, after 20 thousand times I managed to get a kerman on the mun, but destroying the lander in the process\u003C/p\u003E\u003Cp\u003EI jumped up and down because I have texture issues and that was amazing.\u003C/p\u003E\n"},{"CreatedByName":"Kromey","CreatedById":57375,"CreatedDateTime":"2013-08-09T23:24:29Z","Content":"\n\u003Cp\u003EFirst time I \u0022landed\u0022, there were pretty fireworks announcing my arrival, along with a puff of smoke and a disappearing act to make any magician jealous.\u003C/p\u003E\u003Cp\u003ESecond, third, and fourth \u0022landings\u0022 produced similar results.\u003C/p\u003E\u003Cp\u003EThe first time I \u003Cem\u003Elanded\u003C/em\u003E, I cheered (literally, I jumped out of my chair, pumped both fists into the air, and let out a \u0022Whoop!\u0022 -- fortunately only my cats were in the house to hear me), then promptly got cocky and decided I could hop my lander over to that arch I could just see on the horizon.\u003C/p\u003E\u003Cp\u003EAnd lo did my first \u003Cem\u003Elanding\u003C/em\u003E then become my fifth \u0022landing\u0022...\u003C/p\u003E\n"},{"CreatedByName":"Danerdygeek","CreatedById":78320,"CreatedDateTime":"2013-08-09T23:44:50Z","Content":"\n\u003Cp\u003EI attempted to build Scott Manleys usual craft with the Nerva engine, and as usual, it fell off....\u003C/p\u003E\n"},{"CreatedByName":"sickboy","CreatedById":32225,"CreatedDateTime":"2013-08-10T00:00:02Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://www.nasa.gov/sites/default/files/styles/946xvariable_height/public/apollo_11_celebration.jpg?itok=7fK8Aaap\u0022 alt=\u0022apollo_11_celebration.jpg?itok=7fK8Aaap\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethis, but i was alone.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-08-10T00:27:24Z","Content":"\n\u003Cp\u003EWell, I though that 30 m/s was a good landing speed... Why must the U.S. not use the Metric system?!!!!\u003C/p\u003E\n"},{"CreatedByName":"PlasmaticInc","CreatedById":77657,"CreatedDateTime":"2013-08-10T07:25:37Z","Content":"\n\u003Cp\u003EWhen I first landed, my fins I was using as legs (this was back in 13.3) snapped off, leaving me trapped, but intact, on the moon.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-08-10T07:38:06Z","Content":"\n\u003Cp\u003EI bounced.. well more accurately I approached the surface about 10 times trying to find the sweet spot for the throttle then finally touched down, forgot to kill the throttle and I shot back into the sky... at which point I ran out of fuel and commited a controlled flight into terrain...at about 103m/s.\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-08-10T07:58:37Z","Content":"\n\u003Cp\u003EOne word: Lithobraking.\u003C/p\u003E\u003Cp\u003ETwo words: Explosive lithobraking. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut my first landing that the Kerbals walked away from was glorious!\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-08-10T09:37:31Z","Content":"\n\u003Cp\u003EMy first successful* landing involved snapping the lander legs off and landing in a small debris field. This was after running out of fuel and exploding, and retro-thrusting into a high speed impact with the dark side.\u003C/p\u003E\u003Cp\u003EThen Bob hit the ground too hard while jetpacking and died.\u003C/p\u003E\n"}]}