{"TopicId":34562,"ForumId":32,"TopicTitle":"Most Fun part of KSP","CreatedByName":"Storm1","CreatedById":66069,"CreatedDateTime":"2013-06-24T11:10:48Z","PageNum":1,"Articles":[{"CreatedByName":"Storm1","CreatedById":66069,"CreatedDateTime":"2013-06-24T11:10:48Z","Content":"\n\u003Cp\u003EWhat is the most fun part of Ksp?\u003C/p\u003E\n"},{"CreatedByName":"Domfluff","CreatedById":64903,"CreatedDateTime":"2013-06-24T11:19:56Z","Content":"\n\u003Cp\u003EDesign!\u003C/p\u003E\u003Cp\u003EMessing around with the rocket equation, design and engineering of missions.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-06-24T11:20:27Z","Content":"\n\u003Cp\u003EA successful Mission with all your Kerbalnauts surviving is the most fun part for me.\u003C/p\u003E\n"},{"CreatedByName":"Kialar","CreatedById":60893,"CreatedDateTime":"2013-06-24T11:21:04Z","Content":"\n\u003Cp\u003EDreaming the \u0022reach for the stars dream\u0022; set foot on other worlds, even if it is only virtual. A lot of the story is going on in imagination. The game is like Lego, it is like a novel, one may write one\u0027s own cartoonish, kerbalish and epic space faring history.\u003C/p\u003E\u003Cp\u003EI will never leave earth physically, as I am to old, not fit enough. But my mind can leave earth. And when I play KSP, my mind is on the Moon, on Mars, in orbit around Venus, in my imagination, I touch down on Europa and Titan, I watch the sparkle of the Sun from Charon. I dream of expanding borders of mankind. I dream of the rumbling thunder from thousands of kN under my seat. I dream of hoovering over Saturn\u0027s Rings, of weightless existence between the stars.\u003C/p\u003E\u003Cp\u003EThat is my fun in KSP.\u003C/p\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2013-06-24T11:27:15Z","Content":"\n\u003Cp\u003ELanding on planets and moons never gets old. I\u0027ve only succesfully landed on Mun, Minmus, Eve, Ike, Duna and Laythe. So much left to do.\u003C/p\u003E\u003Cp\u003EI try to make my missions \u0022realistic\u0022, so it complicates things a bit. I can\u0027t just send a small pod to interplanetary space, it has to be a huge transfer vehicle.\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2013-06-24T11:28:21Z","Content":"\n\u003Cp\u003EI would have loved to answer your poll, but you didn\u0027t include \u0022designing and building rockets\u0022 or \u0022long-term rocket missions\u0022. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E \u0022Rocket launches and fooling around inside Kerbin\u0027s atmosphere\u0022 doesn\u0027t quite fit what I enjoy best!\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-06-24T11:32:16Z","Content":"\n\u003Cp\u003ESome of the challenges of figuring out why interplanetary rocket designs tend to become hard to fly for no apparent reason. (Major Yo Yo spinning after staging is one example.) Being able to rescue the Kerbals without an escape system when a rocket goes out of control. I just hit X to shut it down and eject the offending stages. If needed, the upper stage can be used for deorbiting.\u003C/p\u003E\u003Cp\u003EAdd, designing rockets is missing. The challenge, design the simplest rocket that can get the job done.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-06-24T11:35:37Z","Content":"\n\u003Cp\u003Eyah, tweaking those dastardly contraptions to the point they no longer fall apart before reaching orbit (or whereever you want to send them to).\u003C/p\u003E\u003Cp\u003EAnd maybe, just maybe, at one point figuring out how to get a return mission to the surface of Duna and Eve to pick up the Kerbals that I\u0027ve stranded there inadvertently (well, semi-inadvertently on Eve, I\u0027d not expected him to survive, on Duna I\u0027d not expected them to be unable to lift off again).\u003C/p\u003E\n"},{"CreatedByName":"Britguy32","CreatedById":58592,"CreatedDateTime":"2013-06-24T11:56:34Z","Content":"\n\u003Cp\u003EDesign and testing and tweaking my rockets. I\u0027ve spent more time in the VAB than in the rest of the game combined.\u003C/p\u003E\n"},{"CreatedByName":"sierra_seven_","CreatedById":72072,"CreatedDateTime":"2013-06-24T12:54:57Z","Content":"\n\u003Cp\u003ESending my brave kosmonauts on EVA! I design all sorts of stuff to help my kerbals get around in space or low-grav moons. Of course, now I have a fair few kerbals stranded around the Mun as a result of running out of monoprop/electricity/oxygen, but that\u0027s where the fun is for me!\u003C/p\u003E\n"},{"CreatedByName":"Eleven","CreatedById":60502,"CreatedDateTime":"2013-06-24T13:27:36Z","Content":"\n\u003Cp\u003EA couple have mentioned it. Design. I will spend hours building something to see if I can get it to achieve orbit, or land, or whatever specific goal I am tying to meet and after that, I rarely touch that craft again. I\u0027ll just think up something else and go build it.\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2013-06-24T13:33:44Z","Content":"\n\u003Cp\u003EDesigning rockets is fun, but I also love orbital EVA. Just flying your little green Kerbal around a station for short hops is great fun. Not that I have a proper station....\u003C/p\u003E\n"},{"CreatedByName":"AfailingHORSE","CreatedById":57657,"CreatedDateTime":"2013-06-24T13:36:07Z","Content":"\n\u003Cp\u003Eno create multipart space stations, no vote\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-06-24T14:10:52Z","Content":"\n\u003Cp\u003EI love seeing my designs and plans succeed. And the faces on my kerbals when they do. Those guys really make the game for me.\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-06-24T14:19:29Z","Content":"\n\u003Cp\u003EActually, I\u0027m more interested in building ships and stations in-orbit. They don\u0027t have to land anywhere, just derp around the system for as long as they can. There\u0027s not a selection for that.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-06-24T14:28:38Z","Content":"\n\u003Cp\u003EDesign and exploration, most definitely. I spend quite a bit of time researching conceptual spacecraft designs that did not make it off the proverbial drawing board. If they seem feasible enough, I\u0027ll try to build a KSP version of them and see if they would have worked. Then I\u0027ll attempt to fix design flaws and further refine them if possible. Then of course there\u0027s the fun challenge of working on original designs.\u003C/p\u003E\n"},{"CreatedByName":"Hedd","CreatedById":68918,"CreatedDateTime":"2013-06-24T14:43:04Z","Content":"\n\u003Cp\u003EStruts. Struts are my favorite part.\u003C/p\u003E\n"},{"CreatedByName":"Jon Tash","CreatedById":2681,"CreatedDateTime":"2013-06-24T14:48:15Z","Content":"\n\u003Cp\u003EI love staying in the VAB/SPH and build stuff that works. Rockets, planes, spaceplanes, SSTO crafts, rovers, you name it. That\u0027s where I have the most fun in this game.\u003C/p\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2013-06-24T15:14:15Z","Content":"\n\u003Cp\u003EFlying to and exploring other places in the solar system.\u003C/p\u003E\n"},{"CreatedByName":"SilentWindOfDoom","CreatedById":71611,"CreatedDateTime":"2013-06-24T15:29:53Z","Content":"\n\u003Cp\u003EWhen you spend 3 hours on building, testing and reconfiguring an expansion to your low orbit space station, then spend another hour getting the unwieldy craft docked, only to watch as some part randomly detaches once you manage it.\u003C/p\u003E\u003Cp\u003EThen as you undock the delivery vehicle, the entire assembly explodes with enough force to turn low kerbal orbit into a debris strewn death zone for decades to come. GG ksp.\u003C/p\u003E\n"},{"CreatedByName":"leopardenthusiast","CreatedById":26084,"CreatedDateTime":"2013-06-24T15:34:36Z","Content":"\n\u003Cp\u003EFor me, it is finding out that I made a mistake, and having to find a way to fix it. For instance, I recently stranded a command module in orbit, about one tenth of the way to Jool, with no propulsion. Now I must fix it, which is going to be difficult, because I have to do EVERYTHING without aerobraking much, and as fast as possible due to propellant boiloff (or I can do it entirely with the few engines that support LF/O, but I don\u0027t want to do that if I can avoid it, as LF/O is pretty much universally the worst configuration with Modular Fuel Tanks, lowest ISP and lower thrust than the more efficient and powerful LF/LOX).\u003C/p\u003E\n"},{"CreatedByName":"apfelbeck","CreatedById":64706,"CreatedDateTime":"2013-06-24T15:40:02Z","Content":"\n\u003Cp\u003EBuilding and tweaking my designs; figuring out how to do things.\u003C/p\u003E\n"},{"CreatedByName":"trvtannenberg","CreatedById":8491,"CreatedDateTime":"2013-06-24T15:43:21Z","Content":"\n\u003Cp\u003EFor me it\u0027s probes and other satalites.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2013-06-24T19:27:17Z","Content":"\n\u003Cp\u003EMine is assembling ships in orbit, just seeing your creation slowly coming to life is brilliant\u003C/p\u003E\n"},{"CreatedByName":"rasheed","CreatedById":29903,"CreatedDateTime":"2013-06-24T19:37:55Z","Content":"\n\u003Cp\u003EMaking planes are fun\u003C/p\u003E\n"}]}