{"TopicId":35018,"ForumId":32,"TopicTitle":"Why Duna is like Mars and Eve isn\u0026#039;t like Venus ?","CreatedByName":"Frogbull","CreatedById":70707,"CreatedDateTime":"2013-06-27T16:57:55Z","PageNum":2,"Articles":[{"CreatedByName":"Tobyz28","CreatedById":72108,"CreatedDateTime":"2013-06-27T22:29:49Z","Content":"\n\u003Cp\u003ETo your question \u0022why\u0022, i have the perfect answer-question.\u003C/p\u003E\u003Cp\u003E\u0022Why Not\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-06-28T03:17:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EWhat about the upper atmosphere? I remember reading something about a city that could float on the dense atmosphere. And apparently the conditions up there are... practical.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETemperature and pressure are pretty okay for Venus at a height of about 50km. Pretty close to earth sea level. But you\u0027re still dealing with harsh UV radiation, constant hurricane 5 winds and clouds of sulfuric acid eating your base.\u003C/p\u003E\u003Cp\u003EIf we ever need to pick a good place for a human outpost in the solar system, Venus should be at the bottom of the list with big red crosses and text reading \u0022Abandon hope all ye who goes here!\u0022\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2013-06-28T03:28:07Z","Content":"\n\u003Cp\u003EI wonder if there will be a Pluto-Charon like co-orbital binary dwarf planet system with multiple small moons.\u003C/p\u003E\n"},{"CreatedByName":"deadshot462","CreatedById":13659,"CreatedDateTime":"2013-06-28T03:30:54Z","Content":"\n\u003Cp\u003EI don\u0027t think the goal was to make every planet exactly the same.\u003C/p\u003E\u003Cp\u003EDuna doesn\u0027t have two moons.\u003C/p\u003E\u003Cp\u003EVenus doesn\u0027t have a moon.\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-06-28T04:08:21Z","Content":"\n\u003Cp\u003EWhile Venus is interesting from a geological and meteorological standpoint, it wouldn\u0027t be much fun to go there, and would probably introduce some substantial challenges for the devs as well. Notice no fog on any of the planets/moons?\u003C/p\u003E\u003Cp\u003EHere\u0027s a depiction of what it might look like on the surface of Venus, as presented by the series \u0022Space Odyssey: A Voyage to the Planets\u0022, aired on BBC Nov. 2004 (\u003Ca href=\u0022http://www.bbc.co.uk/sn/tvradio/programmes/spaceodyssey/programme1.shtml\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.bbc.co.uk/sn/tvradio/programmes/spaceodyssey/programme1.shtml\u003C/a\u003E):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1iQLcnf.jpg\u0022 alt=\u00221iQLcnf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe atmosphere at ground level is hot and dense enough to crush just about anything we could land there.\u003C/p\u003E\n"},{"CreatedByName":"Erlendftw","CreatedById":72535,"CreatedDateTime":"2013-06-28T04:27:51Z","Content":"\n\u003Cp\u003EI think they could have atleast changed the colors. I do understand OP at this point. It should be orange instead of purple, other than that, I kinda like it.\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2013-06-28T08:24:29Z","Content":"\n\u003Cp\u003EA friend of mine did his PHD on modeling the surface of Venus and was for a while the world\u0027s foremost Venusian vulcanologist, it was him that proved that its smoothness was the result of gradual deposition from volcanoes and erosion rather than any more catastrophic process. I tell you this mostly because I love the phrase Venusian vulcanologist.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-06-29T14:02:56Z","Content":"\n\u003Cp\u003EI personally really like the purple... Why can\u0027t purple be hot?\u003C/p\u003E\u003Cp\u003EWhy does hot have to be orange?\u003C/p\u003E\u003Cp\u003EIf the complaint is lack of clouds and lack of lava flows, the game isn\u0027t finished It\u0027s planned for Eve to have both of those, but they can\u0027t yet.\u003C/p\u003E\u003Cp\u003EPurple and Yellow are contrasting colors, so artistically a purple planet with Yellow glowing flows of lava would look really nice.\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-06-29T14:10:34Z","Content":"\n\u003Cp\u003EGoing back to some of the first comments I agree that a Venus analogue would provide a good challenge as soon as heat it implemented, for example you wouldn\u0027t want to land on top of a venting volcano or risk your craft melting.\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2013-06-29T15:40:13Z","Content":"\n\u003Cp\u003EEve is Venus\u0027s sister planet, just like Venus is our sister planet.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-06-29T15:43:26Z","Content":"\n\u003Cp\u003EBecause Eve is Eve, and Venus is Venus.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2013-06-29T16:38:23Z","Content":"\n\u003Cp\u003EWell, once we get clouds and fog, Eve might be more similar to Venus than it looks now.\u003C/p\u003E\n"},{"CreatedByName":"AHO","CreatedById":49070,"CreatedDateTime":"2013-06-29T17:16:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tomf\u0022 data-cite=\u0022tomf\u0022\u003E\u003Cdiv\u003EA friend of mine did his PHD on modeling the surface of Venus and was for a while the world\u0027s foremost Venusian vulcanologist, it was him that proved that its smoothness was the result of gradual deposition from volcanoes and erosion rather than any more catastrophic process. I tell you this mostly because I love the phrase Venusian vulcanologist.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat my friend; is really really cool. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cesarcurado","CreatedById":60073,"CreatedDateTime":"2013-06-29T17:32:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flixxbeatz\u0022 data-cite=\u0022Flixxbeatz\u0022\u003E\u003Cdiv\u003EBecause Eve is Eve, and Venus is Venus.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, this.\u003C/p\u003E\u003Cp\u003EOnly because the so-called \u0022Kerbol\u0022 system is inspired or based on Sol doesn\u0027t means it has to be exactly like it.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-06-29T18:17:28Z","Content":"\n\u003Cp\u003EI really don\u0027t like the idea of the Kerbol system being basically a copy of our own. It\u0027s great to be able to make it what you love. For example, in real life, I honestly don\u0027t think we have discovered any green gas giants like Jool. Or a purple world littered with Iodine and melted Gallium. \u003C/p\u003E\u003Cp\u003EAlso, for those wishing for a hell-like world, where the atmosphere is extremely hot and landing would be very complicated, one is planned to be orbiting Kerbol in the future. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Redwork Studios-Redwork1","CreatedById":58938,"CreatedDateTime":"2013-06-29T18:19:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moon Goddess\u0022 data-cite=\u0022Moon Goddess\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E-snip-\u003C/p\u003E\u003Cp\u003EPurple and Yellow are contrasting colors, so artistically a purple planet with Yellow glowing flows of lava would look really nice.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlaying around with that in photoshop, and it looks REALLY cool. It would be interesting if the yellow clouds were denser, and they could assist or totally screw up aerobraking and shred your parachutes. It would also make your ascent stage MUCH less efficient when passing through them, and over heat engines faster. THAT would be cool.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2013-06-29T19:04:14Z","Content":"\n\u003Cp\u003ENever been a fan of Eve. Needs thick clouds of fog, and the purple kind of makes it look like a big eyesore.\u003C/p\u003E\n"},{"CreatedByName":"DJEN","CreatedById":61378,"CreatedDateTime":"2013-06-30T12:23:31Z","Content":"\n\u003Cp\u003EI\u0027m fine with eve being purple, you know.\u003C/p\u003E\u003Cp\u003EAlso, because of the propellium in the oceans, I think it\u0027s supposed to be a carbon planet.\u003C/p\u003E\u003Cp\u003EYou know, a planet made out of carbon instead of silicates.\u003C/p\u003E\u003Cp\u003EAlso, waiting for the clouds.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-06-30T13:23:41Z","Content":"\n\u003Cp\u003EI think it\u0027s a bit to early to complain about analogs being inacrate. most of what makes venus venus is atmospheric effects and vlocanism. 2 planned but currently unadded features.\u003C/p\u003E\u003Cp\u003Ealso:\u003C/p\u003E\u003Cp\u003Ered, orange, yellow, green, indigo, violet\u003C/p\u003E\u003Cp\u003Ecolors of the spectrum and how temperture relates to them, red coolest, violet hotest.\u003C/p\u003E\u003Cp\u003Enote: the exact colors may be a bit out of order.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-30T13:29:16Z\u0022 title=\u002206/30/2013 01:29  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 30, 2013\u003C/time\u003E by leax256\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"alaskafish","CreatedById":57562,"CreatedDateTime":"2013-06-30T14:08:30Z","Content":"\n\u003Cp\u003EWhy not just make it so when in orbit it is really foggy that you cant see the surface, and when on the surface you can\u0027t see the space.... That well\u003C/p\u003E\n"},{"CreatedByName":"EmissionGeneration","CreatedById":71859,"CreatedDateTime":"2013-06-30T15:55:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alaskafish\u0022 data-cite=\u0022alaskafish\u0022\u003E\u003Cdiv\u003EWhy not just make it so when in orbit it is really foggy that you cant see the surface, and when on the surface you can\u0027t see the space.... That well\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EClouds and weather are on their to do list.\u003C/p\u003E\n"},{"CreatedByName":"Panichio","CreatedById":2858,"CreatedDateTime":"2013-06-30T21:20:48Z","Content":"\n\u003Cp\u003EWell, Venus is the god of love and beauty, and so the colour purple was chosen to represent that. The colour is generally considered beautiful. It\u0027s enough of a similarity for me, really. The orbits of both are also comparable.\u003C/p\u003E\n"},{"CreatedByName":"Tom K.","CreatedById":52797,"CreatedDateTime":"2013-06-30T22:11:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MBobrik\u0022 data-cite=\u0022MBobrik\u0022\u003E\u003Cdiv\u003EThe real venus in visible spectrum is just a near-featureless white-gray orb from above. Then just milky fog of the H2SO4 clouds, and on the bottom, perpetual reddish hazy twilight that limits the visibility to a few km. you would have to land very near a volcanic vent to actually see anything.\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EEDIT: and venus volcanoes look rather dull too. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Volcanology_of_Venus\u0022 rel=\u0022external nofollow\u0022\u003EJust large and flat shield volcanoes calmly pouring out lava.\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGuys, there isn\u0027t any wether ingame yet, in the future Eve will also be a thick foggy planet with thunderstorms and hurricaine winds in the uppder atmosphere!\u003C/p\u003E\u003Cp\u003ENove said that litterally.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-06-30T22:19:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Panichio\u0022 data-cite=\u0022Panichio\u0022\u003E\u003Cdiv\u003EWell, Venus is the god of love and beauty,\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eunderstatment of the year.\u003C/p\u003E\n"},{"CreatedByName":"TKO","CreatedById":20719,"CreatedDateTime":"2013-06-30T22:51:42Z","Content":"\n\u003Cp\u003EThough I appreciate that Eve could look more like Venus, I really like the art-style that\u0027s been used for Eve to have a rich purple colour, Jool a beautiful saturated green, and Vall a cyan/blue ice-moon. For us human players, already familiar with the planets around Sol, exploration of the Kerbals\u0027 solar-system is more exciting with these, frankly, more exotic looking planets. I like that they\u0027re using a richer colour-palette than could probably be expected to naturally occur. And, while it\u0027s nice that our solar-system has been the inspiration, I would like the Kerbal system to remain more Kerbal-y. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, the exact conditions of a place like Venus should be toned-down for game-play purposes. I don\u0027t see why one of the closest planets should be one of the hardest to set foot on. If we\u0027re going to have a planet as punishing as Venus to land on, put it far away so it\u0027s only challenging the more advanced players anyway. Rather than trying for absolute realism, I always got the impression Squad was more trying to find a balance between real and fun. I think they\u0027re on the right track.\u003C/p\u003E\n"}]}