{"TopicId":36189,"ForumId":32,"TopicTitle":"How did Kerbals evolve?","CreatedByName":"Mantis Toboggan","CreatedById":61379,"CreatedDateTime":"2013-07-07T06:15:13Z","PageNum":1,"Articles":[{"CreatedByName":"Mantis Toboggan","CreatedById":61379,"CreatedDateTime":"2013-07-07T06:15:13Z","Content":"\n\u003Cp\u003EAs we all know, Kerbals have lower than human intelligence, slow movement, and everything can kill them. My personal belief is that every time that a Kerbal was going to be killed by a predator or other natural factor is that a tree would fall on the predator, or some random occurrence. This seems like the only explanation, or that the giant space krakens save them.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-07T06:16:04Z","Content":"\n\u003Cp\u003ESlugs. They have obviously evolved from slugs. The eyestalks are vestigial.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-07T06:32:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mantis Toboggan\u0022 data-cite=\u0022Mantis Toboggan\u0022\u003E\u003Cdiv\u003EMy personal belief is that every time that a Kerbal was going to be killed by a predator or other natural factor is that a tree would fall on the predator, or some random occurrence.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would make them extraordinarily \u0022lucky\u0022, which is obviously not the case because their lives are now in human hands,\u003C/p\u003E\u003Cp\u003EI would say that they have no real natural competition on Kerbin and that their evolution took an extraordinarily long time (in Earth. terms).\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-07-07T06:38:13Z","Content":"\n\u003Cp\u003EFrom grass, to grass.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2013-07-07T06:49:16Z","Content":"\n\u003Cp\u003EObviously an advanced alien race showed up and manipulated their dna, then taught them the basics of society and rocketry...then they took off for libations and cigarettes and never came back.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-07T09:56:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003ESlugs. They have obviously evolved from slugs. The eyestalks are vestigial.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, they evolved from space frogs. And what\u0027s that about Kerbals being less intelligent than humans? Try to fly into orbit using parts found on the side of the road - i dare ya. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-07T10:23:21Z","Content":"\n\u003Cp\u003EKerbals were originally the domesticated pets of an advanced alien race that had the power to create cute, diminutive solar systems. These aliens used the kerbals to do simple chores like housecleaning, yard work, and terraforming. Unfortunately for the aliens, these kerbals developed increased intelligence and a love for explosives, and they eventually overthrew their masters, as chronicled in the movies \u003Cem\u003ERise of the Planet of the Kerbals\u003C/em\u003E and \u003Cem\u003EDawn of the Planet of the Kerbals\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-07-07T10:53:08Z","Content":"\n\u003Cp\u003EHow do we know Kerbals have lower then human intelligence..?\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-07-07T10:55:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EHow do we know Kerbals have lower then human intelligence..?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey have a very low sense of self preservation. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-07-07T13:12:10Z","Content":"\n\u003Cp\u003EJust like ants. And ants are incredibly succesful genera. Well, Kerbals are not ants obviously, but they seem to propagate by natural cloning process. More than that - some offsprings seem to be perfect copies of their parents. Both physical and psychical. It\u0027s like a perpetual reincarnation. Individual knowing he\u0027ll live again in near future, literally as one of his descendants, can afford to take risks unthinkable to us. And before you pelt me with snack wrappers - yes, there are species on Earth capable of similiar things. Some jellyfish can seemingly reverse their biological processes alternating between adult and juvenile forms. In effect they can live indefinitely in right conditions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-07T13:13:12Z\u0022 title=\u002207/07/2013 01:13  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 7, 2013\u003C/time\u003E by Scotius\u003C/strong\u003E\n\u003Cbr\u003ECorrecting the typos\n\u003C/span\u003E\n"},{"CreatedByName":"Torham234","CreatedById":58574,"CreatedDateTime":"2013-07-07T13:51:33Z","Content":"\n\u003Cp\u003EKerbals actually used to be very intelligent species. \u003C/p\u003E\u003Cp\u003EA few hundred years ago, there was a global nuclear war on Kerbin, that annihilated most of the flora and all of the fauna on the planet. The only Kerbals that survived were the ones in great underground vault. Now, after hundreds of years, they have finally opened the vault. Since the surface radiation is still too high, they are trying to move off the planet and colonize some other planets in the solar system. Unfortunately, All the years underground and all that background radiation had a rather negative effect on their mental faculties.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-07-07T16:57:27Z","Content":"\n\u003Cp\u003EKerbals are in fact an advanced race from a different solar system when an exploration mission went wrong and the crash landed on what they later named Kerbin. All of their communication equipment was destroyed, and without the nessecary resources to build the hyper-luminal relay they couldn\u0027t call for help. \u003C/p\u003E\u003Cp\u003EWhat we are witnessing is the futile attempts of a handful of survivors to try and make it back home with what little equipment they could salvage from the crashsite.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-07-07T17:18:51Z","Content":"\n\u003Cp\u003ELooks like I have a topic for the next Hitchhiker\u0027s Guide to the Species post now...\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-07-07T18:04:06Z","Content":"\n\u003Cp\u003EKerbals are the biological robots created by a race of hyper-intelligent, pan-dimensional beings to run inside their vast supercomputer to compute the question to the ultimate answer of 42, otherwise known as the Kerbol system. This explains why there are no other forms of animal life on Kerbin, only grass and trees. The Monoliths are actually Kerbal generators, spawning new Kerbals as needed. The prototype Monolith was on Mun, and it made the 1st Kerbals out of Mundust. As new Monoliths were installed elsewhere in the system, they copied the original design. This is why all Kerbals explode in a puff of Mundust when they die. Their green exterior is just slime from the inside of the clone tanks they\u0027re grown in.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-07T19:10:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003ENope, they evolved from space frogs. And what\u0027s that about Kerbals being less intelligent than humans? Try to fly into orbit using parts found on the side of the road - i dare ya. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, no, no. I\u0027m certain it\u0027s slugs. Its very noticeable in retrospect. You never noticed that all Kerbal snacks have NO salt?\u003C/p\u003E\n"},{"CreatedByName":"MrTaxman","CreatedById":70450,"CreatedDateTime":"2013-07-07T19:25:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EThey have a very low sense of self preservation. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat totally means that much of the human race has lower than human intelligence \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xarian","CreatedById":69145,"CreatedDateTime":"2013-07-07T19:30:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003ENo, no, no. I\u0027m certain it\u0027s slugs. Its very noticeable in retrospect. You never noticed that all Kerbal snacks have NO salt?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you\u0027re on to something. This also support my theory that Kerbals are evolved from tennis balls.\u003C/p\u003E\u003Cp\u003EWhy? Have YOU ever seen a tennis racket on Kerbin?\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-07T19:40:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xarian\u0022 data-cite=\u0022Xarian\u0022\u003E\u003Cdiv\u003EI think you\u0027re on to something. This also support my theory that Kerbals are evolved from tennis balls.\u003Cp\u003EWhy? Have YOU ever seen a tennis racket on Kerbin?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, actually. With that one X-wing style Kerban compartment, the one with the sticky note about all the snacks having been eaten? It\u0027s in the top right cupboard, under the felt lined dinnerware case for pick-nic-ing.\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-07-07T20:15:27Z","Content":"\n\u003Cp\u003EGeez, haven\u0027t any of you guys heard of a Monolith?\u003C/p\u003E\n"},{"CreatedByName":"Sir Nahme","CreatedById":57378,"CreatedDateTime":"2013-07-07T20:17:47Z","Content":"\n\u003Cp\u003EI\u0027m inclined to believe they evolved from some form of sauropod. Probably the Kerbosaurus Wrecks.\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-07-07T20:34:42Z","Content":"\n\u003Cp\u003EHow do we know they evolved and weren\u0027t created by god(s)?\u003C/p\u003E\n"},{"CreatedByName":"Sir Nahme","CreatedById":57378,"CreatedDateTime":"2013-07-07T20:42:43Z","Content":"\n\u003Cp\u003EWhat! Thats crazy! Theres no way there was any Intelligent Design involved! Such blasphemes! Next you\u0027ll be trying to convince us that the kerbalverse wasn\u0027t created in a giant explosion as ever Jeb fearing Kerman already knows and believes\u003C/p\u003E\n"},{"CreatedByName":"Dombi","CreatedById":63283,"CreatedDateTime":"2013-07-07T20:51:52Z","Content":"\n\u003Cp\u003EI read somewhere that they evolved from monkeys. How crazy is that theory?\u003C/p\u003E\n"},{"CreatedByName":"Parkaboy","CreatedById":64208,"CreatedDateTime":"2013-07-07T21:26:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mantis Toboggan\u0022 data-cite=\u0022Mantis Toboggan\u0022\u003E\u003Cdiv\u003EAs we all know, Kerbals have lower than human intelligence, slow movement, and everything can kill them. My personal belief is that every time that a Kerbal was going to be killed by a predator or other natural factor is that a tree would fall on the predator, or some random occurrence. This seems like the only explanation, or that the giant space krakens save them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure their coloration is the evolutionary advantage that allowed them to survive. Most predators dislike eating anything green.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2013-07-08T03:27:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sir Nahme\u0022 data-cite=\u0022Sir Nahme\u0022\u003E\u003Cdiv\u003ENext you\u0027ll be trying to convince us that the kerbalverse wasn\u0027t created in a giant explosion as ever Jeb fearing Kerman already knows and believes\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait a minute, I think you\u0027ve solved how the big bang started in our own universe, at some point, in a galaxt far far away, a long long time ago, Kerbals existed..and chief amongst them was the mighty Jebadiah.\u003C/p\u003E\u003Cp\u003EFrom the start of his life he was obsessed with rockets and space, eventually after millions of cycles of death and rebirth, he managed to build a rocket large enough, and powerful enough that when he lit the mighty boosters it caused a massive explosion, so large, it created our own universe....We are all made of Jeb and the remains of that omnipotent rocket.\u003C/p\u003E\n"}]}