{"TopicId":36833,"ForumId":32,"TopicTitle":"Grand tour from Eeloo... To Duna or Dres next?","CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-07-12T18:10:06Z","PageNum":1,"Articles":[{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-07-12T18:10:06Z","Content":"\n\u003Cp\u003ENow that they\u0027ve landed on every Joolian moon and arrived at Laythe, my ambitious crew has decided to do the full grand tour, wait out the three year transfer window to Eeloo, and from there planet hop down to Moho, being reapplied en route. So for the next step, what\u0027s the most efficient route? Dres is closest of course, but that makes for an ugly plane change and a lot of delta v to capture into orbit. Duna is farther but has an atmosphere for aerocapture, plus a potential boost from Ike departing, but then it\u0027s backtracking to Dres. \u003C/p\u003E\u003Cp\u003EInput?\u003C/p\u003E\n"},{"CreatedByName":"joppiesaus","CreatedById":57698,"CreatedDateTime":"2013-07-12T18:36:09Z","Content":"\n\u003Cp\u003EOk, sounds all awsome.... Who are \u0022they\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2013-07-12T19:06:49Z","Content":"\n\u003Cp\u003EPlane change is easy from eeloo orbit, id go for dres first.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-07-12T19:22:59Z","Content":"\n\u003Cp\u003EDres --\u0026gt; Duna should cost less dV as well. I\u0027d aim for Dres.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-12T19:46:41Z","Content":"\n\u003Cp\u003EI like the idea of a grand tour. I\u0027ve been rather focused on Jool and Laythe recently, with a lot of Extraplanetary Landing Pads and Kethane. Maybe a Grand tour would be a nice challenge?\u003C/p\u003E\u003Cp\u003EAre you planning on doing it nearly or completely stock or going all modded? I\u0027d probably do it with a few. Kethane would make a heck of a difference to it, having to carry a lot of probes (or maybe a few re-useable probes) to scan, then mining landers as well as others... plus one or two special heavy landers for Eve. Otherwise you\u0027ll need a very large quantity of fuel for this thing! Doable, but tricky.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-12T20:04:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003Ewait out the three year transfer window to Eeloo\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are decent 3.5-4 km/s transfer windows from Kerbin to Eeloo about every 100 days: \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-07-12T20:21:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EI like the idea of a grand tour. I\u0027ve been rather focused on Jool and Laythe recently, with a lot of Extraplanetary Landing Pads and Kethane. Maybe a Grand tour would be a nice challenge?\u003Cp\u003EAre you planning on doing it nearly or completely stock or going all modded? I\u0027d probably do it with a few. Kethane would make a heck of a difference to it, having to carry a lot of probes (or maybe a few re-useable probes) to scan, then mining landers as well as others... plus one or two special heavy landers for Eve. Otherwise you\u0027ll need a very large quantity of fuel for this thing! Doable, but tricky.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats how this flight started too, supposed to be just a Joolian moon tour. Now I\u0027m just killing \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ekerbals\u003C/span\u003E time till .21 comes out and finally kills wahoonie-shaped save for good and I can get \u0022serious\u0022 again. Don\u0027t have the patience for the whole kethane thing at the moment. The main ship, which the crew has rechristened the \u003Cem\u003ERighteous Indignation III \u003C/em\u003Ehas a delta-v budget around 13 kps fully fueled, so I figure from this point I\u0027ll just need to send a couple of tankers here \u0026amp; there. Everything after Dres will need specialized landers anyway so it\u0027s pretty straightforward to send some extra fuel along to be waiting at the target. \u003C/p\u003E\u003Cp\u003EYes, modded up the yin-yang. Hybrid ion engines and a bunch of Soviet pack parts mostly. Still figuring how exactly to do the Eve return. Thinking I might try an ion powered aircraft with a small rocket to kick the one Kerbal capsule back to orbit. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022joppiesaus\u0022 data-cite=\u0022joppiesaus\u0022\u003E\u003Cdiv\u003EOk, sounds all awsome.... Who are \u0022they\u0022?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBunch of fellows all named Kerman IIRC. My .20 saves have both gone so completely Kerbal I stopped keeping track of names weeks ago. AND this flight started with three, now there are six...? Little green buggers are actually breeding. Not sure if I want to bring those extra three along or not. Maybe I\u0027ll just leave them on Laythe \u0026amp; see what comes of it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-12T20:51:47Z\u0022 title=\u002207/12/2013 08:51  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 12, 2013\u003C/time\u003E by CatastrophicFailure\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-07-12T20:22:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EThere are decent 3.5-4 km/s transfer windows from Kerbin to Eeloo about every 100 days: \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, but the crew \u0026amp; ship is already at Laythe, so...\u003C/p\u003E\u003Cp\u003EThanx for the link tho, that\u0027ll be all sorts of useful for mulling over transfers away from home. Wow and it\u0027s telling me up to 5 years at Eeloo waiting for a Dres window. That\u0027s a long time throwing nitrogen-snowballs at each other!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-12T20:54:32Z\u0022 title=\u002207/12/2013 08:54  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 12, 2013\u003C/time\u003E by CatastrophicFailure\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-12T21:07:26Z","Content":"\n\u003Cp\u003EWait, Rightious Indignation? Did you by any chance watch Bucky O Hare a long time ago? I haven\u0027t seen that in a long time. Cheaply made and a bit cheesy but I rather liked it.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-07-12T21:24:29Z","Content":"\n\u003Cp\u003EYup that\u0027s where I got the name, tho I had to google it myself to remember what it was from. Remember absolutely nothing else about the show but the name\u0027s stuck with me all these years.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-12T21:28:22Z","Content":"\n\u003Cp\u003EI\u0027m embarrassed to say I can quote the words to the song by heart. Hence I remember the ship\u0027s name since it was in the song. God, how long ago was that?Twenty years? Twenty five?\u003C/p\u003E\u003Cp\u003ESong tunes I can usually remember ages later. Lyrics usually not. Ahem, I might have been a little hooked on it way back then. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Heck, I still hum a tune to some obscure BT advert from the 80s! I vaguely remember it had a stylized view of the ground, then panned upwards, showing all the things they did, all the way up to satellites.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-12T21:31:36Z\u0022 title=\u002207/12/2013 09:31  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 12, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-07-14T06:39:17Z","Content":"\n\u003Cp\u003E\u002791 according to the wiki. Since you mentioned it I had to go dig up the intro. You weren\u0027t kidding, any more cheese they could sell pizzas. Still can\u0027t remember a durn thing about the show its self tho, which is wierd cuz I know I used to watch it.\u003C/p\u003E\u003Cp\u003EHere, in all its highly reflective glory, is my \u003Cem\u003ERI3\u003C/em\u003E (the RI2 met with a bugged save file).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://x.co/1Lbg5\u0022 alt=\u00221Lbg5\u0022\u003E\u003C/p\u003E\u003Cp\u003EPlugging some numbers into that handy delta V calculator, it does indeed save around 800 mps taking the obvious route to Dres first.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-07-16T22:51:56Z","Content":"\n\u003Cp\u003EI\u0027ve seen those solar panels a lot recently. Which mod are they from?\u003C/p\u003E\u003Cp\u003ERough plot summary from show.\u003C/p\u003E\u003Cp\u003EGenius kid builds \u0027Photon accelerator\u0027 and accidentally teleports onto the Righteous Indignation, a ship defending an alliance of mammal aliens from a bunch of homicidal frogs (Yes, frogs!) who are bent on galactic domination with the help of some souped up planetary super computer... ie the computer is a planet (sort of).\u003C/p\u003E\u003Cp\u003EBasically aliens are animals from Earth given a slight twist. Mammals good guys. Reptilians bad guys.\u003C/p\u003E\u003Cp\u003EBucky O hare is a kind of Biggles analogue in space. Ace pilot and leads a crew on... missions and stuff. Yeah, I can\u0027t remember much about specific episodes either, just the kid joined his crew as engineer thanks to his genius IQ.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-16T22:57:21Z\u0022 title=\u002207/16/2013 10:57  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 16, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}