{"TopicId":38069,"ForumId":32,"TopicTitle":"What future feature (confirmed or otherwise) is your biggest hope for KSP?","CreatedByName":"Custard Donut (In Space)","CreatedById":58058,"CreatedDateTime":"2013-07-21T22:30:37Z","PageNum":6,"Articles":[{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-09-24T23:19:44Z","Content":"\n\u003Cp\u003EWithout a doubt, it\u0027s the resource system. Without it, we just can\u0027t play the game the way it\u0027ll be played in the full release; the Kethane mod is a good stopgap, but we can\u0027t finalize designs for refineries, landers, grand tour ships, etc. until we have the actual parts with better numbers.\u003C/p\u003E\u003Cp\u003ERight now, my own playing is on hold until the resources are implemented. After all, we\u0027re going to have to rebuild our little empires from scratch once that system is in place, so there\u0027s not a whole lot of point sending out Kethane-based mobile drilling rigs when it\u0027ll all get replaced soon enough.\u003C/p\u003E\n"},{"CreatedByName":"JimmyAgent007","CreatedById":74761,"CreatedDateTime":"2013-09-24T23:31:46Z","Content":"\n\u003Cp\u003EWhat about tourism? In the carrier mode we need money right? Well what if wealthy Kerbals paid big money to go to the Mun and such. Depending on what they want and what we show them we make more or less money. Bonus cash if they are the first Kerbal tourist to see it.\u003C/p\u003E\n"},{"CreatedByName":"Caesar15","CreatedById":11257,"CreatedDateTime":"2013-09-24T23:37:04Z","Content":"\n\u003Cp\u003ESimply a complete career mode, although mining asteroids and making colonies sounds cool also.\u003C/p\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2013-09-25T08:26:42Z","Content":"\n\u003Cp\u003EMore places to visit. More gas giants, more moons, asteroids... trans-Joolian objects. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I don\u0027t much care about resource extraction, careers, r\u0026amp;d, just want new places to visit, \u0027specially if they\u0027ve got cool scenery to check out. I seem to remember someone mentioning ice volcanoes a while back, would really like to see those.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-09-25T08:32:58Z","Content":"\n\u003Cp\u003EScience. Resources. Procedurally generated universe/galaxy/star cluster. Ideally Kerbol system could be only a cradle. Low difficulty area where we learn what to do, and how to do it. And then...infinity \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-09-25T08:40:54Z","Content":"\n\u003Cp\u003EIVA navigation between compartments within the same vessel.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-09-25T08:43:58Z","Content":"\n\u003Cp\u003EI would like:\u003C/p\u003E\u003Cp\u003EWages for staff. Get better r\u002Bd by paying for better scientists.\u003C/p\u003E\u003Cp\u003EIndications as to encounter windows.\u003C/p\u003E\u003Cp\u003EAuto time warp stop approaching maneuver nodes and soi\u0027s.\u003C/p\u003E\u003Cp\u003EFaster time warps.\u003C/p\u003E\u003Cp\u003EMore flexible build mechanics.\u003C/p\u003E\u003Cp\u003EEngineer redux.\u003C/p\u003E\u003Cp\u003EKerbaliser in game.\u003C/p\u003E\u003Cp\u003EAnother solar system.\u003C/p\u003E\u003Cp\u003EMore engines.\u003C/p\u003E\u003Cp\u003EMapSat.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-25T11:27:58Z\u0022 title=\u002209/25/2013 11:27  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 25, 2013\u003C/time\u003E by Monkeh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Masked Turk","CreatedById":76284,"CreatedDateTime":"2013-09-25T10:32:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Monkeh\u0022 data-cite=\u0022Monkeh\u0022\u003E\u003Cdiv\u003EI would like:\u003Cp\u003EWages for staff. Get better r\u002Bd by paying for better scientists.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn a similar note, perhaps your budget relies on you pleasing your financiers with notable achievements \u0026amp; progress?\u003C/p\u003E\n"},{"CreatedByName":"Dooz","CreatedById":74263,"CreatedDateTime":"2013-09-25T12:08:40Z","Content":"\n\u003Cp\u003EMoar Planets!!!!, and of course FPS improvements\u003C/p\u003E\n"},{"CreatedByName":"LFC908","CreatedById":82800,"CreatedDateTime":"2013-09-25T14:37:54Z","Content":"\n\u003Cp\u003E1. More parts\u003C/p\u003E\u003Cp\u003E2. New Solar systems\u003C/p\u003E\u003Cp\u003E3. Way way more detail to current system, planets and moons!\u003C/p\u003E\u003Cp\u003E4. 64 bit EXE\u003C/p\u003E\u003Cp\u003E5. Clouds on Kerbin\u003C/p\u003E\u003Cp\u003E6. Ability to launch/build crafts on other planets\u003C/p\u003E\u003Cp\u003E7. fix wobbling rockets\u003C/p\u003E\n"},{"CreatedByName":"JimmyAgent007","CreatedById":74761,"CreatedDateTime":"2013-09-25T20:17:22Z","Content":"\n\u003Cp\u003EId like to see parts organized according to use. Each category is separate but if i always use stuff on the second page then it just puts it at the top to make things faster.\u003C/p\u003E\n"},{"CreatedByName":"ZenithRising","CreatedById":77506,"CreatedDateTime":"2013-09-25T22:26:29Z","Content":"\n\u003Cp\u003EReally looking froward to the science parts. I really hope they are more than just \u0022You did X science at D distance! You get X*D science points Kerbal!!!\u0022 . I want instruments to give me measurements of a variety of aspects of different celestial bodies, and hopefully track that information in-game as well. For example, I would love it if certain physical aspects of planets (highest point for example) were I mystery in-game until you actually went and found out.\u003C/p\u003E\n"},{"CreatedByName":"Krupski","CreatedById":80925,"CreatedDateTime":"2013-09-26T00:05:14Z","Content":"\n\u003Cp\u003EDon\u0027t know if this has been posted before, but gimbaled engines (2 or more obviously) should be able to control ROLL as well as pitch and yaw.\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2013-09-26T01:19:14Z","Content":"\n\u003Cp\u003EBear in mind that not all forecasted features are set in stone. With KSP still being in Alpha it can easily take a whole different turn where some things won\u0027t happen. That being said, I am looking forward to more planets, moons, and features on Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Sternface","CreatedById":83299,"CreatedDateTime":"2013-09-26T03:40:15Z","Content":"\n\u003Cp\u003EUniversal health care for Kerbals.\u003C/p\u003E\u003Cp\u003EKerbal civil rights movement, and mandatory politically correct ratios in Kerbalnaught crew roster. Where are the tall Kerbals? The short ones? The blue ones? The lady ones? All I see is one demographic - stocky green males. In this day and age, this is unacceptable. \u003C/p\u003E\u003Cp\u003EAlso, add consolation prizes like \u0022most improved\u0022 so that every Kerbal is a winner, and nobody feels bad.\u003C/p\u003E\u003Cp\u003EI\u0027m completely joking, by the way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif\u0022 alt=\u0022:kiss:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m most excited for career mode, as I like having defined goals and limitations. It really adds to the immersion when I can\u0027t just stick four 50 ton boosters because I need a little more dV.\u003C/p\u003E\n"},{"CreatedByName":"Talonsin","CreatedById":76826,"CreatedDateTime":"2013-09-26T04:04:45Z","Content":"\n\u003Cp\u003EI would like a reason to go to the planets. Right now, once you land on a few and build a base and a space station, there is no reason to keep going. Resource mining, buildable habitats that need air and water to sustain the crew, science missions where you have to find a certain life form on the planet. Even better, have a planet or two where you could use genetic manipulation and guide a species to dominance like in spore.\u003C/p\u003E\n"},{"CreatedByName":"TheAstronut","CreatedById":77110,"CreatedDateTime":"2013-09-26T04:28:54Z","Content":"\n\u003Cp\u003EDiscoverable/randomly generated celestial bodys (like comets, asteroids, protoplanets etc.). Also a termination shock would be nice (you know the cloud of gas that forms at the border of the solar system where the pressure of the solar winds and the interstellar pressure are at equalibrium)\u003C/p\u003E\n"},{"CreatedByName":"Luis","CreatedById":55075,"CreatedDateTime":"2013-09-26T07:29:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheAstronut\u0022 data-cite=\u0022TheAstronut\u0022\u003E\u003Cdiv\u003EDiscoverable/randomly generated celestial bodys (like comets, asteroids, protoplanets etc.). Also a termination shock would be nice (you know the cloud of gas that forms at the border of the solar system where the pressure of the solar winds and the interstellar pressure are at equalibrium)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think the termination shock is a thing you can see. It\u0027s a change in the velocity of a very low density soup of solar wind particles. You could measure it with sensitive instruments but its not going to be visually dramatic.\u003C/p\u003E\n"},{"CreatedByName":"Krupski","CreatedById":80925,"CreatedDateTime":"2013-09-26T17:12:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheAstronut\u0022 data-cite=\u0022TheAstronut\u0022\u003E\u003Cdiv\u003EDiscoverable/randomly generated celestial bodys (like comets, asteroids, protoplanets etc.). Also a termination shock would be nice (you know the cloud of gas that forms at the border of the solar system where the pressure of the solar winds and the interstellar pressure are at equalibrium)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERandom generated celestial bodies make no sense since they would be there one time but not the next. And if they were generated each time the game was started and saved, the universe would clutter up with planets! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt would also be impossible for anyone else to fly a mission to the same planet that you did (because only you have it).\u003C/p\u003E\u003Cp\u003EHowever, a lot more \u0022permanent\u0022 bodies like comets and asteroids would be nice. I don\u0027t know what impact that would have on game speed (since the game would need to keep track of where they all were, do all the orbital calculations, etc..).\u003C/p\u003E\u003Cp\u003EAs it is, there\u0027s enough \u0022space junk\u0022 up there already. I once got into a 200km circular orbit using MechJeb, then left it there (forgot about it). Later I sent up another vehicle into the same orbit and while doing a rendezvous, all of a sudden my ship blew up! I said \u0022WTF???\u0022 then looked at the log. I collided with a decoupler from an old mission!!!\u003C/p\u003E\u003Cp\u003EI wish I had that one quicksaved... it would have been neat to see the ring of death coming......\u003C/p\u003E\u003Cp\u003EOn another note.... something that should be easy... stick on decals. For example, you could grab a national flag as a \u0022part\u0022 (with zero mass and drag), and stick it onto your booster.\u003C/p\u003E\u003Cp\u003EOther decorations too... Roman numerals (like on the quadrants of a Saturn S1-C), GSE umbilical ports (non functional, just for looks), maybe even a customizable decal (type in something like \u0022Danger Toxic Fumes\u0022 and add from a selection of clipart - maybe a skull and crossbones) and stick them near RCS quads.... or choose the text (vertical or horizontal and the color) and stick a nice vertical \u0022United States\u0022 in red on the side of a fuel tank (again, like a Saturn booster).\u003C/p\u003E\u003Cp\u003ELittle bits like that would not use up any more processing power (i.e. wouldn\u0027t slow down the game) and would go a long way toward making the vehicle look \u0022really neat\u0022.\u003C/p\u003E\n"},{"CreatedByName":"KrisM","CreatedById":78957,"CreatedDateTime":"2013-09-26T22:51:16Z","Content":"\n\u003Cp\u003EAn eventual expansion with another solar system to reach, with better drives to research to get there, etc. Not necessarily FTL, either.\u003C/p\u003E\u003Cp\u003EOooh, or a second sandbox option that randomly generates your solar system, and then you can visit other player\u0027s systems and explore their planets and bases \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E but that\u0027s a bit more of a pipe dream hehe.\u003C/p\u003E\n"},{"CreatedByName":"halocon720","CreatedById":34910,"CreatedDateTime":"2013-09-26T23:47:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rockhem\u0022 data-cite=\u0022Rockhem\u0022\u003E\u003Cdiv\u003EMultiplayer is the feature I want most.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that will not happen. We don\u0027t like to talk about KSP multiplayer. \u003C/p\u003E\u003Cp\u003EI\u0027d kinda like more planets, even though my piloting is terrible.\u003C/p\u003E\n"},{"CreatedByName":"fenderzilla","CreatedById":70047,"CreatedDateTime":"2013-09-28T02:48:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Monkeh\u0022 data-cite=\u0022Monkeh\u0022\u003E\u003Cdiv\u003EI would like:\u003Cp\u003EWages for staff. Get better r\u002Bd by paying for better scientists.\u003C/p\u003E\u003Cp\u003EIndications as to encounter windows.\u003C/p\u003E\u003Cp\u003EAuto time warp stop approaching maneuver nodes and soi\u0027s.\u003C/p\u003E\u003Cp\u003EFaster time warps.\u003C/p\u003E\u003Cp\u003EMore flexible build mechanics.\u003C/p\u003E\u003Cp\u003EEngineer redux.\u003C/p\u003E\u003Cp\u003EKerbaliser in game.\u003C/p\u003E\u003Cp\u003EAnother solar system.\u003C/p\u003E\u003Cp\u003EMore engines.\u003C/p\u003E\u003Cp\u003EMapSat.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would seriously barf rainbows if all these things ended up in the final game\u003C/p\u003E\u003Cp\u003Ethe devs are only human, i know, but we can pray...\u003C/p\u003E\n"},{"CreatedByName":"Sandworm","CreatedById":66244,"CreatedDateTime":"2013-09-28T18:59:17Z","Content":"\n\u003Cp\u003EFeature? My greatest hope for KSP is that the developers start releasing incremental patches. This bi-monthly, feature-loaded, patching will kill KSP. Just look at the number of great mods that are languishing because of mod apathy. New players are also being put off by the great many bugs that, while nothing game-breaking, are an annoyance when you do not expect them.\u003C/p\u003E\u003Cp\u003ESo... the feature I most want is whatever technology is necessary (ie torrents\u002Ba working patcher) for Squad to push smaller patches at more regular intervals.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2013-09-28T21:56:17Z","Content":"\n\u003Cp\u003EA way to see your spacecraft\u0027s delta-V, TWR, and mass in the VAB (without mods).\u003C/p\u003E\u003Cp\u003EMore non-easter-egg details on planets ... plus dynamic features like clouds on planets with atmosphere, volcanoes on Eve, frost in the morning on Duna, cryovolcanoes on Eeloo, etc.\u003C/p\u003E\u003Cp\u003EThe ability to explore Jool\u0027s atmosphere all the way down to the crushing-pressure level.\u003C/p\u003E\u003Cp\u003EResources.\u003C/p\u003E\n"},{"CreatedByName":"Awass","CreatedById":77431,"CreatedDateTime":"2013-09-28T22:13:10Z","Content":"\n\u003Cp\u003EI would love to have in a career mode little clips of news coverage of your launches, like actual footage of your launches, successes, and awesome explosions. It could even be a little grainy to give it that nice space race era feel.\u003C/p\u003E\n"}]}