{"TopicId":38804,"ForumId":32,"TopicTitle":"Undocking and Decoupling?","CreatedByName":"potoes6","CreatedById":75638,"CreatedDateTime":"2013-07-25T16:17:59Z","PageNum":1,"Articles":[{"CreatedByName":"potoes6","CreatedById":75638,"CreatedDateTime":"2013-07-25T16:17:59Z","Content":"\n\u003Cp\u003EWhen I am detaching a port from my space station I will notice that it will sometimes say Undock or Decouple. Is there a difference between the two? Also for undocking a ship which dock should you decouple/Undock, the stations or the ships?\u003C/p\u003E\u003Cp\u003EThanks For Reading\u003C/p\u003E\u003Cp\u003E-Potoes\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-07-25T16:40:42Z","Content":"\n\u003Cp\u003EI think the difference is that decoupling has an explosive force whereas undocking does not.\u003C/p\u003E\n"},{"CreatedByName":"strongest_2hu","CreatedById":67784,"CreatedDateTime":"2013-07-25T17:00:25Z","Content":"\n\u003Cp\u003EDecouple implies that the ports were connected in the VAB, while undock implies that they were docked in flight mode. It has the same functionality.\u003C/p\u003E\u003Cp\u003EAs for which port to use, typically the game will only put the undock option on one port (the other one will only show \u0022control from here\u0022) so you don\u0027t really have to choose.\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-07-25T17:08:42Z","Content":"\n\u003Cp\u003EI agree that this has been a bit of a \u0022??\u0022 point for me too. Would be nice if the game didn\u0027t bother with changing the label based simply on how the ports came to be connected. It would also be nice if both sides offered the undock option, because I\u0027ve not really seen a pattern as to which side will actually offer it.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-25T17:16:33Z","Content":"\n\u003Cp\u003EDecouple can be used to disconnect docking ports from other parts that aren\u0027t docking ports (assuming they were built together in the VAB) whereas undock is only available in docking port to docking port scenarios.\u003C/p\u003E\u003Cp\u003EExample: You launch a mission to a planet with a probe on top of your docking port, no stack separator or decoupler. You decouple it and it goes to one planet while you go and dock with a space station.\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-07-25T17:35:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EDecouple can be used to disconnect docking ports from other parts that aren\u0027t docking ports (assuming they were built together in the VAB) whereas undock is only available in docking port to docking port scenarios.\u003Cp\u003EExample: You launch a mission to a planet with a probe on top of your docking port, no stack separator or decoupler. You decouple it and it goes to one planet while you go and dock with a space station.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich would be fine, IF the only time \u0022decouple\u0022 showed up was in a case where only a single docking port was involved. As it stands, I think the original call-out (that docking ports show \u0022decouple\u0022 if they were assembled in the VAB) is dead-on, and that\u0027s where the confusion sets in.\u003C/p\u003E\u003Cp\u003EGranted this is a pretty small thing and not really worth any level of griping or suggestions to correct in the grand scheme of things, but it\u0027s still an annoyance that elicits some curiosity into why it\u0027s like that. Why would the game really need to show something different based on how a port\u0027s connection was made?\u003C/p\u003E\u003Cp\u003EI agree that it makes sense to \u0022decouple\u0022 if the port was assembled against a non-port component in the VAB, but as it stands, it looks like \u0022decouple\u0022 is shown for \u003Cem\u003Eany \u003C/em\u003Eport assembled in the VAB, regardless of what is actually attached to it.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-07-25T17:36:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt would also be nice if both sides offered the undock option, because I\u0027ve not really seen a pattern as to which side will actually offer it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B1\u003C/p\u003E\u003Cp\u003ENot having this actually breaks action groups.\u003C/p\u003E\u003Cp\u003EI have a very large construction rover that has symmetrically docked ports (aligned but not attached in the SPH, dock on physics kick in). \u003C/p\u003E\u003Cp\u003EI have an action group set to decouple and undock all ports (both just in case, because I still have no idea why there are two options to do the same thing, better safe than sorry). \u003C/p\u003E\u003Cp\u003EWhen I take the rover out for a spin several of the ports show that they can be decoupled via right click, but the action group does nothing. I believe this might be because the ports are symmetrically assigned to the action group, but asymmetrical in their docking. For instance, on one side the \u0022outer\u0022 of the two connected ports has the ability to undock, but on the other side the inner port provides that option, so the command cannot be symetrically executed, so it does nothing instead. Really annoying.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-25T17:38:52Z\u0022 title=\u002207/25/2013 05:38  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 25, 2013\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-07-25T17:43:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003E\u002B1\u003Cp\u003ENot having this actually breaks action groups.\u003C/p\u003E\u003Cp\u003EI have a very large construction rover that has symmetrically docked ports (aligned but not attached in the SPH, dock on physics kick in). \u003C/p\u003E\u003Cp\u003EI have an action group set to decouple and undock all ports (both just in case, because I still have no idea why there are two options to do the same thing, better safe than sorry). \u003C/p\u003E\u003Cp\u003EWhen I take the rover out for a spin several of the ports show that they can be decoupled via right click, but the action group does nothing. I believe this might be because the ports are symmetrically assigned to the action group, but asymmetrical in their docking. For instance, on one side the \u0022outer\u0022 of the two connected ports has the ability to undock, but on the other side the inner port provides that option, so the command cannot be symetrically executed, so it does nothing instead. Really annoying.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne behavior I\u0027ve seen is that you need to assign your action groups \u003Cem\u003Eafter \u003C/em\u003Eassembly is completed. If you assign a group to a pair of components, then move the components and re-place them with symmetry, only the part you actually placed again will maintain its assignments. The other ones placed via symmetry will lose their assignments in the process.\u003C/p\u003E\u003Cp\u003EIf you create an action group on parts that were placed via symmetry, then move the part, you will need to go back into the group, remove ALL references to all parts and re-assign them again from-scratch, because I have run into many cases where the assignments are still technically there in the group, but they\u0027re no longer associated with the symmetry-related parts anyway.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-07-25T17:55:10Z","Content":"\n\u003Cp\u003EYep, I already recreated all of the action groups (SEVERAL times, because aligning disconnected ports in the VAB is hard enough without having to do symmertical ones indvidually... GAH). No dice. I lauched again and saw that the ports are not actually docking symetrically when physics kicks in. On one side the outer port shows the menu, on the other side the inner port shows the menu. They therefore cannot be symetrically undocked, and since the action group itself IS symmetrical, I believe this creates the problem.\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-07-25T18:09:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EYep, I already recreated all of the action groups (SEVERAL times, because aligning disconnected ports in the VAB is hard enough without having to do symmertical ones indvidually... GAH). No dice. I lauched again and saw that the ports are not actually docking symetrically when physics kicks in. On one side the outer port shows the menu, on the other side the inner port shows the menu. They therefore cannot be symetrically undocked, and since the action group itself IS symmetrical, I believe this creates the problem.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, I see what you\u0027re getting at, and yeah I\u0027ve seen the same problem. Annoying as heck!\u003C/p\u003E\u003Cp\u003ETo add to the confusion factor, I can never seem to predict which vessel will get the focus when undocking them. I wonder at the logic that governs the decision. There are times when it\u0027s critical to know which will get the focus, because fast action will need to be taken on a vessel that\u0027s undocking in close quarters (like within a dock for example).\u003C/p\u003E\n"},{"CreatedByName":"tbemrose","CreatedById":130076,"CreatedDateTime":"2014-11-25T00:05:56Z","Content":"\n\u003Cp\u003EI\u0027ve noticed that decouple is NOT just when the connection is made in the VAB. I built a station where I had 4 ports in a square facing the same direction; I had another assembly with another 4 ports in a square of the same size. I maneuvered the assembly to the station and \u0022docked\u0022 it. It seems that every time I do, one of the port pairs has the \u0022undock\u0022 option while the other 3 have a \u0022uncouple\u0022 option. Thinking about how each structure/vehicle is a tree in the data file, it seems to me that the first port that connects acts as the root for the branch you\u0027re snapping on to the tree. The other ports that dock secondarily forms a link between two branches in the tree, and get the uncouple option. (I hope that makes sense.)\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-11-25T01:14:05Z","Content":"\n\u003Cp\u003EHi tbemrose,\u003C/p\u003E\u003Cp\u003EThis thread is nearly a year and a half old. Good info is always appreciated, but I think the OP has either sorted out their question or moved on by now. So I\u0027ll be locking this for now.\u003C/p\u003E\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"}]}