{"TopicId":39879,"ForumId":32,"TopicTitle":"B9\u0027s docking port doesnt line up with the nav ball?","CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-07-29T15:08:33Z","PageNum":1,"Articles":[{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-07-29T15:08:33Z","Content":"\n\u003Cp\u003Ejust download B9 aerospace pack and when i tried to dock the stock plane with my station...but the nav ball pink mark was so misplaced making it impossible to dock with the navball and forced me to eyeball the two docking port (and using docking cam as well)\u003C/p\u003E\u003Cp\u003Eis it just me running in this problem?\u003C/p\u003E\u003Cp\u003Eor is it B9\u0027s inline port has this issue innately?\u003C/p\u003E\u003Cp\u003E(well...i controlled from the station because the plane\u0027s battery was dead)\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003E(yes of cos i clicked control from here and targeted the port; i aint newbie who just downloaded the game...registered April 2012if you look a little left...)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T15:12:13Z\u0022 title=\u002207/29/2013 03:12  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by lammatt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2013-07-29T15:18:46Z","Content":"\n\u003Cp\u003EI can\u0027t say that I\u0027ve had a problem because I haven\u0027t used B9 with .21 yet, however you would likely find better support if you posted this in the add-ons section of the forums.\u003C/p\u003E\n"},{"CreatedByName":"vidboi","CreatedById":60555,"CreatedDateTime":"2013-07-29T18:18:11Z","Content":"\n\u003Cp\u003EIt\u0027s a problem with KSP, not the B9 pack. The navball points in the direction of the part you\u0027re controlling from, but looking from the centre of the craft, not the part. An offcentre docking port will as a result not line up correctly when trying to dock using the navball - you\u0027ve got to do it by eye\u003C/p\u003E\n"}]}