{"TopicId":39967,"ForumId":32,"TopicTitle":"Yet another Mechjeb thread (but this time different)","CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2013-07-30T00:05:44Z","PageNum":1,"Articles":[{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2013-07-30T00:05:44Z","Content":"\n\u003Cp\u003EI\u0027m one of the long term Kerbal players. Back in the heady early days I would download any mod that came out. I remember the Sunday Punch pack and Nova\u0027s early efforts. Man, they were fun.\u003C/p\u003E\u003Cp\u003EWell, that was then and this is now. I don\u0027t think I\u0027ve downloaded any serious mods since version 0.10! And it\u0027s been fine, really, because I haven\u0027t needed the extra parts (there\u0027s plenty now); and the patched conics have made piloting relatively simple.\u003C/p\u003E\u003Cp\u003EHOWEVER:\u003C/p\u003E\u003Cp\u003EAs a player who has landed on the Mun a few times, and even managed Minimus once, I\u0027m now seriously considering installing MechJeb. I\u0027ve never used it before, and don\u0027t really know what it does (except I have a vague idea of it being an autopilot, which might very well be an understatement). \u003C/p\u003E\u003Cp\u003EI have 0.21.1 installed on my [very elderly] computer. \u003C/p\u003E\u003Cp\u003ESo . . convince me. Fans of MechJeb, this is your chance. Tell me why I should put it on, what it does, its cool features.\u003C/p\u003E\u003Cp\u003EAlso, detractors of MechJeb, tell me what YOU think too.\u003C/p\u003E\u003Cp\u003ETwo restrictions:\u003C/p\u003E\u003Cp\u003E1) If your objection to MechJeb is any variation on \u0022It\u0027s cheating\u0022, then don\u0027t bother posting. I have heard that one, and I understand that some people think that. Message received. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E2) Be nice to everyone who responds. Even if you think they\u0027re an idiot, give them the benefit of the doubt.\u003C/p\u003E\u003Cp\u003EGo.\u003C/p\u003E\n"},{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2013-07-30T00:19:25Z","Content":"\n\u003Cp\u003EFor why not to get Mechjeb: Whenever you pull off something for the first time, the feeling of accomplishment will likely be very much diminished once you realise that MechJeb did it, not you.\u003C/p\u003E\u003Cp\u003EIf you want the information readouts that it has, I recommend getting \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-kerbal-engineer-redux-v0-5/\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Engineer\u003C/a\u003E. It\u0027s not been updating to 0.21 so the rendezvous information breaks the window, but everything else works fine.\u003C/p\u003E\n"},{"CreatedByName":"msyblade","CreatedById":69250,"CreatedDateTime":"2013-07-30T00:33:20Z","Content":"\n\u003Cp\u003EPro\u0027s\u003C/p\u003E\u003Cp\u003E1: It can control perfect ascents, circularizations, rendevous, and landings for you.(with an occasional WTF hiccup.)\u003C/p\u003E\u003Cp\u003E2: It does these things using an order of operations to maximize effeciency, which can help newer players learn.\u003C/p\u003E\u003Cp\u003E3: Smart ASS. A translation tool that allows you to translate in perfect increments relative to nearly any object/body. \u003C/p\u003E\u003Cp\u003E4: It provides all pertinent information to any voyage. TWR, DeltaV breakdown by stages, intercept angles, inclinations, etc.\u003C/p\u003E\u003Cp\u003ECon\u0027s\u003C/p\u003E\u003Cp\u003E1: For some (me) it is hard to keep your hand out of the cookie jar. MJ is capable of completely removing the flight experience. The only downside IMO.\u003C/p\u003E\u003Cp\u003E I don\u0027t know any reason NOT to try anything. Check it out, it\u0027s actually a bit of a learning curve for the first hour or so (Just discerning what the language refers to), but it all makes sense.\u003C/p\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-07-30T00:41:17Z","Content":"\n\u003Cp\u003EHow about all these MechJeb threads move to General Add-on Affairs.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-30T00:48:23Z","Content":"\n\u003Cp\u003EMechJeb is modular so you can disable or enable whatever you want. I don\u0027t use it, and probably never will because I enjoy the stock way of flying my rockets and there are other mods that provide the information I want, but many users find MechJeb to be useful in one way or the other so you may as well give it a try if you\u0027re seriously thinking about it.\u003C/p\u003E\n"},{"CreatedByName":"acealeam","CreatedById":61964,"CreatedDateTime":"2013-07-30T00:51:56Z","Content":"\n\u003Cp\u003EI\u0027m not a huge fan on the autopilot, and I\u0027ve used it my fair amount. But the statistics are great. There\u0027s no reason not to have it.\u003C/p\u003E\u003Cp\u003EDon\u0027t like a certain part, dont use it. But I\u0027ve never heard anyone say that having a predicted aerobraking node is bad.\u003C/p\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-07-30T00:56:13Z","Content":"\n\u003Cp\u003EThe maneuver planner and editor are very helpful tools, and even if you don\u0027t really like the autopilot form of it. Smart A.S.S. is also useful, along with the aerobraking and landing calculator. For general orbital info, MechJeb does have more statistics, but I would say the Kerbal Engineer Redux is better.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-07-30T00:59:37Z","Content":"\n\u003Cp\u003EThe only downside to MechJeb that I see is the fact that it\u0027s a bit of a CPU hog -- particularly if you have the deltaV stats up.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-30T01:00:05Z","Content":"\n\u003Cp\u003EIf doing something in KSP ever gets dull (but you still HAVE to do it to accomplish some larger mission...like the 20th time you launched a refueling tanker), then MechJeb is your friend.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-07-30T01:01:38Z","Content":"\n\u003Cp\u003EIt saves time, and lets you be more scientific with your design process. If you\u0027re fine-tuning the efficiency of a design, using the ascent autopilot to get it into orbit with the same set of parameters gives you a repeatable way to know for sure that the difference in fuel use was due to a design change, not variability in piloting. And \u0022follow the yellow circle\u0022 is not terribly entertaining, at least not for me. Downsides? It has its quirks and occasional misbehavior, but after you get used to what those are and what can cause them, the only other is the degree of complaints and interminable debate it generates.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2013-07-30T01:03:31Z","Content":"\n\u003Cp\u003EAs someone who has only been to the Mun and Minmus, you haven\u0027t experienced much of the game. You really should experience the challenge of getting to another planet yourself before you even consider letting Mechjeb do it for you.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-30T01:04:50Z","Content":"\n\u003Cp\u003EDownside: I had MechJeb do a rendezvous the other day for the first time... and I nearly laughed myself silly at how wasteful of fuel it was.\u003C/p\u003E\n"},{"CreatedByName":"esinohio","CreatedById":57681,"CreatedDateTime":"2013-07-30T01:15:32Z","Content":"\n\u003Cp\u003EOne thing that makes MechJeb nice that other people might not mention is the custom window editor. Having the ability to make my own information windows is fairly handy. Others will point out that this information is available within Kerbal Engineer as well although I\u0027ll have to check if you can customize it somehow, I\u0027m really not sure but I know it is there. Both the mods are so well done so enjoy the selection \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOf course as the other posts point out all the autopilot features are nice but can take away from the achievement somewhat. Although seeing how it\u0027s done, sort of, then doing it on your own can be just as fulfilling in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2013-07-30T01:18:00Z","Content":"\n\u003Cp\u003EMerinsan:\u003C/p\u003E\u003Cp\u003EI get that, but up until now, whilst I have technically KNOWN how to do a transfer to (for example) Duna, I\u0027ve only really achieved that once, and that time I didn\u0027t have enough fuel to complete the landing. Hours of real time effort, and ultimately useless. If I could automate that, the game would become less of a chore and more of a joy.\u003C/p\u003E\u003Cp\u003E(Worth mentioning here that I\u0027m a lousy pilot in KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\u003Cp\u003ESo is the joy of arriving at another planet greater than the soul-ripping irritation at getting so close yet so far?\u003C/p\u003E\u003Cp\u003EBrotoro: You say that it\u0027s fuel inefficient. How inefficient - would, oh, a really terrible pilot be better? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-07-30T01:20:55Z","Content":"\n\u003Cp\u003Ethere was a great scott manely video I saw yesterday on this very subject. can\u0027t seem to find it. not even in my history...\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-30T01:28:51Z","Content":"\n\u003Cp\u003EI think msyblade summed it up fairly well. The only time I consistently beat MechJeb in efficiency is when docking. On the other hand, I\u0027ve picked up a number of efficiency tricks from mechjeb. MechJeb also tends to be more precise than I am, since it\u0027s got better and more precise throttle control. Sometimes, however, MechJeb can get anally precise, and spend more time than you care to trying to hit perfection.\u003C/p\u003E\u003Cp\u003EOn the other hand, you do need to understand what MJ is trying to do for those occasions where for whatever reason, MJ is doing it wrong.\u003C/p\u003E\u003Cp\u003EI\u0027m to the point that I mostly use SmartASS to either execute maneuvers I planned, or to just point certain directions and wing it. I\u0027ll let MJ land sometimes, and if the craft is too squirrelly I\u0027ll let MJ launch it.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-07-30T01:33:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johno\u0022 data-cite=\u0022Johno\u0022\u003E\u003Cdiv\u003EBrotoro: You say that it\u0027s fuel inefficient. How inefficient - would, oh, a really terrible pilot be better? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my case, the choice is between wasteful MechJeb and less-wasteful me. So the \u0022terrible pilot\u0022 option is not part of the equation. I don\u0027t calculate anyone else\u0027s equation or dictate their choice. Do what makes it more fun for you. \u003C/p\u003E\u003Cp\u003EI had a rule for myself that I would always land on a planet manually first before ever using MechJeb to do so...but that was \u003Cem\u003Emy\u003C/em\u003E way of having fun. There are times when I worry that my skills are getting eroded by \u0022occasionally\u0022 using MechJeb (just whenever it\u0027s handy to do something boring...\u0022I can quit anytime\u0022). But at every upgrade, before I install the mods, I play without MJ for a while just to be sure I can still do the stuff I claim is old hat (that I normally have MJ do for me). So I was very pleased that I was able to target and land my crew carrier manually at the KSC...and that was even with the unfriendly SAS in version 0.21.0. But we all get our little thrills in our own way.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LKnfza4.jpg\u0022 alt=\u0022LKnfza4.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"spikeyhat09","CreatedById":39217,"CreatedDateTime":"2013-07-30T01:34:42Z","Content":"\n\u003Cp\u003Eif you install mechjeb and use it to do stuff, dont post about your achievements on the forums because achievements that use mechjeb are invalid\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-07-30T01:40:51Z","Content":"\n\u003Cp\u003EDespite spikeyhat09\u0027s opinion, I use Mechjeb and enjoy the game immensely. That being said, right now Mechjeb is not working well. It hasn\u0027t had a full going over to work with .21.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-07-30T02:26:09Z","Content":"\n\u003Cp\u003ETo the OP:\u003C/p\u003E\u003Cp\u003EFirst off, understand that I came to KSP after many years (back to the 1980s in DOS) of playing Orbiter off and on. I also had a cousin who was the honcho in charge of training the shuttle astronauts and he gave me some backstage tours in Houston, including getting to sit in on a simulator exercise for the crew of like the 6th launch, so I know a little bit about what sorts of instrumentation real spaceships have (which is pretty much what you see in Orbiter). So when I got into KSP, my initial reaction was total shock at the utter lack of instrumentation and automation, which are essential components of real spacecraft and high-realism sims thereof.\u003C/p\u003E\u003Cp\u003EI have since learned it\u0027s quite possible to do everything in KSP without any of these real-world items, or their modded analogs in the form of MJ and the like. You can fly KSP rockets by guess and by God and get away with it. But to them as say MJ and the like are cheats, please be aware that you can only do without them in KSP because KSP is deliberately unrealistic in various ways specifically to allow you to fly rockets with no more instrumentation than the Wright Brothers.\u003C/p\u003E\u003Cp\u003ESo the question I have is, what\u0027s more realistic? Taking a multi-billion dollar rocket to Jool just eyeballing everything and failing countless times (Revert Flight, F5/F9) or adding some instrumentation to do it right the 1st time? Come the day when career mode gets full implementation and we have to start paying for rocket parts and Kerbal funerals, failed launches and botched landings will have lasting consequences, and enough of them will probably make you restart the game from scratch because all your funding gets cut. I bet when that happens, those who scorn MJ now will sing a different tune \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003ESo, all that said, I have no shame at all in putting MJ on every vehicle I make. Even though I do almost all my own flying, I still find it very useful in giving me information I need to make proper decisions. Off the top of my head, here are my main reasons why I think everybody should have MJ (not one of which is an autopilot):\u003C/p\u003E\u003Cp\u003E1. It helps while building ships to let you know you\u0027ve got the right amount of delta-V. Not having MJ, Kerbal Engineer, or some other such aid wastes a lot of time because you\u0027re then reduced to launching by trial-and-error.\u003C/p\u003E\u003Cp\u003E2. It allows you to type in directly the exact amount of delta-V you want for a given burn on each axis, which is WAY more precise than yanking maneuver node gizmos around. That way, if you personally go to the trouble to calculate the burn needed to transfer to some other planet, or use the web site for that, you can actually use these numbers.\u003C/p\u003E\u003Cp\u003E3. It allows you to tweak your ascent profile to get the most out of your current rocket design, projecting the target icon on the navball so you can manually fly this path.\u003C/p\u003E\u003Cp\u003E4. It has an RCS balancer feature, which throttles individual thrusters to keep you straight when translating. Thus, even if you\u0027re doing all your own docking, at least you don\u0027t have to fight unwanted rotation (of which there\u0027s always some).\u003C/p\u003E\u003Cp\u003E5. You can ask it for a second opinion. That is, you think you should do a burn this way, but you\u0027re not sure. So you can ask MJ how it would do that burn, without actually letting it do it, and compare the results.\u003C/p\u003E\u003Cp\u003EAll these things, IMHO, are functions that would be included in real rockets. Hell, most CARS today have roughly analogous things as standard equipment. None of them fly your rocket for you, all of them are extremely useful and make you a better pilot. In fact, for most aspects of flight, MJ has 2 options: giving you information and guidance, or autopilot.\u003C/p\u003E\u003Cp\u003EHOWEVER, something very important to note about the current incarnation (2.0.9) of MJ. Its autopilots DO NOT use the new SAS system in 0.21. This IMHO is a serious weakness because on the whole the new SAS system works better (as keeps things more under control and less wobbly) than MJ, but this is really only an issue in atmospheres. Out in space, MJ is just as stable as SAS.\u003C/p\u003E\u003Cp\u003EFor example, look at this rocket here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3Ak9POR.jpg\u0022 alt=\u00223Ak9POR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe top end is a very, very light Kethane-powered jet with a HUGE wing for its size, intended to fly in the thin air of Duna. I honestly did not expect a rocket launch to work for it, due to the center of lift being way up front because of that big wing. I figured I\u0027d have to devise a way to SSTO it off the runway, but because I suck at that, I figured I\u0027d at least try it as a rocket first. So, I got it on the pad, turned on SAS, and lit the fuse. Guess what? Under my manual control, the new 0.21 SAS held it rock solid, even with a couple of docking ports for joints, and it got to orbit no problem at all. It was just another conventional rocket launch. So just for a test, I let MJ\u0027s ascent autopilot give it a try, which as mentioned doesn\u0027t use SAS. And the thing somersaulted right off the pad, as I had expected to happen to me.\u003C/p\u003E\u003Cp\u003EI expect that MJ will soon get patched to use the wonderful new SAS and this difference will disappear. But that affects only the autopilots. If you don\u0027t want to use the autopilots, don\u0027t. But there are still lots of things that MJ is very useful for.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-30T02:33:47Z\u0022 title=\u002207/30/2013 02:33  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 30, 2013\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-07-30T02:35:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spikeyhat09\u0022 data-cite=\u0022spikeyhat09\u0022\u003E\u003Cdiv\u003Eif you install mechjeb and use it to do stuff, dont post about your achievements on the forums because achievements that use mechjeb are invalid\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the other hand, if you install MechJeb and use it to do stuff, feel free to post your achievements on the forums, because any opinion of your achievements that doesn\u0027t come from yourself is utterly meaningless, and certainly doesn\u0027t need to be validated by some self-appointed \u0022achievement validator\u0022 on the internet who you\u0027ll probably never meet.\u003C/p\u003E\u003Cp\u003EThat being said, The beauty of MechJeb is that you can use the pieces of it that you want. You can even exclude MJ from loading the pieces that you don\u0027t want, so you don\u0027t have to even look at them. Engineer is great, but it doesn\u0027t have Smart A.S.S.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-30T02:40:36Z\u0022 title=\u002207/30/2013 02:40  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 30, 2013\u003C/time\u003E by DChurchill\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Fog","CreatedById":72732,"CreatedDateTime":"2013-07-30T04:21:05Z","Content":"\n\u003Cp\u003EI wouldn\u0027t say using MJ is a cheat. I used it as a learning tool when I was new to KSP, because the arcane science of orbital maneuver isn\u0027t always \u0022google-able\u0022.\u003C/p\u003E\u003Cp\u003EBut soon I discovered MJ isn\u0027t always 100% reliable, let alone 100% efficient. So, even with auto-pilot on I kept watching and sometimes I had to frantically hit that \u0022Disengage auto-pilot\u0022 button.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure about others, but for me MJ tends to freak out if my CPU is under heavy loading.\u003C/p\u003E\u003Cp\u003ESince you\u0027re saying that you\u0027re going to test it on an \u0022elderly\u0022 computer, then I guess it won\u0027t behave well and the entertainment index should, well, sky-rocket.\u003C/p\u003E\u003Cp\u003EThe new plugin system makes it very easy to install / uninstall mods so I see no reason why not to try.\u003C/p\u003E\u003Cp\u003EAnd, here\u0027s my 2-cents about MJ:\u003C/p\u003E\u003Cp\u003EPros:\u003C/p\u003E\u003Cp\u003EP1. Reminds you to turn off RCS when you don\u0027t need it.\u003C/p\u003E\u003Cp\u003EP2. Launching a refuel craft the 20th time isn\u0027t fun.\u003C/p\u003E\u003Cp\u003EP3. Docking to a station under 5 frames per second isn\u0027t fun neither.\u003C/p\u003E\u003Cp\u003EP4. Seriously, manually executing a 10-minute burn isn\u0027t fun.\u003C/p\u003E\u003Cp\u003EP5. (Except landing de-orbit burns) MJ shows its actions and how they\u0027re done right in front of you. It\u0027s a great learning tool.\u003C/p\u003E\u003Cp\u003EP6. Repeatable results for design optimization.\u003C/p\u003E\u003Cp\u003EP7. It\u0027s like a Swiss army knife. Many tools inside and let you choose what you want to use.\u003C/p\u003E\u003Cp\u003EP8. Flying manually and beating MJ in fuel usage / time spent is very satisfying.\u003C/p\u003E\u003Cp\u003ECons:\u003C/p\u003E\u003Cp\u003EC1. Eats through your RCS storage if you forget P1.\u003C/p\u003E\u003Cp\u003EC2. Landing, although very precise, uses way too much fuel.\u003C/p\u003E\u003Cp\u003EC3. It actually causes wobbles due to over-compensation in almost every actions.\u003C/p\u003E\u003Cp\u003EC4. CPU-intensive. Esp if you let too many info window open.\u003C/p\u003E\u003Cp\u003EC5. No longer provides ascent performance results in version 2. So I can\u0027t judge how efficient my ascent profile is.\u003C/p\u003E\u003Cp\u003EC6. Spaceplane guidance is a joke right now.\u003C/p\u003E\u003Cp\u003EC7. See P8. MJ is only good for general cases.\u003C/p\u003E\u003Cp\u003EC8. (Yet to be tested on 0.21) Sometimes it causes extreme lag if more than 1 MJ part is present on a craft. (Used to happen when I forgot to ditch that MJ part before docking to a space station)\u003C/p\u003E\u003Cp\u003EThat should be all... Anyway, have fun.\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-07-30T04:30:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Fog\u0022 data-cite=\u0022The Fog\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EC5. No longer provides ascent performance results in version 2. So I can\u0027t judge how efficient my ascent profile is.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes it does. You have to pick that tab from the customization menu. It\u0027s definitely in 2.0.9 as a separate tab, but us still could get those stats my hand selecting them into another window in 2.0.8.\u003C/p\u003E\u003Cp\u003ESome of your other cons are definitely valid, though. I\u0027ve noticed it\u0027s a lot more wobbly with .21. It\u0027s going to need to be tweaked. Even Smart A.S.S. tends to be a little twitchy at this point. Honestly, it may be partly due to the ship I was using. I had an ASAS ring on it by force of habit which may not play well with the built in SAS of the Mk1-2 pod. Seems like it should make it more solid, but turning off the torque on one of them seemed to settle the ship down some.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-30T04:36:34Z\u0022 title=\u002207/30/2013 04:36  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 30, 2013\u003C/time\u003E by DChurchill\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Fog","CreatedById":72732,"CreatedDateTime":"2013-07-30T04:53:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DChurchill\u0022 data-cite=\u0022DChurchill\u0022\u003E\u003Cdiv\u003EYes it does. You have to pick that tab from the customization menu. It\u0027s definitely in 2.0.9 as a separate tab, but us still could get those stats my hand selecting them into another window in 2.0.8.\u003Cp\u003ESome of your other cons are definitely valid, though. I\u0027ve noticed it\u0027s a lot more wobbly with .21. It\u0027s going to need to be tweaked. Even Smart A.S.S. tends to be a little twitchy at this point. Honestly, it may be partly due to the ship I was using. I had an ASAS ring on it by force of habit which may not play well with the built in SAS of the Mk1-2 pod. Seems like it should make it more solid, but turning off the torque on one of them seemed to settle the ship down some.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh thanks for the tip!\u003C/p\u003E\u003Cp\u003EI hope they\u0027ll adapt the new SAS system soon. It works way better.\u003C/p\u003E\n"},{"CreatedByName":"Doctadeth","CreatedById":76424,"CreatedDateTime":"2013-07-30T06:55:33Z","Content":"\n\u003Cp\u003ETo the OP.\u003C/p\u003E\u003Cp\u003ETo mechjeb or not to mechjeb, that is the question. But the answer does not come from those who dislike or like mechjeb. Rather, it must come from your own self. Do you feel like using mechjeb is the answer? It\u0027s still a sandbox game, so cheating doesn\u0027t exist.\u003C/p\u003E\u003Cp\u003EI\u0027ve mechjebed and I\u0027ve gone vanilla. Both have their plus and minus points. But only one will be, in the end....the answer.\u003C/p\u003E\n"}]}