{"TopicId":40239,"ForumId":32,"TopicTitle":"0.21 memory issues?","CreatedByName":"AlciyaDragonash","CreatedById":72023,"CreatedDateTime":"2013-07-31T08:13:22Z","PageNum":1,"Articles":[{"CreatedByName":"AlciyaDragonash","CreatedById":72023,"CreatedDateTime":"2013-07-31T08:13:22Z","Content":"\n\u003Cp\u003EIs it just me, or is 0.21 eating more memory than before?? i loaded about half the mods i had for 0.20, and it\u0027s maxxing out memory usage (to that \u0026lt;bleep\u0026gt;ing crash point) before i can even hit the liftoff button. Got B9, Novapunch, LLL, THSS, and KOSMOS loaded as the big packs, plus a couple smaller utility mods and plugins... Any clues? Is it \u0027cause not all the packs are updated to 0.21? Or is it just something with KSP?\u003C/p\u003E\u003Cp\u003EHopefully the KSP team can get some 64-bit love going so we get more room to play with. T_T\u003C/p\u003E\n"},{"CreatedByName":"Jeb\u0026#039;s Safety Instructor","CreatedById":76739,"CreatedDateTime":"2013-07-31T09:26:19Z","Content":"\n\u003Cp\u003EI noticed the same thing. When 0.21 came out, my game kept crashing after every 2nd or 3rd (failed) launch. Even with a clean install without mods. I had to turn down the graphics quality to prevent the crashes.\u003C/p\u003E\u003Cp\u003EI also hope they manage to solve the problem of lag when your partcount goes up. Trying to build a spacestation but it starts to get really laggy now after I added 3 modules to it.\u003C/p\u003E\n"},{"CreatedByName":"Araym","CreatedById":46343,"CreatedDateTime":"2013-07-31T10:01:04Z","Content":"\n\u003Cp\u003EDefinitely in the same situation: i\u0027m playing on not so much powerfull laptop, but at low resolution I was able to put together an average good assemblies of mods (I like the real life-like ones, so both of Bobcat\u0027s Soviet and American pack, Saturn V, the ULA pack with Atlas and Deltas, the ESA pack, KOSMOS, plus a couple of utilities mods to have more generic improvements of choices, like Novapunch, KW, and utilities like mechjeb) but, actually, I have my memory space already used up by the \u0022basic\u0022 same utilities, and I have not started to load the core of my game made by real life rockets...\u003C/p\u003E\u003Cp\u003E... BUT even with an almost clean installation, I wasn\u0027t able to get the game run at \u0022full speed\u0022: an average medium lifter made only stock is more enough to struggle with time compression, makin all of my launches in slo-mo.... U_U\u003C/p\u003E\u003Cp\u003EI like some of the new feature (new SAS-reaction wheels made my space docking very easier on RTS usage) but i feel, generally speking, that 0.20.2 was more gentle with my poor pc.\u003C/p\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2013-07-31T12:25:07Z","Content":"\n\u003Cp\u003EIn all honesty the chances are that the problem is due to your amount of mods. I use MJ, Kethane and KAS and I don\u0027t tend to lag until my part count is stretching on towards 300 on my laptop whereas I couldn\u0027t get anywhere near that with Novapnuch etc installed. (\u003Ca href=\u0022/cdn-cgi/l/email-protection\u0022 class=\u0022__cf_email__\u0022 data-cfemail=\u0022d29be192e0fce0b5baa8\u0022\u003E[email\u0026#160;protected]\u003C/a\u003E with a gt415m which is handling just some basic graphical processes) In fact I seem to get considerably better performance than I did with .20, but the opposite effect happens at the launchpad.\u003C/p\u003E\u003Cp\u003EUnfortunately 64bit is likely out of the question for now. If I am correct I believe the KSP devs have an x64 build but it\u0027s unreliable, something many devs using Unity have often leveraged against x64 builds being switched from x32. Outside of that the PhysX version supported by Unity 4 still doesn\u0027t allow multithreading or GPU offloading so until that is corrected there would be little to no performance gain from and x64 build currently. \u003C/p\u003E\u003Cp\u003EOne minor annoyance that I have noticed though is that increasing graphical settings by even the slightest bump on my laptop happens to butcher my FPS. Considering that GPU is more than capable of going beyond low setting for the game I\u0027m inclined to believe that for some bizarre reason KSP is also heavily relying on the CPU for almost all of the graphical functionality. I don\u0027t know the development process so I could be miles off, but it seems kind of weird that my GPU can hardly even be touched by KSP for things like textures etc.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-31T12:29:21Z\u0022 title=\u002207/31/2013 12:29  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 31, 2013\u003C/time\u003E by Kerbonautical\u003C/strong\u003E\n\u003Cbr\u003EAdded missing sentence\n\u003C/span\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-31T13:06:34Z","Content":"\n\u003Cp\u003ESomethings up. Never had problems until .21 \u003C/p\u003E\u003Cp\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/43677-Game-crashes-to-desktop-when-landing\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/43677-Game-crashes-to-desktop-when-landing\u003C/a\u003E\u003C/p\u003E\n"}]}