{"TopicId":40494,"ForumId":32,"TopicTitle":"Operation Green Kerbin","CreatedByName":"Enigma179","CreatedById":67703,"CreatedDateTime":"2013-08-01T16:40:57Z","PageNum":1,"Articles":[{"CreatedByName":"Enigma179","CreatedById":67703,"CreatedDateTime":"2013-08-01T16:40:57Z","Content":"\n\u003Cp\u003ESo I\u0027ve been launching rockets around for quite a while, and now I have debris in various orbits around Kerbin. Thankfully for the most part it\u0027s all in eastward low inclination orbits, although some are pretty eccentric. I think terminating flights or setting max debris to 0 would be kinda lame, so instead I\u0027ve decided I\u0027m going to clean it all up! I need suggestions on how, though. Mods currently installed are flight engineer, alarm clock, FAR, deadly re-entry, procedural fairings and ioncross crew support.\u003C/p\u003E\u003Cp\u003EAny methods that can be done with just those mods\u002Bstock parts? Preferably something that doesn\u0027t require me to re-launch a rocket for every bit of debris.\u003C/p\u003E\u003Cp\u003EFailing that, any mods recommended to get the job done, either using my method (below) or some other one?\u003C/p\u003E\u003Cp\u003EMy current plan is to build some kind of bucket out of platforms on top of decent fuel supplies and nuke engines, rendezvous and scoop up the debris, push it into an orbit that breaks the atmosphere (maybe not all the way down to debris-destruction height, but low enough that it can burn up on re-entry if I focus on it), then pull the platform out of the fall and rendezvous with the next bit of debris, perhaps refuelling at my space station every once in a while.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-01T16:47:48Z","Content":"\n\u003Cp\u003EPerhaps and option would be to install the sunbeam laser weapon, launch a ship with it and a fair amount of delta V into a retrograde orbit. \u003C/p\u003E\u003Cp\u003EThen, tweak that orbit to pass the debris, and take it out with the lasers. You\u0027d need to shoot quick, but you could get many removed with the one vessel. Maybe.\u003C/p\u003E\n"},{"CreatedByName":"MUSTANG","CreatedById":72918,"CreatedDateTime":"2013-08-01T16:47:54Z","Content":"\n\u003Cp\u003EWhile I\u0027m sure your bucket method could eventually work, I think it would require a lot more effort. I\u0027d recycled downloading Kerbal Attachment System. It features a winch and an electromagnet, which could be used to tow debris into a suborbital trajectory.\u003C/p\u003E\n"},{"CreatedByName":"ThatNoob","CreatedById":59238,"CreatedDateTime":"2013-08-01T16:49:37Z","Content":"\n\u003Cp\u003EWell why not try making some kind of ship that shoot boosters at the debris and then scoop up and deorbit the remaining debris,or a Battering ram?\u003C/p\u003E\n"}]}