{"TopicId":40923,"ForumId":32,"TopicTitle":"Odd player quirk: Measuring fuel in \u0022cans\u0022","CreatedByName":"zxczxczbfg","CreatedById":74636,"CreatedDateTime":"2013-08-04T04:13:27Z","PageNum":1,"Articles":[{"CreatedByName":"zxczxczbfg","CreatedById":74636,"CreatedDateTime":"2013-08-04T04:13:27Z","Content":"\n\u003Cp\u003EI was on a forum binge and started noticing that 2.5m rocket sections tend to have their total fuel measured in \u0022cans\u0022 rather than whatever unit the game itself uses: The X200-16 is the can, the X200-8 is the half-can, the Jumbo is the tetracan, etc. This is pretty logical in terms of ease-of-communication: when you say you\u0027ve got 2880 liquid fuel and 3520 oxidizer on your current stage, people have to go look up the values, but if you just tell them you\u0027ve got two double cans, they always know how that your stock Kerbal X has just spent all of its asparagus-stage boosters. I\u0027d like to know: what are your opinions on this notational convention?\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-08-04T04:16:51Z","Content":"\n\u003Cp\u003EI usually measure my fuel in terms of the FL-200 fuel tank. The jumbo (orange) tank is 8, then 4, 2, 1, 0.5, 0.25, and now 0.125. Not sure why. I just started doing it that way.\u003C/p\u003E\n"},{"CreatedByName":"Joshington","CreatedById":73509,"CreatedDateTime":"2013-08-04T04:40:44Z","Content":"\n\u003Cp\u003EI use the X200-32 as the standard because it\u0027s the one I use most often.\u003C/p\u003E\n"},{"CreatedByName":"zxczxczbfg","CreatedById":74636,"CreatedDateTime":"2013-08-04T04:47:53Z","Content":"\n\u003Cp\u003EBoth valid points. However, the rocket I use the most (a modified version of the aforementioned Kerbal X) has a 2.5m central stack, so I mostly use the Rockomax-brand fuel tanks for measurement. Occasionally I use the Oscar B for very small measurements, or the Poodle engine for trying to explain Delta-V to my little sister (I sometimes end up measuring things in Tetrapoodles).\u003C/p\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-08-04T05:46:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joshington\u0022 data-cite=\u0022Joshington\u0022\u003E\u003Cdiv\u003EI use the X200-32 as the standard because it\u0027s the one I use most often.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy system, too, if I\u0027m counting tanks. That said, the x32 has 3200 units of fuel (which I often and incorrectly like to call Liters), the t-800 has 800 units, and pretty much every 2.5m and 1.25m tank is named for its capacity. So I also often use the capacity (useful for space tankers especially). For example, my Tanker 672 carries 67200 units of fuel (or 21 of the x32 tanks).\u003C/p\u003E\u003Cp\u003EAnd with literally dozens of design iterations, I managed to put those 21 full tanks (plus few RCS tanks, NRVs and a few other bits) into orbit in a single launch...\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-08-04T06:17:20Z","Content":"\n\u003Cp\u003EI measure in terms of Big Orange Tanks; usually the capacities of heavy lifter rockets up to orbit. i.e.: A rocket that can carry ~36t to LKO can carry 1 orange tank, one that carries ~18t can carry half an orange tank (an X-32), and so on.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-08-04T08:58:07Z","Content":"\n\u003Cp\u003EI\u0027ve been known to think of it in terms of the FL-400 (there didn\u0027t used to be a -200, let alone the brand new -100), or the X200-16, or the X200-32 (the -16 also didn\u0027t used to exist, let alone the -8... which holds the exact same amount of fuel as the FL-T800, btw). \u003C/p\u003E\u003Cp\u003EAnd there\u0027s actually a very good reason to use fewer larger tanks rather than a bunch of smaller ones, other than partcount and wobbling: the game models the weight of a part more or less as if it were spread evenly throughout the part. This includes fuel weight, even as it\u0027s decreasing. If you use two FL-T400s, it\u0027ll drain the top one first, shifting the center of mass of that part of the stack downwards. If you use a single FL-T800, the center of mass stays in the center of the tank. You\u0027ll still get CoM shifting relative to the rest of your rocket, of course, but locally it\u0027s much improved. On smaller rockets in particular it\u0027d have more of an effect (the Kerbal-X could probably benefit from this if it had a -64 and a -32 instead of three -32s.)\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-04T09:26:04Z","Content":"\n\u003Cp\u003EOrange tanks - there\u0027s no way to misunderstand it and it gives you a good sense of scale. \u003C/p\u003E\u003Cp\u003EMy most used lifter, 5\u002B5 orange tanks in pancake staging would with \u0027cans\u0027 be 20\u002B20, and 7\u002B7 would be 28\u002B28. You\u0027d have to start doing the math in your head rather than just thinking \u0027one orange tank with four around it\u0027. The larger you go the more tedious it would get. I suspect that most people think in ways of orange tanks anyway, trying to get the idea of 128 cans across would just result in people trying to figure out how many orange tanks that\u0027s equal to.\u003C/p\u003E\u003Cp\u003EIf you\u0027re doing medium rockets then FL-T800, and tiny ones then oscar-b (and toroidal).\u003C/p\u003E\n"}]}