{"TopicId":41371,"ForumId":32,"TopicTitle":"About the Tech tree","CreatedByName":"Necandi Brasil","CreatedById":63677,"CreatedDateTime":"2013-08-06T22:17:29Z","PageNum":11,"Articles":[{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-08-17T00:26:58Z","Content":"\n\u003Cp\u003EI like the idea of going out and scanning for anomalies (not necessarily the same as easter eggs) on other bodies and in space. Discovering an anomaly and exploring it (either going there and sending back data or physically bringing back a sample) will award science points, which can be used to advance down the tech tree.\u003C/p\u003E\n"},{"CreatedByName":"Piggius_Max","CreatedById":51971,"CreatedDateTime":"2013-08-17T00:31:12Z","Content":"\n\u003Cp\u003EFolder. System. In. VAB. Please.\u003C/p\u003E\u003Cp\u003EThis is the only thing I ask for, I\u0027d be happy with the game if development were to finish tomorrow, provided a simple folder system was prominent in that build.\u003C/p\u003E\u003Cp\u003EBack on topic: The tech tree should be interesting, I don\u0027t know if/how tech is to be obtained, unless it\u0027s contracts for money/research or money that you can spend on research, but who knows; I\u0027ll leave that to the devs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Necandi Brasil","CreatedById":63677,"CreatedDateTime":"2013-08-17T01:10:02Z","Content":"\n\u003Cp\u003E*Crosses fingers*\u003C/p\u003E\u003Cp\u003EThis R\u0026amp;D update is going to be awesome ! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"geb","CreatedById":5399,"CreatedDateTime":"2013-08-17T07:31:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EOoh, there\u0027s another handoff that will need to be done for science, though I think someone else mentioned it here as well. Apollo style mission. LEM goes down, gathers physical science data, links up with the orbiter. We need some way for the orbiter to now have credit for the physical results, because the LEM isn\u0027t going to be landing back on Kerbin. I\u0027m not sure it matters if the credit is copied or transfered, as long as we can\u0027t turn in the same results twice.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow I\u0027m imagining transferring data just like we do with fuel transfers. Right click on some science package, alt-click on the mothership, and \u0022input data\u0022.\u003C/p\u003E\u003Cp\u003EYes, this would be an awful way to handle it, but the idea amuses me.\u003C/p\u003E\n"},{"CreatedByName":"triffid_hunter","CreatedById":61814,"CreatedDateTime":"2013-08-17T08:13:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI posted about this earlier. MechJeb allows you to blacklist modules on a per-part basis, so there\u0027s no reason you couldn\u0027t create a logical progression of parts/features that would unlock at certain points in the tree.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think if it\u0027s done this way then we\u0027d end up with a whole page of various MechJeb parts with different capabilities, unless the tech tree provides a way to obsolete older parts. Then we have the issue of old ships can\u0027t plot the new maneuvers despite the fact that we all know how easy firmware upgrades are with basically everything, and it still doesn\u0027t follow the player\u0027s piloting ability, it simply follows their ability to gain science\u003C/p\u003E\u003Cp\u003EI\u0027d much prefer MechJeb\u0027s abilities to follow the player\u0027s ability to pilot rather than a simple stack of parts with varying utility in the tech tree\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-08-17T15:02:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022triffid_hunter\u0022 data-cite=\u0022triffid_hunter\u0022\u003E\u003Cdiv\u003EI think if it\u0027s done this way then we\u0027d end up with a whole page of various MechJeb parts with different capabilities, unless the tech tree provides a way to obsolete older parts. Then we have the issue of old ships can\u0027t plot the new maneuvers despite the fact that we all know how easy firmware upgrades are with basically everything, and it still doesn\u0027t follow the player\u0027s piloting ability, it simply follows their ability to gain science\u003Cp\u003EI\u0027d much prefer MechJeb\u0027s abilities to follow the player\u0027s ability to pilot rather than a simple stack of parts with varying utility in the tech tree\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy is any of this in this thread?\u003C/p\u003E\u003Cp\u003EHarvestr has said multiple times in this thread they are no making any desicion for mod makers, all the mod makers will have to choose how and if their stuff goes into career mode. \u003C/p\u003E\u003Cp\u003ESo why not take this conversation to the MechJeb thread and try to convince the MechJeb devs of your ideas?\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-17T15:32:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022triffid_hunter\u0022 data-cite=\u0022triffid_hunter\u0022\u003E\u003Cdiv\u003EI think if it\u0027s done this way then we\u0027d end up with a whole page of various MechJeb parts with different capabilities, unless the tech tree provides a way to obsolete older parts. Then we have the issue of old ships can\u0027t plot the new maneuvers despite the fact that we all know how easy firmware upgrades are with basically everything, and it still doesn\u0027t follow the player\u0027s piloting ability, it simply follows their ability to gain science\u003Cp\u003EI\u0027d much prefer MechJeb\u0027s abilities to follow the player\u0027s ability to pilot rather than a simple stack of parts with varying utility in the tech tree\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it\u0027d be a good idea if they had like...well, essentially a firmware update type of deal like you mentioned as part of the tech tree. Perhaps SAS, communications parts and even some mod parts like protractor, mechjeb or kerbal engineer could improve over time without needing a new part to fill the role. New technology could just expand the functionality of those old computer parts.\u003C/p\u003E\u003Cp\u003EThis could expand to command modules as well. Perhaps you start with very limited ability to plot courses through space and doing flight science like testing rockets and basic orbital mechanics without exploding could help you unlock the maneuver node system...then maybe a few tech levels later, you can expand the maneuver node system a bit to plot multiple nodes after each other and so on.\u003C/p\u003E\u003Cp\u003EI think that would work well in conjunction with making some older or prototype parts obsolete so they don\u0027t show up in the VAB...or maybe have their own tab for outdated parts. Somethin\u0027 like that, anyways.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-08-17T15:37:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022triffid_hunter\u0022 data-cite=\u0022triffid_hunter\u0022\u003E\u003Cdiv\u003EI\u0027d much prefer MechJeb\u0027s abilities to follow the player\u0027s ability to pilot\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m sorry to say but you really can\u0027t quantify a player\u0027s ability to pilot in a mechanical way. Any attempt at that will be arbitrary and frustrating to everyone involved, except perhaps the person who wrote it.\u003C/p\u003E\u003Cp\u003EObsoleting old parts would be pretty cool, though.\u003C/p\u003E\n"},{"CreatedByName":"Gaiabladegold","CreatedById":43730,"CreatedDateTime":"2013-08-17T23:38:16Z","Content":"\n\u003Cp\u003EThis looks to be another promising update already! I\u0027m really excited we\u0027re getting into this sort of things, looking foreward to whenever it comes out, hopefully soon but never should rush a good thing!\u003C/p\u003E\u003Cp\u003EAll in all, go Devs! keep up the amazing work, really looking foreward to more awesome stuff from you guys. ^^\u003C/p\u003E\n"},{"CreatedByName":"manskal","CreatedById":73159,"CreatedDateTime":"2013-08-18T08:01:20Z","Content":"\n\u003Cp\u003ETo stop experiment spamming : \u003C/p\u003E\u003Cp\u003EMake the experiments costly and sensitive. That way you cannot be too cavalier with your science packages.\u003C/p\u003E\u003Cp\u003EAlso, make different levels of experiments that collect the same type of data but at varying qualities. They should be integrated into the tech tree. So in the early game you might have a one-shot rock analysis experiment but later you have a much more expensive experiment that can take multiple readings.\u003C/p\u003E\u003Cp\u003EOr something like that. I\u0027m sure the devs have plenty of time to balance it out before release.\u003C/p\u003E\n"},{"CreatedByName":"brienne","CreatedById":59216,"CreatedDateTime":"2013-08-18T10:28:21Z","Content":"\n\u003Cp\u003EWe know exactly how many planets do exist, where exactly they are...\u003C/p\u003E\u003Cp\u003EWe know that our vessel is 82 654m high, 1645 m/s, ....\u003C/p\u003E\u003Cp\u003ETech lvl should put a mess in that^^\u003C/p\u003E\u003Cp\u003E\u0022I d like to go to Duna, ... but where is it? Does the point I\u0027m aiming for is really the place where Duna will be?\u0022\u003C/p\u003E\u003Cp\u003E\u0022I feel I\u0027m not 45m high, but \u002B- 20m\u0022\u003C/p\u003E\u003Cp\u003ESpace pioneers didn\u0027t know what exactly was going to happen during next fly. And managed to handle with rough datas.\u003C/p\u003E\u003Cp\u003EMy 2 cents.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2013-08-18T11:19:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain_Doug\u0022 data-cite=\u0022Captain_Doug\u0022\u003E\u003Cdiv\u003EBefore we get comms antenna\u0027s would we have to physically go and get it? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would mean we\u0027d be forced to first do manned missions, which are more technologically challenging than unmanned missions. That would be backwards wrt advancement in the tech tree.\u003C/p\u003E\u003Cp\u003EI\u0027d argue radio is sufficiently low tech that a simple form of radio comms should be available early in the game.\u003C/p\u003E\n"},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2013-08-18T19:19:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022brienne\u0022 data-cite=\u0022brienne\u0022\u003E\u003Cdiv\u003EWe know exactly how many planets do exist, where exactly they are...\u003Cp\u003EWe know that our vessel is 82 654m high, 1645 m/s, ....\u003C/p\u003E\u003Cp\u003ETech lvl should put a mess in that^^\u003C/p\u003E\u003Cp\u003E\u0022I d like to go to Duna, ... but where is it? Does the point I\u0027m aiming for is really the place where Duna will be?\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll the major planets and their orbits were known before the Space Age. There were very small discrepancies in Mercury\u0027s orbit that were resolved by Einstein\u0027s theory of relativity, so even at the beginning of the 20th century the orbits were very precisely known.\u003C/p\u003E\n"},{"CreatedByName":"EleSigma","CreatedById":11215,"CreatedDateTime":"2013-08-19T23:37:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003EIt starts with mid-sized engines actually (LV-T series). Going larger or smaller are both advancements.\u003Cp\u003ECheers\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait, Wouldn\u0027t it make more sense for a medium sized LV-1 to be the first engine? Since it\u0027s called an LV-1, implying it\u0027s the first...of something.\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-20T00:13:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003EThat would mean we\u0027d be forced to first do manned missions, which are more technologically challenging than unmanned missions. That would be backwards wrt advancement in the tech tree.\u003Cp\u003EI\u0027d argue radio is sufficiently low tech that a simple form of radio comms should be available early in the game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. You do manned missions because you can score more science points, and partially for the bragging rights. You do them not because they are easy, but because they are hard.\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-20T05:30:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003EExactly. You do manned missions because you can score more science points, and partially for the bragging rights. You do them not because they are easy, but because they are hard.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EManned missions are more difficult in real life but not really in KSP, unless they ever actually add life support(they still seem on the fence about it). So there wouldn\u0027t be much bragging and it wouldn\u0027t be paced very well if you start the game with huge science earning manned missions then \u003Cem\u003Eunlock\u003C/em\u003E low-tech probe stuffs \u0026gt;.\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"marko dash","CreatedById":1584,"CreatedDateTime":"2013-08-20T05:58:56Z","Content":"\n\u003Cp\u003Edifferent culture, different value of their lives. manned would be much cheaper if you didn\u0027t care as much about the safety of the crew.\u003C/p\u003E\n"},{"CreatedByName":"trvtannenberg","CreatedById":8491,"CreatedDateTime":"2013-08-20T06:40:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022marko dash\u0022 data-cite=\u0022marko dash\u0022\u003E\u003Cdiv\u003Edifferent culture, different value of their lives. manned would be much cheaper if you didn\u0027t care as much about the safety of the crew.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd much, much shorter.\u003C/p\u003E\n"},{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2013-08-20T08:36:09Z","Content":"\n\u003Cp\u003Escience parts that\u003C/p\u003E\u003Cp\u003E-can only be activated in EVA\u003C/p\u003E\u003Cp\u003E-need to be active for a given time to yield results\u003C/p\u003E\u003Cp\u003E-need a kerbal onboard to activate\u003C/p\u003E\u003Cp\u003E-need x number of kerbals onboard to activate\u003C/p\u003E\u003Cp\u003E-yield results when activated and impact a celestial object\u003C/p\u003E\u003Cp\u003E-get unlocked in tech tree after science part z has been used for y science points\u003C/p\u003E\u003Cp\u003E-can only be activated when.....\u003C/p\u003E\u003Cp\u003EAh, the possibilities =D I don\u0027t think Squad will have trouble creating incentive to do manned missions instead of just probes, and vice versa. Manned missions would also be much more expensive, and presumably there would eventually be missions with pre-determined goals too, requiring whatever parts and number of crew members to be onboard to be successful.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-20T08:55:30Z\u0022 title=\u002208/20/2013 08:55  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 20, 2013\u003C/time\u003E by kurja\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-08-20T08:56:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003EExactly. You do manned missions because you can score more science points, and partially for the bragging rights. You do them not because they are easy, but because they are hard.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the United States still had to take baby steps with practicing low earth orbit launches, maneuvers, docking, life support, space suit design, unmanned satellite launches to learn how to get to the moon in the first place. They didn\u0027t simply grab all their stuff and launched for the moon first and then decided to work backwards to making satellites and unmanned landers.\u003C/p\u003E\n"},{"CreatedByName":"geb","CreatedById":5399,"CreatedDateTime":"2013-08-20T12:55:56Z","Content":"\n\u003Cp\u003EHas there been any suggestion of difficulty levels in research?\u003C/p\u003E\u003Cp\u003EI vaguely recall the devs talking about difficulty settings like a harcore mode with no crew respawning. If research is to be a resource, you could have difficulty levels there too.\u003C/p\u003E\u003Cp\u003EYou could, for example, have easy mode where a few suborbital trips gets you all the bits you need for a Mun landing (big engines, lander cans, landing legs, etc.), but to get all the same tech in hard mode you\u0027d have to really push at high altitude jet flights and science in low orbit, performing lots more experiments.\u003C/p\u003E\n"},{"CreatedByName":"brienne","CreatedById":59216,"CreatedDateTime":"2013-08-20T13:11:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NERVAfan\u0022 data-cite=\u0022NERVAfan\u0022\u003E\u003Cdiv\u003EAll the major planets and their orbits were known before the Space Age. There were very small discrepancies in Mercury\u0027s orbit that were resolved by Einstein\u0027s theory of relativity, so even at the beginning of the 20th century the orbits were very precisely known.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKSP shows exactly what s gonna happen. I push prograde and I see what changes. They could make that Tech tree related.\u003C/p\u003E\u003Cp\u003EAnd how do I know I travel 1645m/s in space? Low tech can\u0027t tell me that.\u003C/p\u003E\u003Cp\u003EJust an idea to give datas sharper as your tech level increase.\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-20T13:29:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EBut the United States still had to take baby steps with practicing low earth orbit launches, maneuvers, docking, life support, space suit design, unmanned satellite launches to learn how to get to the moon in the first place. They didn\u0027t simply grab all their stuff and launched for the moon first and then decided to work backwards to making satellites and unmanned landers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was my point, wasn\u0027t it? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"iamaphazael","CreatedById":49843,"CreatedDateTime":"2013-08-20T13:31:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022brienne\u0022 data-cite=\u0022brienne\u0022\u003E\u003Cdiv\u003EKSP shows exactly what s gonna happen. I push prograde and I see what changes. They could make that Tech tree related.\u003Cp\u003EAnd how do I know I travel 1645m/s in space? Low tech can\u0027t tell me that.\u003C/p\u003E\u003Cp\u003EJust an idea to give datas sharper as your tech level increase.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with this idea, and I\u0027m sure the devs are thinking about it, as it fits in with the idea of game progression following the development progression. Perhaps at the very beginning of a career game, you don\u0027t have access to maneuver nodes, orbital prediction, perhaps even map mode is disabled, and you have to unlock those things by flying a few missions by the seat of your pants.\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2013-08-20T13:53:41Z","Content":"\n\u003Cp\u003ESQUAD could do two things to provide an incentive to do boots on the ground missions.\u003C/p\u003E\u003Cp\u003E1) They could provide some kind of science points in a catagory (or just in general) for having a Kerbal there. Maybe a 25% bonus if the science research is done with a manned capsule/rover/etc?\u003C/p\u003E\u003Cp\u003E2) Or a few of the science instruments may only be usable by a kerbal. There isn\u0027t a whole lot that a person can\u0027t do that a robot/probe can\u0027t in real life...but this is Kerbal. Maybe soil samplers or rock drills or something can be used by Kerbals on EVA? Dunno, its a thought.\u003C/p\u003E\n"}]}