{"TopicId":41560,"ForumId":32,"TopicTitle":"Whats your current mission?","CreatedByName":"gmpd2000","CreatedById":37101,"CreatedDateTime":"2013-08-08T03:11:48Z","PageNum":1,"Articles":[{"CreatedByName":"gmpd2000","CreatedById":37101,"CreatedDateTime":"2013-08-08T03:11:48Z","Content":"\n\u003Cp\u003EAs the title says, post here the mission or project wich you are currently working on.\u003C/p\u003E\u003Cp\u003EMine is a relay of sattelite network to test the probability of orbital collision.\u003C/p\u003E\u003Cp\u003ESo, whats yours?\u003C/p\u003E\u003Cp\u003EImages would be greatly appreciated!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-08T03:14:03Z\u0022 title=\u002208/08/2013 03:14  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 8, 2013\u003C/time\u003E by gmpd2000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-08-08T03:15:33Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Dl3cJKn.png\u0022 alt=\u0022Dl3cJKn.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEmbracing the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36572-I-am-full-of-grief-and-coffee?p=578698\u0026amp;viewfull=1#post578698\u0022 rel=\u0022external nofollow\u0022\u003Eimplausible\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Sbowyer28","CreatedById":4338,"CreatedDateTime":"2013-08-08T03:17:52Z","Content":"\n\u003Cp\u003EI\u0027m working on Colonizing Gilly, Here have an Unclassified Image of a Tug preparing for departure.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xLezwTd.png\u0022 alt=\u0022xLezwTd.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-08-08T03:29:30Z","Content":"\n\u003Cp\u003EBuilding up my space station. Currently, I have a Habitat module built and a solar array planned, but the Hab is waiting for the solar array (The Kerbals want power), which is waiting for helldiver\u0027s shuttle to come out so it can have a classy launch vehicle. I guess I\u0027ll add a fuel depot and yet-unmanned science lab while I wait.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-08-08T03:30:13Z","Content":"\n\u003Cp\u003EI\u0027m currently attempting to put an atmospheric plane onto Laythe:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s14.postimg.org/j7zd5h51d/screenshot152.png\u0022 alt=\u0022screenshot152.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI keep crashing it when landing, and I have to reload the quicksave from orbit. One of these tries I\u0027ll get it...\u003C/p\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-08-08T04:41:25Z","Content":"\n\u003Cp\u003EI am sending my first mission to Moho because I am a complete scrub who never does any interplanetary stuff.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zoyFNXt.jpg\u0022 alt=\u0022zoyFNXt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s going very well though. 20 days to the plain change maneuver which should put me into an intercept only 100km above the surface.\u003C/p\u003E\n"},{"CreatedByName":"M83","CreatedById":68926,"CreatedDateTime":"2013-08-08T04:47:31Z","Content":"\n\u003Cp\u003EMy most recent mission was a rendezvous-and-dock of two unmanned probes around Kerbin at about 3,000,000m. First time I\u0027d ever docked something, so I was very proud of finally doing that.\u003C/p\u003E\n"},{"CreatedByName":"spikeyhat09","CreatedById":39217,"CreatedDateTime":"2013-08-08T04:48:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Dl3cJKn.png\u0022 alt=\u0022Dl3cJKn.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEmbracing the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36572-I-am-full-of-grief-and-coffee?p=578698\u0026amp;viewfull=1#post578698\u0022 rel=\u0022external nofollow\u0022\u003Eimplausible\u003C/a\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat seems largely unnecessary, surely you could easily get the same payload to orbit with a much smaller part count.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-08-08T04:52:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mushroomman\u0022 data-cite=\u0022mushroomman\u0022\u003E\u003Cdiv\u003EI am sending my first mission to Moho because I am a complete scrub who never does any interplanetary stuff.\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zoyFNXt.jpg\u0022 alt=\u0022zoyFNXt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s going very well though. 20 days to the plain change maneuver which should put me into an intercept only 100km above the surface.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo... those clouds you have there lol.\u003C/p\u003E\n"},{"CreatedByName":"Quantum Jim","CreatedById":73360,"CreatedDateTime":"2013-08-08T05:08:01Z","Content":"\n\u003Cp\u003EI\u0027m making a space station. The station itself is all stock parts (with MechJeb added to command pods); although, most of my boosters used procedural fairings and occasionally one custom fuel tank from PartGen (but made to fit within the game). \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/vOQKK2I\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/vOQKK2I.png\u0022 alt=\u0022vOQKK2I.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe station is at 20.66 degree inclination at 250 km. This means it can have more sunlight and go over more land, and can gt flight from KSC 2 (if there\u0027s ever a way to launch from there...). But it makes rendezvous hard (parking orbit, inclination change, Hoffman transfer, etc...).\u003C/p\u003E\u003Cp\u003EIt took 17 (Successful) Launches and 19 Dockings maneuvers to build. Although I used MechJeb for the initial dockings, I found I had to perform most manually. I still have 4-5 more modules to add before it\u0027s complete (and probably a few reconfigs since the real ISS will get new modules and a reconfig soon). After it\u0027s done, I think I\u0027ll prob add some non-stock parts that more closely mimic the real ISS. Then I\u0027ll prepare to leave LKO.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-08-08T05:08:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spikeyhat09\u0022 data-cite=\u0022spikeyhat09\u0022\u003E\u003Cdiv\u003Ethat seems largely unnecessary, surely you could easily get the same payload to orbit with a much smaller part count.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, the payload was kinda big...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/KRs4qan.png\u0022 alt=\u0022KRs4qan.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThat lander is a little more than 2 orange tanks high.\u003C/p\u003E\n"},{"CreatedByName":"Quantum Jim","CreatedById":73360,"CreatedDateTime":"2013-08-08T05:08:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mushroomman\u0022 data-cite=\u0022mushroomman\u0022\u003E\u003Cdiv\u003EI am sending my first mission to Moho because I am a complete scrub who never does any interplanetary stuff.\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zoyFNXt.jpg\u0022 alt=\u0022zoyFNXt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s going very well though. 20 days to the plain change maneuver which should put me into an intercept only 100km above the surface.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow\u0027d you get those clouds? That\u0027s cool!\u003C/p\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-08-08T05:12:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Quantum Jim\u0022 data-cite=\u0022Quantum Jim\u0022\u003E\u003Cdiv\u003EHow\u0027d you get those clouds? That\u0027s cool!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI made them for the Universe Replacer mod. There\u0027s a link in my signature.\u003C/p\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-08-08T05:44:17Z","Content":"\n\u003Cp\u003EWell, I just wraped up my roleplaying Spear/Firewalker probe-based mission into Jool\u0027s system, so I\u0027ve sent a probe lander to Laythe. It\u0027s in orbit right now and I\u0027m just looking for a landing spot.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ONrSUAT.jpg\u0022 alt=\u0022ONrSUAT.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-08-08T06:41:04Z","Content":"\n\u003Cp\u003EThe current mission (and largest political argument topic, \u0022SAVE THE PLANETS! WE ALREADY MESSED UP KERBIN SYSTEM, WHY MESS WITH TH OTHERS?!\u0022 \u0022Do you want to live on this rock forever? I\u0027d rather prefer to live on some other planet!\u0022) is to go to Eve.\u003C/p\u003E\u003Cp\u003EPhase angles are the largest problem. My ship has more than enough dV to get there, but none of my protractor addons are doing it right.\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-08-08T07:21:42Z","Content":"\n\u003Cp\u003EMy current mission was supposed to be a manned mission to Duna. \u003C/p\u003E\u003Cp\u003EMy new interplanetary cruise ship took on a secondary mission on its shakedown cruise and swung by Duna. Dropped off a communication satellite, a hitchhiker pod to serve as a life support module, and a rover before heading off to Eeloo.\u003C/p\u003E\u003Cp\u003EBob was supposed to return from Mun and take over the Duna project but the clutz broke the mun lander and is now stranded so my new mission is to rescue Bob.\u003C/p\u003E\n"},{"CreatedByName":"Mefi282","CreatedById":63817,"CreatedDateTime":"2013-08-08T07:57:39Z","Content":"\n\u003Cp\u003EI\u0027m making a Galileo like mission to visit all joolian Moons.\u003Cimg src=\u0022http://imageshack.us/photo/my-images/850/4mf1.jpg\u0022 alt=\u00224mf1.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-08-08T08:00:17Z","Content":"\n\u003Cp\u003EGot a few going right now. Manned mission on the way to Jool, manned mission on the way to Duna, rover \u002B satellites queued up for Moho, satellite queued up for Eeloo (both the Moho and Eeloo craft are in parking orbits), deciding what to send out for the Dres window, and I was about to send a small base to the Mun for Bob, Bill, and Jeb but I ran into the symmetry duplication bug which destroyed my craft file. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"petrichorAM","CreatedById":76235,"CreatedDateTime":"2013-08-08T08:22:41Z","Content":"\n\u003Cp\u003EJust started the Aquarius Project, the first manned (Kerbaled?) missions to the Mun. Aquarius I crewed by Bob Kerman is currently about 370K above the Mun preparing to retrograde into an stable orbit for a few fly-bys before coming home again (I\u0027ll post pics tonight when I\u0027m home and on KSP). Following this Jeb will be launched with Aquarius II to actually land on the Mun (previously landed a probe in preparation) so I\u0027m trying to convince myself that I can do it without smearing him across the surface!\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2013-08-08T08:49:42Z","Content":"\n\u003Cp\u003EJust reached Duna, sent 5 rockets in the same transfer window was kinda fun to manage, working on a few \u0022modular mobile base\u0022 \u002B some \u0022cool looking landing pad\u0022 and also some \u0022re-usable maned/unmaned rover \u002B skycrane \u002B inside system low orbit taxi to the different station/spaceship\u0022\u003C/p\u003E\u003Cp\u003EMore pict in my rocket company thread as soon as i get a full forum access to edit it.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/OzHTV\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-08-08T09:41:30Z","Content":"\n\u003Cp\u003EI have a few on the go:\u003C/p\u003E\u003Cp\u003E- Exploration of Duna. I have a team down there on a rover, rovering about when I feel like it. There\u0027s a bunch of mini-probes in orbit, too.\u003C/p\u003E\u003Cp\u003E- Eve orbital experimentation. There\u0027s a bunch of mini-probes in orbit around Eve and Gilly. I even smacked one into Eve to check how aerobraking worked.\u003C/p\u003E\u003Cp\u003E- Munbase. Got a couple of base modules down there, and a broken rover-base. The latest update ate the functional rover-base, so I\u0027m dropping another one there at some point.\u003C/p\u003E\u003Cp\u003E- Kerbed mission to Eve. I decided my Duna lander would work fine, so I\u0027m going to load it up and take it to Eve.\u003C/p\u003E\u003Cp\u003E- Minimus base.\u003C/p\u003E\u003Cp\u003E- Rescuing kerbals from orbit, the mun, and Duna. Later on, I\u0027ll do Eve as well.\u003C/p\u003E\u003Cp\u003E- Get a space station up. Since I can\u0027t into docking yet, I\u0027ll just assemble it on the ground, THEN blast it up.\u003C/p\u003E\u003Cp\u003EProposed:\u003C/p\u003E\u003Cp\u003E- Probe Dres\u003C/p\u003E\u003Cp\u003E- Probe the Joolian muns, and Jool itself.\u003C/p\u003E\u003Cp\u003E- Land kerbals on the above. Not on Jool, though.\u003C/p\u003E\u003Cp\u003E- Clear up Kerbin orbit of old craft.\u003C/p\u003E\n"},{"CreatedByName":"DrStrangeLug","CreatedById":67310,"CreatedDateTime":"2013-08-08T10:00:19Z","Content":"\n\u003Cp\u003EGetting ready for a crewed Duna expedition. \u003C/p\u003E\u003Cp\u003EOne large orange tank with 4 nuclear engines as the booster. This has a 6 way docking attachment on the end which is currently holding the lander, and will later hold the rover and a habitation module.\u003C/p\u003E\u003Cp\u003EI\u0027m hoping this booster can be re-used for other missions upon return Kerbin with the crew/bodies, perhaps to Jool\u0027s moons later on.\u003C/p\u003E\n"},{"CreatedByName":"PwnedDuck","CreatedById":54398,"CreatedDateTime":"2013-08-08T10:05:04Z","Content":"\n\u003Cp\u003EGet fuel out to Eeloo for my Eeloo and back mission. And since I\u0027m going that far, I\u0027m bringing a probe as well, to leave behind. Any interesting/reccomended places to land on Eeloo? I dot yet have the fuel to do it...\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-08-08T10:07:54Z","Content":"\n\u003Cp\u003ECurrently underway, a rescue mission to get my three intrepid explorers back who got stranded on Duna when their lander tore itself apart when the parachutes deployed.\u003C/p\u003E\u003Cp\u003EOn intercept orbits to Duna are 2 nerva powered tugs, one pushing a lander/return vehicle capable of carrying 5 Kerbins (crewed by one), the other pushing an orange fuel tank and a ****load of RCS fuel to refuel the return vehicle and its tug for the trip back to Kerbin.\u003C/p\u003E\u003Cp\u003EIn planning, a Kethane survey mission of the Duna/Ike system, first probes are launching, early design studies for the mining and processing facilities have started, which will be tested on the already surveyed Kethan deposits on the Mun and Minmus.\u003C/p\u003E\u003Cp\u003EThis in preparation for an eventual permanent station around Duna with regular exploration missions to the surface.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-08-08T10:22:03Z","Content":"\n\u003Cp\u003EMain mission now is an grand tour without refueling. Returning second stage from Moho to Eve where it will dock with first stage and burn for Duna, has 150 m/s dV left on second stage for adjusting for aerobraking and circulating. \u003C/p\u003E\u003Cp\u003EAfter Duna second stage does Dress first while first stage goes directly to Jool and wait in Laythe orbit.\u003C/p\u003E\n"}]}