{"TopicId":42220,"ForumId":32,"TopicTitle":"why is duna considered the easiest place to go to after kerbin and its moon?","CreatedByName":"THE META","CreatedById":76506,"CreatedDateTime":"2013-08-12T19:45:26Z","PageNum":1,"Articles":[{"CreatedByName":"THE META","CreatedById":76506,"CreatedDateTime":"2013-08-12T19:45:26Z","Content":"\n\u003Cp\u003Etitle says it all. I was trying to land a small probe on duna today, but every time I just failed. and after this happened several times, I thought, \u0027why in the name of jeb am I going to duna.\u0027 I thought this once I realised that duna Is probably the hardest atmospheric body orbiting the sun to land on. this is for a couple of reasons:\u003C/p\u003E\u003Cp\u003E1) it is the smallest atmospheric body orbiting the sun, meaning it has a small sphere of influence to aim for, meaning that you need the phase angle to be almost perfect and you could waste precious fuel making correction burns since you have a small window of time and delta-V to aim for. because of this I eventually had to resort to mech jeb phase angle readouts to get the correct time.\u003C/p\u003E\u003Cp\u003E2) Ike. it even says it on the Ike description. ike is in the perfect place and is the perfect size so that most times you will get a encounter with the troublesome moon. What\u0027s more, is its coin flip nature of the gravity assists it gives you. it can either leave you on exactly the same path you were on before, or try to fling you off back in to interplanetary space meaning you have to spend even more DV cancelling that out.\u003C/p\u003E\u003Cp\u003E3) this is the thing that finally caused me to rage quit trying to land on duna. its extremely thin atmosphere. unfortunately, duna has an extremely thin atmosphere. this means a lot of things. aerobraking requires you to go deep in to the atmosphere, parachutes may work however they will barely slow you down and in my experience just cause more problems than they solve, as you will still crash ans explode without engines, and you will have very little time to make the burn required when landing to stop yourself since you still going at considerable speed.\u003C/p\u003E\u003Cp\u003Eoverall that is why I think that duna is actually harder to go to than eve and even Jool in some respects. eve and jool both have nice, big SoI\u0027s to aim for, thick atmospheres to aerobrake, and in eves case parachute land with, and no pesky moons to throw your orbit off course (yes jools got 5 moons, but these are quite spread out and are mostly all small so they are easy to avoid.\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-08-12T19:54:05Z","Content":"\n\u003Cp\u003EIt requires very little dV to reach. Most good Mun/Minmus landers should be able to reach Duna. (In my experience)\u003C/p\u003E\n"},{"CreatedByName":"chri","CreatedById":62741,"CreatedDateTime":"2013-08-12T19:54:56Z","Content":"\n\u003Cp\u003Ewell let\u0027s analyze the other bodies...\u003C/p\u003E\u003Cp\u003Ethe Sun: what?\u003C/p\u003E\u003Cp\u003EMoho: tilted orbit, small SOI (smaller than Duna) no atmosphere, overheating\u003C/p\u003E\u003Cp\u003EEve: not difficult to land on, impossible to take off, plus there are oceans that can screw up your landing\u003C/p\u003E\u003Cp\u003EGilly: minuscule SOI, tilted orbit\u003C/p\u003E\u003Cp\u003EDres: small SOI (smaller than Duna) no atmosphere to aerobrake\u003C/p\u003E\u003Cp\u003EMoons of Jool: require a lot of dV to get to, many have a small SOI and only one of them has an atmosphere, some of them are just a pain to land on, like Tylo\u003C/p\u003E\u003Cp\u003EEeloo: easy to land on but requires a lot of dV to get to\u003C/p\u003E\u003Cp\u003Ein conclusion Duna doesn\u0027t require a lot of dV to get to, has an atmosphere that can slow you down and help your landing a lot (I landed on Duna only with parachutes many times), has no oceans, has a quite low gravity and it\u0027s easy to take off\u003C/p\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-08-12T19:57:09Z","Content":"\n\u003Cp\u003EDuna doesn\u0027t have much inclination compared to Eve, which means even at its \u0022highest\u0022 and \u0022lowest\u0022 points, you can still get the encounter. It is still very possible to aerobrake at Duna. At most, you only need to go down to 10 km, and there aren\u0027t many points that get up to that height. Also, once you land, Duna is quite easy to return from, but Eve on the other hand...\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-08-12T19:57:43Z","Content":"\n\u003Cp\u003EI think if it\u0027s a one way trip, you\u0027re probably correct. Getting home from Duna is easier than Jool or Eve if for nothing else than the dV requirements.\u003C/p\u003E\u003Cp\u003EYou can land on Duna with nothing but parachutes if your craft is light enough.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dvB9kSX.jpg\u0022 alt=\u0022dvB9kSX.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-08-12T20:02:28Z","Content":"\n\u003Cp\u003EPeople generally like going back.\u003C/p\u003E\u003Cp\u003EIf you just want to land a probe Eve is easier, no need for a powered landing and a nice thick atmosphere for aerocapture.\u003C/p\u003E\u003Cp\u003EDuna is best if you\u0027re trying round trips, it is cheap to get to, cheap to get back from and it even helps you a bit with the atmosphere and Ike (provided you properly use Ike).\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2013-08-12T20:10:25Z","Content":"\n\u003Cp\u003EI find that drogue parachutes are invaluable for Duna. They deploy much higher up than the standard \u0027chutes and slow you down quite considerably, although obviously you need more than just those to land. Unfortunately, my latest mission had no room for drogues, which is why I\u0027d like to see radial drogue \u0027chutes \u003Cem\u003Every\u003C/em\u003E soon...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Devs, take the hint!)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOtherwise, it requires relatively little delta-v to go there, maybe 300m/s more than going to Mun. I heard once that if you make a craft that can land and return from Mun, then it can make a one-way trip to Duna. Sure, you have to delve deeper into the atmosphere than the other atmospheric world\u0027s but what trouble is that other than if that huge new mountain is in the way (can\u0027t wait to see if that actually happens, to me or someone else \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)? Landing should use drogue \u0027chutes, like I said, and 2 LV-909 engines should suffice for a decently sized ship, if you plan to return to orbit. Lift-off isn\u0027t hard, maybe about as tough as Vall. Just go about it like you would with Mun. Then it\u0027s plain sailing back to Kerbin \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for Ike, just compensate, really. Use RCS if it has a decent effect on your trajectory.\u003C/p\u003E\u003Cp\u003EThat\u0027s all I can think of for now.\u003C/p\u003E\n"},{"CreatedByName":"THE META","CreatedById":76506,"CreatedDateTime":"2013-08-12T20:23:21Z","Content":"\n\u003Cp\u003EI seem to have not emphasised what type of mission I was doing. I honestly have no doubts that duna is the best place to get off of and go back to kerbin with, nor do I have any problems with the DV it needs, in my experience my things become in efficient because I have too much Dv, because I still have lots of fuel left over by the time I ditch the transfer stage. my problems with it is its ridiculously thin atmosphere making it hard to land on (however I only had 4 parachutes o the thing, so a drogue chute and some more main chutes may work), and its small SoI which makes setting up encounters a very fiddly and sensitive process. however for this thread i\u0027m mainly talking about probe landers as I really had no intention of returning with this mission, otherwise I would have a more complicated set up. also, I don\u0027t really see what you mean by how jool takes kigh amounts of DV to reach, because as you push your AP up, it requires less speed increase to push it higher, and as I\u0027ve already said, i\u0027m am in no way low on DV for my rockets.\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2013-08-12T20:25:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RogueMason\u0022 data-cite=\u0022RogueMason\u0022\u003E\u003Cdiv\u003EI find that drogue parachutes are invaluable for Duna. They deploy much higher up than the standard \u0027chutes and slow you down quite considerably, although obviously you need more than just those to land. Unfortunately, my latest mission had no room for drogues, which is why I\u0027d like to see radial drogue \u0027chutes \u003Cem\u003Every\u003C/em\u003E soon...\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Devs, take the hint!)\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/45361-Radial-mounted-drogue-chute!?highlight=radial\u002Bdrogue\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/45361-Radial-mounted-drogue-chute!?highlight=radial\u002Bdrogue\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-08-12T20:32:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DChurchill\u0022 data-cite=\u0022DChurchill\u0022\u003E\u003Cdiv\u003EYou can land on Duna with nothing but parachutes if your craft is light enough.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat picture, sir, looks ridiculously awesome!!\u003C/p\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2013-08-12T20:36:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DChurchill\u0022 data-cite=\u0022DChurchill\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/45361-Radial-mounted-drogue-chute!?highlight=radial\u002Bdrogue\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/45361-Radial-mounted-drogue-chute!?highlight=radial\u002Bdrogue\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh...\u003C/p\u003E\u003Cp\u003EThank you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wilt57","CreatedById":64653,"CreatedDateTime":"2013-08-12T20:54:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022THE META\u0022 data-cite=\u0022THE META\u0022\u003E\u003Cdiv\u003EI seem to have not emphasised what type of mission I was doing. I honestly have no doubts that duna is the best place to get off of and go back to kerbin with, nor do I have any problems with the DV it needs, in my experience my things become in efficient because I have too much Dv, because I still have lots of fuel left over by the time I ditch the transfer stage. my problems with it is its ridiculously thin atmosphere making it hard to land on (however I only had 4 parachutes o the thing, so a drogue chute and some more main chutes may work), and its small SoI which makes setting up encounters a very fiddly and sensitive process. however for this thread i\u0027m mainly talking about probe landers as I really had no intention of returning with this mission, otherwise I would have a more complicated set up. also, I don\u0027t really see what you mean by how jool takes kigh amounts of DV to reach, because as you push your AP up, it requires less speed increase to push it higher, and as I\u0027ve already said, i\u0027m am in no way low on DV for my rockets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor a simple one-way landing, Eve is the easiest. Most people say Duna is the easiest because most people want to land on and return. Returning from Eve\u0027s surface is the toughest thing in the game. Even if it\u0027s just a go to, orbit, and return, Duna is easier than Eve from a fuel perspective. Since you have no lack of D-V, this is not important to you. I have little trouble landing on Duna, but I also perform parachute-less, powered landings. I view the presence of an atmosphere only beneficial when aerobraking to close my orbit. Jool is only another 800 D-V or so farther than Duna, but you can\u0027t land on Jool. Transferring from Jool to Laythe takes another 1600 D-V though, so to land in the Jool \u003Cem\u003Esystem\u003C/em\u003E takes roughly 2400 D-V more than Duna and that\u0027s with taking most advantage of aerobraking.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-08-12T20:55:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DChurchill\u0022 data-cite=\u0022DChurchill\u0022\u003E\u003Cdiv\u003EYou can land on Duna with nothing but parachutes if your craft is light enough.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. \u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/1c88ka/weekly_challenge_reduce_reuse_recycle/\u0022 rel=\u0022external nofollow\u0022\u003EOne of the reddit challenges\u003C/a\u003E was to go to a different planet, land with parachutes without using engines at all from the time you enter the atmosphere, take off, get back to Kerbal, and land with the same parachutes, again without using engines. Hmmm... now that I think about it, without using engines may have been hard mode. Yup, found the challenge and checked the info, and linked to it.\u003C/p\u003E\u003Cp\u003EI did super hard mode, which was all of that with Deadly Reentry installed. I used a pretty small lander, but landing was easy. My attempt was documented \u003Ca href=\u0022http://imgur.com/a/8CXek\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ENow, the reason I describe this is that because I wanted to include that challenge in the 50th weekly challenge, for which hard mode was to do eight of the prior challenges. My plan was to do eight hard mode challenges (still haven\u0027t completed that, but I haven\u0027t given up yet). Well, my testing was... interesting. Since the lander weighed quite a bit more, even with many more parachutes, I just couldn\u0027t land the lander strictly on parachutes. In fact, that\u0027s the current sticking point on that mission, I still haven\u0027t found a way to land that lander that doesn\u0027t involve either using engines or having parts yanked off when the parachutes deploy.\u003C/p\u003E\u003Cp\u003ETLDR: Duna is still pretty easy as long as you\u0027re not trying to land a heavy lander, though yes, Eve would be easier. Still, I\u0027d say that Eve is the only planet easier to land a probe on than Duna is.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T20:57:43Z\u0022 title=\u002208/12/2013 08:57  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by Eric S\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JakeGrey","CreatedById":61242,"CreatedDateTime":"2013-08-12T20:58:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RogueMason\u0022 data-cite=\u0022RogueMason\u0022\u003E\u003Cdiv\u003EI find that drogue parachutes are invaluable for Duna. They deploy much higher up than the standard \u0027chutes and slow you down quite considerably, although obviously you need more than just those to land. Unfortunately, my latest mission had no room for drogues, which is why I\u0027d like to see radial drogue \u0027chutes \u003Cem\u003Every\u003C/em\u003E soon...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends how much weight you\u0027re trying to land. A drogue chute can bring a three-Kerbal capsule down in one piece on Kerbin, and the thinner air and the lower gravity probably even out a bit. Rover wheels have quite high impact tolerance too.\u003C/p\u003E\n"},{"CreatedByName":"THE META","CreatedById":76506,"CreatedDateTime":"2013-08-12T20:59:30Z","Content":"\n\u003Cp\u003Ethanks guys for the opinions and tips, these will help me a lot, and the discussions been good as well. thanks!\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2013-08-12T21:17:05Z","Content":"\n\u003Cp\u003EDuna is the easiest place to do a return trip by far.\u003C/p\u003E\u003Cp\u003ELets look at the facts. \u003C/p\u003E\u003Cp\u003EWhile it has a small SOI, it is almost exactly in plane with Kerbin. So much so that an equatorial escape trajectory will always intercept Duna\u0027s SOI providing you launched at the right time. Barely any need for a plane change. \u003C/p\u003E\u003Cp\u003EIt has an atmosphere to aerobrake so you don\u0027t have to bring loads of extra fuel like you would for Moho. \u003C/p\u003E\u003Cp\u003EHowever, this atmosphere is thin enough to barely affect ascent again, unlike Eve which is next to impossible to take off from. \u003C/p\u003E\u003Cp\u003EIke can be irritating, but requires very small velocity changes to avoid, and gives you something nice to look at from the surface.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-08-12T22:40:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JakeGrey\u0022 data-cite=\u0022JakeGrey\u0022\u003E\u003Cdiv\u003EDepends how much weight you\u0027re trying to land. A drogue chute can bring a three-Kerbal capsule down in one piece on Kerbin, and the thinner air and the lower gravity probably even out a bit. Rover wheels have quite high impact tolerance too.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell Duna\u0027s problem is thus: It has about 1/3rd the gravity, but only 1/5th of the atmosphere. At Datum. It\u0027s also covered in multi-KM highland plateaus, so landing at 3KM is not uncommon. At 3KM, the atmospheric pressure is well under half what it is at Datum.\u003C/p\u003E\u003Cp\u003ESo Not only does the gravity not entirely compensate for the thinner atmosphere, there\u0027s large areas of the surface where it doesn\u0027t even CLOSE to compensate. Parachutes work better if you can hit one of the lowlands, but they still work less well than on Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-08-12T23:05:25Z","Content":"\n\u003Cp\u003EWhile Duna is by far the easiest place to land and return from it has the least launch windows during the year of any other planet, at least according to the plots I\u0027ve run for year one. I should probably count them but that\u0027s what I remember anecdotally.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2013-08-12T23:14:19Z","Content":"\n\u003Cp\u003EIt has the same inclination and dosent require that delta v if you set the encounter right.\u003C/p\u003E\u003Cp\u003EAlso you are wrong about the atmosphere. If you do a proper aerobrake you can kill all your speed without using a single engine and if you land at 3000meters~ or below you can land pretty much anything using just parachutes. I have landed large colony modules in one go like a big module with 100 habitat modules, fuel module with several large tanks, a full and mobile emergency return rocket that can get you all the way back to kerbin and a full sized bus.\u003C/p\u003E\u003Cp\u003EAnd the thin atmosphere makes landing so much easier than on a atmopshere less moon where you have to kill your horizontal velocity.\u003C/p\u003E\u003Cp\u003EOnce I have an encounter i often get away with less than 100m/s and sometimes even less than 50m/s to get my periapsis low enough for a aerobrake.\u003C/p\u003E\n"},{"CreatedByName":"Maddmatts","CreatedById":21071,"CreatedDateTime":"2013-08-12T23:34:12Z","Content":"\n\u003Cp\u003ENow you know why the failure rate on Mars rovers are so high. To paraphrase a JPL engineer, it has enough of an atmosphere that you can\u0027t ignore it, but too little to depend on it alone to slow you down.\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-08-12T23:53:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maddmatts\u0022 data-cite=\u0022Maddmatts\u0022\u003E\u003Cdiv\u003ENow you know why the failure rate on Mars rovers are so high. To paraphrase a JPL engineer, it has enough of an atmosphere that you can\u0027t ignore it, but too little to depend on it alone to slow you down.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat or they program the rover in feet and you use meters....\u003C/p\u003E\u003Cp\u003EOk I know that was technically an orbiter but it just wouldn\u0027t feel right not making that reference here.\u003C/p\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2013-08-13T00:13:37Z","Content":"\n\u003Cp\u003EI\u0027m gonna just admit my unsolvable problem. Every single time I try to land on Duna it ends in failure. Never once have I managed to touchdown without destroying my rocket. Yet I can pull off a single stage to Laythe and various other methods of getting there without fail. I just figured that the Kraken left some sort of trap surrounding Duna and after numerous attempts I ditched it and stopped sending missions there all together.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-08-13T00:46:22Z","Content":"\n\u003Cp\u003EI use the power assisted model for Duna landings. I am dong a lot of remote station work with Kethane, and extraplentary right now, so dropping anywhere from 5-25 tonnes at a landing. The biggest problem I am having lately is getting my more imaginative vessels balanced for landing. (I am really hating the smelter)\u003C/p\u003E\u003Cp\u003ELike most said a standard lunar lander should make it... less power neede during final aproach and wait for the chutes to open. \u003C/p\u003E\u003Cp\u003ESome things to remember tho...\u003C/p\u003E\u003Cp\u003E1) Duna is bouncey... kill your speed to less then 5 m/s then kill the engines and drop the last bit. Forget the kill em and you will flip/bounce/random thing and possibly die\u003C/p\u003E\u003Cp\u003E2) repack your chutes before you get home... Trying to repack them while in your deorbit is chancey and a little nerve racking\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-08-13T01:36:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbonautical\u0022 data-cite=\u0022Kerbonautical\u0022\u003E\u003Cdiv\u003EI\u0027m gonna just admit my unsolvable problem. Every single time I try to land on Duna it ends in failure. Never once have I managed to touchdown without destroying my rocket. Yet I can pull off a single stage to Laythe and various other methods of getting there without fail. I just figured that the Kraken left some sort of trap surrounding Duna and after numerous attempts I ditched it and stopped sending missions there all together.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy probe, 1.8 tons, has had no problems landing either with legs or directly on the RCS fuel tank. I use a pair of radical chutes that deploy as drogues then open full. I do have to use thrusters to kill some orbital speed prior to the full chutes deploying, and a small burst to slow at the last second before touchdown. So far, 100% success with parachutes. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JoR7qzE.jpg\u0022 alt=\u0022JoR7qzE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/er9UPJ2.jpg\u0022 alt=\u0022er9UPJ2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Gqck0pN.jpg\u0022 alt=\u0022Gqck0pN.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2013-08-13T02:02:10Z","Content":"\n\u003Cp\u003EA question for those who have issues landing with just parachutes.. What is the periapsis you use for aerobraking?? In my experience the sweet spot is between 12-15k. Anything lower will in my experience not work as well and anything higher might result it in you just skipping the atmosphere and then escaping.\u003C/p\u003E\u003Cp\u003EI usually even ditch my engines before i go for the landing and still mostly have success. I also find that it is very important to add some extra drogue chutes or else the main parachutes might snap when they deploy.\u003C/p\u003E\u003Cp\u003EOh and actually using engines to help kill horizontal velocity when doing aerobraking i also find screws it up, as on duna with such thin atmosphere you want to stay in the atmosphere as long as possible. If you do 12-15k i will usually start going up a bit before i come down giving it time to slow down even further when i get back down to 12-15k.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-13T02:04:11Z\u0022 title=\u002208/13/2013 02:04  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 13, 2013\u003C/time\u003E by boxman\u003C/strong\u003E\n\u003C/span\u003E\n"}]}