{"TopicId":42417,"ForumId":32,"TopicTitle":"Would you buy expansion packs for KSP? How much?","CreatedByName":"ngianoplus","CreatedById":63039,"CreatedDateTime":"2013-08-14T02:07:14Z","PageNum":2,"Articles":[{"CreatedByName":"1of6Billion","CreatedById":46191,"CreatedDateTime":"2013-08-14T06:49:06Z","Content":"\n\u003Cp\u003ESince KSP has a very moddable nature, I doubt paid DLC\u0027s are an option.\u003C/p\u003E\u003Cp\u003EThen again: \u003C/p\u003E\u003Cp\u003EPyama textures for space suit ($0,99) -- No No No\u003C/p\u003E\u003Cp\u003EGalaxy Pack - Add 100\u0027s of stars and planets ($14,99) -- Hell yeah!\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-08-14T06:52:25Z","Content":"\n\u003Cp\u003EThis is an impossible question to answer without knowing what the DLC would entail. If it was a few new parts $5, if they added 4 new planets, 5 moons and a slew of new parts, i\u0027d pay $30-$50\u003C/p\u003E\n"},{"CreatedByName":"Jacob01","CreatedById":61842,"CreatedDateTime":"2013-08-14T08:02:38Z","Content":"\n\u003Cp\u003EIt depends what is in it. If it contained lots of new content to the game, I\u0027d happily pay over $30 for it, as $30 isn\u0027t that much really when you use GBP as your currency. Obviously, I wouldn\u0027t pay that much if it was just a few parts. \u003C/p\u003E\u003Cp\u003EI think I am in the category which gets it for free anyway.\u003C/p\u003E\n"},{"CreatedByName":"trbinsc","CreatedById":10144,"CreatedDateTime":"2013-08-14T08:17:41Z","Content":"\n\u003Cp\u003EI think I remember reading that expansions would be things that are significant gameplay changes, and not just content packs. Examples could be interstellar travel, extremely detailed science, like cellular astrobiology, or something that adds space elevators, mass drivers, and other semi-near future tech. Things that let the game be played in ways it wasn\u0027t able to before. I would certainly pay 30 dollars or more for something that adds a whole new dimension of gameplay, even if I\u0027m getting the expansions free already. I don\u0027t think enough people realize that Squad is a really good company, who cares about the community and won\u0027t jump at any new opportunity to make a buck or two. They wouldn\u0027t do anything that benefits them more than it benefits the community.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-08-14T11:40:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PDCWolf\u0022 data-cite=\u0022PDCWolf\u0022\u003E\u003Cdiv\u003EIt would be even worse if it was multiplayer.\u003Cp\u003EStill, they would be supporting the DLC/Expansion pack culture I talked about before.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExpansion pack culture is nothing new though. I don\u0027t have a problem with it myself, although my idea of an expansion pack is e.g. the Lord of Destruction expansion for Diablo 2. The original game was complete and fun to play in itself but the expansion added a huge amount of new content, game mechanics and better resolution graphics. I don\u0027t have any issues paying extra for that and I think it\u0027s a bit harsh to lump it in with DLC as a \u0027cancer on the video game industry\u0027\u003C/p\u003E\u003Cp\u003EFor KSP - you bet I\u0027d pay for expansions (although I won\u0027t need to) I\u0027ve had a ridiculous amount of fun with this game already, I still have tons left that I want to do and that to do list is only going to get longer. In terms of \u0027hours of fun to money spent\u0027 KSP is one of the best things I\u0027ve ever bought, so I\u0027d have no problems at all shelling out for expansions whether I technically needed them or not. \u003C/p\u003E\u003Cp\u003EHeck, if Squad did a nice box set special edition version of the current game (once it\u0027s finished of course \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ), I\u0027d probably buy that too.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-08-14T11:58:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketPilot573\u0022 data-cite=\u0022RocketPilot573\u0022\u003E\u003Cdiv\u003EI would, but I bought KSP before May 1st of 2013.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (I believe anyone who bought it before then are entitled to get any expansions for free)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExpansions are not the same as updates. Expansions can either be provided by the original publisher, or by a third party.\u003C/p\u003E\u003Cp\u003EThe success of such payware VS the mods currently available for no charge, will depend on its quality, copyrights, licensing agreements, and fee charged.\u003C/p\u003E\u003Cp\u003EWe should all give thanks to the hard work currently being done by the modding community in providing quality work to the KSP community at no charge.\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-14T12:05:07Z","Content":"\n\u003Cp\u003E\u003Cem\u003EA monk asked: \u0022Does a dog have Buddha-nature?\u0022 The master replied: \u0022Mu!\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThat is, the question is meaningless. We need more context. What\u0027s in the expansion pack? How big is it? When is it being released? Rational consumers use this information to make their choices. I wouldn\u0027t buy an expansion pack now, because Kerbal Space Program is clearly unfinished and such content would no doubt fit in the core game. But I might buy one in the future, after KSP is well-developed. But not if it added only cosmetic changes, it would have to add either a significant extra peripheral value, or make important changes to the core game.\u003C/p\u003E\n"},{"CreatedByName":"skyace65","CreatedById":71431,"CreatedDateTime":"2013-08-14T12:41:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EIt\u0027s hard to imagine what an expansion for KSP would even have at this point, since we don\u0027t even have a definite lock on what the game will feature in the near future. You should probably ask this again once Career mode is fleshed out enough that we have actual missions we can run...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe devs have said one thing that they might eventually do in an expansion pack is colonization. which i would pay 15 or 20 dollars for.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T15:07:58Z\u0022 title=\u002208/14/2013 03:07  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by skyace65\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-08-14T13:02:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022skyace65\u0022 data-cite=\u0022skyace65\u0022\u003E\u003Cdiv\u003Ewhich i would \u003Cstrong\u003Edefiantly\u003C/strong\u003E pay 15 or 20 dollars for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou rebel, you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xorth Tanovar","CreatedById":71205,"CreatedDateTime":"2013-08-14T13:02:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSK\u0022 data-cite=\u0022KSK\u0022\u003E\u003Cdiv\u003EIn terms of \u0027hours of fun to money spent\u0027 KSP is one of the best things I\u0027ve ever bought\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed, given the amount of time I\u0027ve already spent; I had absolutely no problem with handing over my $23 to get the full game once I tried the demo.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHeck, if Squad did a nice box set special edition version of the current game (once it\u0027s finished of course \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ), I\u0027d probably buy that too.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETempting idea....\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-08-14T13:26:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PDCWolf\u0022 data-cite=\u0022PDCWolf\u0022\u003E\u003Cdiv\u003ENot paying more than $5 for something they decided to leave outside the main game. DLC (even if cosmetic) culture is part of the cancer killing videogames.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey finish the game... FINISH... They then sell it. Then they do more work and add to the game and off it as DLC. How is that deciding to leave it out of the game.\u003C/p\u003E\u003Cp\u003EI\u0027m sorry but the whole \u0022The companies are just money grabbing whoosits\u0022 is all due the journalists out to cause a sensation. Not every company is like Activision after all. Too many gamers want lots more stuff and expect it to be free because it is supposed to be part of the game. DLC (the way it was meant to be) is not a cancer but giving added stuff to games you love. If you don\u0027t want to pay for it then there is nothing forcing you.\u003C/p\u003E\u003Cp\u003ENow what I DO think should be free are things like skins. Also microsoft charging for things like Avatar skins and gamer pictures is just ripoff city because they don\u0027t let you do it yourself. Now look at KSP and the sheer amount of mod stuff already out there is amazing. If Squad charge for something it\u0027s going to have to be something that makes the mods look like kindergarden toys. \u003C/p\u003E\u003Cp\u003EOh yeah, and I should get the expansions for free too... but I\u0027m not going to. I\u0027m going to pay for them because supporting small development companies like Squad is what will help make the games market that much more diverse. We need new stuff like KSP... There are too many like FishyShootemup 14 or AssASSinator 27. If a game is good they should make it for about 3 times and then do something a bit different to keep the customers interested.... not just make the same game with new skins.\u003C/p\u003E\u003Cp\u003ESo yeah... who else is going to back me in paying for the expansions even though they don\u0027t need to?\u003C/p\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2013-08-14T13:32:45Z","Content":"\n\u003Cp\u003EI think some studios/publishers use expansion packs and DLC as a way to maximize profits, and little else. For example, I suspect that the multiple expansions for Civ 3 and Civ 4 could\u0027ve probably been combined into fewer packages than were sold. I was mildly irrirated by this. This irritation, combined with not liking what I heard about the game led me to never bother with Civ 5.\u003C/p\u003E\u003Cp\u003EBut I don\u0027t get the impression Squad (at this stage) are prone to operate that way. They are incredibly open with their users/customers and it seems like in addition to being gifted game designers and business men, they are true-blue gamers, who wouldn\u0027t want to rip off their fellow gamers.\u003C/p\u003E\u003Cp\u003EI think you\u0027ve got to judge these things on a case by case basis. Some DLC/expansions are suspect of profiteering, some aren\u0027t. In the case of Squad I\u0027d probably buy any expansion or DLC they sell. In the case of some other studios/publishers, I\u0027d be skeptical if not rejecting of such a prospect.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-08-14T13:43:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Diche Bach\u0022 data-cite=\u0022Diche Bach\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI think you\u0027ve got to judge these things on a case by case basis. Some DLC/expansions are suspect of profiteering, some aren\u0027t. In the case of Squad I\u0027d probably buy any expansion or DLC they sell. In the case of some other studios/publishers, I\u0027d be skeptical if not rejecting of such a prospect.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESquad = Yup... Would buy anything from these guys\u003C/p\u003E\u003Cp\u003EActivision = Pretty Gun Skins for COD? ARE YOU KIDDING ME? \u003Ca href=\u0022http://www.callofduty.com/blackops2/dlc/micro-items\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.callofduty.com/blackops2/dlc/micro-items\u003C/a\u003E \u0026lt;- These look like a 3 year old did them and they expect people to BUY them? And morons actually do buy them.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-08-14T13:49:31Z","Content":"\n\u003Cp\u003EI bought KSP in June. So, no, I\u0027m not fond of the idea of buying expansion packs while others get them free; simply because I missed the \u0022cut off\u0022 time by less than a month.\u003C/p\u003E\u003Cp\u003EThat said, I expect KSP 1.0 to be such a great game (it already is) with so much to do, that I\u0027ll not feel the need for expansion packs.\u003C/p\u003E\u003Cp\u003EI don\u0027t buy expansion packs for other games either.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T13:56:30Z\u0022 title=\u002208/14/2013 01:56  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by Dispatcher\u003C/strong\u003E\n\u003Cbr\u003ETo show that I think KSP is cool anyway.\n\u003C/span\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-08-14T13:50:03Z","Content":"\n\u003Cp\u003EI more than likely wouldn\u0027t buy it. Not because of some hatred of expansion packs or DLC mind you, I just don\u0027t really stick with games that have expansions long enough, though I do tend to return to them for a bit here and there. \u003C/p\u003E\u003Cp\u003ESims are the perfect example of this. I have the sims 3, as well as a half dozen expansions to it, the expansions were a complete waste of money on my part because they really just added new versions of the same old stuff with a few new things to do. Even now when I decide I want to play it again I don\u0027t go through and install World Adventures or Night Life or Ambitions again, I just play off the base game for a few weeks and drop it again.\u003C/p\u003E\u003Cp\u003EWith that said, the only way to get me to actually buy an expansion for KSP was if it incorporated a good number of the mods that I like into the game, and if I were no longer able to use those mods. As it is now I say why buy the expansion when I could just download NovaPunch?\u003C/p\u003E\u003Cp\u003EI am also with Dispatcher who would not be fond of the idea of buying an expansion pack because I started playing a month after the cutoff.. \u003C/p\u003E\u003Cp\u003EThat said I would buy an expansion if it were cheap ($5-$10) and added one thing, another solar system that I could reach that had some form of non-kerbal life on it. That to me would possibly be worth it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T13:52:06Z\u0022 title=\u002208/14/2013 01:52  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by annallia\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"damny","CreatedById":78621,"CreatedDateTime":"2013-08-14T14:39:13Z","Content":"\n\u003Cp\u003EOf course I would buy expansions. I bought the game so there\u0027s a precedent for me buying KSP content. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t know how useful it is to base this decision on the price tag alone. I don\u0027t really care about the price tag, I care about the kind of content in the expansion.\u003C/p\u003E\n"},{"CreatedByName":"Stratoroc","CreatedById":73987,"CreatedDateTime":"2013-08-14T14:49:03Z","Content":"\n\u003Cp\u003EI would pay anything around $30 or somewhat more for an expansion pack on the condition that is implements core mechanics that mods cannot provide. Really, I consider paying for an expansion funding a project to implement some of the favored \u0022don\u0027t bother asking, we\u0027re not doing it\u0022 features, terraforming, alien species and the like.\u003C/p\u003E\n"},{"CreatedByName":"Feldynn","CreatedById":64102,"CreatedDateTime":"2013-08-14T15:05:02Z","Content":"\n\u003Cp\u003EFor me cost is usually a secondary factor when deciding on expansion packs / DLC, first and foremost I\u0027m interested in what an expansion is bringing to the game. Be it just a content pack, new core features and gameplay elements or something else, if it brings something I\u0027m interested in then I\u0027ll look at the price and determine if it\u0027s worth me buying.\u003C/p\u003E\n"},{"CreatedByName":"skyace65","CreatedById":71431,"CreatedDateTime":"2013-08-14T15:07:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003EYou rebel, you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Espelling fail xD, I\u0027ll show myself the door....\u003C/p\u003E\n"},{"CreatedByName":"AfailingHORSE","CreatedById":57657,"CreatedDateTime":"2013-08-14T15:11:45Z","Content":"\n\u003Cp\u003EIf I had too pay (barely got in, bought the full version in late April), it would have to be no more the $10 for me too pay without thinking for KSP, they would really have to sell it at $15, anything more, I might as well buy a new game.\u003C/p\u003E\n"},{"CreatedByName":"Rainbow-Dashie","CreatedById":76160,"CreatedDateTime":"2013-08-14T15:24:24Z","Content":"\n\u003Cp\u003EIf the DLC included something actually fun and useful, like new planets/moons, a ton of new parts, or resources or something, I would be willing to spend about 10 to 15 bucks (not spending more $ on a DLC then i did the actual game).\u003C/p\u003E\u003Cp\u003EIf it were something like, edit kerbal\u0027s spacesuits! I wouldn\u0027t buy it... (unless if it was dirt cheap, at like 3 dollars)\u003C/p\u003E\n"},{"CreatedByName":"Vedexent","CreatedById":74320,"CreatedDateTime":"2013-08-14T15:27:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bigdad84\u0022 data-cite=\u0022bigdad84\u0022\u003E\u003Cdiv\u003EI\u0027m also in the same category... But if it ever happened, I would pay money \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E to support the devs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. I bought the game off the website way back when. I also bought it again on Steam rather than transferring it - mostly because I want to support the game, and hey - it\u0027s ~$20, it\u0027s not like buying a $70 AAA title multiple times.\u003C/p\u003E\u003Cp\u003ESo, yes - I\u0027d pony up $$ for expansions.\u003C/p\u003E\u003Cp\u003EEDIT: I also wonder how many of the \u0022not over $10\u0022 and \u0022No\u0022 crowd still want Squad to implement \u0022new feature X\u0022 for free, on the next release. TANSTAAFL, people.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T15:31:43Z\u0022 title=\u002208/14/2013 03:31  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by Vedexent\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dravin","CreatedById":77089,"CreatedDateTime":"2013-08-14T15:38:53Z","Content":"\n\u003Cp\u003EHow much I\u0027m willing to pay for DLC or an expansion is dependent on the content. I went ahead and voted $30, simply because I would be willing to pay $30 \u003Cem\u003Eif\u003C/em\u003E the content was right. Don\u0027t ask me what content is worth paying $30 as I don\u0027t have anything in mind.\u003C/p\u003E\n"},{"CreatedByName":"roosterr","CreatedById":61317,"CreatedDateTime":"2013-08-14T20:23:45Z","Content":"\n\u003Cp\u003EI voted no, BUT, if you had to pay for Mechjeb or a similar computer guidance system (like real-life rockets use), I would do that. I hope that Mechjeb or somthing like it becomes a stock part on full release. Otherwise do I want the challenge of what the developers have to offer us OTB.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2013-08-14T20:53:04Z","Content":"\n\u003Cp\u003EThis is a bit delicate topic, because (from obvious reasons) Dev\u0027s won\u0027t even start to consider releasing any expansion for KSP before having an complete game... it\u0027s just too early for speculation like that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E.\u003C/p\u003E\u003Cp\u003EIt\u0027s like asking for movie sequel before first movie will be projected in cinemas...\u003C/p\u003E\u003Cp\u003EHypothetically, if in some far and undetermined future KSP II or big expansion would be announced I don\u0027t see any other choice than buy it, but it\u0027s just me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T21:01:33Z\u0022 title=\u002208/14/2013 09:01  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"}]}