{"TopicId":44750,"ForumId":32,"TopicTitle":"Weird thing that makes KSP temporarily use *vastly* less RAM","CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-02T20:47:25Z","PageNum":1,"Articles":[{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-02T20:47:25Z","Content":"\n\u003Cp\u003EOkay, so I was in the middle of an atmospheric flight when I had to leave for my Grandmother\u0027s for Memorial Day stuff. So I suspend my system (Windows 7, used \u0027sleep\u0027, I still haven\u0027t turned Hibernate back on since I got a new hard drive), and today I get home, bring it back up, recommence my flight, chatting with people on IRC. Get to talking about Mapsat using tons of memory to load the maps. I go to check my Memory Usage.\u003C/p\u003E\u003Cp\u003E~800,000 KB. Wait what?\u003C/p\u003E\u003Cp\u003EKSP has used ~2,400,000 as long as I can remember. Lately it\u0027s been a bit higher, probably because I started using Modular Multiwheels fairly recently. During specific checks I\u0027ve found levels in the neighborhood of 1,800,000-1,900,000 without a mapsat module or 2,500,000-2,600,000 with a mapsat module. Suddenly it\u0027s using a QUARTER of that. After I land, I go back to the SPH and load a new craft, it climbs. To ~1,800,000. I go back into the SPH, put a mapsat dish on it, and reload. About ~1,900,000.\u003C/p\u003E\u003Cp\u003ESo I test it by leaving a plane sitting on the runway and suspend-\u0026gt;unsuspend again. It comes back up using ~380,000(less at first, it climbed pretty quickly once I started doing stuff.) Something in the process of suspending and unsuspending windows is unloading massive amounts of KSP\u0027s data from RAM. And it is to all appearances COMPLETELY FUNCTIONAL that way!\u003C/p\u003E\u003Cp\u003EOne thing that DOESN\u0027T change is the \u0027Commit size\u0027, which according to Microsoft is just the memory that\u0027s allocated to the program. Which makes sense, it\u0027s obviously not something that\u0027s intentional, so it makes sense that it\u0027d still be requesting the same amount of memory as normal, even though it\u0027s suddenly and mysteriously not using anywhere near that much.\u003C/p\u003E\u003Cp\u003EI don\u0027t know how useful it actually is (the commit is still just as high as normal, and you\u0027re still going to spike during the loads), but it does seem like it has some potentially interesting implications.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2013-09-02T20:51:55Z","Content":"\n\u003Cp\u003EI\u0027ve also noticed that when you have lagsbane turned ON when on launchpad you can just do 4x physics accelerate and then back to 1x the slowness magically disappears!\u003C/p\u003E\n"},{"CreatedByName":"Brofessional","CreatedById":2080,"CreatedDateTime":"2013-09-02T21:02:41Z","Content":"\n\u003Cp\u003EWindows 7 uses superfetching.\u003C/p\u003E\u003Cp\u003EHaving idle RAM is just a waste, so it keeps recently accessed data in the RAM in-case you access it again. If another program comes along and needs the space, it will dump the superfetched data to make room.\u003C/p\u003E\u003Cp\u003EWhen you sleep/hibernate or shutdown, it dumps the data. So as you mentioned, it climbs back up again after you resume play.\u003C/p\u003E\u003Cp\u003EFor example if you boot up your computer and start photoshop, it might take 15 seconds to open the application. Then if you close photoshop and immediately open it again, it will only take 2 or 3 seconds to open because the data is still loaded.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-02T21:13:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brofessional\u0022 data-cite=\u0022Brofessional\u0022\u003E\u003Cdiv\u003EWindows 7 uses superfetching.\u003Cp\u003EHaving idle RAM is just a waste, so it keeps recently accessed data in the RAM in-case you access it again. If another program comes along and needs the space, it will dump the superfetched data to make room.\u003C/p\u003E\u003Cp\u003EWhen you sleep/hibernate or shutdown, it dumps the data. So as you mentioned, it climbs back up again after you resume play.\u003C/p\u003E\u003Cp\u003EFor example if you boot up your computer and start photoshop, it might take 15 seconds to open the application. Then if you close photoshop and immediately open it again, it will only take 2 or 3 seconds to open because the data is still loaded.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat would explain it, but it raises another question... if it\u0027s supposed to dump it if needed, and KSP evidently needs very little to run on, even with some very memory-hogging mods turned on... Why is it still generating out-of-memory crashes for people if most of what\u0027s there is Superfetch stuff it\u0027s not actually using?\u003C/p\u003E\u003Cp\u003EI mean, part of my brain is niggling that you\u0027d probably still get out-of-memory if the commit went over the possible allocation, but it still seems...kinda dumb.\u003C/p\u003E\u003Cp\u003EIt also seems like, if that\u0027s the case, there ought to be SOME way to exploit it to stop all the out-of-memory crashes people with a lot of mods are getting... (to a point anyway, but at least get it so that if you can get everything loaded you don\u0027t end up crashing later because of a fluctuation in memory usage).\u003C/p\u003E\u003Cp\u003EEdit: \u003C/p\u003E\u003Cp\u003EOkay, so I looked at some more stuff. Apparently Superfetch is actually designed primarily to help load Windows and Programs faster, and what we\u0027re looking at here is some kind of more traditional caching system, which it also has.\u003C/p\u003E\u003Cp\u003EI did notice one other thing, however. In looking up this stuff I found a guide to what all the different \u0027Memory\u0027 readouts in the task manager are. They listed \u0027Private Working Set\u0027 as being the memory the process is using that it will NOT \u0027share with another program\u0027. Now if I interpret this correctly, this seems to refer to the fact that Superfetch/Cached memory is supposed to cede what it\u0027s using if something else needs it, leaving the Private Working Set to be the the things the program\u0027s actually actively using at the moment.\u003C/p\u003E\u003Cp\u003EWhen I flipped that column on, I found that KSP\u0027s \u0022Private Working Set\u0022 was only infinitesimally smaller than the Full Working Set. I then immediately went into suspend mode on it, and came back up, and again found only a few hundred MB used.\u003C/p\u003E\u003Cp\u003EIt\u0027s almost as if everything the game loads at any point gets cached, and that the cache is for some reason being flagged as actively in use when it\u0027s actually not. Somehow Suspend is killing it anyway, but not the commit allocation. This could account for the \u0027memory leak\u0027 that some people have observed: It\u0027s not so much a leak as a case where things are only being loaded as they\u0027re used, but never really get unloaded. This would cause the memory usage to climb throughout a long play session as more and more bits were loaded at some point or another. Most of the memory that\u0027s flagged as \u0027in use\u0027 isn\u0027t actually being used, but because of the way it\u0027s flagged, it doesn\u0027t get reallocated.\u003C/p\u003E\u003Cp\u003EMy observation after going on suspend mode is that it has no trouble whatsoever loading things on the fly. So if it were somehow set up to either unload things entirely or at least flag the presently-unused stuff as being able to be reallocated, it could help some people out rather dramatically.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-03T00:15:46Z\u0022 title=\u002209/03/2013 12:15  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 3, 2013\u003C/time\u003E by Tiron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-09-03T08:47:21Z","Content":"\n\u003Cp\u003EThoughts of a half-user:\u003C/p\u003E\u003Cp\u003EKSP loads all data upon start into the RAM to be readily available if anything comes into rendering range.\u003C/p\u003E\u003Cp\u003EIt is limited by its 32bit structure.\u003C/p\u003E\u003Cp\u003EWindows uses harddrive memory to dump data from RAM; KSP seems to only allow this while the OS is hibernating.\u003C/p\u003E\u003Cp\u003ENow - on systems with lots of memory - if KSP were designed to request Windows to create a ramdrive reserved for the game to store its during startup preloaded data and if KSP then would fetch its data during play from this ramdrive to load it into RAM - would this equal \u0022profit\u0022?\u003C/p\u003E\u003Cp\u003EThe game would still be able to preload every part and texture, but as it dumps these onto a Windows managed ram drive - that is not limited by the 32bit dilemma, as KSP only sees a (very fast) drive - it would still be able to use the 3,x GB of RAM it can handle.\u003C/p\u003E\u003Cp\u003ESo, it should be possible to install more mods than would fit into the 3,x GB of KSP usable RAM - the only limitation then being, that there must not be more parts and/or retextured high-res planets in rendering range than can be loaded into KSP usable RAM.\u003C/p\u003E\u003Cp\u003EAm I making any sense?\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-09-03T09:14:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brofessional\u0022 data-cite=\u0022Brofessional\u0022\u003E\u003Cdiv\u003EWindows 7 uses superfetching.\u003Cp\u003EHaving idle RAM is just a waste, so it keeps recently accessed data in the RAM in-case you access it again. If another program comes along and needs the space, it will dump the superfetched data to make room.\u003C/p\u003E\u003Cp\u003EWhen you sleep/hibernate or shutdown, it dumps the data. So as you mentioned, it climbs back up again after you resume play.\u003C/p\u003E\u003Cp\u003EFor example if you boot up your computer and start photoshop, it might take 15 seconds to open the application. Then if you close photoshop and immediately open it again, it will only take 2 or 3 seconds to open because the data is still loaded.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHowever superfetch who is an advanced disc cache should not affect KSP memory use it only uses memory who is free for windows.\u003C/p\u003E\u003Cp\u003EVirtual memory also does not affect KSP memory limit or use. \u003C/p\u003E\u003Cp\u003EMy guess is that hibernate cause the game to reorganize itself and dump unused stuff somehow\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2013-09-03T09:43:30Z","Content":"\n\u003Cp\u003EI\u0027ve heard that KSP loads the textures for each part into memory even if those textures are already loaded from another part using the same textures. So with lots of parts you end up with copies of the same texture loaded in RAM. KSP hasn\u0027t really gone through an optimization phase. They\u0027re still adding core features. We are however seeing stand in things being replaced by optimized final versions... the New space center is an example. But really what\u0027s needed is an optimization pass... where they would for one... make the textures load only as needed and keep only one copy of the texture in RAM and have all parts that use it just reference it.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-03T12:41:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EThoughts of a half-user:\u003Cp\u003EKSP loads all data upon start into the RAM to be readily available if anything comes into rendering range.\u003C/p\u003E\u003Cp\u003EIt is limited by its 32bit structure.\u003C/p\u003E\u003Cp\u003EWindows uses harddrive memory to dump data from RAM; KSP seems to only allow this while the OS is hibernating.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s the thing though, it\u0027s NOT dumping it into the page file while it\u0027s suspended (I haven\u0027t tried Hibernate, because it\u0027s disabled on my system. Suspend saves the System state into RAM and keeps the RAM powered so that it\u0027s not lost. Hibernate Saves the system state to the Hard Drive and as such can power down more fully. Because Suspend just goes to RAM, it\u0027s a lot faster, but it\u0027s also susceptible to power outages. Cutting power to a suspended system has the same effect as cutting power to the system in normal operation. But because Hibernate is saved to the hard drive, if the power is cut, the system can still resume from where it left off at. Downsides to Hibernate are the much longer time it takes to write the state out to the hard drive, and the fact that you have to reserve a few GB of hard drive space so that there\u0027s definitely room to do it. I used to only have a 150gb HDD, so I turned Hibernate off to free up some space. Now that I\u0027ve got a 2TB I\u0027ve just never gotten around to turning it back on.\u003C/p\u003E\u003Cp\u003EAs for dumping things to the swap file, that\u0027d be...counterproductive. The whole point of suspend is that it\u0027s fast, because it only uses the RAM. Dumping things onto the hard drive (Swapfile or otherwise) would drastically increase the amount of time it takes, and it\u0027d be obvious it was doing it: there\u0027d be a ton of hard drive writes while you were waiting for the system to suspend.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FITorion\u0022 data-cite=\u0022FITorion\u0022\u003E\u003Cdiv\u003EI\u0027ve heard that KSP loads the textures for each part into memory even if those textures are already loaded from another part using the same textures. So with lots of parts you end up with copies of the same texture loaded in RAM. KSP hasn\u0027t really gone through an optimization phase. They\u0027re still adding core features. We are however seeing stand in things being replaced by optimized final versions... the New space center is an example. But really what\u0027s needed is an optimization pass... where they would for one... make the textures load only as needed and keep only one copy of the texture in RAM and have all parts that use it just reference it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, the thing I noticed personally is that ISA Mapsat\u0027s maps are using up about 20MB of RAM per map, which really doesn\u0027t make much sense, but this whole situation almost provides a plausible explanation:\u003C/p\u003E\u003Cp\u003EIt loads the ~2mb png file into memory, decompresses it into a ~8gb file, also in memory. Passes it to OpenGL (there\u0027s another 8GB), which converts it to a DDS (~2mb again) which then gets passed to the vidcard. At that point, most of that usage is redundant.\u003C/p\u003E\u003Cp\u003EGoing to be looking into some more specialized software though, to try to see if I can\u0027t track what\u0027s going on here a little better.\u003C/p\u003E\u003Cp\u003EAssuming I\u0027m right about this and it\u0027s not just a display problem with the way task manager indicates things (which it could admittedly be), the problem could be more-or-less resolved without bothering to do an optimization pass. If most of the memory usage really is cached items that aren\u0027t actually being used at the moment, all you\u0027d have to do is set it up in such a way that it could dump part of the cache and reallocate the memory it was using when something new needed it. The memory usage would still LOOK high, but it wouldn\u0027t crash unless you actually managed to get it to where it was actively trying to load more than ~3.5 GB of stuff.\u003C/p\u003E\u003Cp\u003EIf it\u0027s caching things and not re-using the cache when it reloads that thing, that\u0027s pretty much your typical textbook memory leak. From what I\u0027ve seen of the current structure, though, it really doesn\u0027t allow re-use of the same texture/model for different parts unless you\u0027re completely re-using both of them. This means, practically, that each part ends up with its own copy of the texture, even if another part uses it. That doesn\u0027t really give the game a way to be able tell it\u0027s the same texture, though, so it\u0027s treated as if it wasn\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-09-03T13:11:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiron\u0022 data-cite=\u0022Tiron\u0022\u003E\u003Cdiv\u003EThat\u0027s the thing though, it\u0027s NOT dumping it into the page file while it\u0027s suspended...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStill, you got me rambling in my brains about a different take on preloading data while possibly evading the limitations of RAM usage by 32bit programs and not falling back to sluggishly slow HDD memory. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-09-03T13:24:24Z","Content":"\n\u003Cp\u003EYou know I swear there\u0027s a memory leak somewhere. My gamedata folder is about 1.5 gigs. I\u0027ll build a massive rocket and find myself swapping back and forth from the VAB to the pad to make tweaks a dozen times. Game runs great, but on the 12th time it\u0027ll crash when loading the craft onto the pad. Sometimes it\u0027ll crash in the VAB after an hour of construction. It\u0027s as if the memory just builds and builds until a crash. So..if there\u0027s a way I can off load it every 20 minutes of play then that\u0027d help alot.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-09-03T13:52:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EYou know I swear there\u0027s a memory leak somewhere. My gamedata folder is about 1.5 gigs. I\u0027ll build a massive rocket and find myself swapping back and forth from the VAB to the pad to make tweaks a dozen times. Game runs great, but on the 12th time it\u0027ll crash when loading the craft onto the pad. Sometimes it\u0027ll crash in the VAB after an hour of construction. It\u0027s as if the memory just builds and builds until a crash. So..if there\u0027s a way I can off load it every 20 minutes of play then that\u0027d help alot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy experience is similar to yours, even though I\u0027m using OS X. If my build sessions in the VAB last very long, crash when I try to launch. If my flying/mission operations sessions last too long (an hour plus, generally), crash when I go to the Tracking Station. It seems more often if I switch missions or ships several time.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-03T13:53:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EYou know I swear there\u0027s a memory leak somewhere. My gamedata folder is about 1.5 gigs. I\u0027ll build a massive rocket and find myself swapping back and forth from the VAB to the pad to make tweaks a dozen times. Game runs great, but on the 12th time it\u0027ll crash when loading the craft onto the pad. Sometimes it\u0027ll crash in the VAB after an hour of construction. It\u0027s as if the memory just builds and builds until a crash. So..if there\u0027s a way I can off load it every 20 minutes of play then that\u0027d help alot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dunno if it\u0027d actually help, because I\u0027m pretty sure if the commit hits 4GB you\u0027re in crashville, and that\u0027s staying high.\u003C/p\u003E\u003Cp\u003ESize of gamedata isn\u0027t a good way to accurately judge memory usage though, because textures for example seem to get vastly inflated. If it\u0027s caching all the intermediates involved in getting the texture to the vidcard, that would make sense.\u003C/p\u003E\u003Cp\u003ECaching things in and of itself isn\u0027t bad: If it\u0027s reusing them when it needs them again later, it\u0027d actually speed up loading quite a bit. What would be bad is if it\u0027s not reusing the cache and if it\u0027s not allowing the cached bits to be dumped to make room for other things when needed. It doesn\u0027t really seem like it is allowing the cache to be dumped given how many people complain about out of memory crashes and how far it drops when you suspend.\u003C/p\u003E\u003Cp\u003EYes, you could hit a point where you were just loading so much stuff that your peak load got too high, but I don\u0027t get the impression that\u0027s happening at all from what I\u0027ve seen. I have some ideas about checking that by deliberately inflating my memory usage, but I\u0027ve got about three different things I want to test at the moment and trying to trace the memory is evidently quite ugly for a pre-compiled application (which doesn\u0027t surprise me a bit.)\u003C/p\u003E\u003Cp\u003EI\u0027ve only ever dabbled in programming really, so it\u0027s something that\u0027s completely new to me and I\u0027m trying to figure out how to do it as I go. Yay.\u003C/p\u003E\n"},{"CreatedByName":"Rakshasa","CreatedById":75497,"CreatedDateTime":"2013-09-03T14:34:49Z","Content":"\n\u003Cp\u003ESomeone discovers the wonders of virtual memory two decades after it became common on personal computers.\u003C/p\u003E\u003Cp\u003EBTW, note that the memory size showed using common tools on windows is the resident set size (pages held in physical RAM), not pages allocated, and as such doesn\u0027t tell you how much address space you got remaining. Thus you can hit the 4GB, actually 3GB for user process, address space limit even with a very low RSS.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-09-03T14:52:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakshasa\u0022 data-cite=\u0022Rakshasa\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBTW, note that the memory size showed using common tools on windows is the resident set size (pages held in physical RAM), not pages allocated, and as such doesn\u0027t tell you how much address space you got remaining. Thus you can hit the 4GB, actually 3GB for user process, address space limit even with a very low RSS.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn English Mr Spock!\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-09-03T17:59:31Z","Content":"\n\u003Cp\u003EWhat are the chances we see a 64bit version come .22? Has anyone seen a dev mention it recently?\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-09-03T18:04:11Z","Content":"\n\u003Cp\u003E.22 ?\u003C/p\u003E\u003Cp\u003E0.0%\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-03T18:32:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakshasa\u0022 data-cite=\u0022Rakshasa\u0022\u003E\u003Cdiv\u003ESomeone discovers the wonders of virtual memory two decades after it became common on personal computers.\u003Cp\u003EBTW, note that the memory size showed using common tools on windows is the resident set size (pages held in physical RAM), not pages allocated, and as such doesn\u0027t tell you how much address space you got remaining. Thus you can hit the 4GB, actually 3GB for user process, address space limit even with a very low RSS.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Well it\u0027d help if the various available metrics were a bit more straightforward about what\u0027s going on, exactly. The one thing I\u0027ve gathered in all this is that they\u0027re really not, and that there\u0027s no good, consistent way to observe the actual memory usage because it\u0027s simply not presented in a clear way.\u003C/p\u003E\u003Cp\u003ERegardless, it\u0027s my understanding that if nothing else, the working set constitutes the bits it\u0027s actually referencing, even when it\u0027s not indicative of how much the program is using. The fact that it\u0027s dropping by such a large factor and crucially not climbing back up again suggests that there\u0027s something interesting going on that I\u0027m not adequately able to probe myself.\u003C/p\u003E\u003Cp\u003EIt\u0027s not a small drop, it\u0027s generally somewhere between a factor of 3 and 6. Going through a scene load is the only thing that jacks it up again in a big way, and even then, even after multiple scene loads, it\u0027s staying ~20% lower than normal. It rather strongly hints at things being loaded into memory that aren\u0027t really being used very much, and just get left there.\u003C/p\u003E\u003Cp\u003EPeople are crashing because they run out of memory, so if it\u0027s being wasted on caching things that aren\u0027t being used, that\u0027s kinda important to figure out huh?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003E.22 ?\u003Cp\u003E0.0%\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe unfortunate fact is that a 64 bit build is dependent on Unity fixing things so that it\u0027s possible to do one that isn\u0027t titanically unstable. \u003C/p\u003E\u003Cp\u003EAnd frankly, it\u0027s not the magic bullet it\u0027s been made out to be either. I personally only have 8gb of physical memory on my system, and that\u0027s more than a lot of people have. Going to 64 bit would enable me to use, at most, about another 2 GB before it starts paging out to the hard drive in a big way. You think the loading is slow NOW...heh. Wait till it\u0027s having to load gigabytes worth of stuff into the swap file.\u003C/p\u003E\n"}]}