{"TopicId":45288,"ForumId":32,"TopicTitle":"Stupid f9","CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-09-08T10:08:57Z","PageNum":1,"Articles":[{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-09-08T10:08:57Z","Content":"\n\u003Cp\u003ESo I was coming down to land on the mun but was going way to fast. I knew i would crash so i decided to press f 9 to reload my last save. I didn\u0027t make one and presumed it would load from when i was in orbit or somthing. What it did was set me back about 5 hours of gameplay to when i was landing a probe on gilly... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E anyone know why it did this? PS: when it loaded the gilly landing i had done it about a week before which was even more weird.\u003C/p\u003E\n"},{"CreatedByName":"gompasta","CreatedById":560,"CreatedDateTime":"2013-09-08T10:15:34Z","Content":"\n\u003Cp\u003EIt will always load to your last quicksave. Obviously you last quicksaved back then. F9 doesn\u0027t load autosaves, as autosaves only exist for data protection against crashes.... AFAIK.\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-09-08T10:20:16Z","Content":"\n\u003Cp\u003EYeah i do remember doing a quick save back then... not too bothered though as i get to do my eve mission again and stick a load of sciency crap on it which i forgot to do last time XD\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-09-08T10:46:52Z","Content":"\n\u003Cp\u003EI\u0027ve been there.\u003C/p\u003E\u003Cp\u003EPre-0.21 the game automatically made a quicksave at every launch. After screwing up a docking maneuver I blindly assumed it had done the same thing and I pressed [F9] reverting me back to an aerobraking maneuver at Jool I did a week ago. Many hours where lost and I had to go through the entire Jool mission again.\u003C/p\u003E\n"},{"CreatedByName":"Aphox","CreatedById":32691,"CreatedDateTime":"2013-09-08T10:53:53Z","Content":"\n\u003Cp\u003EGotta remember, there\u0027s a distinct difference between \u003Cstrong\u003Eauto-saves\u003C/strong\u003E and \u003Cstrong\u003Equick-saves\u003C/strong\u003E. I generally play by one rule with that: if I don\u0027t remember making a quick-save, I don\u0027t reload.\u003C/p\u003E\n"},{"CreatedByName":"MUSTANG","CreatedById":72918,"CreatedDateTime":"2013-09-08T11:15:19Z","Content":"\n\u003Cp\u003EI often have the problem of confusing F9 and F5. Quick saving seconds before impacting is no fun. I honestly wish quick save had to be held down for a second, just like quick load.\u003C/p\u003E\n"},{"CreatedByName":"Crush","CreatedById":59094,"CreatedDateTime":"2013-09-08T11:25:43Z","Content":"\n\u003Cp\u003EWhen you screwed up and want to quickly load your last auto-save before it gets overwritten, hit ctrl-alt-delete and kill the KSP.exe task in the task manager.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-08T12:59:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crush\u0022 data-cite=\u0022Crush\u0022\u003E\u003Cdiv\u003EWhen you screwed up and want to quickly load your last auto-save before it gets overwritten, hit ctrl-alt-delete and kill the KSP.exe task in the task manager.\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EI changed :\u003C/p\u003E\u003Cp\u003EAUTOSAVE_INTERVAL = 300\u003C/p\u003E\u003Cp\u003EAUTOSAVE_SHORT_INTERVAL = 30\u003C/p\u003E\u003Cp\u003Eto :\u003C/p\u003E\u003Cp\u003EAUTOSAVE_INTERVAL = 3000\u003C/p\u003E\u003Cp\u003EAUTOSAVE_SHORT_INTERVAL = 300\u003C/p\u003E\u003Cp\u003Ein the settings.cfg so that I would have more time to do just what you suggest Crush. Sometimes, I just sit in stunned silence after a major screwup and the game autosaves before I can decide the best course of action. I have found that it is very easy to screw up quicksaves (quicksave.sfs) for one reason or another. Examples of this are hitting the wrong key at the wrong time or just plain forgetting to F5 when it\u0027s needed. After killing KSP, I can restart the game and resume from the previous auto-save (persistent.sfs) whether it be from 300 seconds ago or from the last time I entered spaceport. \u003C/p\u003E\u003Cp\u003EAs a side note, and in order to provide better info., what exactly is the difference between AUTOSAVE_INTERVAL and AUTOSAVE_SHORT_INTERVAL?\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-09-08T13:12:14Z","Content":"\n\u003Cp\u003EThis is a user issue, not a quicksave/load issue. I\u0027ve yet to see any bugs/threads about quicksave that didn\u0027t result in the posters admitting they messed up, just like OP. There really is no issue, learn how it works rather than just presuming how it works.\u003C/p\u003E\u003Cp\u003EQuicksave makes a separate save, an entire copy of your persistent file, quickload loads that file, no matter how long it\u0027s been since you made it. That\u0027s all there is to it.\u003C/p\u003E\u003Cp\u003EIf you can\u0027t handle quicksave/load, unbind the keys and don\u0027t use it. If you keep making mistakes of loading old saves, make frequent backups of your persistent file. You could make it a routine that every time you close KSP you make a backup of your persistent file. You could have shortcuts for folders on your desktop and whatnot.\u003C/p\u003E\u003Cp\u003EBottom line, learn how to use it or don\u0027t use it at all.\u003C/p\u003E\n"},{"CreatedByName":"Apollo1391","CreatedById":73845,"CreatedDateTime":"2013-09-08T13:17:47Z","Content":"\n\u003Cp\u003Eyeah I lost a moon landing because of f9\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-08T13:38:48Z","Content":"\n\u003Cp\u003EJohnno, there is an issue if the behavior of the quicksave or auto-save system results in the loss of several hours of gameplay, (regardless of who\u0027s fault it is) especially if there are ways to improve on the system,or recover from a srew-up. There is absolutely nothing wrong with the user wanting the system to work for him or her. I have done what you suggested in the past, making backup copies of the persistent.sfs. It\u0027s easier and faster to change the auto-save behavior to give myself more time to make the appropriate decision regarding screw-ups, whether they are my fault or not.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-09-08T13:56:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Otis\u0022 data-cite=\u0022Otis\u0022\u003E\u003Cdiv\u003EJohnno, there is an issue if the behavior of the quicksave or auto-save system results in the loss of several hours of gameplay\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf the behaviour does so, yes, but since this is a 100% user introduced problem there is no actual issue. Autosave saves to persistent, quicksave saves to quicksave. The behaviour is that quickload loads your quicksave. If you intentionally override your persistent save by loading up an earlier save that\u0027s your personal doing, not the game\u0027s. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThere is absolutely nothing wrong with the user wanting the system to work for him or her.\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EIf you\u0027re refusing to learn how the system works or using it and blaming it when you make a mistake then there\u0027s something wrong. As far as I know the system works flawlessly which is why I say that it\u0027s a user introduced problem.\u003C/p\u003E\u003Cp\u003EYes the system could be different, it could have other functionality, but people have different opinions and will always argue no matter what. If you want a \u0027improved\u0027 system then make a suggestion thread/post, figure it out first and then post about it, rather than whinging that you yourself messed up and that the system is somehow flawed because you can\u0027t figure it out.\u003C/p\u003E\u003Cp\u003EI can not stress this enough, persistent saves to persistent with autosave, quicksave saves to a separate save you pull up with quickload. Where exactly is the confusion or \u0027poor functionality\u0027 ? If you can get the difference into your head and use it as such, quicksaving after every major event in your flight and then either using quickload to go back to your previous spot in your flight or using revert flight entirely if you need a redesign, I really can\u0027t see the problem.\u003C/p\u003E\u003Cp\u003EExplain to me where the system isn\u0027t working correctly or what the problem with quicksave/load and persistent is.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-08T13:58:21Z","Content":"\n\u003Cp\u003EOk, that\u0027s a lot to chew on. I am working on a response.\u003C/p\u003E\u003Cp\u003Eedit : I don\u0027t think anyone in this thread is blaming the game. Some people like me are a little slow sometimes, or hit the wrong key when they get upset or panicked. For me, by changing the auto-save behavior, it gives me one more last ditch effort to try and recover, by giving me more time than just 30 seconds to kill KSP and reload the last auto-saved persistent.sfs by restarting KSP.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-08T14:04:04Z\u0022 title=\u002209/08/2013 02:04  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 8, 2013\u003C/time\u003E by Otis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2013-09-08T14:00:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Otis\u0022 data-cite=\u0022Otis\u0022\u003E\u003Cdiv\u003EJohnno, there is an issue if the behavior of the quicksave or auto-save system results in the loss of several hours of gameplay, (regardless of who\u0027s fault it is) especially if there are ways to improve on the system,or recover from a srew-up. There is absolutely nothing wrong with the user wanting the system to work for him or her. I have done what you suggested in the past, making backup copies of the persistent.sfs. It\u0027s easier and faster to change the auto-save behavior to give myself more time to make the appropriate decision regarding screw-ups, whether they are my fault or not.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut I do care when people are suggesting to add features that will negatively affect those who dont have this issue.\u003C/p\u003E\u003Cp\u003EMy gameplay has already become negatively affected after people got the \u0022end flight\u0022 feature removed just because a miniority of users clicked on it on accident.\u003C/p\u003E\u003Cp\u003EHaving a timer added to save button would really piss me off.\u003C/p\u003E\u003Cp\u003EI hate seeing games being dumbed down and features being stripped out just because people cant handle doing mistakes.\u003C/p\u003E\u003Cp\u003EIf you have issues with for example quicksaving just before crashing, then just simply LEARN from your mistakes and start quick saving earlier. It is not the games fault.\u003C/p\u003E\u003Cp\u003EAnd this new quick save \u0022issue\u0022 is most likely as well a result of the end flight feature being replaced.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-08T14:02:57Z\u0022 title=\u002209/08/2013 02:02  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 8, 2013\u003C/time\u003E by boxman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-08T14:04:15Z","Content":"\n\u003Cp\u003E*sigh*\u003C/p\u003E\u003Cp\u003EYet another person trying to start an argument over an opinion.\u003C/p\u003E\u003Cp\u003EThis entire thread is basically a grudge thread over quickloading because it it so easy to screw up an set yourself back a long ways.\u003C/p\u003E\u003Cp\u003EWe would all be happier if you dropped the assumption that we are blaming the system. We screw up, we know we do, and we don\u0027t need you throwing it in our faces.\u003C/p\u003E\u003Cp\u003E*rant over*\u003C/p\u003E\u003Cp\u003EKept breaking my Ketholander on landing on the Mun. Finally got it down, went to hit f5 but was so conditioned I hit f9 one last time. Had to redo the entire landing attempt twice to make it.\u003C/p\u003E\u003Cp\u003EEDIT: Boxman, you ninja\u0027d me. This isn\u0027t as much a reply to you (though it might partially apply) as it was to Johnno.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-08T14:05:09Z","Content":"\n\u003Cp\u003EYou all are replying faster than I can prepare my posts, NOONE IS BLAMING THE GAME OR SUGGESTING WE CHANGE IT!\u003C/p\u003E\u003Cp\u003EEdit : this is simply a discussion to help users improve their playing experience.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-08T14:07:51Z\u0022 title=\u002209/08/2013 02:07  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 8, 2013\u003C/time\u003E by Otis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-08T14:06:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Otis\u0022 data-cite=\u0022Otis\u0022\u003E\u003Cdiv\u003EYou all are replying faster than I can prepare my posts, NOONE IS BLAMING THE GAME OR SUGGESTING WE CHANGE IT!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIsn\u0027t that exactly what I just said?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-08T14:09:12Z","Content":"\n\u003Cp\u003EYes, Sierra, I have found that this is a sensitive issue and I am trying to help some of the people out there who have a problem with the quicksave thing.\u003C/p\u003E\u003Cp\u003Eedit : it will also help when we get our quoting system fixed on the forums to help reduce confusion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-08T14:12:09Z\u0022 title=\u002209/08/2013 02:12  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 8, 2013\u003C/time\u003E by Otis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-08T14:13:47Z","Content":"\n\u003Cp\u003EClick reply with quote a second time after it starts doing the pinwheel of death. Then it will let you quote someone.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-08T14:17:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EClick reply with quote a second time after it starts doing the pinwheel of death. Then it will let you quote someone.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, great, and thanks! I\u0027m gonna let this thread cool a little while before coming back. I really would like to know the difference between auto save short interval and auto save interval?\u003C/p\u003E\n"},{"CreatedByName":"Jackissimus","CreatedById":73641,"CreatedDateTime":"2013-09-08T14:33:15Z","Content":"\n\u003Cp\u003EWhooof, when I saw this thread I automatically thought that something happened to the Falcon 9 during launch. Fortunately it launches of Tuesday. Man, I cannot wait for that launch.\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-09-08T14:34:17Z","Content":"\n\u003Cp\u003EMy only concern with F9 is the function key is already bound to Fraps as the start/stop video record. Don\u0027t want to change Fraps, given that I use it elsewhere. So, I rebound QuickLoad to function F8. Nice to be able to rebind keys.\u003C/p\u003E\u003Cp\u003EAs another wise poster mentioned, \u0022if I can\u0027t remember when I QuickSaved, I don\u0027t QuickLoad.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-08T15:16:00Z","Content":"\n\u003Cp\u003EHello Apollo13, I am digging the avatar. Eastwood is my favorite actor. I agree that it is good advise to be careful before hitting F9, making absolutely sure it\u0027s the right thing to do. That\u0027s why I suggest changing AUTOSAVE_SHORT_INTERVAL = 30 to 300 in the settings.cfg, to allow the user more time to make that decision. The fact that there are 2 settings for auto-save is a little confusing and I would like to know what the difference between the 2 is.\u003C/p\u003E\n"},{"CreatedByName":"Jim DiGriz","CreatedById":92465,"CreatedDateTime":"2013-11-12T05:05:04Z","Content":"\n\u003Cp\u003ERan into this issue tonight and a stupid f9 lost me a few days -- although I kinda was thinking of cleaning house anyway...\u003C/p\u003E\u003Cp\u003EAnyway, I use Linux and wrote this script to run every 5 minutes out of cron and commit any changes to a git repository. I even set up a remote git repo on my cloud server (which is then backed up to s3) so that I\u0027ve now even got offsite backups in case my apartment burns down or something.\u003C/p\u003E\u003Cp\u003EIf you need to ask what git is, or how to restore from git, or how to make it work on Mac or Windows this probably isn\u0027t for you...\u003C/p\u003E\u003Cp\u003EI tried creating a git repo directly in the kerbal save folder, but the .git directory made KSP confused, so I had to use the approach of rsync\u0027ing the changes to a mirror directory which is a git repo. Since all the save files are text this approach should work reasonably well, but it will grow without bounds, and you\u0027d need to google how to prune and garbage collect your git history to get rid of really old save files, I can never remember how to do that...\u003C/p\u003E\u003Cp\u003EI suppose you could get corrupted checkpoints as well if you happen to take a rsync snapshot right in the middle of KSP doing a save, but chances of that are low and you\u0027ll have snapshots on either side that you could restore from.\u003C/p\u003E\u003Cp\u003EI\u0027ve tested this for about 20 minutes, so wear a helmet... Hope it helps out anyone who hits this problem and had a similar idea, though..\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E#!/bin/bash\u003Cbr\u003E#\u003Cbr\u003E# drop this script into ~/bin/kerbal-autocommit\u003Cbr\u003E#\u003Cbr\u003E# 1. apt-get install git rsync\u003Cbr\u003E# 2. mkdir ~/.kerbalbackups\u003Cbr\u003E# 3. git init ~/.kerbalbackups\u003Cbr\u003E# 3. crontab -e\u003Cbr\u003E#\u003Cbr\u003E# append the following line for once-per-five-minute backups\u003Cbr\u003E#\u003Cbr\u003E#  */5 * * * * $HOME/bin/kerbal-autocommit\u003Cbr\u003E#\u003Cbr\u003E\u003Cbr\u003Eset -e\u003Cbr\u003Eset -x\u003Cbr\u003E\u003Cbr\u003EGIT_DIR=\u0022$HOME/.kerbalbackups\u0022\u003Cbr\u003EKERBAL_DIR=\u0022$HOME/.local/share/Steam/SteamApps/common/Kerbal Space Program/saves\u0022\u003Cbr\u003E\u003Cbr\u003Efunction has_untracked_files {\u003Cbr\u003E  git status --porcelain 2\u0026gt;/dev/null | grep \u0022^??\u0022\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003Efunction is_dirty {\u003Cbr\u003E  [[ $(git diff --shortstat 2\u0026gt; /dev/null | tail -n1) != \u0022\u0022 ]]\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003Ecd \u0022$GIT_DIR\u0022\u003Cbr\u003E\u003Cbr\u003Ersync -av --delete \u0022$KERBAL_DIR\u0022 \u0022$GIT_DIR\u0022 || true\u003Cbr\u003E\u003Cbr\u003Eif has_untracked_files || is_dirty; then\u003Cbr\u003E  git add .\u003Cbr\u003E  git commit -m \u0022update for $(date)\u0022\u003Cbr\u003E  # comment out this next line if you haven\u0027t setup a repo on github or wherever and\u003Cbr\u003E  # only want to keep local history\u003Cbr\u003E  git push origin master || true\u003Cbr\u003Efi\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2013-11-12T06:54:43Z","Content":"\n\u003Cp\u003EMy one complaint is how it no longer quicksaves automatically at the start of a launch.\u003C/p\u003E\n"}]}