{"TopicId":45294,"ForumId":32,"TopicTitle":"Why KSP is such a great game","CreatedByName":"RocketYeah","CreatedById":54474,"CreatedDateTime":"2013-09-08T11:40:18Z","PageNum":1,"Articles":[{"CreatedByName":"RocketYeah","CreatedById":54474,"CreatedDateTime":"2013-09-08T11:40:18Z","Content":"\n\u003Cp\u003EIt had happened again. I have felt this before with other games that I love, Fallout 3 is a good example, the first time leaving the Vault and coming out into the wasteland was so exciting and new, everything felt untouched and there was so much to see, then after many hours that feeling went away, it doesn\u0027t matter how many times I tried and restarted I never got that same feeling I had the first few times I played. I thought the same thing happened with Kerbal Space Program, even though I enjoyed it so much, I could never get that feeling of wonder that I had when I first landed on the Mun, or managed to make a circular orbit. For me it was know different to any other game I had played, or that\u0027s what I thought.\u003C/p\u003E\u003Cp\u003EYesterday I decided not to go on a big mission, in fact I thought I\u0027d just send a simple one manned rocket up into a low orbit around Kerbin, so that\u0027s what I did. The launch went well, Jeb seemed quite content with it all and I got into orbit, nothing unusual just the same old stuff, I decided I might as well EVA Jeb so he could have a float, and then it hit me. As Jeb was floating outside the rocket, with Kerbin below, I suddenly realised the awesomeness of where he actually was, the brilliants of this game and of all you could achieve, the vast unlimited missions however simply you could fly, I basically had the same feeling I had felt when I first started the game almost a year ago.\u003C/p\u003E\u003Cp\u003ETo me that\u0027s what makes KSP a great game, no matter how far you go or what you do, you can still experience that feeling of wonder and excitement know matter how long you have been playing, all you have to do is look, and at least for me, not many games can achieve this. So thanks Squad and everyone involved for such a great game!\u003C/p\u003E\n"},{"CreatedByName":"Lions","CreatedById":79155,"CreatedDateTime":"2013-09-08T12:06:41Z","Content":"\n\u003Cp\u003Ewhere is the \u0022like\u0022 button \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-09-08T12:16:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lions\u0022 data-cite=\u0022Lions\u0022\u003E\u003Cdiv\u003Ewhere is the \u0022like\u0022 button \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s the little star next to \u0027blog this post\u0027 or 5 stars in the \u0027rate this thread\u0027 menu!\u003C/p\u003E\n"},{"CreatedByName":"cantorobriar","CreatedById":79433,"CreatedDateTime":"2013-09-08T12:37:58Z","Content":"\n\u003Cp\u003EI totally agree with you. Kerbals are the most loyal things ever \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E ! If you go up to their face, tell them \u0022We\u0027re sending you to Eeloo and the journey will take 4 years and you may not return,\u0022 then Jeb would smile all the way. And the amount of strange contraptions you could make plus the shear amount of modders, it really is a great game.\u003C/p\u003E\n"},{"CreatedByName":"Pachi3080","CreatedById":65427,"CreatedDateTime":"2013-09-08T15:22:10Z","Content":"\n\u003Cp\u003Ei experienced somethng like you... when i was doing a re-entry to kerbin...\u003C/p\u003E\u003Cp\u003Ebut then... i started to feel panic, because the parachutes were not working and... well my brave crew almost die.\u003C/p\u003E\n"}]}