{"TopicId":45359,"ForumId":32,"TopicTitle":"Improvised Landing Gear and Lithobraking Discussion","CreatedByName":"Burninate","CreatedById":76632,"CreatedDateTime":"2013-09-08T22:23:04Z","PageNum":1,"Articles":[{"CreatedByName":"Burninate","CreatedById":76632,"CreatedDateTime":"2013-09-08T22:23:04Z","Content":"\n\u003Cp\u003ESo the landing gear that\u0027s ingame now is horrible for major impacts, relative to a bunch of bendy 0.125T trusses. What\u0027s not clear, however, is the optimal arrangement for those trusses. As the game is right now, I would like to establish some sort of conventional wisdom about truss landing gears, and the weight and velocity that they can protect on heavy, fast vertical landings.\u003C/p\u003E\u003Cp\u003EThe restriction is: Lithobraking must cause zero damage to the truss structure. I want a reusable vertical lander, not something that will unpredictably break apart.\u003C/p\u003E\u003Cp\u003EWhat have been your experiences with this technique? Pics requested.\u003C/p\u003E\u003Cp\u003EThis, when you remove the nonfunctional wheels (testing something else) will survive a 60m/s landing with zero damage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/23136754/SpiderBall.jpg\u0022 alt=\u0022SpiderBall.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote: I am explicitly looking for discussion and feedback on what you guys have tried in this vein, I only included the example to clarify, not to show off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-10T08:12:19Z\u0022 title=\u002209/10/2013 08:12  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 10, 2013\u003C/time\u003E by Burninate\u003C/strong\u003E\n\u003Cbr\u003EThis wasn\u0026#039;t a Spacecraft Exchange post.\n\u003C/span\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-09-08T22:32:33Z","Content":"\n\u003Cp\u003EWhen I get home I\u0027ll post the usual youtube video of mine.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-09-09T00:56:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo the landing gear that\u0027s ingame now is horrible for major impacts \u003C/div\u003E\u003C/blockquote\u003EMajor impacts are bad for anything. Adding parts to absorb damage ruins your fuel efficiency and gives the ship more momentum during an impact anyway. Why not just, you know, don\u0027t hit as hard?\n"},{"CreatedByName":"Burninate","CreatedById":76632,"CreatedDateTime":"2013-09-09T02:18:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EMajor impacts are bad for anything. Adding parts to absorb damage ruins your fuel efficiency and gives the ship more momentum during an impact anyway. Why not just, you know, don\u0027t hit as hard?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause on places with more gravity than than the Mun, that can be rather difficult unless you employ Mechjeb every time.\u003C/p\u003E\u003Cp\u003EI will note that your statement can be adapted:\u003C/p\u003E\u003Cp\u003E\u0022Adding the ingame landing gear to absorb damage ruins fuel efficiency and gives the ship more momentum during an impact anyway. Why not, you know, don\u0027t hit as hard?\u0022\u003C/p\u003E\u003Cp\u003EThe trusses can function as a much more effective and more positionally flexible landing gear than the \u0027landing gear\u0027 included, and I don\u0027t see much literature discussing how to use them while minimizing wasted mass, or how much impact they can assist with. So finding out what other people think about that is the goal of this thread.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-09-09T04:11:38Z","Content":"\n\u003Cp\u003EI think one of the reasons one doesn\u0027t find much literature on the subject is because it is innwficient, unpredictable, and as far as I know, the upper limit on velocity at impact for structural integrity is rather low. Also, while the trusses may br intact after impact, the delicate components might be damaged. Couple this with the difficulty of pinpoint landings and the subject dies down quick.\u003C/p\u003E\u003Cp\u003EThe only case I see lithobreaking with struts maybe being a good idea is when delivering light, unmanned probes to bodies with an atmosphere to have the air be the main decelerator. As for trusses, I would use the smaller ones in a sort of ball formation.\u003C/p\u003E\n"},{"CreatedByName":"m1xte","CreatedById":53528,"CreatedDateTime":"2013-09-09T05:31:37Z","Content":"\n\u003Cp\u003EYou can try structural pylons too they offer 999 impact tolerance an very flexible connection.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-09-09T06:25:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmpsterMan\u0022 data-cite=\u0022AmpsterMan\u0022\u003E\u003Cdiv\u003EI think one of the reasons one doesn\u0027t find much literature on the subject is because it is innwficient, unpredictable, and as far as I know, the upper limit on velocity at impact for structural integrity is rather low. Also, while the trusses may br intact after impact, the delicate components might be damaged. Couple this with the difficulty of pinpoint landings and the subject dies down quick.\u003Cp\u003EThe only case I see lithobreaking with struts maybe being a good idea is when delivering light, unmanned probes to bodies with an atmosphere to have the air be the main decelerator. As for trusses, I would use the smaller ones in a sort of ball formation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn bodies with atmosphere you can use parachutes. Its also some airbag soulution who works well both in real world and KSP.\u003C/p\u003E\u003Cp\u003ERemember I used the lionheart Prometheus rover a lot back in 0.18 then I started, it managed rough landing as in 20 vertical and 50 horizontal however this sort of stuff don\u0027t scale well upward.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-09-09T07:31:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo finding out what other people think about that is the goal of this thread. \u003C/div\u003E\u003C/blockquote\u003EI\u0027m going to prognosticate that most people will agree that smashing your ship straight into the ground at 216km/h is inadvisable.\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-09-09T08:01:58Z","Content":"\n\u003Cp\u003ENot to mention 90% of players lack patience to weave such intricate lacework. Also, how many parts it adds to the craft? And how much payload you had to cut to lift it all up? Yeah, Cool But Impractical.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-09-09T22:52:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EOn bodies with atmosphere you can use parachutes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is the point I am trying to make. Almost any situation in which one might use trusses to lithobreak have another option that is better in every way I can think of. The only exception is if we use mods, but in that case, then what is the point. Just get airbags and be done with it.\u003C/p\u003E\n"},{"CreatedByName":"Blue","CreatedById":1917,"CreatedDateTime":"2013-09-10T00:08:02Z","Content":"\n\u003Cp\u003EImprovised Lithobraking sounds like a euphemism for \u0022crash and burn\u0022 that isn\u0027t even trying xD\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-10T00:19:46Z","Content":"\n\u003Cp\u003EHey now, The man wants to do an experiment and see what it takes to make a functional, reusable, lithobraking lander. I for one, am interested in seeing the results.\u003C/p\u003E\n"},{"CreatedByName":"Burninate","CreatedById":76632,"CreatedDateTime":"2013-09-10T07:49:19Z","Content":"\n\u003Cp\u003EWhat\u0027s that Alex? It has to be in the form of a challenge?\u003C/p\u003E\u003Cp\u003E\u0022Mayday, mayday, our shipment of colonists aimed for the beautiful hydrothermal resort colony on Laythe missed and accidentally landed on Tylo instead! An ion storm has disabled all our unmanned cores in the area, leading to the mishap - it seems that Jeb was the only one onboard that remembered the destination, and when he went offline, nobody could remember which one was the target. When they realized their parachutes weren\u0027t working, they burned all but the last 100 units of fuel in a crash landing into a hill. 64 kerbal passengers are stuck there strapped into their habitation pods, spacecraft lying on its side, with nothing but winter coats and their kerosene-powered furnace to keep them warm. This is on the *dark side* of Tylo, without line of sight to Kerbin - and with the ion storm disrupting communications, the only way this message got out is that the 3 pilots used the return stages to burn as far as they could on a tilted ballistic trajectory from the original landing, eventually reaching the *light side*, where they transmitted the message via laser. In light of this disaster, KASA has removed Laythe Venture\u0027s launch license with the exception of one rescue flight, but their rocket planners aren\u0027t sure how they can possibly move it all there without the whole ship falling apart on impact. Help us Obi-Wan Kenobi, you\u0027re our only hope!\u003C/p\u003E\u003Cp\u003ELaunch a craft from Kerbin and land it on Tylo with enough space and enough fuel to get 64 stranded passengers on the dark side and 3 stranded pilots on the other side of the planet to a comfortable landing on Laythe.\u0022\u003C/p\u003E\u003Cp\u003EDoes that sound like a reasonable test?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-10T08:05:59Z\u0022 title=\u002209/10/2013 08:05  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 10, 2013\u003C/time\u003E by Burninate\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"littlebattler","CreatedById":73508,"CreatedDateTime":"2013-09-10T08:18:50Z","Content":"\n\u003Cp\u003Ethe ideal lithobraking leg is just a long pole of trusses. \u0022Planet Jousting\u0022, if you will. Provided you have control of your craft, you can have the pole be the part to first hit the ground. Can be reusable if you make the pole replaceable by the means of a docking port.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-11T02:03:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022littlebattler\u0022 data-cite=\u0022littlebattler\u0022\u003E\u003Cdiv\u003Ethe ideal lithobraking leg is just a long pole of trusses. \u0022Planet Jousting\u0022, if you will. Provided you have control of your craft, you can have the pole be the part to first hit the ground. Can be reusable if you make the pole replaceable by the means of a docking port.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat breaks planets, as discovered by Danny2642.\u003C/p\u003E\n"},{"CreatedByName":"littlebattler","CreatedById":73508,"CreatedDateTime":"2013-09-11T09:22:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EThat breaks planets, as discovered by Danny2642.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eisn\u0027t that fixed already?\u003C/p\u003E\n"}]}