{"TopicId":45436,"ForumId":32,"TopicTitle":"It\u0027s almost a silly thing to admit, but sometimes while playing KSP...","CreatedByName":"JRF2k","CreatedById":64440,"CreatedDateTime":"2013-09-09T16:10:42Z","PageNum":1,"Articles":[{"CreatedByName":"JRF2k","CreatedById":64440,"CreatedDateTime":"2013-09-09T16:10:42Z","Content":"\n\u003Cp\u003E..I fall under the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Overview_effect\u0022 rel=\u0022external nofollow\u0022\u003EOverview Effect\u003C/a\u003E. I really can\u0027t help myself. I draw the parallels between Kerbin and Earth and our solar system. And I find myself in love. In love with such a game that is not only awesome to play and fool around with like a LEGO set, but subtlety under all the code, under all the 1s and 0s speaks to that part of us that are still\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLF17F07CFC3208E29\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. We still want to set off in a direction, come what may, and discover something new.\u003Cp\u003EKSP gives the \u0027normal person\u0027 a chance to do this. I am wholly ignorant of much of the physics and other things related to space travel and rocket design, but, you know, guess what? I\u0027ve left my home planet. I\u0027ve traveled to the stars, maybe only briefly, only to the the Mun, only to Minimus, only to, with much struggle, to Duna, but I achieved this. I\u0027ve expanded my view. It has grown past those little green men. I\u0027ve grown past my planet. I\u0027ve seen that, in the solar system I am given, that only life persists on one of them.\u003C/p\u003E\u003Cp\u003EAt that point, I cannot but feel the corollary between Kerbin and Earth. I cannot help but feel that we humans are the little green men and I am left watching\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/4PN5JJDh78I?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E over and over again. Such a powerful statement on what it is to be human and to live the very short existence afforded to us.\u003Cp\u003EAnd they say video games are a waste of time.\u003C/p\u003E\u003Cp\u003ESQUAD, man, you all are doing something amazing with this game. You are capturing minds and you are igniting curiosity. Consider this as you move forward. You have the chance to change the world with a simple game.\u003C/p\u003E\u003Cp\u003E(I posted this over at \u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/1m0522/its_almost_a_silly_thing_to_admit_but_sometimes/\u0022 rel=\u0022external nofollow\u0022\u003EReddit\u003C/a\u003E, too. Username, VaccusMonastica. I just want to make sure Squad sees this, so they know what this game is doing.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-09T16:16:24Z\u0022 title=\u002209/09/2013 04:16  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 9, 2013\u003C/time\u003E by JRF2k\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-09-09T16:15:40Z","Content":"\n\u003Cp\u003EThat was beautiful. Bravo, Bravo.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-09-09T16:23:19Z","Content":"\n\u003Cp\u003EThis sentiment is one that many share on this site, including myself. For whatever reason this isn\u0027t a mere game, it is more. I really feel like I am leading the Kerbal race in one if their most noble endeavors.\u003C/p\u003E\n"},{"CreatedByName":"RoCkEtZoMbIe","CreatedById":80055,"CreatedDateTime":"2013-09-09T16:28:51Z","Content":"\n\u003Cp\u003EThat was nice. and I too blend KSP with life.just yesterday I was asked , what is the second planet from the sun? Without even thinking about it I said Eve.but then I remembered I live on earth not kerbin\u003C/p\u003E\n"},{"CreatedByName":"Ferrit","CreatedById":2929,"CreatedDateTime":"2013-09-09T17:30:27Z","Content":"\n\u003Cp\u003EBrilliantly put and yeah, I know what you mean. KSP has caused shift in my thoughts about space travel, had always been a fan but now I see it as vital for us all. \u003C/p\u003E\u003Cp\u003EIt could be said to be strange that a video game about the (mis)adventures of little green spacemen has brought the accomplishments of our human space heroes that much closer but I think it has given me a much greater appreciation of the risks every launch brings.\u003C/p\u003E\u003Cp\u003EAnd the benefits too, being able to look at this little blue marble and indeed thinking \u0027How much like Earth this is\u0027 and appreciating the beauty of both worlds all that much more.\u003C/p\u003E\u003Cp\u003EKSP has become more than a game, it is a lesson about our own home too.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-09-09T17:42:21Z","Content":"\n\u003Cp\u003EWhile I am glad KSP gives people a greater sense of perspective on the insignificance of the petty non-issues we absorb ourselves with to distract us from the reality of living on a microscopic dot orbiting a microscopic dot which is a part of a cluster of microscopic dots we call a galaxy in the vast expanse of galaxies we call the universe, I would be just as happy if it simply helped dispel some of the sillier myths about space. Like the idea that gravity just vanishes once you cross the Karman Line, or that objects in space are stationary. Or that flying at the ground is how to deorbit something.\u003C/p\u003E\n"},{"CreatedByName":"RocketYeah","CreatedById":54474,"CreatedDateTime":"2013-09-09T17:56:52Z","Content":"\n\u003Cp\u003EAs others have said, well said! KSP, shows us the great desire to explore. Kerbin itself is great to draw parallels from of how lucky we are on earth, I find this feeling to be summarized rather well in the Apollo 8 Astronauts reading from the book of Genesis during the Earth rise from the moon basically saying we are so small in the vastness of space and have so much to be thankful for on this \u0022good earth\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2013-09-09T18:02:25Z","Content":"\n\u003Cp\u003EYup. KSP is awesome.\u003C/p\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2013-09-09T19:09:57Z","Content":"\n\u003Cp\u003EIt\u0027s rekindled my love for everything that flies and blasts off.\u003C/p\u003E\n"},{"CreatedByName":"RickRastardly","CreatedById":78405,"CreatedDateTime":"2013-09-09T19:16:42Z","Content":"\n\u003Cp\u003Ewell said. that is all.\u003C/p\u003E\n"},{"CreatedByName":"toric5","CreatedById":58046,"CreatedDateTime":"2013-09-09T22:11:57Z","Content":"\n\u003Cp\u003Ethis is one thing that i liked about this game, before it froze very time i loaded a save. (see below, the more activity the thread can get, the more likely the devs will look at it!)\u003C/p\u003E\n"},{"CreatedByName":"Raikoutrio","CreatedById":78489,"CreatedDateTime":"2013-09-10T00:59:19Z","Content":"\n\u003Cp\u003ESometime the beauty of the game catches you off guard. I experienced that kind of feeling when i saw the tiny Kerbol from the apoapsis of Eeloo\u0027s orbit.\u003C/p\u003E\n"},{"CreatedByName":"Daisy Blossom","CreatedById":68133,"CreatedDateTime":"2013-09-10T00:59:33Z","Content":"\n\u003Cp\u003EAn eloquent expression of a sentiment I\u0027m sure many of us share. Thanks for sharing.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-09-10T01:45:09Z","Content":"\n\u003Cp\u003EI\u0027ve started writing Moon \u0022Mun\u0022. I\u0027ve caught myself multiple times.\u003C/p\u003E\n"},{"CreatedByName":"MinerEdgar","CreatedById":21247,"CreatedDateTime":"2013-09-10T01:54:20Z","Content":"\n\u003Cp\u003EAs I was reading your post, I began humming the chorus from Major Tom (or is it called Space Oddity?)\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-09-10T01:56:44Z","Content":"\n\u003Cp\u003EI agree 100% well said! This game is what happens when you cast aside the stereotypes \u0022space\u0022 games seem to fall into a majority of the time. While right now in the real world only a handful of very brave, smart and lucky people will do what Kerbal Space Program lets us do, we get to do on a daily basis, which is wonderful. The lessons we learn here in this game are not lightly learned nor easily dismissed. If for but an instant in time we get to learn \u0022firsthand\u0022 what it is and means to be astronauts! Space exploration is our future and no matter what we must embrace this truth.\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-09-10T02:11:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JRF2k\u0022 data-cite=\u0022JRF2k\u0022\u003E\u003Cdiv\u003E..I fall under the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Overview_effect\u0022 rel=\u0022external nofollow\u0022\u003EOverview Effect\u003C/a\u003E. I really can\u0027t help myself. I draw the parallels between Kerbin and Earth and our solar system. And I find myself in love. In love with such a game that is not only awesome to play and fool around with like a LEGO set, but subtlety under all the code, under all the 1s and 0s speaks to that part of us that are still\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLF17F07CFC3208E29\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. We still want to set off in a direction, come what may, and discover something new.\u003Cp\u003EKSP gives the \u0027normal person\u0027 a chance to do this. I am wholly ignorant of much of the physics and other things related to space travel and rocket design, but, you know, guess what? I\u0027ve left my home planet. I\u0027ve traveled to the stars, maybe only briefly, only to the the Mun, only to Minimus, only to, with much struggle, to Duna, but I achieved this. I\u0027ve expanded my view. It has grown past those little green men. I\u0027ve grown past my planet. I\u0027ve seen that, in the solar system I am given, that only life persists on one of them.\u003C/p\u003E\u003Cp\u003EAt that point, I cannot but feel the corollary between Kerbin and Earth. I cannot help but feel that we humans are the little green men and I am left watching\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/4PN5JJDh78I?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E over and over again. Such a powerful statement on what it is to be human and to live the very short existence afforded to us.\u003Cp\u003EAnd they say video games are a waste of time.\u003C/p\u003E\u003Cp\u003ESQUAD, man, you all are doing something amazing with this game. You are capturing minds and you are igniting curiosity. Consider this as you move forward. You have the chance to change the world with a simple game.\u003C/p\u003E\u003Cp\u003E(I posted this over at \u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/1m0522/its_almost_a_silly_thing_to_admit_but_sometimes/\u0022 rel=\u0022external nofollow\u0022\u003EReddit\u003C/a\u003E, too. Username, VaccusMonastica. I just want to make sure Squad sees this, so they know what this game is doing.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022 data-cite=\u0022AlamoVampire\u0022\u003E\u003Cdiv\u003EI agree 100% well said! This game is what happens when you cast aside the stereotypes \u0022space\u0022 games seem to fall into a majority of the time. While right now in the real world only a handful of very brave, smart and lucky people will do what Kerbal Space Program lets us do, we get to do on a daily basis, which is wonderful. The lessons we learn here in this game are not lightly learned nor easily dismissed. If for but an instant in time we get to learn \u0022firsthand\u0022 what it is and means to be astronauts! Space exploration is our future and no matter what we must embrace this truth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI salute you both, gentlemen. I, too, feel the same effect... Especially when I\u0027m doing something big. I land 600 tons of steel and plastic and aluminum and who knows what else on Eve, stand a Kerbal next to it, and see how huge it looks... then I zoom out as far as I can, and it disappears, until it\u0027s not even a speck. I\u0027ve been a believer in space travel for a long time, but it was dormant for years... until I discovered KSP, and got to experience that awe for a second time... and a third... and a fourth... and I still do, every once in a while, as I\u0027m orbiting Kerbin or Eve or wherever I\u0027ve catapulted the little guys off to that day... It\u0027s a big universe, and it sure as hell doesn\u0027t like to let us forget it... And we, humans, the great explorers of planet Earth... there is an infinite frontier out there, filled with wonders not even imaginable in our wildest dreams. Our era has yet to have a Columbus or an Ericson (Leif, that is). That, I think, needs to change.\u003C/p\u003E\u003Cp\u003EI had one of those moments recently, not even playing KSP... I looked at the picture of Earth that Cassini took, from Saturn, just a few months ago. Rings of Saturn in the foreground, pale blue dot waaaay off in the distance... Made me feel very small...\u003C/p\u003E\u003Cp\u003EHats off to you, Squad, for this awesome game! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JMap1","CreatedById":78289,"CreatedDateTime":"2013-09-10T02:57:56Z","Content":"\n\u003Cp\u003EJRF, you got this completely right.\u003C/p\u003E\u003Cp\u003EI love space. This game is my escape. I want so badly to see Earth from orbit. To see the stars as clearly as the universe will allow. I likely will never achieve this, but Jeb, Bob, and Bill can and I live my dream vicariously through them.\u003C/p\u003E\n"},{"CreatedByName":"hansman1982","CreatedById":62705,"CreatedDateTime":"2013-09-10T03:20:26Z","Content":"\n\u003Cp\u003EWell shoot, just as I wrote this game off as boring (happens everytime I install hyper edit cause I\u0027m sick of spending the time to fly the same craft somewhere over and over trying to tease out a lack of delta-v or some flaw) you guys remind me I still have three rave kerbonauts in a Soler orbit cause they ran out of fuel on the way home from Moho. \u003C/p\u003E\u003Cp\u003EWe shall rescue these brave men, because...well...the insurance company says we have to! (And, I guess, it\u0027s the right thing to do)\u003C/p\u003E\n"},{"CreatedByName":"CoriW","CreatedById":57866,"CreatedDateTime":"2013-09-10T04:52:56Z","Content":"\n\u003Cp\u003EI completely agree with pretty much everything said in this thread thus far, I just felt the need to log in and post that. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2013-09-10T05:23:51Z","Content":"\n\u003Cp\u003ESo much feels! \u003Cimg src=\u0022http://bbhgaming.com/site/forums/images/smilies/issac.png\u0022 alt=\u0022issac.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce I started to get into KSP last December I began to gain the overview effect as a part of my regular consciousness, I can\u0027t help but try and see myself from other peoples\u0027 perspectives and understand how I make an impact on them. It\u0027s also made me realize that we\u0027re just tiny little people in a huge universe, doing random stuff because we can. It\u0027s quite scary. Fortunately I know there\u0027s One who always watches over me, and I start thinking of how utterly awesome it is that we have the ability to do what we do because we want to. Man, if I was an atheist, I would be one lost, sad, confused dude. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2013-09-10T06:37:18Z","Content":"\n\u003Cp\u003EUmm, what was that about being an atheist.\u003C/p\u003E\u003Cp\u003ENot wanting to start a flame war, I completely agree with the OP point, and I find that this is why KSP is better then any other game EVAH because you feel like your actually doing something, not just mindlessly mashing buttons.\u003C/p\u003E\u003Cp\u003E(Thank you below poster,I\u0027m haveing problems with quotes,that was exactly what I was going to say)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-10T06:50:41Z\u0022 title=\u002209/10/2013 06:50  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 10, 2013\u003C/time\u003E by SpaceSphereOfDeath\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Autochton","CreatedById":70134,"CreatedDateTime":"2013-09-10T06:44:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OrbitusII\u0022 data-cite=\u0022OrbitusII\u0022\u003E\u003Cdiv\u003EMan, if I was an atheist, I would be one lost, sad, confused dude. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d just like to say, I\u0027m an atheist, and I don\u0027t feel lost or sad by looking at this perspective.\u003C/p\u003E\u003Cp\u003EI feel empowered. In all our solar system, there is one rock that supports life - we may not find any its like in many solar systems around us. That life is, among others, us. We are the only sapient, technic species we know of - a way, as Carl Sagan said, for the universe to know itself. We\u0027re inextricably part of this universe, part of this world, and it is part of us. In that way, we are, ourselves, part of the divine. Part of this wondrous thing we see around us. We are all of us made of the matter from long-dead stars, an enormously unlikely and enormously significant accident that had a probability of 100% from our point of view.\u003C/p\u003E\u003Cp\u003EWe are at once enormously insignificant and enormously important. It all depends upon perspective.\u003C/p\u003E\n"},{"CreatedByName":"tizalee","CreatedById":81667,"CreatedDateTime":"2013-09-10T11:24:34Z","Content":"\n\u003Cp\u003EWell that is KSP for us. It is a world class game. We are doing what we couldn\u0027t imagine earlier. KSP rocks.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-09-10T18:49:43Z","Content":"\n\u003Cp\u003EWe are but travelers on Spaceship Earth. We are star stuff. \u0022... to boldly go into the final frontier, to seek out new life and new civilizations. To boldly go where no one has gone before.\u0022 As cliche as that quote is, it by the very nature of who and what we are by law of common sense should and must be our mandate as responsible citizens of the universe.\u003C/p\u003E\n"}]}