{"TopicId":45685,"ForumId":32,"TopicTitle":"KSP Clans or Space clans?","CreatedByName":"Bunny Commander","CreatedById":82301,"CreatedDateTime":"2013-09-12T02:22:46Z","PageNum":1,"Articles":[{"CreatedByName":"Bunny Commander","CreatedById":82301,"CreatedDateTime":"2013-09-12T02:22:46Z","Content":"\n\u003Cp\u003EHi everyone this would be my first post I was curious to know if there were any like clans or teams or whatever you would like to call them groups that work together on building ships, flying to other planets etc. I know how this would be hard due to theres no multiplayer yet. But with most games I play I always join clans to collaborate with others on ship ideas and or how to fly to the planet and such. Especially for newer players like myself it would be awesome to work with others to improve my gameplay and knowledge of the game. Would anyone be interested in creating a fun clan/space team with me?\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-09-12T04:35:51Z","Content":"\n\u003Cp\u003E\u0022...theres no multiplayer yet.\u0022 Reliable sources (Squad) have indicated that there will be no multiplayer, even though many people would love to have it. What with Time Warp, we all experience our alternate realities and timelines and I doubt Squad wants to deal with a master server system which keeps track of the goings on in an entire solar system, all before being able to consider any other aspect of multiplayer. I think there are achievement and modding groups and the like, but what you might find to be tolerable substitutes are the challenges set up by forum members in the ... Challenges forum. There are also a lot of video tutorials and \u0022let\u0027s play\u0022 videos out there. If there are members of any groups reading this thread, they\u0027ll weigh in.\u003C/p\u003E\n"},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2013-09-12T04:44:36Z","Content":"\n\u003Cp\u003EIf you mean groups like the rocket builders and modding companies that already exist, then yes, we have collaborative groups. We don\u0027t need strict multiplayer to be able to work together on stuff. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2013-09-12T04:57:59Z","Content":"\n\u003Cp\u003EYou could try the savesharing method of multiplayer, I would be up for that! The only problem that you would run into is mods, and agreeing on a set list of mods with which to play. There is a successful version of this running with stock only, which has each mission recorded for youtube. Not sure if any of this is sticking a chord with you. Hope this helps.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-09-12T13:35:03Z","Content":"\n\u003Cp\u003EIYSS(international Youtuber Space station)-works together to build projects together, well know youtubers\u003C/p\u003E\u003Cp\u003EKCBP(kerbal community Build Program)-same as above but run be the lesser known.\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-09-12T16:26:09Z","Content":"\n\u003Cp\u003EThink of this forum as one big clan. Post a question and it will get answered (and probably already has)\u003C/p\u003E\n"}]}