{"TopicId":46599,"ForumId":32,"TopicTitle":"Crashes/error messages questions","CreatedByName":"Dimetime35c","CreatedById":78776,"CreatedDateTime":"2013-09-26T13:55:40Z","PageNum":1,"Articles":[{"CreatedByName":"Dimetime35c","CreatedById":78776,"CreatedDateTime":"2013-09-26T13:55:40Z","Content":"\n\u003Cp\u003EOkay so I\u0027ve been wondering what do the crashes and error messages actually mean? When it says out of memory what does it mean? I understand that the game runs 4gb of ram. I have 8, how can I be out of memory?? Is it referring to my hard drive? What parts of the pc does KSP actually use when running?? I\u0027m new to programming and find it very interesting so please try and keep answers in not to technical terms.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-09-26T14:01:51Z","Content":"\n\u003Cp\u003EKSP is a 32 bit game...\u003C/p\u003E\u003Cp\u003EMeaning it can\u0027t really talk about numbers that are out of the range of 0 thru 4,294,967,295 So now imagine the game is storing information, and it stores a bit at 4,294,967,294, and then the next bit at 4,294,967,295, now it needs to store another bit... However even though you have another 4 billion memory addresses available, the game has now way to be able to talk about them to remember where it stored things. \u003C/p\u003E\u003Cp\u003EMake sense?\u003C/p\u003E\n"},{"CreatedByName":"Dimetime35c","CreatedById":78776,"CreatedDateTime":"2013-09-26T14:05:16Z","Content":"\n\u003Cp\u003EYeah that does, okay so basically even if i upgrade the ram it\u0027s not going to help sense the game can\u0027t talk to more the 4gb of it.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-09-26T14:08:55Z","Content":"\n\u003Cp\u003EAre you running a 32 bit version of windows with a multi core processor?\u003C/p\u003E\u003Cp\u003EIf you search the support forums you\u0027ll find a few stickied posts about crashes and common cause thereof. One of the one\u0027s mentioned is 32 bit windows and unity don\u0027t go together or something.\u003C/p\u003E\u003Cp\u003EIt\u0027s a CPU heavy game, not so much GPU or RAM. Turn down a few textures, less persistent debris, less detail in general and make it run on only one core. Full details in the support forums.\u003C/p\u003E\u003Cp\u003EAll these things can help. Also, make sure your mods, if you have any installed, are all set up correctly. I had a problem when I had stuff in the wrong folders and the game was crashing every few minutes.\u003C/p\u003E\u003Cp\u003EEdit: Got the link for you: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24536-Self-help-for-crashes-look-here-first-if-KSP-crashes\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/24536-Self-help-for-crashes-look-here-first-if-KSP-crashes\u003C/a\u003E\u003C/p\u003E\n"}]}