{"TopicId":47083,"ForumId":32,"TopicTitle":"Those times...","CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-10-01T14:55:11Z","PageNum":1,"Articles":[{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-10-01T14:55:11Z","Content":"\n\u003Cp\u003E...When you can\u0027t seem to get something to work right, from remembering electricity, or keeping unplanned disasemblies happening mid-launch, and you just want to throw your computer out the window.\u003C/p\u003E\u003Cp\u003EVent your frustration here, and get help and suggestions to make whatever is angering you work right!\u003C/p\u003E\u003Cp\u003E99.9 % of the time my kethane miners aren\u0027t even close to efficient unless their tiny, and then they bring tiny amounts of kethane back, so I have to make a million trips.\u003C/p\u003E\u003Cp\u003EAnd even then they don\u0027t work sometimes, leaving me with a headache after numerous face-desks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mordeth","CreatedById":83157,"CreatedDateTime":"2013-10-01T15:14:13Z","Content":"\n\u003Cp\u003E99.9% of the time I forget to add Fuel lines. I always say the mantra* fuel lines*. But for some reason, when I get to the end of setting up staging, I leave them off and notice once I have already hit launch.\u003C/p\u003E\n"},{"CreatedByName":"SteevyT","CreatedById":6183,"CreatedDateTime":"2013-10-01T15:16:54Z","Content":"\n\u003Cp\u003EI tend to design in RCS tanks, but then never actually put any RCS thrusters on the ship anywhere.\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-10-01T15:18:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SteevyT\u0022 data-cite=\u0022SteevyT\u0022\u003E\u003Cdiv\u003EI tend to design in RCS tanks, but then never actually put any RCS thrusters on the ship anywhere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame here\u003C/p\u003E\u003Cp\u003E(Tenchar)\u003C/p\u003E\n"},{"CreatedByName":"fatfluffycat","CreatedById":73913,"CreatedDateTime":"2013-10-01T15:24:36Z","Content":"\n\u003Cp\u003EI always forget to turn on brakes when dropping a rover with a sky crane(Is that that the right name?)\u003C/p\u003E\u003Cp\u003EThen it rolls down a hill and breaks\u003C/p\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-10-01T15:35:15Z","Content":"\n\u003Cp\u003EWhile I have the curse of overengineering everything, which means high weight and high part counts, it also means that everything has RCS, backup RTGs, struts everywhere, a 0.625m docking port just in case, and batteries. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0026gt;_\u0026gt;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_dry.png\u0022 alt=\u0022\u0026lt;_\u0026lt;\u0022\u003E\u003C/p\u003E\u003Cp\u003E*puts a barometer on a space station*\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2013-10-01T15:35:18Z","Content":"\n\u003Cp\u003ENo solar panels, no battery, fuel lines not set up correctly, disordered staging, forgot RCS, sent up the wrong crew...\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2013-10-01T15:42:00Z","Content":"\n\u003Cp\u003ENo real problems with electricity or fuel any more here, but the way the damned VAB resets my crew loadout every time I edit or revert my craft for whatever reason...I could find much time to get angry at the unknown dev who didn\u0027t make that setting a bit more persistent, if he didn\u0027t also help make the other parts of the game I love so much.\u003C/p\u003E\n"},{"CreatedByName":"Sundancer","CreatedById":83716,"CreatedDateTime":"2013-10-01T16:17:13Z","Content":"\n\u003Cp\u003EAside from getting stages in the wrong order, accidentally hitting \u0022space\u0022 one too many times and leaving a command pod in space because that was the motor that was going to be my retrograde burn, getting fuel lines mixed up.... All the silly things.\u003C/p\u003E\u003Cp\u003EBut the best one happened to me just now, rage-quit. \u003C/p\u003E\u003Cp\u003EBob was out flying the Ravenspear Mk3 so I could get an idea of how high turbo-jets can go, and how they should handle when I spotted the river in the northern hemisphere from 15km up. Why not land there and have a look around? Fine, just bear the undulations in mind, and the fact that he touched down at 150m/s.... Surprisingly, it held together only for the engines to catch on the ground and tear off, leaving him there. Now, for some reason I\u0027m quite fond of the little guys, so I figured I\u0027d drop my rendezvous planning/building and mount a rescue operation...What could go wrong?\u003C/p\u003E\u003Cp\u003EAfter about an hour trying and scrapping numerous different designs, I went back to the first creation dubbed \u0022Ravenspear Mk5\u0022 (it used the Mk4 as a base, and modified it to only have one turbojet with a something like 8 ram-jets, airhogging is fun). I\u0027m not sure why it got scrapped in the first place, but it flys beautifully so off Jeb went to rescue his buddy. Cruising at 25km, he used around half the available fuel to get there, but that\u0027s no worry. The return trip will be more efficient since there won\u0027t be as much faffing around trying to get my bearings.\u003C/p\u003E\u003Cp\u003EAnyway, he got there, landed 500m away from Bob and the crippled Mk3...only to find the only ladder on the craft was for his cockpit, and in any case there is no action group set up to activate it... Now I have two Kerbalnauts stranded on literally the other side of the planet (engines blew on the \u0022rescue\u0022 plane during a dodgy move trying to get the wing within jumping distance).\u003C/p\u003E\u003Cp\u003EI wanted to try a rendezvous today, not devise two then three seater sub-orbital planes to rescue guys on bloody Kerbin!\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-10-01T16:43:29Z","Content":"\n\u003Cp\u003EWhen building a lander with parachutes, I frequently forget to move the engines into a separate stage from the parachutes, even after repeated reversions back to the VAB. And when I add ladders so Kerbals can climb up to repack the chutes, I usually forget to create a \u0022deploy chute\u0022 action group to deal with the bug that hoses up even correctly done staging for repacked chutes.\u003C/p\u003E\u003Cp\u003EI usually put 2 RTGs on everything but sometimes forget to do it until construction is well along. So, I pick the RTG, I set symmetry to 2, I drag the RTG to the side of the crew pod, and on the way I drag it across one of the 4 radial fuel tanks, so symmetry gets increased to 4. But I don\u0027t notice and think I\u0027ve just added 2 parts. Then I get to wherever I\u0027m going only to discover the hatch is blocked by one of the extra RTGs.\u003C/p\u003E\u003Cp\u003EI often put crew pods at unnatural angles to save weight or space, intending to actually fly the ship from a probe core that\u0027s oriented correctly. But sometimes I forget to set \u0022control from here\u0022 to the probe core so the ship flies off in a crazy direction.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2013-10-01T17:04:56Z","Content":"\n\u003Cp\u003E\u0026gt;Spend 1 hour designing manned Laythe Lander\u003C/p\u003E\u003Cp\u003E\u0026gt;Launch 4 toward Jool\u003C/p\u003E\u003Cp\u003E\u0026gt;Upon arrival, decide I want to divert 2 to Vall and Tylo\u003C/p\u003E\u003Cp\u003E\u0026gt;Prepare for atmospheric re-entry\u003C/p\u003E\u003Cp\u003E\u0026gt;Why parachutes no workey?\u003C/p\u003E\u003Cp\u003E\u0026gt;Splat\u003C/p\u003E\n"}]}