{"TopicId":49318,"ForumId":32,"TopicTitle":"Where is YOUR Jebediah Kerman?","CreatedByName":"Skydrow","CreatedById":188534,"CreatedDateTime":"2013-10-18T23:56:12Z","PageNum":32,"Articles":[{"CreatedByName":"Juridiah","CreatedById":137068,"CreatedDateTime":"2015-01-30T09:18:01Z","Content":"\n\u003Cp\u003EI\u0027m so disappointed...\u003C/p\u003E\u003Cp\u003EMy Jebediah died so many times in the sandbox... everytime i bring back to life with \u0022revert to launchpad\u0022 i never know that he could die forever \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI lost my precious friend and there are NO MOD to bring he with me again!!\u003C/p\u003E\u003Cp\u003EHe lost his life finding yet another bug in the program... he did a low pass on the sun and at around 1300 meters from it\u0027s surface his landing ship exploded due to overheat on engines (they overheat instantly)\u003C/p\u003E\u003Cp\u003Ealtimeter show around 1300 meters but it looks like the surface was lot of km away!!!!!\u003C/p\u003E\u003Cp\u003Eno \u0022return to launchpad\u0022 was available \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E (yet another bug)\u003C/p\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2015-01-30T12:04:44Z","Content":"\n\u003Cp\u003EJeb is stranded, having climbed into the cockpit of a plane that ran out of fuel that was trying to save him after crashing in his plane doing a survey on the north pole.\u003C/p\u003E\n"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-01-30T12:52:43Z","Content":"\n\u003Cp\u003EHe died during the reentry of STS-1 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Snarfster","CreatedById":80347,"CreatedDateTime":"2015-01-30T13:24:48Z","Content":"\n\u003Cp\u003EOn Laythe, manning the base there with 5 other Kermans, until the day that I am able to design a lander that can pick all 6 of them up.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-01-30T13:29:26Z","Content":"\n\u003Cp\u003EMine is on a mission to Gilly, together with Bill and Bob.\u003C/p\u003E\n"},{"CreatedByName":"Anister","CreatedById":66553,"CreatedDateTime":"2015-01-30T13:49:06Z","Content":"\n\u003Cp\u003EOn his way to a high-speed lithobraking attempt on Lay... Ah, who am I kidding, Kerbin. I havn\u0027t made past Mun\u003C/p\u003E\n"},{"CreatedByName":"Hary R","CreatedById":111339,"CreatedDateTime":"2015-01-30T13:51:44Z","Content":"\n\u003Cp\u003EAt home, waiting for the next rocket to be build.\u003C/p\u003E\n"},{"CreatedByName":"rynak","CreatedById":115092,"CreatedDateTime":"2015-01-30T14:29:12Z","Content":"\n\u003Cp\u003EOn a trajectory out of the system.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-01-30T14:44:15Z","Content":"\n\u003Cp\u003EFerrying rookies on a cruise around Mun/Minmus to get them some experience \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-01-30T15:28:32Z","Content":"\n\u003Cp\u003ECurrently sitting on the command bridge atop my fleet\u0027s flagship which just recently managed to get to laythe (had to drag 2 refueling ships alongside it to keep it going). I dont know why, but ive always used jeb on the best and largest capital ship i have around at any given time. And provided said ship has enough room for them, i also place bill and bob on the same ship for repair duties and science stuff (although a warship doesnt really do much if any science, unless exploding hordes of pirates is science).\u003C/p\u003E\n"},{"CreatedByName":"Coam","CreatedById":135336,"CreatedDateTime":"2015-01-30T18:57:30Z","Content":"\n\u003Cp\u003EFloating above Kerbin aboard my StarLab space station.\u003C/p\u003E\u003Cp\u003EI decided the main 3 Kerbals were safer there than they would be in most other places, though I guess they\u0027ll have to come home sooner or later.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-01-30T19:10:01Z","Content":"\n\u003Cp\u003ECurrently piloting an LV-N powered survey vessel to Jool to complete a Visual Survey contract. After hearing \u0022Trust me, I\u0027m an engineer!\u0022, Jeb decided to take Bob along on this trip instead of Bill.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2015-01-30T19:21:22Z","Content":"\n\u003Cp\u003EHe is in Duna Station on 350 km equatorial orbit after Duna system investigation mission. They should have started return trip already, but I got a very good contract to grind money if I make a Kuarg Bioactivity experiment around Duna. I even had necessary laboratory modules to do that (Station Science mod). So, I ordered that their return is delayed to next return window. Now Jeb and three other crew members wait a Kuarg Bioactivity research unit and TAC supplies for prolonged mission from Kerbin. Maybe they can do some extra landings to Duna and Ike during waiting. There are some unvisited biomes left and plenty of fuel.\u003C/p\u003E\n"},{"CreatedByName":"CptRichardson","CreatedById":269,"CreatedDateTime":"2015-01-30T19:49:25Z","Content":"\n\u003Cp\u003ECommanding the San Kerbsisco Drive Yards in Minmar Polar Orbit, awaiting the arrival of the planetary lander to begin harvesting resources from Minmus to begin constructing the yards to their full glory.\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-01-30T19:56:32Z","Content":"\n\u003Cp\u003EAt the astronaut complex, because Extraplanetary Launchpads work is affected by the stupidity rating, and Jeb didn\u0027t make the cut. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cspan style=\u0022color:#fafafa;\u0022\u003Eyes i\u0027m calling him stupid\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2015-01-30T20:19:54Z","Content":"\n\u003Cp\u003EHe is on a house boat off Insular Island relaxing, while a Minimus mission is being built. JEB is happy spending his day in an open MK3 cargo bay watching the clouds roll by.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-01-30T20:54:52Z","Content":"\n\u003Cp\u003EOn a rag tag collection of craft all docked together with spares, on it\u0027s way to rendezvous with a return from Jool craft for the 20 something Kerbals I have around Laythe.\u003C/p\u003E\u003Cp\u003EWhy? The game is bugged and I need to return all the Kerbals to redo my save (seems 0.90 hates old saves... and new saves and any save with a living/flying Kerbal in it).\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2015-01-30T21:06:07Z","Content":"\n\u003Cp\u003EOn his way back to Kerbin from a solo surface mission to Gilly, where he just earned his fifth star.\u003C/p\u003E\n"},{"CreatedByName":"Rarity","CreatedById":2214,"CreatedDateTime":"2015-01-31T07:23:11Z","Content":"\n\u003Cp\u003EFloating off the coast of the Space Center in a plane with no wings or engines. I was trying to recreate a scene from a book I read and failed, but didn\u0027t crash hard enough to destroy any part of the fuselage...just the wings and engines.\u003C/p\u003E\n"},{"CreatedByName":"m_j_lyons","CreatedById":113321,"CreatedDateTime":"2015-01-31T09:20:38Z","Content":"\n\u003Cp\u003EHe\u0027s on Duna with a crew that got tired of his jokes and forced him to land by threatening to terminate his Minmus icecream rations. Too bad they didn\u0027t realize that after landing they couldn\u0027t get much further away from him and his jokes. Only a year to go before the return window is open.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JCBDQcC.png\u0022 alt=\u0022JCBDQcC.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sufficient Anonymity","CreatedById":57923,"CreatedDateTime":"2015-01-31T16:56:44Z","Content":"\n\u003Cp\u003ECurrently piloting a rescue craft a few hundred meters from its target. Why so close, but not completed? Because I had a crash :/\u003C/p\u003E\n"},{"CreatedByName":"Dakota2063","CreatedById":127687,"CreatedDateTime":"2015-01-31T17:37:38Z","Content":"\n\u003Cp\u003EMy Jeb is current;y starting a clone army of himself on minmus while the rest of the agency flies in more parts for my minmus base. They recently just got a karbonite drill.\u003C/p\u003E\n"},{"CreatedByName":"OscarWilde","CreatedById":136185,"CreatedDateTime":"2015-01-31T17:55:00Z","Content":"\n\u003Cp\u003EDavy Jone\u0027s Locker...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s18.postimg.org/eb4x2a1e1/2014_01_06_00001.jpg\u0022 alt=\u00222014_01_06_00001.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Toastedbuns","CreatedById":135947,"CreatedDateTime":"2015-01-31T17:58:18Z","Content":"\n\u003Cp\u003ECooling off after a successful Minmus expedition and preparing for a Duna one. I only use Jeb.\u003C/p\u003E\n"},{"CreatedByName":"TonyC","CreatedById":95836,"CreatedDateTime":"2015-01-31T18:02:17Z","Content":"\n\u003Cp\u003ESafe in the Astronaut Complex.\u003C/p\u003E\u003Cp\u003EI know I\u0027m lame.\u003C/p\u003E\n"}]}