{"TopicId":49318,"ForumId":32,"TopicTitle":"Where is YOUR Jebediah Kerman?","CreatedByName":"Skydrow","CreatedById":188534,"CreatedDateTime":"2013-10-18T23:56:12Z","PageNum":8,"Articles":[{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-10-28T01:39:53Z","Content":"\n\u003Cp\u003EJeb is currently in Jool orbit headed for a Vall-Vall-Bop slingshot on day 4800 of his tier 0 grand tour, trying to decide if 6 fuel tanks remaining is enough to get to Eeloo and Dres before heading home.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-10-28T03:14:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022-RanZ-\u0022 data-cite=\u0022-RanZ-\u0022\u003E\u003Cdiv\u003EMy career Jeb is stuck orbiting Laythe... ran out of fuel for a return or a landing on Laythe lol\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore of the same...here you see him flexing his neck muscles (landing legs bug) while waiting for Bob and Bill to come pick him up.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img23.imageshack.us/img23/9510/62gk.png\u0022 alt=\u002262gk.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-10-28T03:22:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003EHe is currently managing operations on Valhalla...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought you had killed him for a second. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-10-28T03:32:34Z","Content":"\n\u003Cp\u003EHe is currently wallowing in sorrow back at the KSC after returning from minmus and finding it isn\u0027t actually made of icecream.\u003C/p\u003E\n"},{"CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2013-10-28T03:36:09Z","Content":"\n\u003Cp\u003Emy jeb is preparing for a mun mission in an untested apollo-styled spacecraft. only the launcher itself is tested. the munar module is bug-ridden but i had to fulfill jeb\u0027s hope of going to the mun asap. doing pre-launch checks of munar module.\u003C/p\u003E\n"},{"CreatedByName":"doggie015","CreatedById":51752,"CreatedDateTime":"2013-10-28T03:57:24Z","Content":"\n\u003Cp\u003EIn my timeline he is celebrating the first Mun landing and return which he flew. He has told the engineers to build a space station around Duna and he is disappointed that docking ports have not been invented yet\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-10-28T06:08:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022doggie015\u0022 data-cite=\u0022doggie015\u0022\u003E\u003Cdiv\u003EIn my timeline he is celebrating the first Mun landing and return which he flew. He has told the engineers to build a space station around Duna and he is disappointed that docking ports have not been invented yet\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt least you didn\u0027t do what I did... I first sent up a refueling rocket to minmus. Then lifted a lander and sent it to the mun, gathered my samples and did this that and the other there and went on to minmus in the same trip. Took off from minmus and met up with my refueler only to realize I had no way of getting the fuel transfered as I had no ports... because they hadn\u0027t been invented yet \u0026gt;\u0026lt; \u003C/p\u003E\u003Cp\u003EKirk is still up there floating around. I am deciding if I am going to try and rescue his pod with KAS or stay vanilla and go up with a hitchiker can to get him and abandon his research.\u003C/p\u003E\n"},{"CreatedByName":"Toastie_Buns","CreatedById":75603,"CreatedDateTime":"2013-10-29T19:33:23Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GJ54cm7.png\u0022 alt=\u0022GJ54cm7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EChilling out on the moon, playing pranks on his underlings.\u003C/p\u003E\u003Cp\u003EAfter it was decided that soil samples are cool and all, but pretty dull; Jeb invented a game called \u0027Kerbal Skittles\u0027 in which you use your jetpack\u0027s forward momentum to knock over a space buddy.\u003C/p\u003E\u003Cp\u003EPlanning permission to bring 10 kerbals to the moon is... being considered.\u003C/p\u003E\u003Cp\u003EAt the very moment this screenshot was taken, young Maganja Kerman finally understood why Bill hurriedly pushed him into that two man lander. He did think it was odd that Bill was prepped for launch at the time, come to think of it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T19:36:00Z\u0022 title=\u002210/29/2013 07:36  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by Toastie_Buns\u003C/strong\u003E\n\u003Cbr\u003EWrong underling\n\u003C/span\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-10-29T19:50:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Toastie_Buns\u0022 data-cite=\u0022Toastie_Buns\u0022\u003E\u003Cdiv\u003E*snip*\u003Cp\u003EChilling out on the moon, playing pranks on his underlings.\u003C/p\u003E\u003Cp\u003EAfter it was decided that soil samples are cool and all, but pretty dull; Jeb invented a game called \u0027Kerbal Skittles\u0027 in which you use your jetpack\u0027s forward momentum to knock over a space buddy.\u003C/p\u003E\u003Cp\u003EPlanning permission to bring 10 kerbals to the moon is... being considered.\u003C/p\u003E\u003Cp\u003EAt the very moment this screenshot was taken, young Maganja Kerman finally understood why Bill hurriedly pushed him into that two man lander. He did think it was odd that Bill was prepped for launch at the time, come to think of it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI used to play kerbal horseshoes on the mun. What I would do is when I am about 1-1.5km away from the shuttle I would get going in my jetpack then hit the ground at about 500m and see who would roll closest to the lander. \u003C/p\u003E\u003Cp\u003ETHat said my Jeb is dead. Well for now. I left his pod (failed launch) where it landed, which was just off the end of the runway. I then went on a test flight for a plane, clipped the pod with the wing on takeoff and because I swore off reverts (unless something that looked like it wasn\u0027t my fault happened) I Had to let it go. Wasn\u0027t until I went to recover jeb that I realized what I had hit was his command pod.\u003C/p\u003E\n"},{"CreatedByName":"JebIsMyHero","CreatedById":90580,"CreatedDateTime":"2013-10-29T20:13:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andrewas\u0022 data-cite=\u0022andrewas\u0022\u003E\u003Cdiv\u003EFell off a Mun rocket during ascent. Turns out you need additional ladders to hold on to if you want to get an EVA report from the low atmosphere. Who knew?\u003Cp\u003EI think the rocket is still up there somewhere.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame thing happened to me. XD\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-10-30T00:35:01Z","Content":"\n\u003Cp\u003EHe just lead the team on the first Duna mission, successfully landed with a borderline amount of DV left, return to orbit is questionable, however a large armada of equipment was launched after the mission, so they will soon have a little caravan, a Kethane miner, and a menagerie of rovers to keep them company if they are stuck. \u003C/p\u003E\u003Cp\u003EJeb is currently strapped into the tiniest manned rover I\u0027ve made, he\u0027s named it the Jebroller and won\u0027t let Bob or Bill have a go in it. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1kW82wG.png\u0022 alt=\u00221kW82wG.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-10-30T01:13:50Z","Content":"\n\u003Cp\u003EI just got him back to Kerbin after sending a rescue mission in my Let\u0027s Play Kerbal Space Program Career Mode Episode Three. He got stranded in orbit around the Mun after running out of gas... SPOILER: He\u0027s home now. =)\u003C/p\u003E\u003Cp\u003EVideo included:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/2XKOp4WocZI?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-30T01:26:14Z","Content":"\n\u003Cp\u003EJeb?\u003C/p\u003E\u003Cp\u003EHe got promoted to a desk job....designing a NERVA ship.\u003C/p\u003E\u003Cp\u003EI\u0027m considering demoting him and sending him on a manned mission to Dres.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-10-30T01:31:58Z","Content":"\n\u003Cp\u003EI got so sick of Jeb trying to stow away on test designs and bumping other crew from scheduled flights, that I no longer allow orange suits to fly missions.\u003C/p\u003E\n"},{"CreatedByName":"AntonioAJC","CreatedById":16486,"CreatedDateTime":"2013-10-30T01:34:05Z","Content":"\n\u003Cp\u003EOn an escape shuttle due to an unplanned dis-assembly of the space station he was stationed in.\u003C/p\u003E\n"},{"CreatedByName":"zxczxczbfg","CreatedById":74636,"CreatedDateTime":"2013-10-30T01:46:33Z","Content":"\n\u003Cp\u003EMy Jeb is awaiting launch on the first manned Mun mission on this save.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-10-30T02:20:26Z","Content":"\n\u003Cp\u003Ejeb version 13... Orbiting the sun\u003C/p\u003E\u003Cp\u003EJeb version 17... hard water landing... real hard\u003C/p\u003E\u003Cp\u003Ejeb 18... duna... forever\u003C/p\u003E\u003Cp\u003Ejeb 19... Orbital buggy around minmus... don\u0027t ask\u003C/p\u003E\u003Cp\u003EJeb 20... primary kerbin to Duna shuttle pilot... 13 completed round trips\u003C/p\u003E\u003Cp\u003EJeb 21... taking year off\u003C/p\u003E\u003Cp\u003Ejeb 22 ... primary science pilot ... just finished second docking with KerbinLab 1 in LKO... on the short list for the first Duna Mission.\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\n"},{"CreatedByName":"Jahnri","CreatedById":82669,"CreatedDateTime":"2013-10-30T02:55:29Z","Content":"\n\u003Cp\u003EAt the moment my Jeb is on Kerbin taking polar samples at North Station. One of 20 small colonies I have around Kerbin, 2 on munar and one on minimus. UPWARD AND ONWARDS!\u003C/p\u003E\n"},{"CreatedByName":"Symshady","CreatedById":64978,"CreatedDateTime":"2013-10-30T04:40:29Z","Content":"\n\u003Cp\u003ESo I forgot to swap Jeb out with some lackey for the test Rover mission today. Landed a little hard, and broke the wheels on the rover. No big deal right? So, I hop Jeb out and start to repair the wheels. When I fixed the first wheel, the rover starts freaking out all on its own. It starts spinning like a top on the nose, then catches a wheel and careens off into the local hills to erupt in a giant ball of parts and fire. Spec-freakin\u0027-tacular. I almost pee\u0027d myself laughing so hard. I think if you have a \u0027brake\u0027 ag on the rear wheels, and you set the brakes before jumping out to repair the wheels, this happens. I\u0027m still in testing.\u003C/p\u003E\u003Cp\u003EMeanwhile, Jeb has been rescued and has sent the lackeys off to Eve. He\u0027s in the bar having drinks now.\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-10-30T04:48:40Z","Content":"\n\u003Cp\u003EJeb fell asleep at the controls and missed the intercept with Minmus. \u003C/p\u003E\u003Cp\u003ENow Bill will be the first Kerbin on Minmus.\u003C/p\u003E\n"},{"CreatedByName":"Darcion","CreatedById":60123,"CreatedDateTime":"2013-10-30T07:58:50Z","Content":"\n\u003Cp\u003EJeb was on Duna and now he got freetime\u003C/p\u003E\n"},{"CreatedByName":"Pupu","CreatedById":76649,"CreatedDateTime":"2013-10-30T12:44:26Z","Content":"\n\u003Cp\u003EMy Jeb is stuck on the Mun. No fuel left for the return, but Bill and Bob are on the way to get him home. At least he wass the first on the mun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E (for lots of days\u003C/p\u003E\n"},{"CreatedByName":"MightyLampshade","CreatedById":90727,"CreatedDateTime":"2013-10-30T13:13:13Z","Content":"\n\u003Cp\u003ECurrently orbiting Kerbin on my science station (using the KSP Interstellar mod), along with 4 other Kerbals. Tonight I will be transferring the crew to a new ship which is due to do a grand tour of the other planets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-10-30T13:16:48Z","Content":"\n\u003Cp\u003ESandbox:\u003C/p\u003E\u003Cp\u003EHe\u0027s on Eve, waiting for KSC to send him somewhere to stay until we can send a lander. The lander landed in the water, and had an Issue trying to hover to shore, and exploded. So, Jeb\u0027s just standing there, looking out at the wreckage.\u003C/p\u003E\u003Cp\u003ECareer:\u003C/p\u003E\u003Cp\u003EKSC, and also dead at the bottom of an ocean. I\u0027m not sure how he got back.\u003C/p\u003E\u003Cp\u003EFirst in space, first rocket, first to land on the Mun, first fatality, first to land on and return from Minimus. And I\u0027m aiming for him to be the first out of Kerbin\u0027s SOI, once I figure out how to get the rocket stacked with probes and out there.\u003C/p\u003E\n"},{"CreatedByName":"McFarnsworth","CreatedById":73984,"CreatedDateTime":"2013-10-30T13:40:25Z","Content":"\n\u003Cp\u003EStuck on Moho with Bill this time, a few 100 dV short to hit Kerbin.\u003C/p\u003E\n"}]}