{"TopicId":49535,"ForumId":32,"TopicTitle":"Is Squad ditching the hardcore player?","CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-10-19T22:31:07Z","PageNum":5,"Articles":[{"CreatedByName":"Exposure","CreatedById":188,"CreatedDateTime":"2013-10-20T00:33:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boomerdog2000\u0022 data-cite=\u0022boomerdog2000\u0022\u003E\u003Cdiv\u003EHow is this a problem or mean that career mode is a tutorial? It IS massively unpolished. It is the first release of some basic foundation for the full career mode. All it is designed to do right now is cut down on the number of initial parts available and that is what it does.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile that is somewhat helpful (learning that bigger =/= better is something that really needs to be learned to do well in KSP IMO), it doesn\u0027t really do much when it comes to learn how to actually play the game.\u003C/p\u003E\u003Cp\u003EHell, I thought the science system was going to be an absolute \u003Cem\u003Egrind\u003C/em\u003E and pretty unfun until someone pointed out to me on the IRC channel that the EVA reports can differ even in LKO, along with the fact that multiple canisters, part bays, etc can all store separate experiments. And I\u0027m someone who\u0027s been actually playing the game for a while, imagine how difficult career mode can be to someone completely new!\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-20T00:34:48Z","Content":"\n\u003Cp\u003EWhen I first downloaded Orbiter few years ago, not only was I struck with it being so user unfriendly, completed with irritating jagged graphics, but I also started thinking: \u0022Wow, most people who are totally into this must be a nagging bunch for sure.\u0022\u003C/p\u003E\u003Cp\u003EHow about that? It seems I was right.\u003C/p\u003E\n"},{"CreatedByName":"Sequence","CreatedById":42247,"CreatedDateTime":"2013-10-20T00:35:03Z","Content":"\n\u003Cp\u003EThe wiki has the following listed as planned features:\u003C/p\u003E\u003Cp\u003E-Crew tasks: Have the crew take charge of controlling the craft (provided they can handle it)\u003C/p\u003E\u003Cp\u003E-Mining parts: Used to gather resources on other bodies\u003C/p\u003E\u003Cp\u003E-Wind \u0026amp; turbulence conditions\u003C/p\u003E\u003Cp\u003E-Better aerodynamics\u003C/p\u003E\u003Cp\u003E-Re-entry heat or damage \u003C/p\u003E\u003Cp\u003E-Fixed fuel flow and changing maximum thrust depending on surrounding atmospheric pressure\u003C/p\u003E\u003Cp\u003ESome of these things are going to change how the game plays quite dramatically, and no doubt existing features will end up adapting to accomodate them. Making tutorials now to fully explain how to play the game would be wasted effort, as they\u0027d have to keep changing them. I\u0027d much rather Squad spent that effort on developing the game. Tutorials can be implemented closer to release. \u003C/p\u003E\u003Cp\u003EAs for the tech tree, yes it\u0027s simple at the moment but it\u0027s the first iteration. No one, possibly not even Squad know exactly what direction it will end up taking at this point in time. Even if it does end up being part of the tutorial, so what? Squad have left most elements of the game open to modders, so if you want a more advanced and challenging tech tree there will be numerous mods to cater to that. There already are, even though the basic bare bones of research has only been out a few days. When modders are able to create their own tech nodes even more options will be available. \u003C/p\u003E\u003Cp\u003EI really don\u0027t understand a lot of the rage in this thread (and on the forums in general recently), this game is so moddable, and has such a rich and talented modding community, that the game can be heavily customised to your personal liking. Don\u0027t like the part descriptions? Change them. Too easy? KIDS, FAR, Life support, Deadly Re-entry, etc. \u003C/p\u003E\u003Cp\u003ERemember the game is in development, it\u0027s not finished, we\u0027re testers and we have the chance to offer feedback and help mold the game. If there\u0027s really something you don\u0027t like, post a reasoned argument with suggestions and justifications and Squad will listen, and if they don\u0027t agree with you there\u0027s the add-on requests forum.\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-20T00:35:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Exposure\u0022 data-cite=\u0022Exposure\u0022\u003E\u003Cdiv\u003EWhile that is somewhat helpful (learning that bigger =/= better is something that really needs to be learned to do well in KSP IMO), it doesn\u0027t really do much when it comes to learn how to actually play the game.\u003Cp\u003EHell, I thought the science system was going to be an absolute \u003Cem\u003Egrind\u003C/em\u003E and pretty unfun until someone pointed out to me on the IRC channel that the EVA reports can differ even in LKO, along with the fact that multiple canisters, part bays, etc can all store separate experiments. And I\u0027m someone who\u0027s been actually playing the game for a while, imagine how difficult career mode can be to someone completely new!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, because it\u0027s not done and has no tutorials. And it has no tutorials because it\u0027s not done. The current tech tree is not designed to teach anything it is just for reducing the shock of having so many parts and not knowing what they all do.\u003C/p\u003E\n"},{"CreatedByName":"SkipSpikowski","CreatedById":57209,"CreatedDateTime":"2013-10-20T00:35:58Z","Content":"\n\u003Cp\u003EYeah, I can see why developers ban people from forums for this kind of thing (not that I advocate that), but this kind of thing can be a cancer that kills a pretty cool community.\u003C/p\u003E\n"},{"CreatedByName":"Akinesis","CreatedById":71042,"CreatedDateTime":"2013-10-20T00:37:05Z","Content":"\n\u003Cp\u003ETiberion said it all for me.\u003C/p\u003E\u003Cp\u003EI haven\u0027t been able to read the entire thread, so I\u0027m sure I\u0027ll be repeating things. Apologies in advance for that, but (think Spartan...):\u003C/p\u003E\u003Cp\u003ETHIS IS ALPHAAAAAA!!!\u003C/p\u003E\u003Cp\u003EThat is all.\u003C/p\u003E\n"},{"CreatedByName":"Lanfranc","CreatedById":67288,"CreatedDateTime":"2013-10-20T00:41:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crush\u0022 data-cite=\u0022Crush\u0022\u003E\u003Cdiv\u003EWith every future update, there will be people who shout that the game is now \u0022\u003Ca href=\u0022http://tvtropes.org/pmwiki/pmwiki.php/DarthWiki/RuinedFOREVER\u0022 rel=\u0022external nofollow\u0022\u003Eruined FOREVER!\u003C/a\u003E\u0022 and would they have listened to their personal opinion (which is of course infallible because they are \u003Ca href=\u0022http://tvtropes.org/pmwiki/pmwiki.php/Main/FanDumb\u0022 rel=\u0022external nofollow\u0022\u003Ethe only TRUE hardcore fans\u003C/a\u003E) they could have saved it, but no, these stupid game developers just did what they thought was right instead of listening to them. There is really nothing Squad can do about that except for further treading water like they did during the past year. But that won\u0027t help either, because then there will be people complaining that the game isn\u0027t moving forward. Unfortunately there is no \u0022right\u0022 direction to move into. Whatever direction they choose, there will be complaints.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t really see those complaints as having that much of an impact. We don\u0027t know how many copies KSP has sold, but it\u0027s certainly in the hundreds of thousands, perhaps 7-800,000-ish. By comparison, the entire forum here has some 10,000 active members, and only a fraction of those are going to be \u0022true hardcores\u0022. In the end, we\u0027re talking about an extremely small, if vocal part of the player base seen as a whole. Of course Squad should keep an eye on and take opinions under consideration to the extent they\u0027re valid (and I think they do), but beyond that, how much does it actually matter?\u003C/p\u003E\n"},{"CreatedByName":"Alguien","CreatedById":1623,"CreatedDateTime":"2013-10-20T00:42:06Z","Content":"\n\u003Cp\u003EYour \u0022BUT IS NOT FINISHED YEEEEEEET\u0022 point, while still true, seem counter productive, yes, is imcomplete which is exactly why people should give criticism to improve it. Being a \u0022yes man\u0022 is not going to help the game or the developers at all. After all, isn\u0027t that part of the concept of releasing it in developement? to get criticism in the first place?\u003C/p\u003E\n"},{"CreatedByName":"Steamtex","CreatedById":32197,"CreatedDateTime":"2013-10-20T00:42:16Z","Content":"\n\u003Cp\u003EI would have to agree with Sequence here. He pretty much nailed it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alguien\u0022 data-cite=\u0022Alguien\u0022\u003E\u003Cdiv\u003EYour \u0022BUT IS NOT FINISHED YEEEEEEET\u0022 point, while still true, seem counter productive, yes, is imcomplete which is exactly why people should give criticism to improve it. Being a \u0022yes man\u0022 is not going to help the game or the developers at all. After all, isn\u0027t that part of the concept of releasing it in developement? to get criticism in the first place?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s a difference between constructive criticism and whining.\u003C/p\u003E\n"},{"CreatedByName":"Akinesis","CreatedById":71042,"CreatedDateTime":"2013-10-20T00:47:19Z","Content":"\n\u003Cp\u003EI simply could not resist:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s402.photobucket.com/user/Akinesis/media/image_zps4c0519cd.jpg.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i402.photobucket.com/albums/pp104/Akinesis/image_zps4c0519cd.jpg\u0022 alt=\u0022image_zps4c0519cd.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EVery sorry...\u003C/p\u003E\u003Cp\u003EEdit: I feel I should add more than just silliness. Yeah, criticism is important. But I think it\u0027s too early to say that Squad is heading in the wrong direction when this is just the implementation and foundation of career mode. If this was the fifth or sixth instalment of the career mode, then fair enough. But I don\u0027t think it\u0027s anywhere near a stage that should worry people about it\u0027s future.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-20T00:53:37Z\u0022 title=\u002210/20/2013 12:53  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 20, 2013\u003C/time\u003E by Akinesis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-10-20T00:50:53Z","Content":"\n\u003Cp\u003EYou know, you can call KSP alpha all you want, but it\u0027s not an alpha. \u003C/p\u003E\u003Cp\u003EOnce you release a game, and charge for it, it\u0027s a release. Period.\u003C/p\u003E\n"},{"CreatedByName":"EleSigma","CreatedById":11215,"CreatedDateTime":"2013-10-20T00:51:34Z","Content":"\n\u003Cp\u003EAs a long time player I have to agree that this game seems to be steadily leaning more towards casulization. Also they seem not to have any sort of plan or idea as to what to do or where to go with the game.\u003C/p\u003E\u003Cp\u003EBack through 2012 and early 2013 the devs had a plan for the game and this was laid out at KerbalKon 2012. However since the whole DLC-gate, resource feature abandonment issue, and surge of popularity they seem to have thrown out all of their plans out the window, started abandoning the original player-base and over the course of the year have watered down career mode from the intended BARIS inspired conception into a glorified tutorial mode. The infamous developer asymptotes post has been mostly disproven, they quietly abandoned the attempt at monthly updates with less content (well they kept the less content part though), almost every career mode update has taken over two months to make when we were told it wouldn\u0027t take as long. This is in part to the devs wasting months trying to do the impossible and fix all the bugs and make saves backwards compatible for a game that, as many have said, is heavily under development.\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-20T00:52:48Z","Content":"\n\u003Cp\u003ELet\u0027s not get into whether it is or isn\u0027t alpha. There was another flame-war about that around here anyway. Can we all agree that it is still in development therefore not finished?\u003C/p\u003E\n"},{"CreatedByName":"jcraft","CreatedById":42471,"CreatedDateTime":"2013-10-20T00:53:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alguien\u0022 data-cite=\u0022Alguien\u0022\u003E\u003Cdiv\u003EYour \u0022BUT IS NOT FINISHED YEEEEEEET\u0022 point, while still true, seem counter productive, yes, is imcomplete which is exactly why people should give criticism to improve it. Being a \u0022yes man\u0022 is not going to help the game or the developers at all. After all, isn\u0027t that part of the concept of releasing it in developement? to get criticism in the first place?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOur \u0022BUT IS NOT FINISHED\u0022 doesn\u0027t mean that criticism should\u0027t be allowed. But there is difference between offering feedback and treating current state of implemented features as if they were finished.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou know, you can call KSP alpha all you want, but it\u0027s not an alpha.\u003Cp\u003EOnce you release a game, and charge for it, it\u0027s a release. Period. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can argue about KSP being alpha or not however long you want, but in reality game is still heavy work in progress and therefore is far from finished, and should be treated as such.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-20T01:06:02Z\u0022 title=\u002210/20/2013 01:06  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 20, 2013\u003C/time\u003E by jcraft\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-20T00:56:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EleSigma\u0022 data-cite=\u0022EleSigma\u0022\u003E\u003Cdiv\u003EAlso they seem not to have any sort of plan or idea as to what to do or where to go with the game.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust because they haven\u0027t shared it with us doesn\u0027t mean they don\u0027t have a plan. And they probably haven\u0027t shared it with us because so many things are subject to change.\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-10-20T00:57:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dlrk\u0022 data-cite=\u0022dlrk\u0022\u003E\u003Cdiv\u003EYou know, you can call KSP alpha all you want, but it\u0027s not an alpha. \u003Cp\u003EOnce you release a game, and charge for it, it\u0027s a release. Period.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it was post-release, the devs would be even less obliged to listen to you. You should be glad it\u0027s an alpha, so maybe you actually can contribute something constructive to it.\u003C/p\u003E\n"},{"CreatedByName":"shoveycat","CreatedById":71091,"CreatedDateTime":"2013-10-20T00:57:33Z","Content":"\n\u003Cp\u003EAlphas are made so they can get criticism and feedback, the problem arises when people assume the entire future of the game off what they see in such an early stage of deevelopment\u003C/p\u003E\n"},{"CreatedByName":"fcdrifter13","CreatedById":79366,"CreatedDateTime":"2013-10-20T00:58:56Z","Content":"\n\u003Cp\u003EI think that the majority of people that are really liking the game right now are the ones that were enthralled with space and science as kids. Gamers have moved from playing a game to it becoming a sport and that will be the downfall. I love the game as it sits right now in alpha, trying to figure out things on your own is half of the fun, you know like real science and space exploration. Giving the player a set of goals to accomplish has changed my view on the game so far, it has pushed me to go to places and actually do things that I wouldn\u0027t normally do. Example, going to eve. I HATE Eve, I think it is a stupid planet that hugged Barney a little to strongly, but I know if I do not go there I will not be able to progress as a player and see all of the little science quotes that make me chuckle. In other words to quote a certain forum from 7yrs ago I did it for the lulz. \u003C/p\u003E\u003Cp\u003ERemember kids it\u0027s science and fun, not OMG MUST BE THE BEST PLAYER EVER BECAUSE OF THE INTERNETS SO IT NEEDS MORE GUNS AND SPLOSIONS AND MULTIPLAYER SO I CAN SHOW EVERYONE HOW MUCH SPARE TIME I HAVE TO SPEND ON SOMETHING THAT ISNT REAL.\u003C/p\u003E\n"},{"CreatedByName":"Akinesis","CreatedById":71042,"CreatedDateTime":"2013-10-20T01:02:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dlrk\u0022 data-cite=\u0022dlrk\u0022\u003E\u003Cdiv\u003EYou know, you can call KSP alpha all you want, but it\u0027s not an alpha. \u003Cp\u003EOnce you release a game, and charge for it, it\u0027s a release. Period.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s an arguable point. But alpha/under development/whatever, it\u0027s still labelled as all of the above. So it just has to be treated as such.\u003C/p\u003E\u003Cp\u003EAnyway, I love the game no matter at the moment. Call me simple, dumb and stupid if you want, but it appeals to me. Too much, in fact. So, off I go.\u003C/p\u003E\n"},{"CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2013-10-20T01:07:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003E(Cut chunks out of this post, as its a bit big to quote the whole thing) You people. Get a grip.\u003Cp\u003EAs you can see by the date under my name, I\u0027ve been here longer than most of you (except korda \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E ) and you might also know that I maintain a parts pack that adds a lot of \u0022realistic\u0022 parts. So you might expect me to be \u0027hardcore\u0027 and weep over the purity of the game or somthing.\u003C/p\u003E\u003Cp\u003EThey\u0027ll have tutorials and other example scenarios eventually, but in the middle of a programming sprint to add huge features to the game is not the time to be stop and make documentation. Furthermore, the science tree has a VERY specific function in that it implements the graduated ganeplay that almost ANY game features today - the first levels are easier and less complex, and as you progress you unlock more things. Tech trees are just the first layer of that, with several more to come, and it makes absolutely no sense to throw a fit about it, or declare that Squad doesn\u0027t care about the hardcare because they dared to add a graduated gameplay system to the lowest levels of the game. They HAD to do it because their audience is exploding, and the CURRENT DESIGN was not working, with new players being dropped into 100\u002B parts and having to figure it all out. Unlocking parts will teach them how to play 100 times better than any slideshow tutorial ever will.\u003C/p\u003E\u003Cp\u003EWhat we cannot and MUST NOT do is be negative and complain and start posts like this accusing Squad of abusing you or ignoring you. Don\u0027t attack other types of players as \u0022ruining the game.\u0022 Be postiive, or at the very least CONSTRUCTIVE.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve not been here as long as you certainly, but I\u0027ve been here a while and maintained a few mods, seen a lot of versions and changes in the game.\u003C/p\u003E\u003Cp\u003ENow let me first start off by saying this - I like 0.22, as a user who\u0027s been around for a while. The research system is fun in my opinion, and I\u0027m enjoying the challenge it adds into the game as things are slowly unlocked (I know you can do the same experiment repeatedly and grind in one mission to research a whole load, but thats up to the user if they want to do that)\u003C/p\u003E\u003Cp\u003EThe important point I wanted to address was tutorials and introduction for NEW USERS. Which has ended up strangely waysided at Squad, who have had two separate Tutorial systems, both valid, end up cast aside. There was the original 0.13 rocket building and rocket flying tutorials, and there\u0027s also the newer few short ones available - but don\u0027t really hear much of these anymore and don\u0027t think there was a rocket building one. The other thing is that the testers and developers are all people who know how the game works and how to play it, which leads to a problem of \u0022implied knowledge\u0022 - this has been mentioned in a few previous posts in this thread. For instance you\u0027re expected to know right clicking on parts does something, that ALT , . control physical timewarp, that mousing over the altimeter gives more options.\u003C/p\u003E\u003Cp\u003EThose talking about game versions and how its not \u0022Version 1.0\u0022 yet, or \u0022Wait for future versions!\u0022 Please no. That isn\u0027t how this type of game works, it never has been. Minecraft 1.0 was never \u0022final release\u0022 and nor would a KSP 1.0 if that ever happens. Infact Minecraft development still hasn\u0027t stopped, and its still packed with underdeveloped features like powered minecarts which have been left relatively useless not only by newer features, but older bugs that aren\u0027t resolved. Something KSP desperately needs is a real shakedown of the bugs in the engine, and a re-evaluation of how some of the features work. Far as I\u0027m aware seats still aren\u0027t a crewable part in KSP 0.22 for instance. Kerbals still fall through Kerbin ever since the terrain update but now do even more damage when this occurs. Quickload sometimes makes a horrible mess and acts like you\u0027ve just re-entered the atmosphere. Chunks of kerbin occasionally drops to minimum Level of Detail when in orbit.\u003C/p\u003E\u003Cp\u003ETo clarify though, I do like this update. The recover vessel button helps with one of the games core issues, which was it being horribly long winded to end a flight after a mission in Tracking Center (now don\u0027t need to go there) the tech tree adds something new and fun to do, (even if it is exploitable and argue-able in its layout) and the KSC changes add some new area for quick messing about. The new Landing Legs are pretty snazzy, and I don\u0027t mind having quirky science.\u003C/p\u003E\u003Cp\u003EI do hope bug and feature fixes gets some priority in the next update though, and if there are going to be Tutorials, make sure like another user said, its pretty slap in face unless turned off in the settings. That way you can appeal to new users significantly better then giving them a smaller playground but still leaving them to click and mash at random till something good happens.\u003C/p\u003E\n"},{"CreatedByName":"madbadger2742","CreatedById":82240,"CreatedDateTime":"2013-10-20T01:15:04Z","Content":"\n\u003Cp\u003EWow. \u003C/p\u003E\u003Cp\u003EEither:\u003C/p\u003E\u003Cp\u003EÃ¢â‚¬Â¢ Play the game, and be happy that you\u0027ve gotten so many good hours of game play out of your ~$20,\u003C/p\u003E\u003Cp\u003EÃ¢â‚¬Â¢ Give them reasonable suggestions for improving the game, and a reasonable amount of time to implement them, or\u003C/p\u003E\u003Cp\u003EÃ¢â‚¬Â¢ Stop playing and tell them why.\u003C/p\u003E\u003Cp\u003EConstructive criticism is good, and Squad are relying on it to develop the game. This is not constructive criticism. This is whining, pure and simple.\u003C/p\u003E\n"},{"CreatedByName":"IvanTehFennec","CreatedById":26927,"CreatedDateTime":"2013-10-20T01:16:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022madbadger2742\u0022 data-cite=\u0022madbadger2742\u0022\u003E\u003Cdiv\u003EWow. \u003Cp\u003EEither:\u003C/p\u003E\u003Cp\u003EÃ¢â‚¬Â¢ Play the game, and be happy that you\u0027ve gotten so many good hours of game play out of your ~$20,\u003C/p\u003E\u003Cp\u003EÃ¢â‚¬Â¢ Give them reasonable suggestions for improving the game, and a reasonable amount of time to implement them, or\u003C/p\u003E\u003Cp\u003EÃ¢â‚¬Â¢ Stop playing and tell them why.\u003C/p\u003E\u003Cp\u003EConstructive criticism is good, and Squad are relying on it to develop the game. This is not constructive criticism. This is whining, pure and simple.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you even into english?\u003C/p\u003E\u003Cp\u003EPlease see \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54056-Is-Squad-ditching-the-hardcore-player?p=713863\u0026amp;viewfull=1#post713863\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/54056-Is-Squad-ditching-the-hardcore-player?p=713863\u0026amp;viewfull=1#post713863\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E....and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54056-Is-Squad-ditching-the-hardcore-player?p=713737\u0026amp;viewfull=1#post713737\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/54056-Is-Squad-ditching-the-hardcore-player?p=713737\u0026amp;viewfull=1#post713737\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EActually, read the thread again.\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-20T01:16:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TouhouTorpedo\u0022 data-cite=\u0022TouhouTorpedo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThose talking about game versions and how its not \u0022Version 1.0\u0022 yet, or \u0022Wait for future versions!\u0022 Please no. That isn\u0027t how this type of game works, it never has been. Minecraft 1.0 was never \u0022final release\u0022 and nor would a KSP 1.0 if that ever happens. Infact Minecraft development still hasn\u0027t stopped, and its still packed with underdeveloped features like powered minecarts which have been left relatively useless not only by newer features, but older bugs that aren\u0027t resolved. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFelipe specifically said that this game is not Minecraft. It will have a definitive 1.0 release, at which point the game will be done. Whether or not they decide to release updates, or expansions, or DLC, or whatever they decide to call it at the time, after the release is another matter.\u003C/p\u003E\u003Cp\u003EWhat I (and hope others) are saying, is not \u0022wait until 1.0 for tutorials,\u0022 merely wait until the feature is done for tutorials. If they had spent time on tutorials now with the current \u0022love\u0022 the tech-tree is getting most of them may be worthless.\u003C/p\u003E\n"},{"CreatedByName":"FEichinger","CreatedById":58255,"CreatedDateTime":"2013-10-20T01:16:29Z","Content":"\n\u003Cp\u003EAlright, folks, I gave you \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54056-Is-Squad-ditching-the-hardcore-player?p=713558\u0026amp;viewfull=1#post713558\u0022 rel=\u0022external nofollow\u0022\u003Ea notice\u003C/a\u003E already.\u003C/p\u003E\u003Cp\u003EAs I\u0027ve said before, there\u0027s certainly some \u003Cstrong\u003Etruth\u003C/strong\u003E to the criticism here. The problem is merely that this almost instantly turns into a heated mess (And I\u0027m genuinely surprised you guys kept it clean this long. Kudos to everyone.). There\u0027s nothing wrong with making a \u003Cem\u003Ewell-grounded\u003C/em\u003E point for either side - and I, personally, certainly have my fair share of issues with .22 as well, so I would gladly support a thread pointing such stuff out in an elaborate and calm manner. But when such discussion starts off with accusations against Squad and ends in a lot of mudslinging from both sides, it just doesn\u0027t work.\u003C/p\u003E\u003Cp\u003EYou\u0027re certainly not going to convince Squad to \u0022cater\u0022 to either side by making assumptions about how their process goes and telling them how ****ty they are for not doing precisely what you want them to do. (For that matter, blindly jumping to Squad\u0027s defence and discrediting others purely based on their tone is \u003Cstrong\u003Enot\u003C/strong\u003E the way to go either. - I have to say this very directly here: The longer this discussion took, the more aggressive the \u0027defending\u0027 party got here.)\u003C/p\u003E\u003Cp\u003EI\u0027m closing this thread now to cool you all off. I fully \u003Cem\u003Eunderstand\u003C/em\u003E both sides getting heated - there are valid points for everyone here - but if we can point these out in a \u003Cem\u003Edecent\u003C/em\u003E manner then that\u0027s gonna be a \u003Cstrong\u003Egreat\u003C/strong\u003E thing to point people at.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFEichinger\u003C/strong\u003E\u003C/p\u003E\n"}]}