{"TopicId":49806,"ForumId":32,"TopicTitle":"Lightspeed to slow???","CreatedByName":"Foothill","CreatedById":74797,"CreatedDateTime":"2013-10-21T02:30:46Z","PageNum":1,"Articles":[{"CreatedByName":"Foothill","CreatedById":74797,"CreatedDateTime":"2013-10-21T02:30:46Z","Content":"\n\u003Cp\u003EBefore .22, KSP was ridiculously hard. Now it is ludicrously hard, and that\u0027s the way I like it.\u003C/p\u003E\u003Cp\u003EJust giving my thanks to the devs for the many hours given to make the most challenging game since Battletoads.\u003C/p\u003E\u003Cp\u003EPost if you agree that this one of the hardest and most fascinating games ever.\u003C/p\u003E\u003Cp\u003EWho made that man a gunner?\u003C/p\u003E\u003Cp\u003EI did sir, he\u0027s my cousin.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-10-21T03:03:53Z","Content":"\n\u003Cp\u003EI can confirm that 0.22 really upped the ante regarding difficulty for me. It\u0027s so hard, in fact, that I may have to go back to playing Minecraft on creative.\u003C/p\u003E\n"},{"CreatedByName":"Joe Shmoe","CreatedById":70465,"CreatedDateTime":"2013-10-21T03:03:54Z","Content":"\n\u003Cp\u003ETough but fun! I remember how exciting it was when I first made the major milestones of a space program (Sats, Kerbals in orbit, Mun stuff ect.) I\u0027m starting to branch put more by exploring the Kerbol system. I\u0027m expecting it to be challanging! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (This is referring to my sandbox game though, I\u0027m still getting started with career.)\u003C/p\u003E\n"},{"CreatedByName":"ASTRO_alec106","CreatedById":89533,"CreatedDateTime":"2013-10-21T03:08:12Z","Content":"\n\u003Cp\u003EKSP is a \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EVERY\u003C/span\u003E tough game, it is just so much fun though I haven\u0027t given up yet. Its almost like an addiction.\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-10-21T03:11:17Z","Content":"\n\u003Cp\u003EKSP is like that line from Apollo 13 when they\u0027re trying to solve the C02 scrubber problem. \u0022We gotta make this, fit into the hole for this, using nothing but that.\u0022 - Even more so in career mode (loving career mode, it\u0027s like a whole new game.)\u003C/p\u003E\u003Cp\u003EI\u0027ve always been a problem solver and backyard-engineer at heart. So tied up with my nerd love for space, this is my perfect game.\u003C/p\u003E\u003Cp\u003EAnother truely beautiful thing is that it doesn\u0027t take itself seriously. Having crazy little green men ride in your rockets gives you license to be utterly ridiculous, and how can you not love that. The concept is glorious.\u003C/p\u003E\n"},{"CreatedByName":"Crowdpleaser","CreatedById":79992,"CreatedDateTime":"2013-10-21T05:23:34Z","Content":"\n\u003Cp\u003EYes indeed. I don\u0027t think it is much harder than Sandbox Mode because the Tech Tree Limits you, and you have to take Babysteps in the beginning. The limitiation lets me Focus on one thing at a time. HarvesteR was right when he said the Game was Overwhelming for Newbies with all that Parts. He mentioned also that some may not read the description. I don\u0027t think so. I think that the descriptions focus more on humor than on actual useful Information. Some Parts don\u0027t have a description at all, just fluff text.\u003C/p\u003E\n"},{"CreatedByName":"Execute13","CreatedById":67802,"CreatedDateTime":"2013-10-21T06:45:06Z","Content":"\n\u003Cp\u003EI am yet to try career mode, but I\u0027m expecting it to be fun. As for he game itself? I actually haven\u0027t found it particularly hard so far, but then again, I am yet to go to a lot of the other planets. I spend a lot more time designing rockets than flying them, which annoys me.\u003C/p\u003E\n"},{"CreatedByName":"Brofessional","CreatedById":2080,"CreatedDateTime":"2013-10-21T07:03:21Z","Content":"\n\u003Cp\u003EIt\u0027s still easier than it used to be in the early versions.\u003C/p\u003E\n"},{"CreatedByName":"doggie015","CreatedById":51752,"CreatedDateTime":"2013-10-21T08:37:37Z","Content":"\n\u003Cp\u003EI am having fun in career mode! it provides a good incentive to improve my piloting skills!\u003C/p\u003E\n"},{"CreatedByName":"Vlk","CreatedById":57928,"CreatedDateTime":"2013-10-21T09:29:55Z","Content":"\n\u003Cp\u003EI played long enough in sandbox mode that carrier mode was not harder, it was just an other interesting challenge. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But i still learned a lot from it. Going through the tech tree was like a big tutorial for me (i tried to play through realistically, and not grinding). Before carrier mode, i used to put an orange tanks and a skipper or mainsail engines on everything i wanted to shoot up - from now on, i think i will use smaller lifters\u003C/p\u003E\n"},{"CreatedByName":"Swifty","CreatedById":57822,"CreatedDateTime":"2013-10-21T11:14:10Z","Content":"\n\u003Cp\u003EExplosions are fun even after hours of failed refinement \u003C/p\u003E\u003Cp\u003ERunning out of electricity, however is not.... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-10-21T12:54:06Z","Content":"\n\u003Cp\u003EI can\u0027t resist...the thread title....\u003C/p\u003E\u003Cp\u003E\u0022Light difficulty too easy?!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022Yes...we have to go to...Ludicrous Difficulty\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u0022*gasp* Ludicrous difficulty!? Sir, we\u0027ve never played that hard before! I don\u0027t think this game can handle it!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022What\u0027s the matter Colonel Sanders?! Chicken!?\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI regret nothing.\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-10-21T13:55:15Z","Content":"\n\u003Cp\u003EFinally got to play a bit over the weekend. Starting over with career mode is glorious. Thanks to the subassembly system, I\u0027m finding myself building proper series of rockets:\u003C/p\u003E\u003Cp\u003EHumble series are single-stage SRB rockets\u003C/p\u003E\u003Cp\u003EPatient series are single-stage LV-30 rockets\u003C/p\u003E\u003Cp\u003EFireball series are multi-stage built from stacking Humble stages\u003C/p\u003E\u003Cp\u003EHarmony series are multi-stage built from a Humble booster (later a Fireball booster) below a Patient rocket\u003C/p\u003E\u003Cp\u003EGooball series are science mission craft that repurpose a rocket from any series to do science\u003C/p\u003E\u003Cp\u003EI have to restrict myself from climbing the tech tree too quickly as I am swimming in science points after all my test launches and landings, but having a lot of fun.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-10-21T14:03:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ASTRO_alec106\u0022 data-cite=\u0022ASTRO_alec106\u0022\u003E\u003Cdiv\u003E*snip*Its almost like an addiction.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlmost like an addiction? No, no, it IS an addiction. This game should come with health warnings!\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2013-10-21T17:20:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlamedSteak\u0022 data-cite=\u0022FlamedSteak\u0022\u003E\u003Cdiv\u003EC02 scrubber problem. \u0022We gotta make this, fit into the hole for this, using nothing but that.\u0022 \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDUDE YOU ARE S RIGHT!\u003C/p\u003E\u003Cp\u003EI greatly enjoy problem solving games but even more so building games. Also Apollo 13 is a great movie \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewhat KSP needs now in my eyes is an easy multiplayer. Or a \u0022race to the mun\u0022 game or something like that...\u003C/p\u003E\n"},{"CreatedByName":"Jerjare","CreatedById":77247,"CreatedDateTime":"2013-10-21T17:41:17Z","Content":"\n\u003Cp\u003ECareer mode gives you a chance to play with equipment you might never bother with in sandbox. Its so easy to min-max things you really take it for granted when you have to use a \u0027less\u0027 efficient engine simply because that\u0027s all you have to work with at the moment. They wisely put orange tanks and mainsails at the end of the tech tree, really forcing you to get creative with other rocket engines and parts.\u003C/p\u003E\n"},{"CreatedByName":"Danish_Savage","CreatedById":49194,"CreatedDateTime":"2013-10-21T18:03:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foothill\u0022 data-cite=\u0022Foothill\u0022\u003E\u003Cdiv\u003EBefore .22, KSP was ridiculously hard. Now it is ludicrously hard, and that\u0027s the way I like it.\u003Cp\u003EJust giving my thanks to the devs for the many hours given to make the most challenging game since Battletoads.\u003C/p\u003E\u003Cp\u003EPost if you agree that this one of the hardest and most fascinating games ever.\u003C/p\u003E\u003Cp\u003EWho made that man a gunner?\u003C/p\u003E\u003Cp\u003EI did sir, he\u0027s my cousin.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cdn.memegenerator.net/instances/400x/37243289.jpg\u0022 alt=\u002237243289.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDear sir, I must tell you to tear out your eyes after seeing that movie, it\u0027s an abomination.\u003C/p\u003E\u003Cp\u003ENah, just kiddin\u0027 awesome reference\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rage097\u0022 data-cite=\u0022Rage097\u0022\u003E\u003Cdiv\u003EI can\u0027t resist...the thread title....\u003Cp\u003E\u0022Light difficulty too easy?!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022Yes...we have to go to...Ludicrous Difficulty\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u0022*gasp* Ludicrous difficulty!? Sir, we\u0027ve never played that hard before! I don\u0027t think this game can handle it!\u0022\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022What\u0027s the matter Colonel Sanders?! Chicken!?\u0022\u003C/em\u003E \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI so frakking love that movie. \u003C/p\u003E\u003Cp\u003EColonel Sandurz: Are we being too literal?\u003C/p\u003E\u003Cp\u003EDark Helmet: No you fool, we\u0027re following orders. We were told to comb the desert so we\u0027re combing it.\u003C/p\u003E\u003Cp\u003EAlso\u003C/p\u003E\u003Cp\u003EDark Helmet: I am your father\u0027s brother\u0027s nephew\u0027s cousin\u0027s former roommate.\u003C/p\u003E\u003Cp\u003EThehe \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T18:09:55Z\u0022 title=\u002210/21/2013 06:09  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by Danish_Savage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spatzimaus","CreatedById":57215,"CreatedDateTime":"2013-10-21T20:50:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foothill\u0022 data-cite=\u0022Foothill\u0022\u003E\u003Cdiv\u003EBefore .22, KSP was ridiculously hard. Now it is ludicrously hard, and that\u0027s the way I like it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee, I have to disagree. To me, KSP just isn\u0027t that hard; it\u0027s got a pretty steep learning curve, but the difficulty plateaus quickly after that. For the first day or so you might have a difficult time doing basic things like getting to orbit or docking, and it\u0027ll be a couple days before you land on any other planets, but once you\u0027re past that it\u0027s really not difficult to make a design capable of doing things successfully on the first try. The only times I had repeated failures after that initial learning period were when I tried entirely new things (like my first spaceplane), but again, once you\u0027ve had a little practice the difficulty goes away.\u003C/p\u003E\u003Cp\u003EThe later game\u0027s challenge, then, came from goals I\u0027d set for myself. Land on Eve and return. Land a giant rover (mobile refinery base) on Mun. Set up fuel depots around the major planets. Land an SSTO spaceplane on Mun. Put mapping probes in polar orbits around every planet and moon. Build a giant SSTO rocket booster capable of lifting a 500-ton payload into orbit. Do a Grand Tour. That sort of thing. But those are not really what I\u0027d consider \u0022difficult\u0022; in general, the basic concepts are no different than what I\u0027d done previously, it\u0027s just a difference of scale. Once you know how to manage thrust-to-weight ratios and delta-Vs it\u0027s not hard to make designs that can do these things, and the actual doing is no more difficult than the things you did earlier.\u003C/p\u003E\u003Cp\u003EDon\u0027t get me wrong, it\u0027s still a lot of fun and your designs will always have room for improvement. I just wouldn\u0027t categorize the game as \u0022ridiculously hard\u0022; it\u0027s more \u0022complex\u0022 than \u0022hard\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Alistone","CreatedById":60032,"CreatedDateTime":"2013-10-21T22:19:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brofessional\u0022 data-cite=\u0022Brofessional\u0022\u003E\u003Cdiv\u003EIt\u0027s still easier than it used to be in the early versions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI reflexively tend to agree with you... though it feels easier because we\u0027ve had practice... nothing quite compares to navigating and doing orbital rendevous before there was maneuver nodes.\u003C/p\u003E\u003Cp\u003EI still remember using the old trial version to land on the mun. You can land on an engine if you just set down really really really slow and straight. (No landing gear in the old trial version)\u003C/p\u003E\n"},{"CreatedByName":"Jordanpumah","CreatedById":47395,"CreatedDateTime":"2013-10-21T22:27:45Z","Content":"\n\u003Cp\u003Ei like career mode for the fact it makes you use the \u0022lesser\u0022 parts, I\u0027ve gotten further into the sol-ar system than ever before, and without those ludicrous mainsails,\u003C/p\u003E\u003Cp\u003Espaceballs is an awesome movie\u003C/p\u003E\n"},{"CreatedByName":"Kromey","CreatedById":57375,"CreatedDateTime":"2013-10-21T22:55:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JumpsterG\u0022 data-cite=\u0022JumpsterG\u0022\u003E\u003Cdiv\u003EI have to restrict myself from climbing the tech tree too quickly as I am swimming in science points after all my test launches and landings, but having a lot of fun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMe too. That\u0027s why, right away, I imposed a house rule on myself: After any mission that successfully returns science to the KSC, I can unlock \u003Cem\u003Eone\u003C/em\u003E node on the tech tree. The only time I allow myself to violate this rule is if, in the heat of the moment, I go from a successful mission straight into another successful mission, forgetting to go and get myself the next tech tree node in-between.\u003C/p\u003E\u003Cp\u003EThat being said, though, I\u0027m only 3 missions into career mode so far, and while all 3 have been successful and have returned gobs of SCIENCE! (well, not compared to some of you over-achievers who are touring the entire Jool system on Tier 1 parts!!), that\u0027s really not a lot. At all. So I reserve the right to modify or revoke this house rule at any time that I see fit, but so far it\u0027s been fun using these parts I wouldn\u0027t otherwise have even considered -- like SRBs, which while I have occasionally strapped a few on for kicks I\u0027ve never really made full use of until now.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jerjare\u0022 data-cite=\u0022Jerjare\u0022\u003E\u003Cdiv\u003ECareer mode gives you a chance to play with equipment you might never bother with in sandbox. Its so easy to min-max things you really take it for granted when you have to use a \u0027less\u0027 efficient engine simply because that\u0027s all you have to work with at the moment. They wisely put orange tanks and mainsails at the end of the tech tree, really forcing you to get creative with other rocket engines and parts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis sum up so perfectly why I love career mode. Well, that and having an actual in-game objective to accomplish (SCIENCE!), that is. But mostly this, the challenge of being restricted to certain parts yet still having my same lofty goals (some day I will leave the Kerbal system and visit other planets... some day...).\u003C/p\u003E\n"},{"CreatedByName":"Undeadbanana","CreatedById":89725,"CreatedDateTime":"2013-10-22T05:33:25Z","Content":"\n\u003Cp\u003EAfter a very long hiatus from the game, I\u0027ve come back and have enjoyed it even more than I did before.\u003C/p\u003E\u003Cp\u003EWhen I first started playing, there was just too many parts for this noob and I did get overwhelmed. Not really knowing how to build my rockets and having dozens of wobbly rockets that fell apart.\u003C/p\u003E\u003Cp\u003EI see the stock tech trees getting a lot of bad rep but for me, I enjoy them. They help me take each step slowly and actually get me wanting to complete missions to other planets to get more science.\u003C/p\u003E\u003Cp\u003EBut.. I feel the later stages of the tech tree need to be worked on. The baby steps helped me be able to launch stuff but it seems some things just feel too out of place, so I\u0027m going to be switching to one of the custom trees.\u003C/p\u003E\n"}]}