{"TopicId":50078,"ForumId":32,"TopicTitle":"If resources were to be implemented as the last stage before release of v1.0...","CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-10-22T19:08:10Z","PageNum":1,"Articles":[{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-10-22T19:08:10Z","Content":"\n\u003Cp\u003EI was thinking about Squad\u0027s numbering convention for the versions of KSP, and came up with this \u0022prediction\u0022...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E0 - 0.19\u003C/strong\u003E = Physics stage. Make sure the physics work. Add parts slowly from 0.11-0.19, mainly for physics testing.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E0.2x -0.29\u003C/strong\u003E = Slowly integrate the career mode, starting off with the science and tech tree.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E0.3x - 0.49\u003C/strong\u003E = Keep developing career mode, by further enhancing the tech tree (i.e. different modes of challenge). More science instruments and methods of collection, etc.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E0.5x - 0.79\u003C/strong\u003E = Add more biomes, possibly even more planets. Other minor tweaks, more parts etc. Also, redesign how mods work so that mods don\u0027t keep breaking the gameflow (i.e. saved games etc).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E0.8x - 0.89\u003C/strong\u003E = Add currency/economy and more parts. i.e. there will be several \u0022brands\u0022 of the SAME engine, with different prices, but also varying degrees of reliability.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E0.9x - 0.99\u003C/strong\u003E = since now there\u0027s a fully-functioning economy, then the last step is to add in the resource gathering, processing and use. In this stage, the development of space stations and surface bases (for processing resources) should also be enhanced in-game (not mods).\u003C/p\u003E\u003Cp\u003ESo as you can see, in my musings, it seems to make sense to put in resource collection as the last stage of development.\u003C/p\u003E\u003Cp\u003ESo my question is, \u003Cstrong\u003Eif you feel like you are the sort of player who is demanding for the resource gathering mode for career to be implemented ASAP (i.e. the next few releases), and you found out it won\u0027t be implemented until say, 0.93, will you still be playing KSP?\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-22T19:17:40Z\u0022 title=\u002210/22/2013 07:17  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 22, 2013\u003C/time\u003E by rodion_herrera\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nadreck","CreatedById":89087,"CreatedDateTime":"2013-10-22T19:16:11Z","Content":"\n\u003Cp\u003EWhy stop there? We need a Kerbal Oort cloud, nearby star systems, FTLD, asteroids (including Jool Trojans) along with multi vehicle simultaneous control and multi player. If what you suggest above takes 2-3 years, then yeah, I will still play for 10 more as the implement my suggestions.\u003C/p\u003E\n"},{"CreatedByName":"borisvolodnikov","CreatedById":78010,"CreatedDateTime":"2013-10-22T19:17:17Z","Content":"\n\u003Cp\u003EI don\u0027t care if stock resource gathering never makes it into the game - it\u0027s not a key feature for me. I suspect the economy portion will come WAY sooner than .8x, as it\u0027s rather fundamental to career mode...\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-10-22T19:20:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nadreck\u0022 data-cite=\u0022nadreck\u0022\u003E\u003Cdiv\u003EWhy stop there? We need a Kerbal Oort cloud, nearby star systems, FTLD, asteroids (including Jool Trojans) along with multi vehicle simultaneous control and multi player. If what you suggest above takes 2-3 years, then yeah, I will still play for 10 more as the implement my suggestions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t propose that it stop there--remember, the \u0022endpoint\u0022 of this prediction is \u003Cstrong\u003Eversion 1.0\u003C/strong\u003E, which means, there\u0027s lots of room for say, stellar travel etc, in KSP v1.2 or KSP v2.0 yes?\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-10-22T19:23:57Z","Content":"\n\u003Cp\u003EEvidence is already in place that the resource system may well be making an emergence at some point in the not-too-horribly-distant future (just read the flavor text for samples in almost any Mun biome). Also, the version numbers are not sequential in that fashion. We could just as easily see the 1.00 release after 0.99 as we could after 0.23. Neither is particularly likely, and to that point, it\u0027s ostensibly possible it will go up to 0.100 or beyond.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-10-22T19:25:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EAlso, the version numbers are not sequential in that fashion. We could just as easily see the 1.00 release after 0.99 as we could after 0.23.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI merely used that as a template to gauge user satisfaction, particularly among those who are getting tired of waiting for the resources portion of the game. It wasn\u0027t meant to illustrate that that is indeed how Squad will come about their plan of getting to v1.0.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2013-10-22T19:29:13Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E0.3x - 0.49\u003C/strong\u003E = Keep developing career mode, by further enhancing the tech tree (i.e. different modes of challenge). More science instruments and methods of collection, etc.\u003C/p\u003E\u003Cp\u003EI think the big advent of .3-.49 is going to be the resource intergration. not that is a must see for me, but the progression I see lends me to think it is next. i think the money aspect will enter somewhere between .25-.35. I see a definate push towards charging money for parts... and I have to say it scares me a little. i can\u0027t even balance a checkbook\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2013-10-22T19:31:05Z","Content":"\n\u003Cp\u003EIt isn\u0027t a decimal point.\u003C/p\u003E\u003Cp\u003EIt\u0027s a version number. 1.0 happens when ever they decide they are done... Or at least done enough to call it 1.0. \u003C/p\u003E\u003Cp\u003E1.0 is not the next update after .99 ... that\u0027s .100 They could keep right on counting up if they wanted to .9999999999999. or they could release 1.0 right after .37 as an example.\u003C/p\u003E\n"},{"CreatedByName":"Torham234","CreatedById":58574,"CreatedDateTime":"2013-10-22T19:32:00Z","Content":"\n\u003Cp\u003EI fully expect the KSP to still be in alpha this time next year. And no I do not really care about the resource gathering as such.\u003C/p\u003E\u003Cp\u003E I am far more interested in other areas of the game like:\u003C/p\u003E\u003Cp\u003E- improved aerodynamics ( make fairings and nose cones useful), reentry heat\u003C/p\u003E\u003Cp\u003E- Working economy (pay for fuel and rockets, get government grants/private contracts etc etc)\u003C/p\u003E\u003Cp\u003E- fully implemented tweakables ( choose type of fuel for your fuel tanks, deltaV displays, solid booster plugs...)\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-10-22T19:35:36Z","Content":"\n\u003Cp\u003EMy own take is as follows, incidentally:\u003C/p\u003E\u003Cp\u003EThe resource system is currently sitting at somewhere around the 66 to 75% completion mark already, sitting in the wings waiting to be completed. It was first slated for 0.19 release, but at the time it was clear that certain key features were just not there yet which would make resources a sensible addition yet. They\u0027re quite clearly meant to be a benefit for career mode, which wasn\u0027t even up to implementation yet. So the system was shelved temporarily, and plans were put into place for how sandbox would be wrapped up over the next few revisions. We hit that point with 0.21, and have entered the next phase: career mode development. 0.22 was the start of this process, and 0.23 will be a continuation. Likely what we will see next are: the addition of biomes to most or all of the other bodies, followed by the addition of some form of economic model, followed by the addition of resources, and once all of THAT is in place, then the implementation of missions for career mode will begin. Said missions will focus on the acquisition of resources and science to further the development of Kerbalkind.\u003C/p\u003E\u003Cp\u003E Again, this is just my take based on what has happened so far, and I could be way off on this. But the evidence seems to suggest that it\u0027s at least a likely path for things to go.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-10-22T19:37:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FITorion\u0022 data-cite=\u0022FITorion\u0022\u003E\u003Cdiv\u003EIt isn\u0027t a decimal point.\u003Cp\u003EIt\u0027s a version number. 1.0 happens when ever they decide they are done... Or at least done enough to call it 1.0. \u003C/p\u003E\u003Cp\u003E1.0 is not the next update after .99 ... that\u0027s .100 They could keep right on counting up if they wanted to .9999999999999. or they could release 1.0 right after .37 as an example.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay then, for your satisfaction...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage I\u003C/strong\u003E = Physics stage. Make sure the physics work. Add parts slowly from 0.11-0.19, mainly for physics testing.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage II\u003C/strong\u003E (where we are now) = Slowly integrate the career mode, starting off with the science and tech tree.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage III\u003C/strong\u003E = Keep developing career mode, by further enhancing the tech tree (i.e. different modes of challenge). More science instruments and methods of collection, etc.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage IV\u003C/strong\u003E = Add more biomes, possibly even more planets. Other minor tweaks, more parts etc. Also, redesign how mods work so that mods don\u0027t keep breaking the gameflow (i.e. saved games etc).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage V\u003C/strong\u003E = Add currency/economy and more parts. i.e. there will be several \u0022brands\u0022 of the SAME engine, with different prices, but also varying degrees of reliability.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELast stage (prior to release)\u003C/strong\u003E = since now there\u0027s a fully-functioning economy, then the last step is to add in the resource gathering, processing and use. In this stage, the development of space stations and surface bases (for processing resources) should also be enhanced in-game (not mods).\u003C/p\u003E\n"},{"CreatedByName":"Will Fawkes","CreatedById":85847,"CreatedDateTime":"2013-10-22T19:47:54Z","Content":"\n\u003Cp\u003EEven with the omission s of Jool Trojans, oort Cloud, Other star systems, and all the timeline you outlined alone would be pretty awesome.\u003C/p\u003E\n"},{"CreatedByName":"PwnedDuck","CreatedById":54398,"CreatedDateTime":"2013-10-22T19:52:38Z","Content":"\n\u003Cp\u003EI\u0027m so goddam tired of career mode. I want more stuff to do and ways to do it, not hoops to jump through in order to do the things. Every update since 0.19 I\u0027ve just played for an hour or two, then stopped because there really isn\u0027t that much more to do...\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-10-22T19:56:15Z","Content":"\n\u003Cp\u003EThe devs have said the current focus is career mode, I don\u0027t expect currency to be in some stage V, I\u0027ll honestly be surprise if the starts of an economy isn\u0027t in .23 that\u0027s the next big part of career mode, and career mode is what they are working on right now.\u003C/p\u003E\n"},{"CreatedByName":"toric5","CreatedById":58046,"CreatedDateTime":"2013-10-22T20:08:28Z","Content":"\n\u003Cp\u003Ethe thing is, resources are integral to both sandbox and career mode. in sandbox, it is a way to refuel etc. (possibly even fabricate parts) and in career, it is that and a way to get money and research.\u003C/p\u003E\n"},{"CreatedByName":"Dwight_js","CreatedById":83255,"CreatedDateTime":"2013-10-22T20:42:19Z","Content":"\n\u003Cp\u003EDoes it logically make more sense to develop the resource gathering before layering the economy on top? Just like we\u0027re finding out how quickly you can max-out the tech tree, wouldn\u0027t you first want to make sure that the resource gathering aspect is well balanced before implementing money? Adjusting the monetary side seems simpler to me than adjusting the types and distribution of resources, you just change the price of things then let all us testers loose to see how we cope.\u003C/p\u003E\n"},{"CreatedByName":"jfx","CreatedById":37282,"CreatedDateTime":"2013-10-22T20:44:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EOkay then, for your satisfaction...\u003Cp\u003E\u003Cstrong\u003EStage I\u003C/strong\u003E = Physics stage. Make sure the physics work. Add parts slowly from 0.11-0.19, mainly for physics testing.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage II\u003C/strong\u003E (where we are now) = Slowly integrate the career mode, starting off with the science and tech tree.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage III\u003C/strong\u003E = Keep developing career mode, by further enhancing the tech tree (i.e. different modes of challenge). More science instruments and methods of collection, etc.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage IV\u003C/strong\u003E = Add more biomes, possibly even more planets. Other minor tweaks, more parts etc. Also, redesign how mods work so that mods don\u0027t keep breaking the gameflow (i.e. saved games etc).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage V\u003C/strong\u003E = Add currency/economy and more parts. i.e. there will be several \u0022brands\u0022 of the SAME engine, with different prices, but also varying degrees of reliability.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELast stage (prior to release)\u003C/strong\u003E = since now there\u0027s a fully-functioning economy, then the last step is to add in the resource gathering, processing and use. In this stage, the development of space stations and surface bases (for processing resources) should also be enhanced in-game (not mods).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven if these stages of yours were to be finished within a single update that would mean a KSP release around spring 2015.\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2013-10-22T20:47:49Z","Content":"\n\u003Cp\u003EI basically expect KSP to still be in Alpha at this time next year as well. At their current release cadence, even if a few of the next releases are a little easier (tech tree and research was a damned complicated/big release).\u003C/p\u003E\u003Cp\u003EI\u0027d imagine they\u0027ll still see a 6-8wk release cadence with some outliers one way or another.\u003C/p\u003E\u003Cp\u003EI\u0027d bet my left nut (please don\u0027t make me give it up HarvestR!) that the next release is going to be adding in the actual economy/money to career mode, along with probably some part balancing and tech tree/research tweaks/balancing.\u003C/p\u003E\u003Cp\u003EAfter that, damnedifiknow. Probably still a focus on career. I\u0027d expect either working re-entry heat and/or life support probably aren\u0027t too far away as both sandbox and career enhancements.\u003C/p\u003E\u003Cp\u003EI\u0027d also expect to see a bit more focus on making space stations and dirt side bases (parts and reasons to exist).\u003C/p\u003E\u003Cp\u003EI think resource mining and utilization are several releases off. I don\u0027t think they are \u0022right before Beta release\u0022, but I do think they are going to end up being several releases away. I think economy is the next big thing as it\u0027ll add a huge amount to career mode.\u003C/p\u003E\u003Cp\u003EThen I think they\u0027ll focus on more career mode polishing with some things that carry over to sandbox. Then I think it might be resources as that potentially adds a huge amount to sandbox and some to career if implemented there as well (possibly suplementing economy).\u003C/p\u003E\u003Cp\u003EI do think in the next release or the next 1-3 releases we\u0027ll see those biomes get add to all the planets and possibly having them cosmetically updated as well (ala the Mun and Kerbin). However, I don\u0027t think that\u0027ll be the focus of any of the releases, I think it\u0027ll just be add-on features.\u003C/p\u003E\u003Cp\u003EI could be wrong though, .23 could be all about balancing the tech tree, tweaking research/science and \u0022filling in\u0022 the planets. Though if they are going to do that, adding in what they are think are the final planets and configurations would be nice in a way. Or we could have a version .22.1 that maybe fixes any outstanding bugs in .22 and maybe fills in some of the planets for all I know.\u003C/p\u003E\u003Cp\u003EWill we find out today? Who knows, but I am very eagerly looking forward to the Kerbal Report.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-10-22T20:48:02Z","Content":"\n\u003Cp\u003EI won\u0027t be surprised if SQUAD announces they are going to add basic resources in 0.23. I think it would be logical to first add foundations of career mode elements: science, resources, economy, crew training etc. When everything is in place, then progress of work on career will be more organic. There will be time to tweak and polish everything as it grows. What OP is proposing - resources as a last thing to be added when everything else is more or less in place, equals to welding a huge container of stuff to already built ship.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-10-22T20:48:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jfx\u0022 data-cite=\u0022jfx\u0022\u003E\u003Cdiv\u003EEven if these stages of yours were to be finished within a single update that would mean a KSP release around spring 2015.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, another goal of this thread was perhaps to tease out a discussion on what one would predict to be a likely release date of v1.00, and what such a predicted date would mean to the different kinds of KSP players. I mean, say, if a person who perhaps just recently purchased KSP found out that say, it won\u0027t really be finished until 2015, would he feel he got what he paid for?\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-10-22T20:51:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lazarus1024\u0022 data-cite=\u0022lazarus1024\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027d also expect to see a bit more focus on making space stations and dirt side bases (parts and reasons to exist).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe prerequisite of this, is that a resource system is in place, and that these stations would be the base of resource processing operations. After all, what is the logic of having bases in far off worlds, or orbital stations, if the sole purpose is just to build them there?\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-10-22T20:52:51Z","Content":"\n\u003Cp\u003EI will never stop playing. This game is endless in its possibilities and I have full confidence Squad will bring us down the best possible course of development.\u003C/p\u003E\n"},{"CreatedByName":"adge","CreatedById":85309,"CreatedDateTime":"2013-10-22T20:53:11Z","Content":"\n\u003Cp\u003EI\u0027m happy to continue playing, even if resources are late coming. There is plenty to keep me busy right now, and playing slowly and deliberately, I hope to stretch out the enjoyment and limit the tedium that could develop. With any luck a new update will be ushered in before I hit that stage, then I start start over \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2013-10-22T20:53:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EOkay then, for your satisfaction...\u003Cp\u003E\u003Cstrong\u003EStage I\u003C/strong\u003E = Physics stage. Make sure the physics work. Add parts slowly from 0.11-0.19, mainly for physics testing.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage II\u003C/strong\u003E (where we are now) = Slowly integrate the career mode, starting off with the science and tech tree.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage III\u003C/strong\u003E = Keep developing career mode, by further enhancing the tech tree (i.e. different modes of challenge). More science instruments and methods of collection, etc.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage IV\u003C/strong\u003E = Add more biomes, possibly even more planets. Other minor tweaks, more parts etc. Also, redesign how mods work so that mods don\u0027t keep breaking the gameflow (i.e. saved games etc).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage V\u003C/strong\u003E = Add currency/economy and more parts. i.e. there will be several \u0022brands\u0022 of the SAME engine, with different prices, but also varying degrees of reliability.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELast stage (prior to release)\u003C/strong\u003E = since now there\u0027s a fully-functioning economy, then the last step is to add in the resource gathering, processing and use. In this stage, the development of space stations and surface bases (for processing resources) should also be enhanced in-game (not mods).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think your stages are still messed up. HarvestR mentioned being close to a working economy with the .22 release, but he thought it wouldn\u0027t make the cut. So it sounds like it is likely to be in the next release as the main focus. Which puts it much earlier. Also a lot of your other things, like filling in the Biomes and stuff, all though I am sure a resonable amount of work, doesn\u0027t sound like anything that would even rise to a full release, let alone possibly several releases.\u003C/p\u003E\u003Cp\u003EFor the later stage stuff, SQUAD has mentioned that reliability will NOT be occuring in the game. No worries that a part or engine might randomly fail. Wouldn\u0027t that suck if there could be random part failures and you just lost a mission after 3 hours of real world time? I\u0027d be pretty annoyed. Bad enough if \u003Cstrong\u003EI\u003C/strong\u003E screwed something up, I don\u0027t need random stuff breaking in game as a feature.\u003C/p\u003E\u003Cp\u003EGoing back though, I do think the next 2-3 releases are going to be very career focused. After that it is just too up in the air. As HarvestR explained around .19, they are in asymptote mode. As features get expanded, adding meaninful game play value for that feature requires increasing amounts of work. I think until Career is to a point where it takes a lot more work to expand it just a small amount, I think they may refocus on sandbox...or focus on things that expand both of them roughly equally (like resources).\u003C/p\u003E\u003Cp\u003EI do think career mode is going to take a few more release to get it to where they are happy though.\u003C/p\u003E\u003Cp\u003EResearch/science is big/huge and I love it. However, I think there is going to be a lot more than simply giving you money and a budget to finishing off career mode and the possible cross over a resources in to career mode (I hope there will be a mission system at some point among other things).\u003C/p\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-10-22T20:54:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EActually, another goal of this thread was perhaps to tease out a discussion on what one would predict to be a likely release date of v1.00, and what such a predicted date would mean to the different kinds of KSP players. I mean, say, if a person who perhaps just recently purchased KSP found out that say, it won\u0027t really be finished until 2015, would he feel he got what he paid for?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs some one who has already sunk 104 hours into her coppy of KSP, and payed 22usd...\u003C/p\u003E\u003Cp\u003EYea, I definatly feel like I have got my monies worth out of it, it is second only to skyrim and fallout new vegas in play time...\u003C/p\u003E\u003Cp\u003ECome to think of it, I notice a trend in the 3 games I mod most I play most. ._.;\u003C/p\u003E\n"}]}