{"TopicId":50598,"ForumId":32,"TopicTitle":"Make up your mind KSP! (But it\u0027s not really bad)","CreatedByName":"Noname115","CreatedById":85518,"CreatedDateTime":"2013-10-25T23:56:13Z","PageNum":1,"Articles":[{"CreatedByName":"Noname115","CreatedById":85518,"CreatedDateTime":"2013-10-25T23:56:13Z","Content":"\n\u003Cp\u003ESo, if you have been reading my posts about my KSP issues, you know what this will be about. But not like that. KSP, once again, has tried going back to no lagging. But, I think I may have found out why. It turns out that the application for KSP in it\u0027s folder is different from the KSP game in Steam. Along with going onto the launcher and turning on an option that \u0022may increase performance\u0022, it actually runs smoother than ever now. I even have it set to medium graphic settings and it\u0027s still fine. My only solution I could have come with is that Steam just didn\u0027t like KSP for some unknown reason. Weird. But I\u0027m just overjoyed now. Unless within the next hour of when I post this thread it starts lagging again... I really, REALLY hope not. Oh well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jordanpumah","CreatedById":47395,"CreatedDateTime":"2013-10-26T02:30:46Z","Content":"\n\u003Cp\u003EI am genuinely confused by your post.\u003C/p\u003E\u003Cp\u003Eand that\u0027s strange, I never get confused\u003C/p\u003E\n"},{"CreatedByName":"Thogapotomus","CreatedById":83257,"CreatedDateTime":"2013-10-26T03:20:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jordanpumah\u0022 data-cite=\u0022Jordanpumah\u0022\u003E\u003Cdiv\u003EI am genuinely confused by your post.\u003Cp\u003Eand that\u0027s strange, I never get confused\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame lol. \u003C/p\u003E\u003Cp\u003EHow is the KSP app not in the same folder? Did you move it or do you have a steam version in addition to squads?\u003C/p\u003E\n"},{"CreatedByName":"Noname115","CreatedById":85518,"CreatedDateTime":"2013-10-26T19:54:01Z","Content":"\n\u003Cp\u003EWhen I took a look inside the folders, it had it\u0027s own shortcut to the game. I tried it out. Now it works fine. Trust me, I don\u0027t exactly know either. But hey, as long as my KSP doesn\u0027t lag, I\u0027m not complaining!\u003C/p\u003E\n"}]}