{"TopicId":52042,"ForumId":32,"TopicTitle":"Kraken Experience","CreatedByName":"UnthinkableThinker","CreatedById":83885,"CreatedDateTime":"2013-11-06T00:22:33Z","PageNum":1,"Articles":[{"CreatedByName":"UnthinkableThinker","CreatedById":83885,"CreatedDateTime":"2013-11-06T00:22:33Z","Content":"\n\u003Cp\u003ESo you\u0027ve finally adjusted and coordenated an encounter with Jool, but suddenly, from the depths of the universe, the Kraken attacks you, tearing your Jool dream to pieces. I personally hate it when it happens, having to start almost everything over again, since it comes out of nothing. So, have you ever been attacked by the fiersome Kraken? Tell us your story of survival (or not) and if you\u0027ve managed to get away from it!\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2013-11-06T00:28:09Z","Content":"\n\u003Cp\u003EF5 is your torch and your canon to fight the Beast!\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2013-11-06T01:21:52Z","Content":"\n\u003Cp\u003EYou definitely want the torch (f5), or you are likely to be eaten by a grue- err... Kraken.\u003C/p\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2013-11-06T01:42:45Z","Content":"\n\u003Cp\u003EBut remember that F5 (quicksave) isn\u0027t complete without F9 (load quicksave).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-06T01:52:27Z\u0022 title=\u002211/06/2013 01:52  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 6, 2013\u003C/time\u003E by Pipcard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2013-11-06T01:44:23Z","Content":"\n\u003Cp\u003ENever around Jool... I have had Kraken attacks elsewhere though. I once had it attack the VAB made my simple test rocket turn into a giant pocupine looking thing (was fun watching it explode when I hit launch at least). \u003C/p\u003E\u003Cp\u003EAlso fairly recently had it attack while returning to Kerbin, before I even got into the atmo my capsule just went boom, not sure how or why.\u003C/p\u003E\n"},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2013-11-06T01:49:45Z","Content":"\n\u003Cp\u003EI sent a bunch of spaceplanes to Laythe...\u003C/p\u003E\u003Cp\u003EWhen they got there, the Kraken had eaten the landing gear. I kid you not.\u003C/p\u003E\u003Cp\u003EI currently have a bunch of planes I can\u0027t land docked at a station at Laythe, and a few very bored Kerbals waiting for a fresh delivery of planes.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-06T11:35:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pipcard\u0022 data-cite=\u0022Pipcard\u0022\u003E\u003Cdiv\u003EBut remember that F5 (quicksave) isn\u0027t complete without F9 (load quicksave).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EF5 is the cannon, F9 is the cannonball\u003C/p\u003E\n"},{"CreatedByName":"Kestan","CreatedById":78189,"CreatedDateTime":"2014-02-01T12:49:57Z","Content":"\n\u003Cp\u003EBuilding a base on eve.\u003C/p\u003E\u003Cp\u003Ei was sending a ship loaded with 6 drones/tiny rovers down to my base eve, after a smooth flight and a perfect encounter i line up my decent, drop the droe after deploying their parachutes, everythings fine sipping my pepsi, watching them float on there merry way down to my base, one of them hadn\u0027t survived but i was fine with that, then boom. 3 of them blow up, and im presuming because they where so close to each other bits fly off and destroy parts of the other ones to the point i could not use them. cuddle you kraken. cuddle you.\u003C/p\u003E\u003Cp\u003Ei forgot to press the beloved F5 key, flm\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022\u0022 alt=\u0022XauSYBq.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-01T13:21:20Z\u0022 title=\u002202/01/2014 01:21  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 1, 2014\u003C/time\u003E by sjwt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-02-01T19:30:20Z","Content":"\n\u003Cp\u003EI had the Kraken give my ship an inappropriate touch on my way to Gilly, but fortunately it was just a warning and my ship didn\u0027t explode, just wobbled a bit. I think it wanted to remind me that it was out there and to beware next time.\u003C/p\u003E\n"},{"CreatedByName":"Baenki","CreatedById":67219,"CreatedDateTime":"2014-02-02T13:55:28Z","Content":"\n\u003Cp\u003EMaybe the attack on me was mod induced (B9 \u0026amp; Remotetech \u002B a few others in a fresh install). I have built a network of 3 massive ( i think 10t each) comsats and after that i started a probe lander mission to the mun.\u003C/p\u003E\u003Cp\u003EThe lander had an additioal small comsat packed that i deployed in mun orbit. After that i switched to the lander, but it was gone. Going into map view and back out made it visible again, but my Sas went ape**** while landing and i couldn\u0027t control it anymore. (Note: There was a stable remote tech connection.)\u003C/p\u003E\u003Cp\u003EAfter this fail i switched back to one of the 3 comsats in KEO. It was invisible too and was brought back to visibility using the map. When i activated SAS the solar panels started to wobble like crazy. 5 seconds later there was a rapid unplanned disassembly which ripped the satellite into 20-30 pieces. Some of them did explode, some went into solar escape, but most of them stayed in a cluster in KEO.\u003C/p\u003E\u003Cp\u003ESo WTF. Does somebody know if this kraken could be a parasite brought to the game by a mod?\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-02-02T14:22:29Z","Content":"\n\u003Cp\u003EI\u0027ve had my fair share of Kraken attacks as well.\u003C/p\u003E\u003Cp\u003EThe most recent one was with the Gyro Kraken. I was sending my ship out of Kerbin\u0027s inner atmosphere and heading to Minmus, as I haven\u0027t visited her in a while. But suddently, the Gyro Kraken nabbed the rocket with it\u0027s tentacles, and spun it out of control, wrecking everything but the Mk1-2 Pod and the adjacent Rockomax Brand Decoupler.\u003C/p\u003E\u003Cp\u003EFortunately, Bill, Jeb and Bob were not harmed in the process, but casualties include several Kerbals being killed by the raining debris, $100,000 gone to waste, and a very angry Minmus for not recieving the scheduled visit.\u003C/p\u003E\n"},{"CreatedByName":"PUNiSH3R","CreatedById":102377,"CreatedDateTime":"2014-02-02T21:10:31Z","Content":"\n\u003Cp\u003EDunno if this is Kraken activity or not, but it certainly had its way with the expensive half of my Mun base...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/98buUSb.png\u0022 alt=\u002298buUSb.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"flyin_ruski","CreatedById":60421,"CreatedDateTime":"2014-02-02T23:51:41Z","Content":"\n\u003Cp\u003EHad a space plane docked to a interplanetary pusher ship and was maybe 200 meters out with a fuel ship to fuel the plane an pusher. At around 100 meters I could see parts just fall apart. I quick saved/loaded several times at different distances and my final one was 75 meters and both the spaceplane and pusher vanished. Tracking station showed the craft but it said \u0022landed at KSC.\u0022 \u003C/p\u003E\u003Cp\u003E I switched to it and it was 72000ish meters above KSC frozen. Couldn\u0027t IVA,EVA, stage, or activate engines. I tired editing the persistence file but nothing. All I could do was hit recover vessel.\u003C/p\u003E\n"},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2014-02-03T10:02:22Z","Content":"\n\u003Cp\u003EJool craft usually explode during touchdown, and it\u0027s not a glitch. You simply can\u0027t land on the gas giant \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-02-03T12:04:36Z","Content":"\n\u003Cp\u003EThe Kraken once shoved the launch pad into the VAB. Don\u0027t ask me how.\u003C/p\u003E\n"}]}