{"TopicId":53535,"ForumId":32,"TopicTitle":"Mapping the planets interior","CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-11-18T15:38:41Z","PageNum":1,"Articles":[{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-11-18T15:38:41Z","Content":"\n\u003Cp\u003ENow that we have science, I think that if we take data from all the science equipment to make rough estimates of the planets interiors.\u003C/p\u003E\u003Cp\u003EFirst off, with the mention of \u0022faint seismic waves\u0022 on Minmus, and taking from what I learned in science class, that means Minmus must atleast have a very small liquid core or mantle, and it must atleast have very small tectonic plates, but we don\u0027t see any trenches on Minmus, which points to it being almost geologically dead.\u003C/p\u003E\u003Cp\u003EI could probably draw a rough estimate for the interior, but my mom took my computer for a week (I\u0027m suffering without ksp \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E) so I won\u0027t be able to for a few days.\u003C/p\u003E\u003Cp\u003ECorrect me if I\u0027m wrong at any point.\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2013-11-18T15:46:40Z","Content":"\n\u003Cp\u003ECould be measuring impacts.\u003C/p\u003E\u003Cp\u003EThe Mun readings definitely indicate impacts... and Minmus should not be immune to them. It\u0027s also way smaller than the Mun... and there\u0027s no giant planet around to heat it with tidal forces... it would have to be a solid rock under whatever that surface is made of.\u003C/p\u003E\u003Cp\u003EQuakes in and of themselves do not indicate a liquid core or mantel. The change in velocity of the waves passing through our core is how we know it\u0027s there. Quakes do not have to be caused by tectonic activities.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-18T15:49:10Z\u0022 title=\u002211/18/2013 03:49  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 18, 2013\u003C/time\u003E by FITorion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-18T15:56:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deadpangod3\u0022 data-cite=\u0022Deadpangod3\u0022\u003E\u003Cdiv\u003E(I\u0027m suffering without ksp \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy friend, regardless if I agree with your mother or whatever it was you did to make her do it - if you are now feeling this way, you should take a step back from the game anyway. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the upside you will have all week to do research on this!\u003C/p\u003E\u003Cp\u003E(Now, where do these paternal feelings come from...)\u003C/p\u003E\n"},{"CreatedByName":"paleorob","CreatedById":60059,"CreatedDateTime":"2013-11-18T15:56:41Z","Content":"\n\u003Cp\u003EIt could have a liquid core but probably not based on its size. As FITorion points out any seismic activity is likely the result of impacts. IRL our moon has \u0022moonquakes\u0022 but no tectonics.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2013-11-18T16:11:17Z","Content":"\n\u003Cp\u003ESince Minmus is rather small, with hardly any mass, and there are no rocky debris in the Kerbol system, could it be that your ship caused the vibrations?\u003C/p\u003E\n"},{"CreatedByName":"el_coyoto","CreatedById":49292,"CreatedDateTime":"2013-11-18T16:12:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022paleorob\u0022 data-cite=\u0022paleorob\u0022\u003E\u003Cdiv\u003EIt could have a liquid core but probably not based on its size. As FITorion points out any seismic activity is likely the result of impacts. IRL our moon has \u0022moonquakes\u0022 but no tectonics.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wikipedia\u0022 data-cite=\u0022wikipedia\u0022\u003E\u003Cdiv\u003EAccording to NASA, there are at least four different kinds of moonquakes:\u003Cp\u003E Deep moonquakes (~700 km below the surface, probably tidal in origin)\u003C/p\u003E\u003Cp\u003E Meteorite impact vibrations\u003C/p\u003E\u003Cp\u003E Thermal moonquakes (the frigid lunar crust expands when sunlight returns after the two week lunar night)\u003C/p\u003E\u003Cp\u003E Shallow moonquakes (20 or 30 kilometers below the surface)\u003C/p\u003E\u003Cp\u003EThe first three kinds of moonquakes mentioned above tend to be mild; however, shallow moonquakes can register up to 5.5 on the Richter scale. Between 1972 and 1977, twenty-eight shallow moonquakes were observed. On Earth, quakes of magnitude 4.5 and above can cause damage to buildings and other rigid structures.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESource : \u003Ca href=\u0022https://en.wikipedia.org/wiki/Quake_%28natural_phenomenon%29#Moonquake\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Quake_%28natural_phenomenon%29#Moonquake\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWow, I didn\u0027t think moonquakes could be so violent...\u003C/p\u003E\u003Cp\u003EThe idea of a 5.5 moonquake in low gravity is frightening to say the least. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"}]}