{"TopicId":54410,"ForumId":32,"TopicTitle":"Ever had troubles with Kessler syndrome? a.k.a \u0027Gravity\u0027","CreatedByName":"Wampa842","CreatedById":85841,"CreatedDateTime":"2013-11-26T11:45:52Z","PageNum":1,"Articles":[{"CreatedByName":"Wampa842","CreatedById":85841,"CreatedDateTime":"2013-11-26T11:45:52Z","Content":"\n\u003Cp\u003EI recently collided a personnell and resource transport with my space station in LKO. It created a nice big cloud of debris. It\u0027s staying together as of yet. I know the pieces will drift away eventually, but it got me to think: has anyone ever had troubles with Kessler syndrome? A.k.a has anyone re-enacted the movie \u0027Gravity\u0027?\u003C/p\u003E\n"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2013-11-26T11:51:29Z","Content":"\n\u003Cp\u003EI have no actual science to back this up, but in my opinion Gravity is wrong. The debris should be on a eccentric orbit from the space station. \u003C/p\u003E\u003Cp\u003EI have tons of debris in orbit, but never suffered from the Kessler syndrome. It must be a lottery win to actually experience that.\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-11-26T12:10:04Z","Content":"\n\u003Cp\u003EA debris cloud should drift apart eventually due to the nature of orbital mechanics. Even two screws a millimetre apart will eventually drift as they are at different altitudes and therefore rotating their body of influence slightly out of synch.\u003C/p\u003E\u003Cp\u003EPlus an explosive cloud of debris should scatter off into very different orbital trajectories. Hopefully most of it will be intercepting the atmosphere at some point.\u003C/p\u003E\u003Cp\u003EI\u0027d actually be really surprised if a Kessler syndrome would be possible to create in KSP, you\u0027d need an awful lot of crap up there and I\u0027m not even sure if ksp models collisions that are out of your field of view.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T12:14:04Z\u0022 title=\u002211/26/2013 12:14  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by FlamedSteak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"doggie015","CreatedById":51752,"CreatedDateTime":"2013-11-26T12:21:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlamedSteak\u0022 data-cite=\u0022FlamedSteak\u0022\u003E\u003Cdiv\u003EA debris cloud should drift apart eventually due to the nature of orbital mechanics. Even two screws a millimetre apart will eventually drift as they are at different altitudes and therefore rotating their body of influence slightly out of synch.\u003Cp\u003EPlus an explosive cloud of debris should scatter off into very different orbital trajectories. Hopefully most of it will be intercepting the atmosphere at some point.\u003C/p\u003E\u003Cp\u003EI\u0027d actually be really surprised if a Kessler syndrome would be possible to create in KSP, you\u0027d need an awful lot of crap up there and I\u0027m not even sure if ksp models collisions that are out of your field of view.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t even simulate them in your field of view if you time accelerate...\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/QWosyn17e4U?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Requiem762","CreatedById":82185,"CreatedDateTime":"2013-11-26T13:25:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galileo Kerbonaut\u0022 data-cite=\u0022Galileo Kerbonaut\u0022\u003E\u003Cdiv\u003EI have no actual science to back this up, but in my opinion Gravity is wrong. The debris should be on a eccentric orbit from the space station. \u003Cp\u003EI have tons of debris in orbit, but never suffered from the Kessler syndrome. It must be a lottery win to actually experience that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s a lot wrong with the movie.\u003C/p\u003E\n"},{"CreatedByName":"Bacterius","CreatedById":69384,"CreatedDateTime":"2013-11-26T13:36:29Z","Content":"\n\u003Cp\u003EAn integral part of Kessler syndrome is that debris collide with one another and multiply at an exponential rate. KSP doesn\u0027t model that, so it\u0027s hard to get those really high debris densities where low orbit is basically permeated with tiny debris that erode your station over time, and the occasional paint fleck that drives a hole through the cockpit and kills everyone on board. In KSP it\u0027s just a big decoupler-sized debris that passes by at orbital speeds taking half your station with it if you are unlucky enough to collide with it (which is very rare, as you need near perfect orbit matching for the debris to intercept your station, so unless you are doing it deliberately or have somehow entered resonance with a debris, it almost never happens).\u003C/p\u003E\u003Cp\u003EAnd Gravity is nothing like real life. There aren\u0027t \u0022killer debris clouds\u0022 in space that come back every orbit with perfect coherence, they average out to evenly permeate their orbits rather quickly, and the debris certainly were not thrown in near identical orbits to begin with.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T13:38:48Z\u0022 title=\u002211/26/2013 01:38  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by Bacterius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-11-26T13:52:37Z","Content":"\n\u003Cp\u003ETrouble with it? Well, not really, at least so far. I\u0027m actually off to do some experiments in Sandbox as to how much junk can be floating around before it starts to become common enough to run into it... I think I\u0027ll build a ship designed to turn into a million pieces (a big bunch of stack separators and other assorted bits and bobs should do the trick).\u003C/p\u003E\n"},{"CreatedByName":"Travisfv","CreatedById":63966,"CreatedDateTime":"2013-11-26T14:18:49Z","Content":"\n\u003Cp\u003EI purposefully make sure that my launches never leave anything in orbit. Even if I have a large amount of fuel in a stage, if I see that staging will leave it in a persistant orbit, I use what I can but always drop in into the atmosphere. And the new way I\u0027ve been doing my launches kinda ensures I don\u0027t need more than 200 m/s to circularize at my apogee.\u003C/p\u003E\n"},{"CreatedByName":"RickRastardly","CreatedById":78405,"CreatedDateTime":"2013-11-26T14:28:52Z","Content":"\n\u003Cp\u003EI\u0027ve often been tempted to build two large ships and put them in opposite orbits, just to see what would happen, I\u0027d imagine it would be an excellent technical feat to get them to connect at a closing speed of over 4200m/s\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2013-11-26T14:55:56Z","Content":"\n\u003Cp\u003EI did something like that as well. Built a payload (mostly separators and small trusses) specifically to simultate a large debris field (about 500\u002B parts).\u003C/p\u003E\u003Cp\u003EUnfortunately, after getting 3 of these into orbit (about 60 deg apart) the debris caused the map view to stutter horribly. FPS dropped to about 10 or less.\u003C/p\u003E\u003Cp\u003EWhat was interesting was watching what happened to the debris fields over time. Over a period of a few days the 3 fields had spread out into a crescent with 3 knots where the payloads have been \u0027detonated\u0027. After a few weeks game time they had become a fairly distributed ring of debris with only slight concentrations where the initial payload popped.\u003C/p\u003E\u003Cp\u003EIf I had watched for longer, I\u0027d bet it would oscillate, clumping up, thinning out and so on. I had planned on putting up more and seeing how much of a danger it posed my space program. However, I hadn\u0027t anticipated the effect it would have on the map view.\u003C/p\u003E\u003Cp\u003EOf course since Kerbin is so small the orbit is pretty tight. In Earth orbit I imagine this process would take quite a bit longer. But the results would indeed be the same.\u003C/p\u003E\n"},{"CreatedByName":"purpletarget","CreatedById":57317,"CreatedDateTime":"2013-11-26T15:16:16Z","Content":"\n\u003Cp\u003EIf you want to see a real life example of an incident that give Gravity it\u0027s semi-plausible premise, check this out:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/6gNVZBLcezs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThe ISS crew has been sent to their shelters on occasion for close debris encounters such as this.\u003C/p\u003E\n"},{"CreatedByName":"radonek","CreatedById":84077,"CreatedDateTime":"2013-11-26T15:20:13Z","Content":"\n\u003Cp\u003EI don\u0027t think its possible in KSP. First, you can\u0027t really smash your rockets to pieces, collisions only tear parts apart. There is no \u0022piece of metal from larg orange tank\u0022 part. Second, number of objects involved in true kessler syndrome is HUGE and required calculations would sooner blow your computer to pieces. Not like physics calulactions are not trying to fry CPU even with just small number of parts, right? Which is why KSP actually have a limit on number of debris, look around settings panel.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2013-11-26T15:27:47Z","Content":"\n\u003Cp\u003EThe whole point of a kessler cascade is that it keeps spreading out due to micro-collisions within the debris cloud, so what happened in the movie could happen...... but they\u0027d never see the same pieces of debris twice. Each time they\u0027d hit a different part of the debris field. Each time it hits them it gains more debris from the stuff it smashes up.\u003C/p\u003E\u003Cp\u003ESure you can\u0027t simulate the micro-collisions, but if you search youtube for \u0022ksp kessler bomb\u0022, you can see the stuff spreads out in the game, just due to the fact when you explode the spaceship. stuff flies in different directions, and eventually moves apart due to each part being given a different velocity by the initial explosion.\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2013-11-26T16:03:47Z","Content":"\n\u003Cp\u003ETrue, but it would never happen like they depicted. They depicted it as if once the satellite blew up the debris stopped and the shuttle and what not would pass through it every orbit.\u003C/p\u003E\u003Cp\u003EIn reality it would take quite a while that debris to be an issue. Plus, considering such satellites are in different orbits entirely, it would likely be a non-starter for such a drama. However reading some of the reviews, the director did acknowledge that they understood all that and tried to sacrifice as little as possible to keep the realism at max while still having a story to tell. Otherwise, like I said, there wouldn\u0027t be a story.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-11-26T17:01:25Z","Content":"\n\u003Cp\u003EIn my opinion, the focus of Gravity was on the people and the situation they were in as opposed to scientific accuracy. They could have done the film on a remote ship in the Atlantic and still not lost much. (Well, besides cool visual effects of Earth).\u003C/p\u003E\u003Cp\u003EAs others have mentioned though, the debris just explodes as opposed to shrapnelling into thousands of pieces, and even if it did, space is mostly empty so the chances of a collision are pretty low.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-11-26T17:25:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EIn my opinion, the focus of Gravity was on the people and the situation they were in as opposed to scientific accuracy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe thing that drives me insane is that the two goals are not mutually exclusive; frequently it\u0027s just laziness that makes movies completely implausable. If you need one or two \u0022magic\u0022 technologies or impossibilities to make the plot work that\u0027s fine, but if the entire movie is just WRONG then I can\u0027t enjoy it at all.\u003C/p\u003E\n"},{"CreatedByName":"TheBadAstronomer","CreatedById":89508,"CreatedDateTime":"2013-11-26T18:07:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Requiem762\u0022 data-cite=\u0022Requiem762\u0022\u003E\u003Cdiv\u003EThere\u0027s a lot wrong with the movie.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECome on guys, does it matter if every little detail is right? The movie is for your entertainment, and it doesn\u0027t matter if they got some minuscule detail wrong.\u003C/p\u003E\u003Cp\u003EI\u0027ve never had that problem with debris, as I deorbit most of it.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-11-26T18:40:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheBadAstronomer\u0022 data-cite=\u0022TheBadAstronomer\u0022\u003E\u003Cdiv\u003ECome on guys, does it matter if every little detail is right? The movie is for your entertainment, and it doesn\u0027t matter if they got some minuscule detail wrong.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t classify is as a \u0022miniscule\u0022 detail, but you are right in the fact that it\u0027s a \u003Cem\u003Emovie\u003C/em\u003E, not a documentary and that it doesn\u0027t matter as long as the movie is enjoyable to watch. Most movies have their facts wrong. Sometimes out of ignorance of the movie makers (directors, script writers, producers), sometimes because... well, it makes a better movie.\u003C/p\u003E\u003Cp\u003EEven within the frame of reference you\u0027ll find inaccuracies everywhere. Consider Terminator Two, where at one point the friendly T800 is repairing a car \u003Cem\u003Eand asking for a torque wrench\u003C/em\u003E. He\u0027s a friggin\u0027 robot. He \u003Cem\u003Eknows\u003C/em\u003E what force he\u0027s extorting! Why would he be asking for a torque wrench?\u003C/p\u003E\u003Cp\u003ESee? Movies are full of BS. Even when you\u0027re not looking for it. But what counts is that they\u0027re entertainable.\u003C/p\u003E\n"},{"CreatedByName":"Boris_T_Roach","CreatedById":27512,"CreatedDateTime":"2013-11-26T18:49:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RickRastardly\u0022 data-cite=\u0022RickRastardly\u0022\u003E\u003Cdiv\u003EI\u0027ve often been tempted to build two large ships and put them in opposite orbits, just to see what would happen, I\u0027d imagine it would be an excellent technical feat to get them to connect at a closing speed of over 4200m/s\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve tried it with 2 big stations with impressive solar arrays sticking out as something extra to aim at\u003C/p\u003E\u003Cp\u003EWhat you have to do is to get 1 into a perfect circular orbit and then match the other one to it\u003C/p\u003E\u003Cp\u003EThe trouble is.... at 4300m/s closing speed and the 2.5km \u0027bubble\u0027 around your current ship, they will only be approching for something like 0.5 of a second... maybe 10 or 15 frames and you have to hope that the PC does the frame with the distance at 0\u0027is meters, if it calculates the frame at 150 meters apart, the next frame with be with the target receding at 4.3km/sec...\u003C/p\u003E\u003Cp\u003ENot to say it wont happen but its damned hard\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-11-26T18:59:18Z","Content":"\n\u003Cp\u003EYes, that was my biggest pet peeve about the movie. The ISS does have a 90 minute orbital period, but if the debris was traveling at a higher relative velocity than the station, as it was, the debris would have to be in an elliptical orbit. This means the debris would take more than 90 minutes to reach the ISS\u0027s altitude, and the ISS would not be in the same place at that time either. But imagine how boring the movie would be if the debris only came around once.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-11-26T19:00:03Z","Content":"\n\u003Cp\u003ENo, it\u0027s impossible to experience this in KSP.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tank Buddy\u0022 data-cite=\u0022Tank Buddy\u0022\u003E\u003Cdiv\u003EYes, that was my biggest pet peeve about the movie. The ISS does have a 90 minute orbital period, but if the debris was traveling at a higher relative velocity than the station, as it was, the debris would have to be in an elliptical orbit. This means the debris would take more than 90 minutes to reach the ISS\u0027s altitude, and the ISS would not be in the same place at that time either. But imagine how boring the movie would be if the debris only came around once.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDebris was probably in polar orbit (Russian satellite, spying). Then the only thing you need to forget is that it wouldn\u0027t impact the station every time because there\u0027s no reason everything is matched up perfectly. But it\u0027s a part of the plot\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T19:04:49Z\u0022 title=\u002211/26/2013 07:04  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-11-26T19:08:50Z","Content":"\n\u003Cp\u003EI\u0027ve tried *very* hard to take down one of my space stations with debris. I built an orbital \u0022debris cannon\u0022 which is basically just a bunch of tiny fuel tanks (I needed the mass, in order for them to do any damage), and managed to fit one hundred or so onto a big orange tank. Any more than that and it would have been unplayable due to lag. Anyway I put it on a rendezvous orbit with my space station and let the debris fly. No matter how close I got to my space station though, the debris seemed to just fly right past it. It wasn\u0027t until I flew within 100m and fired that I actually hit anything. The results were pretty spectacular:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/9rMrxVFSaFQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EHowever, given the difficulty of using Kessler syndrome in even a controlled environment, I\u0027d say it\u0027s impossible to have it become a problem in-game. This may be due to the fact that if the debris is that thick then it will either be removed from the game, or (if unlimited debris is on) cause the game to lag to the point of being unplayable.\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-11-26T19:13:41Z","Content":"\n\u003Cp\u003EAs has been said already. KSP does not simulate any collisions when you are not controlling things.\u003C/p\u003E\u003Cp\u003EAs for the movie gravity. Its just one of those things. Although its innacurate its only us mad science nerds that actually notice it, for a member of joe public it seems like an extremely plausible movie. Heck everyone likes star wars and that couldnt be further from reality.\u003C/p\u003E\u003Cp\u003EIts like any move. Those who are experts in the movies \u0022field\u0022 are going to notice all the innacuracies. Does this mean they wont enjoy it? Im an automotive engineer and the fast and furious franchise (even the early ones) are still an enjoyable watch even with the hordes of stuff that is just \u0022wrong\u0022 (manifold overheats so the passenger footwell falls out?)\u003C/p\u003E\u003Cp\u003EI haevnt seen gravity yet (As i really dont see sandra bullock pulling off that role along with the fact that i cant stand her!) but it looks to be a good\u0027en. The only sci-fi movie i have seen that tries to be as accurate as possible was the europa report and even that has stuff that could be pointed out as wrong due to it still trying to be a movie.\u003C/p\u003E\u003Cp\u003EEDIT: I\u0027ve started a new save and have built a station in retrograde direction around kerbin. The rest of the save will be as normal but with an emphasis on taking as much debris up with you (procedural fairings is talented at this as this gives me a minimum of 4 debris with every mission)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T19:19:30Z\u0022 title=\u002211/26/2013 07:19  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by vetrox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"User Unrelated","CreatedById":74021,"CreatedDateTime":"2013-11-26T19:15:40Z","Content":"\n\u003Cp\u003Eactual kesseler syndrome in KSP?\u003C/p\u003E\u003Cp\u003Ebe prepared for 0.25 fps.\u003C/p\u003E\u003Cp\u003EI almost collided with some debris the other day... when I say \u0022almost\u0022, I mean 8km away\u003C/p\u003E\u003Cp\u003Ebut that\u0027s still the closest I\u0027ve ever come to debris.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1273.photobucket.com/albums/y402/UU92/KSP/screenshot210_zps9ee90f72.png\u0022 alt=\u0022screenshot210_zps9ee90f72.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eit got much closer, but I was busy concentrating on my LKO exit burn.\u003C/p\u003E\n"},{"CreatedByName":"Halo_003","CreatedById":76050,"CreatedDateTime":"2013-12-12T06:52:29Z","Content":"\n\u003Cp\u003EI had a piece of a launched launched in an orbit opposite to the orbit of my space station. It flew by today when I was docking a module to the station, and came within 1km actually. It was also moving 4300m/s relative to my station, so it would have been spectacular if it had impacted.\u003C/p\u003E\n"}]}