{"TopicId":54522,"ForumId":32,"TopicTitle":"I plugged KSP on national public radio","CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2013-11-27T19:21:20Z","PageNum":1,"Articles":[{"CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2013-11-27T19:21:20Z","Content":"\n\u003Cp\u003EDiane Rehm was hosting a discussion on video games today. I managed to get on the radio to make a comment and had the chance to plug KSP as a positive educational video game experience. I had mixed feelings about some of what was said but it was a pretty good program overall, I got to make my comments just a little after 44:10.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://thedianerehmshow.org/audio-player?nid=18603\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://thedianerehmshow.org/audio-player?nid=18603\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"purpletarget","CreatedById":57317,"CreatedDateTime":"2013-11-27T21:31:40Z","Content":"\n\u003Cp\u003EWell Played!\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2013-11-28T02:31:09Z","Content":"\n\u003Cp\u003EJust listened for your part right now, I\u0027ll have to give the rest a listen at some point.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-11-28T02:42:53Z","Content":"\n\u003Cp\u003EEh... Don\u0027t like how the commentator didn\u0027t really acknowledge what you said \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Makes me wonder if they were actual gamers or just people who examine the industry from the outside. Still, nice comment nonetheless. I love her show and just recently got to call and make a comment to so I am happy xD\u003C/p\u003E\n"},{"CreatedByName":"Needles_10","CreatedById":59554,"CreatedDateTime":"2013-11-28T03:36:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmpsterMan\u0022 data-cite=\u0022AmpsterMan\u0022\u003E\u003Cdiv\u003EEh... Don\u0027t like how the commentator didn\u0027t really acknowledge what you said \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Makes me wonder if they were actual gamers or just people who examine the industry from the outside. Still, nice comment nonetheless. I love her show and just recently got to call and make a comment to so I am happy xD\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey seem to completely miss the point proposed by the OP. It\u0027s sad how the OP mentioned \u0022KSP (the educational game of Rocket Science)\u0022, and the commentators went to \u0022parents playing with their kids\u0022 which the kids will \u0022enjoy more\u0022. KSP is the infinite maximum of video game enjoyment. These commentators were simply blind to the point he was making: THE VAST MAJORITY OF VIDEO GAMES ARE ACTUALLY GOOD.\u003C/p\u003E\n"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2013-11-28T04:07:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Needles_10\u0022 data-cite=\u0022Needles_10\u0022\u003E\u003Cdiv\u003EThey seem to completely miss the point proposed by the OP. It\u0027s sad how the OP mentioned \u0022KSP (the educational game of Rocket Science)\u0022, and the commentators went to \u0022parents playing with their kids\u0022 which the kids will \u0022enjoy more\u0022. KSP is the infinite maximum of video game enjoyment. These commentators were simply blind to the point he was making: THE VAST MAJORITY OF VIDEO GAMES ARE ACTUALLY GOOD.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s probably because they never heard of it and they don\u0027t know what they\u0027re talking about. I hate this ongoing discussion. Early 1900 it was about motion pictures, 1960 it was about rock/pop music etc. Each and every time there is a new form of entertainment a certain group of people freaks out because they don\u0027t understand what\u0027s going on. A never ending story.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-11-28T04:50:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmpsterMan\u0022 data-cite=\u0022AmpsterMan\u0022\u003E\u003Cdiv\u003EEh... Don\u0027t like how the commentator didn\u0027t really acknowledge what you said \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Makes me wonder if they were actual gamers or just people who examine the industry from the outside. Still, nice comment nonetheless. I love her show and just recently got to call and make a comment to so I am happy xD\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the normal tactic on this her show to be honest, she tries to make sure that the point brought up is forced home. Other opinions other than the original statement are usually swept under or completely dismissed. I doubt highly the guests, other than the OP of course, would be real gamers in the true sense of the term. Most likely they are people who played some games in their youth and now, having kids of their own, do not want them to play. However I have not heard todays show so I may give it a listen in the AM and see how close I am on those points, and if I am wrong I will gladly admit it. \u003C/p\u003E\u003Cp\u003EAlso if the theme was games are the reason for violence, then how do they explain all the violence before video games? I have always question this thinking as I have played my share of violent games and non-violent ones, and I seem fairly well adjusted (I refuse to call myself normal). Sorry for getting a bit ranty on this subject, and to the OP well played on getting word to a different market.\u003C/p\u003E\n"},{"CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2013-11-28T05:29:54Z","Content":"\n\u003Cp\u003EIt seemed like there were a few different perspectives on board, a couple of people who either worked for the gaming industry or reported on it (spoke favorably of EA, didn\u0027t respond at all to the mention of indie titles), a therapist who counseled parents on curtailing video game \u0022addiction\u0022 (how to create conflict with your kids without ever solving anything), and a doctor/scientist who studies/advocates a link between video games and undesirable behavior. I could be remembering the particulars of the panel wrong, but what it always boils down to for some of these people is video games are bad and my kid needs to stop and go play sports. what they don\u0027t seem to get is that games are more diverse than they know and one game is going to have very different effects than another and that games can be an act of self-actualization and building self-worth for young people. when a parent pushes back against gaming in this case they\u0027re really pushing against their child\u0027s exploration of themselves and/or a vehicle that child has chosen to build their sense of self-worth. Too often parents try to be a dam against gaming, when they should be a rudder.\u003C/p\u003E\n"},{"CreatedByName":"TheSuperintendnt","CreatedById":47102,"CreatedDateTime":"2013-11-28T06:33:01Z","Content":"\n\u003Cp\u003EOne of the big reasons I started playing games so much was it helped relieve stress from the day (mainly school), and for me that was really important as my OCD (hence my status) like most peoples is fueled by stress. So I would play games because it was the one thing I could do and not have OCD interfere!\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2013-11-28T10:42:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galileo Kerbonaut\u0022 data-cite=\u0022Galileo Kerbonaut\u0022\u003E\u003Cdiv\u003EThat\u0027s probably because they never heard of it and they don\u0027t know what they\u0027re talking about. I hate this ongoing discussion. Early 1900 it was about motion pictures, 1960 it was about rock/pop music etc. Each and every time there is a new form of entertainment a certain group of people freaks out because they don\u0027t understand what\u0027s going on. A never ending story.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe clear lack of any background research into the field before trying to tell people about something is terrible. Here\u0027s a group of people who are trying to convince people that video games are bad or that video games should be carefully monitored by or played with parents, yet they fail to understand that a fairly large percentage of games are actually educational in some way, even if they were never designed to be. Take Minecraft, mentioned on the show. If you want to start complaining about video games and haven\u0027t heard of one of the biggest small-developer games ever made, then you should probably stop telling people what to do and look up some popular games before making what you intend to be an informational talk.\u003C/p\u003E\n"},{"CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2013-11-28T13:50:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheSuperintendnt\u0022 data-cite=\u0022TheSuperintendnt\u0022\u003E\u003Cdiv\u003EOne of the big reasons I started playing games so much was it helped relieve stress from the day (mainly school), and for me that was really important as my OCD (hence my status) like most peoples is fueled by stress. So I would play games because it was the one thing I could do and not have OCD interfere!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you\u0027re right on it there! Video games can be a kind of escapism but in this pop-debate you never hear anyone examine why a young person might be needing an excess of escapism. Noone says, my child needs to reduce stress. Instead, its simply my child has a video game problem. \u003C/p\u003E\u003Cp\u003EI think its fair to say that a small percentage of people have real functional problems with video game habits, but a \u003Cem\u003Esmall\u003C/em\u003E percentage. One of the things that get rolled into this is parents who say to themselves, oh no! my child is doing nerdy things instead of baseball! AAAH! If my kid wants to play baseball I have to (grudgingly) learn about sports. How many parents know the first thing about the gaming culture their children find a home in?\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-11-28T14:05:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Epthelyn\u0022 data-cite=\u0022Epthelyn\u0022\u003E\u003Cdiv\u003EIf you want to start complaining about video games and haven\u0027t heard of one of the biggest small-developer games ever made, then you should probably stop telling people what to do and look up some popular games before making what you intend to be an informational talk.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat applies to pretty much everything, not just video games. Crusaders against [XYZ] will consider [XYZ] evil because of some preconceptions. Since [XYZ] is such an evil they will not touch it or look at it. Talking to subject matter experts about [XYZ] is like talking to Satan\u0027s henchmen, so that is not done either. Once you start looking for it you will realize that this does not just apply to video games but to \u003Cem\u003Eany\u003C/em\u003E subject where there\u0027s a strong vocal lobby against it.\u003C/p\u003E\u003Cp\u003ETo gain acceptance, the polarizing element has to be neutralized (in general from both sides). That usually takes an extreme amount of time. After that, public opinion swings quickly from getting an hour time on PBS to \u0022meh, there\u0027s \u003Cem\u003Ethem\u003C/em\u003E again.\u0022 In this case the polarizing element is young children in a very influential phase in their life playing cynical games with no respect for human life. We\u0027ve had the same discussion about comics. There\u0027s just certain material you don\u0027t want to give to 6 year olds, even when it\u0027s extremely high quality (Art Spielelmann\u0027s \u003Cem\u003EMaus\u003C/em\u003E comes to mind). The discussion right now is \u0022video games are bad for little children. Look at GTA\u0022 and the response should be \u0022WTF lets their grammar school kids play GTA?\u0022\u003C/p\u003E\n"},{"CreatedByName":"Kialar","CreatedById":60893,"CreatedDateTime":"2013-11-28T14:33:10Z","Content":"\n\u003Cp\u003EIt\u0027s the same everywhere. Someone is going amok - it must be because of ego shooters. Ego shooters are video games - video games will force people to do wrong things or mix up the gamers mind until total insanity.\u003C/p\u003E\u003Cp\u003EThe sad fact is, those people talking about the dangers of gaming are (very often) digital foreigners. No idea of nothing that defines a digital native\u0027s way of life.\u003C/p\u003E\u003Cp\u003EMight sound harsh and somehow generalized, but it resembles my experience: The most loud bad-bad-gaming-complainers are those who are to stupid to find the power switch on a PC.\u003C/p\u003E\u003Cp\u003EAnd this means not, that every child of a given age should play every game around unadvised. I see the parents of a kid responsible for teaching their offspring media competency.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-11-28T16:24:45Z","Content":"\n\u003Cp\u003EThe following is going to be a Wall-o-Text, it reflects thoughts that I have had floating in my head for some time. It is personal and close to the heart.\u003C/p\u003E\u003Cp\u003ENow that I am moving into adulthood, I have spent some time thinking about what effects video games have had on my life. The more I think about it, the more I realize that video games, even noneducational ones have taught me things. I would like to talk about just two games for now, they are not an exhaustive list mind you, just the ones I feel like sharing. If there is any other demand for more, I would gladly share them. These two games are Runescape and Call of Duty.\u003C/p\u003E\u003Cp\u003ERunescape: Probably the one game that has taught me the most about real life. How so? Mainly in two ways. It\u0027s economic system and it\u0027s skills system. When I first started playing at the age of 13 I had no grasp of the concept of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Opportunity_cost\u0022 rel=\u0022external nofollow\u0022\u003E opportunity cost\u003C/a\u003E To make money I would mine iron ores and try to sell them because I really enjoyed mining. Then, later on I started making my own iron knives and selling them as well to make money. After a certain time, I met a player by the name of KComet who would buy coal from me. He taught me that my time in game is worth as much money as I can make in game. If i could gain experience by buying materials, as long as it is less than what I make in an hour, I would be gaining skills faster. How do i apply this today? If doing something myself will cost me more in time than just working equal amount of hours to pay for someone else to do it, excluding extraneous circumstances, I don\u0027t do it and pay for someone else to do it.\u003C/p\u003E\u003Cp\u003EThe second thing I learned, and I think this is the more important one, is that learning a skill has \u003Ca href=\u0022https://en.wikipedia.org/wiki/Diminishing_returns\u0022 rel=\u0022external nofollow\u0022\u003Ediminishing returns\u003C/a\u003E. In Runescape, getting to level 50 in any skill requires 100k experience points. To get to 99, the maximum, requires about 13.5 Million experience points. That is, it takes 135 times more experience to max a skill than to just have basic competence in it. Experience points in Runescape translate to time almost proportionally. Therefore, maxing a skill takes a WHOLE lot more time than being competent in it. This is the case in real life. It is much easier to be a competent employee than it is to be the best employee. It is much easier to be a competent father than the best father. It is much easier to be a competent student than it is to be the best Student. Now this might sound very disheartening, but it isn\u0027t. In fact, In Runescape, a player with 60-70 in any skill could be said to be a good player, those correlate to 270k to 730k of experience which is not unattainable. Me being a bit of a perfectionist, RS taught me that it is okay to not be the best at everything; it is actually remarkably easy to be competent at most things, and worth it to be good at a few things. If one wants to be the best, you have to dedicate ALL of your energy to accomplishing it, anything else is wasted effort.\u003C/p\u003E\u003Cp\u003EThe second game I learned from is Call of Duty. Whereas RS taught me that it is very difficult to be good at everything, but easy to be relatively good at something, CoD taught me that one\u0027s abilities determine both one\u0027s speed with which one learns skills and that our skills are more or less capped by our natural abilities. I am by no means a good FPS player, therefore when all of my friends were playing CoD and were good at it I was lagging behind. Yet, I realized that there was a niche that my group didn\u0027t have covered. Since all of my friends were run-and-gun types they wanted to have all of the good killstreaks, no one wanted to be support. Therefore, I made a class that had an M16, with Hardline-Pro, a stinger missle, 3 Stun Grenades, extreme conditioning. My killstreaks were UAV, Counter-UAV, and Drop Package. Why did I do this? All I would day all game long would be drop easy UAVs, be the first one to shoot down opposing UAVs or Killstreaks, cover my teamates with Stun grenades, and run for any objectives. That is, while I was not particularly skilled I did use what little skill I had and I made a niche for myself. I was usually a favorite on my friends\u0027 teams because I did all the little things.\u003C/p\u003E\u003Cp\u003EHow have I applied these in real life today? Well, as a 21 year old in the workplace, I am not particularly skilled compared to others. I do however have a skill that is slightly higher than others, that is computer skills. Therefore, I use my computer knowledge to leverage my relatively poor skills in other areas, while simultaneously trying to train them to a level of competence. Along the way, I have noticed there is a niche in my company for someone who is skilled in computers but also skilled in the day to day operations of company. I act as a sort of interface for two people in my company, our IT guy and our Office Services guy because I have skills in both areas. While I recognize that this level of generality isn\u0027t optimal in the long run, in the short run I have been able to find a niche that allows me to hold a job and learn skills important for the workplace in the future.\u003C/p\u003E\u003Cp\u003ETL;DR Video games can teach a lot more than just what is on the surface. If one tries to really dig deep and see things, one can learn anything from anything in life.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-28T17:35:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wbcundiff\u0022 data-cite=\u0022wbcundiff\u0022\u003E\u003Cdiv\u003EI think you\u0027re right on it there! Video games can be a kind of escapism but in this pop-debate you never hear anyone examine why a young person might be needing an excess of escapism.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what I thought when listening to this program. The debate was around the negative side of gaming, exaggerated into a huge and the only concern. I understand that it\u0027s a natural and healthy concern of any parent, that his kids are safe, but speculating and exploiting it is cheap and does not help the matters. Abundant anecdotes they told do not prove anything, nor speak of reasons and consequences.\u003C/p\u003E\u003Cp\u003EAnd what anecdotes did not speak of were the kids themselves. All I noticed was the concern, exaggerated to unhealthy scale, and taken forward to restriction. Just block gaming. No questioning why a kid does this, how\u0027s his relationships, is he ok at school, etc. Just restrictive protection. Which is inefficient (you can go to a friend and play there), does not solve the problem. The problem is not gaming, but how fulfilling one\u0027s life is. In 1950s, when our country was urbanizing, many parents and grandparents were concerned with kids reading books rather than playing outside. My parents, in 1990-s insisted on the opposite.\u003C/p\u003E\u003Cp\u003ERestrictive protection, which is stronger these days with more survelliance and stronger governments, protects from short term issues, but leaves growing children unprepared for challenges. Kids at the age of 1-3 years need to run and fall, to learn to balance. They need to burn and cut their fingers to learn that ovens and knifes are dangerous, and to learn to use them safely too. Children at the age of 10-13 need to go for walks and have a private place to learn to socialize and cooperate. They need to try out all sorts of materials, sights and motion activity out there in the wild, -- that\u0027s why kids at 7 and above go not to playgrounds, but to construction and industrial sites.\u003C/p\u003E\u003Cp\u003EDespite games teaching something, I think real life is usually much more stimulating. So playing videogames too much means there\u0027s a problem, means life is not fulfilling. But you can\u0027t fix it by just blocking games, and what is to be discussed is how parents can fill it, how to add, not merely substract. \u003C/p\u003E\u003Cp\u003EAnd I think OP\u0027s statement wasn\u0027t brushed off, it was just not heard. All they thought of was restriction and control, and that\u0027s why they took your example as a form of control, i.e. playing together.\u003C/p\u003E\u003Cp\u003EThanks for posting thing, was though provoking. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T23:18:15Z\u0022 title=\u002211/28/2013 11:18  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Kulebron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2013-11-28T17:55:11Z","Content":"\n\u003Cp\u003EI think Kerbal Space Program is one of the most brilliant games of the year.\u003C/p\u003E\u003Cp\u003EC\u0027mon guys, think about it, it\u0027s teaching kids basic rocket science. I\u0027ve never played such a fun \u003Cem\u003Eand\u003C/em\u003E educational game in life.\u003C/p\u003E\n"},{"CreatedByName":"Moach","CreatedById":9,"CreatedDateTime":"2013-11-29T05:16:55Z","Content":"\n\u003Cp\u003Ewhen me and my brother were kids, our mother used to say playing games all day would make us crazy... but we did it anyways\u003C/p\u003E\u003Cp\u003Eshe said we should turn it off and go play outside... we didn\u0027t\u003C/p\u003E\u003Cp\u003Eand insisted that no teacher would ever give us grades for our skills in gaming... yes unlikely, but.... \u003C/p\u003E\u003Cp\u003Eeventually she stopped being bothered as much, seeing how we were not actually going crazy - at least not as much as she expected, i think...\u003C/p\u003E\u003Cp\u003Ebut she was never completely ok with that, at least not for many years... \u003C/p\u003E\u003Cp\u003Efast forward a couple of decades: me and my brother now both work creating games... \u003C/p\u003E\u003Cp\u003Eand even though we ended up living in countries separated by the whole latitude range of the United States, we have developed our careers in jobs that prove mother wrong with every title we release...\u003C/p\u003E\u003Cp\u003Eone of such, is KSP\u003C/p\u003E\u003Cp\u003E...and pursuing my second degree in the field of game development, I have also found there IS a teacher who gives grades for those skills I mentioned.... his class is called \u0022History of Games\u0022 -- and it\u0027s about those very same ones that should have made us \u0022crazy\u0022\u003C/p\u003E\u003Cp\u003Ebut ok, games are bad, aren\u0027t they?... \u003C/p\u003E\u003Cp\u003E whatever they say... I think whoever says that probably just sucks at playing, (or never tried) anyways \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}