{"TopicId":55801,"ForumId":32,"TopicTitle":"Resources - postponed, cancelled or reserved for a DLC?","CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-12-11T10:50:43Z","PageNum":7,"Articles":[{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2013-12-13T23:49:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moach\u0022 data-cite=\u0022Moach\u0022\u003E\u003Cdiv\u003Elet\u0027s clarify what was said:\u003Cp\u003Ethey did not scrap that stuff because it was difficult, complex or something only fun to top-level players -- they scrapped it because it probably wasn\u0027t much fun at all\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are many people who do not enjoy the science system whatsoever because they do not find it fun, but it was the focus of a game update.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moach\u0022 data-cite=\u0022Moach\u0022\u003E\u003Cdiv\u003Eif there was a real focus to make the game more polished towards early play, then Kerbin aerodynamics would have gotten a lot more attention by now, don\u0027t you think? I mean, early players are barely able to reach space. it takes several failures before a first orbit...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESaying aerodynamics is tied to game difficulty is a bit of a perilous road because on one hand, something like FAR without certain other game balances can reduce the deltaV to orbit, but can make stabilising and building the rocket more challenging. Stock aerodynamics also is incredibly helpful when landing on Kerbin since everything is slowed to terminal velocity irregardless of incoming velocity from space.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moach\u0022 data-cite=\u0022Moach\u0022\u003E\u003Cdiv\u003Ea chart is just that, it doesn\u0027t mean the game would be better with all that stuff... in my opinion, it\u0027d actually make no sense to add that as a core feature. Mining for me is addon material. (I\u0027m not talking DLC\u0027s i mean Mods, really) - It\u0027s sci-fi, and has no relation to anything in real life about space science so far.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStating ISRU has no relation to anything in real life is downright false.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moach\u0022 data-cite=\u0022Moach\u0022\u003E\u003Cdiv\u003EMultiplayer is development-wise a much trickier feature to integrate, and a mod will only go so far in achieving that much.\u003Cp\u003Ethat\u0027s why it makes sense to decide this way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe argument from the devs up to this point was always that adding multiplayer in on top of everything rather than building the game up for multiplayer was a terrible idea. It seems they now disagree with themselves.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-12-13T23:51:50Z","Content":"\n\u003Cp\u003EPeople don\u0027t seem to understand this is an alpha game. Many features including major ones are not yet added so resources are still a possibility. The devs can\u0027t focus on every request by the community as they are a very small team with limited resources.\u003C/p\u003E\u003Cp\u003EMost games in alpha are not available to the public so I\u0027m just greatful that I can play KSP at all.\u003C/p\u003E\u003Cp\u003EI admit I am very disappointed that resources have been canned for now but its not destroyed KSP for me.\u003C/p\u003E\u003Cp\u003EMoach: Just because something has yet to be done in space doesn\u0027t mean its unrealistic and sci-fi. I\u0027d personally like KSP to touch the near future as currently we havn\u0027t done that much in space so limiting it to that would damage the overall scope of the game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-13T23:55:29Z\u0022 title=\u002212/13/2013 11:55  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 13, 2013\u003C/time\u003E by Comrade Jenkens\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-12-13T23:52:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moach\u0022 data-cite=\u0022Moach\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Ethey did not scrap that stuff because it was difficult, complex or something only fun to top-level players -- they scrapped it because it probably wasn\u0027t much fun at all\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich doesn\u0027t make any sense because career mode was implemented and yet it isn\u0027t fun. Many people on the forums agree that career mode is only fun with mods and there was even a member of the media group who released a video saying that he was cancelling his career mode video series and talked about why he didn\u0027t find career mode fun.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-13T23:52:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moach\u0022 data-cite=\u0022Moach\u0022\u003E\u003Cdiv\u003Elet\u0027s clarify what was said:\u003Cp\u003Ethey did not scrap that stuff because it was difficult, complex or something only fun to top-level players -- they scrapped it because it probably wasn\u0027t much fun at all\u003C/p\u003E\u003Cp\u003Eif there was a real focus to make the game more polished towards early play, then Kerbin aerodynamics would have gotten a lot more attention by now, don\u0027t you think? I mean, early players are barely able to reach space. it takes several failures before a first orbit...\u003C/p\u003E\u003Cp\u003Ea chart is just that, it doesn\u0027t mean the game would be better with all that stuff... in my opinion, it\u0027d actually make no sense to add that as a core feature. Mining for me is addon material. (I\u0027m not talking DLC\u0027s i mean Mods, really) - It\u0027s sci-fi, and has no relation to anything in real life about space science so far.\u003C/p\u003E\u003Cp\u003Ehow is that the \u0022biggest mistake ever made\u0022? it\u0027s not like they\u0027re saying \u0022no\u0022 to it, they\u0027re just not doing it themselves. -- resources ARE a thing that should be done by a mod, so much in fact: it has been done already. Multiplayer is development-wise a much trickier feature to integrate, and a mod will only go so far in achieving that much.\u003C/p\u003E\u003Cp\u003Ethat\u0027s why it makes sense to decide this way.\u003C/p\u003E\u003Cp\u003Eclamoring for resources now is kinda like raging on about getting a bunch of extra parts that are the same in functionality as already available -- devs add things that can used to make better mods. and those should be things that mods themselves cannot do.\u003C/p\u003E\u003Cp\u003Ethis is what they mean by \u0022scope completion\u0022 and \u0022feature completion\u0022 - the former means: get all the basic concepts down and working together before doing the latter\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWouldn\u0027t it be far wiser to do easier features first rather than have to check all the time for contradictions with code in multiplayer? As multiplayer is more and more complex (which with a game like KSP, it will be.). You spend half the update just checking for bugs. Resources got canned because it wasn\u0027t something that would occupy the community, unlike multiplayer, which will lead to more people saying \u0022Multiplayer provides so many possibilities, go play it instead of complaining.\u0022 With Multiplayer, SQUAD has effectively formed a community for themselves with the community, restricting themselves from any criticism from anyone.\u003C/p\u003E\u003Cp\u003EAlso, how is resources not fun? I get that some people may not like it, but personally I could care less that multiplayer is being coded (I actually hate the fact that it is). Does that mean it isn\u0027t fun? Kind of brute to just dismiss something as not fun, especially when the community never even got their hands on anything more complicated than Kethane, which I may say is a one-resource system. It\u0027s a go anywhere thing.\u003C/p\u003E\u003Cp\u003EAlso, \u0022Scope Completion\u0022 Basic features? It may be the fact that re-entry heat doesn\u0027t do a thing, the atmospheres are still soup, we have jaggies everywhere in terrain mapping, and the ocean is rendered as a whole second world and is constantly calculating physics collision maps, but I REALLY don\u0027t think multiplayer is a feature that is necessary to include just yet.\u003C/p\u003E\u003Cp\u003EThis is the most painful, obvious, desperate cash grab I\u0027ve ever seen SQUAD do, and I am humbled by it, as I believed in them at the beginning and they shattered my hopes of what was once a really fun, adventurous, and dramatic space exploration game into some kind of cannon fodder SRB lobbing lolsokerbal abomination that it is now.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-13T23:54:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EPeople don\u0027t seem to understand this is an alpha game. Many features including major ones are not yet added so resources are still a possibility. The devs can\u0027t focus on every request by the community as they are a very small team with limited resources.\u003Cp\u003EMost games in alpha are not available to the public so I\u0027m just greatful that I can play KSP at all.\u003C/p\u003E\u003Cp\u003EI admit I am very disappointed that resources have been canned for now but its not destroyed KSP for me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMultiplayer was said to be done last because of the fact it was so complicated. Something like Multiplayer has to be bug checked insanely as so many little things can slip through unexpectedly. When you code that and start adding features, it becomes so detrimental to the point where you are constantly babysitting multiplayer so as to not let it bug out and destroy the one thing that continues to generate money for KSP.\u003C/p\u003E\n"},{"CreatedByName":"SpaceHips","CreatedById":176006,"CreatedDateTime":"2013-12-13T23:55:57Z","Content":"\n\u003Cp\u003EThey were canned and replaced with multiplayer.\u003C/p\u003E\u003Cp\u003ESearch your feelings, you know it to be true.\u003C/p\u003E\u003Cp\u003ETake a look at the beginnings of something that would never be:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bso3f2V.jpg?1\u0022 alt=\u0022bso3f2V.jpg?1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-12-13T23:58:01Z","Content":"\n\u003Cp\u003EAs I said before, we need someone to try to make a mod based on the resource system that squad started work on. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-13T23:59:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XIRA\u0022 data-cite=\u0022XIRA\u0022\u003E\u003Cdiv\u003E...they never said that resources will be canceled. They\u0027re just not happy with the way it is right now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was said resources are now on the backburner permanently by a moderator. It has been said.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-12-13T23:59:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003Esome kind of cannon fodder SRB lobbing lolsokerbal abomination that it is now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait, what? When did that happen? Are you sure we\u0027re playing the same Kerbal Space Program? Seriously, I don\u0027t know which game you\u0027re talking about, because it\u0027s not the realistic spaceflight simulator I\u0027ve been playing.\u003C/p\u003E\u003Cp\u003EParagraphs 2 \u0026amp; 3 are completely agreeable, though.\u003C/p\u003E\n"},{"CreatedByName":"AHO","CreatedById":49070,"CreatedDateTime":"2013-12-14T00:01:08Z","Content":"\n\u003Cp\u003EI mean, I\u0027m just having trouble contemplating why they would do this. Can one of there most brilliant and well thought out features. Come on devs put this back on the shelf! You were really on to something amazing here! You can un-can it right? So please, if you\u0027re reading this, at least give the original idea a chance.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-14T00:01:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EAs I said before, we need someone to try to make a mod based on the resource system that squad started work on. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKethane exists. It\u0027s time the developers stop letting the modders carry the community and actually do some work themselves. Ever since 0.18, they\u0027ve worked on \u0022career mode\u0022 and \u0022laying the ground for career mode\u0022 for four updates. Four updates to just can and move onto something else. It seems as though just recently because of the KMP mod and how well people reacted to it, SQUAD thinks that if they can pull it off, it will be the most profitable thing for KSP ever. I\u0027m honestly not going to be surprised if they announce KSP finished after this.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-14T00:03:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003EWait, what? When did that happen? Are you sure we\u0027re playing the same Kerbal Space Program? Seriously, I don\u0027t know which game you\u0027re talking about, because it\u0027s not the realistic spaceflight simulator I\u0027ve been playing.\u003Cp\u003EParagraphs 2 \u0026amp; 3 are completely agreeable, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m talking about what the community turned it into. Take a look at half the forum and you\u0027ll see people praise a bunch of falling canisters exploding on the ground more than someone carefully placing something in a complicated orbit. \u003C/p\u003E\u003Cp\u003EThe community has taken a large role in making KSP take a turn for the worst, and the developers and community managers let that happen.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-12-14T00:03:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EKethane exists. It\u0027s time the developers stop letting the modders carry the community and actually do some work themselves. Ever since 0.18, they\u0027ve worked on \u0022career mode\u0022 and \u0022laying the ground for career mode\u0022 for four updates. Four updates to just can and move onto something else. It seems as though just recently because of the KMP mod and how well people reacted to it, SQUAD thinks that if they can pull it off, it will be the most profitable thing for KSP ever. I\u0027m honestly not going to be surprised if they announce KSP finished after this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKethane is a one resource system. I was talking about someone trying to replicate the resource chart originally posted by squad and bringing it to life as a mod. Kethane is very good but I would prefer varied resources.\u003C/p\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-12-14T00:07:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EKethane is a one resource system. I was talking about someone trying to replicate the resource chart originally posted by squad and bringing it to life as a mod. Kethane is very good but I would prefer varied resources.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHis point is that mods shouldn\u0027t be the main reason to play the game. Every update since 0.18 has been \u0022backend work\u0022 for career mode, and then they pick a few mods and make them stock so that people won\u0027t get bored with a featureless update.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-14T00:07:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EKethane is a one resource system. I was talking about someone trying to replicate the resource chart originally posted by squad and bringing it to life as a mod. Kethane is very good but I would prefer varied resources.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThing is, that is insanely hard to do without access to the source code. Majiir was only able to do what he did because of months of work. The developers could do this at a MUCH faster pace then modders, and could do it better and make it more efficient.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-12-14T00:08:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EKethane exists. It\u0027s time the developers stop letting the modders carry the community and actually do some work themselves. Ever since 0.18, they\u0027ve worked on \u0022career mode\u0022 and \u0022laying the ground for career mode\u0022 for four updates. Four updates to just can and move onto something else. It seems as though just recently because of the KMP mod and how well people reacted to it, SQUAD thinks that if they can pull it off, it will be the most profitable thing for KSP ever. I\u0027m honestly not going to be surprised if they announce KSP finished after this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you remember when docking was added? Squad said for a while that it would take a long time, and then (after a while) they were able to code it (not counting the later debugging) in just four days. However, it took a long, long time to get it to the point where they could do that.\u003C/p\u003E\n"},{"CreatedByName":"AHO","CreatedById":49070,"CreatedDateTime":"2013-12-14T00:08:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EThing is, that is insanely hard to do without access to the source code. Majiir was only able to do what he did because of months of work. The developers could do this at a MUCH faster pace then modders, and could do it better and make it more efficient.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, it is the developers who would do this so please, bring the idea back harvester. you\u0027ve let us all down.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-14T00:09:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EIt was said resources are now on the backburner permanently by a moderator. It has been said.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe moderators are not Squad. Just saying.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-14T00:10:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheDarkStar\u0022 data-cite=\u0022TheDarkStar\u0022\u003E\u003Cdiv\u003EDo you remember when docking was added? Squad said for a while that it would take a long time, and then (after a while) they were able to code it (not counting the later debugging) in just four days. However, it took a long, long time to get it to the point where they could do that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs it strange that they coincidentally got it within about a month after a modder managed to rig something up? ORDA docking system was around using a special type of decoupler re-engineered to be used to grapple spacecraft together.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-14T00:10:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Jedi Master\u0022 data-cite=\u0022The Jedi Master\u0022\u003E\u003Cdiv\u003EThe moderators are not Squad. Just saying.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI doubt a moderator would blow smoke without proof to back himself up.\u003C/p\u003E\n"},{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2013-12-14T00:12:05Z","Content":"\n\u003Cp\u003EMight as well thrown in my opinion as well.\u003C/p\u003E\u003Cp\u003EFrom the way I see it, Squad canning resources (lets face it, \u0027postponed indefinitely\u0027 means canned) and instead opting to go for a fully fledged stock multiplayer was definitely not the way to go. Already, the Kethane mod has shown how resources are incredibly fun. It provides another reason to go exploring, which in my opinion is needed and especially with the way they were trying to develop it with the 9 different resources, the drills, the dirt extractor, it would have provided a huge scope of gameplay that is missing. It\u0027s disappointing and frustrating because we know what we could have had and clearly they had spent a great deal on time on this system which could have been placed in to other aspects of the game. What we end up with is a lot of time wasted for Squad and a fanbase left confused and annoyed. \u003C/p\u003E\u003Cp\u003EThe other side of the coin is the fact that personally I cannot see how multiplayer will be a good thing, even if they find a way to make the time warp issue negligent. What will people do differently in multiplayer than they did in single player? Maybe joint space stations, but other than that it can only be a bad thing. Griefing will undoubtedly exist, there will most certainly by connection issues which will have a negative effect on gameplay and overall single player will just be a lot more fun. \u003C/p\u003E\u003Cp\u003EIt seems to me that there is a clear motive shift from the Devs. They have moved from wanting whats best for the game to wanting whats best for the business which is fair enough as a businesses main aim is to make profit but the fanbase comes out of the wrong end on this. We suffer because they prefer to put in something that will make their game look more sellable and not something that will make it more fun. Unfortunately, we as the fans of the game are going to have to deal with this whether we like it or not unless Squad have a drastic change of heart. I almost feel like a parent in saying \u0027we\u0027re not angry, we\u0027re just disappointed\u0027. Obviously this has caused a divide in those who support Squad and those who question their motives yet there is no reason why we can\u0027t express our opinions, no matter how much they differ.\u003C/p\u003E\u003Cp\u003E*sigh*\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-14T00:15:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WillHop\u0022 data-cite=\u0022WillHop\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe other side of the coin is the fact that personally I cannot see how multiplayer will be a good thing, even if they find a way to make the time warp issue negligent. What will people do differently in multiplayer than they did in single player? Maybe joint space stations, but other than that it can only be a bad thing. Griefing will undoubtedly exist, there will most certainly by connection issues which will have a negative effect on gameplay and overall single player will just be a lot more fun. \u003C/p\u003E\u003Cp\u003E*sigh*\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is another thing I\u0027d like to post about. Honestly how will people interact in multiplayer that has any meaning? A race to the Mun? Well okay, but it\u0027s really just a matter of flying spacecraft faster then each other, which could be done without having to go through months of work to code multiplayer.\u003C/p\u003E\n"},{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2013-12-14T00:18:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EThis is another thing I\u0027d like to post about. Honestly how will people interact in multiplayer that has any meaning? A race to the Mun? Well okay, but it\u0027s really just a matter of flying spacecraft faster then each other, which could be done without having to go through months of work to code multiplayer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI never really understood the attraction. I tried KMP for couple of hours but could hardly get it working and when I did I figured \u0027I\u0027m doing nothing different!\u0027 so I left. Adding game modes wouldn\u0027t work even slightly so i\u0027m struggling to see how people would play together.\u003C/p\u003E\n"},{"CreatedByName":"MasterGir","CreatedById":17184,"CreatedDateTime":"2013-12-14T00:19:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EThis is another thing I\u0027d like to post about. Honestly how will people interact in multiplayer that has any meaning? A race to the Mun? Well okay, but it\u0027s really just a matter of flying spacecraft faster then each other, which could be done without having to go through months of work to code multiplayer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a good point. Multiplayer will just be more than one person having nothing to do. Sure you can make a station or something, but to what end?\u003C/p\u003E\n"},{"CreatedByName":"DYJ","CreatedById":8636,"CreatedDateTime":"2013-12-14T00:20:18Z","Content":"\n\u003Cp\u003EDiscussing how MP will eventually work is a little offtopic for this thread isn\u0027t it?\u003C/p\u003E\u003Cp\u003ECheck through this one instead: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61445-KSP-committed-to-multiplayer-career-and-sandbox-modes/page3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/61445-KSP-committed-to-multiplayer-career-and-sandbox-modes/page3\u003C/a\u003E\u003C/p\u003E\n"}]}