{"TopicId":55801,"ForumId":32,"TopicTitle":"Resources - postponed, cancelled or reserved for a DLC?","CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-12-11T10:50:43Z","PageNum":6,"Articles":[{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-13T23:21:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MasterGir\u0022 data-cite=\u0022MasterGir\u0022\u003E\u003Cdiv\u003EWhile you\u0027re welcome to your opinion, I have to argue that there isn\u0027t really a link between resources and colonization. They\u0027re more of a tool for exploration than anything.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I can sorta see how resources can be linked to colonization. If you\u0027re going somewhere, you\u0027re going there because it has something to offer.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-12-13T23:21:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EIf they are going to implement things they should at least put some commitment into it. One update giving us a not even half finished version of a game mode is not the brightest step to take in game development. Flip flopping has proved bad for SQUAD in the past, and it will undeniably prove itself yet again.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf they spend too long working on an update, the lurking hordes get restless \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Better to have a small update than no update.\u003C/p\u003E\u003Cp\u003EAlthough yeah, stop flip-flopping. NASA did it, and look at them now!\u003C/p\u003E\n"},{"CreatedByName":"Draft","CreatedById":72633,"CreatedDateTime":"2013-12-13T23:21:34Z","Content":"\n\u003Cp\u003EAlso let\u0027s not forget that the core mechanics of this game are literal rocket science and orbital mechanics, college-grade mathematics presented in such an intuitive way that literal children can enjoy it as well as actual astronauts. I can\u0027t believe that extracting polar ice to refine into fuel and that sort of thing is so much more complicated that it can\u0027t be made fun.\u003C/p\u003E\n"},{"CreatedByName":"Alguien","CreatedById":1623,"CreatedDateTime":"2013-12-13T23:21:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmpsterMan\u0022 data-cite=\u0022AmpsterMan\u0022\u003E\u003Cdiv\u003EIn fact, I always thought it might be a bit too far outside of the scope of the game, which is exploration not colonization.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am going to point out not with bad blood against you, than they dont add new planets because \u0022the old planets are boring and there is nothing of interest on them\u0022 then they dont do anything with the old planets either, squad should stop all this trash of \u0022LETS MAKE CAREER MODE! WOO WE ARE HALF WAY THERE! NOW LETS PLAN MULTIPLAYER WOOOHOOOO\u0022 and actually finish the already half made content than is already in game but they seem to want to ignore\u003C/p\u003E\n"},{"CreatedByName":"Sapphire","CreatedById":67918,"CreatedDateTime":"2013-12-13T23:23:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003ENot everybody enjoys flying the same SSTO or making the same Kethane base. Some people get bored with repetitively pedaled things.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo resources change your SSTO or mining base design, aside from what fuel tank you use? Does having resources make the game \u0022harder\u0022, or does does it make it easier to return from distant planets if you\u0027ve messed up your Delta-V, but remembered to pack a drill? At the end of the day it\u0027s something you\u0027d play with for a few weeks, then master, and pine for another feature to make the game that you\u0027ve already mastered harder.\u003C/p\u003E\u003Cp\u003EI think everyone here needs to calm down and see how Squad acts before picking up the torches and pitchforks. Wait a couple versions and see where they take career mode. Cancelling a speculated feature that lots of people wanted, and exchanging it for a different feature that also lots of people wanted is hardly EA-tier. When did cutting a feature become equal to season passes, day one DLC, and banning users from forums for doing something bad ingame? That\u0027s like being perma\u0027d for killing Jeb.\u003C/p\u003E\u003Cp\u003EI\u0027ll be honest, I don\u0027t care that resources are cancelled. I love playing with mods (I have, I think, 5 stock parts left, rest deleted to make room), from Remotetech to Deadly Reentry to Hooligan Labs, so Kethane\u0027s just fine for me when I feel like making a refinery or orbital fuel depot. When my lander\u0027s down safely and eventually returns to Kerbin, I scrap it and design a new one. When I see a cool vid about Constellation or the Falcon 9, I build my own, sometimes multiple versions. I\u0027ve put a lot of time into KSP. I can fly out to Eeloo, and down into the sun\u0027s gravity well to Moho, and i still have yet to hit the boredom wall in this game. But then again I have more than a thousand hours in Skyrim (yes, gasp in horror), and I never had any intention of playing career mode because I\u0027d rather goof off in Sandbox, so what do I know?\u003C/p\u003E\u003Cp\u003EBasically my stance on all this is apathy, my stance on every game, with a bit of hesitation to see what they do next. At the end of the day, it\u0027s just a game, right?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-13T23:26:50Z\u0022 title=\u002212/13/2013 11:26  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 13, 2013\u003C/time\u003E by Sapphire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-12-13T23:23:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boakamxe\u0022 data-cite=\u0022Boakamxe\u0022\u003E\u003Cdiv\u003EFor the users who\u0027ve been playing the game longest, there\u0027s nothing left to explore.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe thing about sandbox type games (and even career mode turns into sandbox) is that there is no endgame. If you\u0027re expecting KSP to provide you with some kind of satisfying crunchy end, you\u0027re probably going to be disappointed. At some point you\u0027re going to run out of things to do and walk away. That\u0027s just the nature of open-ended games.\u003C/p\u003E\u003Cp\u003EHowever, I suspect you\u0027ll come back later and think of new things to do. I find these forums and the other players here a constant source of inspiration.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-12-13T23:25:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Draft\u0022 data-cite=\u0022Draft\u0022\u003E\u003Cdiv\u003EAlso let\u0027s not forget that the core mechanics of this game are literal rocket science and orbital mechanics, college-grade mathematics presented in such an intuitive way that literal children can enjoy it as well as actual astronauts. I can\u0027t believe that extracting polar ice to refine into fuel and that sort of thing is so much more complicated that it can\u0027t be made fun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI feel the opposite, it just needs to be explained well. Every other system introduced to date is easy enough to understand, I\u0027m sure resources can handle it too. I\u0027m picturing mission control explaining concepts to you the first time you e.g. unlock drills.\u003C/p\u003E\n"},{"CreatedByName":"OtherDalfite","CreatedById":8317,"CreatedDateTime":"2013-12-13T23:26:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sapphire\u0022 data-cite=\u0022Sapphire\u0022\u003E\u003Cdiv\u003EDo resources change your SSTO or mining base design, aside from what fuel tank you use? Does having resources make the game \u0022harder\u0022, or does does it make it easier to return from distant planets if you\u0027ve messed up your Delta-V, but remembered to pack a drill? At the end of the day it\u0027s something you\u0027d play with for a few weeks, then master, and pine for another feature to make the game that you\u0027ve already mastered harder.\u003Cp\u003EI think everyone here needs to calm down and see how Squad acts before picking up the torches and pitchforks. Wait a couple versions and see where they take career mode. Cancelling a speculated feature that lots of people wanted, and exchanging it for a different feature that also lots of people wanted is hardly EA-tier. When did cutting a feature become equal to season passes, day one DLC, and banning users from forums for doing something bad ingame? That\u0027s like being perma\u0027d for killing Jeb.\u003C/p\u003E\u003Cp\u003EI\u0027ll be honest, I don\u0027t care that resources are cancelled. I love playing with mods, from Remotetech to Deadly Reentry to Hooligan Labs, so Kethane\u0027s just fine for me when I feel like making a refinery or orbital fuel depott. When my lander\u0027s down safely and eventually returns to Kerbin, I scrap it and design a new one. When I see a cool vid about Constellation or the Falcon 9, I build my own, sometimes multiple versions. I\u0027ve put a lot of time into KSP. I can fly out to Eeloo, and down into the sun\u0027s gravity well to Moho, and i still have yet to hit the boredom wall in this game. But then again I have more than a thousand hours in Skyrim (yes, gasp in horror), and I never had any intention of playing career mode because I\u0027d rather goof off in Sandbox, so what do I know?\u003C/p\u003E\u003Cp\u003EBasically my stance on all this is apathy, my stance on every game, with a bit of hesitation to see what they do next. At the end of the day, it\u0027s just a game, right?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom what the devs showed us almost a year ago with the new resource concepts, it would open up a whole new way to play the game for KSP. I love Kethane, but really converting JUST Kethane gets boring and gets stale. Many resources provide for many possibilities. Possibilities, I might mention, which are now perceived as impossible because the developers have canned resources.\u003C/p\u003E\n"},{"CreatedByName":"MasterGir","CreatedById":17184,"CreatedDateTime":"2013-12-13T23:27:16Z","Content":"\n\u003Cp\u003ERegardless of what change in difficulty resources would have brought, if you don\u0027t want a challenge you probably shouldn\u0027t be doing career mode to begin with. If you just wanted to build ships and explore that\u0027s what sandbox is for.\u003C/p\u003E\n"},{"CreatedByName":"Draft","CreatedById":72633,"CreatedDateTime":"2013-12-13T23:29:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003EI feel the opposite, it just needs to be explained well. Every other system introduced to date is easy enough to understand, I\u0027m sure resources can handle it too. I\u0027m picturing mission control explaining concepts to you the first time you e.g. unlock drills.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that\u0027s what I meant if it didn\u0027t come across properly.\u003C/p\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2013-12-13T23:30:48Z","Content":"\n\u003Cp\u003EDisappointment aside I think Squad should at the very least release the parts that were created for resources to the modders for them to use. The parts I am talking about can be found a little ways down the page here: \u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/1a5wfs/summary_of_dev_team_announcements_for_019_and/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reddit.com/r/KerbalSpaceProgram/comments/1a5wfs/summary_of_dev_team_announcements_for_019_and/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-12-13T23:32:12Z","Content":"\n\u003Cp\u003EHopefully someone will create a mod similar to kethane but adding several resources similar to the original idea.... hint hint anyone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2013-12-13T23:32:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ddavis425\u0022 data-cite=\u0022ddavis425\u0022\u003E\u003Cdiv\u003EDisappointment aside I think Squad should at the very least release the parts that were created for resources to the modders for them to use. The parts I am talking about can be found a little ways down the page here: \u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/1a5wfs/summary_of_dev_team_announcements_for_019_and/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reddit.com/r/KerbalSpaceProgram/comments/1a5wfs/summary_of_dev_team_announcements_for_019_and/\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe parts at the very least were never released by Squad themselves so I don\u0027t think they can lay claim to the ownership of them, asking NovaSilisko if he still has them about would be a better choice.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-12-13T23:33:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boakamxe\u0022 data-cite=\u0022Boakamxe\u0022\u003E\u003Cdiv\u003EFor the users who\u0027ve been playing the game longest, there\u0027s nothing left to explore.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a good point. I feel like that is something that happens with the new trend of play-as-developed games, by the time they are at 1.0 most of the things have been explored. I feel like the science, R\u0026amp;D, and planned features of career mode might help mitigate that a bit. Also, more planets are still on the table and as far as I know, a different star system is something that was part of the original plan.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MasterGir\u0022 data-cite=\u0022MasterGir\u0022\u003E\u003Cdiv\u003EWhile you\u0027re welcome to your opinion, I have to argue that there isn\u0027t really a link between resources and colonization. They\u0027re more of a tool for exploration than anything.\u003C/div\u003E\u003C/blockquote\u003E I guess it\u0027s the way one looks at resources; I think SQUAD looked at resources not so much as using resources when one lands to take off again, but rather for building bases and the sort on different planets that used the local resources.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IvanTehFennec\u0022 data-cite=\u0022IvanTehFennec\u0022\u003E\u003Cdiv\u003EAnd here I thought the purpose of \u0022Kerbal Space Program\u0022 was to run a space program and make money. How silly I was!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd it still is! In fact, I think one can make the case that running a space program need not require resource mining and processing as a priority for the beginning. We have been running one here on Earth for about 60 years now and it seems like it will continue to be like this for some time. Does this mean that KSP should follow Humanity\u0027s course? No. But it does provide a nice metric to compare to. Resources are not a requirement to a Space Program Management game. In fact, Buzz Aldrin\u0027s Race into Space (BARIS) and Orbiter, two games that have heavily inspired KSP\u0027s development don\u0027t have these.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alguien\u0022 data-cite=\u0022Alguien\u0022\u003E\u003Cdiv\u003EI am going to point out not with bad blood against you, than they dont add new planets because \u0022the old planets are boring and there is nothing of interest on them\u0022 then they dont do anything with the old planets either, squad should stop all this trash of \u0022LETS MAKE CAREER MODE! WOO WE ARE HALF WAY THERE! NOW LETS PLAN MULTIPLAYER WOOOHOOOO\u0022 and actually finish the already half made content than is already in game but they seem to want to ignore\u003C/div\u003E\u003C/blockquote\u003E No bad blood taken \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. I don\u0027t think they are doing things on a whim, if that is what you are implying. Rather, I think this is the direction Felipe wanted to go down. He has stated multiple times in the past that he wanted to flesh out Career Mode; that\u0027s what they are doing. Is it anywhere near finished? Hopefully not! I haven\u0027t seen any evidence of KSP falling to the lowest common denominator yet. Some may see Multiplayer this way, I respectfully disagree.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-13T23:38:20Z\u0022 title=\u002212/13/2013 11:38  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 13, 2013\u003C/time\u003E by AmpsterMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2013-12-13T23:34:17Z","Content":"\n\u003Cp\u003EWell, seeing stuff like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kvJsStE.gif\u0022 alt=\u0022kvJsStE.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9ivHBht.png\u0022 alt=\u00229ivHBht.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn some form in the game would be cool. They are already created after all.\u003C/p\u003E\n"},{"CreatedByName":"macegee","CreatedById":38721,"CreatedDateTime":"2013-12-13T23:34:56Z","Content":"\n\u003Cp\u003EIMO suddenly going to do multiplayer (feature that was considered as \u0027dont-even-ask-its-not-gonna-happen\u0027 for some time) instead of doing resources (which is kinda important thing for going into space) is the biggest mistake ever for KSP. \u003C/p\u003E\u003Cp\u003EHope you don\u0027t mind this video here.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/VLouRKHknOU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-12-13T23:36:24Z","Content":"\n\u003Cp\u003EThose pics bring back memories \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Moach","CreatedById":9,"CreatedDateTime":"2013-12-13T23:42:14Z","Content":"\n\u003Cp\u003Elet\u0027s clarify what was said:\u003C/p\u003E\u003Cp\u003Ethey did not scrap that stuff because it was difficult, complex or something only fun to top-level players -- they scrapped it because it probably wasn\u0027t much fun at all\u003C/p\u003E\u003Cp\u003Eif there was a real focus to make the game more polished towards early play, then Kerbin aerodynamics would have gotten a lot more attention by now, don\u0027t you think? I mean, early players are barely able to reach space. it takes several failures before a first orbit...\u003C/p\u003E\u003Cp\u003Ea chart is just that, it doesn\u0027t mean the game would be better with all that stuff... in my opinion, it\u0027d actually make no sense to add that as a core feature. Mining for me is addon material. (I\u0027m not talking DLC\u0027s i mean Mods, really) - It\u0027s sci-fi, and has no relation to anything in real life about space science so far.\u003C/p\u003E\u003Cp\u003Ehow is that the \u0022biggest mistake ever made\u0022? it\u0027s not like they\u0027re saying \u0022no\u0022 to it, they\u0027re just not doing it themselves. -- resources ARE a thing that should be done by a mod, so much in fact: it has been done already. Multiplayer is development-wise a much trickier feature to integrate, and a mod will only go so far in achieving that much.\u003C/p\u003E\u003Cp\u003Ethat\u0027s why it makes sense to decide this way.\u003C/p\u003E\u003Cp\u003Eclamoring for resources now is kinda like raging on about getting a bunch of extra parts that are the same in functionality as already available -- devs add things that can used to make better mods. and those should be things that mods themselves cannot do.\u003C/p\u003E\u003Cp\u003Ethis is what they mean by \u0022scope completion\u0022 and \u0022feature completion\u0022 - the former means: get all the basic concepts down and working together before doing the latter\u003C/p\u003E\n"},{"CreatedByName":"macegee","CreatedById":38721,"CreatedDateTime":"2013-12-13T23:42:39Z","Content":"\n\u003Cp\u003EOh, and the main thing I forgot to mention is that we still don\u0027t even have Delta-V/TWR indicators. I will keep mentioning this time and time again. I\u0027d trade Resource System for stock Engineering info panels, but certainly not for multiplayer.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-13T23:44:15Z","Content":"\n\u003Cp\u003EOh, boy, this is going to be fun...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OtherDalfite\u0022 data-cite=\u0022OtherDalfite\u0022\u003E\u003Cdiv\u003EHonestly, I think this is one of the last falls for SQUAD now that they have fully surrendered to their community and took the step to do multiplayer without even finishing singleplayer. They\u0027ve chosen multiplayer only for the fact it\u0027s the ULTIMATE way to pull in profit for SQUAD(Something we know every business loves). This is going to be an act of silencing the community from any critcism Update taking too long? \u0022GO PLAY MULTIPLAYER GOSH\u0022 is all I see for the future now. I\u0027ve almost lost all hope in KSP as the past updates since 0.19 have been practically contentless and the sham of \u0022Career mode\u0022 we have gotten is a point and click adventure with pre-destined nodes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat people don\u0027t seem to understand is that they said MP will come AFTER SP is completely finished. I think resources would be a part of SP.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENot only this, but the community manager Maxmaps openly made fun of a portion of the KSP community because they got angry that he lied to them repeatedly. At this point, I say it\u0027s safe to assume KSP is going to make the transition to a game like minecraft where the devs will take all suggestions from the community instead of making the game that was originally intended. Now it\u0027s going to turn into some dreadnaught/minecraft esque space exploration game where you build pretty planes and fly them into space. Remember in 0.18 where resources were supposedly the next big thing and that it would, and I quote \u0022Blow Kethane out of the water!\u0022? SQUAD suddenly changed plans since then to do career mode, almost 5 updates which have been \u0022behind the scenes stuff\u0022 ie: Getting sponsorships from Connexion and making more merchandise to sell to the community rather than code the actual game. The last developer I have hope for is C7, and only because I\u0027ve known him from the beginning and that he makes good stuff.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, Minecraft listened to it\u0027s community and gave it what it wanted. Did that make it any less of a good game? No. I think it made it even better. Not everyone will agree with me, I\u0027m sure, but MC is a great game, and the fact that they listened to the community made it better.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI wish I could say the same for HarvesteR, but from what I\u0027ve learned he is the one that has drove KSP into the ground. He gave a clear outline of how KSP was going to be in the beginning, but has since let the community of 10-14 year olds drive his view for it, just like Notch. Ever since the big DLC thing the devs have been completely sheltered from the community, as community managers have been trying to stem the tide of people actually upset about KSP, and banning them from the forums so they can not voice their opinions. One of these people is Mercy, off the top of my head.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I understand this sentiment (it\u0027s been a common one lately), I would like to point out that Mercy really did have a mean streak. Also, if you voice your criticism in a polite manner, they just might listen.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThis is my last bit of hope crushed for KSP, as now resources are on the backburner (more than likely, permanently), and SQUAD will begin taking more and more suggestions from the community and KSP will no longer be the pinnacle of hope I and many others once thought it was.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAren\u0027t you an optimist? Just because things are going weird lately, that does not mean KSP is Ruined Forever.\u003C/p\u003E\u003Cp\u003EBottom line: Chill man. It\u0027ll be all right.\u003C/p\u003E\n"},{"CreatedByName":"MasterGir","CreatedById":17184,"CreatedDateTime":"2013-12-13T23:44:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moach\u0022 data-cite=\u0022Moach\u0022\u003E\u003Cdiv\u003Elet\u0027s clarify what was said:\u003Cp\u003Ethey did not scrap that stuff because it was difficult, complex or something only fun to top-level players -- they scrapped it because it probably wasn\u0027t much fun at all\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is, this game was brought to life by it\u0027s community. And the dev team of all people know what one person finds fun isn\u0027t the same as another. I\u0027m certain for every person on the team that found resources unfun there\u0027s at least 50 people in the community who would have loved it. They shouldn\u0027t be throwing out semi-finished ideas on the basis of the opinion of a few people, even if they\u0027re devs.\u003C/p\u003E\n"},{"CreatedByName":"zantkiller","CreatedById":1519,"CreatedDateTime":"2013-12-13T23:45:24Z","Content":"\n\u003Cp\u003EI don\u0027t usually post but I feel that I should raise my voice on this issue.\u003C/p\u003E\u003Cp\u003EAs someone who doesn\u0027t plan on using multiplayer I\u0027m bitterly disappointed that resources have been cancelled. Resources for me would have had added a lot of fun and meaningful gameplay that is currently lacking from ksp and will not be made up for by the addition of multiplayer.\u003C/p\u003E\u003Cp\u003EI can only hope that Squad has a change of heart (Which I find highly unlikely) or that there is a complete and total revamp of the science system. Specifically in how samples are collected to involve curiosity style rovers and controlling robotic arms to dig or drill for science samples for analyzing. Something that will add gameplay when you are on the surface of a planet and is not just simply right-clicking in certain areas.\u003C/p\u003E\u003Cp\u003EJust having a system where you can actually pick up rocks from the mun\u0027s surface, have to place them back in the craft and take them home with them being displayed in the science archive will add a lot.\u003C/p\u003E\n"},{"CreatedByName":"AHO","CreatedById":49070,"CreatedDateTime":"2013-12-13T23:48:27Z","Content":"\n\u003Cp\u003EWait, resources have been canceled? No hope of ever returning!?!?!?!! What!! No! Just no!!!!!!\u003C/p\u003E\n"},{"CreatedByName":"XIRA","CreatedById":42509,"CreatedDateTime":"2013-12-13T23:48:52Z","Content":"\n\u003Cp\u003E...they never said that resources will be canceled. They\u0027re just not happy with the way it is right now.\u003C/p\u003E\n"},{"CreatedByName":"MasterGir","CreatedById":17184,"CreatedDateTime":"2013-12-13T23:48:55Z","Content":"\n\u003Cp\u003EIf moderators want to clear any anger or confusion, simply request that Harv or someone from the dev team explain the decision in-depth.\u003C/p\u003E\n"}]}