{"TopicId":55927,"ForumId":32,"TopicTitle":"Tweakable fuel tanks","CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-12T19:07:12Z","PageNum":1,"Articles":[{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-12T19:07:12Z","Content":"\n\u003Cp\u003EI know it\u0027s early in KerbalKon to start complaining, but, oh well.\u003C/p\u003E\u003Cp\u003EI REALLY think they dropped the ball on the tweakable fuel tanks. For anyone that hasn\u0027t watched the videos, here\u0027s how a tweakable tank works, with an FL-T 800 as an example:\u003C/p\u003E\u003Cp\u003EThe FL-T 800 may hold \u003Cem\u003Eup to\u003C/em\u003E 360 fuel and \u003Cem\u003Eup to \u003C/em\u003E 440 oxidizer. \u003C/p\u003E\u003Cp\u003EYou may tweak the amount of fuel in the tank at launch to anywhere between 0 and 360 using a slider.\u003C/p\u003E\u003Cp\u003EYou may tweak the amount of oxidizer in the tank at launch to anywhere between 0 and 440 using a slider.\u003C/p\u003E\u003Cp\u003EBut the amount of fuel you select has no effect on the amount of oxidizer you can take, and vice-versa. So you if you want to take 400 fuel and 400 oxidizer, you have to put a totally separate tank on the ship for that extra 40 units of fuel...\u003C/p\u003E\u003Cp\u003EWHY!?!?!\u003C/p\u003E\u003Cp\u003EDisappointing guys.\u003C/p\u003E\n"},{"CreatedByName":"Dvarx","CreatedById":85911,"CreatedDateTime":"2013-12-12T19:09:46Z","Content":"\n\u003Cp\u003Eyou sure it\u0027s like that? :/ I think it\u0027ll be fixed by mod then..\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-12-12T19:16:17Z","Content":"\n\u003Cp\u003EI noticed that too. I\u0027m assuming that that will happen later, since it\u0027s the main reason I want tweakables.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-12T19:16:24Z","Content":"\n\u003Cp\u003EIt\u0027s what was demonstrated before Squad showed up. It\u0027s in the RAPIER demo video. The guy (Yarg?) showed how to set fuel and oxidizer maxes separately, the slider\u0027s didn\u0027t exceed the current max values.\u003C/p\u003E\u003Cp\u003EAlso, in the RAPIER demo video, he pointed out that you could reduce the volume of oxidizer and fuel, but the max values were each were still set. \u003C/p\u003E\u003Cp\u003EIt seems pretty clear that the max tank volumes for tanks are locked \u003Cem\u003Eper reactant\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Retread","CreatedById":89946,"CreatedDateTime":"2013-12-12T19:21:16Z","Content":"\n\u003Cp\u003EThis seems pretty rooted in reality - inside each fuel tank are separate, pressurized tanks for fuel and oxidizer. When you tweak the fuel tanks, you are changing to what percentage each one of those is filled - not the capacity of the tanks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-12T20:23:12Z\u0022 title=\u002212/12/2013 08:23  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 12, 2013\u003C/time\u003E by Retread\u003C/strong\u003E\n\u003Cbr\u003Egrammar\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-12T19:22:33Z","Content":"\n\u003Cp\u003EI can think of two reasons: Ease of coding and incentive to use different parts. Whether those are good reasons or not is debatable.\u003C/p\u003E\u003Cp\u003EE:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Retread\u0022 data-cite=\u0022Retread\u0022\u003E\u003Cdiv\u003EThis seems pretty rooted in reality - inside each fuel tank are separate, pressurized tanks for fuel and oxidizer. When you tweak the fuel tanks, you are changing how to what percentage each one of those is filled - not the capacity of the tanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs another good reason.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-12T19:33:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI can think of two reasons: Ease of coding and incentive to use different parts. Whether those are good reasons or not is debatable.\u003Cp\u003EE:\u003C/p\u003E\u003Cp\u003EIs another good reason.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re suddenly concerned about coding difficulty? ... wow...\u003C/p\u003E\u003Cp\u003EAlso odd seeing you invoking \u0022incentives to use different parts\u0022 after you flipped out about designers telling you how to play.\u003C/p\u003E\u003Cp\u003EAs far as different separate tanks, yes, you\u0027re changing it. At launch, you \u0022tweak\u0022 the part and partition it differently. I\u0027m not talking about changing max values in flight, I\u0027m talking about changing them during craft design. And the coding would be easy, even for you.\u003C/p\u003E\u003Cp\u003EBut I guess giving players more control just frightens some people.\u003C/p\u003E\n"},{"CreatedByName":"THE META","CreatedById":76506,"CreatedDateTime":"2013-12-12T19:38:45Z","Content":"\n\u003Cp\u003Ei\u0027m sorry, but tweakables were always meant to be like this. if you could tweak the max fuel of tanks in the VAB, then every one would just be setting the fuel tanks to ridiculously high amounts of fuel capacity and people would just say that it wasn\u0027t cheating since it\u0027s a in game feature.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2013-12-12T19:41:21Z","Content":"\n\u003Cp\u003EThe overall volume of liquid wouldn\u0027t be changed, for instance instead of 400 fuel 400 ox, you could have 600 ox 200 fuel. \u003C/p\u003E\u003Cp\u003EOr whatever combination up to 800 units of liquid volume.\u003C/p\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2013-12-12T19:42:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022THE META\u0022 data-cite=\u0022THE META\u0022\u003E\u003Cdiv\u003Ei\u0027m sorry, but tweakables were always meant to be like this. if you could tweak the max fuel of tanks in the VAB, then every one would just be setting the fuel tanks to ridiculously high amounts of fuel capacity and people would just say that it wasn\u0027t cheating since it\u0027s a in game feature.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not what people want. Having the ability to replace the oxidizer space with fuel would be cool. Of course you couldn\u0027t go above that.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-12T19:42:33Z","Content":"\n\u003Cp\u003EAs far as coding difficulty, I suppose it comes down more to GUI design and expected behavior. Adding two sliders is pretty easy, but when you are able to affect the values of one by sliding the other things get a bit hairy, especially when you deal with different densities (and maximums at that point). Then you need a reset button, how to allow reset from sliders, increment steps, what is intuitive, etc... It\u0027s not actually that much more code for sure, but making it playable takes some thought. Refinement may come with time.\u003C/p\u003E\u003Cp\u003EThere is the matter of a nod to realism that Retread brought up, I think that\u0027s a much more compelling argument.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-12T19:42:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EThe overall volume of liquid wouldn\u0027t be changed, for instance instead of 400 fuel 400 ox, you could have 600 ox 200 fuel. \u003Cp\u003EOr whatever combination up to 800 units of liquid volume.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. It\u0027s the volume total that matters.\u003C/p\u003E\n"},{"CreatedByName":"Firov","CreatedById":57445,"CreatedDateTime":"2013-12-12T19:44:44Z","Content":"\n\u003Cp\u003EIt really should be like the modular fuel tanks mod, where you can have any combination of fuel up to the maximum volume for that tank. For example, lets say you have a fuel tank with 200 units of fuel, then you might have 175 fuel, 75 oxidizer, and 50 units of monopropellant. \u003C/p\u003E\u003Cp\u003EThe only thing that should be limited is the overall volume of the tank, beyond that, we should be free to do as we please.\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2013-12-12T19:45:25Z","Content":"\n\u003Cp\u003EWell the oxidizer and the fuel surely can\u0027t be mixed. Not before ignition anyways\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-12-12T19:46:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EAs far as different separate tanks, yes, you\u0027re changing it. At launch, you \u0022tweak\u0022 the part and partition it differently. I\u0027m not talking about changing max values in flight, I\u0027m talking about changing them during craft design.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut I think where people here mention that it is rooted in reality, they are talking about the capacities of the physical partitions within the tank assembly being fixed. You may be able to customize the fuel load for a rocket that is on the pad by loading more or less fuel/oxidizer, but you can\u0027t realistically expect to be able to change the size of the partitions within the tank assembly on the pad.\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2013-12-12T19:46:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EThis. It\u0027s the volume total that matters.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. Would help a lot with SSTO building. No more lugging around tons of useless liquid fuel.\u003C/p\u003E\n"},{"CreatedByName":"THE META","CreatedById":76506,"CreatedDateTime":"2013-12-12T19:46:26Z","Content":"\n\u003Cp\u003Ewell if that\u0027s what you want, then I guess that\u0027s a lot better, and probably a hell of a lot more useful. maybe in .24, we will get more advanced tweakables.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-12T19:48:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAs far as coding difficulty, I suppose it comes down more to GUI design and expected behavior. Adding two sliders is pretty easy, but when you are able to affect the values of one by sliding the other things get a bit hairy, especially when you deal with different densities (and maximums at that point). Then you need a reset button, how to allow reset from sliders, increment steps, what is intuitive, etc... It\u0027s not actually that much more code for sure, but making it playable takes some thought. Refinement may come with time.\u003Cp\u003EThere is the matter of a nod to realism that Retread brought up, I think that\u0027s a much more compelling argument.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know why I even bothered responding to you. I directly addressed the \u0027nod to realism\u0027 in what I wrote, but you keep on ignoring it.\u003C/p\u003E\n"},{"CreatedByName":"Urban_K","CreatedById":82382,"CreatedDateTime":"2013-12-12T19:49:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Retread\u0022 data-cite=\u0022Retread\u0022\u003E\u003Cdiv\u003EThis seems pretty rooted in reality -\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd just like has happened in reality we should of course have the option of filling one with too much LOX.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-12T19:51:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EI directly addressed the \u0027nod to realism\u0027 in what I wrote\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I don\u0027t agree with that, certainly not on the pad and during design it reduces the incentive to use differing parts. I\u0027m sure we\u0027ll see what you want in a mod though, and maybe later in the iterative process. Why not make a suggestion?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-12T19:54:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022THE META\u0022 data-cite=\u0022THE META\u0022\u003E\u003Cdiv\u003Ewell if that\u0027s what you want, then I guess that\u0027s a lot better, and probably a hell of a lot more useful. maybe in .24, we will get more advanced tweakables.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I was never asking to be able to set the fuel capacity to any value. That\u0027d be nuts.\u003C/p\u003E\n"},{"CreatedByName":"Retread","CreatedById":89946,"CreatedDateTime":"2013-12-12T20:32:02Z","Content":"\n\u003Cp\u003EAnother way to approach this would be to allow separate tanks for fuel and oxidizer and release them in pairs sized in appropriate ratios. Want to build a standard rocket? Instead of the current orange tank, use the orange fuel tank plus the orange oxidizer tank. Building a spaceplane? Add more fuel tanks than oxidizer to cover the air-breathing portion of the flight. Have a refueling station in orbit that only needs fuel, not oxidizer? Make your payload a fuel-only tank. Both types of tanks could tweakable, and only require one slider each.\u003C/p\u003E\n"},{"CreatedByName":"El wonso","CreatedById":37011,"CreatedDateTime":"2013-12-12T20:39:19Z","Content":"\n\u003Cp\u003EI am really disappointed. I hope Squad will fix that before 0.24, I don\u0027t want to wait for months for such thing.\u003C/p\u003E\n"},{"CreatedByName":"Palleas","CreatedById":94813,"CreatedDateTime":"2013-12-12T20:49:49Z","Content":"\n\u003Cp\u003EThen ignoring the feature and play as before, enjoying optimisations, is your option.\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-12-12T20:51:17Z","Content":"\n\u003Cp\u003EIts not just about balancing fuel.\u003C/p\u003E\u003Cp\u003ETweakables (note the name, you can tweak things) are quite usefull in other areas that wernt in the rapier vid such as changing how wings work. Also note the ability to tweak the srb thrust. This will totally change how I use srb\u0027s\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBut the amount of fuel you select has no effect on the amount of oxidizer you can take, and vice-versa. So you if you want to take 400 fuel and 400 oxidizer, you have to put a totally separate tank on the ship for that extra 40 units of fuel...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would u need 400 units of each? you will run out of oxidiser too soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}