{"TopicId":56251,"ForumId":32,"TopicTitle":"Kerbal Obsessive Grief Syndrome","CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2013-12-15T17:28:43Z","PageNum":1,"Articles":[{"CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2013-12-15T17:28:43Z","Content":"\n\u003Cp\u003EKerbal Obsessive Grief Syndrome, also known as KOGS, is a disorder often acquired from playing too much Kerbal Space Program. \u003C/p\u003E\u003Cp\u003ECommon symptoms of KOGS are irregular thought patterns, obsession, borderline schizophrenia, and depression. Some physical symptoms that may take place are an a decrease in weight, blurred vision, and lack of sleep.\u003C/p\u003E\u003Cp\u003EIt has 4 stages of development before it completely takes effect, and once it does, it can be very hard to reverse. The 4 stages of KOGS have been elaborated on here:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage 1: Intrigue\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe patient will try the demo of KSP, and get used to its setting and mechanics, specifically the mechanics of lithobraking. this will make the patient intrigued, and make them want more of an experience.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage 2: Wonder\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe patient will then proceed to buy the full version. The patient is in awe of the new planets to explore, and the new parts at their disposal. The patient makes it their mission to explore and do everything within their ability in this fantastic new game.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage 3: Obsession\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe patient becomes obsessed with KSP. The patient spends days and nights trying to explore all the interplanetary bodies they are physically able to. The patient often gets little sleep during this time, and forgets to eat, which is met with massive intakes of caffeinated beverages. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStage 4: Depression\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe patient becomes depressed, because they realize that they are eating away at their short life without actually accomplishing anything meaningful. The patient is often not in a very healthy position physically or socially by the time the fourth stage kicks in. The patient will then proceed to try to force these feelings of depression down by playing even more KSP, but it only makes their depression more prominent. This depression eventually turns to grief as the patient realizes that they wasted so much of their life meaninglessly playing KSP, and they will never get it back.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIf you are experiencing any of these stages, or have already gone through them all, you should speak up about it. There ARE treatment options for you.\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2013-12-15T17:32:00Z","Content":"\n\u003Cp\u003EWhat about stage 5(Sleep substitution)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-15T17:36:31Z\u0022 title=\u002212/15/2013 05:36  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 15, 2013\u003C/time\u003E by Spartwo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-12-15T17:41:05Z","Content":"\n\u003Cp\u003EEhhh...what treatment options?\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2013-12-15T17:42:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TechnicalK3rbal\u0022 data-cite=\u0022TechnicalK3rbal\u0022\u003E\u003Cdiv\u003EEhhh...what treatment options?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore KSP:D\u003C/p\u003E\n"},{"CreatedByName":"quietsamurai98","CreatedById":69270,"CreatedDateTime":"2013-12-15T17:46:11Z","Content":"\n\u003Cp\u003EDue to \u003Ca href=\u0022https://en.wikipedia.org/wiki/Flow_(psychology)\u0022 rel=\u0022external nofollow\u0022\u003EFlow\u003C/a\u003E, you literally get addicted. So, yeah...\u003C/p\u003E\n"},{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2013-12-15T17:57:58Z","Content":"\n\u003Cp\u003EHi, my name is Will, and yes, I\u0027m... I\u0027m addicted to Kerbal Space Program. I spend my days planning terrific missions in my head and spend my nights executing them. I often to forget to sleep, eat or occasionally breathe and my family have gone, saying \u0022If you love Jeb more than you love us, were gone\u0022. It got so bad I recently thought I was turning green and getting shorter. I also tried to jump off the shed on to my trampoline in an attempt to get to the Moon, or as I call it Mun, to see if there are large arches resembling worms. \u003C/p\u003E\u003Cp\u003ESomebody help me.\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2013-12-15T17:58:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spartwo\u0022 data-cite=\u0022Spartwo\u0022\u003E\u003Cdiv\u003EWhat about stage 5(Sleep substitution)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure that applies throughout all 4 stages.\u003C/p\u003E\n"},{"CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2013-12-15T18:48:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TechnicalK3rbal\u0022 data-cite=\u0022TechnicalK3rbal\u0022\u003E\u003Cdiv\u003EEhhh...what treatment options?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are several treatment options for KOGS, but some of them require sacrifice. However, they do work sufficiently well, or at least they worked for me.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETreatment Option 1: Become a KSP Youtuber\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis treatment option will solve stage 4, but it may not stop your obsession with KSP. However it will at least show make you feel that your obsession has a sense of purpose, and is giving others enjoyment.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETreatment Option 2: Limit Your KSP Intake\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis Treatment option should cure all symptoms of KOGS. For this treatment option, it is best to limit your KSP intake to 2-3 hours per day. This challenge may be quite hard for some, but it will be worth it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETreatment Option 3: Quit KSP Cold Turkey\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ENOTE: THIS TREATMENT OPTION CAN BE QUITE DANGEROUS, AND COULD CAUSE IRREVERSABLE MENTAL HEALTH ISSUES. That being said, it is the only way to completely cure all symptoms of KOGS. And the irreversable mental health issues are not really that bad, and they are worth getting your life back.\u003C/p\u003E\u003Cp\u003EThese treatment options worked for me, so they can probably work for you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-12-15T18:55:06Z","Content":"\n\u003Cp\u003EKerbal Obsessive Grief Syndrome?\u003C/p\u003E\u003Cp\u003EKerbal Obsessive Coffee Syndrome?\u003C/p\u003E\u003Cp\u003EWho cares, I\u0027m off to explore! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-12-15T19:00:34Z","Content":"\n\u003Cp\u003EJust LOL at life.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-15T19:08:52Z","Content":"\n\u003Cp\u003EI suffered all the way to Stage 3, but instead of Stage 4, I began to feel like KSP is a pointless game, and all you can do is to just go to planets and muns just for the sake of going there, plant a flag and go home, and that setting bases gets boring quickly.\u003C/p\u003E\u003Cp\u003EI \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Ereally\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E want to regain the fun I gathered from KSP weeks ago, but it is just impossible.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-15T19:14:19Z","Content":"\n\u003Cp\u003EI\u0027m bouncing between 3 and 4. I am trying to be a KSP YouTuber, though.\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-12-15T19:28:15Z","Content":"\n\u003Cp\u003EIm like stage six,\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003ESTAGE-6: The exploitation \u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe patient has gotten over his/her depression and lack of social life by joining the KSP forums and talking about his/her addictions and problems with fellow patients. The patient has also solved his/her sleep deprivation by allowing the game to run while he/she sleeps and eats knowing that when they wake up they will be ready for a eloo orbital maneuver. Despite the patient knowing KSP is in retrospect, a useless wast of time he/she continues to play do to the addiction set in stage 4 but the patient has learned to harness this addition and gain vast amounts of space, rocket, and aerodynamic knowledge vea other internet sources, The patient then in the future proceeds to become an aerospace engineer for what they call the\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003E human space program\u003C/em\u003E\u003C/span\u003E making real rockets and space flights, all while still contributing time to the game. \u003C/p\u003E\u003Cp\u003EThere is no cure for stage 6 other then MOAR SCIENCE!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-15T19:33:24Z\u0022 title=\u002212/15/2013 07:33  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 15, 2013\u003C/time\u003E by Tidus Klein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bombo1","CreatedById":79693,"CreatedDateTime":"2013-12-15T20:57:06Z","Content":"\n\u003Cp\u003EWell i have all the symptoms and is on stage 4 and is not planning to quit\u003C/p\u003E\u003Cp\u003EI am on the other hand very sucsessfull in social life but not social\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-12-16T07:34:48Z","Content":"\n\u003Cp\u003EPerhaps the game should come with a health warning!\u003C/p\u003E\n"}]}