{"TopicId":56524,"ForumId":32,"TopicTitle":"The Grand 0.23 Discussion Thread","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2013-12-17T19:56:36Z","PageNum":7,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-12-18T01:05:38Z","Content":"\n\u003Cp\u003EOne can hope. One of the biggest flaws with solid boosters is their raw power for their size. Outside of a very few specific builds, they will waste most of their solid fuel fighting the atmosphere if left to default settings.\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-12-18T01:09:38Z","Content":"\n\u003Cp\u003EI\u0027m looking forward to messing with sepratrons, I think a shorter burst of thrust could be more useful in some situations, and a longer lower-thrust burn in others.\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2013-12-18T01:09:49Z","Content":"\n\u003Cp\u003EHonestly, this is one of the things I was most excited about in .23. You can make the SRBs burn as long as real ones would, and with a reasonable TWR.\u003C/p\u003E\n"},{"CreatedByName":"Santoron","CreatedById":76689,"CreatedDateTime":"2013-12-18T01:20:21Z","Content":"\n\u003Cp\u003EWon\u0027t get to play for a few hours, so digging into the new parts and SCIENCE!!! will have to wait...\u003C/p\u003E\u003Cp\u003EBut I just had to take a quick peek at a couple high part count vessels I had in orbit, and I\u0027m absolutely thrilled with the performance increase. A vessel that ran like a slideshow on my laptop before now is at playable framerates, defnitely more than double the FPS I could manage on that machine and vessel before. Same deal with my old way way overbuilt station I had replaced because of the poor performance around it. And the performance around smaller (~100 pt) vehicles is now silky smooth. \u003C/p\u003E\u003Cp\u003EKudos to the devs for all the hard work. I had given up hope of seeing this game perform so well. Now I can\u0027t wait to check out the update on my Desktop once the children are in bed!\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2013-12-18T01:21:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceSphereOfDeath\u0022 data-cite=\u0022SpaceSphereOfDeath\u0022\u003E\u003Cdiv\u003EI\u0027m currently being annoyed at steam, deleting my entire KSP folder, restoring game cache then playing\u003Cp\u003E(seriously, steam\u0027s auto update feature might as well not exist, it\u0027s just wasted memory)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI used the STEAM update feature from the GAMES menu tab instead of using the launcher and had no problems.\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-12-18T01:30:02Z","Content":"\n\u003Cp\u003EThat\u0027s actually really freakin useful. The one big thing I hated about SRB\u0027s was how much fuel they wasted in lower atmo.\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-12-18T01:33:17Z","Content":"\n\u003Cp\u003EI\u0027ll continue toying with them tomorrow. Can fuel lines be used on SRBs? If so, they could really be better then regular engines for asparagus launch now.\u003C/p\u003E\n"},{"CreatedByName":"Kronikor","CreatedById":83878,"CreatedDateTime":"2013-12-18T01:34:34Z","Content":"\n\u003Cp\u003EWell get into the game today and WOW did .22 make this game feel different, adding science objectives - career mode, new parts and a tech tree what fun!! So much content in the same period it took to release the .23 update (not sure if the man hours were the same but time-frame wise). So why does .23 feel virtually unchanged? I feel like the only thing that seems new is the science archives which in all honesty come off as pretty much useless to me...Why do I care what experiments I\u0027ve performed when I have all the parts? Why would I care even if I didn\u0027t, for nostalgia\u0027s sake? I know where I haven\u0027t been based on which celestial bodies have flags on them...so...why do I need this? Spent about 5 minutes in the archives before leaving them and probably will never open it again - there\u0027s literally no reason for ever opening that tab ever again. (sorry to dev who spent all that time developing that feature...I saw it once and I was very impressed, great work - but it\u0027s useless *sadface*) - a tab with last year\u0027s super bowl scores would be just as useful to me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EBasically I just feel like I\u0027m in 0.22 with a new hybrid engine and a science lab I don\u0027t see why I need either...sure the tweaking is nice, but it doesn\u0027t feel any different...it\u0027s a minor change and makes my ships a bit more capable...woohoo? As a hardcore fan I have been on the edge of my seat waiting for this and once I read the patch notes I was kind of nervous...get in the game this evening and my fears were confirmed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I suppose I\u0027ll be shelving KSP until 0.24 :*( Please add something cool next patch! Maybe I\u0027ll play around with the new hybrid engine a bit...but my SSTO\u0027s are already perfect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E mmeeeeehhh am I being a negative nancy or do you guys feel let down by this patch tooooo? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E(((\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T01:44:24Z\u0022 title=\u002212/18/2013 01:44  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by Kronikor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kokanee","CreatedById":93886,"CreatedDateTime":"2013-12-18T01:35:52Z","Content":"\n\u003Cp\u003EAnyone else getting this error when they try to update via the in-game update:\u003C/p\u003E\u003Cp\u003Ersync: connection unexpectedly closed (0 bytes received so far) [Receiver] \u003C/p\u003E\u003Cp\u003Ersync error: error in rsync protocol data stream (code 12) at /home/lapo/package/rsync-3.0.9-1/src/rsync-3.0.9/io.c(605) [Receiver=3.0.9] \u003C/p\u003E\u003Cp\u003Ersync exited with code 12: Error in rsync protocol data stream \u003C/p\u003E\u003Cp\u003E????????????????????\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2013-12-18T01:36:10Z","Content":"\n\u003Cp\u003EYou\u0027re being a negative nancy. Lots of work done under the hood doesn\u0027t become immediately obvious.\u003C/p\u003E\n"},{"CreatedByName":"Kromey","CreatedById":57375,"CreatedDateTime":"2013-12-18T01:37:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unfawkable\u0022 data-cite=\u0022Unfawkable\u0022\u003E\u003Cdiv\u003ECan fuel lines be used on SRBs?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u0027S\u0027 stands for \u0022Solid\u0022, as in \u0022solid fuel\u0022, as in \u0022there\u0027s no way within physics that a simple pipe could pump this stuff around\u0022. If fuel lines can be used, that\u0027s one heck of an egregious bug!! (NB: Pretty sure they can\u0027t be, though.)\u003C/p\u003E\n"},{"CreatedByName":"Monkthespy","CreatedById":7644,"CreatedDateTime":"2013-12-18T01:37:33Z","Content":"\n\u003Cp\u003EI have to admit it\u0027s kind of lame to have much better loading times. Or optimizations.\u003C/p\u003E\u003Cp\u003EOh wait, that is awesome and was needed since forever. I barely played around 20 minutes and I can feel the optimization, it\u0027s pretty damn good. Sometimes Kronikor you want behind the scenes improvements. Not just stuff you can see.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-12-18T01:37:34Z","Content":"\n\u003Cp\u003EI like the new layout of the VAB/SPH but I am a less than thrilled by the RAPIER which I find a bit OP compared to the B9 SABRE, which is based on the same technology.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-12-18T01:37:40Z","Content":"\n\u003Cp\u003EI was fairly surprised with the Steam update--I consider my internet connection terrible (well I live in the Philippines so it\u0027s a no-brainer), slow and unreliable, yet it only took a few minutes for Steam to update KSP. Been running it since its release without issues.\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-12-18T01:38:10Z","Content":"\n\u003Cp\u003EReplay career mode. Preferably with a tech tree editor, it really makes the experience much tougher. Plus with the new science mechanisms it would make things a lot harder, on top of that.\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-12-18T01:39:32Z","Content":"\n\u003Cp\u003EFuel lines cannot transfer solid fuel.\u003C/p\u003E\n"},{"CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2013-12-18T01:39:48Z","Content":"\n\u003Cp\u003ESquad wanted as stable a game as possible for the 2014 season. A lot of this patch is more behind-the-scenes and about optimization. Not every patch can be feature-packed, and .22 was going to be hard to follow up in the first place. The RAPIER and Mobile Lab are some new toys for us to play around with while waiting for some new stuff. I wasn\u0027t really let down, since it was made obvious early on that .23 wasn\u0027t going to be feature-full.\u003C/p\u003E\u003Cp\u003EShelving KSP until .24? How? Don\u0027t worry, leave it alone for a few days, the desire to play will come back. You seem like a veteran player; mess around with the new parts. Push them to their limits. See what they can do. Then come here and brag. We like seeing awesome stuff \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rassa Farlander","CreatedById":63627,"CreatedDateTime":"2013-12-18T01:40:02Z","Content":"\n\u003Cp\u003ETweakables were a long time in coming, its a feature with HUGE potential for making better ships. The archive is great so you dont double up on experiments where youve don them before. Also the loading time, for me, was cut down drastically. Granted it wasnt as obvious change like .18 or .21 was but its still, so far, a decent update.\u003C/p\u003E\n"},{"CreatedByName":"johngault007","CreatedById":96359,"CreatedDateTime":"2013-12-18T01:41:55Z","Content":"\n\u003Cp\u003EI guess if you maxed everythig out and you have unlocked/explored all the celestial bodies there weren\u0027t any great advances. I for one like the archives for the simple fact I am a bit OCD and want to max all science in every category. It\u0027s a good snapshot for future mission planning IMO. \u003C/p\u003E\u003Cp\u003EI looked at .23 as a good step in the right direction.\u003C/p\u003E\n"},{"CreatedByName":"Discopete","CreatedById":62472,"CreatedDateTime":"2013-12-18T01:43:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SQUAD\u0022 data-cite=\u0022SQUAD\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EScience Revisited\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ETransmitting scientific data no longer allows you to max out the value of a subject just by repeating the transmission multiple time, removing the experiment data from some experiment modules (for transmission or by EVA) will render them inoperable; resetting an experiment can still be done freely as long as the data is not removed from the module.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn other words, all of the time I spent building, testing and transporting my science labs to their respective locations (planets) is wasted. They are now all one shot vehicles. Great. AND because I am running KSP though Steam, it auto updated so I don\u0027t have the option of not breaking my work. This should have been a user settable option, not an arbitrary lock.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-12-18T01:43:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kronikor\u0022 data-cite=\u0022Kronikor\u0022\u003E\u003Cdiv\u003EWell get into the game today and WOW did .22 make this game feel different, adding science objectives - career mode, new parts and a tech tree what fun!! So much content in the same period it took to release the .23 update (not sure if the man hours were the same but time-frame wise). So why does .23 feel virtually unchanged? I feel like the only thing that seems new is the science archives which in all honesty come off as pretty much useless to me...Why do I care what experiments I\u0027ve performed when I have all the parts? Why would I care even if I didn\u0027t, for nostalgia\u0027s sake? I know where I haven\u0027t been based on which celestial bodies have flags on them...so...why do I need this? Spent about 5 minutes in the archives before leaving them and probably will never open it again - there\u0027s literally no reason for ever opening that tab ever again. (sorry to dev who spent all that time developing that feature...I saw it once and I was very impressed, great work - but it\u0027s useless *sadface*) - a tab with last year\u0027s super bowl scores would be just as useful to me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cp\u003EBasically I just feel like I\u0027m in 0.22 with a new hybrid engine and a science lab I don\u0027t see why I need either...sure the tweaking is nice, but it doesn\u0027t feel any different...it\u0027s a minor change and makes my ships a bit more capable...woohoo? As a hardcore fan I have been on the edge of my seat waiting for this and once I read the patch notes I was kind of nervous...get in the game this evening and my fears were confirmed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I suppose I\u0027ll be shelving KSP until 0.24 :*( Please add something cool next patch! Maybe I\u0027ll play around with the new hybrid engine a bit...but my SSTO\u0027s are already perfect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E mmeeeeehhh am I being a negative nancy or do you guys feel let down by this patch tooooo? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E(((\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a road bike. Every now and then, I would buy stuff like a new saddle, a new crankshaft or a new set of gear ratios for it. But I don\u0027t think it changes the way I ride considerably, and perhaps I would consider it a negative if it DID change anything significant in the way I ride it. Sure, the new purchases would enhance the bike, sometimes considerably, sometimes in more subtle ways, and I do welcome the changes. But it doesn\u0027t affect the overall enjoyment I get when riding my bike. \u003C/p\u003E\u003Cp\u003EHowever, I do have friends who have bikes, who get tired of riding their bike, when they get bored by some new thing they attached to it (i.e. like say, a bicycle computer or an aerodynamic handlebar). They would only get interested riding their bike again, when they spy some new gadget in the shop that they feel would make their bike ride exciting all over again. I feel these individuals aren\u0027t really enjoying or even understand the essence of the bike--they\u0027re not enjoying the bike ride--they\u0027re enjoying the thrill of getting new stuff.\u003C/p\u003E\u003Cp\u003ESee the parallelism here?\u003C/p\u003E\u003Cp\u003ESo my advice is, try to find the essence of why you found KSP to be enjoyable, when you first got it, and once you rediscover that, an update with even just ONE feature change, will delight you.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T01:49:25Z\u0022 title=\u002212/18/2013 01:49  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by rodion_herrera\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"greg12","CreatedById":56261,"CreatedDateTime":"2013-12-18T01:44:56Z","Content":"\n\u003Cp\u003EMost of the 0.23 features was coding based. For example: Minmus biomes, science system fixes, optimizations, unity upgrade, tweekables, steerable wheels... The devs work hard and you would have to appreasete their work!\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-12-18T01:46:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Discopete\u0022 data-cite=\u0022Discopete\u0022\u003E\u003Cdiv\u003EIn other words, all of the time I spent building, testing and transporting my science labs to their respective locations (planets) is wasted. They are now all one shot vehicles. Great. AND because I am running KSP though Steam, it auto updated so I don\u0027t have the option of not breaking my work. This should have been a user settable option, not an arbitrary lock.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, you can either force Steam to download the previous stable (0.22), which I think is nothing more than a temporary fix, or you can fly out a science module to the systems you have your craft in and provided that it has a docking port, you can use the experiments, dock with the lab, clean the experiments and reuse them. Also, the sensors (barometer, gravioli detector etc..) are not affected by this.\u003C/p\u003E\n"},{"CreatedByName":"Sun","CreatedById":66710,"CreatedDateTime":"2013-12-18T01:51:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eranur\u0022 data-cite=\u0022eranur\u0022\u003E\u003Cdiv\u003EIs it just me or is the Launcher not recognizing that we have a update?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it\u0027s already downloaded 0.23!\u003C/p\u003E\n"},{"CreatedByName":"bowdlerize","CreatedById":31701,"CreatedDateTime":"2013-12-18T02:00:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Discopete\u0022 data-cite=\u0022Discopete\u0022\u003E\u003Cdiv\u003EAND because I am running KSP though Steam, it auto updated so I don\u0027t have the option of not breaking my work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECopy the files to another location can run the .exe. KSP has no DRM.\u003C/p\u003E\n"}]}