{"TopicId":56682,"ForumId":32,"TopicTitle":"What do you think is next (.24)","CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-12-18T13:00:30Z","PageNum":4,"Articles":[{"CreatedByName":"Vrana","CreatedById":79915,"CreatedDateTime":"2013-12-20T03:12:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonik\u0022 data-cite=\u0022Arsonik\u0022\u003E\u003Cdiv\u003E..... in the mean time until we can all agree on what music to play at our space disco. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my almost 34 years on this planet i have never, not once, seen people agree on this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shoveycat","CreatedById":71091,"CreatedDateTime":"2013-12-20T03:14:33Z","Content":"\n\u003Cp\u003EThe 2 things im really, REALLY looking forward to are better aerodynamics and an asteroid belt\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-20T03:47:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vrana\u0022 data-cite=\u0022Vrana\u0022\u003E\u003Cdiv\u003EWhat i would really love to see is some flight/craft history.\u003Cp\u003EKinda like this....\u003C/p\u003E\u003Cp\u003ESay I launch an Atlas rocket. Game names it Atlas I.\u003C/p\u003E\u003Cp\u003EGame records time of launch, crew, SOIs visited/experminets ran/landings, time of recovery if any, causlties if any.\u003C/p\u003E\u003Cp\u003EGame stores this information in \u0022space museum\u0022 and i can review it at any time by visiting the museum. Dont need to see the whole flight path (tough it would be nice) just some info so recovered flights dont disapper from history.\u003C/p\u003E\u003Cp\u003EAdd a small building for the museum. Just like it was done in BARIS.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, need to repost this...again, because it really is a great idea. I would love to flick through an album as well, seeing the trajectories we took from the map, screenshots etc. As this kind of thing is in the do not suggest list they either have no plans to make this ever or have had plans to make something like this from the start so please stop asking us to...WE KNOW.\u003C/p\u003E\u003Cp\u003EI hope for the latter \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Coupon","CreatedById":26924,"CreatedDateTime":"2013-12-20T04:41:15Z","Content":"\n\u003Cp\u003EWhat do you think is in 0.25?\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-12-20T05:08:17Z","Content":"\n\u003Cp\u003EI\u0027d really love to see the finance model implemented. Everything else in the game is servicable at the moment, so I\u0027d really like to see the complete career mode in place before doing the fine tuning to certain systems.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-12-21T08:00:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eji1700\u0022 data-cite=\u0022Eji1700\u0022\u003E\u003Cdiv\u003EWhat i\u0027d like in order of personal importance-\u003Cp\u003E1. OBSERVATION. A huge part of space exploration comes from looking at and mapping things FIRST and then you start blowing stuff up to try and get there. Having a \u0022fog of war\u0022 for the solar system that you can uncover with various methods would be great. I\u0027d love the idea that you only start with knowledge of the sun, kerbal, and the mun, but can either send out exploratory probes, use telescopes, and maybe even other methods(from realistic stuff like enough science \u002B knowledge of orbits =\u0027s figuring out a possible location, to more kerbal things like chain launching suicide 900 suicide probes in every possible direction) to figure out where other planets are. Further upon discovering you don\u0027t have any idea what they look like in detail until you actually GO there(or high enough tech could be very powerful telescopes). There\u0027s so much you could do with this(especially if you could then randomize the solar system each game) that i\u0027d love to see it implemented. Hell even MORE you could do with it \u002B multiplayer Sadly i\u0027m doubting it\u0027s even on the list let alone being worked on.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. Very much this. Perhaps a two level fog of war. At the beginning of the game you\u0027re aware of the main planets (Eve, Duna, Jool), possibly the smaller ones and almost certainly not Eeloo and the smaller moons. But you only know them as a coloured blob, apart from the Mun which you have a reasonable map of from telescope observations.\u003C/p\u003E\u003Cp\u003EPut a probe in orbit, launch a space telescope or whatever and you peel back the first fog of war layer and get a low res image of the planet. To see the full resolution version either needs an advanced satellite in a low orbit or actually going down there and driving around. \u003C/p\u003E\u003Cp\u003EGoing to the Map screen, zooming in on the Mun and seeing these little snail trails of high resolution image where your kerbals have landed and explored - that would be cool!\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-12-21T08:08:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vrana\u0022 data-cite=\u0022Vrana\u0022\u003E\u003Cdiv\u003EWhat i would really love to see is some flight/craft history.\u003Cp\u003EKinda like this....\u003C/p\u003E\u003Cp\u003ESay I launch an Atlas rocket. Game names it Atlas I.\u003C/p\u003E\u003Cp\u003EGame records time of launch, crew, SOIs visited/experminets ran/landings, time of recovery if any, causlties if any.\u003C/p\u003E\u003Cp\u003EGame stores this information in \u0022space museum\u0022 and i can review it at any time by visiting the museum. Dont need to see the whole flight path (tough it would be nice) just some info so recovered flights dont disapper from history.\u003C/p\u003E\u003Cp\u003EAdd a small building for the museum. Just like it was done in BARIS.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnother vote for this. Not an essential feature by any means but a very nice piece of polish. I do this already to some extent using the notes for each vessel but that doesn\u0027t really work when you launch the same design more than once.\u003C/p\u003E\n"},{"CreatedByName":"JiWint","CreatedById":78150,"CreatedDateTime":"2013-12-21T09:07:00Z","Content":"\n\u003Cp\u003EI\u0027d like to have use for probes,like making photos of planets,any other stuff that real satellites have - for science!\u003C/p\u003E\n"},{"CreatedByName":"lump","CreatedById":30092,"CreatedDateTime":"2013-12-21T13:08:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vrana\u0022 data-cite=\u0022Vrana\u0022\u003E\u003Cdiv\u003EWhat i would really love to see is some flight/craft history.\u003Cp\u003EKinda like this....\u003C/p\u003E\u003Cp\u003ESay I launch an Atlas rocket. Game names it Atlas I.\u003C/p\u003E\u003Cp\u003EGame records time of launch, crew, SOIs visited/experminets ran/landings, time of recovery if any, causlties if any.\u003C/p\u003E\u003Cp\u003EGame stores this information in \u0022space museum\u0022 and i can review it at any time by visiting the museum. Dont need to see the whole flight path (tough it would be nice) just some info so recovered flights dont disapper from history.\u003C/p\u003E\u003Cp\u003EAdd a small building for the museum. Just like it was done in BARIS.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah i was thinking a spore type idea, where say you had the Atlas 1,the game would make a separate area for the atlas rocket, in the \u0022Atlas\u0022 subdivision, then if you tweaked it in career mode with some new boosters and 4 solids round the side and called it atlas 2 it would be saved in the same atlas area, and the history would be like spores, as in, it would show the progression and evolution of the rocket into the current atlas you would be using, and all the science it collected in between ans stat about its most successful mission (how much science collected or how many bodies landed on or how little kerbals died or got stranded e.c.t.)\u003C/p\u003E\n"},{"CreatedByName":"CaptainArchmage","CreatedById":82533,"CreatedDateTime":"2013-12-21T17:13:24Z","Content":"\n\u003Cp\u003EProbably they will implement cost and you will have to buy parts, as people pointed out HarvesteR said. A good 0.24 update would also include resources, so one could run scouting missions on the Mun or on other planets.\u003C/p\u003E\n"},{"CreatedByName":"Animal Mother","CreatedById":2477,"CreatedDateTime":"2013-12-21T20:08:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GarageBay9\u0022 data-cite=\u0022GarageBay9\u0022\u003E\u003Cdiv\u003EI\u0027d like to see suborbital / atmospheric research included.\u003Cp\u003EThe X-1, X-15 and later transonic / supersonic / hypersonic and high-altitude research programs were crucial to NASA\u0027s progression from the pre-Mercury era to the success of the Apollo program.\u003C/p\u003E\u003Cp\u003EPlus, it\u0027d be a really cool way to do science. And watching Jeb grin like an idiot at the equivalent of Mach 3 is awesome.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, but at the same time it would require a crucial revisal of the research tree, to allow access to aerodynamic stuff first.\u003C/p\u003E\u003Cp\u003EI want the screenshots that you take to account for some of your research points. Kind of like the mechanic that was going to be included in the FPS XCOM before it got canned.\u003C/p\u003E\u003Cp\u003EAny news on the planetary resource overlays? Will it be enhanced to identify regions (biomes) that could be explored?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-21T20:11:20Z\u0022 title=\u002212/21/2013 08:11  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 21, 2013\u003C/time\u003E by Animal Mother\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CrazedGunman502","CreatedById":81247,"CreatedDateTime":"2013-12-21T20:40:40Z","Content":"\n\u003Cp\u003EStill waiting for GP2.\u003C/p\u003E\n"},{"CreatedByName":"Requiem762","CreatedById":82185,"CreatedDateTime":"2013-12-21T22:11:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tidus Klein\u0022 data-cite=\u0022Tidus Klein\u0022\u003E\u003Cdiv\u003EOk..... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E....but do I have to??\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyes, yes you do download some mods if you need to keep the game interesting for yourself for now.\u003C/p\u003E\n"},{"CreatedByName":"Astraph","CreatedById":80902,"CreatedDateTime":"2013-12-22T00:42:46Z","Content":"\n\u003Cp\u003EMy wish list would include:\u003C/p\u003E\u003Cp\u003E-\u0026gt; More worlds. Not anything much - but I like the way WoT gets updated, with one map added per update. Even if it was supposed to be something minor - like adding a lone asteroid, some comet or stuff. I don\u0027t - and can\u0027t expect a Jool-style system being added anytime soon, but a small, relatively featurless body to reach would be a blast.\u003C/p\u003E\u003Cp\u003E-\u0026gt; Parts like aerodynamic brakes, more types of ion engines and (most wanted) kind of stack bi- or tricoupler for the smallest modules. It is kinda frustrating to use the 1,25m-sized tricoupler to mount more than one ion engine on my stack \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E-\u0026gt; Revised solar panel mechanics. You know, the \u0022square distance\u0022 thing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: After ~10 unsuccessful probe landings... RADAR altimeter...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-22T00:52:35Z\u0022 title=\u002212/22/2013 12:52  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 22, 2013\u003C/time\u003E by Astraph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-01-02T18:41:57Z","Content":"\n\u003Cp\u003EOkay........\u003C/p\u003E\u003Cp\u003EHow about:\u003C/p\u003E\u003Cp\u003E1. COCKPIT for mk2 and mk3\u003C/p\u003E\u003Cp\u003E2. A museum thingy\u003C/p\u003E\u003Cp\u003E3. Cameras/telescopes that when an image is captured or a video, it gives science points. Like on Bioshock 2, you pulled out your camera and attacked something, you got science points. So maybe if you get the science level of telescopes, you launch one, as a probe, into orbit. Look around, and discover that Jool is mroe than a star. It\u0027s a GAS DWARF! (yeah, I know, but it has less gravity than Earth and is about the size of Earth.......) And then you get 150 science points after discovering that Jool is a planet. Than you get 50 to 75 for each moon of Jool. And if you figure out Jool\u0027s orbit (IE: prolonged observation of planet) than you get 100 science. It would be pretty cool. And up close images would bring in 150 as well, of Jool, I mean.\u003C/p\u003E\n"},{"CreatedByName":"Highlad","CreatedById":64590,"CreatedDateTime":"2014-01-02T19:18:51Z","Content":"\n\u003Cp\u003EI\u0027m really looking forward to this new update. If squad can get reputation, economy etc. into the game along with even a few of the ideas here, it may be one of the best updates yet!\u003C/p\u003E\u003Cp\u003EPersonally, I am loving the idea of the museum building and I really think that squad should get on that. As for more planets and better aerodynamics, I can wait \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs a side note:\u003C/p\u003E\u003Cp\u003EI think that it must be really hard to find a balance between satisfying experienced players and keeping new ones hooked. The problem with resources, realistic aerodynamics and tonnes of planets is that it could easily scare away potential players. Don\u0027t get me wrong, lots of new players would like these things, but I think squad wants to make this game easy to pick up and play for everyone.\u003C/p\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2014-01-02T20:52:32Z","Content":"\n\u003Cp\u003EI\u0027m so sick and tired of people saying realistic aerodynamics scaring away potential players. There\u0027s like 0 chance of this, the same way there\u0027s 0 chance a \u003Cstrong\u003Emore\u003C/strong\u003E realistic aerodynamic model is going to be highly realistic. For anyone picking up the game for the first time, the aerodynamic system will just be there, like the current placeholder has just been there for the older players. The only thing it\u0027ll do is tick off the vocal minority player group that want the old model because they find it to be easier/better for whatever reason.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-01-02T21:03:25Z","Content":"\n\u003Cp\u003EI want MOAR PLANETS (like every update)\u003C/p\u003E\u003Cp\u003EWhat I want that might have a chance to get in the update, contracts and/or Money\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-01-02T21:35:09Z","Content":"\n\u003Cp\u003EThe main Topic might be reputations and contracts but there is always something besides that.\u003C/p\u003E\u003Cp\u003EI can only hope that they will add more Sound effects because some functions are missing some since they have been implemented. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Raven.","CreatedById":99340,"CreatedDateTime":"2014-01-02T23:04:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceSphereOfDeath\u0022 data-cite=\u0022SpaceSphereOfDeath\u0022\u003E\u003Cdiv\u003EI want MOAR PLANETS (like every update)\u003Cp\u003EWhat I want that might have a chance to get in the update, contracts and/or Money\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA working economy would be extremely nice for those of us who enjoy career mode. Me personally, I second the notion of more celestial bodies, though not limited to solely planets. What I think would make a great addition to the game, in addition to the economy, is a asteroid belt located between Duna and Dres, with Dres being on the outer edge. I would also love to see a second gas giant system located out further beyond Jool. And maybe, for the sake of eye candy, have the gas giant be a mimic of Saturn with actual planetary rings. This would give the end gamers additional challenges and content to play through.\u003C/p\u003E\u003Cp\u003EUnfortunately though, I don\u0027t expect this to happen for a while. The software developer in me says that while I want more planets, Squad needs to add the biome system to other planets such as Laythe before adding additional content, such as the economy system.\u003C/p\u003E\n"},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2014-01-02T23:49:08Z","Content":"\n\u003Cp\u003Eregarding the OP: I\u0027d like to see more biomes. I remember when I landed with a science probe on duna. I thought... well, let\u0027s go for those nice white polar caps. and then, when I basically crash-landed the probe (it ripped apart when the parachutes fully deployed), I just got the information \u0022duna surface\u0022.\u003C/p\u003E\u003Cp\u003Ecurrently I play 0.23 with a few mods, the one with the largest impact is the alternis mod. honestly, minmus is quite hard to reach, because it is so close to jool, so better ways to mod that stuff (modding biomes, modding planets and modding the techtree) would be nice aswell.\u003C/p\u003E\u003Cp\u003Eon the other hand, I was really surprised how convenient the tweakable parts inside the VAB are. basically it\u0027s one of the features I use most. so I\u0027m confident that they know what they are doing...\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2014-01-03T02:41:51Z","Content":"\n\u003Cp\u003EI would be surprised if Duna biomes weren\u0027t in 0.24. Seems to me like they\u0027re doing one body per update.\u003C/p\u003E\u003Cp\u003EI do get the feeling that Squad want a finished product out ASAP now. I\u0027m only expecting 2 or 3 more updates before they call Beta on KSP.\u003C/p\u003E\n"},{"CreatedByName":"Astraph","CreatedById":80902,"CreatedDateTime":"2014-01-03T23:32:06Z","Content":"\n\u003Cp\u003EActually it just dawned on me we could use some kind of automatic surface sample gatherer. I\u0027d love to perform a couple of unmanned surface sample return missions on Duna and Moho, but just sending a lander and launching it back is kinda... Meh. I\u0027ve tried this with Kethane mod and Minimus - but mining equipment is quite heavy and (IMHO) requires a totally different lander setup...\u003C/p\u003E\n"},{"CreatedByName":"SSM_Aero","CreatedById":73472,"CreatedDateTime":"2014-01-03T23:57:20Z","Content":"\n\u003Cp\u003EThey should incorporate a docking camera and/or advanced navball.\u003C/p\u003E\n"},{"CreatedByName":"likke_A_boss","CreatedById":94697,"CreatedDateTime":"2014-01-04T10:02:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vrana\u0022 data-cite=\u0022Vrana\u0022\u003E\u003Cdiv\u003EWhat i would really love to see is some flight/craft history.\u003Cp\u003EKinda like this....\u003C/p\u003E\u003Cp\u003ESay I launch an Atlas rocket. Game names it Atlas I.\u003C/p\u003E\u003Cp\u003EGame records time of launch, crew, SOIs visited/experminets ran/landings, time of recovery if any, causlties if any.\u003C/p\u003E\u003Cp\u003EGame stores this information in \u0022space museum\u0022 and i can review it at any time by visiting the museum. Dont need to see the whole flight path (tough it would be nice) just some info so recovered flights dont disapper from history.\u003C/p\u003E\u003Cp\u003EAdd a small building for the museum. Just like it was done in BARIS.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo much this. I love this idea a ton.\u003C/p\u003E\n"}]}