{"TopicId":57732,"ForumId":32,"TopicTitle":"How much work of squad is showed in updates","CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2013-12-25T23:07:06Z","PageNum":5,"Articles":[{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-12-29T02:17:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003ESmall point of order there Kasper. Pointing out a logical fallacy in an opponent\u0027s argument is not, itself, a fallacy.\u003Cp\u003EUnless that\u0027s not what you were saying at all, in which case I\u0027m far too tired for my own good.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt may not be a fallacy but it is off-topic.\u003C/p\u003E\u003Cp\u003EBack on topic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"luchelibre","CreatedById":61140,"CreatedDateTime":"2013-12-29T02:32:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EAnd YOU are strawmanning. Nowhere does he say that Squad is lazy. You said it, then proceeded to yell at him with a verbose equivalent of \u0027HOW DARE YOU!?\u0027\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, I\u0027m glad he\u0027s not lame enough to simply say \u0022Squad is lazy.\u0022 Still, you need to comprehend.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003E...\u003Cp\u003E[AAA teams] aren\u0027t just showing up and browsing Reddit for half the day and then deciding that since it\u0027s been three months they should put in a science archive screen.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003ESorry but \u0027when it\u0027s done\u0027 is an excuse that flies with procrastinating teenagers, not anyone who actually has a real job. Squad\u0027s updates are outrageously slow and chronically offer extremely little content relative to the time investment involved. In three months I would expect you\u0027d have been able to do more than to add two new parts and make some experiments a one-time affair. v1.0 of the game is so far away at this pace that I honestly wonder if anyone will even still be playing this game enough to care when that happens.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EIf you don\u0027t stick to schedules and milestones, you slip a little. One feature doesn\u0027t get into update because it wasn\u0027t done in time. Then next time, you let the release date slip a little because you had another feature not done. Then next time, you just keep your delayed release schedule since people didn\u0027t get too upset last time, and besides, now you have more time to get more features done. So now you\u0027re developing three months of content in four months. Then you get a little lazy, maybe burned out on this project that you\u0027ve been dragging out for three years, and you slip another feature, and decide to hold the next update for that feature. Now you\u0027re on five month schedules for three months of content.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d say it\u0027s quite evident I\u0027m not beating on a strawman.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWe paid money to them. We are entitled to complain AS MUCH AS WE WANT, just as you are entitled to defend them as much as you want. And how does their wealth or former occupation make a lick of difference?\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022An_Adult\u0022 data-cite=\u0022An_Adult\u0022\u003E\u003Cdiv\u003ESquad: \u0022Luche, we\u0027re making a rocket game but need money. We\u0027re not entirely sure what direction it\u0027ll go and may not even finish it.\u0022\u003Cp\u003ELuche: \u0022I see.\u0022\u003C/p\u003E\u003Cp\u003ESquad: \u0022Here\u0027s our free demo of what we\u0027re working on.\u0022\u003C/p\u003E\u003Cp\u003ELuche: \u0022This is good stuff. I\u0027m enjoying it.\u0022\u003C/p\u003E\u003Cp\u003ESquad: \u0022Is $23 a price you\u0027d be willing to send our way to get the latest updates and get in on some bugtesting, if that\u0027s your thing?\u0022\u003C/p\u003E\u003Cp\u003ELuche: \u0022That sounds reasonable to me.\u0022\u003C/p\u003E\u003Cp\u003E*400 play-hours later*\u003C/p\u003E\u003Cp\u003ESquad: \u0022Hey Luche, we\u0027ve decided to scrap the rockets bit and make something more like Kerbal SimCity.\u0022\u003C/p\u003E\u003Cp\u003ELuche: \u0022Well, that\u0027s a bummer. Can I keep what I\u0027ve got from you up to this point?\u0022\u003C/p\u003E\u003Cp\u003ESquad: \u0022Yeah.\u0022\u003C/p\u003E\u003Cp\u003ELuche: \u0022Thanks. $23 for 400\u002B hours of fun and \u0027dammit-I-forgot-the-antenna-again\u0027 was a really great trade. Not to mention all the mods you worked hard to provide a framework for. Good luck on KSC. I\u0027ll check out the demo.\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I paid money. I\u0027m also an adult who paid attention to what Squad told me in the first place about themselves and the game. It makes my defense rational and contexually-aware and your whining...not. It also means Squad is much more likely to listen to me if I \u003Cem\u003Edid\u003C/em\u003E make a suggestion.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EJust because portal took two and a half years does not mean that it wasn\u0027t scheduled. It was. It was scheduled to release with the Orange Box, and that was their deadline. They made it. It was NOT a \u0027when-it\u0027s-done\u0027 game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd there\u0027s the fallacy. The two are not incompatible with each other (and generally don\u0027t have much to do with each other). \u0027When it\u0027s done\u0027 is not laziness. Valve gave themselves an extensive deadline for something they already had the base for. Why? So when it was done it was \u0027done.\u0027 A little puzzle game they could be proud of. And even if that were not true, Valve\u0027s track record shows that if Portal was not up to their snuff by the deadline, they would take some more time on it. And their buyers will give them consideration because they\u0027ve shown that quality is worth waiting for.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYes, but I (and Gordon Ramesey and Robert Irvine and pretty much any other successful chef) will be very, very angry if it spends thirty minutes being futzed over in the kitchen and arrives at the table without the sides that were promised on the menu.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I\u0027d ordered sides, yes. But I didn\u0027t, I ordered 0.13 and Squad\u0027s determination. Don\u0027t pretend you ordered anything more than that.\u003C/p\u003E\u003Cp\u003EBesides all of this, I will make a concession. There is one particular group of people for which deadlines are particularly necessary, regardless of the final quality. 3D modelers and animators. Why? Because they are most assuredly NOT lazy. They will work on and rebuild and work on the same scene or model forever and never think it\u0027s done. They\u0027re like an OCD trying to trim his sideburns evenly. Eventually, you need to stop him from shaving sidewalks into his temples.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-29T02:36:43Z\u0022 title=\u002212/29/2013 02:36  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 29, 2013\u003C/time\u003E by luchelibre\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-29T08:32:39Z","Content":"\n\u003Cp\u003EFor the last time, NO ONE is calling a \u0027when it\u0027s done\u0027 production schedule laziness. However the two do tend to go hand-in-hand, especially when you have no one to hold you accountable for a final product. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022luchelibre\u0022 data-cite=\u0022luchelibre\u0022\u003E\u003Cdiv\u003EAnd there\u0027s the fallacy. The two are not incompatible with each other (and generally don\u0027t have much to do with each other). \u0027When it\u0027s done\u0027 is not laziness. Valve gave themselves an extensive deadline for something they already had the base for. Why? So when it was done it was \u0027done.\u0027 A little puzzle game they could be proud of. And even if that were not true, Valve\u0027s track record shows that if Portal was not up to their snuff by the deadline, they would take some more time on it. And their buyers will give them consideration because they\u0027ve shown that quality is worth waiting for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGo to wikipedia, give me a link to the fallacy I\u0027m using, because I don\u0027t see it. \u003C/p\u003E\u003Cp\u003EAs for the rest of your... paragraph; Valve has a consistent track record of making excellent games. Squad does not. They have not released a single finished game. None of the developers, as far as I am aware, have released a single finished game. We have zero reason to trust anything but what we see right now. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022luchelibre\u0022 data-cite=\u0022luchelibre\u0022\u003E\u003Cdiv\u003EIf I\u0027d ordered sides, yes. But I didn\u0027t, I ordered 0.13 and Squad\u0027s determination. Don\u0027t pretend you ordered anything more than that.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s where the main divide is. There are some people who, justifiably, believe they bought .13 (or .15 or .18.1 or whichever) and the promise of future updates. There are others who, also quite justifiably, believe that they pre-ordered 1.0 with the bonus of an ongoing alpha to play. To the former group, anything else they get is gravy. To the latter, every update is a step closer to them getting the actual thing they paid for and were promised.\u003C/p\u003E\u003Cp\u003EThis discrepancy is impossible to reconcile without an official clarification from the developers, which we\u0027re never going to get. It\u0027s also a byproduct of this trend in the indie industry to completely fund their endeavor with early purchases. Like so many things in the games and tech world, this has completely blown past corporate and legal precedent. Until one of the companies actually gets a class-action, buyers will continue to have this argument over any game of this model whose devs haven\u0027t explicitly said one way or the other.\u003C/p\u003E\n"},{"CreatedByName":"Dante80","CreatedById":91509,"CreatedDateTime":"2013-12-29T11:08:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EThat\u0027s where the main divide is. There are some people who, justifiably, believe they bought .13 (or .15 or .18.1 or whichever) and the promise of future updates. There are others who, also quite justifiably, believe that they pre-ordered 1.0 with the bonus of an ongoing alpha to play. To the former group, anything else they get is gravy. To the latter, every update is a step closer to them getting the actual thing they paid for and were promised.\u003Cp\u003EThis discrepancy is impossible to reconcile without an official clarification from the developers, which we\u0027re never going to get. It\u0027s also a byproduct of this trend in the indie industry to completely fund their endeavor with early purchases. Like so many things in the games and tech world, this has completely blown past corporate and legal precedent. Until one of the companies actually gets a class-action, buyers will continue to have this argument over any game of this model whose devs haven\u0027t explicitly said one way or the other.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t really think there is a divide man, especially if you read what you signed up for. Its really an entitlement problem for some people, stemming from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/63525-How-much-work-of-squad-is-showed-in-updates?p=873773\u0026amp;viewfull=1#post873773\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETerms of service\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBy purchasing Kerbal Space Program, you are entitled to the following:\u003Cp\u003E\u0026lt;section id=\u0022main_body\u0022\u0026gt; \u003C/p\u003E\u003Cp\u003E - Access to the software in its current state.\u003C/p\u003E\u003Cp\u003E - Access to all updates for the software.\u003C/p\u003E\u003Cp\u003E By \u003Cem\u003E\u003Cstrong\u003E\u0027updates\u0027\u003C/strong\u003E\u003C/em\u003E we mean software updates including content, features and bugfixes, released as a new version for the same title, before or after the official (\u00221.0\u0022) release of the software. \u003C/p\u003E\u003Cp\u003E If you\u0027ve purchased KSP before May 1st, 2013, you are entitled to the above, plus any Expansion Packs released for KSP.\u003C/p\u003E\u003Cp\u003E By \u003Cem\u003E\u003Cstrong\u003E\u0027Expansion Packs\u0027\u003C/strong\u003E\u003C/em\u003E we mean software released as a separate title, but that requires and ties into the original KSP software to expand the game by adding content, features and bugfixes.\u003C/p\u003E\u003Cp\u003E Regardless of purchase date, your purchase of KSP does not entitle you to the following:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOther \u0022Kerbal\u0022 titles, such as sequels, prequels or any other works based on KSP or any subset of the KSP IP, even those that integrate with the original KSP (but do not require it). \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOther titles released by Squad. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOther goods and services offered as complements to any Squad title, such as Merchandise (t-shirts, mugs, mousepads, etc.), 3D printing, etc. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E Please keep in mind:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESquad is not under any obligation to release any updates, expansions or titles at any time. Each release may very well be the last one. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESquad is under no obligation to implement any given set of features prior to the final release for KSP or any future title. All posted lists of planned features are unofficial and do not imply a promise by Squad to deliver anything listed in them. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESquad reserves the right to add, remove and modify content on any of its software at their own discretion, without prior notice. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESquad is under no obligation to maintain any level of communication with the player community, choosing to do so at their own discretion. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe minimum hardware specifications are posted for reference purposes only. KSP is a work-in-progress, and as such, may not perform as expected under any given hardware configuration. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Software is made available as-is, and may contain bugs and/or manifest undesirable behaviour. Squad does not guarantee any level of stability or performance for the Software, and takes no responsibility in the event of data loss or damage ocurred as a direct or indirect result of using the software. Use at your own risk. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u0026lt;/section\u0026gt; \u003Cp\u003E\u003Cstrong\u003EEULA\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E5. NO WARRANTIES.\u003Cp\u003E Electro Chango S.A. de C.V. expressly disclaims any warranty for the SOFTWARE PRODUCT. The SOFTWARE PRODUCT is provided \u0027As Is\u0027 without any express or implied warranty of any kind, including but not limited to any warranties of merchantability, noninfringement, or fitness of a particular purpose. Electro Chango S.A. de C.V. does not warrant or assume responsibility for the accuracy or completeness of any information, text, graphics, links or other items contained within the SOFTWARE PRODUCT. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan it get more clear than that?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-29T11:33:16Z\u0022 title=\u002212/29/2013 11:33  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 29, 2013\u003C/time\u003E by Dante80\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2013-12-29T11:36:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat\u0027s where the main divide is. There are some people who, justifiably, believe they bought .13 (or .15 or .18.1 or whichever) and the promise of future updates. There are others who, also quite justifiably, believe that they pre-ordered 1.0 with the bonus of an ongoing alpha to play. To the former group, anything else they get is gravy. To the latter, every update is a step closer to them getting the actual thing they paid for and were promised.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you had taken the time to read the terms of service, and I quote Please keep in mind:\u003C/p\u003E\u003Cp\u003ESquad is not under any obligation to release any updates, expansions or titles at any time. Each release may very well be the last one.\u003C/p\u003E\u003Cp\u003ESquad is under no obligation to implement any given set of features prior to the final release for KSP or any future title. All posted lists of planned features are unofficial and do not imply a promise by Squad to deliver anything listed in them.\u003C/p\u003E\u003Cp\u003EYou didn\u0027t buy the full game. You bought the game as is, any further updates are technically a bonus. Please stop thinking that squad ows you 1.0\u003C/p\u003E\n"},{"CreatedByName":"Tuareg","CreatedById":84241,"CreatedDateTime":"2013-12-29T11:39:52Z","Content":"\n\u003Cp\u003Ei think they show all what they do. its not too much but that\u0027s it...\u003C/p\u003E\n"},{"CreatedByName":"TheGeoninja","CreatedById":92271,"CreatedDateTime":"2013-12-29T12:33:07Z","Content":"\n\u003Cp\u003EFrom my experience with coding which is not much but I still get somethings Squad releases somethings in the next update possible while other things they are slowly working on overtime and waiting to complete them. If I recall correctly they do have volcanoes working but they are implemented yet they tested them and they work quite well.\u003C/p\u003E\n"},{"CreatedByName":"luchelibre","CreatedById":61140,"CreatedDateTime":"2013-12-29T20:21:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EFor the last time, NO ONE is calling a \u0027when it\u0027s done\u0027 production schedule laziness. However the two do tend to go hand-in-hand, especially when you have no one to hold you accountable for a final product.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince you\u0027re just repeating yourself. I\u0027m moving on.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EGo to wikipedia, give me a link to the fallacy I\u0027m using, because I don\u0027t see it. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/I_Dont_Know_What_Im_Talking_About\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/I_Don\u0027t_Know_What_I\u0027m_Talking_About\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou\u0027re right, no where on that page does it say that\u0027s a fallacy. My bad.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs for the rest of your... paragraph; Valve has a consistent track record of making excellent games. Squad does not. They have not released a single finished game. None of the developers, as far as I am aware, have released a single finished game. We have zero reason to trust anything but what we see right now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll admitted and consented to when I bought the game.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThat\u0027s where the main divide is. There are others who, also quite justifiably, believe that they pre-ordered 1.0 with the bonus of an ongoing alpha to play. To the former group, anything else they get is gravy. To the latter, every update is a step closer to them getting the actual thing they paid for and were promised.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs the last few posts have shown, these people are either willfully ignorant or lied to Squad when they said they consented to their conditions. It makes me sad that Squad banning these people is considered wrong or unjust.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt\u0027s also a byproduct of this trend in the indie industry to completely fund their endeavor with early purchases. Like so many things in the games and tech world, this has completely blown past corporate and legal precedent. Until one of the companies actually gets a class-action, buyers will continue to have this argument over any game of this model whose \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Edevs haven\u0027t explicitly said one way or the other.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a good thing we\u0027re not in that situation then.\u003C/p\u003E\u003Cp\u003EI think I\u0027m done. I\u0027m getting smart-assy in response to your nonsense and it\u0027s making the XKCD comic not look so funny anymore.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-29T20:24:48Z\u0022 title=\u002212/29/2013 08:24  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 29, 2013\u003C/time\u003E by luchelibre\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-12-29T20:25:13Z","Content":"\n\u003Cp\u003EAnd this thread is done, criticism is fine until it turns into this, people just picking each other apart over any little thing.\u003C/p\u003E\u003Cp\u003ESee you in the next criticism thread, maybe \u003Cem\u003Ethat\u003C/em\u003E one will stay civil and on topic.\u003C/p\u003E\u003Cp\u003EClosing!\u003C/p\u003E\n"}]}