{"TopicId":58782,"ForumId":32,"TopicTitle":"Its time... for a KSP community alternative for fans by fans of KSP!","CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2014-01-03T21:32:04Z","PageNum":1,"Articles":[{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2014-01-03T21:32:04Z","Content":"\n\u003Cp\u003ESimCity has them, Civilization has them, and even Minecraft has them:\u003C/p\u003E\u003Cp\u003ECommunity developed portals.\u003C/p\u003E\u003Cp\u003EI think its time to discuss this. It\u0027s time to form a group, a team, to develop and maintain a KSP community alternative. Why?\u003C/p\u003E\u003Cp\u003E- The community needs a reliable Spaceport alternative. All of our eggs are in the Spaceport basket, and then scattered everywhere else. Its time for a reliable alternative/second central repository of craft files. Spaceport 2 will be fine and a godsend, but the community will still need an alternative for the unexpected.\u003C/p\u003E\u003Cp\u003E- The community needs a downtime forum, and a place to post opinions outside of this forum. (Not that this post in anyway implies a complaint or desire to split or call for an exodus of content from this awesome forum here and its most excellent moderation team.)\u003C/p\u003E\u003Cp\u003E- The community needs a place to explore different means of collaborating which can scale popular ideas quickly so that Squad doesn\u0027t have to devote valuable resources managing such ideas that may or may not be successful.\u003C/p\u003E\u003Cp\u003E- The community needs a dedicated multiplayer server system.\u003C/p\u003E\u003Cp\u003EIt\u0027s time to discuss your ideas and develop a plan for a KSP community alternative. This thread is NOT about leaving this community. This thread is about complementing it.\u003C/p\u003E\u003Cp\u003ESome questions to answer:\u003C/p\u003E\u003Cp\u003E-Do you think a community alternative is needed at this point?\u003C/p\u003E\u003Cp\u003E-What else do think the community needs in such a portal?\u003C/p\u003E\u003Cp\u003E-What shall we call it?\u003C/p\u003E\u003Cp\u003E-Should we keep it simple?\u003C/p\u003E\u003Cp\u003E-Who may be interested in helping to manage it or moderate it?\u003C/p\u003E\u003Cp\u003E-Who has resources they\u0027d be willing to donate to pull this off?\u003C/p\u003E\u003Cp\u003E-Who has the skills to make this happen?\u003C/p\u003E\u003Cp\u003E-What applications should we use?\u003C/p\u003E\u003Cp\u003ENow before anyone rushes off to snap up a domain or start programming a site to get started, lets talk ideas. Let\u0027s do this together. Your suggestions are most appreciated. What are your thought and answers to the questions above?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-05T01:22:44Z\u0022 title=\u002201/05/2014 01:22  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 5, 2014\u003C/time\u003E by inigma\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"zynar","CreatedById":74448,"CreatedDateTime":"2014-01-03T21:39:23Z","Content":"\n\u003Cp\u003ESome questions to answer:\u003C/p\u003E\u003Cp\u003E-Do you think a community alternative is needed at this point? Not Really\u003C/p\u003E\u003Cp\u003E The rest don\u0027t really apply . Sorry just my .02\u003C/p\u003E\u003Cp\u003EI think a better way to search for mods would be nice but mostly I want spaceport 2.\u003C/p\u003E\u003Cp\u003EA dedicated Multiplayer server sounds like a great idea.\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-01-03T21:40:01Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EDo you think a community alternative is needed at this point?\u003C/strong\u003E No.\u003C/p\u003E\u003Cp\u003EEDIT: I\u0027ll actually bother to explain why.\u003C/p\u003E\u003Cp\u003EFirst off, the KSP community is and always had been fairly exclusive and mature, due to the nature of the game. Theres no reason to create another one outside of Squad\u0027s jurisdiction no matter how much you want to childishly whine about resources.\u003C/p\u003E\u003Cp\u003ESpaceport works fine as is, combined with the forums. No reason to split up the things into separate groups unnecessarily.\u003C/p\u003E\u003Cp\u003EIDK what your even talking about with \u0022collaboration\u0022\u003C/p\u003E\u003Cp\u003EMultiplayer communities already exist around the few mods that allow it through things set up by them. When official multiplayer comes out, then maybe we can decide if a system is required. As is, we don\u0027t have any idea how it\u0027s going to work or if it will even be necessary.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-03T21:47:27Z\u0022 title=\u002201/03/2014 09:47  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 3, 2014\u003C/time\u003E by Xaiier\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jug head","CreatedById":84157,"CreatedDateTime":"2014-01-03T21:44:33Z","Content":"\n\u003Cp\u003EWe should have one in case of an emergency like what happened in April I don\u0027t mean the revert I mean the no forum weeks\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-01-03T21:45:40Z","Content":"\n\u003Cp\u003E\u0022The community needs a downtime forum, and a place to post opinions apart from Squad moderation.\u0022 Not sure I understand what you mean here. If you imply that the moderation team censors stuff going against squad, you\u0027re quite wrong.\u003C/p\u003E\n"},{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2014-01-03T21:47:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stupid_chris\u0022 data-cite=\u0022stupid_chris\u0022\u003E\u003Cdiv\u003E\u0022The community needs a downtime forum, and a place to post opinions apart from Squad moderation.\u0022 Not sure I understand what you mean here. If you imply that the moderation team censors stuff going against squad, you\u0027re quite wrong.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot all. Let\u0027s replace Squad with \u0022this forum\u0022. A place to express opinions outside of this forum.\u003C/p\u003E\u003Cp\u003E-Do you think a community alternative is needed at this point?\u003C/p\u003E\u003Cp\u003EYes.\u003C/p\u003E\u003Cp\u003E-What else do think the community needs in such a portal?\u003C/p\u003E\u003Cp\u003Ealready listed. focus on an alternate spaceport first.\u003C/p\u003E\u003Cp\u003E-Should we keep it simple?\u003C/p\u003E\u003Cp\u003EYES!\u003C/p\u003E\u003Cp\u003E-Who may be interested in managing it?\u003C/p\u003E\u003Cp\u003EI might be able to commit some initial startup time, but managing it might require someone more dedicated.\u003C/p\u003E\u003Cp\u003E-Who has resources they\u0027d be willing to donate to pull this off?\u003C/p\u003E\u003Cp\u003EI can donate the purchase of a domain and initial web hosting.\u003C/p\u003E\u003Cp\u003E-Who has the skills to make this happen?\u003C/p\u003E\u003Cp\u003EI know a fair bit of using Wordpress, php, and the basics of css, html, etc.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-03T23:57:30Z\u0022 title=\u002201/03/2014 11:57  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 3, 2014\u003C/time\u003E by sal_vager\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Masked Turk","CreatedById":76284,"CreatedDateTime":"2014-01-03T23:56:30Z","Content":"\n\u003Cp\u003EI don\u0027t think we *need* any of the things you mentioned, considering they\u0027re all provided for us and will be for the next few years.\u003C/p\u003E\n"},{"CreatedByName":"relin","CreatedById":89684,"CreatedDateTime":"2014-01-04T00:26:51Z","Content":"\n\u003Cp\u003EI still don\u0027t understand why you feel we need a second community apart from this one. Nor do I understand why you\u0027d want a second community when you also say you don\u0027t want anyone to leave this one. I\u0027ve never noticed any serious problems with downtime, nor is anything really wrong with Spaceport from what I\u0027ve experienced.\u003C/p\u003E\u003Cp\u003EAs far as multiplayer, I can only agree with what others have said: there already ARE multiplayer groups to be found here, and until stock multiplayer is patched in, I don\u0027t see how we could possibly do any better than what already exists.\u003C/p\u003E\n"},{"CreatedByName":"6.forty","CreatedById":97939,"CreatedDateTime":"2014-01-04T00:32:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022inigma\u0022 data-cite=\u0022inigma\u0022\u003E\u003Cdiv\u003EDo you think a community alternative is needed at this point?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. Community fragmentation would be inevitable. The only other KSP communities that would have a purpose and peaceful coexistence would be for individual mods of sufficient scale to warrant a its own community.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-01-04T00:37:46Z","Content":"\n\u003Cp\u003EI don\u0027t personally think that fragmenting the central KSP community is a particularly good idea. Splits have nearly happened in the past, but we\u0027ve stayed cohesive. Having a place for disenchanted users to gather in a sort of \u0022private club\u0022 would encourage such a near-split to genuinely happen. There\u0027s already a number of KSP-related forums out there on other sites for people to congregate around if they feel they need something different than the official forums. As for a repository outside of SpacePort, that\u0027s at the discretion of anyone who feels they want to shoulder the expense of a redundant service.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-01-04T02:04:33Z","Content":"\n\u003Cp\u003ENope. I don\u0027t think mods necessarily censor us. I see plenty of commentary that speaks out against the direction of the game that does not get censored. I kind of like the forums and their inclusive nature. Rules sometimes restrict, but they also protect. That\u0027s more important sometimes.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2014-01-04T02:17:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stupid_chris\u0022 data-cite=\u0022stupid_chris\u0022\u003E\u003Cdiv\u003ENot sure I understand what you mean here. If you imply that the moderation team censors stuff going against squad, you\u0027re quite wrong.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Elol, I have an inbox full of infractions for the most asinine things that suggests you just creatively interpret rules when you wish, and enforce some outrageously absurd ones.\u003C/p\u003E\u003Cp\u003EI can use the odd obscenity (which is censored anyway so I don\u0027t know why anyone cares) in any capacity on any forum, but on \u003Cem\u003Emultiple\u003C/em\u003E occasions, I had entire major posts entirely wiped out because I said \u0027ass\u0027 once in a thread critical of the devs. I think one was as innocuous as saying \u0027kick ass\u0027 and the entire wall-of-text post got nuked within a minute and deleted in its entirety. Note that \u0027ass\u0027 is not even auto-censored.\u003C/p\u003E\u003Cp\u003EI definitely have one or two in here that specifically refers to special rules protecting the devs. Furthermore, after criticizing decisions made by the developers, I have one in here that specifically refers to a specially moderated \u0022Curious George\u0022 usergroup because you accused me of being \u0022just a troll\u0022. Because you wouldn\u0027t want it to get out that anyone who disagrees with the direction this game is going gets handwaved off into your special censorship bin or anything.\u003C/p\u003E\u003Cp\u003EI ended up with a 10-point infraction for making a post that voiced support in an admittedly cheap fashion with a \u0027THIS ^\u0027 post... but it was the same 10 point infraction I got for referring to the developers a bunch of clowns - under the rule that I was \u0027harassing other users\u0027.\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t be surprised if this post gets nuked for an obscure rule regarding \u0027discussing moderator actions\u0027. Because that wouldn\u0027t be the definition of irony.\u003C/p\u003E\u003Cp\u003EI got a negative rep comment \u003Cstrong\u003Efrom a mod\u003C/strong\u003E for \u0027being argumentative\u0027. It\u0027s not that I care about rep, but \u003Cem\u003Eseriously?\u003C/em\u003E Because I don\u0027t agree with the circlejerk? I would downrep him with something sarcastic but I\u0027m 95% sure they would flood my inbox with obscure warnings again.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-04T02:28:39Z\u0022 title=\u002201/04/2014 02:28  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 4, 2014\u003C/time\u003E by Frostiken\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Masked Turk","CreatedById":76284,"CreatedDateTime":"2014-01-04T02:19:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003Elol, I have an inbox full of infractions for the most asinine things that suggests you just creatively interpret rules when you wish and enforce some outrageously absurd ones.\u003Cp\u003EI definitely have one or two in here that specifically refers to special rules protecting the devs.\u003C/p\u003E\u003Cp\u003ENot that the community here is much better. I got a negative rep comment for \u0027being argumentative\u0027. It\u0027s not that I care about rep, but \u003Cem\u003Eseriously?\u003C/em\u003E Because I don\u0027t agree with the circlejerk?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps you need to work on your diplomatic skills then, rather than suggest everyone jump ship with you.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2014-01-04T02:32:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Masked Turk\u0022 data-cite=\u0022Masked Turk\u0022\u003E\u003Cdiv\u003EPerhaps you need to work on your diplomatic skills then, rather than suggest everyone jump ship with you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy jump out of a perfectly good ship when it\u0027s the captain who\u0027s steering it into the icebergs? Squad has shown over the last few months that they don\u0027t care whatsoever what anyone thinks after they\u0027ve already got their money. Pretty sure \u0027resources\u0027 is still the #1 feature we\u0027re looking for, but it got backburnered twice and then completely canceled so they can spend the next 14 months putting in a useless multiplayer system to suck in new players to justify spending 14 months on a useless multiplayer system. Look at the drama and damage control Harvester had to do after telling everyone that the science system is going to stay dumbed-down and simple because it\u0027s for \u0027new players\u0027, despite the fact that \u0027old players\u0027 outnumber new players by probably 12:1.\u003C/p\u003E\u003Cp\u003EThe 180 the devs have done from their approach to the game a year and a half ago is tragic.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-04T02:34:12Z\u0022 title=\u002201/04/2014 02:34  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 4, 2014\u003C/time\u003E by Frostiken\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2014-01-04T02:33:52Z","Content":"\n\u003Cp\u003EInigma, listen. Until KSP has over 1 million players, this is good enough. Moderators listen, everyone is polite, and the Devs even put some time into here. We don\u0027t need a downtime forum, as for we have learnt about what was wrong, and fixed it. The forums have a craft area, and mod area. Thats our backup\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2014-01-04T02:36:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCanadianVendingMachine\u0022 data-cite=\u0022TheCanadianVendingMachine\u0022\u003E\u003Cdiv\u003EInigma, listen. Until KSP has over 1 million players, this is good enough. Moderators listen, everyone is polite, and the Devs even put some time into here. We don\u0027t need a downtime forum, as for we have learnt about what was wrong, and fixed it. The forums have a craft area, and mod area. Thats our backup\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf he\u0027s referring to a better mod resource, this isn\u0027t \u0027good enough\u0027. There\u0027s enough active mods at this point that mods that were updated yesterday can end up buried beneath page 4 within 24 hours. It\u0027s a pain to find out when mods are updated since half the developers don\u0027t bother to put the updated dates in the title.\u003C/p\u003E\u003Cp\u003EAnd those are only the big name mods. There\u0027s a TON of lower-key mods that deserve attention, but are buried beneath idiots spamming the B9 thread asking for updates thirty times a day.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-04T05:06:32Z\u0022 title=\u002201/04/2014 05:06  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 4, 2014\u003C/time\u003E by Frostiken\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-01-04T05:14:56Z","Content":"\n\u003Cp\u003ESimple. no.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-01-04T05:27:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EWhy jump out of a perfectly good ship when it\u0027s the captain who\u0027s steering it into the icebergs? Squad has shown over the last few months that they don\u0027t care whatsoever what anyone thinks after they\u0027ve already got their money. Pretty sure \u0027resources\u0027 is still the #1 feature we\u0027re looking for, but it got backburnered twice and then completely canceled so they can spend the next 14 months putting in a useless multiplayer system to suck in new players to justify spending 14 months on a useless multiplayer system. Look at the drama and damage control Harvester had to do after telling everyone that the science system is going to stay dumbed-down and simple because it\u0027s for \u0027new players\u0027, despite the fact that \u0027old players\u0027 outnumber new players by probably 12:1.\u003Cp\u003EThe 180 the devs have done from their approach to the game a year and a half ago is tragic.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I can see why you are getting moderated, Frostiken, and the reason is simple enough: you lack civility. You don\u0027t necessarily have to agree with what is being said, but if you must protest, it is advisable that you refrain from such churlish actions as finger-pointing, insulting, and otherwise flaming other users. A bit of discretion goes a long way when you want to be taken seriously.\u003C/p\u003E\n"},{"CreatedByName":"RSwordsman","CreatedById":78678,"CreatedDateTime":"2014-01-04T05:32:00Z","Content":"\n\u003Cp\u003EAs far as I\u0027ve seen, this forum is excellent for all things regarding the KSP player base. I can see third-party sites for modders or clans/companies where players organize construction and operations, but another forum that does everything this one does is silly.\u003C/p\u003E\n"},{"CreatedByName":"Aphox","CreatedById":32691,"CreatedDateTime":"2014-01-04T05:35:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EI got a negative rep comment \u003Cstrong\u003Efrom a mod\u003C/strong\u003E for \u0027being argumentative\u0027. It\u0027s not that I care about rep, but \u003Cem\u003Eseriously?\u003C/em\u003E Because I don\u0027t agree with the circlejerk? I would downrep him with something sarcastic but I\u0027m 95% sure they would flood my inbox with obscure warnings again.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was going to address this sooner, but the forums kind of exploded, so I\u0027ll address it now. I\u0027m not comfortable with the zealousness of some of the moderators, and we do try to avoid these situations as often as possible. As much as I hate to use the cliche \u0022we\u0027re human\u0022 excuse, we \u003Cem\u003Edo\u003C/em\u003E make mistakes quite often and we can\u0027t do everything perfectly all the time and have eyes on every thread. The reason some of our methods may seem ridiculous is due to trying to maintain continuity and consistency in our actions.\u003C/p\u003E\u003Cp\u003EThat said, I\u0027m addressing this publicly so that the thread stays going in the right direction. Let\u0027s keep this thread away from this subject, as the OP has already stated that his topics were not targeted at the moderation team. If you have complaints, there\u0027s a sub-forum to post them in and staff members who are more than willing to talk it out in a respectful and civil manner. I\u0027m online often and am always on IRC if anyone needs to talk about issues they may be having.\u003C/p\u003E\u003Cp\u003ESo please, have at the discussion in OP, but keep it that, and not a staff-bashing moshpit.\u003C/p\u003E\u003Cp\u003EEdit: My feelings on these subjects are pretty much reflected in this thread. Fragmenting the community is a bad idea. I think it\u0027s ironic that the forums went down while I was typing it out, but today\u0027s forum explosion was not on Squad\u0027s end as far as we can tell.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-04T05:45:09Z\u0022 title=\u002201/04/2014 05:45  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 4, 2014\u003C/time\u003E by Aphox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-01-04T05:51:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022inigma\u0022 data-cite=\u0022inigma\u0022\u003E\u003Cdiv\u003EDo you think a community alternative is needed at this point?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. These forums are pretty good, aside from some of the afore-mentioned dumb moderation, which is still mostly bearable (my favorite is when some mod claims \u0022we have it good here\u0022 when every mod everywhere claims the same \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E). Anyway, about the only real problem we\u0027ve got is some issues with information being released elsewhere and some user having to bring it to these \u003Cem\u003Eofficial\u003C/em\u003E forums instead of SQUAD just releasing it here first.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2014-01-04T06:00:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xaiier\u0022 data-cite=\u0022Xaiier\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EDo you think a community alternative is needed at this point?\u003C/strong\u003E No.\u003Cp\u003EEDIT: I\u0027ll actually bother to explain why.\u003C/p\u003E\u003Cp\u003EFirst off, the KSP community is and always had been fairly exclusive and mature, due to the nature of the game. Theres no reason to create another one outside of Squad\u0027s jurisdiction no matter how much you want to childishly whine about resources.\u003C/p\u003E\u003Cp\u003ESpaceport works fine as is, combined with the forums. No reason to split up the things into separate groups unnecessarily.\u003C/p\u003E\u003Cp\u003EIDK what your even talking about with \u0022collaboration\u0022\u003C/p\u003E\u003Cp\u003EMultiplayer communities already exist around the few mods that allow it through things set up by them. When official multiplayer comes out, then maybe we can decide if a system is required. As is, we don\u0027t have any idea how it\u0027s going to work or if it will even be necessary.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow can you even say that spaceport works fine?? Have you ever tried the search function?? Even if you know what you are looking for it will give a bunch of random craft files or mods that are not even remotely related to the one you are searching for. This is the case even with the popular mods.\u003C/p\u003E\u003Cp\u003EMight as well just use google then like I have to do now.\u003C/p\u003E\u003Cp\u003EEven squad themselves is unhappy with spaceport and call it a mess. I really hope they get a replacement soon as it has been taking way too long already.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2014-01-04T06:01:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Masked Turk\u0022 data-cite=\u0022Masked Turk\u0022\u003E\u003Cdiv\u003EI don\u0027t think we *need* any of the things you mentioned, considering they\u0027re all provided for us and will be for the next few years.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENew spaceport is needed now and has been for quite some time. A new spaceport being few years away just does not cut it.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-01-04T06:24:49Z","Content":"\n\u003Cp\u003EThere\u0027s a \u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram\u0022 rel=\u0022external nofollow\u0022\u003EKerbal subreddit \u003C/a\u003Ewhich is pretty active. I don\u0027t like the format, but I sometimes poke around there.\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-01-04T07:16:50Z","Content":"\n\u003Cp\u003EI am pretty new here so my opinion may or may not matter but I don\u0027t really see the need for an alternative forum. I wouldn\u0027t be opposed to one that would only be used in the case that this one goes down but not a permanent parallel community. I agree with others it would only cause division. The subreddit is probably the closest thing needed and could get out any information or links that would need to spread (see next statement)... It\u0027d be nice to have a centralized backup of all the maintained / up to date mods out there but I feel like if something did happen that caused Spaceport to be unusable, a new server run by users would spring up pretty quickly. \u003C/p\u003E\u003Cp\u003EIn other words I think if there\u0027s a problem it will take care of itself when it becomes necessary and I haven\u0027t personally seen problems here with unreasonable censorship and such that would make people feel the need to go anywhere else. It\u0027s nice having everything right here.\u003C/p\u003E\n"}]}