{"TopicId":58920,"ForumId":32,"TopicTitle":"I am stuck in a rut.","CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2014-01-05T06:35:26Z","PageNum":3,"Articles":[{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-01-05T19:03:16Z","Content":"\n\u003Cp\u003EBreak the sound barrer.\u003C/p\u003E\u003Cp\u003EWith a \u003Cstrong\u003Eboat\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-01-05T19:06:34Z","Content":"\n\u003Cp\u003EI think it\u0027s time for the maximalist to become a minimalist. If you can build such amazing beasts of rockets, it should be amusing to see what you can do with as few parts as possible. I don\u0027t just mean tiny ships, I mean ships that barely have anything on them at all.\u003C/p\u003E\n"},{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2014-01-05T19:34:37Z","Content":"\n\u003Cp\u003ESometimes I get KSP Burnout. Taking a break for a week or so usually fixes it.\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-01-05T19:52:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EI got no energy to build anything big.\u003Cp\u003EI\u0027m out of ideas. Giant transplanetary ships? Check. Giant stations? Done. Huge rover? Rrrrodger.\u003C/p\u003E\u003Cp\u003EWhat left is there? I could theoretically build a giant SSTO rover-lander-transplanetary ship-kethane refueler, but so what?\u003C/p\u003E\u003Cp\u003ENothing grabs me anymore. I am officially out of ideas. I got nothin\u0027. I got whack-block.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat happened to the Whacksphere?\u003C/p\u003E\u003Cp\u003ETake it places and roll around with it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-01-05T19:52:20Z","Content":"\n\u003Cp\u003EI\u0027m kind of having a burnout myself. Bad part is I\u0027ve only been to two other planets and haven\u0027t even come back from them. I\u0027m almost done with my interplanetary ship that should be capable of return (and rescue) but when I start up the game I feel like I\u0027m stuck. \u003C/p\u003E\u003Cp\u003EI think if I try a new and different design or unlock a new tech tree node I\u0027ll feel better. I\u0027d really like to build an ssto or even a working plane that looks better than the ones I have. Other than that I\u0027ve been alternating between KSP and Deus Ex: Human Revolution.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-01-05T19:53:12Z","Content":"\n\u003Cp\u003EBuild a ring orange tanks that completely surround Kerbin\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-01-05T19:56:42Z","Content":"\n\u003Cp\u003EAs another player who likes building ridiculous craft, maybe some of my builds might inspire you. In some ways we\u0027ve got very similar playstyles in that we both play stock and have masses of patience for laggy spacecraft and slow launches, but most of the stuff we end up building looks very different. \u003C/p\u003E\u003Cp\u003EHave you actually visited all the planets? Most of what I\u0027ve seen you build mostly just ends up in LKO or on the Mun, but there\u0027s a lot of challenges to be made further out in the solar system, especially if you add extra restrictions. I\u0027ve built a few random monsters that just get into orbit, but ultimately I like my spacecraft to offer a purpose to the kerbals, as if they had a real space-program.\u003C/p\u003E\u003Cp\u003EThis was the rocket I built for an Apollo style mission to Tylo. 2 man lander, no asparagus and no Nerva engines increased the challenge quite a bit. It was inspired by the \u0022doing it apollo style\u0022 challenge..... but I figured the mun would be too easy, so I chose Tylo as a more difficult mun substitute.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tkoEH2o.png\u0022 alt=\u0022tkoEH2o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEve requires a hell of a spacecraft if you want to do it \u0022properly\u0022 as well. Most people skip a lot of the challenge using multiple launches, external seats and landing on a mountain or using wheels to drive up one. Using a capsule and landing at sea-level is much harder, and took me quite a few fails before I managed to do it successfully. This was barely enough for a 1-man capsule. I can\u0027t imagine how big a rocket you\u0027d need if you wanted to return the 3 man capsule from sea-level.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QnfHV8F.png\u0022 alt=\u0022QnfHV8F.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Dep3mAW.png\u0022 alt=\u0022Dep3mAW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wm1u3EW.png\u0022 alt=\u0022wm1u3EW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBuild a big spaceplane? or long range SSTO? I\u0027ve never seen you really do much in the SPH or using airbreathing engines. Both of them add quite a bit of challenge. This was inspired by the Ventura star. That was supposed to be a 1000 ton VTHL spaceplane powered by aerospikes. We know it\u0027s possible to build realistic weighing rockets, so I figured it might be possible to do the same with spaceplanes. Turns out it was. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XZPXeN5.png\u0022 alt=\u0022XZPXeN5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sVsNdwG.png\u0022 alt=\u0022sVsNdwG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FV57j46.png\u0022 alt=\u0022FV57j46.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis one was 2000 tons and was very efficient at killing 12 kerbals at a time. Theoretically it was landable, it was tested rolling along the runway at over 100m/s but I never got it into orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/clclNkn.png\u0022 alt=\u0022clclNkn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy most recent build was this thing. I\u0027ve built spaceplanes that get to Duna and back..... a VTOL was much harder. There have been various proposals in the past for a spacecraft roughly the shape of an artillery shell, such as the project orion craft, the Rotary rockets thing, and the Chrystler SERV. This was my attempt.\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t look like much from the outside, but it\u0027s got 44 engines underneath and comes to nearly 800 parts. Stuff like this offers a different challenge to your usual builds as most of it\u0027s workings are hidden from sight. I don\u0027t use the cheat menu, but there\u0027s still a lot of part clipping inside this thing, to get all the ugly stuff hidden from view. That in itself offers a big challenge, learning which parts can clip together without causing problems.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GzlKbLE.png\u0022 alt=\u0022GzlKbLE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6GWgzR6.png\u0022 alt=\u00226GWgzR6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/h6abxrh.png\u0022 alt=\u0022h6abxrh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI hope my builds offer you some inspiration. I\u0027m sure there\u0027s loads of stuff you haven\u0027t tried and it would be a shame for the community to lose such a valuable contributor.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2014-01-05T21:07:10Z","Content":"\n\u003Cp\u003EI suppose I could do an apollo style Whack sized rocket. I\u0027d have to throw on engineer to make sure the TWR is as it should be per stage...\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-01-05T21:13:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EI suppose I could do an apollo style Whack sized rocket. I\u0027d have to throw on engineer to make sure the TWR is as it should be per stage...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETypollo. Do everything Apollo did but do it on a mission to Tylo.\u003C/p\u003E\n"},{"CreatedByName":"spudcosmic","CreatedById":64598,"CreatedDateTime":"2014-01-05T21:13:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E#EDIT: Apparently FAR makes rockets \u0022four times easier to get into orbit\u0022. That\u0027s a big no-no for me.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHa, anything you build will be 20 times harder to get into orbit with FAR. Far just makes streamline realistic rockets have about 1000 m/s less Dv to get to orbit, that\u0027s far from four times easier.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2014-01-05T21:17:24Z","Content":"\n\u003Cp\u003EWhat\u0027s the record on number of stages done with Kerpollo style staging? Ten? Fifteen? Without cheesing on a tiny final payload?\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-01-05T22:33:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003ETypollo. Do everything Apollo did but do it on a mission to Tylo.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlternis Typollo.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-05T22:41:19Z","Content":"\n\u003Cp\u003EYes, Whack, try playing with Alternis. You think you have seen KSP and that completely throws you for a loop. Fair to note that Tylo in Alternis qualifies as a level of hell to land on.\u003C/p\u003E\u003Cp\u003EThe other suggestion I can give is to go grab some mindless shooter game, blow some noobs\u0027 freaking heads off for a while, and then come back where you can re-appreciate the skill and intelligence KSP demands.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2014-01-05T22:48:05Z","Content":"\n\u003Cp\u003EWelcome to the club.. This is why I had looked so much forward to resources and career mode. \u003C/p\u003E\u003Cp\u003EEven though I feel like I have done everything it would be fun then to do build for example bases and rovers that have a real purpose.\u003C/p\u003E\u003Cp\u003EI have tried taking long breaks and have pretty much not played it at all in last versions and yet still feel burned out when it comes to KSP.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2014-01-05T22:50:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tygoo7\u0022 data-cite=\u0022tygoo7\u0022\u003E\u003Cdiv\u003ESame here FenrirWolf. I usually just stop playing until I get into that new ksp feel. Where I am just playing for hours and hours a day. BTW I am in that mood now. Wackjob I agree that taking a break and doing something else for a while fixes it. We all lose that interest at some point but KSP isn\u0027t going anywhere. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat worked for me back a few versions ago but these days it just does not help.. You can only visit a place so many times before it gets boring when the game is no longer a challenge. First it worked to build bigger and bigger stations/bases/ships but thanks to part limit/performance I have hit a wall there as well...\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2014-01-05T23:06:08Z","Content":"\n\u003Cp\u003EWell you could always add \u0022TAC Life Support\u0022 as that just adds parts to help take care of the new needs of Kerbals needing air to breath and water and food to eat as well as dealing with their wastes. Other then what has been mentioned. Taking a brake and coming back after they have a few updates might be a good idea. To bad there is not a mod that adds another solar system.\u003C/p\u003E\n"},{"CreatedByName":"Jr6150x","CreatedById":61112,"CreatedDateTime":"2014-01-05T23:10:35Z","Content":"\n\u003Cp\u003EI think you should try something new, something different, that you haven\u0027t done at all or much. Maybe a kerbin exploration thing to explore the anomilies.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-05T23:16:33Z","Content":"\n\u003Cp\u003EJust thought of another idea, but for Whackjob, this may be asking too much.\u003C/p\u003E\u003Cp\u003ETry building small. Build just what is required for a mission, nothing more. No overzealous giant builds and no lag. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe previous post said try something new. For you, this would be new. Suddenly you have to build within the restraints the rest of us mere mortals, not KSP gods, have to work with.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2014-01-06T00:11:18Z","Content":"\n\u003Cp\u003ELooking at your quote haha. The ol\u0027 fireclaw. Horrid looking design, yet quite functional. I recall I fell far short of where I wanted to land... directly on top of the VAB.\u003C/p\u003E\n"},{"CreatedByName":"likke_A_boss","CreatedById":94697,"CreatedDateTime":"2014-01-06T00:19:31Z","Content":"\n\u003Cp\u003EYou know, after all of your absurdly large ships, you should try building small. Not like normal person small, I mean like using only 1/2 meter probe parts (you\u0027ll need some part mods) only. That would be epic.\u003C/p\u003E\n"},{"CreatedByName":"KittyProgram","CreatedById":96920,"CreatedDateTime":"2014-01-06T00:26:34Z","Content":"\n\u003Cp\u003EHave kerbal do a EVA.\u003C/p\u003E\u003Cp\u003EHeres the catch: EVA it to Minmus.\u003C/p\u003E\n"},{"CreatedByName":"AllenM3","CreatedById":61933,"CreatedDateTime":"2014-01-06T00:33:19Z","Content":"\n\u003Cp\u003EI too have felt this way. But after spending my free time watching youtube with people with huge long missions. I have gotten back into it with installing FAR, deadly re-entry, and remote tech. This alone make the game much more challenging and Makes the simplest thing like going to the moon and back require much more planning. I think eventually I will use interstellar mod.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-01-06T00:57:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EI currently have one mod: Kethane. That\u0027s it. I refuse to add the mods that add bigger tanks and engines.\u003Cp\u003ENot familiar with FAR and real solar system. I\u0027ll look into those maybe.\u003C/p\u003E\u003Cp\u003E#EDIT: Apparently FAR makes rockets \u0022four times easier to get into orbit\u0022. That\u0027s a big no-no for me.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFAR more impedes achieving orbit by requiring craft to withstand tremendous aerodynamic forces during their gravity turns and be so built as to minimize atmospheric drag than it eases achieving orbit by preventing drag from acting where it should not.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E#EDIT2: Real solar system has a bug where \u0022parts are wobbly\u0022 and the recommended fix is \u0022get the joint reinforcement mod\u0022. Another big no-no for me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you want more realistically simulated joints, then use the Joint Reinforcement mod because it gives joints realistic strength.\u003C/p\u003E\u003Cp\u003E@Whackjob\u003C/p\u003E\u003Cp\u003EYour creative block may result from an unconscious conflict; e.g., too much ignored stress.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-06T02:31:03Z\u0022 title=\u002201/06/2014 02:31  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 6, 2014\u003C/time\u003E by Duxwing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2014-01-06T00:58:11Z","Content":"\n\u003Cp\u003EI\u0027ve taken a bit of time out from building replicas to play my own, challenging version of career mode.\u003C/p\u003E\u003Cp\u003EMake a mod install of KSP and install these mods...\u003C/p\u003E\u003Cp\u003EMission Controller\u003C/p\u003E\u003Cp\u003EBootstraps mission pack\u003C/p\u003E\u003Cp\u003Eremotetech 2\u003C/p\u003E\u003Cp\u003ETAC life support\u003C/p\u003E\u003Cp\u003EKOS\u003C/p\u003E\u003Cp\u003EVet tech\u003C/p\u003E\u003Cp\u003E... and you\u0027ll have a very challenging career mode / strategy campaign with both research and budget. You really have to design craft for efficiency... totally different game.\u003C/p\u003E\u003Cp\u003EFor added fun add these mods....\u003C/p\u003E\u003Cp\u003EAtmospheric sound\u003C/p\u003E\u003Cp\u003EChatterer\u003C/p\u003E\u003Cp\u003ESteam gauges (flying from the cockpit is another great challenge)\u003C/p\u003E\u003Cp\u003ERomfarer Docking cam\u003C/p\u003E\u003Cp\u003EPlanet factory\u003C/p\u003E\n"},{"CreatedByName":"Jon Tash","CreatedById":2681,"CreatedDateTime":"2014-01-06T01:36:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mulbin\u0022 data-cite=\u0022Mulbin\u0022\u003E\u003Cdiv\u003EI\u0027ve taken a bit of time out from building replicas to play my own, challenging version of career mode.\u003Cp\u003EMake a mod install of KSP and install these mods...\u003C/p\u003E\u003Cp\u003EMission Controller\u003C/p\u003E\u003Cp\u003EBootstraps mission pack\u003C/p\u003E\u003Cp\u003Eremotetech 2\u003C/p\u003E\u003Cp\u003ETAC life support\u003C/p\u003E\u003Cp\u003EKOS\u003C/p\u003E\u003Cp\u003EVet tech\u003C/p\u003E\u003Cp\u003E... and you\u0027ll have a very challenging career mode / strategy campaign with both research and budget. You really have to design craft for efficiency... totally different game.\u003C/p\u003E\u003Cp\u003EFor added fun add these mods....\u003C/p\u003E\u003Cp\u003EAtmospheric sound\u003C/p\u003E\u003Cp\u003EChatterer\u003C/p\u003E\u003Cp\u003ESteam gauges (flying from the cockpit is another great challenge)\u003C/p\u003E\u003Cp\u003ERomfarer Docking cam\u003C/p\u003E\u003Cp\u003EPlanet factory\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did something like that in the previous update, it was really fun but was done in a week (I usually play 6hours a day, every day). Now i\u0027m feeling the same way as Whackjob. I\u0027m playing less and less.\u003C/p\u003E\n"}]}