{"TopicId":59113,"ForumId":32,"TopicTitle":"My illustrated career mode trip to Duna in 0.23 (picture heavy)","CreatedByName":"running","CreatedById":82033,"CreatedDateTime":"2014-01-06T22:16:18Z","PageNum":1,"Articles":[{"CreatedByName":"running","CreatedById":82033,"CreatedDateTime":"2014-01-06T22:16:18Z","Content":"\n\u003Cp\u003EOk so I\u0027ve build a base on Duna before. But this time I\u0027m doing career mode and I want my manned mission to Duna to be a succesfull round trip making use of the science lab.\u003C/p\u003E\u003Cp\u003E(All stock parts, only \u0022cheat\u0022i\u0027ve used is F9 and tat was only a few times for the Duna landing and the few times I sped up time to fast and missed burn points)\u003C/p\u003E\u003Cp\u003ESo first step is to bring a ton of fuel in orbit around Duna and do some science on the way over.:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-ash4/1502702_341151609357070_2146803653_o.jpg\u0022 alt=\u00221502702_341151609357070_2146803653_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext step is to launch a second ton of fuel and hook up the 2 in orbit around Duna so it starts to look like a space station.\u003C/p\u003E\u003Cp\u003EFollowed by a rocket that brings over the science lab (no crew on board):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-frc3/1502702_341151606023737_907215619_o.jpg\u0022 alt=\u00221502702_341151606023737_907215619_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo the science lab is docked to the station. (but without a crew it doesn\u0027t add much yet.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-frc3/1502702_341151602690404_1130606711_o.jpg\u0022 alt=\u00221502702_341151602690404_1130606711_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow the tugboat part that brought the lab to Duna is in the way for the lander to attach to later on, so I undocket it from the lander, rotated the space station 180 degrees and docked it again. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-c-a.akamaihd.net/hphotos-ak-prn2/1502702_341151599357071_706115423_o.jpg\u0022 alt=\u00221502702_341151599357071_706115423_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt this point the space station is filled to the brink with fuel and everything is set for the crew to arrive:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-e-a.akamaihd.net/hphotos-ak-ash3/1502702_341151612690403_613477895_o.jpg\u0022 alt=\u00221502702_341151612690403_613477895_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOf course we do a little flyby of Ike first:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-prn2/1498013_341152209357010_1140431411_o.jpg\u0022 alt=\u00221498013_341152209357010_1140431411_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand after a bit of rotating the lander with crew fits on top of the science lab:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-prn2/1498013_341152206023677_531997090_o.jpg\u0022 alt=\u00221498013_341152206023677_531997090_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow I sent over the 2 scientists while Jeb stayed behind to fly the lander and they start to work on the science already gathered.\u003C/p\u003E\u003Cp\u003ESome experiments are cleaned so we are ready for our trip to Duna itself.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-h-a.akamaihd.net/hphotos-ak-prn2/1498013_341152202690344_377267943_o.jpg\u0022 alt=\u00221498013_341152202690344_377267943_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanding it safely was a bit of a pain as I tried to conserve fuel to much but in the end we got there:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-ash4/1498013_341152212690343_370090214_o.jpg\u0022 alt=\u00221498013_341152212690343_370090214_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo after some succesfull science it was back to the space station. I forgot to undock the empty science lab before liftoff, so I undocked it during takeoff. It crashed to the ground leaving not a single piece of debris...like I planned it like that.\u003C/p\u003E\u003Cp\u003EArriving at the space station I had to loose some parts of the lander to be able to dock.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-ash4/1498013_341152216023676_1580129782_o.jpg\u0022 alt=\u00221498013_341152216023676_1580129782_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter refueling, I undocked the lander and undocked the tugboat that brought over the science lab. I connected the two vessels within 100 meters of the space station and left for Kerbin:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-prn1/841084_341153129356918_2009636704_o.jpg\u0022 alt=\u0022841084_341153129356918_2009636704_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn it\u0027s way back I ditched the lander nukes as they where no longer needed.\u003C/p\u003E\u003Cp\u003EI parked the tugboat in orbit around Kerbin so it could be refueled and reused in a future missions.\u003C/p\u003E\u003Cp\u003EI deorbitted the lander and sent it for a nice dip in the Kerbin oceans:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-ash3/841084_341153126023585_613505380_o.jpg\u0022 alt=\u0022841084_341153126023585_613505380_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBringing back material bay and goo samples from high sun orbit, low Ike orbit, while flyig over Duna and Duna surface among other instruments and ground samples.\u003C/p\u003E\u003Cp\u003EIn total I got way over 3000 science points out of this. (could be more I didn\u0027t keep track of it that well.)\u003C/p\u003E\u003Cp\u003EIt\u0027s interesting how you really feel like comming home from a long trip to a far away place when you arrive back at Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"BlackBicycle","CreatedById":29657,"CreatedDateTime":"2014-01-06T22:27:05Z","Content":"\n\u003Cp\u003EBeen there.... And don\u0027t call this \u0022career\u0022, will you? You have all the stuff unlocked, so this is barely the career...\u003C/p\u003E\u003Cp\u003EBut your signature kicks ass!! : ) On behalf of my wife and me - thanks for a good laugh : )\u003C/p\u003E\n"},{"CreatedByName":"running","CreatedById":82033,"CreatedDateTime":"2014-01-06T22:41:49Z","Content":"\n\u003Cp\u003EWell actually, I haven\u0027t unlocked everything yet, but yes I got the nukes, the main sails and the orange fuel tanks.\u003C/p\u003E\u003Cp\u003ESo I\u0027m still playing career and science still matters to me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}