{"TopicId":59972,"ForumId":32,"TopicTitle":"Seen KSP music outside KSP? Look here!","CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-01-14T19:40:41Z","PageNum":1,"Articles":[{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-01-14T19:40:41Z","Content":"\n\u003Cp\u003EI\u0027ve seen too many threads with: OMG KSP music is being used elsewhere!\u003C/p\u003E\u003Cp\u003EIt is royalty-free music. Anyone can use it. Few of the music in the game is actually KSP music as such.\u003C/p\u003E\u003Cp\u003E(Sorry for a short post)\u003C/p\u003E\n"},{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2014-01-14T19:50:17Z","Content":"\n\u003Cp\u003EHilariously, this is a thread about KSP music complaining about the threads talking about KSP music.\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2014-01-14T20:13:43Z","Content":"\n\u003Cp\u003EThis post can be found multiple times on each thread that complains that the music used in KSP can be found elsewhere. It is therefore almost as pointless to complain about the threads that are complaining as it is to complain about the music.\u003C/p\u003E\u003Cp\u003EStill, it\u0027s nice to know some people are aware that barely anything in KSP actually made and owned by Squad, or anyone for that matter.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-01-14T22:12:59Z","Content":"\n\u003Cp\u003EYo dawg, I heard you like KSP music, so I made a thread about KSP music, complaining about KSP music. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-01-14T22:26:50Z","Content":"\n\u003Cp\u003EEpthelyn, you are wrong on so many counts right there. The KSP theme? Written by Harvester. KSP\u0027s game engine? A completely overhauled and re-written version of unity, twisted to suit Squad\u0027s needs, by Squad. The current parts? Mostly made by Squad. Just because Squad use royalty free music, does not mean they almost don\u0027t own anything in their game. Please do your research first before claiming that Squad don\u0027t own most of their own game.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-01-15T01:20:10Z","Content":"\n\u003Cp\u003EIsn\u0027t the music by Kevin Macleod? Almost every famous YouTubers has used his music at least once.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2014-01-15T01:22:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathsoul097\u0022 data-cite=\u0022Deathsoul097\u0022\u003E\u003Cdiv\u003EA completely overhauled and re-written version of unity, twisted to suit Squad\u0027s needs, by Squad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnity cannot be \u0022overhauled and re-written\u0022 - it is not an open source engine. It can be added on top of, and limitations can be worked around, but it\u0027s not an engine you can get into and meld to your liking.\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-01-15T01:47:17Z","Content":"\n\u003Cp\u003EMy bad, I\u0027m sure I remember HarvestR saying something along those lines, so I must have just misheard it.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-01-15T16:52:50Z","Content":"\n\u003Cp\u003EI myself have used KSP music in my projects. It\u0060s royalty free. Incompetech is great.\u003C/p\u003E\n"}]}