{"TopicId":60622,"ForumId":32,"TopicTitle":"Too good for its own good...","CreatedByName":"davieholgate","CreatedById":78564,"CreatedDateTime":"2014-01-21T16:29:30Z","PageNum":1,"Articles":[{"CreatedByName":"davieholgate","CreatedById":78564,"CreatedDateTime":"2014-01-21T16:29:30Z","Content":"\n\u003Cp\u003EOk guys, I made what I call a \u0027Universal Launcher\u0027, it is designed to be able to launch all manners of spacecraft... and I have just realised that it has basically killed my launch hype, as i:\u003C/p\u003E\u003Cp\u003E1: know it always works (100% Success Rate)\u003C/p\u003E\u003Cp\u003E2: Carries heavy loads with ease *Disclaimer: I don\u0027t take any responsibility if your Station Core blows up attached to our hardware*\u003C/p\u003E\u003Cp\u003E3: Long distance (To Eeloo... but ive not tried to get back yet...)\u003C/p\u003E\u003Cp\u003EAnyone else have any certain craft(s) which became a victim of its own success (like the NASA Shuttle Program or my rocket)?\u003C/p\u003E\u003Cp\u003EP.S. If you have steam, there will be screenshots of my rocket (and other designs).... it looks like a Delta IV - Heavy.\u003C/p\u003E\u003Cp\u003ESTEAMID: davieholgate\u003C/p\u003E\n"},{"CreatedByName":"Klingon Admiral","CreatedById":69090,"CreatedDateTime":"2014-01-21T16:39:33Z","Content":"\n\u003Cp\u003EThe Shuttle became a victim of everybody wanting to add their little or not so little feature to it.\u003C/p\u003E\u003Cp\u003ENow, on topic: Not really, I\u0027m more the guy who builds a new lifter for every launch and/or craft (if this particular craft is to be used multiple times).\u003C/p\u003E\u003Cp\u003EAnd you can easily show you Steam screenshots here.\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-01-21T16:43:23Z","Content":"\n\u003Cp\u003ESort of. I built an asparagus based heavy lifter (70t) that works well. But after 0.23 came out, I also built a medium lifter using turbojets \u0026amp; RAPIER engines (30t). That one requires a bit of \u0022piloting\u0022 - opening and closing different sets of intakes (action groups), turning off or throttling engines, and when to switch to closed cycle. So that one keeps me on my toes.\u003C/p\u003E\u003Cp\u003EOtherwise, the main challenge has been orbital assembly and doing complicated (for me) interplanetary missions.\u003C/p\u003E\n"},{"CreatedByName":"Demon_82","CreatedById":81626,"CreatedDateTime":"2014-01-21T16:51:55Z","Content":"\n\u003Cp\u003ESince subassembiles came, I have 5 launchers. Sparagus style, for Kerbin\u0027s SOI purposes, a light, a medium and a heavy launchers, for different weights, and for any place other than Kerbin\u0027s SOI, a heavy LR launcher, altought for light payloads I use sometimes the previous launchers. Also I have a single three stages \u0022vertical\u0022 launcher (without side boosters) that does a nice job depending on the weight, it can deliver a two stage lander to MÃƒÂ¼n and Minmus, and lighter things to other planets. And before subassemblies, I tried to reuse as much as possible the same basic 4 sparagus designs xD\u003C/p\u003E\n"},{"CreatedByName":"Sabreur","CreatedById":93165,"CreatedDateTime":"2014-01-21T18:39:54Z","Content":"\n\u003Cp\u003EI\u0027ve been trying to design my launchers for efficiency, so I haven\u0027t had quite the same problem. It really \u003Cem\u003Ebugs\u003C/em\u003E me when a rocket makes it to orbit with plenty of fuel remaining - that means I could have lifted the same payload with a much smaller rocket! As a result, I have several \u0022perfect\u0022 launchers that I\u0027ve only used a couple times because I figured out a more efficient design later. Right now I\u0027m experimenting with replacing large single engines with clusters of aerospike engines, and my next plan is to experiment with reusable rockets that parachute down safely after their stage is spent.\u003C/p\u003E\u003Cp\u003EIt\u0027s basically pointless right now, but I\u0027m betting it will all pay off once we have to worry about a budget!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-21T18:51:43Z\u0022 title=\u002201/21/2014 06:51  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 21, 2014\u003C/time\u003E by Sabreur\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-21T21:40:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sabreur\u0022 data-cite=\u0022Sabreur\u0022\u003E\u003Cdiv\u003EI\u0027ve been trying to design my launchers for efficiency, so I haven\u0027t had quite the same problem. It really \u003Cem\u003Ebugs\u003C/em\u003E me when a rocket makes it to orbit with plenty of fuel remaining - that means I could have lifted the same payload with a much smaller rocket! As a result, I have several \u0022perfect\u0022 launchers that I\u0027ve only used a couple times because I figured out a more efficient design later. Right now I\u0027m experimenting with replacing large single engines with clusters of aerospike engines, and my next plan is to experiment with reusable rockets that parachute down safely after their stage is spent.\u003Cp\u003EIt\u0027s basically pointless right now, but I\u0027m betting it will all pay off once we have to worry about a budget!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m like you. I cluster my engines, and I try to avoid overkill rockets (though my overkill threshold is higher than it should be; I still end with too much juice in my upper stage). I\u0027ve used perfect rockets before. my old asparagus design could reliably get 50 tons to Duna (and probably back). It does kill some of the fun. Then again, the designs I\u0027ve been doing lately mean that failure cannot be tested for prior to mission start.\u003C/p\u003E\n"},{"CreatedByName":"RickRastardly","CreatedById":78405,"CreatedDateTime":"2014-01-21T21:47:17Z","Content":"\n\u003Cp\u003EI rarely reuse a launch platform, the exception was when I have different modules for the same mission to get into LKO.\u003C/p\u003E\n"},{"CreatedByName":"yaur","CreatedById":97407,"CreatedDateTime":"2014-01-21T21:57:48Z","Content":"\n\u003Cp\u003ETry Mission Control Extended, where you need to budget your launch cost to the reward and not just throw delta v at the problem. I still have some platform reuse, but much less than when one heavy lifter could do just about anything.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-01-21T22:02:11Z","Content":"\n\u003Cp\u003EI use ye olde 7 mainsail asparagus system for launches and I get more creative for smaller launchers, like a 4 stage with the first 3 being all SRBs.\u003C/p\u003E\n"},{"CreatedByName":"SuperBigD60","CreatedById":76047,"CreatedDateTime":"2014-01-21T22:18:29Z","Content":"\n\u003Cp\u003EI tend to reuse a good spaceplane every now and again.\u003C/p\u003E\u003Cp\u003EThough to get those to get to orbit properly, it takes probably 20-30 minutes of careful attention, so often I just resort to a simple generic asparagus stage that gets the job done.\u003C/p\u003E\u003Cp\u003EIt is super nice to be able to land your launcher back on the runway at KSC, though.\u003C/p\u003E\u003Cp\u003E(Note, \u0022runway\u0022 might be a little optamistic, I guess...)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/THQc3Osl.png?1\u0022 alt=\u0022THQc3Osl.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: I guess that\u0027s actually my shuttle, but whatevs\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-21T23:03:49Z\u0022 title=\u002201/21/2014 11:03  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 21, 2014\u003C/time\u003E by SuperBigD60\u003C/strong\u003E\n\u003C/span\u003E\n"}]}