{"TopicId":61593,"ForumId":32,"TopicTitle":"High over sun should give a lot less science","CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2014-01-30T14:13:50Z","PageNum":1,"Articles":[{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2014-01-30T14:13:50Z","Content":"\n\u003Cp\u003EFYI, the first manned round trip going to \u0022high over sun\u0022 yield you ~1000 science while a round trip to the moons\u0027 surface only gives you ~400 \u003C/p\u003E\u003Cp\u003E(not counting the high over mun/minus and close to mun/minmus science values; just the science on the ground)\u003C/p\u003E\u003Cp\u003Eif you realize going to high over sun and return is actually a lot easier than going to either of Kerbin\u0027s moons, high over sun should give a lot less science\u003C/p\u003E\u003Cp\u003Eanyone agree with me?\u003C/p\u003E\u003Cp\u003Eto go high over sun, \u003C/p\u003E\u003Cp\u003Eyou just fire towards your zenith untill you escape,\u003C/p\u003E\u003Cp\u003Eto return, you just set kerbin as target and fire towards it.\u003C/p\u003E\u003Cp\u003E(tho it\u0027s not the most efficient way to return, it shouldnt waste you a lot of fuel anyways because of the fact that you are just barely out of kerbin\u0027s SOI)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T14:17:04Z\u0022 title=\u002201/30/2014 02:17  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by lammatt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"edwinahe","CreatedById":3198,"CreatedDateTime":"2014-01-30T15:04:34Z","Content":"\n\u003Cp\u003EOnly doing EVA reports, over all of Muns biomes yields 360 science. And you can do that without unlocking any tech nodes. Same mission can get you EVA reports for all Kerbin and Minmus biomes and some crew reports, or approximately 880 science. \u003C/p\u003E\u003Cp\u003EIf you want something really big, take a look at Gravioli detector. It works for each biome, both in high and low orbit. That means that simple mission to orbit Kerbin, Mun and Minmus (polar orbits), will get you 360 for Kerbin, 2400 for Mun and 1440 for Minmus, 4400 science. \u003C/p\u003E\u003Cp\u003EAs a matter of fact, one can almost finish the tech tree (perhaps even finish it completely) and never set foot on Mun, only landings on Minmus are required.\u003C/p\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2014-01-30T15:08:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022edwinahe\u0022 data-cite=\u0022edwinahe\u0022\u003E\u003Cdiv\u003EOnly doing EVA reports, over all of Muns biomes yields 360 science. And you can do that without unlocking any tech nodes. Same mission can get you EVA reports for all Kerbin and Minmus biomes and some crew reports, or approximately 880 science. \u003Cp\u003EIf you want something really big, take a look at Gravioli detector. It works for each biome, both in high and low orbit. That means that simple mission to orbit Kerbin, Mun and Minmus (polar orbits), will get you 360 for Kerbin, 2400 for Mun and 1440 for Minmus, 4400 science. \u003C/p\u003E\u003Cp\u003EAs a matter of fact, one can almost finish the tech tree (perhaps even finish it completely) and never set foot on Mun, only landings on Minmus are required.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E apparently,\u003C/p\u003E\u003Cp\u003Eyou havent read what i posted...\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-01-30T15:34:48Z","Content":"\n\u003Cp\u003EThe thing is, the sun mission can be flown only once, while Mun landings can be done 15 times. And to get the full science value, you need to have completed most of the tech tree already. You\u0027re not getting 1000 science in a starter craft that flung itself out there to collect a crew report and EVA report.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-01-30T15:53:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lammatt\u0022 data-cite=\u0022lammatt\u0022\u003E\u003Cdiv\u003Eapparently,\u003Cp\u003Eyou havent read what i posted...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess what he wanted to say was, that it is again much easier fly around the moons and back to Kerbin etc. pp.\u003C/p\u003E\u003Cp\u003EEVAs differing by biome always annoyed me - crew reports maybe, for taking different readings/pictures from the capsule ... but hovering over a planet should give only a token reward for high and low orbit.\u003C/p\u003E\u003Cp\u003ESame for the Gravioli, I get it for low orbit, different gravity influence over mountains than over oceans ... but high over a planet there shouldnt be much new to learn.\u003C/p\u003E\u003Cp\u003EOne day I will simply built my own science.cfg.thingy.dat ... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T15:56:05Z\u0022 title=\u002201/30/2014 03:56  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by KerbMav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"darkmuminek","CreatedById":79107,"CreatedDateTime":"2014-01-30T16:01:46Z","Content":"\n\u003Cp\u003EIf it bothers you I think it is possible to edit some game files and set the amount of science you get from various activities. Not 100% sure about it though.\u003C/p\u003E\u003Cp\u003EAlso, if you don\u0027t like how the science system works you can:\u003C/p\u003E\u003Cp\u003E1. Get \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67167-0-23-Science-Redefined-v1-0\u0022 rel=\u0022external nofollow\u0022\u003EScience Redefined Mod\u003C/a\u003E. It changes some things about science, however I haven\u0027t tested it.\u003C/p\u003E\u003Cp\u003E2. Play the game as you want. When I get my first orbit around Kerbin I don\u0027t go anywhere else, even though i could easily go to Mun. Then I fly a few more missions to Kerbin orbit and only after that I go to Mun or Minmus. I never make science runs around the whole Kerbol System because it just kills the joy of unlocking next nodes in the tech tree and testing the new stuff.\u003C/p\u003E\u003Cp\u003EThat said, although going into high orbit around the sun gives you 1000 science and it is possible to do it in early stages of carreer mode, you don\u0027t have to do it.\u003C/p\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-01-30T16:11:45Z","Content":"\n\u003Cp\u003EScience is still in development, the recent update to the game added biomes on the moons of Kerbin and tweaked the transmission, not touching anything otuside the sphere of influence of Kerbin. IÃ‚Â´m sure the next update will take care of science outside Kerbins SOI.\u003C/p\u003E\n"},{"CreatedByName":"edwinahe","CreatedById":3198,"CreatedDateTime":"2014-01-30T18:01:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lammatt\u0022 data-cite=\u0022lammatt\u0022\u003E\u003Cdiv\u003Eapparently,\u003Cp\u003Eyou havent read what i posted...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did. And just pointing out that before getting this, even before unlocking anything, you can get same 1k science (bit less), by doing simple orbiting mission, with slight modification, same mission can bring couple soil samples from Minmus and ramp up the science even higher. All of that without any nodes unlocked.\u003C/p\u003E\n"}]}