{"TopicId":62971,"ForumId":32,"TopicTitle":"Best way to refuel a station on Kerblin orbit?","CreatedByName":"SpaceChief","CreatedById":103302,"CreatedDateTime":"2014-02-12T13:29:56Z","PageNum":1,"Articles":[{"CreatedByName":"SpaceChief","CreatedById":103302,"CreatedDateTime":"2014-02-12T13:29:56Z","Content":"\n\u003Cp\u003EHello fellow Kerbals! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I\u0027ve started using mods to spice up the game and I\u0027ve quickly come to a question I\u0027ve been unable to answer myself... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat is the quickest way I can refuel my station in orbit around Kerblin? I\u0027ve been successful in getting small amounts of fuel and parts off the ground and to the station (parts as in a space dock that allows me to launch from space being I have sufficient resources) but have been unable to do much more. My best was about 5% of my fuel capacity and even less for parts in one launch. It seems like it wouldn\u0027t be worth the time to try and keep the station refueled. \u003C/p\u003E\u003Cp\u003EI\u0027ve heard from somewhere that using a space plane rather than a rocket can be more useful but I haven\u0027t been able to figure it out albeit I haven\u0027t spent much time on the subject... \u003C/p\u003E\u003Cp\u003EAlso I\u0027ve installed Kethane and was wondering if it would suit me better to just mine from Mun and ship it to the station after its been refined on base? \u003C/p\u003E\u003Cp\u003EThank you everyone! \u003C/p\u003E\u003Cp\u003E(Sorry if I\u0027ve double posted somehow, I posted one similar to this earlier but was unable to find it in the Threads... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"Karretch","CreatedById":102077,"CreatedDateTime":"2014-02-12T19:13:12Z","Content":"\n\u003Cp\u003EWhile I\u0027m no expert and actually quite new to playing, I\u0027ve seen people play and one person used asparagussed orange tanks. I can\u0027t recall his end payload, but it didn\u0027t take long to fill it up. If you can\u0027t figure it out, all I can say is his quote \u0022add more stupid.\u0022 Essentially, don\u0027t try for super efficiency.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2014-02-12T19:30:47Z","Content":"\n\u003Cp\u003EThe trick to bringing up any quantity of fuel is to treat that quantity of fuel as locked cargo - don\u0027t ever use it. If your lower stages aren\u0027t up to the task of delivering the cargo without using the fuel in the cargo, then re-design the lower stage(s) to be more capable.\u003C/p\u003E\n"},{"CreatedByName":"Greenspan","CreatedById":101644,"CreatedDateTime":"2014-02-12T19:33:43Z","Content":"\n\u003Cp\u003ESpace plane will technically be more efficent, but a lot harder to build and since fuel doesn\u0027t cost anything it\u0027s usually best to go with just building a big launcher. Watch one of the Youtube tutorials on Asparagus staging that will give you the best bang for your buck in getting large payloads to orbit. My standard refuel launcher gets 5 Orange to orbit, I\u0027m sure there are others who have done better. \u003C/p\u003E\u003Cp\u003EHow good are you at rendezvous and docking? Something to keep in mind when launching large payloads of fuel, they can be a pain to dock.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-02-12T19:37:01Z","Content":"\n\u003Cp\u003EI usually send up a fuel slug (most of the time a single orange tank with maybe some RCS) attached to a robotic tug that I can deorbit later. The drone \u002B orange tank \u002B various other things doesn\u0027t come to more than about 50~60 tons, including maneuvering fuel, which is perfectly doable on stock Kerbin (and even using RSS). For most LKO operations you really only need about 500~600m/s for rendezvous and later deorbit, so plan your robotic tug accordingly.\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2014-02-12T19:39:54Z","Content":"\n\u003Cp\u003EIf you can get a kethane refinery up to the Mun or Minmus, that would be the cheapest way to do it in the long run. In that case, it\u0027s best to aerobrake back down to Low Kerbal Orbit, so you don\u0027t waste as much fuel, as you would with a standard Hohmann transfer.\u003C/p\u003E\u003Cp\u003EI use this method, along with bringing up fuel from Kerbin in my Duna mission: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65256-Duna-Explorer-slightly-overkill\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/65256-Duna-Explorer-slightly-overkill\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-02-13T00:12:16Z","Content":"\n\u003Cp\u003EThe key to good rocket efficiency is how you build in stages. If you are trying to build a rocket that goes from ground to docked without jettisoning fuel tanks and/or engines you\u0027ll almost certainly never get much payload ratio (how much payload is lifted per tonne of fuel/engines for launch). With proper parallel or even stack (classic) staging you should be able to get at least 10% however. \u0027Asparagus\u0027 (only known by that name in KSP, not the real world) staging is the ultimate in fuel efficiency but expensive in engines and leads to pig-ugly designs (wide pancakes) sometimes. Using asparagus it is quite normal to get 15% and possible to get 20% payload ratio.\u003C/p\u003E\u003Cp\u003ETemstar\u0027s explanation of how and why he built his \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/33381-0-20-2-Zenith-rocket-family-(modernised-for-0-20-x-with-perfect-subassembly)\u0022 rel=\u0022external nofollow\u0022\u003EZenith rocket family\u003C/a\u003E is one of the best places to start in designing your own rockets, once you understand the basics of staging and using fuel lines. Just downloading his .craft files and looking at how they\u0027re built may well give you a better understanding of those basics.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-13T00:14:26Z\u0022 title=\u002202/13/2014 12:14  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 13, 2014\u003C/time\u003E by Pecan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Villageidiot","CreatedById":102292,"CreatedDateTime":"2014-02-13T01:06:59Z","Content":"\n\u003Cp\u003ESince you are using Kethane I would recommend that route. Build a lander with the 8k kethane storage tank, a heavy refinery, and two nuclear engines. Drop it down to minmus mine kethane to fuel the boat, then liftoff and go back to kerbin. Going to Minmus is almost the same DV as it is to get to Mun. You want the refinery WITH the boat so you can fuel it up after you land so you aren\u0027t lifting off and using your payload to refuel your boat.\u003C/p\u003E\u003Cp\u003EThe craft is typically a rather TALL behemoth but it is efficient and with that 8K tank you can get a good amt of fuel off the surface. \u003C/p\u003E\u003Cp\u003EVI\u003C/p\u003E\n"},{"CreatedByName":"RSwordsman","CreatedById":78678,"CreatedDateTime":"2014-02-13T01:09:59Z","Content":"\n\u003Cp\u003ESSTO spaceplane. It might not bring a lot of resources per flight, but including the imaginary costs of disposable stages, it\u0027s by far the best in terms of materials per Kerbal dollar.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2014-02-13T02:00:45Z","Content":"\n\u003Cp\u003EThis is the best way to do it.\u003C/p\u003E\u003Cp\u003EJust need to use some control parts to make it easier to control or just use it as a station core.\u003C/p\u003E\u003Cp\u003EStuff like this will be nerfed a bit once money comes around.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/yYD91TrPYaM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-02-13T02:57:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceChief\u0022 data-cite=\u0022SpaceChief\u0022\u003E\u003Cdiv\u003EWhat is the quickest way I can refuel my station in orbit around Kerblin? I\u0027ve been successful in getting small amounts of fuel and parts off the ground and to the station (parts as in a space dock that allows me to launch from space being I have sufficient resources) but have been unable to do much more. My best was about 5% of my fuel capacity and even less for parts in one launch. It seems like it wouldn\u0027t be worth the time to try and keep the station refueled. \u003Cp\u003EI\u0027ve heard from somewhere that using a space plane rather than a rocket can be more useful but I haven\u0027t been able to figure it out albeit I haven\u0027t spent much time on the subject... \u003C/p\u003E\u003Cp\u003EAlso I\u0027ve installed Kethane and was wondering if it would suit me better to just mine from Mun and ship it to the station after its been refined on base?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe quickest way to refuel anything anyplace within the Kerbin system is to send up a rocket tanker from the ground on Kerbin because:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ESpaceplanes can\u0027t carry anywhere near the payload anywhere near as easily as rockets, and;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKethane only becomes useful at other planets; it\u0027s a total waste of time, energy, and money between Kerbin-Mun-Minmus.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo, the answer to your question boils down simply to how to get a full orange tank from the ground on KSC to your station in LKO. Actually, you need to move a bit more than that because the tank needs to rendezvous and dock with the station. Thus, you need a probe core and power on the tank to control it, a small engine to do the rendezvous burns, RCS thrusters and fuel to do the docking, and SAS unit to keep this all stable, and of course a docking port.\u003C/p\u003E\u003Cp\u003EThis is not really much of a challenge. Here\u0027s an example of how I do this, with some extra docking ports, lights, and a big load of RCS fuel thrown in:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7295/12327023983_33094afab1_b.jpg\u0022 alt=\u002212327023983_33094afab1_b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is actually a bit of overkill for getting a full orange tank to LKO; it can actually take it pretty much anywhere in the Kerbin system. It\u0027s 4x double stacks of orange tanks on Skippers with asparagus staging. The core is the payload orange tank on top and the 2-high gray tank EDIT: (and a pancake) underneath, on a Mainsail.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-13T03:04:02Z\u0022 title=\u002202/13/2014 03:04  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 13, 2014\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2014-02-13T03:11:44Z","Content":"\n\u003Cp\u003Ehm... \u003C/p\u003E\u003Cp\u003Eproper way - fly a ship to it and alt click?\u003C/p\u003E\u003Cp\u003Efastest way - open quicksave and edit\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-02-13T03:18:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EThe quickest way to refuel anything anyplace within the Kerbin system is to send up a rocket tanker from the ground on Kerbin because:\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ESpaceplanes can\u0027t carry anywhere near the payload anywhere near as easily as rockets, and;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKethane only becomes useful at other planets; it\u0027s a total waste of time, energy, and money between Kerbin-Mun-Minmus.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually started mining for kethane at Minmus, because launching the fuel from Kerbin was so slow and tedious. Launching the tanker, waiting for a transfer window, making the rendezvous, docking, and getting rid of orbital debris takes a lot of real time, especially if you have to repeat it four times to fully refuel an interplanetary ship. It can easily be faster to move the ship to orbit Minmus and do the refueling there.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2014-02-13T03:36:03Z","Content":"\n\u003Cp\u003EAs many people have pointed out already, you just need to build bigger rockets, and treat the fuel as cargo, rather than fuel.\u003C/p\u003E\u003Cp\u003EI previously had a design that got 3 orange tanks worth of fuel into LKO. 1 Orange tank was the fuel for interplanetary transfers (plus whatever else was needed from the cargo!)\u003C/p\u003E\u003Cp\u003EI\u0027ve refined my design to be 1 tank for interplanetary destinations, with a spare (empty) tank for space stations, since I started using Kethane.\u003C/p\u003E\u003Cp\u003EThe biggest load I have ever achieved was 5 tanks, although the engineering starts getting hard with that. I\u0027ve heard of people putting 10 orange tanks into orbit, routinely. I\u0027m sure Whackjob could put about 20 up.\u003C/p\u003E\u003Cp\u003ELaunching 1 orange tank is not difficult engineering wise, just plenty of fuel with mainsails to boost it up there. To get 1 orange tank into orbit, you\u0027ll likely need 6 or 7 more orange tanks of fuel.\u003C/p\u003E\n"}]}