{"TopicId":63463,"ForumId":32,"TopicTitle":"Rediscovering Electric Propulsion","CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2014-02-17T05:46:19Z","PageNum":1,"Articles":[{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2014-02-17T05:46:19Z","Content":"\n\u003Cp\u003EI\u0027ve toyed with the idea of building ion-powered spacecraft before, but I never really bothered with them because of the low TWRs and the need to wait for my batteries to recharge between burns. But today, I finally built and launched an ion-powered Jool probe (see below) because of a window that coincidentally opened up right after an Eve mission. Flying it is actually more engrossing than I had thought it would be, and designing it forced me to do things a bit differently. Anyways, what I\u0027m wondering is:\u003C/p\u003E\u003Cp\u003Ea) Do many people bother with ion-powered spacecraft? Feel free to comment on your own experience/experiments with them.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Of those who do, does anyone have any tips for building bigger ones (for manned interplanetary missions)?\u003C/p\u003E\u003Cp\u003EAnd, of course, a pic of the ship in question as it\u0027s leaving Kerbin (the Jool rendezvous burn is ongoing):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/c4b99xX.png\u0022 alt=\u0022c4b99xX.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-02-17T06:12:42Z","Content":"\n\u003Cp\u003EI don\u0027t use a lot of Ion propelled craft (At least, not in stock form. I increase the thrust, but reduce the ISP of the engines to make them more fuel inefficient), but the handful of small probes I\u0027ve set up to encounter planets while I eat lunch have done the job needed.\u003C/p\u003E\u003Cp\u003EHonestly, I prefer the Probodobodyne Ant Engine. 1.5 units of thrust doesn\u0027t sound like much, but if you couple it with a few other engines to get it to space, it\u0027s sufficient as a last-gasp engine for your probes to send them hurtling into the black.\u003C/p\u003E\u003Cp\u003EThat Rockomax small red radial engine is a lot of fun for cruising around in small vehicles, too.\u003C/p\u003E\u003Cp\u003EAs for Ion engines, I\u0027ve found their best purpose is as a downforce engine on my rovers to keep them on the surface of low gravity moons. Yes, they\u0027re obnoxious for power consumption, but they make up for it with stupidly low fuel usage.\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-02-17T07:10:27Z","Content":"\n\u003Cp\u003EAnd you\u0027ve got 8 junior labs going on there because ????\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-17T07:41:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpacedCowboy\u0022 data-cite=\u0022SpacedCowboy\u0022\u003E\u003Cdiv\u003EAnd you\u0027ve got 8 junior labs going on there because ????\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NGTOne\u0022 data-cite=\u0022NGTOne\u0022\u003E\u003Cdiv\u003E(the Jool rendezvous burn is ongoing):\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause he will need them. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhenever I experiment with the ion drive, I end up with something very timeconsuming and therefore (for me) unsatisfying.\u003C/p\u003E\u003Cp\u003EI once managed to burn a \u0022sail ship\u0022 (for the big solar panels) to Mun and even establish orbit, but ... nah ...\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-17T10:09:25Z","Content":"\n\u003Cp\u003E@OP: I really like the adapter you got going at the end there. What is is built of? It\u0027s difficult to see but it seems like there\u0027s 16 engines on there. The top part is an upside down Rockomax quad adapter, but how are the engines affixed to it? Also, how heavy is that craft compared to the 8 kN of thrust it\u0027s getting? The engines alone are 4 tons, and all those RTGs can\u0027t be lightweight either.\u003C/p\u003E\u003Cp\u003EAs far as electric propulsion goes, some mods can give you a lot of extra options. RLA has some half-size radial attached ion thrusters, and a 1.25m part that combines 4 regular ion thrusters. Both of these exactly maintain the TWR and other stats of the stock ion thruster, if you\u0027re concerned about balance. Next to that, it also brings arcjets and resistojets, which are almost exact ion thruster clones except that they trade thrust potential for Isp (1kN/2100 and 2kN/1050 respectively). They too come in radial and quadmount variants. The only downside is that they don\u0027t get those fancy HotRockets effects without manually extending the configs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you feel more adventurous, you can try the Near Future Propulsion pack. It adds many different electric engine systems, most of which are quite honestly overpowered compared to stock. But even if you don\u0027t want these, there\u0027s parts in there which can greatly enhance your stock ion thruster experience, such as a large selection of multiadapters specifically for small engines (there\u0027s a 2.5m --\u0026gt; 8x 0.625m \u002B 1x 1.25m one there, so with RLA\u0027s quad thruster you could fit 12 ions on a regular 2.5m part without having to resort to exotic part clipping). There\u0027s also a trio of lower profile inline battery parts that let you get large amounts of EC into a craft wthout having to stack huge battery towers (and yes, they maintain the stock \u0022weight per EC\u0022). This is especially great for probes which you want to keep small, but still able to operate power-draining equipment (and the electric propulsion to some degree) while they\u0027re in the shadow of whatever they\u0027re orbiting. Also, bigger solar panels beyond the size of the Gigantor, and onboard nuclear reactors for power production as an alternative to spamming RTGs everywhere.\u003C/p\u003E\u003Cp\u003EI\u0027ve actually been building a lot of unmanned probes with the help of the two above mods (and a generous helping of the nerfbat in case of Near Future, courtesy of ModuleManager). Kerbin and both its moons have electrically powered mapping/prospecting satellites in orbit, a fourth one is on its way to Moho ahead of future manned missions, and the other planets and moons will get their own when the transfer windows roll around. And I\u0027m planning a kethane ferry for shipping between a mine on Minmus and a processing station in Kerbin orbit that will likely be using one or two VASIMR plasma drives configured to very high specific impulses. After all, fuel efficiency is important on ferries that transfer something meant to be processed into fuel, so it makes sense to go electric here. Also, pushing the empty ferry out to Minmus should not require much thrust, and escaping back to Kerbin with a full load and aerobraking avoids overly long burns on the return too.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-17T10:11:37Z\u0022 title=\u002202/17/2014 10:11  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 17, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2014-02-17T11:08:55Z","Content":"\n\u003Cp\u003EIndeed, that is a nice ship there! As soon as I unlock the rtg\u0027s in my career mission I think I\u0027ll try something similiar. I\u0027m still messing around with ion powered transfer stages - I\u0027m about to use four ion engines to get my crewman back from Duna, and I agree, I think it\u0027ll be engrossing.\u003C/p\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2014-02-17T11:49:53Z","Content":"\n\u003Cp\u003Ehere is my mid-mission Ion probe, Yutu I.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/gallery/XXTqt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gallery/XXTqt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2014-02-17T12:43:00Z","Content":"\n\u003Cp\u003Ehas anyone ever been out to eeloo from LKO to LEO only on Ions?\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-17T12:59:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZodiaK\u0022 data-cite=\u0022ZodiaK\u0022\u003E\u003Cdiv\u003Ehas anyone ever been out to eeloo from LKO to LEO only on Ions?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, and I have no inclination to do so any time soon! That short trip to the Mun was enough ... my only other try to go interplanetary used normal engines to escape and had to wait over a Kerbin year for an opportunity for a low dV-return on the opposite side of Kerbol.\u003C/p\u003E\u003Cp\u003E(Although now that you placed that inception into my mind again, I will surely try again and bite my desk half way through my escape burn at Kerbin ...)\u003C/p\u003E\u003Cp\u003EThe secret has to be to built as light as possible?\u003C/p\u003E\n"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2014-02-17T13:24:21Z","Content":"\n\u003Cp\u003Emmh. I agree. my Yutu mission\u0027s ap is at desired height, now trying to circularise.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-17T13:42:18Z","Content":"\n\u003Cp\u003EI would summarize the secrets with:\u003C/p\u003E\u003Cp\u003E- minimalism in construction; it doesn\u0027t need to be pretty, it needs to be functional and light\u003C/p\u003E\u003Cp\u003E--- don\u0027t overfuel, calculate your dV and only bring what you need; that Isp isn\u0027t just for show\u003C/p\u003E\u003Cp\u003E- solar panels for missions to Dres and below; use as small panels as possible in large amounts, only go larger if you run out of attachment space\u003C/p\u003E\u003Cp\u003E--- RTGs for Jool and Eloo\u003C/p\u003E\u003Cp\u003E- electric buffer storage is lightweight and can allow longer burns even if your power income is below the draw of the thruster(s)\u003C/p\u003E\u003Cp\u003E--- everytime you use a girder, you could be using a battery bank instead, which weighs less and gives you buffer\u003C/p\u003E\u003Cp\u003E- escape burn in 8-10 min bursts around your periapsis, do other missions while it loops back around; keeps burntime boredom down and exploits Oberth effect\u003C/p\u003E\u003Cp\u003E--- have a good eye when to start capture burns (usually well outside of SoI)\u003C/p\u003E\u003Cp\u003E--- bring a good book \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-02-17T13:52:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZodiaK\u0022 data-cite=\u0022ZodiaK\u0022\u003E\u003Cdiv\u003Ehas anyone ever been out to eeloo from LKO to LEO only on Ions?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith the current time warp, waiting for the craft to coast to Eeloo is kinda pushing it. Does anyone know of a mod that allows higher time warp?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-17T14:22:35Z","Content":"\n\u003Cp\u003EI want to like ion engines, I really do. The high Isp is awesome, as is the challenge of designing ships with enough electrical power to run them.\u003C/p\u003E\u003Cp\u003EBut I just can\u0027t take the ridiculously long burn times for any sort of useful payload. I have a job, a wife, kids, social life, etc so my time to play KSP is finite. A multi-hour ion burn, even with time compression, is not a good use of that time. I\u0027d rather be designing/building something, or warping to the next maneuver node, or landing, or anything more interesting.\u003C/p\u003E\u003Cp\u003EIf we had enough time compression to bring the burns down to 5 mins or so of real time, then I would probably use them more.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-17T14:29:40Z","Content":"\n\u003Cp\u003ELook at RLA then for a balanced alternative (see post #5). Try the arcjet at 1 kN thrust, 2100 Isp. Half the burn time, you just need to bring a little more fuel. But Xenon is so light that it barely adds anything to the craft\u0027s weight.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-17T15:15:50Z\u0022 title=\u002202/17/2014 03:15  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 17, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aphox","CreatedById":32691,"CreatedDateTime":"2014-02-17T14:56:46Z","Content":"\n\u003Cp\u003EMornin\u0027, folks. I\u0027ve cleaned up the thread a bit, so don\u0027t mind the missing posts. Let\u0027s keep in cool in here and stay on-topic. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2014-02-17T15:02:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E@OP: I really like the adapter you got going at the end there. What is is built of? It\u0027s difficult to see but it seems like there\u0027s 16 engines on there. The top part is an upside down Rockomax quad adapter, but how are the engines affixed to it? Also, how heavy is that craft compared to the 8 kN of thrust it\u0027s getting? The engines alone are 4 tons, and all those RTGs can\u0027t be lightweight either.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u0022adapter\u0022 is just a Rockomax short adapter with some Clamp-o-tron Jr. docking ports surface-attached to it at 8x symmetry (there are, in fact, 16 of them), with the engines attached to those. I could probably have crammed in another 8, but I knew this thing would be a massive energy sucker as it was. As for mass, the fully fuelled probe clocks in at about 22.7 tons, with a TWR just below 0.04. It can burn for about 55 seconds at a stretch using the two Z-4Ks in the top section, and then it needs to wait about 8 minutes to recharge fully.\u003C/p\u003E\u003Cp\u003EHere\u0027s a better view of the engine section:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UdKYhZ9.png\u0022 alt=\u0022UdKYhZ9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd a view of how the engines are attached:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eH6DK72.png\u0022 alt=\u0022eH6DK72.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-02-17T15:16:11Z","Content":"\n\u003Cp\u003EI have two questions,\u003C/p\u003E\u003Cp\u003E1. What mod gives those ion engines those effects?\u003C/p\u003E\u003Cp\u003E2. Are those RTGs enough to power all of those ion engines at full power? O_o\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-17T15:22:28Z","Content":"\n\u003Cp\u003EThat engine cluster honestly is really, really beautiful. I need to try something like that. Well, as good as I can make it without part clipping, anyway. My craft always end up looking a terribly utilitarian patchwork of randomly colored parts stuck together...\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EThe engine trail mod is HotRockets. And the RTGs are not enough, as he wrote he can burn 55 seconds until the buffer is dry, which then needs 8 minutes to refill.\u003C/p\u003E\u003Cp\u003EMaybe one could attach a solar array to a decoupler and use it to be able to burn continuously for the initial ejection, then discard the array when the craft is underway (as it becomes ineffecient way out at Jool anyway).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-17T15:25:22Z\u0022 title=\u002202/17/2014 03:25  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 17, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2014-02-17T15:29:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EMaybe one could attach a solar array to a decoupler and use it to be able to burn continuously for the initial ejection, then discard the array when the craft is underway (as it becomes ineffecient way out at Jool anyway).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI toyed with using solar arrays, but they didn\u0027t actually contribute much during ground testing, and having them permanently attached added an extra 1.5 tons (and dropped my dV by 700 m/s).\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-02-17T15:58:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMaybe one could attach a solar array to a decoupler and use it to be able to burn continuously for the initial ejection, then discard the array when the craft is underway (as it becomes ineffecient way out at Jool anyway).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt might also help having the science bays being able to jettison themselves after use. Since it\u0027s an unmanned mission I assume there isn\u0027t going to be a science lab, so the used up science experiments aren\u0027t re-usable. They\u0027d end up as dead weight after transmission. I dont see any parachutes or langing gears on the craft, so I also assume that he isn\u0027t going to bring it back to kerbin for recovery.\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2014-02-17T16:04:55Z","Content":"\n\u003Cp\u003EThe goal is actually recovery, rather than transmission (I don\u0027t do transmission missions if I can help it). There\u0027s a docking port on the nose of the ship, where it\u0027s meant to dock with a manned craft on return to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-02-17T16:07:11Z","Content":"\n\u003Cp\u003EThe best advice I have for using ion engines: Look up the DynamicWarp mod. Combined with normal physics warp you can burn at 8x or 16x speed\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2014-02-17T16:10:11Z","Content":"\n\u003Cp\u003EI just don\u0027t have the patience for ion drives. Heck, I barely have the patience for LV-N\u0027s. Give me TWR or give me death! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jmiki8","CreatedById":94688,"CreatedDateTime":"2014-02-17T16:28:29Z","Content":"\n\u003Cp\u003EI use ion engines for fine tuning/backup on my satellites, like this one, deployed using a spaceplane. For that purpose they work very well, I don\u0027t even bother putting other kinds of engines on, when it comes to the final-final stage on probes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/f4FATOG.png\u0022 alt=\u0022f4FATOG.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-17T16:32:31Z\u0022 title=\u002202/17/2014 04:32  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 17, 2014\u003C/time\u003E by jmiki8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainArchmage","CreatedById":82533,"CreatedDateTime":"2014-02-17T16:33:37Z","Content":"\n\u003Cp\u003EBefore moving to career mode, I build some heavy ion-powered spacecraft. There was a three-kerbal spacecraft to Eve using the large command pod with five ion engines, many batteries and solar panels, and a lot of the xenon tanks. I used this to get to Eve in about 20 days, not just during a Hoffman transfer launch window. This required a burn of over two hours.\u003C/p\u003E\u003Cp\u003EOne point of electric propulsion is to cut down on travel time as much as possible. However, most people seem to use ion propulsion just for Hoffman windows.\u003C/p\u003E\n"}]}