{"TopicId":63748,"ForumId":32,"TopicTitle":"Laythe is like a mini-Eve with FAR","CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-02-20T01:49:52Z","PageNum":1,"Articles":[{"CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-02-20T01:49:52Z","Content":"\n\u003Cp\u003EOr at least that\u0027s my impression so far. See, without FAR, I can use mechjeb to automatically land me on one of the islands. Even I do a manual landing and miss an island, I only need a couple of turbojets to have cross-range capability. Pop the chutes, land, and then take off again.\u003C/p\u003E\u003Cp\u003EWithout FAR, I could just make a typical vertical SSTO with lots of turbojets, aerospikes, RAPIERs, intake spam and attach everything I need. I can make a wide stubby lander that spreads the load out.\u003C/p\u003E\u003Cp\u003EYeah. I think I should\u0027ve done my laythe landing BEFORE I installed FAR, because it\u0027s aerodynamics are obviously crap. More crap than I expected. Everything except the aerodynamics works. Oh and I put the lander can on backwards.\u003C/p\u003E\u003Cp\u003ESo I\u0027ve made four single-kerbal ascent vehicles to rescue my crew. It\u0027s simple and it works. Only thing I don\u0027t like is the need to weigh down the W key for an hour so as my kerbals make the hike.\u003C/p\u003E\u003Cp\u003EI\u0027m also working on a 3-7 kerbal ascent vehicle, which is more complicated and produces more explosions (and thus is more kerbal).\u003C/p\u003E\u003Cp\u003EThe point behind this is that these vehicles are like something players would use to escape Eve, but with less Delta-V. Laythe feels like Eve with FAR installed. Pop the chutes when you go in, enjoy the gravity at surface, use one specialized vehicle to leave.\u003C/p\u003E\u003Cp\u003EExcept that Laythe has more oceans than Eve to sink/explode in, plus I want a reusable craft (like my original vehicle).\u003C/p\u003E\u003Cp\u003ESo spaceplanes seem like the best choice for me. Except that I\u0027m crap at making spaceplanes and crap at flying them. But having a workable design would help.\u003C/p\u003E\u003Cp\u003EI\u0027m also open to using airships for Laythe ascent vehicles.\u003C/p\u003E\u003Cp\u003EAnyway, who\u0027s flown on Laythe or Eve with FAR installed? And are there any FAR-compatible Laythe spaceplanes out there?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-20T02:34:05Z","Content":"\n\u003Cp\u003EThere\u0027s a spaceplane that can take you to Laythe included with FAR; it\u0027s the Velocitas. I\u0027ve landed it on Laythe and returned it to Kerbin a few times, though a non-optimal Kerbin return trajectory generally leads to it being torn apart on atmospheric entry.\u003C/p\u003E\u003Cp\u003EHonestly, it just sounds like you\u0027re trying to build vehicles without thinking through the aerodynamics or you\u0027re over-relying on MJ (which is far from perfect) to get things done.\u003C/p\u003E\u003Cp\u003EOh, and as for FAR\u0027s aerodynamics being crap, take it up with the USAF; the aerodynamics are heavily based on the USAF Stability and Control DATCOM, with a few small changes to reduce computational overhead. Basically, it\u0027s using the aerodynamic models used for the first pass in designing real life aircraft and missiles. Although I have to admit I\u0027ve been wondering when the next, \u0022FAR\u0027s aerodynamics are crap (read: I don\u0027t know what I\u0027m doing so I\u0027ll blame the mod),\u0022 post / thread would crop up; it\u0027s been about a month (by my estimate) since someone ranted about this, which makes it about two weeks overdue.\u003C/p\u003E\n"},{"CreatedByName":"federicoaa","CreatedById":94879,"CreatedDateTime":"2014-02-20T03:14:51Z","Content":"\n\u003Cp\u003EWhat bout this? (it uses FAR and B9 for the parts)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2o5PnKa.jpg\u0022 alt=\u00222o5PnKa.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI did a very simple SSTO inspired in the IQ series of Scott Manley, then it\u0027s just some practice to aim to the island I want to land and land on the shores.\u003C/p\u003E\n"},{"CreatedByName":"Blackstar","CreatedById":61238,"CreatedDateTime":"2014-02-20T03:16:21Z","Content":"\n\u003Cp\u003EFWIW I read that as \u0022[the lander\u0027s] aerodynamics are crap\u0022 -- and installing FAR made it a lot more obvious than the stock model. The language is ambiguous enough that I could see it meaning either though.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-20T03:29:19Z","Content":"\n\u003Cp\u003EHunh, yeah I guess that makes more sense. I\u0027m just used to FAR being the subject of \u0022it\u0027s aerodynamics are crap,\u0022 and in the context of complaining about aerodynamics with FAR installed that\u0027s the first thing I think. OP, sorry if that\u0027s the meaning you intended, I\u0027m just defensive about my pet project. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-02-20T03:30:05Z","Content":"\n\u003Cp\u003EFAR aerodynamics are not crap. They are ultra-realistic. If you are incapable of producing a craft which is successful under those conditions, it is because you are attempting to apply stock flight logic to a very different aerodynamic model. The only reason I don\u0027t use FAR is because the last time I did, I was having issues with wings being rock solid stock, and folding in half (I kidd you not) in FAR, as well as the fact that KSP hates my joystick and on a realistic flight model like this, I have to be flying analog.\u003C/p\u003E\u003Cp\u003ECondensed, the above basically means that the OP is building something that is not aerodynamically sound by the basic laws of physics and using a technically correct flight model has him screwed over, whereas the stock aerodynamics simply lie and say that it works when it really shouldn\u0027t.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EHunh, yeah I guess that makes more sense. I\u0027m just used to FAR being the subject of \u0022it\u0027s aerodynamics are crap,\u0022 and in the context of complaining about aerodynamics with FAR installed that\u0027s the first thing I think. OP, sorry if that\u0027s the meaning you intended, I\u0027m just defensive about my pet project. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrust me, your aerodynamics are not crap. They are very different, and it\u0027s human nature to dislike that which is different, especially if it does not work.\u003C/p\u003E\u003Cp\u003ERereading the OP, it basically says that this is a craft which would never fly well IRL and FAR is doing it\u0027s job by making it handle as it should, like crap.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-20T03:32:32Z\u0022 title=\u002202/20/2014 03:32  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 20, 2014\u003C/time\u003E by Captain Sierra\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-02-20T03:46:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EThere\u0027s a spaceplane that can take you to Laythe included with FAR; it\u0027s the Velocitas. I\u0027ve landed it on Laythe and returned it to Kerbin a few times, though a non-optimal Kerbin return trajectory generally leads to it being torn apart on atmospheric entry.\u003Cp\u003EHonestly, it just sounds like you\u0027re trying to build vehicles without thinking through the aerodynamics or you\u0027re over-relying on MJ (which is far from perfect) to get things done.\u003C/p\u003E\u003Cp\u003EOh, and as for FAR\u0027s aerodynamics being crap, take it up with the USAF; the aerodynamics are heavily based on the USAF Stability and Control DATCOM, with a few small changes to reduce computational overhead. Basically, it\u0027s using the aerodynamic models used for the first pass in designing real life aircraft and missiles. Although I have to admit I\u0027ve been wondering when the next, \u0022FAR\u0027s aerodynamics are crap (read: I don\u0027t know what I\u0027m doing so I\u0027ll blame the mod),\u0022 post / thread would crop up; it\u0027s been about a month (by my estimate) since someone ranted about this, which makes it about two weeks overdue.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me clarify: I really like FAR\u0027s aerodynamic model and I do think it\u0027s really good. What I was trying to say is that vehicles that would work perfectly fine under the stock aerodynamics will flip out of control or have lots of drag under FAR\u0027s aerodynamic model. My original laythe SSTO is more horizontal than vertical. Plus it has lots of intakes and other objects that would produce lots of drag. So I\u0027m not ranting about FAR. \u003C/p\u003E\u003Cp\u003EI\u0027m mostly inquiring right now because there\u0027s not much information about using FAR on bodies other than Kerbin. My main reason for using FAR is so that I don\u0027t have to relearn how to build craft once Squad improves the aerodynamic model. That, and I enjoy the reduced delta-v requirements for getting to LKO.\u003C/p\u003E\u003Cp\u003EOnce I can upload some pictures, it\u0027ll be easier to explain each craft.\u003C/p\u003E\u003Cp\u003EFun fact: I made a Gloster Meteor-lookalike plane recently. With stock aerodynamics, it can easily reach 1.2km/s, but it\u0027s only a subsonic plane with FAR. Just like the real Meteor.\u003C/p\u003E\u003Cp\u003EI usually only use MJ for pinpoint landings on atmospheric bodies, matching velocities at closest approach, and seeing where Kerbin will be during a future transfer window.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-02-20T03:56:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ScallopPotato\u0022 data-cite=\u0022ScallopPotato\u0022\u003E\u003Cdiv\u003ELet me clarify: I really like FAR\u0027s aerodynamic model and I do think it\u0027s really good. What I was trying to say is that vehicles that would work perfectly fine under the stock aerodynamics will flip out of control or have lots of drag under FAR\u0027s aerodynamic model. My original laythe SSTO is more horizontal than vertical. Plus it has lots of intakes and other objects that would produce lots of drag. So I\u0027m not ranting about FAR. \u003Cp\u003EI\u0027m mostly inquiring right now because there\u0027s not much information about using FAR on bodies other than Kerbin. My main reason for using FAR is so that I don\u0027t have to relearn how to build craft once Squad improves the aerodynamic model. That, and I enjoy the reduced delta-v requirements for getting to LKO.\u003C/p\u003E\u003Cp\u003EOnce I can upload some pictures, it\u0027ll be easier to explain each craft.\u003C/p\u003E\u003Cp\u003EFun fact: I made a Gloster Meteor-lookalike plane recently. With stock aerodynamics, it can easily reach 1.2km/s, but it\u0027s only a subsonic plane with FAR. Just like the real Meteor.\u003C/p\u003E\u003Cp\u003EI usually only use MJ for pinpoint landings on atmospheric bodies, matching velocities at closest approach, and seeing where Kerbin will be during a future transfer window.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1)Gloster Meteor is a beautiful plane and a really nice lookalike can be created with the SXT pack\u0027s tiny jet engines.\u003C/p\u003E\u003Cp\u003E2) Pinpoint mechjebless landing tutorial: F5\u003C/p\u003E\u003Cp\u003EIt IS that simple. Save, attempt landing, miss, reload, try again with corrected course, rinse and repeat until successful. Eventually you learn how to judge the landing.\u003C/p\u003E\u003Cp\u003E3) There is no guide to non-kerbin FAR usage because the laws of aerodynamics don\u0027t change, only the atmospheric properties. As none of the worlds are super dramatically different from Kerbin, it\u0027s entirely possible to predict an aircraft\u0027s behavior on a planet based on it\u0027s performance on Kerbin with little knowledge of the planet. In my experience, Laythe is the easiest.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-20T04:13:17Z","Content":"\n\u003Cp\u003ELaythe can be a little weird, since the speed of sound is slightly lower there (it\u0027s simulated as having an atmosphere with lots of CO2 and SO2 from volcanism, which decreases the speed of sound; on the other hand, this pushes up the density a bit). Overall, the aerodynamics are the same, but compressibility effects (supersonic stuff, the speed of sound) will happen at slightly different temperatures and magnitudes. The only place where it\u0027s really different is Jool, where a primarily hydrogen atmosphere pushes the speed of sound really high and the density down a lot. \u003C/p\u003E\u003Cp\u003EDon\u0027t go airhogging with FAR. One intake per engine is often more than enough, so don\u0027t add more and end up with lots of drag to deal with. Also, make sure to test your spaceplane after fuel drains, since that can mess with the CoM a lot.\u003C/p\u003E\u003Cp\u003EVertical landings on atmospheric bodies need to account for the fact that the craft has to be able to change which direction it\u0027s stable in; this means separate landing and ascent stages or some type of special aerodynamic sections that are intended to make it stable during reentry. This is ignoring parachutes, since you can deploy those in the upper atmosphere without risking them burning up (assuming DRE) or not doing anything until the vehicle is tumbling (which probably results in it breaking apart).\u003C/p\u003E\u003Cp\u003EI still have to attempt a sea level landing and return from Eve with FAR; AFAIK, no one has attempted that yet. The dV requirements should be much lower than stock, but trying to land the ascent vehicle will be the real challenge.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-02-20T04:21:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003ELaythe can be a little weird, since the speed of sound is slightly lower there (it\u0027s simulated as having an atmosphere with lots of CO2 and SO2 from volcanism, which decreases the speed of sound; on the other hand, this pushes up the density a bit). Overall, the aerodynamics are the same, but compressibility effects (supersonic stuff, the speed of sound) will happen at slightly different temperatures and magnitudes. The only place where it\u0027s really different is Jool, where a primarily hydrogen atmosphere pushes the speed of sound really high and the density down a lot. \u003Cp\u003EDon\u0027t go airhogging with FAR. One intake per engine is often more than enough, so don\u0027t add more and end up with lots of drag to deal with. Also, make sure to test your spaceplane after fuel drains, since that can mess with the CoM a lot.\u003C/p\u003E\u003Cp\u003EVertical landings on atmospheric bodies need to account for the fact that the craft has to be able to change which direction it\u0027s stable in; this means separate landing and ascent stages or some type of special aerodynamic sections that are intended to make it stable during reentry. This is ignoring parachutes, since you can deploy those in the upper atmosphere without risking them burning up (assuming DRE) or not doing anything until the vehicle is tumbling (which probably results in it breaking apart).\u003C/p\u003E\u003Cp\u003EI still have to attempt a sea level landing and return from Eve with FAR; AFAIK, no one has attempted that yet. The dV requirements should be much lower than stock, but trying to land the ascent vehicle will be the real challenge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf one straps the heat shield of this thing on the bottom, would that help if you then added some fin structure towards the rear like a lawn dart?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.com/a/img689/5769/eg5u.png\u0022 alt=\u0022eg5u.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-20T04:32:03Z","Content":"\n\u003Cp\u003EIf you made the heat shield a little more round and less like a flat plate it should help make it more stable. Fins \u003Cem\u003Ewould\u003C/em\u003E help, but that\u0027s only because FAR doesn\u0027t simulate local changes in velocity and dynamic pressure (yet) which in real life would create a pure vacuum behind the heat shield.\u003C/p\u003E\u003Cp\u003EFor that thing, the best solution would be to make it flatter to ensure that it\u0027s stable (with a correspondingly larger heat shield) and to give it spin stabilization as well. For that particular one all the fuel and heavy nuke engines at the front should make it stable unless there\u0027s something I\u0027m missing.\u003C/p\u003E\n"},{"CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-02-20T04:49:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003ELaythe can be a little weird, since the speed of sound is slightly lower there (it\u0027s simulated as having an atmosphere with lots of CO2 and SO2 from volcanism, which decreases the speed of sound; on the other hand, this pushes up the density a bit). Overall, the aerodynamics are the same, but compressibility effects (supersonic stuff, the speed of sound) will happen at slightly different temperatures and magnitudes. The only place where it\u0027s really different is Jool, where a primarily hydrogen atmosphere pushes the speed of sound really high and the density down a lot. \u003Cp\u003EDon\u0027t go airhogging with FAR. One intake per engine is often more than enough, so don\u0027t add more and end up with lots of drag to deal with. Also, make sure to test your spaceplane after fuel drains, since that can mess with the CoM a lot.\u003C/p\u003E\u003Cp\u003EVertical landings on atmospheric bodies need to account for the fact that the craft has to be able to change which direction it\u0027s stable in; this means separate landing and ascent stages or some type of special aerodynamic sections that are intended to make it stable during reentry. This is ignoring parachutes, since you can deploy those in the upper atmosphere without risking them burning up (assuming DRE) or not doing anything until the vehicle is tumbling (which probably results in it breaking apart).\u003C/p\u003E\u003Cp\u003EI still have to attempt a sea level landing and return from Eve with FAR; AFAIK, no one has attempted that yet. The dV requirements should be much lower than stock, but trying to land the ascent vehicle will be the real challenge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EScott Manley\u0027s gonna be really surprised once his Jool probe arrives at Jool (assuming he tries aerobraking). I sure was. \u0022I\u0027m on fire and I\u0027M STILL ACCELERATING?\u0022\u003C/p\u003E\u003Cp\u003EMy Laythe ascent vehicle has separate descent and ascent sections. Basically, it\u0027s like:\u003C/p\u003E\u003Cp\u003E1) Retro-rockets to cut orbital velocity for a fairly steep entry angle. Reduces the chance of falling short or overshooting target area. It\u0027s also useful for slowing down before...\u003C/p\u003E\u003Cp\u003E2) Popping the drogue chutes after entry flames dissipate. Main chutes follow shortly afterwards. The drogue chutes are on a structure above the lander and will later be decoupled.\u003C/p\u003E\u003Cp\u003E3) Drop retro-pack, turn on main engines. Can be helpful for reducing touchdown speed.\u003C/p\u003E\u003Cp\u003E4) Deploy landing legs.\u003C/p\u003E\u003Cp\u003E5) Land.\u003C/p\u003E\u003Cp\u003E6) Detach the drogue chute structure and the extra main chutes. They have separtrons to fly off and explode around the craft. Because everything\u0027s better with powered separation. Very kerbal.\u003C/p\u003E\u003Cp\u003E7) Detach most of the landing legs. More explosions.\u003C/p\u003E\u003Cp\u003E8) Liftoff! Detach the remaining landing legs and the ladders. Lovely lovely explosions AS YOU TAKE OFF.\u003C/p\u003E\u003Cp\u003E9) Follow standard FAR ascent profile. The rocket is asparagus-staged to reduce overall cross-section on ascent.\u003C/p\u003E\u003Cp\u003EI\u0027ve seen people using detachable landing structures on eve ascent vehicles, but that was to reduce mass (which is also nice with FAR).\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-20T04:50:14Z","Content":"\n\u003Cp\u003EAlso, don\u0027t use MechJeb. It\u0027s really dumb. I\u0027ve tried using it with FAR once; I gave up quickly. It\u0027s just too stupid to cope with realistic aerodynamic model, and barely even handles stock spaceplanes. Really, dunno why people keep using that, it\u0027s only good for simple, pure stock rockets with stock aerodynamic model and as a data readout. Trying to do anything complex or realistic with it is inefficient, if it works at all, that is.\u003C/p\u003E\n"},{"CreatedByName":"Blackstar","CreatedById":61238,"CreatedDateTime":"2014-02-20T15:00:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EThis is ignoring parachutes, since you can deploy those in the upper atmosphere without risking them burning up (assuming DRE) or not doing anything until the vehicle is tumbling (which probably results in it breaking apart).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr, as I found out the hard way recently, if you have FAR, Deadly Reentry, \u003Cem\u003Eand\u003C/em\u003E Real Parachutes installed, deploying chutes during or before reentry is a really bad idea.\u003C/p\u003E\u003Cp\u003EWhich makes perfect sense; IRL they\u0027d catch on fire or be ripped to shreds too. I had just gotten used to KSP\u0027s default chute model totally ignoring the canopy and only simulating physics on the housing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EAlso, don\u0027t use MechJeb. It\u0027s really dumb. I\u0027ve tried using it with FAR once; I gave up quickly. It\u0027s just too stupid to cope with realistic aerodynamic model, and barely even handles stock spaceplanes. Really, dunno why people keep using that, it\u0027s only good for simple, pure stock rockets with stock aerodynamic model and as a data readout. Trying to do anything complex or realistic with it is inefficient, if it works at all, that is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, MJ\u0027s calculations all assume stock aerodynamics, so most of the autopilots will do the complete wrong thing in an atmosphere. Definitely avoid the ascent and landing autopilots, which I never used anyway because I prefer to control things by hand for those.\u003C/p\u003E\u003Cp\u003EI still keep it installed just for Smart A.S.S. because it\u0027s handy to tell my ship to point along a specific vector without having to make constant corrections around the orbit (and more realistic, too, in the case of automated probes!). Surface mode is useful in the atmosphere as well to hold a constant heading.\u003C/p\u003E\u003Cp\u003EPlus I prefer some of the flight readouts to Kerbal Engineer\u0027s.\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2014-02-20T15:20:04Z","Content":"\n\u003Cp\u003EWell, you can use MJ with FAR, but it takes some practice and liberal use of the F5/F9.\u003C/p\u003E\u003Cp\u003ETo my knowledge, there is no good way to estimate your LZ with FAR (someone please correct me if i\u0027m wrong). What I do is prior to a test landing, hit F5, create a maneuver node which places the ship right on target according to MJ. Then proceed with the landing and see exactly how far short or long (usually short) the LZ is. Then hit F9, re-create the maneuver node to lead the LZ by however much it was short and proceed. You should land within 50m, or better, of your target landing zone.\u003C/p\u003E\u003Cp\u003EIt would be nice though if MJ could grab some estimated drag from FAR to be able to better anticipate your LZ on the first go. That would good for aerobreaking as well. Right now it is rather hit and miss on aerobreaking.\u003C/p\u003E\u003Cp\u003EFerram, while you\u0027re following this thread, I\u0027ve got a quick question. If I put a procedural fairing on a rocket (no fins), I typically get a rather small Cd (like .05 or smaller) but a rather large cross section (like over 100m2). Yet, if I put fins or winglets or whatever at the bottom, the Cd shoots up to 2\u002B but the cross sections drops by a factor of ten.\u003C/p\u003E\u003Cp\u003EIs that just the display having trouble with the procedural fairing or what? Over all performance donesn\u0027t seem to be affected. In the absence of sufficient torque from reactions wheels, the fins help stability, but the numbers on the flight data screen kinda look weird.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-20T15:55:51Z","Content":"\n\u003Cp\u003EThat is due to the fact that FAR prefers to use the surface area of wing parts for calculating Cl / Cd rather than total surface area. The main reason is that planes use the wing area for its Cl and Cd output, so FAR tries to be consistent with that. When you don\u0027t have any wing parts attached it has to use some other reference area, and the best choice is total surface area.\u003C/p\u003E\u003Cp\u003EFAR never uses cross-sectional area except for pre-calculating the aerodynamic properties of parts before converting the numbers over to use surface area. It just works out that accounting for skin friction drag (approx. Cd 0.005) is much easier and cheaper if I use surface area instead.\u003C/p\u003E\u003Cp\u003EAs for trying to calculate aerobraking and landing with FAR, it\u0027s never going to be as accurate as people have gotten used to with MJ; unfortunately the simplicity of the stock drag model allows MJ to make very good predictions for that, since the orientation of the vehicle largely doesn\u0027t matter, but people have gotten so used to that that they\u0027ll forever complain about the inaccuracy of the predictions (especially for the not-so-stable craft).\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2014-02-20T19:34:34Z","Content":"\n\u003Cp\u003EYeah, had a feeling on that. One wonders how SpaceX is planning to get around that on their rocket stages designed to return to the launch pad.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2014-02-20T19:50:36Z","Content":"\n\u003Cp\u003EDoes FAR account for the fact that CoP of the heat shield moves as the lander tilts? With static CoP, I can imagine a lot of ships being unstable on re-entry that shouldn\u0027t be.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-20T19:56:20Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@rosenkranz: \u003C/strong\u003EThey\u0027ll have the stages enter the atmosphere in exactly the right orientation and will use RCS to keep the things pointed the correct way. The inaccuracy in KSP will end up mostly being due to players not putting the craft in the exact correct stable configuration at first and the initial transient effects will cause enough of an initial deviation that the trajectory will be changed a lot. Especially if the craft\u0027s drag changes significantly as it oscillates around the stable orientation.\u003C/p\u003E\u003Cp\u003EThe difference is that SpaceX will set things up so that the stage comes in matching the model as much as possible, fully knowing that the wrong initial conditions will completely invalidate the model, while KSP players don\u0027t think in such terms and will instead expect absolute accuracy regardless of what they throw at it. Because they\u0027ve had that so far with MJ and now they\u0027re used to it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@K^2: \u003C/strong\u003EYeah, but that\u0027s limited by the size of the heat shield, as it should be. It\u0027s noticeable (it\u0027s needed to make even the mk1 pod stable enough) but it\u0027s not enough to make some people\u0027s designs stable.\u003C/p\u003E\n"}]}