{"TopicId":64098,"ForumId":32,"TopicTitle":"Teaching an older dog new tricks","CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2014-02-23T20:14:19Z","PageNum":1,"Articles":[{"CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2014-02-23T20:14:19Z","Content":"\n\u003Cp\u003EI bought a copy of KSP for my dad last Christmas and he has yet to play it on his own. This surprised me because when he was young he was a serious Apollo freak. When he was 16 he constructed two Apollo style space suits for himself and a neighbor and a Lunar landscape and LEM in scale to the old school 12\u0022 GI Joes. He used to be able to recite the radio transmissions from the Apollo 11 mission, in full. When Apollo 13 came out I might have thought it was a documentary on account of his narration.\u003C/p\u003E\u003Cp\u003ENext month I am going to visit him to see if I can\u0027t get him past the intimidating computer game side of KSP and into the fun of building and flying. I am planning on taking some stockalike mods and a couple of the more handy plugins with me, such as Kerbal Engineer Redux and Crew Manifest. It is installed on his Mac and I\u0027m not sure if I should expect any trouble from mods since I run KSP on a PC. \u003C/p\u003E\u003Cp\u003EI\u0027m looking for:\u003C/p\u003E\u003Cp\u003E1) Mods to avoid on mac.\u003C/p\u003E\u003Cp\u003E2) Tips to help a non-gamer get the hang of KSP.\u003C/p\u003E\u003Cp\u003E3) best stock-alike mods and/or best mods for old school NASA hardware.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-02-23T20:31:33Z","Content":"\n\u003Cp\u003EStock-a-like mods? Try the Habitat Pack, or KW rocketry.\u003C/p\u003E\u003Cp\u003EEDIT: HOW COULD I FORGET??? You NEED the FASA pack\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T20:35:32Z\u0022 title=\u002202/23/2014 08:35  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by Javster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PhaserArray","CreatedById":85824,"CreatedDateTime":"2014-02-23T20:36:24Z","Content":"\n\u003Cp\u003EOne of my favorite stock-a-like mods is the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24593-WIP-RLA-Stockalike-0-9-4-released-27th-November\u0022 rel=\u0022external nofollow\u0022\u003ERLA Stockalike\u003C/a\u003E mod.\u003C/p\u003E\n"},{"CreatedByName":"TimMartland","CreatedById":68334,"CreatedDateTime":"2014-02-23T20:47:25Z","Content":"\n\u003Cp\u003EKW isnt really that stockalike. I play with lots of stockalike packs so here is some recommendations:\u003C/p\u003E\u003Cp\u003EKSPX\u003C/p\u003E\u003Cp\u003ERLA Stockalike\u003C/p\u003E\u003Cp\u003ENF Propultion\u003C/p\u003E\u003Cp\u003EStation Science\u003C/p\u003E\u003Cp\u003EPorkworks Habitat Pack\u003C/p\u003E\u003Cp\u003EStarShine Stockalike\u003C/p\u003E\u003Cp\u003EKerbonov Mk2 Cockpit\u003C/p\u003E\u003Cp\u003EKerbin Mini Shuttle\u003C/p\u003E\u003Cp\u003EProcedural Fairings\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-23T20:53:07Z","Content":"\n\u003Cp\u003ETry not to get too many mods involved, as it can confuse new players. Plugins are okay, and if anything, FASA is the perfect mod for NASA fans.\u003C/p\u003E\n"},{"CreatedByName":"qromodynmc","CreatedById":87139,"CreatedDateTime":"2014-02-23T20:59:43Z","Content":"\n\u003Cp\u003EYeah dont use much mods,lesser parts; easy to learn. But you can use fasa,he would like it.\u003C/p\u003E\n"},{"CreatedByName":"LordOfTheOrbits","CreatedById":101867,"CreatedDateTime":"2014-02-23T21:38:23Z","Content":"\n\u003Cp\u003EGenerally any mods work on any system, I haven\u0027t seen any exception yet.\u003C/p\u003E\u003Cp\u003EI would recommend FASA, KW rocketry and ferram aerospace reasearch.\u003C/p\u003E\n"},{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2014-02-23T22:46:26Z","Content":"\n\u003Cp\u003EIf your dad\u0027s a non gamer are you sure he\u0027s even interested in playing it? A lot of people think of gaming as a pointless waste of time. \u003C/p\u003E\u003Cp\u003EHe might play while you\u0027re around to be doing something with you but that doesn\u0027t mean he\u0027d be interested in playing solo.\u003C/p\u003E\u003Cp\u003EIf he does want to learn the game you might be better starting him stock in career mode. All the parts in the sandbox mode can be a bit overwhelming.\u003C/p\u003E\n"},{"CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2014-02-23T22:50:53Z","Content":"\n\u003Cp\u003ECool! I always have trouble keeping my own mod list short.\u003C/p\u003E\u003Cp\u003EHere\u0027s what I\u0027m thinking of.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69539-0-23-Stockalike-parts-for-useful-esthetics\u0022 rel=\u0022external nofollow\u0022\u003EStockalike-parts-for-useful-esthetics\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24593-WIP-RLA-Stockalike-0-9-4-released-27th-November\u0022 rel=\u0022external nofollow\u0022\u003ERLA-Stockalike\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/30472-0-23-x-KSPX-Kerbal-Stock-Part-eXpansion-mod-reposted-v0-2-5\u0022 rel=\u0022external nofollow\u0022\u003EKSPX\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/18230-0-23-Kerbal-Engineer-Redux-v0-6-2-3\u0022 rel=\u0022external nofollow\u0022\u003EKerbal-Engineer-Redux\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m thinking of stripping down NovaPunch to the 3m and 5m tanks and engines and adding procedural fairings to better facilitate a Saturn V.\u003C/p\u003E\u003Cp\u003EEventually I think I\u0027ll show him B9, Ferram, Firespitter and that Kerbonov mk2 cockpit. Building planes is his big thing right now.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/GQusJOatTQc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2014-02-23T22:56:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerba Fett\u0022 data-cite=\u0022Kerba Fett\u0022\u003E\u003Cdiv\u003EIf your dad\u0027s a non gamer are you sure he\u0027s even interested in playing it? A lot of people think of gaming as a pointless waste of time. \u003Cp\u003EHe might play while you\u0027re around to be doing something with you but that doesn\u0027t mean he\u0027d be interested in playing solo.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou could be right but I don\u0027t think thats it. He used to play flight sims fairly often, especially solo. we used to have tons of fun playing co-op Comanche 3. I think if I help him with the interface and show him what he can do with the game he\u0027ll be off and running. an unfamiliar interface can be a barrier to entry to some folks.\u003C/p\u003E\n"},{"CreatedByName":"Wayfare","CreatedById":52072,"CreatedDateTime":"2014-02-23T23:10:03Z","Content":"\n\u003Cp\u003EI\u0027d suggest starting off with only some quality-of-life mods, like Enhanced Nav Ball and Kerbal Engineer, if even that. Leave the giant heaps of parts out of it for now - stock KSP will keep a man busy for quite a while without overwhelming him with seven kinds of RCS block and 5.149 meter xenon tanks. Plus, with stock parts he\u0027ll have an easier time picking up on tutorial videos which are fantastic for learning the game.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-02-24T01:29:14Z","Content":"\n\u003Cp\u003EI didn\u0027t tried this mod but, as you said your dad loved the Apollo program(who wouldn\u0027t?) he might love that one:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66550-Saturn_v_rss?highlight=saturn\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/66550-Saturn_v_rss?highlight=saturn\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(A saturn V rocket)\u003C/p\u003E\u003Cp\u003EThe mod is made for RSS though.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-02-24T01:50:36Z","Content":"\n\u003Cp\u003EHaven\u0027t seen Kerbal Alarm Clock mentioned, that should be essential, along with Enhanced Navball. Given his interests as a youth, he should be able to make use of KER right off the bat too. You know, the basic data stuff KSP should come with stock\u003C/p\u003E\n"},{"CreatedByName":"likke_A_boss","CreatedById":94697,"CreatedDateTime":"2014-02-24T02:08:06Z","Content":"\n\u003Cp\u003EBobcats American Pack has some pretty good Nasa rockets in there, too. And: FASA!\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-02-24T02:44:09Z","Content":"\n\u003Cp\u003EI\u0027ve got a brother that has KSP but he\u0027s more into Space Engineer because its easier for him. Regardless, I\u0027d recommend stock parts at first (Career mode is perfect). I also recommend one mod: Kerbal Engineer Redux. You might show your Dad one or two Manley tutorials (from the newest series). Otherwise, either let him tough it out while you are there or if he asks if you want to play a little, make sure he watches you and that you are doing something fun. It might be that he simply thinks the Kerbals are childish or not needed. A little game play can get him past that.\u003C/p\u003E\n"},{"CreatedByName":"Gunso","CreatedById":103860,"CreatedDateTime":"2014-02-24T04:09:02Z","Content":"\n\u003Cp\u003Estock parts, kerbal engineer or mech jeb\u003C/p\u003E\u003Cp\u003Emore than that will overwhelm new player\u003C/p\u003E\u003Cp\u003Ei remember putting off this game for a few months after getting it and only start playing it again after watching some youtube videos and intensively going over tutorial videos\u003C/p\u003E\u003Cp\u003Ealso give him this so he have some idea when designing rockets \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/w/images/7/73/KerbinDeltaVMap.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/w/images/7/73/KerbinDeltaVMap.png\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"wbcundiff","CreatedById":59031,"CreatedDateTime":"2014-02-25T01:05:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gunso\u0022 data-cite=\u0022Gunso\u0022\u003E\u003Cdiv\u003Estock parts, kerbal engineer or mech jeb\u003Cp\u003Emore than that will overwhelm new player\u003C/p\u003E\u003Cp\u003Ei remember putting off this game for a few months after getting it and only start playing it again after watching some youtube videos and intensively going over tutorial videos\u003C/p\u003E\u003Cp\u003Ealso give him this so he have some idea when designing rockets \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/w/images/7/73/KerbinDeltaVMap.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/w/images/7/73/KerbinDeltaVMap.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats what I\u0027m thinking as well. I have no experience with mech jeb but I\u0027ve gotten a lot of use out of kerbal engineer. KER along with a delta-v map as you suggested would give parameters to the design and remove the barrier of real time calculation from a new player\u0027s experimentation. I had thought of using one or two stockalike mods if they fill in functional gaps in the stock parts and don\u0027t break the visual language of the stock parts. A player might find they need an engine of a different size but it would be helpful if those engines had the same visual cues as the stock engines so that everything makes sense together. FASA looks really cool, but there is a lot of stuff there from what I can tell. I will probably not throw that in until it seems he has the hang of the game.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-25T01:17:07Z","Content":"\n\u003Cp\u003EI don\u0027t recommend MechJeb. It\u0027s stupid, performance intensive and only good for the simplest maneuvers, which are better done by hand, anyway. Also, install FAR and KIDS to compensate for different dV requirements. Stock aerodynamic model is horrible and creates bad habits, avoid it if possible. KER is a nice mod, and you could throw some purely eyecandy ones in, like HotRockets and CoolRockets. Also, RasterPropMonitor. It really helps immersion, and also displays some useful data.\u003C/p\u003E\n"}]}