{"TopicId":64224,"ForumId":32,"TopicTitle":"What are you doing in KSP right now?","CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-02-25T04:11:51Z","PageNum":6,"Articles":[{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-03-30T10:14:13Z","Content":"\n\u003Cp\u003EDuna mission: Returning the initial mission and crew, and setting up a permanent station in Duna orbit. I have the fuel and science station there, but need to add more fuel, another lander, and a kethane mining/refining system to ferry kethane off Ike.\u003C/p\u003E\u003Cp\u003EMun station: Kethane mining and refining, as proof-of-concept for future missions. The failed designs on the Mun or in orbit are a testament to it being proof of concept! Currently filling the reserves of the fuel station bit by bit.\u003C/p\u003E\u003Cp\u003EEve: Fuel station, kethane mining on Gilly, kerbed exploration and return, and a permanent scientific base on the surface. Status: Preparation and planning.\u003C/p\u003E\u003Cp\u003EJool: Mega mission to the muns and Jool itself. Kerbed exploration, probes, kethane mining and refining, the whole shebang. Status: Planning and design.\u003C/p\u003E\u003Cp\u003EDres: Exploration. Status: Initial planning and calculations.\u003C/p\u003E\u003Cp\u003EMoho: Same as Dres.\u003C/p\u003E\u003Cp\u003EKerbin orbit: Establishment of a fuel station, topped up by munar kethane mining and launches from Kerbin itself.\u003C/p\u003E\u003Cp\u003EGeneral: A set of standardised, generic craft for exploring anywhere, including a compact but effective station design, and Kethane mining systems.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-03-31T00:59:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EvilotionCR2\u0022 data-cite=\u0022EvilotionCR2\u0022\u003E\u003Cdiv\u003EExpanding this puppy with fuel and kethane and RCS modules. I have around 24 fps.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/TySMiMN.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/TySMiMN.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EKerbal for scale!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/YETCpvY.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/YETCpvY.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe view is beatiful up here!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/F8mdKKW.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/F8mdKKW.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat mod is that? I could use those massive computer-melting solar panels.\u003C/p\u003E\n"},{"CreatedByName":"Scaftin","CreatedById":92547,"CreatedDateTime":"2014-03-31T06:53:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EvilotionCR2\u0022 data-cite=\u0022EvilotionCR2\u0022\u003E\u003Cdiv\u003EExpanding this puppy with fuel and kethane and RCS modules. I have around 24 fps.\u003Cp\u003EKerbal for scale!\u003C/p\u003E\u003Cp\u003EThe view is beatiful up here!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EChris: Hey, Dave!\u003C/p\u003E\u003Cp\u003EDave: Yeah?\u003C/p\u003E\u003Cp\u003EChris: Do you think we went a bit overboard on the solar panels?\u003C/p\u003E\u003Cp\u003EDave: Listen, when you\u0027re having a pizza party for the population of India and all you have is mini microwave pizzas, you can complain to me about how we generate power.\u003C/p\u003E\n"},{"CreatedByName":"Kaptain","CreatedById":72984,"CreatedDateTime":"2014-03-31T07:14:51Z","Content":"\n\u003Cp\u003ETrying to dock a fuel/engine to my Eeloo lander and relying on solar power... during an eclipse apparently \u0026gt;.\u0026lt;!!!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.com/a/img819/118/pui1.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imageshack.com/a/img819/118/pui1.png\u003C/a\u003E i finaly got it!\u003C/p\u003E\u003Cp\u003Eidk what im doing with images\u003C/p\u003E\u003Cp\u003Ebut i can build a rocket like mad!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-31T07:45:43Z\u0022 title=\u002203/31/2014 07:45  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 31, 2014\u003C/time\u003E by Kaptain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RogueMason","CreatedById":45069,"CreatedDateTime":"2014-03-31T08:03:01Z","Content":"\n\u003Cp\u003EBuilding a new Kerbin station, expanding a Duna station, and grand tour mission... yeah, big things on my plate at the moment \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-03-31T09:02:04Z","Content":"\n\u003Cp\u003EI recalled all kerbaled missions this weekend in preparation to start a new game, when .23.5 is out. Still one mun retrieval mission to go. But the ARM Pack can come \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EUntil then its replanning my duna mission lander that did not work as intended.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-03-31T09:32:17Z","Content":"\n\u003Cp\u003ETrying to deep sea mine Kethane but trying to get drill to sink....\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-03-31T10:28:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003ETrying to deep sea mine Kethane but trying to get drill to sink....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought about building a grappling harpoon with Kerbal Attachement System, not trying to sink, but to pull the drill down with an arrangement of stacked winches.\u003C/p\u003E\n"},{"CreatedByName":"greg12","CreatedById":56261,"CreatedDateTime":"2014-03-31T10:31:10Z","Content":"\n\u003Cp\u003EYou know guys what would be fun?\u003C/p\u003E\u003Cp\u003EIf the devs would use this thread to comment in one or two sentences what they done in KSP each day. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-03-31T10:58:05Z","Content":"\n\u003Cp\u003EMain project at the moment is the ever expanding projects to routinely get Kerbs to Laythe and back as efficiently as possible.\u003C/p\u003E\u003Cp\u003EThe below is the current leader really, its a spaceplane capable of lifting 5 tons to Kerbin orbit whilst weighing only 12 tons all in. The 5 ton payload is capable of returning a Kerb to Kerbin under Ion power but the burns are a little long. All I then need to do is get that 12 tons to Laythe. . . still optimising the launch / Laythe burn vehicle. I\u0027m also working on a version where the payload is designed to dock to a return thrust vehicle in Laythe orbit for a speedier trip back.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/792938993370117388/8D84F9024EB0047D64D1092CA2A21E5E3039D669/\u0022 alt=\u00228D84F9024EB0047D64D1092CA2A21E5E3039D669\u0022\u003E\u003C/p\u003E\u003Cp\u003ESecond arm of that project is a Single Stage to Laythe spaceplane, the below is on its way to Laythe, should have enough DeltaV to make it there.\u003C/p\u003E\u003Cp\u003ECan\u0027t come back without a refuel however, so I am working on a refueling solution for it to be be delivered to Laythe. . . . this involves soft landing 36 tons without breaking anything, which it turns out is trickier than I though it would be!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/792938993333078706/AEE4E0A9D2C027F0B5B8AD665C92136E63FB2A71/\u0022 alt=\u0022AEE4E0A9D2C027F0B5B8AD665C92136E63FB2A71\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2014-03-31T11:07:53Z","Content":"\n\u003Cp\u003ESince I always wipe my saves when a new patch comes out, this week I have installed every mod I can find just to try them out, without worrying about breaking the game. So far, Interstellar is great!\u003C/p\u003E\n"},{"CreatedByName":"Arctodus","CreatedById":102326,"CreatedDateTime":"2014-03-31T14:46:43Z","Content":"\n\u003Cp\u003EStill currently trying not to blow up. Otherwise, SCIENCE!\u003C/p\u003E\u003Cp\u003EI\u0027m new and going through career at a fairly low pace due to my own time constraints, but I just recently managed a flyby of the Mun - TWICE \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E(and only one of them blew up [200m before touchdown, of course])\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-03-31T17:35:25Z","Content":"\n\u003Cp\u003ECruel and evil things. *Insert Maniacal Laughter*\u003C/p\u003E\n"},{"CreatedByName":"MrZayas1","CreatedById":95654,"CreatedDateTime":"2014-04-01T14:07:51Z","Content":"\n\u003Cp\u003EI haven\u0027t landed on any planetary bodies yet, despite having the game for about 3 months, sadly. But I still enjoy trying out the game in new ways. I know how to dock pretty well, so I want to try an aerial docking like a refueling jetcraft in the sky! I bet it will be a difficult feat, but It is definitely a great thing to try! I can\u0027t wait to get started!\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2015-01-18T21:20:20Z","Content":"\n\u003Cp\u003EBump\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FFFFFF;\u0022\u003E10chars\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dazpoet","CreatedById":132380,"CreatedDateTime":"2015-01-18T21:33:14Z","Content":"\n\u003Cp\u003ECursing at my own stupidity and lack of planning mostly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EHaving unlocked nearly the full tech tree in career I\u0027m now considering leaving the Kerbin system, although I do have some deep space probes in orbit around the sun already waiting for their small coursecorrections to hit other planets. Just got a contract to put a base in orbit around Duna which seems like a worthwhile project.\u003C/p\u003E\u003Cp\u003EAlso started looking at mods for my next save, mostly considering the addition of NearFuture mods and Karbonite but the first seems to still lack an important part for 0.90 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"a2soup","CreatedById":68260,"CreatedDateTime":"2015-01-18T22:05:31Z","Content":"\n\u003Cp\u003EStill playing 0.25, landing repeatedly on Minmus as part of my long quest to perform every possible 0.25 experiment with a single launch. Have already finished the rest of the Kerbol system (which was really fun) and the Mun (God, that was boring). After Minmus, hopefully my two science planes will be able to cover all of Kerbin. \u003C/p\u003E\u003Cp\u003EThis project has gone through several total overhauls and has been all that I\u0027ve been doing in KSP for almost a year now, since I often don\u0027t have much time to play. Seeing it so close to completion is very exciting!\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-01-19T01:26:49Z","Content":"\n\u003Cp\u003EI just finished contract #4 from a single flight out of KSC. I still have a third of my fuel left, so I shouldn\u0027t have any trouble doing another 3 survey contracts, and I\u0027m hoping to punch up to space at some point to get a cool 8 contracts in one flight.\u003C/p\u003E\n"},{"CreatedByName":"xnorb","CreatedById":99549,"CreatedDateTime":"2015-01-19T10:19:12Z","Content":"\n\u003Cp\u003ELanding on Duna.\u003C/p\u003E\u003Cp\u003EJebbediah is currently orbiting Duna but i don\u0027t have enough fuel to land and return.\u003C/p\u003E\u003Cp\u003ELesson learnt, next Duna mission will carry more fuel \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-01-19T12:05:26Z","Content":"\n\u003Cp\u003Eweeeeeeelll... depends on how you define \u0022working on\u0022. I think about designs and doodle stuff on paper almost every day, but I actually rarely fire up the game and build the stuff, mostly because it sucks up time like a black hole* and I\u0027m currently also playing several other games (Dragon age inquisition for one).\u003C/p\u003E\u003Cp\u003EThe doodles/designs I\u0027m currenty doing are for heavy-duty spaceplanes, a large space station and big motherships for multi-planetary and colony-rotation missions. Even though I don\u0027t actually have any colonies, nor I have I ever even gone past Duna or Eve in the actual game. For some reason I always have a tendency to design waaaay beyond what I\u0027m currently capable of.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*note that I know that black holes don\u0027t actually swallow up time but you get my point\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"leopardenthusiast","CreatedById":26084,"CreatedDateTime":"2015-01-20T15:45:25Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i5.minus.com/ir5o2bw8NPmGp.png\u0022 alt=\u0022ir5o2bw8NPmGp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is my Gargantula launch vehicle. I intend to turn it into an asparagus nightmare.\u003C/p\u003E\u003Cp\u003EIt is comprised of two major asparagus blocks. The lower is fairly standard, if large. The upper will fire the Skipper engines as they\u0027re exposed by the Mainsail stages dropping off, and is only built vertically to appease FAR.\u003C/p\u003E\u003Cp\u003EI don\u0027t actually know what I\u0027ll end up launching with it. Probably something big.\u003C/p\u003E\n"},{"CreatedByName":"Itsdavyjones","CreatedById":57605,"CreatedDateTime":"2015-01-20T15:47:29Z","Content":"\n\u003Cp\u003EA manned Munar mission, with two launches, one being the lander, and the other being the crew. Only needed to upgrade the launch pad.\u003C/p\u003E\n"},{"CreatedByName":"rynak","CreatedById":115092,"CreatedDateTime":"2015-01-20T16:16:41Z","Content":"\n\u003Cp\u003EEarly-game light atmospheric plane, to do the various lower tier contracts:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s12.postimg.org/4xo7affb1/kfox.png\u0022 alt=\u0022kfox.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s semi-unstable, but doesn\u0027t tailspin unless you try really hard - despite of the quite excessive pitch authority. Turns as if it were nothing, and has enough rocket fuel to go into the stratosphere. Also plenty of jet fuel. It can deal with leightweight cargo (tested up to 5t), but obviously isn\u0027t made for heavy lifting.\u003C/p\u003E\u003Cp\u003ENow on to designing a proper rover - too bad that stock supplies barely any parts, and most of the mods either supply finished vehicles, or highly specialized parts.\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2015-01-20T16:23:37Z","Content":"\n\u003Cp\u003ENothing, I was doing the money grind to get the third tier research lab but got annoyed with parts resizing so I\u0027m waiting for a tweakscale fix.\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2015-01-20T19:31:26Z","Content":"\n\u003Cp\u003ELaunched the Kerbal Kruiser MK1 to the Jool system. There is a Lander within which will explore Bop, Vall, and Pol before returning to Kerbin. There is also an emergency return escape pod on board capable of return ing the entire crew to Kerbin from Jool if there\u0027s a critical failure.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9p8NmRP.png\u0022 alt=\u00229p8NmRP.png\u0022\u003E\u003C/p\u003E\n"}]}