{"TopicId":64273,"ForumId":32,"TopicTitle":"Precision Landing in atmosphere","CreatedByName":"Kidneythump","CreatedById":62038,"CreatedDateTime":"2014-02-25T23:12:08Z","PageNum":1,"Articles":[{"CreatedByName":"Kidneythump","CreatedById":62038,"CreatedDateTime":"2014-02-25T23:12:08Z","Content":"\n\u003Cp\u003EI was wondering if someone has perfected atmospheric landing? My ship is currently in orbit around Duna with 2 parts (ok maybe 2.5 parts) of a 4 part colony left. By a stroke of luck (and some judicious use of the infinite fuel cheat) I\u0027ve managed to land 2 of the pieces of my colony less than a 100 m from each other. The third part broke on landing sadly and had to be replaced. Is there some good guidelines to follow when attempting to land at the same place every time? I wouldn\u0027t be able to land that close without the fuel cheat since so far it\u0027s taken around 4-5 landings before i get close enough for my CAS pipeline to stick without using a lot amounts of pylons. I\u0027ve set the base as target and tried to burn so that the targetingreticule sits perfectly horizontal and then burning retrograde until lateral movement falls of, this however only gets me to within a couple of kilometers of the target, the rest... well the rest just plain sucks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2014-02-25T23:45:29Z","Content":"\n\u003Cp\u003Efrom my experience with ground bases this is how things typically go...\u003C/p\u003E\u003Cp\u003E1 : the smaller the body you are landing on is, the easier\u003C/p\u003E\u003Cp\u003E2 : always note the rotation speed of your body and what direction by time warping...\u003C/p\u003E\u003Cp\u003E3 : if atmospheric, then get an idea of how thick it is, even if its simply attempting a landing before hand and quick loading....\u003C/p\u003E\u003Cp\u003E4 : get as many of the directional changes done high up, and try to come down at a steep but not vertical angle (like 45 degrees).\u003C/p\u003E\u003Cp\u003E5 : if your target is say 5 km away and you are 5km up in the atmosphere then STOP, make your ship go down vertically..\u003C/p\u003E\u003Cp\u003E6 : trial and error, some people may have better methods than me...\u003C/p\u003E\n"},{"CreatedByName":"Greenspan","CreatedById":101644,"CreatedDateTime":"2014-02-25T23:50:04Z","Content":"\n\u003Cp\u003EIs this a purely ballistic re-entry, or do you have wings/control surfaces, or do you have a decent engine that you use? \u003C/p\u003E\u003Cp\u003EKnowing nothing else I would suggest coming in as steep as possible to reduce the guessing involved with having a large downrange velocity. Other than that, guess, check, reload and try again until you have a system down?\u003C/p\u003E\n"},{"CreatedByName":"Kidneythump","CreatedById":62038,"CreatedDateTime":"2014-02-26T00:04:12Z","Content":"\n\u003Cp\u003EYup you guys are right, I\u0027ve got my orbital trucker \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E plenty of thrust and power, not as much precision as i would like some control surfaces but they\u0027re mostly there to prevent the thing from spinning. It\u0027s my reusable SSTO rocket that delivers the different base parts. I actually managed to land it quite well this time around. I used the same steps you guys mentioned combined with my steps from last time:\u003C/p\u003E\u003Cp\u003E1. Steep curve down towards the base (make sure it actually passes over it, you wanna overshoot to give you time to fine tune your approach\u003C/p\u003E\u003Cp\u003E2. When the marker for one of the base parts hits horizontal burn in the opposite direction until the retrograde marker points directly upwards\u003C/p\u003E\u003Cp\u003E3. Fine tune your approach the farther down you go\u003C/p\u003E\u003Cp\u003E4. Release parachutes set to 5000m\u003C/p\u003E\u003Cp\u003E5. Fine tune again but now with deployed and semi deployed parachutes to provide some inertia dampening\u003C/p\u003E\u003Cp\u003E6. Final burn just above the ground\u003C/p\u003E\u003Cp\u003E7. DOWN! (hopefully not in a to steep slope, that\u0027s what killed the last module)\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2014-02-26T00:10:12Z","Content":"\n\u003Cp\u003EAfter the fifth time the mountains by KSC ate a lander, I decided that splashing into the ocean was perhaps a better idea for me. Whoever put those mountains there is an evil, evil person. I bet they cackled as they did it.\u003C/p\u003E\n"},{"CreatedByName":"Kidneythump","CreatedById":62038,"CreatedDateTime":"2014-02-26T09:16:46Z","Content":"\n\u003Cp\u003EOk that 7 step procedure might work a bit too well actually, for the final part of the base i set my base as target went in for a landing and... landed atop the power plant, so a bit too exact, gonna plant a flag a couple of meters further away and name it landing spot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-02-26T12:14:51Z","Content":"\n\u003Cp\u003EI usually brake into a suborbital trajectory that passes above my target. Then I quicksave and see where it takes me, and then I keep quickloading and adjusting until I\u0027ve landed where I want to land.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-26T12:34:02Z","Content":"\n\u003Cp\u003EMy usual approach:\u003C/p\u003E\u003Cp\u003E1/ set up suborbital trajectory running above the target spot that seems to be reasonably deep at that place\u003C/p\u003E\u003Cp\u003E2/ quicksave\u003C/p\u003E\u003Cp\u003E3/ run it and watch where it landed\u003C/p\u003E\u003Cp\u003E4/ if it\u0027s on the spot then we\u0027re done\u003C/p\u003E\u003Cp\u003E5/ quickload\u003C/p\u003E\u003Cp\u003E6/ adjust height up if it undershot, down if it overshot\u003C/p\u003E\u003Cp\u003E7/ continue from point 2\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2014-02-26T12:37:52Z","Content":"\n\u003Cp\u003EFor Duna you can just get your periapsis at 10-14 km above the target site and when approaching it just kill the rest of lateral velocity with your engines and then perform your normal landing ignoring the atmosphere. Or make a steeper suborbital trajectory so that it passes about 5-10 km above the landing site. This atmosphere is not really worth it if you don\u0027t go for too many chutes.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-02-26T17:08:19Z","Content":"\n\u003Cp\u003EMechjeb does prediction of the landing location, taking atmospheric drag into account. \u003C/p\u003E\u003Cp\u003EAlternatives are to calculate by hand (way over most people\u0027s head), or to do lots of trial and error.\u003C/p\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2014-02-26T17:25:00Z","Content":"\n\u003Cp\u003EOrbital track over target, reduce periapsis so you\u0027d hit the planet slightly past the target. Brake to a horizontal stop reasonably above the target. Align yourself to point at the target and correct your direction, rinse and repeat, land. All you need is a modest delta-v excess for course correction.\u003C/p\u003E\n"},{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2014-02-26T17:40:07Z","Content":"\n\u003Cp\u003EI usually do a quick warp to see how fast the planet or moon rotation is, relative to my orbital movement. Then commit a de-orbit with the terminator landing slightly ahead of where I estimate the planet\u0027s rotation will have me landing.\u003C/p\u003E\u003Cp\u003EIf it\u0027s in atmosphere, such as at Kerbin, (and assuming I\u0027m trying to land at the KSC), I\u0027ll commit the de-orbit to terminate a short distance out into the bay, as I\u0027m currently flying over the continent to the west of the KSC. Descent angle doesn\u0027t matter too much if I\u0027m using a craft with lots of lift and maneuverability, but if it\u0027s a sky slug, I\u0027ll make the approach pretty shallow, and extend the terminator farther out into the bay, attempting to account for the drastic reduction that will result from dropping into the lower atmosphere.\u003C/p\u003E\u003Cp\u003EUsually, I wind up transitioning to powered descent in the foothills just west of the space center grounds, just in time to line up with the runway and get the gear dropped as I cross the ridge at the edge of the space center proper.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-02-26T18:12:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greenspan\u0022 data-cite=\u0022Greenspan\u0022\u003E\u003Cdiv\u003EIs this a purely ballistic re-entry, or do you have wings/control surfaces, or do you have a decent engine that you use? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s my recommendation. Get an airfoil. \u003C/p\u003E\u003Cp\u003EAnd as someone else recommended, Mechjeb makes landing calculations.\u003C/p\u003E\n"},{"CreatedByName":"Kidneythump","CreatedById":62038,"CreatedDateTime":"2014-02-26T19:54:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003EMechjeb does prediction of the landing location, taking atmospheric drag into account. \u003Cp\u003EAlternatives are to calculate by hand (way over most people\u0027s head), or to do lots of trial and error.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I admire all the work behind mechjeb I\u0027m firmly in the not use category of players, I\u0027d rather rough it than use it actually, I tend to rely on it to much and that pretty much kills the game for me, stuff becomes trivial. The procedure I\u0027ve worked out so far works very well, provided you\u0027ve got some margins when it comes to landing your payload but I\u0027m working on a KSPI jet lander at the moment, hopefully fuel will become a much smaller problem with it.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EOh and for the record so far I\u0027ve only quickloaded once, when i landed on the powerplant \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-02-26T19:58:43Z","Content":"\n\u003Cp\u003ETheres a powerplant?\u003C/p\u003E\n"},{"CreatedByName":"Noticeably FAT","CreatedById":43401,"CreatedDateTime":"2014-02-26T20:01:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kidneythump\u0022 data-cite=\u0022Kidneythump\u0022\u003E\u003Cdiv\u003EWstuff becomes trivial.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why I use it. Or more specifically, I use it on the stuff that has become trivial. I rarely do a manual ascent/circularization anymore, it\u0027s just not that entertaining to me. Same for interplanetary burns, I\u0027ll set up the maneuver myself to get what I want, then let MJ handle it from there. \u003C/p\u003E\u003Cp\u003EThere\u0027s so much fun stuff to do in the game, so I use MJ to fast-forward through the boring parts.\u003C/p\u003E\n"},{"CreatedByName":"Kidneythump","CreatedById":62038,"CreatedDateTime":"2014-02-27T00:04:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4rt14n\u0022 data-cite=\u0022m4rt14n\u0022\u003E\u003Cdiv\u003ETheres a powerplant?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, KSP interstellar\u0027s got nuclear reactors and stuff \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E this one has a tendency to overheat so i need to add some kind of pylon with extra radiators that i then hook up to my base using pipes from KAS\u003C/p\u003E\n"}]}