{"TopicId":64920,"ForumId":32,"TopicTitle":"Better mod support coming soon?","CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-03-05T04:59:45Z","PageNum":1,"Articles":[{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-03-05T04:59:45Z","Content":"\n\u003Cp\u003ESo the official thread hasn\u0027t appeared so I will bring this up. Maxmaps mentioned that he was talking with a person about \u0022productive talk with a possible mod platform provider.\u0022 What could this mean? Does anyone have experience with these types of things? My mind is going wild!\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2014-03-05T05:16:59Z","Content":"\n\u003Cp\u003ENot sure, but wasn\u0027t there talk a while ago about integrating Spaceport with the launcher?\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-03-05T05:24:05Z","Content":"\n\u003Cp\u003EThat was a long time ago, before the launcher was implemented. No, I believe that the OP is referring to a SQUADcast a couple of weeks ago when maxmaps, yarg and rowsdower were talking about some of the 0.24 updates, along with an interview from HarvestR. AFAIK, Harv said he was talking to chad about a toolbar in the Mission Control where you would be able to manage contracts, money, rep, addons, etc. He also said that they think it might be possible to allow for support of third party addons, along with official DLC.\u003C/p\u003E\u003Cp\u003E(If I Recall Correctly, that is.)\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-03-05T06:18:29Z","Content":"\n\u003Cp\u003EWell the specific quote that I used is from today\u0027s devnotes. I was wondering if anyone had any further ideas on the issue, or what It might mean. \u003C/p\u003E\u003Cp\u003E@Deathsoul097, that\u0027s also nice to know!\u003C/p\u003E\n"},{"CreatedByName":"cryptk","CreatedById":97237,"CreatedDateTime":"2014-03-06T10:19:51Z","Content":"\n\u003Cp\u003EI am thinking that it might be something more along the lines with partnering with someone like curse.com to replace the spaceport. This would allow for a desktop client to install addons and keep them up-to-date.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-03-06T10:36:03Z","Content":"\n\u003Cp\u003EWasnt it about this?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71133-Community-Mod-Repository-and-The-Majiir-Challenge\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/71133-Community-Mod-Repository-and-The-Majiir-Challenge\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"cryptk","CreatedById":97237,"CreatedDateTime":"2014-03-06T13:41:14Z","Content":"\n\u003Cp\u003EI don\u0027t think that their DevNote was about that. Squad hasn\u0027t approached Majiir about it (at least not that Majiir has indicated), even though he has offered to talk with them about it on a few occasions. I think them working with someone like Curse or Nexus would be more likely.\u003C/p\u003E\u003Cp\u003EThat said, I just read all 10 pages of that thread since I hadn\u0027t heard of it before, and I am feeling motivated... only problem is finding the time... it would be quite an undertaking.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-03-06T13:51:41Z","Content":"\n\u003Cp\u003EHopefully this isn\u0027t going to end up being something forgeloader that you have to edit code in order to get mods to work. I would rather it be like curse.com where you can download what you want, or install their client to keep it up to date. I like the older ways of moding games, some of these new ones just make it a pain to get them to work. I guess if you run a lot of mods thos things might be better, but some, myself included, run less than 5 mods and I can place them in the mods folder by myself.....it isn\u0027t hard.\u003C/p\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2014-03-06T15:34:37Z","Content":"\n\u003Cp\u003EBetter support than allowing mods run execute C? That\u0027s hard to find.\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-03-06T16:28:12Z","Content":"\n\u003Cp\u003EI like the steam workshop. Used it a lot for Skyrim mods with no problems. I don\u0027t use mods with KSP because I hate the update problems with every game update.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-03-06T17:50:19Z","Content":"\n\u003Cp\u003EI want to be able to enable and disable mods instantly, especially when troubleshooting\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2014-03-06T18:19:45Z","Content":"\n\u003Cp\u003EHaven\u0027t heard anything recently about spaceport 2...\u003C/p\u003E\u003Cp\u003Ewe were supposed to be able to find and download and activate and deactivate mods and ships in game without having to restart KSP... And no info on how development of that have been going has been said for several months now. \u003C/p\u003E\u003Cp\u003ESo maybe they\u0027re looking to farm this out to someone else OP? Don\u0027t know.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-03-06T18:34:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Javster\u0022 data-cite=\u0022Javster\u0022\u003E\u003Cdiv\u003EI want to be able to enable and disable mods instantly, especially when troubleshooting\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think this would be great as well. When I created the OP, thoughts of something like an official mod controller. Features might include being able to update mods without having to track down a mod, disabling mods in game (or at least via a program), and the like. My mind is going wild now so I will stop \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-03-06T20:43:24Z","Content":"\n\u003Cp\u003ESpaceport 2 seems to have been shelved, we went from weekly updates on progress to nothing. But from reading this weeks devnote it sounded to me like they were looking at a 3rd part hosting service, something like Steam workshop (the obvious choice) or Nexus mods. I\u0027d love to see a fully integrated spaceport 2, accessible in game, but on the other hand it would make sense for Squad to outsource mod hosting to people who are already good at it and focus on designing game content.\u003C/p\u003E\u003Cp\u003EEither way spaceport is badly in need of a replacement so I\u0027m glad Squad are working on this subject.\u003C/p\u003E\n"},{"CreatedByName":"Alex_Leonardo","CreatedById":56762,"CreatedDateTime":"2014-03-06T20:48:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022timsfitz\u0022 data-cite=\u0022timsfitz\u0022\u003E\u003Cdiv\u003EI like the steam workshop. Used it a lot for Skyrim mods with no problems. I don\u0027t use mods with KSP because I hate the update problems with every game update.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not happening. It\u0027s because this game isn\u0027t steam only and the majority chooses regular download.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-03-07T00:00:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alex_Leonardo\u0022 data-cite=\u0022Alex_Leonardo\u0022\u003E\u003Cdiv\u003EThat\u0027s not happening. It\u0027s because this game isn\u0027t steam only and the majority chooses regular download.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf modding is made to be steam-friendly, I could see it. Still, I agree that another option would be better. Hopefully it will be a first-party solution that reduces outside dependance.\u003C/p\u003E\n"},{"CreatedByName":"epicbuilder333","CreatedById":78798,"CreatedDateTime":"2014-03-07T00:43:45Z","Content":"\n\u003Cp\u003EI wouldn\u0027t be surpised if its for the Steam Workshop.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-03-07T00:47:20Z","Content":"\n\u003Cp\u003E\u0022productive talk with a possible mod platform provider\u0022\u003C/p\u003E\u003Cp\u003EIt\u0027s obviously about a replacement for the Spaceport.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-03-07T01:42:22Z","Content":"\n\u003Cp\u003EI hope it\u0027s not something like Nexus. I don\u0027t want to have to try and support someone\u0027s mod manager in addition to my mods, and I\u0027m not sure it\u0027s a great idea for users to have no idea what happens with the mods they \u0022install\u0022 (can you even call copying over a folder an installation?).\u003C/p\u003E\u003Cp\u003EI wish they\u0027d just get in contact with the big modders and ask what we want / need. If whatever they create doesn\u0027t meet our needs / wants, it\u0027ll probably not end up being supported as fully by the modding community. The worst case scenario is that it\u0027s bad enough that none of us want to deal with it and try to prevent our mods from being distributed / managed / whatever with that system.\u003C/p\u003E\u003Cp\u003EWhatever the case, if their \u0022better mod support\u0022 thing involves any type of Squad-produced mod manager they\u0027re going to have to provide support for modded installs, or else it becomes impossible to get any support for the mod manager; the only time bugs in the manager will appear is if someone installs mods, which means under the current setup that they don\u0027t get any support. So then modders would end up having to support Squad\u0027s code, even though we have no idea what\u0027s going on in there; the end result is that we\u0027ll just have to tell users to never use Squad\u0027s mod manager and that users will be more annoyed with both Squad (for lack of support) and with us (for be unwilling to use the \u0022better mod support\u0022 mod manager). A mod manager \u003Cem\u003Emust\u003C/em\u003E come with official support for modded installs or else there should be an explicit statement that the mod manager will not be supported, since that\u0027s what will end up happening in practice.\u003C/p\u003E\u003Cp\u003ESuffice to say, I\u0027m skeptical, since I expect this system to be driven primarily by user demands with less consideration given to modders. The last time something like this was tried, where the modders were only brought in near the end was SpacePort, and we can see how that turned out; why shouldn\u0027t I expect the same to happen again?\u003C/p\u003E\n"}]}