{"TopicId":65080,"ForumId":32,"TopicTitle":"Ever just.. quit the game?","CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-03-07T05:16:02Z","PageNum":4,"Articles":[{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-07-06T17:31:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EHow do people even find threads to necro?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf decent content is posted insteat of \u0022\u002B1!\u0022 then it\u0027s not so bad, it\u0027s a guideline rather than a rule.\u003C/p\u003E\u003Cp\u003EAlso, I do get bored of the current version of KSP from time to time, and I go back to 0.13.3 to land on the old Mun again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-07-06T18:02:32Z","Content":"\n\u003Cp\u003EI\u0027m still finding lots fun in KSP, though sometimes I\u0027ll take a day or two off from the game to do something else.\u003C/p\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2014-07-06T18:33:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kyrian\u0022 data-cite=\u0022Kyrian\u0022\u003E\u003Cdiv\u003ENo.\u003Cp\u003E\u003Cspan style=\u0022color:#ffffff;\u0022\u003EShame you\u0027ve deleted it. You will be back, I know you will. When the game is updated more, maybe 0.28 or something, you\u0027ll regret deleting it at 0.23. Much more is to come. Many good things.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are some people who do not care about career contracts and money.\u003C/p\u003E\n"},{"CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2014-07-06T18:45:33Z","Content":"\n\u003Cp\u003EI quit the game to play other games, this one grew boring.\u003C/p\u003E\n"},{"CreatedByName":"Tripzter","CreatedById":75335,"CreatedDateTime":"2014-07-06T18:57:30Z","Content":"\n\u003Cp\u003EI take a break, as in a month, or two but i never delete my save data. I keep that backed up on my external hard drive.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-07-06T19:04:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EYes, I have been fed up with it a while ago. Did not play for a couple of months and then returned. Now I have pretty much the same, although now it is due to external factors.\u003Cp\u003EIt\u0027s nice to take a pause every once in awhile - you burn through the game and your interest too quickly otherwise.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to agree with this statement. With anything you will get bored of it with time, however if you play it in short bursts it does help. I know when I got burned out/frustrated with not being able to do something in game I just stopped playing. After about a month long break I came back and found out what my issue was and now I am enjoying it yet again. I have often wondered how people do not burn out on COD type game, to me they seem like the exact same thing in a new box (but that is just me). I know this is a bit old of thread but it is still valid for anyone having burn out on the game, take a break and come back when there is something new to play around on.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-07-06T19:13:22Z","Content":"\n\u003Cp\u003EWhat was killing ksp for me more then anything was having to constantly tip toe around the data limit. Now that may be a thing of the past so that\u0027s a huge plus.\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2014-07-06T21:35:13Z","Content":"\n\u003Cp\u003ETaking a break is part of being a KSP gamer \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I usually fire it up once a week and tinker around for an hour or two to keep my skills sharp though. Once .24 drops, I will probably be back to full-swing on KSP again.\u003C/p\u003E\n"},{"CreatedByName":"syfyguy64","CreatedById":47714,"CreatedDateTime":"2014-07-07T03:09:08Z","Content":"\n\u003Cp\u003EI\u0027m in the middle of that phase. I play for a while, have fun, then I realize that I\u0027m doing the same thing over and over again, so I just stop playing. I play games like War Thunder, ArmA, and sandbox shooters like Just Cause 2 for maybe 2-3 months before I come to the forums, and see something someone has made that I want to do, or KSP is updated. This will repeat for a few years, at least for me. I don\u0027t plan on playing PC games all my life.\u003C/p\u003E\u003Cp\u003EAlso, the game just seems... Lacking. There are never enough parts to use for building, planes are fun to fly once for 10 minutes, and doing missions to the mun is just labor to me. There\u0027s just nothing that has a random chance of happening, nothing unpredictable. This is why I don\u0027t enjoy singleplayer games to the fullest, because you can predict what the game will do. Take War Thunder for example. You\u0027re more likely to play in multiplayer rather than missions because people are unpredictable. It\u0027s fun like that, not knowing what will happen. In the single player missions, you know you\u0027ll just have to pilot a fighter and shoot down bombers/enemies with allies buzzing around. The AI isn\u0027t smart enough to follow you exactly, so dogfights aren\u0027t fun.\u003C/p\u003E\u003Cp\u003EThat\u0027s probably why this game makes me and others lose interest. We don\u0027t have patience to build giant space stations, and we do the same thing time after time again, nothing changing except for minute details. But if multiplayer is added to the game, then I will likely have a lot more fun, because I\u0027ll always have the risk of someone flying a rocket into my plane. Or someone to build a colony on the mun with, or do something I can\u0027t with the stock game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-07T03:17:47Z\u0022 title=\u002207/07/2014 03:17  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 7, 2014\u003C/time\u003E by syfyguy64\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cwhiz","CreatedById":109362,"CreatedDateTime":"2014-07-07T05:40:29Z","Content":"\n\u003Cp\u003EHey man it happens. The important thing for me is that I got my moneys worth in terms of entertainment value. This has undoubtedly been the case with KSP for me. \u003C/p\u003E\u003Cp\u003EAnd who knows. I may be back eventually since I like to relive old experiences years down the line. I could totally see myself coming back to KSP in 5-10 years when other games have improved on the space-tycoon concept and reveling in the nostalgia. \u003C/p\u003E\u003Cp\u003EGood times.\u003C/p\u003E\n"},{"CreatedByName":"cpast","CreatedById":112846,"CreatedDateTime":"2014-07-07T05:43:14Z","Content":"\n\u003Cp\u003EI currently seem to be on a break from the game - I\u0027ve tried launching, but always stop before clicking \u0022play\u0022 because I\u0027m just not horribly motivated to click it. I suspect it\u0027ll pass, though. Even if I don\u0027t return for some reason, I bought the game for 2 hours of pay, and have gotten well over 500 hours of gameplay out of it - I could literally play 24/7 for a week per hour of labor it cost me. I count that as a win.\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-07-07T20:57:06Z","Content":"\n\u003Cp\u003EYeah I haven\u0027t touched it since April. I more or less get burnt out a week or two after every update now. The new elements will keep my attention for a bit but ultimately I get to a point where I just ask myself why I\u0027m launching this thing. I\u0027ve done everything I set out to do, unlocked all the parts, I\u0027ve been everywhere. I guess I\u0027ve run out of \u0027content\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2014-07-07T21:40:08Z","Content":"\n\u003Cp\u003EAs the player, you have the ability to make the game as challenging as you want to make it for yourself. Several months ago (before the ARM update), I decided i was going to try conquering the solar system without using fuel lines. I did not succeed, but I learned a heck of a lot about building efficient rockets! Make your own challenges if you\u0027re bored \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WillHop","CreatedById":67486,"CreatedDateTime":"2014-07-07T21:45:00Z","Content":"\n\u003Cp\u003EI go through phases of KSP mania and general burnout. Usually with other games this happens relatively quickly and I lose interest - with KSP I just hit my 500th hour. It\u0027s an amazing game but playing it so much at once can ruin the experience for me, and usually a new update reignites my interest for a little while.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-07-07T21:46:34Z","Content":"\n\u003Cp\u003EI have taken short breaks occasionally, but I just love the game too much!\u003C/p\u003E\n"},{"CreatedByName":"Jon Tash","CreatedById":2681,"CreatedDateTime":"2014-07-07T21:54:42Z","Content":"\n\u003Cp\u003EI don\u0027t think I will ever quit KSP, I mean how can I quit space? For goodness sake, it\u0027s SPACE!!!\u003C/p\u003E\u003Cp\u003EI may take breaks of couple of months here and there but I\u0027ll always come back.\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2014-07-07T22:33:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jon Tash\u0022 data-cite=\u0022Jon Tash\u0022\u003E\u003Cdiv\u003EI don\u0027t think I will ever quit KSP, I mean how can I quit space? For goodness sake, it\u0027s SPACE!!!\u003Cp\u003EI may take breaks of couple of months here and there but I\u0027ll always come back.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly, not many games have a sandbox the size of a solar system \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2014-07-08T01:54:58Z","Content":"\n\u003Cp\u003EI only play KSP when\u003C/p\u003E\u003Cp\u003Ea) There\u0027s a \u0022This day back in 1957\u0022 kind of thing going on, and I\u0027d like to build a \u0022re-enactment\u0022 of that in KSP\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E There\u0027s a new update\u003C/p\u003E\u003Cp\u003EI am too busy in real life to play it everyday \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (that and I have other games that I play too) So it does kind of feel like I \u0022quit\u0022 KSP for extended periods in time, unless a or b happens.\u003C/p\u003E\u003Cp\u003EAnd every time I \u0022come back\u0022? ...MAGIC \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-08T01:58:15Z\u0022 title=\u002207/08/2014 01:58  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 8, 2014\u003C/time\u003E by rodion_herrera\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-07-08T04:58:16Z","Content":"\n\u003Cp\u003EMy defintion of quitting the game is \u0022scope-complete\u0022 by now. Which means that I don\u0027t even open the game to avoid quitting it at a later time.\u003C/p\u003E\n"},{"CreatedByName":"OgreMagi","CreatedById":103767,"CreatedDateTime":"2014-07-08T06:13:07Z","Content":"\n\u003Cp\u003ENo, but taking a break is usually a good idea. FUN that\u0027s the underlying principle, if its a chore then take a break other wise whatever you accomplish in the game will not be worth anything.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-08T06:18:30Z","Content":"\n\u003Cp\u003EThere is so many great games out there that it\u0027s natural you eventually move on - otherwise you\u0027ll never see other worlds that possibly might be by far better.\u003C/p\u003E\u003Cp\u003EBut on the other hand it\u0027s natural to come back to the old titles that you enjoyed when time permits it, and so far KSP has been a great fun - when I\u0027ll quit it eventually I will be back for sure \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-07-08T07:37:35Z","Content":"\n\u003Cp\u003EI am in the middle of my Jool-5 mission, but I cannot get myself to keep at it right now.\u003C/p\u003E\u003Cp\u003EBut it is OK, even if I carry my design over to .24, I will finish it eventually. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EUntil then I am plowing deep into planets in the search for coal and diamonds and enjoy a different view for a while. (Starbound)\u003C/p\u003E\u003Cp\u003ECya Jeb, until we (soon)TM meet again. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"johnnyhandsome","CreatedById":59580,"CreatedDateTime":"2014-07-08T16:40:14Z","Content":"\n\u003Cp\u003EOh yeah there\u0027s been crashes or a messed up mission that have made me quit. My first rover landing on Moho needed just 5 more seconds of fuel, before crashing and damaging wheels. I quit the hell out of this game that day, you bet.\u003C/p\u003E\u003Cp\u003EThen cam crawling back, wanting to \u0022do it right this time\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Darthzeus","CreatedById":113477,"CreatedDateTime":"2014-07-08T17:59:13Z","Content":"\n\u003Cp\u003EIn a game of design, redesign, and careful planning in mathematics, maybe it\u0027s not your place if you\u0027re one to ragequit over mods. I have recently taking up modding myself, and have lost 4 days now to just goofing around and bugfixing the ridiculous things that do wrong. Personally, I see the modding setup as a reflection on the game itself, nothing will work the first time, it will take along time, many tries, and a lot of effort to get things done, but it is a very rewarding experience. I\u0027m sorry you feel this way, and hope you can find a new game to play more suitable for your tastes.\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2014-07-12T13:51:17Z","Content":"\n\u003Cp\u003EYep, for about four months. I think it was in 0.22. Anyway I decided to try using Infernal Robotics and Kerbal Attach System. I spent maybe 50 hours designing a huge permanent Munar colony, cranes to assemble it, space trucks to haul the components from LKO to Mun orbit, and so on. Then many more hours were spent testing and revising everything, as I was playing Ironman and once the actual launches started, no loads or restarts were allowed.\u003C/p\u003E\u003Cp\u003EThe whole thing filled eight 60-tonne payloads. I got them all landed and my colony assembled without losing a single module or Kerbal, though there sure was a lot of last-second improvising! It was magnificent, and immediately started falling apart. Parts would randomly move, or even just vanish. The station modules were on telescoping legs, and every time I opened that mission every leg would be a different length. Then, I think it was the third day, the whole station just exploded. Loaded yesterday\u0027s savefile, and that station exploded too. Loaded my oldest savefile, and that time it didn\u0027t explode for several whole minutes.\u003C/p\u003E\u003Cp\u003EI didn\u0027t touch KSP again until 0.23. Still haven\u0027t touched IR or KAS again, though I may try again as I hear they\u0027re more reliable now.\u003C/p\u003E\u003Cp\u003E//not intended as an insult to KSP, IR or KAS. I spent my whole career in IT. I know what \u0022alpha\u0022 means. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}