{"TopicId":66049,"ForumId":32,"TopicTitle":"Debris - Community Care Factor Poll","CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-03-17T11:29:50Z","PageNum":3,"Articles":[{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-03-18T14:23:03Z","Content":"\n\u003Cp\u003EI try to avoid it, mostly in designing rockets so they do the last 2-400 m/s of circulate with the transfer stage. Some missions leave debris like the first mun and minus missions and Moho missions.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-03-18T14:31:22Z","Content":"\n\u003Cp\u003EI just go to the tracking station to get rid of it. May change come 0.24, when I have to take money into account.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2014-03-18T14:56:44Z","Content":"\n\u003Cp\u003EI avoid it when possible, but I\u0027m not super careful about it\u003C/p\u003E\u003Cp\u003EI don\u0027t get much debris in LKO, but I\u0027ll sometimes have boosters that I drop off during a burn away from Kerbin\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2014-03-18T19:27:26Z","Content":"\n\u003Cp\u003EI do a mix. If I can get stuff to drop cleanly then I\u0027ll drop them even if there\u0027s a bit of fuel left. Refueling tankers I de-orbit. Big stuff I send deep leaves a debris wake that I clean up from KSP. Debris that\u0027s leaving the system stays in so I can see where it ends up.\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-03-18T19:33:21Z","Content":"\n\u003Cp\u003EI have a station in orbit designed to house missile to \u0022de-orbit debris\u0022\u003C/p\u003E\u003Cp\u003EBut its not fully functional yet so the sky is slowly filling up with deadly objects Haha.\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2014-03-18T19:40:56Z","Content":"\n\u003Cp\u003EWell, I do 3 primary kinds of missions:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1. Monolithic:\u003C/strong\u003E Single-launch, single-purpose. All lifter components are sub-orbital and are left to impact the ground. Anything that leaves Kerbin orbit tends to stay there (though I try not to leave debris around the Mun, because that\u0027s a common destination for me). Not all pieces come back home, but those that don\u0027t are left to drift in solar orbit.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2. Multi-part:\u003C/strong\u003E Multiple launches, multiple components, assembly on-orbit: Each component has a \u0022construction frame\u0022 stage, which is basically an orbital maneuvering system and structural bracing. The component might be inert, or a set of fuel tanks, or even a set of engines. The component is attached to the ship, and the construction frame is deorbited. Like before, not every piece of the mission (if it\u0027s an exploration ship) will come back to Kerbin, and those that don\u0027t are left to drift. I like to leave the primary components in solar orbit, as memorials to the mission.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3. Specialized:\u003C/strong\u003E If I\u0027m launching a more unusual piece of hardware, such as a building or a large rover, I try to keep my LKO clean, but I tend to leave a wake of components outside of LKO, and especially around the target body. Colony hardware especially tends to be messy after landing (as my colonies lean towards \u0022rather large\u0022), so I designate a \u0022junkyard\u0022 area a few km from the primary colony site, which I use as a landing area/disposal site for unnecessary/broken hardware. KAS tends to be rather useful for moving broken/spent stuff to it.\u003C/p\u003E\u003Cp\u003EHowever, I never terminate a piece of debris. If it\u0027s up, I either leave it or bring it down.\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2014-03-19T04:41:18Z","Content":"\n\u003Cp\u003EIm pretty neurotic about this haha. Ive got a few bits ditched in interplanetary space but nothing near kerbin. Everything is deorbited and chuted for re-use. I even built a big spacebroom rig one time when some lower-stage boosters accidentally made into orbit.\u003C/p\u003E\n"},{"CreatedByName":"Amaroq","CreatedById":57607,"CreatedDateTime":"2014-03-20T17:25:33Z","Content":"\n\u003Cp\u003EI\u0027m compromising my ideal for performance. In practice what I have is: \u003C/p\u003E\u003Cp\u003ESlider low, but not off. \u003C/p\u003E\u003Cp\u003EI design lifters such that my lift stage runs out of delta-V while its Periapsis is still just barely atmospheric, and ditch fairings, etc, at the same point in the launch so that either a.) the game de-clutters them by itself, or b.) I can declare \u0022burned up in re-entry\u0022 and delete the debris without worry.\u003C/p\u003E\u003Cp\u003EI periodically \u0022clean up\u0022 my save-file by hand-edit, typically removing any of the following:\u003C/p\u003E\u003Cp\u003E 1. Debris which should be subject to atmospheric drag at periapsis\u003C/p\u003E\u003Cp\u003E 2. Debris which is crash-landed on any surface* .. (save \u0022museum\u0022 pieces)\u003C/p\u003E\u003Cp\u003E 3. Decoupler debris (e.g., those \u0022separator\u0022 rings, etc., which I rationalize as \u0022self-consuming at use.\u0022)\u003C/p\u003E\u003Cp\u003E 4. Tiny accidental debris (single-part for which the odds of it coming into play are minimal)\u003C/p\u003E\u003Cp\u003EFor anything larger, I typically mount it with at least a docking port, and often a command pod. I\u0027ll \u0022rename\u0022 it to debris, but leave it out there, and either get to cleaning it up, or deal with the clutter.\u003C/p\u003E\u003Cp\u003EI\u0027ve still never even had a near-miss with an active craft -- in practice even a minor difference in inclination or eccentricity all but guarantees no-impact.\u003C/p\u003E\n"},{"CreatedByName":"TranquilTempest","CreatedById":18141,"CreatedDateTime":"2014-03-20T17:49:11Z","Content":"\n\u003Cp\u003EI keep standard parking orbits clean, but transfer orbits have some debris.\u003C/p\u003E\n"},{"CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2014-03-20T17:49:35Z","Content":"\n\u003Cp\u003EI\u0027ve got about 170 pieces of debris in orbit, most around 80K. I am too impatient to worry about \u0027clean\u0027 designs or clean up missions. I have had two collisions with debris on missions when trying to circularize after liftoff, and found it quite impressive and hilarious! Since then I boost up to 90K before starting to stabilize orbit. Not as efficient, but the price I have to pay for my prior carelessness.\u003C/p\u003E\u003Cp\u003EI\u0027m thinking when I start a new career save when .24 comes out I will change my principles to account for debris management. I will keep persistent debris on, and not magically clean up from the tracking station, the more realism the better for me.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-03-20T17:56:30Z","Content":"\n\u003Cp\u003EI love debris. Seriously. \u003C/p\u003E\u003Cp\u003EIts like a trophy, when i switch map to debris view i see all remnnts of my early space progrm missions, its so nostalgic.\u003C/p\u003E\u003Cp\u003ESo, i never clean up.\u003C/p\u003E\n"},{"CreatedByName":"Daddy Cecil","CreatedById":59121,"CreatedDateTime":"2014-03-20T18:06:00Z","Content":"\n\u003Cp\u003EWhat is this \u0022waste collection\u0022 in space you speak of? I am a true orbital litterbug, usually leaving upper/transfer combo stages in orbit, and my heavy SSTO lifters into orbit. Yes, I have boosters that can get into orbit on their own.\u003C/p\u003E\n"},{"CreatedByName":"Navy2k","CreatedById":95246,"CreatedDateTime":"2014-03-20T18:10:58Z","Content":"\n\u003Cp\u003EJust make it less pain to clean up the mess, so no more 3 klicks half a monitor away.\u003C/p\u003E\u003Cp\u003EGreetings\u003C/p\u003E\u003Cp\u003EBen\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-03-20T21:29:47Z","Content":"\n\u003Cp\u003EI leave debris in orbit as much as possible - fairings, spent stages, decouplers, etc. Here\u0027s why: I want to see a piece of debris smash into something at orbital velocity. The best I\u0027ve done so far is about 3km away. I sometimes launch ships retrograde just to add a little fun in there. \u003C/p\u003E\u003Cp\u003EUpdates always wipe out all the debris, and that\u0027s good enough for me.\u003C/p\u003E\n"},{"CreatedByName":"jose.villegas","CreatedById":106298,"CreatedDateTime":"2014-03-20T21:31:02Z","Content":"\n\u003Cp\u003EI wish debris could add up without damaging performance.\u003C/p\u003E\n"},{"CreatedByName":"jaredkzr","CreatedById":73023,"CreatedDateTime":"2014-03-21T12:04:49Z","Content":"\n\u003Cp\u003EI see debris in a similar light as to flags. They mark where I\u0027ve been and where I\u0027ve attempted to go. In career, I like to spice things up by populating Kerbin\u0027s orbits with debris so that I have to put more thought into where I place stations, satellites, etc.\u003C/p\u003E\n"},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2014-03-21T14:16:13Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://kuvaton.com/k/yQKQ.jpg\u0022 alt=\u0022yQKQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh and yes... here are the satellites that have yet to turn into debris:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://kuvaton.com/k/yQKl.jpg\u0022 alt=\u0022yQKl.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-03-22T01:18:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EIn career I have a bunch of debris about in orbit. Since I haven\u0027t unlocked probes, deorbiting\u0027s not very practical.\u003C/div\u003E\u003C/blockquote\u003EI need to retract this statement. Today I had Jeb deorbit the third stage of his rocket, in his own BadS fashion.\u003Cp\u003E1: Move from the main command pod in the payload to one of the auxilliary pods in the third stage. Said pods are just there as weak reaction wheels, since I\u0027ve not unlocked proper reaction wheels, so are normally unoccupied.\u003C/p\u003E\u003Cp\u003E2: Separate from the payload.\u003C/p\u003E\u003Cp\u003E3: Burn retrograde just enough to deorbit the third stage.\u003C/p\u003E\u003Cp\u003E4: Get out, re-establish a stable orbit in EVA, and spacewalk back to the payload.\u003C/p\u003E\n"},{"CreatedByName":"Unit327","CreatedById":90967,"CreatedDateTime":"2014-04-04T05:24:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dkmdlb\u0022 data-cite=\u0022Dkmdlb\u0022\u003E\u003Cdiv\u003EI leave debris in orbit as much as possible - fairings, spent stages, decouplers, etc. Here\u0027s why: I want to see a piece of debris smash into something at orbital velocity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been making \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/74382-0-23-5-WIP-Plugin-Kessler-chaos-space-debris-clouds\u0022 rel=\u0022external nofollow\u0022\u003Ea mod\u003C/a\u003E just for people like you.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/5y9Nr8M51sA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-04T05:27:26Z","Content":"\n\u003Cp\u003EBecause of performance I keep the Debris to minimal.. That will include unloading accidents if I have too.. I keep some debris going.. But clean house every once in awhile.\u003C/p\u003E\n"},{"CreatedByName":"Twreed87","CreatedById":50017,"CreatedDateTime":"2014-04-04T05:33:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EI love debris. Seriously. \u003Cp\u003EIts like a trophy, when i switch map to debris view i see all remnnts of my early space progrm missions, its so nostalgic.\u003C/p\u003E\u003Cp\u003ESo, i never clean up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgree with this. Before you could hide debris in map view, it was a pain. But now that I can hide it, I love turning it on and seeing the trail I\u0027ve left throughout the solar system.\u003C/p\u003E\n"},{"CreatedByName":"sickboy","CreatedById":32225,"CreatedDateTime":"2014-04-04T05:39:41Z","Content":"\n\u003Cp\u003EI love to have all that debris around, I never really hit it since my parking orbit 75 KM and anything I\u0027m leaving in orbit for longer than 1 orbit is gonna be higher than that, odds of me hitting a debris there is quite unlikely. I don\u0027t have as much on my current save but on my previous one if I was at 75 KM altitude or nearby, I could usually always see a gray losange from some other ship from before. Always nice to see one piece and be like: \u0022oh yeah I remember that craft, I went to duna with it\u0022 or something.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-04-04T06:05:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sickboy\u0022 data-cite=\u0022sickboy\u0022\u003E\u003Cdiv\u003EI love to have all that debris around, I never really hit it since my parking orbit 75 KM and anything I\u0027m leaving in orbit for longer than 1 orbit is gonna be higher than that, odds of me hitting a debris there is quite unlikely. I don\u0027t have as much on my current save but on my previous one if I was at 75 KM altitude or nearby, I could usually always see a gray losange from some other ship from before. Always nice to see one piece and be like: \u0022oh yeah I remember that craft, I went to duna with it\u0022 or something.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d actually like it if you could see what vessel the debris originally came from.\u003C/p\u003E\n"},{"CreatedByName":"mordin86","CreatedById":29223,"CreatedDateTime":"2014-04-04T06:33:11Z","Content":"\n\u003Cp\u003E\u0022Prevention is better than cure - always design to leave no orbital debris.\u0022\u003C/p\u003E\u003Cp\u003EThis, I always try to have the possibility to deorbit my bigger debris after reaching the orbit.\u003C/p\u003E\n"},{"CreatedByName":"DomDiaemus","CreatedById":66758,"CreatedDateTime":"2014-04-04T11:07:39Z","Content":"\n\u003Cp\u003EWith 195 debris around (in-\u0026amp;-out) 100km orbit I look forward to see one of them impacting either the rockets/shuttles or even the orbital station... \u003C/p\u003E\u003Cp\u003EThe movie \u0022Gravity\u0022 comes to mind but damn it is hard to get them passing by that close... the closest one I saw was over 1.9km way from the station therefore plenty of empty space to fill with more debris (crazy grin)\u003C/p\u003E\u003Cp\u003EBeside it is fun to see all the debris passing fast when a rocket is ascending to higher orbit or deorbiting... maybe one day I\u0027ll see an impact (sometime in the next 1000y since the probabilities are quite small)\u003C/p\u003E\n"}]}