{"TopicId":66098,"ForumId":32,"TopicTitle":"Do You Deorbit Old Satellites/Stations?","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-17T23:22:04Z","PageNum":1,"Articles":[{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-17T23:22:04Z","Content":"\n\u003Cp\u003E[NOTE: I\u0027m not talking about debris. I\u0027m talking about still-functional satellites/stations with an capable powersource that have outlived their purpose. Not spent rocket stages.]\u003C/p\u003E\u003Cp\u003EI have a question for the KSP community.\u003C/p\u003E\u003Cp\u003EDo you deorbit your old satellites and spacestations that have an indefinite orbit that will last forever?\u003C/p\u003E\u003Cp\u003EDo you send up ships to deorbit them?\u003C/p\u003E\u003Cp\u003EDo you attach parachutes and send them back to Kerbin?\u003C/p\u003E\u003Cp\u003EDo you build an muesuem around them?\u003C/p\u003E\u003Cp\u003EOr do you just ignore them and leave them there as landmarks of Kerbal accomplishment?\u003C/p\u003E\u003Cp\u003EI personally prefer to leave them there. I have this odd sentimental attachment to anything that makes it to orbit, and mount all my spacecraft with an power source (RTG\u0027s or solar panels - yes, even my first satellite has solar panels). Which is probably why an empty, but still functional station of an primitive design hurled past the DawnBreaker II as it was getting ready for the burn to escape velocity around Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-17T23:25:10Z","Content":"\n\u003Cp\u003EI remove old, stale craft as needed because all that crap eventually chokes my laptop. Same reason I don\u0027t have persistent debris enabled.\u003C/p\u003E\n"},{"CreatedByName":"Zaryulenko","CreatedById":76874,"CreatedDateTime":"2014-03-17T23:27:44Z","Content":"\n\u003Cp\u003EI decided to put down (Not destroying it) one of my best mapping grunts, Now its sit there on the Minmus frozen lake since year 2 (Actual year in the save is 5) and when my Ike grunt completes its mission im gonna sit it aside from the other and start a museum.\u003C/p\u003E\u003Cp\u003EAaaand im starting to take a decision to de-orbit my first station on the save, it has been orbiting for 4 years and its starting to get useless.\u003C/p\u003E\n"},{"CreatedByName":"Nano606","CreatedById":94279,"CreatedDateTime":"2014-03-17T23:59:17Z","Content":"\n\u003Cp\u003EPretty much every game i end up deorbiting a few stations due to some glaring flaw that i feel i cant live with. Sometimes i removed the kerbals but most of the time i dont. My stations tend to be on the large size so they can contain anything from 10-50 kerbals and removing them one by one is just a painful experience so i simply do a slow burn to deorbit and take a bunch of screenshots as the station gets torn to bits by the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-03-18T00:12:59Z","Content":"\n\u003Cp\u003EI never deorbit satellites because I never put any up... For me, there are two kinds of space stations: A \u0022Skylab\u0022 type single part station that\u0027s put up early in the save, and a full blown modular station. The single parts stations are typically deorbited very quickly (like Skylab), since they aren\u0027t very useful to me. As for the modular stations, I tend to keep them around for a very, verrrry long time. So long that I stop using the save file before they\u0027re thrown out. I only deorbit those things when they somehow become obsolete. The only time I have ever done that was with my .19 refueling station. I hated it, it was one of the most ugly crafts I have ever seen and it was ridiculously wobbly (because of the standard docking ports). So when .20 added those awesome Sr. Clamp-o-trons I did not hesitate to kill that station.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2014-03-18T00:13:59Z","Content":"\n\u003Cp\u003EI try to construct my launch stages so that they have just enough fuel to put something on a nearly orbital trajectory, and then the payload\u0027s own thruster can finish it off.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-03-18T00:49:00Z","Content":"\n\u003Cp\u003ENot only do I deorbit old stuff, I try to dock it to (or already have attached) a bunch of parachutes so I can recover as much of it as I can. It often explodes anyway, but at least I get some of the parts back.\u003C/p\u003E\n"},{"CreatedByName":"OmegaCenti","CreatedById":81639,"CreatedDateTime":"2014-03-18T01:18:35Z","Content":"\n\u003Cp\u003EYes, because loading a persistence file that is 24,000 lines long takes quite a bit longer relatively.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-03-18T02:33:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OmegaCenti\u0022 data-cite=\u0022OmegaCenti\u0022\u003E\u003Cdiv\u003EYes, because loading a persistence file that is 24,000 lines long takes quite a bit longer relatively.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd because it\u0027s just fun to destroy stuff. When I start getting too much stuff in space, have a Great Purge and smash things in the most spectacular ways I can imagine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-03-18T04:36:19Z","Content":"\n\u003Cp\u003EThe only time I deorbit old satellites or stations is when a collision sends the debris screaming into Kerbin or other planetary bodies.\u003C/p\u003E\n"},{"CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2014-03-18T04:39:05Z","Content":"\n\u003Cp\u003EI normally fly a large probe container up into space, rendezvous with all the space junk and small probes, then deorbit the \u0022trash bag\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-03-18T04:41:21Z","Content":"\n\u003Cp\u003EI explode them. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KNSA Scientist","CreatedById":74995,"CreatedDateTime":"2014-03-18T05:26:16Z","Content":"\n\u003Cp\u003EI keep my debris in space, as a sort of science experiment. Of course science when there is only a 0.1% chance of it working is boring.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-03-18T06:19:00Z","Content":"\n\u003Cp\u003EI answered \u0022yes\u0022 but that\u0027s technically not true. I recycle them via Extraplanetary Launchpads recyclers.\u003C/p\u003E\n"},{"CreatedByName":"LongHairedHuman","CreatedById":14396,"CreatedDateTime":"2014-03-18T06:32:39Z","Content":"\n\u003Cp\u003EI do not de-orbit them intentionally. It adds some tension when doing manoeuvres at certain altitudes (which can lead to spontaneous unplanned re-entry). When low on fuel, it also helps to have many options to refuel at.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-03-18T06:51:54Z","Content":"\n\u003Cp\u003Ei did vote NO, but, that has a caveat on it. It honestly depends on what I am feeling. I have a pair of satellites still going about their business \u0026lt;they never had a purpose to begin with, seeing as they are in sandbox mode lol\u0026gt; that are in orbit around the sun. one is closer in and one that has a similar orbit to Kerbin. I may deorbit some of my stuff or \u0022enable self destruct\u0022 on others if things get crowded, but, generally, not normally no.\u003C/p\u003E\n"},{"CreatedByName":"Jacob01","CreatedById":61842,"CreatedDateTime":"2014-03-18T07:02:00Z","Content":"\n\u003Cp\u003EI de-orbit stations, but not satellites. But only if I\u0027m bored of them and/or they get unstable. I just think they are too big to be sat up there abandoned. Anyway, its always fun to see the fireworks of a massive thing on re-entry.\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-03-18T10:55:21Z","Content":"\n\u003Cp\u003EI almost never build stations or satellites. There doesnt seem to be any point to them.\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-03-18T11:17:39Z","Content":"\n\u003Cp\u003EI tend to deorbit mapsats if I dont feel like retrieving them with Extraplanitary launchpads. Unless I have a really good reason to refuel and send them off to another location vs just sending a new one theres not much point in keeping them around once they are done. Stations I tend to leave as I tend to not build so many that they cause too much orbital clutter.\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2014-03-18T11:24:04Z","Content":"\n\u003Cp\u003EI tend to leave them up in a Lev Andropov \u0027Staying on-board for really long for when passing ships need some fuel\u0027 kind of situation.\u003C/p\u003E\n"},{"CreatedByName":"Sargent890","CreatedById":83887,"CreatedDateTime":"2014-03-18T11:27:14Z","Content":"\n\u003Cp\u003EI\u0027m kinda sentimental about my satellites and stations. I have a really bad station with only two modules and about Tier 2 level tech tree parts, but I leave it up there. It\u0027s been up for over a decade IIRC. I\u0027m also a bit too busy to build a replacement station.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-03-18T13:56:06Z","Content":"\n\u003Cp\u003EUsually I just de-orbit things when I\u0027m done with them. It\u0027s just too much of a pain to try to \u0022rescue\u0022 them with parachutes and the like, if it wasn\u0027t designed for return.\u003C/p\u003E\u003Cp\u003EAs an example, I decided to change out the science section on my Mun space station (replacing it with one that had more docking ports, and no cupola). I built an orbital stage with a \u0022cage\u0022 to grab the old one, complete with parachutes, which also brought up the new section. Below is an image of docking the decommissioned science section into it, and another with it parachuting down. That entire mission took WAY too long to complete, and required a lot of docking precision (done by hand, didn\u0027t have MechJeb or any other autopilots at the time). I don\u0027t do it anymore.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.necrobones.net/screenshots/KSP/KSP%202014-03-05%2019-07-37-15.jpg\u0022 alt=\u0022KSP%202014-03-05%2019-07-37-15.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.necrobones.net/screenshots/KSP/KSP%202014-03-05%2019-41-00-54.jpg\u0022 alt=\u0022KSP%202014-03-05%2019-41-00-54.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-18T14:01:34Z\u0022 title=\u002203/18/2014 02:01  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 18, 2014\u003C/time\u003E by NecroBones\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Othuyeg","CreatedById":105454,"CreatedDateTime":"2014-03-18T14:00:30Z","Content":"\n\u003Cp\u003EI build space planes with rockets and shoot them into bits.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-03-18T14:32:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Othuyeg\u0022 data-cite=\u0022Othuyeg\u0022\u003E\u003Cdiv\u003EI build space planes with rockets and shoot them into bits.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s quite the Kessler Syndrome.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2014-03-18T14:38:35Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ENo.\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://0div0.org/images/ksp/20140318_ksp1596_satellite.jpg\u0022 alt=\u002220140318_ksp1596_satellite.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOk, yes. Sometimes. Especially if it\u0027s using a mod part that I\u0027m about to stop using (and haven\u0027t tweaked to be ejectable, such as the space telescopes I recently decommissioned), or if it\u0027s in a \u0022dangerous\u0022 orbital band (one that intersects the station orbits at 130km). Generally, no. Half the noise tracks in the above photo are RemoteTech satellites, which usually I keep listed as debris but recently reactivated. Some of the rest are old (and new) ScanSat satellites, but most of them are just stock craft. Basically everything that I\u0027ve launched since I started in \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E0.19\u003C/span\u003E Demo 0.18.3 and haven\u0027t deorbited.\u003C/p\u003E\u003Cp\u003EYes, all of those visible have working power systems, and most of them have fuel. (Except maybe the lonely one in the top center - that\u0027s either Nomad or Wayward 1, and one of the two doesn\u0027t have an RTG and is long dead. Not sure which that is....)\u003C/p\u003E\n"}]}