{"TopicId":67020,"ForumId":32,"TopicTitle":"Kerbal facial expressions vs stats","CreatedByName":"Promii","CreatedById":36781,"CreatedDateTime":"2014-03-28T05:20:11Z","PageNum":1,"Articles":[{"CreatedByName":"Promii","CreatedById":36781,"CreatedDateTime":"2014-03-28T05:20:11Z","Content":"\n\u003Cp\u003EI was never able to find a very precise answer to how the Courage and Stupidity stats and the Badass flag affect Kerbals\u0027 moods so I did some testing with an edited save file and here\u0027s what I discovered:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECourage:\u003C/strong\u003E This stat determines how long a Kerbal will remain frightened after something goes wrong (i.e. something attached to their vessel explodes). A Kerbal with maximum courage will still become scared, but only for a moment. This is true whether the Kerbal is a Badass or not.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EStupidity:\u003C/strong\u003E This stat determines how oblivious a Kerbal is to potential danger and also how amazed a Kerbal will be by the universe. All non-Badass Kerbals are made nervous by launches, but the stupider ones don\u0027t seem to notice the launch is happening. All Kerbals, Badass or not, will have bigger grins while in space if they are stupid.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBadass:\u003C/strong\u003E This toggle switches Kerbals between fearing and enjoying potentially dangerous situations such as launches. It overrides the first effect the the stupidity stat above but not the second. Also Badass Kerbals can still be cowards when things go wrong if their courage is low.\u003C/p\u003E\u003Cp\u003EAlso during testing this happened:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BM2CVdH.jpg\u0022 alt=\u0022BM2CVdH.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"homeslicerae","CreatedById":106738,"CreatedDateTime":"2014-03-28T05:26:24Z","Content":"\n\u003Cp\u003E*chooses the most stupid kerbals for every mission from now on*\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2014-03-28T05:47:37Z","Content":"\n\u003Cp\u003EAh, excellent! I\u0027ve been experimenting on and off for a while, trying to figure out exactly what Courage means. Well done!\u003C/p\u003E\u003Cp\u003EAnd good god, I\u0027ve never seen anything like that glitch/bug!\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-03-28T06:19:56Z","Content":"\n\u003Cp\u003EI\u0027ve seen that floating screen effect when changes are made using Crew manifest- it seems that the fuzzy screen we see on the little screens has to be put in between the \u0027camera\u0027 and the kerbal for us to see it.\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-03-28T08:35:02Z","Content":"\n\u003Cp\u003EWell done \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-03-28T11:34:35Z","Content":"\n\u003Cp\u003EYeah, I too have noticed that if you want your Kerb to be smiling (almost) all the time pick the high stupidity / low courage ones.\u003C/p\u003E\n"},{"CreatedByName":"raziel420","CreatedById":42384,"CreatedDateTime":"2014-03-28T12:03:50Z","Content":"\n\u003Cp\u003EI can\u0027t wait till stupidity affect flight ability (highly stupid, sluggish controls and late/early engine cutoffs, random accidental staging \u0022what does this button do\u0022)\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-03-28T12:43:19Z","Content":"\n\u003Cp\u003EThis is great information! Yes, I think I need a lot of stupid Kerbals on my missions now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}