{"TopicId":68201,"ForumId":32,"TopicTitle":"0.23.5 complaining?","CreatedByName":"soldieroffilth","CreatedById":88590,"CreatedDateTime":"2014-04-05T11:47:57Z","PageNum":5,"Articles":[{"CreatedByName":"6.forty","CreatedById":97939,"CreatedDateTime":"2014-04-06T01:22:27Z","Content":"\n\u003Cp\u003EThis whole \u0022these engines are OP\u0022 argument is like arguing that the Bugatti in (insert generic racing game here) is OP compared to the VW Golf.\u003C/p\u003E\n"},{"CreatedByName":"Crusher8000","CreatedById":25151,"CreatedDateTime":"2014-04-06T01:25:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00226.forty\u0022 data-cite=\u00226.forty\u0022\u003E\u003Cdiv\u003EThis whole \u0022these engines are OP\u0022 argument is like arguing that the Bugatti in (insert generic racing game here) is OP compared to the VW Golf.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the main problem atm is that money isn\u0027t part of the game yet and you can build any rocket you want in career. Afaik once parts cost money it will all balance out but for the moment what was once a challenge to do is now easy as pie and I can understand why people are annoyed by it. People like a challenge and if a new patch suddenly makes things easier it will annoy people. Hopefully in 0.24 money will be involved and you can\u0027t just use whatever part you want.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-06T01:37:12Z","Content":"\n\u003Cp\u003ENo, that\u0027s not the problem... How much they cost is irrelevant.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-06T01:52:15Z","Content":"\n\u003Cp\u003EPS, to all telling us to just edit the parts or delete the new folder. No thanks. The asteroids are cool and we don\u0027t want to have to edit every update.\u003C/p\u003E\n"},{"CreatedByName":"ZenithRising","CreatedById":77506,"CreatedDateTime":"2014-04-06T02:27:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EI\u0027m fine with the new parts being powerful. Its just the fact that they have a very high ISP as well. I think that they should have a lower ISP and then a 3m upper stage engine should have been available with good ISP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgree with this. I think the new parts are fine, but the ISPs seem like they need to be tweaked. Either buff the older parts, or nerf the new ones.\u003C/p\u003E\n"},{"CreatedByName":"The Silent Majority","CreatedById":106117,"CreatedDateTime":"2014-04-06T02:35:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crusher8000\u0022 data-cite=\u0022Crusher8000\u0022\u003E\u003Cdiv\u003EI think the main problem atm is that money isn\u0027t part of the game yet and you can build any rocket you want in career. Afaik once parts cost money it will all balance out but for the moment what was once a challenge to do is now easy as pie and I can understand why people are annoyed by it. People like a challenge and if a new patch suddenly makes things easier it will annoy people. Hopefully in 0.24 money will be involved and you can\u0027t just use whatever part you want.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis my opinion as well, if they cost enough, they will be used for none but the largest payloads, and since contracts (and I would assume, basic costs) are coming in .24, they will probably be fine then. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHow much they cost is irrelevant.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy? or to be more specific, when money is introduced, will the cost still be irrelevant?\u003C/p\u003E\u003Cp\u003EIf you mean in sandbox, then there are already parts that outclass others, and if you don\u0027t put restrictions on yourself, then you are playing without any reason to complain. (I hate it when people make this argument, but in sandbox, and this case, I think its justified)\u003C/p\u003E\u003Cp\u003EI play both, just for reference.\u003C/p\u003E\u003Cp\u003EFor the people who say that you can use it for anything, I disagree, I am still going to use the LV-N (or Ion now) for interplanetary stages, why use the new engine for that?\u003C/p\u003E\u003Cp\u003EDisclaimer: I do think they should tweak the LFB and the tech tree, but, taking the next update into account, I don\u0027t think its too bad.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T02:59:16Z\u0022 title=\u002204/06/2014 02:59  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by The Silent Majority\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-04-06T02:37:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00226.forty\u0022 data-cite=\u00226.forty\u0022\u003E\u003Cdiv\u003EThis whole \u0022these engines are OP\u0022 argument is like arguing that the Bugatti in (insert generic racing game here) is OP compared to the VW Golf.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re missing the point. We\u0027re saying that the Bugatti getting better gas mileage than said golf is OP.\u003C/p\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-04-06T02:43:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022soldieroffilth\u0022 data-cite=\u0022soldieroffilth\u0022\u003E\u003Cdiv\u003ELooked at some info on the actual SLS and it says that the proposed SLS would be capable of putting a \u003Cstrong\u003E170 ton payload into low earth orbit\u003C/strong\u003E in its largest configuration. Numbers from KSP show this to be about the same, altitude dependent of course.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s 130 metric tons to orbit, and 150 metric tons with the Pyrios F-1B boosters. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-06T02:44:35Z","Content":"\n\u003Cp\u003ECost is irrelevant since really, it has no impact in Sandbox AND I don\u0027t think money will be an issue in career. People are hardly short of science points and I doubt money will be short either.\u003C/p\u003E\u003Cp\u003EIt should be hard to make a big launcher. Basically Squad seem to be catering for the lowest common denominator.\u003C/p\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2014-04-06T02:48:07Z","Content":"\n\u003Cp\u003EThe problem is that people here and also Squad themselves are losing focus of what is intended when new parts are added. What purpose do they serve?\u003C/p\u003E\u003Cp\u003EDo they want to go for career that depends on upgrading to the next new engine? if so-\u003C/p\u003E\u003Cp\u003EThe engines are a balanced upgrade over the previous Mainsail and Skipper, but they are on tech tree nodes that don\u0027t make sense for this purpose.\u003C/p\u003E\u003Cp\u003EDo they want every part in the game to be relevant and balanced? if so-\u003C/p\u003E\u003Cp\u003EThe 23.5 update doesn\u0027t change that there are some parts that are unbalanced. All it does is make people\u0027s previous favorite OP engine (the mainsail) and replace it with something better.\u003C/p\u003E\u003Cp\u003EDo they want to make sure people use the NASA engines because NASA would be disappointed if their parts were weak? if so-\u003C/p\u003E\u003Cp\u003EThey did a pretty good job.\u003C/p\u003E\u003Cp\u003ENow, hear me out that the mainsail was incredibly OP before the 23.5 update. If you look at any sandbox mode lifter rocket over, say 25 tons, in 23.0, what would be the first stage engine? Mainsails. That\u0027s what OP is - a part that people would use over every other part because it was the best. Yes, 48-7s clusters could be better but the part count required made them worthless. If you think about it, the main issue with lifter parts is part count. Not even ISP. Even if the ISP of the new engines was lower than the mainsail, I\u0027d still use them for heavy lifter rockets, because of the part count.\u003C/p\u003E\u003Cp\u003EScenarios where the new engines are NOT better than current engines:\u003C/p\u003E\u003Cp\u003Elanders\u003C/p\u003E\u003Cp\u003Eanything that has a nuclear engine\u003C/p\u003E\u003Cp\u003Espaceplanes\u003C/p\u003E\u003Cp\u003Eanything under 40 tons in space\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-06T03:00:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003ETo be honest I did find it a little weird when I unlocked Mainsails and LFBs at the same time (They may have been in two nodes, I don\u0027t remember for sure, but neither was more than maybe one level farther down than the other). Since after all the LFB is effectively a better mainsail with a built-in orange tank\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are in one tech node.\u003C/p\u003E\u003Cp\u003EThis made perfect sense to me because the LFB is more powerful and the mainsail can be stacked under a decoupling shroud. /shrug. It\u0027s just a trade off.\u003C/p\u003E\n"},{"CreatedByName":"The Silent Majority","CreatedById":106117,"CreatedDateTime":"2014-04-06T03:00:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003ECost is irrelevant since really, it has no impact in Sandbox AND \u003Cstrong\u003EI don\u0027t think money will be an issue in career\u003C/strong\u003E. People are hardly short of science points and I doubt money will be short either.\u003Cp\u003EIt should be hard to make a big launcher. Basically Squad seem to be catering for the lowest common denominator.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that money will be harder to come by than science, as it will have to be continually refreshed (I hope)\u003C/p\u003E\u003Cp\u003ECan you specify \u0022lowest common denominator,\u0022 do you mean people not willing to learn how to play the game in the traditional way (IE launching rockets and exploring)?\u003C/p\u003E\u003Cp\u003EBecause I know people who like to just mess around, and I don\u0027t see whats wrong with that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T03:03:35Z\u0022 title=\u002204/06/2014 03:03  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by The Silent Majority\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2014-04-06T03:03:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00226.forty\u0022 data-cite=\u00226.forty\u0022\u003E\u003Cdiv\u003EThis whole \u0022these engines are OP\u0022 argument is like arguing that the Bugatti in (insert generic racing game here) is OP compared to the VW Golf.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou know what\u0027s more OP?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i301.photobucket.com/albums/nn77/Whackjob_photos/Gif/Vespadance.gif\u0022 alt=\u0022Vespadance.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EVespa.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-04-06T03:10:06Z","Content":"\n\u003Cp\u003EBy lowest common denominator I mean people who are playing who can\u0027t really be bothered making a decent launcher, or not knowing how / can\u0027t be bothered learning.\u003C/p\u003E\u003Cp\u003EYou could certainly launch large payloads in 0.23. Yes you needed struts which were a pain. But ARM adds both the strut reduction AND OP engines, basically making it way to easy. If they nerf the new engines, the improved joints alone should make it easy enough to build a decent launcher.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EYou know what\u0027s more OP?\u003Cp\u003E\u003Ca href=\u0022http://i301.photobucket.com/albums/nn77/Whackjob_photos/Gif/Vespadance.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i301.photobucket.com/albums/nn77/Whackjob_photos/Gif/Vespadance.gif\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EVespa.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVespas are awesome. The originals used surplus starter engines from WWII bombers.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-04-06T03:13:49Z","Content":"\n\u003Cp\u003EHere is how I would view something as being \u0022over powered\u0022. If I could take one of the smallest fuel tanks, the orange doughnut, attach a new engine to it and that puts a payload into orbit. Then that would be \u0022over powered\u0022. I would like to know with these numbers are they using the same fuel tanks for both test, or matching he sizes only? The reason I ask this is the tanks are different weights and would, in theory anyways, be a difference maker. If you put a mainsail on one of the new tanks and launch 10t (random number for the sake of arguing) how much fuel is left, and likewise with the new engine to get a better idea than just relying on Kerbal Engineer giving static numbers (I have heard that engineer does not like these new parts, unless this has been fixed then never mind on this part). \u003C/p\u003E\u003Cp\u003EAs far as where they are in the techtree, again, I believe this will be adjusted at a later time since this was to get them in game, not much was done to career mode for this small update. It is fine to be upset and carry on an intelligent conversations, but when you start bashing on each other it turns into kids fighting over the swing on the playground. To be honest my only complaint with the patch so far is that I have three asteroids in orbit around Kerbin, but only one that I actually put there myself. I can see this cluttering up and causing lag a some point, or making people with OCD very annoyed by the clutter. And yes those in orbit have a periapsis and apoapsis around Kerbin without me grabbing them (this might be a bug I dunno).\u003C/p\u003E\n"},{"CreatedByName":"6.forty","CreatedById":97939,"CreatedDateTime":"2014-04-06T03:17:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sdj64\u0022 data-cite=\u0022sdj64\u0022\u003E\u003Cdiv\u003EDo they want to go for career that depends on upgrading to the next new engine? if so-\u003Cp\u003EThe engines are a balanced upgrade over the previous Mainsail and Skipper, but they are on tech tree nodes that don\u0027t make sense for this purpose.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is what makes the most sense to me, and the tech tree misplacement isn\u0027t too surprising. The tree is nowhere near logical anyway; you get rockets before you get batteries, you get rockets before you get wheels, you get rockets before you even get ladders.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whackjob\u0022 data-cite=\u0022Whackjob\u0022\u003E\u003Cdiv\u003EYou know what\u0027s more OP?\u003Cp\u003E\u003Ca href=\u0022http://i301.photobucket.com/albums/nn77/Whackjob_photos/Gif/Vespadance.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i301.photobucket.com/albums/nn77/Whackjob_photos/Gif/Vespadance.gif\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EVespa.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat Vespa IS OP. SLS ain\u0027t got nothin\u0027 on it.\u003C/p\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2014-04-06T03:32:03Z","Content":"\n\u003Cp\u003EHere\u0027s a crazy idea, let me just throw it out there:\u003C/p\u003E\u003Cp\u003EIf you don\u0027t like the new parts, don\u0027t use them.\u003C/p\u003E\u003Cp\u003EI know, I\u0027m insane right?\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-04-06T04:40:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EBy lowest common denominator I mean people who are playing who can\u0027t really be bothered making a decent launcher, or not knowing how / can\u0027t be bothered learning.\u003Cp\u003EYou could certainly launch large payloads in 0.23. Yes you needed struts which were a pain. But ARM adds both the strut reduction AND OP engines, basically making it way to easy. If they nerf the new engines, the improved joints alone should make it easy enough to build a decent launcher.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDefine decent....If it works that is decent in my book. I can build a heavy lifter in .23 that can lift 100\u002Bt without issues, but it looks like crap but now I can build one that does the same thing and looks a bit more nice, not because of the new engines but rather the fact I don\u0027t have strut forever and a day. It is not because I cannot be bothered, my hands shake something fierce making it more of a challenge getting them straight than anything. So do not classify everyone who likes the new parts as lazy or \u0022not as skilled\u0022 as others as that is not always the case.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-06T04:48:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Person012345\u0022 data-cite=\u0022Person012345\u0022\u003E\u003Cdiv\u003EHere\u0027s a crazy idea, let me just throw it out there:\u003Cp\u003EIf you don\u0027t like the new parts, don\u0027t use them.\u003C/p\u003E\u003Cp\u003EI know, I\u0027m insane right?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe want a 3m lifter engine. we just dont want a lifter engine that\u0027s also a better space engine than the Lvl30.\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2014-04-06T05:41:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EWe want a 3m lifter engine. we just dont want a lifter engine that\u0027s also a better space engine than the Lvl30.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo the engine at the top of the tree shouldn\u0027t be better than the engine at the bottom of the tree? Righto, carry on.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-06T06:10:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ArmchairGravy\u0022 data-cite=\u0022ArmchairGravy\u0022\u003E\u003Cdiv\u003ESo the engine at the top of the tree shouldn\u0027t be better than the engine at the bottom of the tree? Righto, carry on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBetter at everything at once? yes, it shouldnt. It should be better at carrying large weights to orbit (A high thrust, particularly high thrust per cross section to allow tall stacks) or landing on tylo, but it shouldnt also be one of the most fuel effient space engines in the game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T08:16:04Z\u0022 title=\u002204/06/2014 08:16  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by Rakaydos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Angvar","CreatedById":107332,"CreatedDateTime":"2014-04-06T06:17:05Z","Content":"\n\u003Cp\u003EThe only thing that bothers me ( I teeny weeny little bit) is that I was just on the verge of earning my mainsails and orangey tanks when \u0022Bam\u0022 here they are. But now I have even bigger and better prizes to strive for and eventually I am going to start a fresh career in a kinda hardcore mode. No zombie immortal pilots and no quick saves. Hopefully I will have to manage a budget by then too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Klingon Admiral","CreatedById":69090,"CreatedDateTime":"2014-04-06T09:21:21Z","Content":"\n\u003Cp\u003EWell, can\u0027t the high ISP of the SLS-engines just be a communication oversight between NASA and Squad? The SLS runs on LH2\u002BLOX in it\u0027s liquid stages, and we know that LH2 offers a higher ISP in exchange for thrust. But from the stats of the other stock engines we can assume that they run on a Kerosene (perhaps RP-1) variant and LOX, which offers higher thrust than LH2 at a weaker ISP. There is a reason why the Space Shuttle and the SLS had/will have these two massive SRBs, they could not lift off with their main engines alone.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-04-06T09:27:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Klingon Admiral\u0022 data-cite=\u0022Klingon Admiral\u0022\u003E\u003Cdiv\u003EWell, can\u0027t the high ISP of the SLS-engines just be a communication oversight between NASA and Squad? The SLS runs on LH2\u002BLOX in it\u0027s liquid stages, and we know that LH2 offers a higher ISP in exchange for thrust. But from the stats of the other stock engines we can assume that they run on a Kerosene (perhaps RP-1) variant and LOX, which offers higher thrust than LH2 at a weaker ISP. There is a reason why the Space Shuttle and the SLS had/will have these two massive SRBs, they could not lift off with their main engines alone.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethat might explain the different exaust effects?\u003C/p\u003E\n"},{"CreatedByName":"Demon_82","CreatedById":81626,"CreatedDateTime":"2014-04-06T10:52:46Z","Content":"\n\u003Cp\u003ECan\u0027t we just asume that the newer engines, aren\u0027t only more powerful but more technically advanced? I mean, any engine made 10 years after an older one is more fuel efficient. I don\u0027t see why is it so much troublesome to accept the newer engines to be better in everything, that\u0027s what I expect from new things usually xD\u003C/p\u003E\n"}]}