{"TopicId":68531,"ForumId":32,"TopicTitle":"I don\u0026#039;t understand the fuss behind ARM","CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-04-07T11:13:02Z","PageNum":11,"Articles":[{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-12T16:06:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003ELet\u0027s get rid of the whole suggestions subforum then. Who\u0027s with me?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could just choose not to use the suggestions subforum. Why is that so hard?!\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2014-04-12T16:08:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EYou could just choose not to use the suggestions subforum. Why is that so hard?!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was saying it ironically. If it is wrong to say that the stock game could be better on the forums (as some people seem to be saying), then the suggestions subforum would be pointless. The continued existence of the suggestions subforum shows that it\u0027s not pointless, therefore it is \u003Cem\u003Enot\u003C/em\u003E wrong to say that the stock game could be better.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chrisb2e9\u0022 data-cite=\u0022chrisb2e9\u0022\u003E\u003Cdiv\u003EWhy do people even care? I mod the stock game. Make changes to the engines, batteries, etc. I modded the science lab to store 4000 electric charge. And I gave it has torque values of 60. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf the stock game is \u003Cem\u003Eso broken\u003C/em\u003E that you need to mod already existing features, \u003Cem\u003Esomeone is doing something wrong\u003C/em\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T16:12:03Z\u0022 title=\u002204/12/2014 04:12  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by Holo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-12T16:13:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003EI was saying it ironically. If it is wrong to say that the stock game could be better on the forums (as some people seem to be saying), then the suggestions subforum would be pointless. The continued existence of the suggestions subforum shows that it\u0027s not pointless, therefore it is \u003Cem\u003Enot\u003C/em\u003E wrong to say that the stock game could be better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIronically, I was responding to your ironic post with more irony. This forum desperately needs sarcasm tags. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd I agree with your point; expressing opinions about the game, even if negative, is not \u0022whining\u0022 or \u0022complaining\u0022. It\u0027s using the feedback channels to provide feedback, as intended.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-04-12T16:16:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf the stock game is \u003Cem\u003Eso broken\u003C/em\u003E that you need to mod already existing features, \u003Cem\u003Esomeone is doing something wrong\u003C/em\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei play only stock and love it.\u003C/p\u003E\n"},{"CreatedByName":"comham","CreatedById":43245,"CreatedDateTime":"2014-04-12T16:22:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EOne solution would be to raise the power of the original engines. They ARE the underpowered engines compared to RL after all...\u003Cp\u003EAlso, to have this conversation without making a separation between sandbox balance and career balance is meaningless.\u003C/p\u003E\u003Cp\u003EIn total annihilation for example (build economy and fight with hordes of robots) for example there was a tech tree and the later robots were *much* more powerful than the earlier ones. In a skirmish (sandbox) game, they were all you would use as they could kill anything else.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIn skirmish (sandbox) they were horribly overpowered.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIn the ACTUAL game though there was an economy which made it harder to get the overpowered parts and so this balanced them due to their cost.\u003C/p\u003E\u003Cp\u003EIt would have been idiotic to \u0060balance\u0060 the game for sandbox as that would paradoxically unbalance it for the actual game and would have made the game as a whole MUCH less fun to play. There would be no point in developing tech, everything would be so \u0060balanced\u0060 that the benefit of expending the resources to get the higher powered parts would be eliminated.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBalancing the game for sandbox play would have ruined it.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWe are in a similar position in KSP. We are moving from \u0060sandbox balancing\u0060 to \u0060gameplay and career balancing\u0060 and there are different ways to do both.\u003C/p\u003E\u003Cp\u003EAn attitude shift in the forum is now needed to allow SQUAD to make this a much better game. Stop thinking of balancing as something that can only be done in sandbox and realise the new economy will provide new ways to balance an engine that seems OP currently without nerfing it.\u003C/p\u003E\u003Cp\u003EI know OP wanted to restrict the thread to exclude money and career but that would make the thread dissolve into an argument for which there is no solution unless you consider career and money.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think that TA analogy holds up very well. One point TA is well regarded for (even after nearly 20 years!) is balancing T1 and T2 units so that teching up to T2 does not make T1 obsolete, both tiers are useful to the endgame in terms of the resources they cost. Skirmish is not a great analogy to sandbox. Skirmish with instabuild and unlimited resources would be a good analogy to sandbox but no mode like that existed.\u003C/p\u003E\u003Cp\u003EThere is still not much of a picture on what KSP career mode would look like. RTS campaigns tend to be seen as tutorials for the competitive multiplayer mode and KSP career mode right now is generally seen as a training mode for... something, right? Minus much of the story content that RTS campaigns have.\u003C/p\u003E\u003Cp\u003EI know there was a pretty popular blog post a few years ago that made the point quite well that any KSP career mode should play down the economics of it, because wobbly kerbal disasters were fun and it would be counterproductive to make the player feel bad about them and distract from the trial-and-error (in the good sense) gameplay loop of KSP.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-12T16:25:55Z","Content":"\n\u003Cp\u003EOn the D\u0026amp;D forums I go to we have something called the Stormwind Fallacy.\u003C/p\u003E\u003Cp\u003E\u0022If it\u0027s not broken because you can fix it with houserules (mods), it\u0027s still broken.\u0022\u003C/p\u003E\n"},{"CreatedByName":"SirusKing","CreatedById":98303,"CreatedDateTime":"2014-04-12T16:37:40Z","Content":"\n\u003Cp\u003EIMO, the new tanks/rockets are fine, they should just be a little further down the tech tree. Another node after \u0022massive rockets\u0022 would be cool.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2014-04-12T16:44:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holo\u0022 data-cite=\u0022Holo\u0022\u003E\u003Cdiv\u003EThe continued existence of the suggestions subforum shows that it\u0027s not pointless, therefore it is \u003Cem\u003Enot\u003C/em\u003E wrong to say that the stock game could be better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think thats an interesting point. Many complaints about arm are in fact not constructive suggestions, but, well, complaints and criticism. We have a metric ton of posts here telling everyone just how wrong the arm-balance is. That its a mistake and damages the game as a whole. Calling it broken, allowing things which - out of some reason - arent supposed to be possible. Basically telling SQUAD they have no clue what theyre doing. I think thats more than a bit unfair considering they are the ones who made ksp.\u003C/p\u003E\u003Cp\u003EAnd in the meantime we got a poll on our hands with ~75% of the votes being okay with ARM or hoping for a career-based balancing...\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2014-04-12T16:44:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI don\u0027t think anyone is looking for balance for realism reasons, it\u0027s about the gameplay.\u003Cp\u003EThe \u0022self-control\u0022 argument is not really relevant, we\u0027re discussing how we\u0027d prefer the parts to be.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is relevant when the discussion is \u0022I won\u0027t have any reason to use the old parts because the new parts are so good.\u0022, this is 100% a self regulation issue.\u003C/p\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2014-04-12T16:45:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI\u0027d be disappointed if sandbox mode is left to wither on the vine in favor of career mode. Sandbox play is what made KSP what it is today. Maybe career mode is what will attract new players who need more direction in what to be doing, but it would be better if both camps could be satisfied.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am sure both camps will be satisfied after the game is feature complete and all the stock parts are implemented. It\u0027s really difficult to balance the game until everything is done.\u003C/p\u003E\n"},{"CreatedByName":"comham","CreatedById":43245,"CreatedDateTime":"2014-04-12T16:54:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EIt is relevant when the discussion is \u0022I won\u0027t have any reason to use the old parts because the new parts are so good.\u0022, this is 100% a self regulation issue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESelf control should not be an issue at all. Part choices should be logical based on mission requirements and how parts fulfill those requirements. If a part (eg, a hypothetical overpowered engine) becomes the logical engine choice in any situation, then it is overpowered and needs a nerf to fit in with everything else.\u003C/p\u003E\u003Cp\u003EOr if a part is totally useless and it never makes practical sense to use it, it is underpowered. If you ever played the PS2 game Dark Chronicle, the magic character had an alternate mode where she could turn into a monster, like the mechanical character could ride a robot, but the way the experience point economy allocated damage points made her monster mode absurdly underpowered so it was never, ever used by players.\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2014-04-12T17:24:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022comham\u0022 data-cite=\u0022comham\u0022\u003E\u003Cdiv\u003ESelf control should not be an issue at all. Part choices should be logical based on mission requirements and how parts fulfill those requirements. If a part (eg, a hypothetical overpowered engine) becomes the logical engine choice in any situation, then it is overpowered and needs a nerf to fit in with everything else.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe parts are logical based on mission choice, you would use larger rockets rather than asparagus staging to launch heavy payloads. Just like in the real world!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022comham\u0022 data-cite=\u0022comham\u0022\u003E\u003Cdiv\u003EOr if a part is totally useless and it never makes practical sense to use it, it is underpowered.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re assuming there will never be a need to use anything else, however this is, again a completely self regulated choice.\u003C/p\u003E\u003Cp\u003EThat said, I\u0027ve been using all the parts I normally do, PLUS the new parts..so..again it\u0027s all a choice.\u003C/p\u003E\u003Cp\u003EYour ability to make a functioning rocket using only parts you think are decently powered is still there, has not been taken away, etc.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2014-04-12T17:26:41Z","Content":"\n\u003Cp\u003EThe \u0022Build most efficient x\u0022 (x is rocket/lander...) playstyle is a playstyle many players like.\u003C/p\u003E\u003Cp\u003EThis patch made that playstyle much more boring.\u003C/p\u003E\u003Cp\u003EIt is not self regulation issue, the whole point of that playstyle is to get the most efficient rocket trough any means possible, but within the limits of stock game.\u003C/p\u003E\u003Cp\u003ENow the most efficient way is much more simple than it was before.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T17:31:06Z\u0022 title=\u002204/12/2014 05:31  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by Joonatan1998\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2014-04-12T17:48:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joonatan1998\u0022 data-cite=\u0022Joonatan1998\u0022\u003E\u003Cdiv\u003EThe \u0022Build most efficient x\u0022 (x is rocket/lander...) playstyle is a playstyle many players like.\u003Cp\u003EThis patch made that playstyle much more boring.\u003C/p\u003E\u003Cp\u003EIt is not self regulation issue, the whole point of that playstyle is to get the most efficient rocket trough any means possible, but within the limits of stock game.\u003C/p\u003E\u003Cp\u003ENow the most efficient way is much more simple than it was before.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is a self regulation issue, you don\u0027t think the new parts are balanced, you don\u0027t really need to use them, it\u0027s a choice to use them or not. \u003C/p\u003E\u003Cp\u003EAnd it really is that simple, the other parts are still there, still work exactly as they always have, you can use them instead.\u003C/p\u003E\u003Cp\u003EI\u0027m sure everyone has always had parts they do not use much, and we\u0027ve had many threads on that in the past.\u003C/p\u003E\u003Cp\u003ENothing about the game balance has actually changed\u003C/p\u003E\u003Cp\u003E, we just have larger, more difficult goals, and the appropriate tools to go with them.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2014-04-12T17:53:24Z","Content":"\n\u003Cp\u003EThe whole point of that playstyle is to get the best results possible in the stock game.\u003C/p\u003E\u003Cp\u003EThat means that you always use the mathematically best engine.\u003C/p\u003E\u003Cp\u003EBefore it was fun for many people\u003C/p\u003E\u003Cp\u003ENow it is very boring because the new engines are almos always the best.\u003C/p\u003E\u003Cp\u003EThe point of that playstyle is to not use any self regulation. (no matter how stupid it will cause your craft look like)\u003C/p\u003E\u003Cp\u003E(And what are those \u0022larger, more difficult goals\u0022?)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T17:59:25Z\u0022 title=\u002204/12/2014 05:59  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by Joonatan1998\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2014-04-12T17:59:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joonatan1998\u0022 data-cite=\u0022Joonatan1998\u0022\u003E\u003Cdiv\u003EThe whole point of that playstyle is to get the best results possible in the stock game.\u003Cp\u003EThat means that you always use the mathematically best engine.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo.\u003C/p\u003E\u003Cp\u003E I often use engines that are not considered \u0022 the best\u0022 and have gotten everywhere anyone else has.\u003C/p\u003E\u003Cp\u003EAgain this is a choice, you are choosing to use the \u0022mathematically best engines\u0022, there are definitely other approaches to designing craft, all equally valid and worth looking in to.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-04-12T18:01:39Z","Content":"\n\u003Cp\u003EI think I\u0027ve used the ARM pieces twice. They\u0027re just too damn big for the bulk of my operations and I\u0027m perfectly happy with my mainsail-led designs.\u003C/p\u003E\u003Cp\u003EI think it\u0027s a misdirection to assume that people are one-dimensional enough to only play in a particular way and, honestly, I\u0027m amazed this is still being argued over.\u003C/p\u003E\u003Cp\u003EThey\u0027ll get nerfed soon enough.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2014-04-12T18:03:31Z","Content":"\n\u003Cp\u003EI am not speaking about your playstyle.\u003C/p\u003E\u003Cp\u003EI am speaking about people that do things like an 40t grand tour.\u003C/p\u003E\u003Cp\u003EI never said that everyone is trying to build the most efficient crafts possible.\u003C/p\u003E\u003Cp\u003EI only said that effciency is the playstyle of some people.\u003C/p\u003E\u003Cp\u003EThe new parts make that playstyle less fun.,, but at the same time they are very fun for people that don\u0027t try to build the most efficient crafts possible.\u003C/p\u003E\u003Cp\u003EI don\u0027t care much if the game is hard or easy, but building super efficient crafts should be hard.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T18:09:58Z\u0022 title=\u002204/12/2014 06:09  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by Joonatan1998\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-04-12T18:15:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EWould you object if Squad added in an engine that had an ISP of 1000 and a thrust of 5000? Or would you just accept it and say, well that\u0027s how they ment it to be. Kasuha, doesn\u0027t your argument go against the point of the suggestions page?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI love answers like this.\u003C/p\u003E\u003Cp\u003EBecause they are answered with a simpler response.\u003C/p\u003E\u003Cp\u003EDon\u0027t like it, don\u0027t use it.\u003C/p\u003E\u003Cp\u003ESimple as that.\u003C/p\u003E\u003Cp\u003EIt applies to the whole ARM patch, if you don\u0027t like something DON\u0027T use it! I personally don\u0027t like the stock KSP, so I don\u0027t use the stock KSP, I have more mods than some of you have hairs on your chin. \u003C/p\u003E\u003Cp\u003EArguing and crying about updates is like screaming at the clouds because they are blocking the sun when you are at the beach or crying because it is raining outside on your day off. It is pointless and a waist of everyones energy listening to it. So suck it up, drive on, and cowboy the f* up!\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2014-04-12T18:30:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joonatan1998\u0022 data-cite=\u0022Joonatan1998\u0022\u003E\u003Cdiv\u003EI am not speaking about your playstyle.\u003Cp\u003EI am speaking about people that do things like an 40t grand tour.\u003C/p\u003E\u003Cp\u003EI never said that everyone is trying to build the most efficient crafts possible.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know what you are speaking of, it simply does not change the point.\u003C/p\u003E\u003Cp\u003EYou can use other parts, still there, still working parts.\u003C/p\u003E\u003Cp\u003EIf you choose not to because you want the best efficiency , that is still all just a choice.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-12T18:49:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Joonatan1998\u0022 data-cite=\u0022Joonatan1998\u0022\u003E\u003Cdiv\u003EThe whole point of that playstyle is to get the best results possible in the stock game.\u003Cp\u003EThat means that you always use the mathematically best engine.\u003C/p\u003E\u003Cp\u003EBefore it was fun for many people\u003C/p\u003E\u003Cp\u003ENow it is very boring because the new engines are almos always the best.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWas it really much better before ARM? We already had the 48-7S on everything small and a lot of things not small, the Mainsail as \u003Cem\u003Ethe\u003C/em\u003E heavy lift engine, the LV-N streets ahead for big interplanetary ships (unless you have the patience of a saint in which case you use the ion engine), asparagus as the One True Staging, I could probably go on.\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-04-12T19:15:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003ELet\u0027s turn this on its head, would it seriously cripple peoples play if the parts were balanced? I don\u0027t think so.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat begs the question. It already decides they are unbalanced. No one is arguing against balancing them. The fact is, there is nothing to balance them against currently in the Alpha.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SofusRud\u0022 data-cite=\u0022SofusRud\u0022\u003E\u003Cdiv\u003EI feel like I\u0027m repeating myself here.\u003Cp\u003EDoes it not worry you that the new engines have made Rocket Singe Stage To \u003Cstrong\u003ELaythe\u003C/strong\u003E craft not just possible, but really easy to throw together, using only one engine (x7)? Could you do that in the demo?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe game has a scaled solar system, extra think atmospheres, humongous gravity wells for tiny planets... and your suggesting the fact real life stat based rockets can fly to laythe (pre and post ARM!) has balance issues? Sit back, consider that thought process for a moment.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T19:27:10Z\u0022 title=\u002204/12/2014 07:27  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by Technical Ben\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-04-12T20:18:14Z","Content":"\n\u003Cp\u003EI think I am very bored of the circularity of this argument now.\u003C/p\u003E\u003Cp\u003EKSP used to be a game where you could put time into learning to design spacecraft, fly them and navigate the system. To all intents there is no point in the first of these any more because once someone has learnt to put a few parts together in the VAB that\u0027s the only design they\u0027ll ever need. Fine - it makes it easy for all the people who aren\u0027t interested in designing ships. Flying and navigating will be trivial too once MJ or similar autopiloting is stock and we\u0027ll probably have hundreds of \u0022but I don\u0027t want this, it makes it too easy\u0022 threads.\u003C/p\u003E\u003Cp\u003EThen KSP will be a career game where you don\u0027t need to know much in order to build, fly and navigate spaceships. The instant-gratification-gamers will be happy and the rest of us can remember the solution - self-control and/or mods. Let\u0027s just hope for everyone\u0027s sake that Squad is happy with the worldwide fame, acclaim and success of KSP :-)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T21:27:35Z\u0022 title=\u002204/12/2014 09:27  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by Pecan\u003C/strong\u003E\n\u003Cbr\u003ERemoved inappropriate and offensive reference\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-12T20:42:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EWas it really much better before ARM? We already had the 48-7S on everything small and a lot of things not small, the Mainsail as \u003Cem\u003Ethe\u003C/em\u003E heavy lift engine, the LV-N streets ahead for big interplanetary ships (unless you have the patience of a saint in which case you use the ion engine), asparagus as the One True Staging, I could probably go on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd each of those (bar the mainsail, which had its own problems) were complained about before ARM was even announced. Giving us complainers all something even worse to complain about is not the way to stop complaints.\u003C/p\u003E\u003Cp\u003EBy the same token, several underperforming engines were deservitively buffed, like the Ant and Ion, but the Mk 55 is just as underperforming as the 48-7s is overpowered, and neither was fixed. \u003C/p\u003E\u003Cp\u003EThe Lv-N is in a class of it\u0027s own because there are only 2 high efficency space engines- but with the buff to the ion\u0027s power, I expect the Ion to start being a realistic choice in comparison- less thrust certiantly, but even more efficient, with other engineering problems like power management. Another engine covering the area between the Nerva and the other LV series, something with 600 ISP but a better TWR than the nerva (heck, you could rework the Ant engine into this! so it isnt competing with RCS ports anymore) would round out the curve and make LV-N engines a real choice. \u003C/p\u003E\u003Cp\u003EThe mainsail\u0027s problem was the same one the nerva has- it was on the curve, but so far from it\u0027s neibors that there was no choices to be made- If you needed more thrust than a skipper, either you stacked a dozen or so LV30s together to get the thrust you needed, or you got a mainsail. With the addition of the LFB, the Stock Rebalance proect has actually reduced the power of the mainsail, giving you a more efficient engine than the (nerfed) LFB, that has more power than a skipper, to give people more choices.\u003C/p\u003E\u003Cp\u003EAsparagus is the tricky one, because on paper, it IS the \u0022one true staging.\u0022 The Shuttle External Tank was the first crude appproximation of this, but the idea has been around for over 50 years. The best we can hope for in KSP is to mimic the drawbacks as well as the advantages- fuel flow momentum, and heavy and expensive pumps- but even in real life, SpaceX is attempting to overcome these difficulties with it\u0027s heavy lift designs.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-04-12T20:43:51Z","Content":"\n\u003Cp\u003ESo just putting a rocket together makes everything happen? So the entire game is DV and TWR limited? I never knew... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}