{"TopicId":68757,"ForumId":32,"TopicTitle":"How do you feel about part clipping?","CreatedByName":"XyllyX","CreatedById":105335,"CreatedDateTime":"2014-04-09T10:36:21Z","PageNum":4,"Articles":[{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2014-04-09T22:07:56Z","Content":"\n\u003Cp\u003EI am completely fine with it as long as it is for aesthical reasons and not cheating like for example clipping \u0022thousands\u0022 of air intakes or similar.\u003C/p\u003E\u003Cp\u003EBut that is just me... I say do whatever you want as long as it makes the game fun for you to play.\u003C/p\u003E\n"},{"CreatedByName":"ayana","CreatedById":105618,"CreatedDateTime":"2014-04-09T22:55:15Z","Content":"\n\u003Cp\u003EOnly ever for RCS thrusters. Or plane engines when symmetry is refusing to work.\u003C/p\u003E\n"},{"CreatedByName":"HelmyJune","CreatedById":104897,"CreatedDateTime":"2014-04-09T23:33:14Z","Content":"\n\u003Cp\u003EI pretty much just leave clipping turn on in the debug menu. Not because I prefer clipping parts but because of KSP\u0027s wonky clipping detection. I don\u0027t even know how many times I\u0027ve been building a rocket and you have to perform some magic handshake to get a part to place in a position where it isn\u0027t even clipping anything. But the editor will allow you allow you to place items inside of fuel tanks and stuff as long as you don\u0027t actually clip through the textures.\u003C/p\u003E\u003Cp\u003EI consider that cheating more than say clipping the edges of engines together to make an actually decent cluster. Now that the new engines are out I don\u0027t see myself making anymore custom engine clusters though. They were pretty much the only reason I ever turned on clipping to actually clip items together.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-04-10T03:25:19Z","Content":"\n\u003Cp\u003EBecause of how the KP atmospheric model works, clipping doesn\u0027t seem to add any calculable advantages to a craft compared to a non-clipped part.\u003C/p\u003E\u003Cp\u003EHere are my reasons:\u003C/p\u003E\u003Cp\u003E1.) Clipping parts for an aesthetically pleasing craft does not make the craft any more aerodynamic or fly further than a non-clipped part, since the game calculates drag based on mass regardless of an item clipped into another. A 20 part non clipped plane will still impart the same amount of drag as a 20 part clipped plane.\u003C/p\u003E\u003Cp\u003E2.) Clipping parts doesn\u0027t make the craft lighter because the game still calculates the mass of each part and you are still going to have to lift that extra weight anyway.\u003C/p\u003E\u003Cp\u003E3.) Clipping engines to give a higher TwR still provides the same amount of thrust as a non-clipped cluster of the same type of engine. They both consume the same amount of fuel and have the same ISP.\u003C/p\u003E\u003Cp\u003E4.) The only advantage clipping seems to give is real estate space on a craft and making it look less ugly. \u003C/p\u003E\u003Cp\u003EUnless clipping allows you to fly further than a conventional craft that doesn\u0027t use clipping, then I would consider it cheating. For example, I consider intake stacking/clipping a bit cheating because it makes you fly higher and further than you normally would.\u003C/p\u003E\n"},{"CreatedByName":"WooDzor","CreatedById":72106,"CreatedDateTime":"2014-04-10T06:12:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E\u0027I hardly ever see rockets that feature heavy clipping\u0027 (..) \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcuse me..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/9346020/Gemini%20XIIII/2.png\u0022 alt=\u00222.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/9346020/Saturn1a%26b/preview.png\u0022 alt=\u0022preview.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI love clipping. I\u0027d clip my two dogs together with my cat if it would make something decent looking. It just allows you to make things look nice and give a bit more personal touch to whatever you build instead of launching the same old CM on the next asparagus rocket.. \u003C/p\u003E\u003Cp\u003EI like realistic looking rockets, if that means I have to clip and mess around with the spacial dimensions of parts a bit.. meh \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-10T09:34:08Z\u0022 title=\u002204/10/2014 09:34  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 10, 2014\u003C/time\u003E by WooDzor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hurry- Starfish!","CreatedById":90298,"CreatedDateTime":"2014-04-10T10:35:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThere\u0027s a range of part clipping. Clipping one fuel tank inside another to double its capacity feels cheaty to me, clipping the edges of an engine (not the nozzle) to make an engine cluster does not.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBasically this. I use clipping (and cubic struts) quite a lot, but only for stuff that looks reasonable, not for blatantly violating physical laws. For example, I use it to create afromentioned engine clusters. I also clip structural parts into each other or into fuel tanks. But stuff like the above rocket with intersecting filled fuel tanks (or intakes, or even \u003Cem\u003E*shudder*\u003C/em\u003E command pods) is going too far. My criterion is it has to look believable, within the Kerbal universe.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-10T10:37:57Z\u0022 title=\u002204/10/2014 10:37  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 10, 2014\u003C/time\u003E by Hurry, Starfish!\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2014-04-10T10:37:59Z","Content":"\n\u003Cp\u003Eits all about the fun. so, i am clipping like a mofo \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E until my fingers clip through the keyboard!\u003C/p\u003E\n"},{"CreatedByName":"Quiana","CreatedById":107476,"CreatedDateTime":"2014-04-10T15:26:25Z","Content":"\n\u003Cp\u003EOccasionally, non-debug clipping is something I do when it logically makes sense. See this example:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HnYQhWU.jpg\u0022 alt=\u0022HnYQhWU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENotice how I clipped the probe core into the hollow strut along with a xeon tank. It gives some use of the \u0027empty space\u0027 in the middle of the device without breaking logically an action that should be possible.\u003C/p\u003E\u003Cp\u003EEdit: This is actually a satellite for a challenge I\u0027m participating in, with a requirement that it must have thrust, RCS, power itself, and have two forms of communications with three science modules. As well as being at least 1.25 tons (tops out at precisely 1.26 fully fueled).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-10T15:29:20Z\u0022 title=\u002204/10/2014 03:29  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 10, 2014\u003C/time\u003E by Quiana\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-04-10T15:32:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Quiana\u0022 data-cite=\u0022Quiana\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENotice how I clipped the probe core into the hollow strut along with a xeon tank. It gives some use of the \u0027empty space\u0027 in the middle of the device without breaking logically an action that should be possible.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s about the limit of clipping I do too. Putting things inside the empty space, or crossing structural components. Nothing that requires debug or save-editing. A good example also is when I let some of the monopropellant tanks clip into each other a little, to look like one medium-sized tank:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.necrobones.net/screenshots/KSP/KSP%202014-02-24%2020-03-30-81.jpg\u0022 alt=\u0022KSP%202014-02-24%2020-03-30-81.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Heagar","CreatedById":67859,"CreatedDateTime":"2014-04-10T16:00:43Z","Content":"\n\u003Cp\u003EClipping is a thing i believe everyone have to decide on her/his own.\u003C/p\u003E\u003Cp\u003EI do it on a minor base. You see two two-stage landers in comparison. Both where used for an apollo alike craft.\u003C/p\u003E\u003Cp\u003EThe first is without clipping.\u003C/p\u003E\u003Cp\u003EThe second is with clipping, because the VAB wasn\u0027t so tall at that time i had to shrink the second two-man lander. And since this craft should carry a rover and a few sience-packs, i used octagonal struts for additional attach-points.\u003C/p\u003E\u003Cp\u003EAnd more clipping i do mostly when it comes to a base for the looks with structural elements.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/bgapX\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2014-04-10T16:04:27Z","Content":"\n\u003Cp\u003EI always have part-clipping enabled, but I never use it to do anything blatant, like putting parts very far inside each other. Most often, I have to turn on part clipping simply because the game won\u0027t let me put parts in places where there is *nothing at all* blocking the parts from being placed. The VAB is just buggy and my parts are \u0022clipping\u0022 with something that is non-existent.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-10T16:23:57Z","Content":"\n\u003Cp\u003EI practically never use it on purpose, and work pretty hard to avoid it where possible.\u003C/p\u003E\u003Cp\u003EI think the biggest and cheaty-est issue I have with it is intake spamming, which I\u0027ve seen used and suggested too many times to count. There seems to be a big contingent of players who think it\u0027s somehow realistic or intended by the devs.\u003C/p\u003E\n"},{"CreatedByName":"Mister Kingdom","CreatedById":105121,"CreatedDateTime":"2014-04-10T16:52:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENotice how I clipped the probe core into the hollow strut along with a xeon tank. It gives some use of the \u0027empty space\u0027 in the middle of the device\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E It always seems logical to me to do this. I tend to do things like clip RCS tanks into Large ASAS modules, as they are, according to the game, hollow, and it makes less sense, from a design point of view, to have the tanks on the outside when you have a load of empty space on the inside of the rocket. Also, the vehicle looks better when all of the components are somewhat hidden. That being said, I am sometimes guilty of taking this too far, such as putting several intakes halfway into a fuel tank. ( I don\u0027t really consider this \u0022Cheating\u0022, as they aren\u0027t fully hidden, and most of the surface area is exposed, especially when you reduce the amount of fuel in the tank according to how much of the intake is inside)\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2014-04-10T17:26:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majorjim\u0022 data-cite=\u0022Majorjim\u0022\u003E\u003Cdiv\u003EI never used part clipping until I saw what was possible with it.\u003Cp\u003EMost good looking rockets could not be built without it. I also see a lot of people posting here who use mods and yet say\u003C/p\u003E\u003Cp\u003Eclipping is cheating. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EMJ\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the correct answer. My Open Source Construction Techniques for Craft Aesthetics thread would be awfully sparse if people didn\u0027t use clipping.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-04-10T23:17:24Z","Content":"\n\u003Cp\u003EI have no problems with part clipping. I tend to do it to make vehicles look right, rather than to make advantages for myself. You know, stuff like clipping the bicoupler and two fuel tanks into a Structural fuselage so I can fill the gap in the middle. Strapping two engines side-by-side in a situation where the game says \u0022You can\u0027t do that, even though nothing\u0027s touching it.\u0022 I have used it to clip things like cockpits into a node covered by something else, or to drop a reaction wheel inside a structural part.\u003C/p\u003E\u003Cp\u003EI follow a couple simple guidelines with clipping: Fuel tanks can\u0027t be clipped into, but they can clip with other parts. Burying antennas is fair game. Cockpits that need stronger SAS can have more SAS wheels clipped in through the bottom. And most importantly, I follow a logical rule of 3 intakes per engine.\u003C/p\u003E\n"},{"CreatedByName":"Redrobin","CreatedById":93744,"CreatedDateTime":"2014-04-10T23:41:16Z","Content":"\n\u003Cp\u003EI clip all the things. I would be nowhere without clipping.\u003C/p\u003E\n"},{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-04-11T00:54:39Z","Content":"\n\u003Cp\u003EI usually clip parts for aesthetics. For instance, putting batteries inside a plane fuselage, rather than glued to the outside. I don\u0027t stack intakes or wings, because that takes the challenge out of it for me, and the textures fighting for dominance on the screen look awful, to boot! With that said, I don\u0027t give any thought to what parts people clip or not. It\u0027s their money, their time, and their business.\u003C/p\u003E\n"},{"CreatedByName":"makinyashikino","CreatedById":96244,"CreatedDateTime":"2014-04-11T01:43:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E \u003Cem\u003E\u003Cstrong\u003Edon\u0027t let anyone tell you you\u0027re having fun the wrong way.\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis needs to be posted in every single 23.5 engine argument thread\u003C/p\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2014-04-11T02:48:30Z","Content":"\n\u003Cp\u003EI think that engine clusters are fine as long as the nozzles aren\u0027t overlapping, and a certain amount of clipping on spaceplanes is necessary to have it still look like a plane. Also useful when making replicas of real world rockets. But all of my regular science gathering missions on career mode aren\u0027t clipped.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-04-11T03:47:30Z","Content":"\n\u003Cp\u003EI rarely enable part clipping in the debug menu, but I use part clipping a lot. Some things clip without issue, others can be made to clip by doing some slight of hand with the editor (like attaching a part to another part first and then moving it, or rotating it back and forth a couple times).\u003C/p\u003E\u003Cp\u003EThe only time I use the debug menu for clipping is when (usually in the SPH) a part will attach if you don\u0027t have symmetry on, but refuses to attach on the other side when you enable symmetry (usually when attaching jet engines). If after trying to coerce it with rotating and it still wont attach then I\u0027ll use the debug menu. \u003C/p\u003E\u003Cp\u003EAnother trick is to use an SAS module. If you want a part to clip and it won\u0027t then first place an SAS module somewhere else and attach the part to the SAS module. Then move the SAS module with the part attached and try to connect that to where the part was refusing to connect, often it will work. It\u0027s also a way to get a part that wants to radially attach to stack onto a node that\u0027s surrounded by other parts. you do end up with an extra SAS module or two, but sometimes its worth it.\u003C/p\u003E\u003Cp\u003EThe reason is always for aesthetics. This is a simple craft I\u0027ve made recently as an Orion replica. To get the fuel section thinner than the pod I put a central tank and then four tanks radially attached but rotated 90 degree so they overlap the inner tank. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/e5RSrao\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/e5RSraol.jpg\u0022 alt=\u0022e5RSraol.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou don\u0027t gain any advantage except for a nicer appearance, and you can run a greater risk of things exploding when you decoupling stages. So I don\u0027t have any problem with clipping, whether its by using the debug menu or not, it just allows for more creative designs.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-04-11T03:53:57Z","Content":"\n\u003Cp\u003EIf I clip something its because its giving me collision issues (I\u0027m looking at you B9 quad engine mount) or because it does that anyway (without the menu). I have no personal issue with those that use it ( and I couldn\u0027t build some of their stuff because of it) but I don\u0027t personally use it.\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2014-04-11T04:33:09Z","Content":"\n\u003Cp\u003EPictured here, clipping:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/E9DEAT3.png\u0022 alt=\u0022E9DEAT3.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2014-04-11T04:36:26Z","Content":"\n\u003Cp\u003EI don\u0027t use it. Seems like cheating to me. If other people do so, it\u0027s their game.\u003C/p\u003E\n"},{"CreatedByName":"loppnessmonsta","CreatedById":58525,"CreatedDateTime":"2014-04-11T06:02:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThere\u0027s a range of part clipping. Clipping one fuel tank inside another to double its capacity feels cheaty to me, clipping the edges of an engine (not the nozzle) to make an engine cluster does not. But that\u0027s just me, I don\u0027t care a whole lot about aesthetics.\u003Cp\u003EBasically, if part clipping increases your enjoyment of the game, go ahead and don\u0027t let anyone tell you you\u0027re having fun the wrong way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Epretty much this. i generally only use part clipping to attach parts that SHOULD be attachable anyway, but for some reason are being stubborn. Sometimes I\u0027ll do stuff like what OP did; getting stuff close together for looks. Or engine clusters. I don\u0027t like to double stack tanks or engines, though. Feels cheaty to me. But that\u0027s okay- I just don\u0027t do it. I still like seeing what other people do with it. Lots of cool SSTOs wouldn\u0027t be possible without it!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-11T06:05:20Z\u0022 title=\u002204/11/2014 06:05  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 11, 2014\u003C/time\u003E by loppnessmonsta\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-11T06:24:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EYou don\u0027t gain any advantage except for a nicer appearance, and you can run a greater risk of things exploding when you decoupling stages. So I don\u0027t have any problem with clipping, whether its by using the debug menu or not, it just allows for more creative designs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis pretty much sums up my thoughts on the matter. I clip when it\u0027s convenient, too. My recent Moho lander had an SAS module clipped into a Science Jr. and some small tanks clipped into short girders in order to shorten the whole craft, not only giving more engine clearance but also easing the length of the launch vehicle (the payload in total was ridiculously long).\u003C/p\u003E\n"}]}