{"TopicId":70423,"ForumId":32,"TopicTitle":"Confess your KSP sins","CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-25T00:30:38Z","PageNum":22,"Articles":[{"CreatedByName":"Astronomer","CreatedById":18673,"CreatedDateTime":"2014-10-16T12:30:24Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EI spend 80% of my time in KSP for mod development.\u003C/strong\u003E And yet I still spent hundreds of hours actually playing.\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2014-10-16T14:37:43Z","Content":"\n\u003Cp\u003EI put vital components of my ships inside their fuel tanks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2014-10-16T16:12:58Z","Content":"\n\u003Cp\u003EI\u0027ve never purely legitimately built a Stanford Torus (and I\u0027m the one who made that mod for the challenge). I hope to fix that in my newest career run with one over the mun.\u003C/p\u003E\n"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2014-10-17T00:58:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI must confess that I have not destroyed a building yet, either. We need to start a support group or something. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is rather comforting that I am not the only one.\u003C/p\u003E\u003Cp\u003EHowever I might have cooked up a plan to change the destroyed building tally. Still not going to to directly target my own buildings though. Collateral damages are to be expected.\u003C/p\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2014-10-17T04:22:03Z","Content":"\n\u003Cp\u003EBeen playing a year and didn\u0027t even visit all the planet yet or do a grand tour (to me a grand tour is no refueling the main ship tho).\u003C/p\u003E\u003Cp\u003EI prefer roving with rovers (and will with electric propeller planes if/when they get in game) rather than flying my rocket from biomes to biomes.\u003C/p\u003E\u003Cp\u003EI once sent Jeb in a solar orbit and let the game at max speed for a whole night. didn\u0027t revert either and my game is showing year -232 now. Odd stuff.. oh and poor Jeb. I later killed the mission and he showed back up, but I kept the weird date as a reminder of what not to do.\u003C/p\u003E\u003Cp\u003EI let the poor kerbals asking to be saved die in orbit (career missions). Hey it was their space agency\u0027s fault, not mine !\u003C/p\u003E\u003Cp\u003EI farm money by putting satellites around each moon/planet and doing quick 0.0 point science.\u003C/p\u003E\u003Cp\u003EI am a completitionnist and will send a Kerbal into a 6year mission for a couple of 0.1 science gain somewhere on Dres or worse.\u003C/p\u003E\u003Cp\u003EI never run difficulty mods (DRE, FAR, supplies, etc) but will install a mod for ONE piece (ie: M27 cockpit from B9, COSMOS for the large solar panels, ditto for for future tech).\u003C/p\u003E\u003Cp\u003EI modify stock parts to meet my need (Rapier? Check, Ion? Check)... hey that 2 thrust is trying my patience (bumped to 5), but I am thinking about flight computer just to do these burns precisely while doing something else in RL. What\u0027s a 90min burn if the CPU does it for me.\u003C/p\u003E\u003Cp\u003EI keep promising my Kerbals they\u0027ll go to Duna, Laythe, or other fun places... Only for them to always end-up on Minmus or Moon stuck in rovers for god knows long.\u003C/p\u003E\u003Cp\u003EI use part clipping to make small landers, and beautiful things. \u003C/p\u003E\u003Cp\u003EI prefer beauty over efficiency, making odd design choices sometimes.\u003C/p\u003E\u003Cp\u003EI keep posting everywhere that I want Stock Electric propellers (gah! sinned again)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-17T04:25:44Z\u0022 title=\u002210/17/2014 04:25  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 17, 2014\u003C/time\u003E by Francois424\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"chrisb2e9","CreatedById":87224,"CreatedDateTime":"2014-10-17T04:32:47Z","Content":"\n\u003Cp\u003EI have edited the science lab to have 4000 battery and 60 torque in each axis. I have also edited the nuke engines to have 200 thrust.\u003C/p\u003E\u003Cp\u003EI put mech Jeb into every control module because I am too lazy to attach the part.\u003C/p\u003E\n"},{"CreatedByName":"el_coyoto","CreatedById":49292,"CreatedDateTime":"2014-10-17T15:00:40Z","Content":"\n\u003Cp\u003EFirst thing I do in all my careers is science spam around KSC, before launching anything.\u003C/p\u003E\u003Cp\u003EI\u0027m also guilty of sending my kerbals to the most boring places in the Kerbol system, plundering as much science as I can from Mun and Minmus before doing anything fun.\u003C/p\u003E\u003Cp\u003EI revert to the VAB whenever the flight is not perfect, spending hours to tweak a sepatron on a radial booster so that it decouples nicely and other useless OCD stuff.\u003C/p\u003E\u003Cp\u003EI build everything perfectly balanced, if not symmetrical. Always.\u003C/p\u003E\u003Cp\u003EI like airhogging and OP stock turbojets.\u003C/p\u003E\u003Cp\u003EI can\u0027t live without Editor Extensions.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-10-17T15:56:46Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EI have used HyperEdit\u003C/strong\u003E a few times to refill resources on really really long difficult missions where I realized that I haven\u0027t quicksaved in a long time and I\u0027m just about to run out of power and only need a few seconds more. If I was \u003Cstrong\u003Eway\u003C/strong\u003E off and not even close to returning, \u003Cem\u003Ethen\u003C/em\u003E I consider it a failure and start over.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI have used the debug menu\u003C/strong\u003E\u0027s infinite fuel or RCS for the same reason as above.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI am lazy\u003C/strong\u003E because I use MechJeb to execute nodes for me, and lift off into orbit even though I\u0027m more than capable of doing any operation myself. I just find the repetition boring after years of playing. I just find the repetition boring after years of playing. I just find the repetition boring after years of playing.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI have sticky pad sheets everywhere\u003C/strong\u003E around my computer with phase angles and required delta-v written on them for every planet so that I don\u0027t have to visit \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E every time. I also have all the stats of my favourite launchers that I use written down.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI build useless gigantic space stations\u003C/strong\u003E that have no purpose for no reason, and once I\u0027m done, I return all the crew to Kerbin, dock an engine to it and watch as it de-orbits through the atmosphere and gets torn apart.\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2014-10-22T20:14:32Z","Content":"\n\u003Cp\u003EOnce, *sniff* I hyperedited a ship into orbit that was way too big to launch. *breaks down crying*\u003C/p\u003E\n"},{"CreatedByName":"Las-pen","CreatedById":121174,"CreatedDateTime":"2014-10-22T20:42:54Z","Content":"\n\u003Cp\u003E-I use \u003Cstrong\u003EHyperEdit\u003C/strong\u003E regularly\u003C/p\u003E\u003Cp\u003E-I only play \u003Cstrong\u003Esandbox\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-I \u003Cstrong\u003Edon\u0027t use MechJeb\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-I reeeeeeeeaaaaaallly \u003Cstrong\u003Ehate Jebediah Kerman\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-\u003C/strong\u003EIf I ever install a mod, it has to look as stock as possible. Or have a really good reason why it should be installed.\u003C/p\u003E\u003Cp\u003E-I \u003Cstrong\u003Edon\u0027t use FAR/NEAR\u003C/strong\u003E (have tried. Makes the game unplayable to me)\u003C/p\u003E\u003Cp\u003E-Calculations, those are for sissies (or those who are good at math)\u003C/p\u003E\u003Cp\u003E-\u0022Return flight?\u0022 You mean \u0022Revert to Hangar?\u0022\u003C/p\u003E\u003Cp\u003E-\u0022Wait for planets to align to their correct positions before launching interplanetary mission?\u0022 Did you mean \u0022Now!\u0022\u003C/p\u003E\u003Cp\u003E-I actually bought a joystick just to play KSP. It doesn\u0027t work properly. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EI\u0027ve never watched a Scott Manley video.\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can say I have tried, but I find his accent so annoying it renders them unwatchable to me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T21:14:31Z\u0022 title=\u002210/22/2014 09:14  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Las-pen\u003C/strong\u003E\n\u003Cbr\u003Eadded a sin, fixed typo\n\u003C/span\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-10-22T21:26:15Z","Content":"\n\u003Cp\u003EOnce I got stuck in orbit and got Jeb out to push but I got impatient and said I\u0027ve done this before I can do it so I just turned on cheats.\u003C/p\u003E\n"},{"CreatedByName":"Yakky","CreatedById":94432,"CreatedDateTime":"2014-10-22T22:49:18Z","Content":"\n\u003Cp\u003EI launched an armada of 60 small \u0022Kessler\u0022 satellites into retrograde (reverse) orbit around Kerbin at my most popular/crowded altitude of about 80 km, just to see whether any interesting collisions would ever occur. This has recklessly imperiled the lives of all Kerbals who have blasted off into space since then. (But man is it fun to watch the Kesslers whiz by at 5 km/sec relative velocity!)\u003C/p\u003E\u003Cp\u003EOnce, when a spaceplane ran out of maneuvering fuel high in the atmosphere during re-entry and came in pointed retrograde, I forced some randomly-named Kerbal (rather than his orange-suited companion Bob Kerman) to do an EVA and try to push the nose around at 60,000 meters (and falling really fast). Atmospheric drag soon overcame him and I was forced to bracket-key back to the main craft. We never saw him again and I can\u0027t even remember his name.\u003C/p\u003E\u003Cp\u003EI accepted a rescue contract but forgot to clear the capsule before lift-off. I forced the original pilot to re-enter hanging on the outside so there would be room for the rescued Kerbal in the capsule and I would still be able to fulfill the contract and get the funds. The pilot did not survive re-entry.\u003C/p\u003E\u003Cp\u003EI am seriously considering spending $4,000 on a maxed-out retina iMac just so I can play KSP at 5k resolution.\u003C/p\u003E\u003Cp\u003EI dream about KSP.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T23:00:02Z\u0022 title=\u002210/22/2014 11:00  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Yakky\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-10-23T02:00:13Z","Content":"\n\u003Cp\u003EAs with many: much abuse of F5/F9.\u003C/p\u003E\u003Cp\u003EI downloaded Realism Overhaul and then uninstalled it.\u003C/p\u003E\u003Cp\u003EI once got impatient and infinite-fueled my way to a rendezvous.\u003C/p\u003E\u003Cp\u003EI subjected my Kerbals to explosive decoupling. Sadly, either FAR or DRE is keeping me from doing it anymore.\u003C/p\u003E\u003Cp\u003ENow that I\u0027ve got 6.4x RSS, I\u0027m too afraid to send live Kerbals anywhere, and am doing a 99% unmanned space program.\u003C/p\u003E\u003Cp\u003EI never re-use booster designs, resulting in explosions (escape, revert-to-VAB).\u003C/p\u003E\u003Cp\u003EIn sandbox mode, I have slain literally hundreds of Kerbals trying to build spaceplanes which don\u0027t simply slam into the water past the edge of the runway.\u003C/p\u003E\n"},{"CreatedByName":"MinerEdgar","CreatedById":21247,"CreatedDateTime":"2014-10-23T02:06:18Z","Content":"\n\u003Cp\u003EDespite having the game since .13 i\u0027ve only been to Duna legitimately once.\u003C/p\u003E\n"},{"CreatedByName":"KevinW42","CreatedById":66949,"CreatedDateTime":"2014-10-23T03:49:38Z","Content":"\n\u003Cp\u003EWhile I\u0027m perfectly capable of launching to orbit, I\u0027m bad at flying efficient ascents, so I always have Mechjeb do it.\u003C/p\u003E\u003Cp\u003EI don\u0027t plan my missions based on which transfer window is coming up. I just put my entire space program on hold for a couple years while I time warp to the opening I want.\u003C/p\u003E\u003Cp\u003EI follow the Soviet Union\u0027s example and say any launch that fails before making it to space doesn\u0027t count.\u003C/p\u003E\n"},{"CreatedByName":"milosh","CreatedById":104352,"CreatedDateTime":"2014-10-23T05:50:02Z","Content":"\n\u003Cp\u003E- I used Debug Menu to complete two missions when I had only two unlocks left in Career Mode, because I was completely out of money and forgot that I get money already by accepting a contract.\u003C/p\u003E\u003Cp\u003E- I never mind to warp a year forward for a good starting window towards a planet, finished career in year 15 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E- After transitioning once manually to Duna I always use Mechjeb Porkchop to reach a planet. But I\u0027m not always going for the most DeltaV efficient launchwindow, if 200 more Delta mean I don\u0027t need to warp a year forward, I\u0027d take it.\u003C/p\u003E\u003Cp\u003E- I killed one of the Kerbals during EVA on Duna, to high groundspeed while trying to \u0022land\u0022 with his RCS pack. Sadly I forgot his name but his mission won\u0027t be forgotten, he was the first Kerbal in my Career to have ever put a foot on another planet.\u003C/p\u003E\n"},{"CreatedByName":"MuXu96","CreatedById":33089,"CreatedDateTime":"2014-10-23T14:59:45Z","Content":"\n\u003Cp\u003EI have over 150hours and most of my missions are one way tickets to a planet.. I rarely implement fuel and parts to go back home Q_Q\u003C/p\u003E\n"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2014-10-23T16:50:02Z","Content":"\n\u003Cp\u003EI never sit down and try to calculate how much deltaV I\u0027ve actually got in a package, nor do I spend nearly enough time testing stuff on Kerbin before sending it up. As a result, I landed on Tylo successfully, but only by using the orbital tug that was supposed to take my lander home as a descent stage. When I actually got to the surface, I then couldn\u0027t plant the flag because I stupidly left an MK-1 lamp sticking right out of the middle of my descent ladder (D\u0027ohh!). Fortunately I had other ships in the system that were able to rescue my stranded lander, or else poor Anfrod would have been stuck in Tylo orbit forever.\u003C/p\u003E\n"},{"CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2014-10-23T19:20:09Z","Content":"\n\u003Cp\u003Emost of the time my missions and time building starts with \u0022i should destroy that thing on that planet/mun that i put there earlier\u0022 \u003C/p\u003E\u003Cp\u003Ewhich normally ends up in me uploading a non blow crap up version of things with an excuse for it to exist like transporting kerbals or something.\u003C/p\u003E\u003Cp\u003EI also know way less about KSP than people think, i just try things until they work. Not enough fuel to get to the mun? re build try again, i dont calculate anything.\u003C/p\u003E\n"},{"CreatedByName":"toric5","CreatedById":58046,"CreatedDateTime":"2014-10-24T04:52:01Z","Content":"\n\u003Cp\u003Ecouple things accumulating into one big thing:\u003C/p\u003E\u003Cp\u003Ei can\u0027t stand warping more than about a week. if there is that much time, ill do some stuff on the mun/minnmus.\u003C/p\u003E\u003Cp\u003Eeverything about a rocket has to be perfect. error during launch? revert. something broke off while landing? revert to last quick save. (although I\u0027m starting to limit myself to launch reverts and areobreakings)\u003C/p\u003E\u003Cp\u003Ei overengeneer by default, but can\u0027t stand it and constantly redesign.\u003C/p\u003E\u003Cp\u003Ei reset my game almost every save.\u003C/p\u003E\u003Cp\u003Eresult: I\u0027ve landed on duna once, KSP updated before i could get a transfer window back. the rest of the times i haven\u0027t even got any transfer windows.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2014-10-24T05:54:36Z","Content":"\n\u003Cp\u003E- \u003Cstrong\u003EMost of the (forum) Rep I\u0027ve got was due to being nice or funny\u003C/strong\u003E. There\u0027s talented modders and fantastic craft builders with less Rep than I\u0027ve got. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003E- \u003Cstrong\u003EI procrastinated the living hell out of my first manned Duna mission\u003C/strong\u003E. Been playing since 0.17, but I finally did it about a week before 0.25 was released. They\u0027re still there, assuming they didn\u0027t die when I deleted 0.24 for good.\u003C/p\u003E\u003Cp\u003E- \u003Cstrong\u003EI get irrationaly annoyed when someone writes \u0022Minimus\u0022, \u0022Kerban\u0022 or \u0022Jebidiah\u0022\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E-\u003Cstrong\u003E I once got mad at Regex for being too grumpy\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E-\u003Cstrong\u003E I can\u0027t stand playing stock\u003C/strong\u003E. Every time there\u0027s an update, I\u0027ll make two saves (\u0022modded\u0022 and \u0022stock\u0022), but I always end up deleting the stock one. I feel naked without my mods.\u003C/p\u003E\u003Cp\u003E- \u003Cstrong\u003EI let Mechjeb do most maneuvers for me\u003C/strong\u003E. I\u0027ve been playing for so long, that launching a rocket feels like writing my name. I prefer to focus on building a rocket that performs well and has just the perfect ammount of Delta-V for its job. I always do landings manually, though. Don\u0027t wanna get rusty!\u003C/p\u003E\n"},{"CreatedByName":"viktorserecros","CreatedById":58331,"CreatedDateTime":"2014-10-24T10:17:19Z","Content":"\n\u003Cp\u003ELet\u0027s see...\u003C/p\u003E\u003Cp\u003E1) My only return trip from Duna required me to use the cheat window. I ran out of dV before my trajectory dropped into Kerbin\u0027s atmosphere. I gave myself infinite eva fuel and pushed the capsule back.\u003C/p\u003E\u003Cp\u003E2) I\u0027ve only done one return trip from another planet (see above). I keep planning a grand sandbox mission of depositing a kerbal on every solid body and then returning with a mother ship to pick everybody up. I reset this mission with every update and the furthest I\u0027ve gotten is construction of the mother ship.\u003C/p\u003E\u003Cp\u003E3) I\u0027ve killed 20\u002B kerbals at a time in missions. All time best was realizing as the reentry flames appeared that I left a section of a space station packed with kerbals. \u003C/p\u003E\u003Cp\u003E4) I\u0027ve only ever docked with mechjeb. I wish I still had pictures of how I got so far in #2 without docking.\u003C/p\u003E\u003Cp\u003E5) I\u0027ve never been to Eeloo.\u003C/p\u003E\u003Cp\u003E6) I\u0027ve hit Kerbin\u0027s atmosphere at 8km/s and still accelerating. Nobody in their right mind would ever offer one of my astronauts a life insurance policy.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-10-24T14:07:21Z","Content":"\n\u003Cp\u003EI am still playing .23.5.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2014-10-24T14:31:50Z","Content":"\n\u003Cp\u003EWhen building spacestations or ships with multiple kerbal-holding parts (command pods or crew compartiments), I feel I absolutely must have them connected by parts that can plausibly be travelled through by kerbals (read: structural fuselages). Under no circumstance do I want to have them connected by fuel tanks or things like octagonal struts.\u003C/p\u003E\u003Cp\u003EI know it doesn\u0027t matter and you can use the new transfer kerbal function to hop between compartiments no matter what lies between them, but it just feels wrong to me to hop them across parts that obviously would not have passages in them.\u003C/p\u003E\u003Cp\u003EThis means that my space stations are horribly inefficient and overweight, and on the occasions that I do need to use things like fuel tanks to connect living quarters because of structural reasons, I feel terrible about it for days after.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-24T14:35:02Z\u0022 title=\u002210/24/2014 02:35  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 24, 2014\u003C/time\u003E by Cirocco\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2014-10-24T18:46:22Z","Content":"\n\u003Cp\u003EI stopped playing KSP as soon as it cost money. After a year or so I remembered it exists and bought it around 0.18. Talk about culture shock! The last time I played they had just added the Mun! I still regret what I\u0027ve done but I\u0027ve been loyal since.\u003C/p\u003E\n"}]}