{"TopicId":70423,"ForumId":32,"TopicTitle":"Confess your KSP sins","CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-25T00:30:38Z","PageNum":29,"Articles":[{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2015-01-23T05:55:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022viktor19\u0022 data-cite=\u0022viktor19\u0022\u003E\u003Cdiv\u003ENever \u003Cstrong\u003Estarted\u003C/strong\u003E the career...\u003Cp\u003EUnrelatedly, I\u0027m a F5 abuser.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMan, with 0.90 I decided to stop being a pansy and turned out quickloading, quicksaving and reverting.\u003C/p\u003E\u003Cp\u003EReally make my career more fun with the odd failure.\u003C/p\u003E\u003Cp\u003ELost three probe landers, killed Jeb by trying to get an airplane off the level 1 runway, blew up the pad twice...\u003C/p\u003E\u003Cp\u003EThose have much more impact if I know I can\u0027t fix it by hitting a button.\u003C/p\u003E\n"},{"CreatedByName":"yafeshan","CreatedById":130191,"CreatedDateTime":"2015-01-23T07:41:23Z","Content":"\n\u003Cp\u003E-I can not land safely with an aircraft\u003C/p\u003E\u003Cp\u003E-I am unable to dock manually. Using mecjeb mostly. I specifically collect science to open mecjeb upgrades in new career games.\u003C/p\u003E\u003Cp\u003E-I sacrifice kerbals to succeed on missions (no return back to kerbin) I always use life support mods to ensure kerbals die on barren rocks.\u003C/p\u003E\u003Cp\u003E-I always ignore conventional rockets when i get decent interstellar mod tech.\u003C/p\u003E\n"},{"CreatedByName":"Spheniscine","CreatedById":125755,"CreatedDateTime":"2015-01-23T11:34:41Z","Content":"\n\u003Cp\u003E- I land aircraft with parachutes rather than landing gear. I also abuse the jet engines\u0027 high thrust to launch small aircraft vertically.\u003C/p\u003E\u003Cp\u003E- I also strand kerbals for missions - though I don\u0027t use a life support mod. Sorry, but the contractor didn\u0027t pay for the return trip...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-23T11:37:13Z\u0022 title=\u002201/23/2015 11:37  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 23, 2015\u003C/time\u003E by Spheniscine\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Weebo","CreatedById":57188,"CreatedDateTime":"2015-01-23T16:27:18Z","Content":"\n\u003Cp\u003E1.) \u003Cstrong\u003EI use Mechjeb for orbital Rendezvous\u003C/strong\u003E Because repeating the same task that NASA has been doing with computers over and over again seems stupid.\u003C/p\u003E\u003Cp\u003E2.) \u003Cstrong\u003EI use an orbital transfer calculator to get to other planets\u003C/strong\u003E Because screw that [noise], don\u0027t have the time or Paygrade of a NASA engineer to figure out Delta-V required.\u003C/p\u003E\u003Cp\u003E3.) \u003Cstrong\u003EOften leave tiny teeny little fuel depots in 72KM orbit above Kerbin to actually allow my Space planes a chance to be space planes.\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-23T16:31:35Z\u0022 title=\u002201/23/2015 04:31  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 23, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003Cbr\u003EChanged one word.\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Kingdom","CreatedById":105121,"CreatedDateTime":"2015-01-23T22:28:55Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E1. Still an F5 abuser\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI literally press F5 before any other key, and it\u0027s actually become an addiction; I\u0027ll do it even when I know full well it\u0027ll doom me to failure, such as when I\u0027m close to the surface and going far too fast.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2. I revert any flight that kills a pilot\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHence my perfect, no kill record. I guess I\u0027m just really soft over Kerbals.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3. I never bother realistically following time \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EEach mission is focussed on to the exclusion of all others, so instead of using the year and a half between Kerbin and where ever, I just time warp the whole thing. Especially inexcusable considering I got Kerbal Alarm Clock just so I wouldn\u0027t do this. And still do.\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-01-23T22:35:58Z","Content":"\n\u003Cp\u003EParachutes are the first delta-V budget cut. Every. Single. Time.\u003C/p\u003E\u003Cp\u003EI have a plan though, i\u0027ll use radial parachutes, and use KAS to ditch them once in LKO. That way, if something fails while i\u0027m still getting into orbit around Kerbin, I still have the parachutes, but once i\u0027m at my destination, the smaller stage doesn\u0027t have half a ton of extra weight.\u003C/p\u003E\n"},{"CreatedByName":"Chezburgar7300","CreatedById":114873,"CreatedDateTime":"2015-01-23T22:46:53Z","Content":"\n\u003Cp\u003EI\u0027ve never once used quicksaving or loading. I don\u0027t know if that\u0027s a bad or good thing, but I get a lot of failed missions.\u003C/p\u003E\u003Cp\u003EI cannot for the life of me land spaceplanes. Normal planes? Sure. If it goes into space though it\u0027s not getting back safely.\u003C/p\u003E\u003Cp\u003EI\u0027ve never done a mission to dres. Never. I\u0027ve attempted one to every other planet, but not the sad, lonely space potato.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-01-23T22:57:27Z","Content":"\n\u003Cp\u003EThe only Joolian moon I\u0027ve visited is Laythe. Also, never been to Gilly or Eeloo.\u003C/p\u003E\n"},{"CreatedByName":"Joshwoo70","CreatedById":111345,"CreatedDateTime":"2015-01-24T04:31:52Z","Content":"\n\u003Cp\u003EUses mechjeb for orbital rendezvous.\u003C/p\u003E\u003Cp\u003Echeats on occasions\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EForgets to turn off hack gravity when flying a REAL MISSION\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"GreeningGalaxy","CreatedById":66813,"CreatedDateTime":"2015-01-24T06:57:11Z","Content":"\n\u003Cp\u003EWhee, I\u0027ve got a lot of these! \u003C/p\u003E\u003Cp\u003EI go to Minmus with every other launch, despite it being essentially the Novice Mode Moon with those super-flat lakebeds and super low gravity.\u003C/p\u003E\u003Cp\u003EI don\u0027t have the patience for career mode. Infinite budget or no budget at all!\u003C/p\u003E\u003Cp\u003EI\u0027ve never landed on Tylo. (but I have landed on Thud*)\u003C/p\u003E\u003Cp\u003E*My Thud landing made use of a highly illegal modded antimatter torch engine with crazy thrust and Isp.\u003C/p\u003E\u003Cp\u003EI can never stick to mission plans - sometimes I fly all the way out to Jool with the intention of landing on Laythe, but land on Vall instead because why not.\u003C/p\u003E\u003Cp\u003EI\u0027ve never been to Moho.\u003C/p\u003E\u003Cp\u003EI\u0027ve never even attempted an Eve ascent despite clearly possessing the capability.\u003C/p\u003E\u003Cp\u003EI\u0027ve only landed on Duna once.\u003C/p\u003E\u003Cp\u003EI haven\u0027t been to the Mun (barring my Munarch rope-swing thing) since version .22.\u003C/p\u003E\u003Cp\u003ESince installing DRE, I\u0027ve never even attempted aerocapture.\u003C/p\u003E\u003Cp\u003EPrior to version .90, I hyperedited all of my motherships into orbit instead of building launch vehicles for them. (This has changed, now I use fusion boosters that are so OP that they\u0027re barely better)\u003C/p\u003E\u003Cp\u003EI sometimes run extremely powerful antimatter and fusion engines close to KSC.\u003C/p\u003E\u003Cp\u003EI made a self-insert kerbal and gave her a personal giant torchship.\u003C/p\u003E\u003Cp\u003EI hate going home. In fact, I usually leave my kerbals on the body they\u0027re supposed to explore, even if they have enough fuel to come home, just because it\u0027s more fun to go play with Jeb on Vall than it is to have him in my crew roster at KSC.\u003C/p\u003E\u003Cp\u003EI once made a launch vehicle that wasn\u0027t supposed to be an SSTO but ended up being one anyway.\u003C/p\u003E\u003Cp\u003EAnd finally....\u003C/p\u003E\u003Cp\u003EI don\u0027t know how to reenter safely!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/q88xeqz.png\u0022 alt=\u0022q88xeqz.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ewell, i do, in theory, but i don\u0027t do it often enough and am out of practice.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2015-01-24T13:23:33Z","Content":"\n\u003Cp\u003EI just uninstalled EvE \u003C/p\u003E\u003Cp\u003E......I feel dirty \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-01-25T12:47:02Z","Content":"\n\u003Cp\u003EI made my first North Pole landing, feeling triumphant, only to find out that the whole trip, the Infinite Fuel Cheat was on.. Talk about shortlived triumph..\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fizwalker","CreatedById":78337,"CreatedDateTime":"2015-01-25T15:18:51Z","Content":"\n\u003Cp\u003EHmmmmm\u003C/p\u003E\u003Cp\u003EI also use mechjeb for rendezvous ops... and for launches prior to .90 (and still do for the first stage of my RSS/RO game....)\u003C/p\u003E\u003Cp\u003EI\u0027ve landed on Duna with a probe, but no Kerbal has ever set foot there.... and that is the extent of kerbalized exploration I\u0027ve done.\u003C/p\u003E\u003Cp\u003ENo plane has ever landed safely after .23.5\u003C/p\u003E\u003Cp\u003EUm.. I\u0027ve editted my save to ensure my comsats stay put in their geosynch orbits...\u003C/p\u003E\u003Cp\u003EMy orbital stations become part \u0026lt;insert bad word here\u0026gt; and then get forgotten and unfinished.... (one of the reasons I have barely been outside of Kerbin\u0027s SOI)\u003C/p\u003E\u003Cp\u003EOh! I did ger a kerbal to Jool... literally, as he died during the aerobraking maneuver...\u003C/p\u003E\u003Cp\u003EAnd probably many more that escape my memory right now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T15:21:19Z\u0022 title=\u002201/25/2015 03:21  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by Fizwalker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pillow","CreatedById":136984,"CreatedDateTime":"2015-01-29T13:04:27Z","Content":"\n\u003Cp\u003EI EVA\u0027d a Kerbal shortly before safely landing with a prachuted capsule, he plummeted to the ground an died. I feel sad for him... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"diomondclaw","CreatedById":67011,"CreatedDateTime":"2015-01-29T14:58:14Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EI\u0027m horrible at the game \u003C/strong\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003Cstrong\u003E,i can barely make it to the mun with a kerbal,an i can never make it back\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E^^ thats an understatement \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI almost always use hyperedit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Ei\u0027ve only made it to a other planet with a kerbal once without cheating\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"JebNeedsHelp","CreatedById":117002,"CreatedDateTime":"2015-02-05T16:01:31Z","Content":"\n\u003Cp\u003EMy two most common transgressions:\u003C/p\u003E\u003Cp\u003EUsing RCS to get my ships rotating, but using a quick time warp to stop them. It\u0027s just so convenient! \u003C/p\u003E\u003Cp\u003ERather than waiting to launch when a window opens, I\u0027ll put a ship in orbit first, then time warp it to the window I want. \u0022A year in orbit first? Sure! No problem!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Wabbit","CreatedById":110502,"CreatedDateTime":"2015-02-05T19:34:06Z","Content":"\n\u003Cp\u003EI used hyperedit to farm science so I could get a new node\u003C/p\u003E\u003Cp\u003EI made myself a rule to only use quickload when anbug occurs... But I used it to save a Kerbal from my stupidity.\u003C/p\u003E\u003Cp\u003ESometimes I launch station modules with a single mainsail and infinite fuel.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T19:38:22Z\u0022 title=\u002202/05/2015 07:38  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by Wabbit\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"andrewza","CreatedById":137292,"CreatedDateTime":"2015-02-05T19:38:24Z","Content":"\n\u003Cp\u003EI have yet to have a kerb live through a EVA, they all ways get lost in space.\u003C/p\u003E\n"},{"CreatedByName":"ColourOfFire","CreatedById":135926,"CreatedDateTime":"2015-02-08T22:13:17Z","Content":"\n\u003Cp\u003EI used infite fuel for the first time today... To land on the mun... For some reason the dV stats kerbal engineer gave me were not near what they actually were when the rocket was on its way and my lazy ass decided to trust the numbers instead of thinking back to the 10000234032 mun missions I did before that seemed to carry a lot more fuel.\u003C/p\u003E\u003Cp\u003EI feel dirty now.\u003C/p\u003E\n"},{"CreatedByName":"Redd","CreatedById":115991,"CreatedDateTime":"2015-02-09T13:23:27Z","Content":"\n\u003Cp\u003EI ran so low on funds, I accepted a 1.5 mil paying contract to land a rather big surface base on Ike. I used the stage that normally gets dropped when reaching LKO to get me all the way to Duna using infinite fuel. When circularizing my orbit around Ike I had a bug where I couldn\u0027t return to the space station or any other ship. Restarted KSP and my active contracts were gone.\u003C/p\u003E\u003Cp\u003EI now have ~250k less than previously and the mission didn\u0027t reward anything. Karma 101. I deserved it.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2015-02-09T15:19:59Z","Content":"\n\u003Cp\u003ESlapping RCS everywhere for controls and stability (I don\u0027t trust gimbals before).\u003C/p\u003E\u003Cp\u003EAlso, strut abuse - putting struts on \u003Cstrong\u003EEVERY\u003C/strong\u003E section of the rocket and spacecraft just to make sure it won\u0027t wobble (even the slightest wobble isn\u0027t tolerable) and fall apart in-flight. End result: \u003Cem\u003Eunnecessarily high\u003C/em\u003E parts count, which means \u003Cstrong\u003ELAG\u003C/strong\u003E. Even small probes can have a part count of 20\u002B, almost half of it are \u003Cem\u003Estruts\u003C/em\u003E. \u003C/p\u003E\u003Cp\u003EThose were back when I don\u0027t trust innate stability of the parts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EExample of RCS overkilling:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Early energia copy.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i548.photobucket.com/albums/ii353/eL_pAmBaTo25/KSP2012-01-0417-57-51-32.jpg\u0022 alt=\u0022KSP2012-01-0417-57-51-32.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EExamples of \u0022Struts Everywhere!\u0022\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Yes, even the engines have them.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t9u0r.png\u0022 alt=\u0022t9u0r.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thnd3r","CreatedById":137708,"CreatedDateTime":"2015-02-09T16:46:00Z","Content":"\n\u003Cp\u003EI was not thinking clearly when I accepted a contract to make a Class D asteroid extrasolar in my Career Mode. After 8 hours attempting to make it work I turned on infinite fuel \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E. Now I have like 5 Million funds so it feels like I\u0027m playing Sandbox mode.\u003C/p\u003E\n"},{"CreatedByName":"DaniDE","CreatedById":130484,"CreatedDateTime":"2015-02-09T17:18:16Z","Content":"\n\u003Cp\u003E- I intentionally created a rocket that looked like a giant steel ***** with balls and grinned while I watched it \u0022penetrate\u0022 kerbins atmosphere, taking multiple screenshots from different angles.\u003C/p\u003E\u003Cp\u003E- I laughed when I killed a kerbal - it was an unplanned spontaneous disassembly event, so donÃ‚Â´t blame me - but it lead me to find KJR mod that saved so many kerbal lifes thereafter.\u003C/p\u003E\n"},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-02-13T17:38:18Z","Content":"\n\u003Cp\u003E1) Despite playing KSP for over half a year and considering myself to be an excellent (well, good enough) designer/engineer/pilot, I have never really landed on anything other than Mun, Minmus, Duna and Laythe. The latter two took Jeb over 10 years in the Mk1 inline cockpit and 11k deltaV to put flags on.\u003C/p\u003E\u003Cp\u003E(I hope this changes, I\u0027d like to do a grand tour... already got some ship plans in mind! Which brings me to the next point...)\u003C/p\u003E\u003Cp\u003E2) ...I usually build a ship for a very specific mission, pimp it out to the maximum, and when I\u0027m done testing, I\u0027ll abandon the mission idea and go build something else.\u003C/p\u003E\u003Cp\u003E3) I abuse time warp and blame lag when I overshoot by millions of kilometers.\u003C/p\u003E\n"},{"CreatedByName":"Snarfster","CreatedById":80347,"CreatedDateTime":"2015-02-13T21:18:15Z","Content":"\n\u003Cp\u003EI set up a 6 man base on Laythe, only to realize later that Laythe is tidally locked and I\u0027ll never see the Jool-rise I was hoping for.\u003C/p\u003E\u003Cp\u003EAs a result the base was ignored for 3 years. Only now, a ship has been sent to pick up the (now bearded) crew.\u003C/p\u003E\n"}]}