{"TopicId":70509,"ForumId":32,"TopicTitle":"What\u0027s all the buzz about docking?","CreatedByName":"tutrakan4e","CreatedById":100818,"CreatedDateTime":"2014-04-25T21:23:39Z","PageNum":1,"Articles":[{"CreatedByName":"tutrakan4e","CreatedById":100818,"CreatedDateTime":"2014-04-25T21:23:39Z","Content":"\n\u003Cp\u003EI constantly see people saying that docking is really hard and using docking allignment systems/Mechjeb (Scott Manley for example, he always says that a docking takes him 30 minutes). When I\u0027m sitting here, launching and docking with a space station for no more than 5 minutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E . And I don\u0027t consider myself a pro, I have less than 150 hours of KSP gameplay. Why is docking so hard for people and not for me? Should I give the Russians a few tips maybe?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T21:26:35Z\u0022 title=\u002204/25/2014 09:26  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by tutrakan4e\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"godefroi","CreatedById":101728,"CreatedDateTime":"2014-04-25T21:40:55Z","Content":"\n\u003Cp\u003EIt\u0027s hard the first few times, much easier once you get the hang of it. Using the docking alignment indicator, I can dock pretty much just as fast as MechJeb can (WHEN MechJeb can, that is, because it seems like it can\u0027t at least half the time...).\u003C/p\u003E\n"},{"CreatedByName":"NFUN","CreatedById":78715,"CreatedDateTime":"2014-04-25T21:53:28Z","Content":"\n\u003Cp\u003EI think it takes a little while before people even attempt to dock because of its infamy, so they might have less practice at it at a later experience level... I have another theory, but first, \u003Cstrong\u003Etutrakan4e\u003C/strong\u003E, how adept are you at making spaceplanes, if you have tried to build one?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T21:54:07Z\u0022 title=\u002204/25/2014 09:54  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by NFUN\u003C/strong\u003E\n\u003Cbr\u003EThere was an extraneous space between a comma and a word, at it was pissing me off!\n\u003C/span\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-04-25T21:55:43Z","Content":"\n\u003Cp\u003EI\u0027m with you. I mean, pre 0.18 with docking mods I sucked. But as soon as that beautiful \u0022Target realtive velocity\u0022 and \u0022closest approach\u0022 came along, I docked for the first time perfectly.\u003C/p\u003E\n"},{"CreatedByName":"qromodynmc","CreatedById":87139,"CreatedDateTime":"2014-04-25T21:58:21Z","Content":"\n\u003Cp\u003EI thought it was hardest thing on ksp,but after my first docking,I suddenly realizet everything,it was so easy.. \u0022Navball is the god of docking,and learn how to use it..\u0022\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2014-04-25T22:06:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tutrakan4e\u0022 data-cite=\u0022tutrakan4e\u0022\u003E\u003Cdiv\u003E(Scott Manley for example, he always says that a docking takes him 30 minutes).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith a space shuttle which wobbles uncontrollably in an environment with a framerate some people would consider unplayable \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EDocking isn\u0027t difficult if you\u0027re know what you\u0027re doing; you are clearly just fortunate enough to know pretty much what you should be doing before actually attempting it. If you attempt a docking by firing engines at random and hoping to get closer then you won\u0027t get anywhere, but if you move in carefully and have an idea of which direction you should be going it\u0027s relatively simple.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-25T22:08:17Z","Content":"\n\u003Cp\u003EDocking is quite easy once you can read the navball, perform a decent rendezvous, and can use the translation keys in conjunction with the rotation keys. No need for any special tools.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2014-04-25T22:13:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tutrakan4e\u0022 data-cite=\u0022tutrakan4e\u0022\u003E\u003Cdiv\u003EI constantly see people saying that docking is really hard and using docking allignment systems/Mechjeb (Scott Manley for example, he always says that a docking takes him 30 minutes). When I\u0027m sitting here, launching and docking with a space station for no more than 5 minutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E . And I don\u0027t consider myself a pro, I have less than 150 hours of KSP gameplay. Why is docking so hard for people and not for me? Should I give the Russians a few tips maybe?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is very easy for most after they learn how it works. The problem is that for most people it is really hard to grasp the first time without alot of trial and error or by looking up a tutorial. It is so counter inuitive to anything we experience in real world.\u003C/p\u003E\u003Cp\u003EFirst times most people for example do not realize that they have to slow relative velocitiy to 0 by the time they reach the closest approach to target.\u003C/p\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2014-04-25T22:35:30Z","Content":"\n\u003Cp\u003EI\u0027m not very adept at docking. Getting close isn\u0027t a problem, I can setup rendezvous efficiently, I\u0027m just bad at the fine control required for the final approach. I get there in the end, but it\u0027s a bit like watching giant tortoises mating.\u003C/p\u003E\n"},{"CreatedByName":"Jas1126","CreatedById":99760,"CreatedDateTime":"2014-04-25T22:46:33Z","Content":"\n\u003Cp\u003EI\u0027ve pretty much mastered docking after a few tries, including launch approach. The game could seriously use a docking camera, however. I think people take the \u0022I\u0027ll just wing it\u0022 approach, making it far more difficult than it has to be. \u003C/p\u003E\u003Cp\u003EI avoid it if possible, though. Tired of dealing with the low frame rates. My recent playthroughs have been highly focused on interplanetary ships that don\u0027t need docking. Making for some massive builds in the end.\u003C/p\u003E\n"},{"CreatedByName":"Zylark","CreatedById":101018,"CreatedDateTime":"2014-04-25T22:56:18Z","Content":"\n\u003Cp\u003ELong time since I\u0027ve done a completely manual docking. I\u0027m kinda\u0027 lazy, so I do use Mech Jeb a bit, first to match velocities with target, and then as I get close to the wanted docking port, I engage Smart A.S.S. to keep me aligned parallel to the docking port. From there on in it\u0027s a simple matter of going up/down/left/right as needed. Lining up using Lazor Docking Cam, and come in for a nice smooth \u0022pigs kissing in space\u0022 docking.\u003C/p\u003E\u003Cp\u003EGoing totally automatic with Mech Jeb is a bit unpredictable and in either case usually takes longer and certainly burns a lot more monoprop. But if handling some huge ungainly thing with a framerate in the low single digits, enabling Auto-Docking after you\u0027ve done the grunt work of getting close and parallel to the docking port do have its use.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-04-25T23:28:15Z","Content":"\n\u003Cp\u003EWhat makes it difficult in stock is, on the night side, not having any idea which side of the target you are approaching from, which way to face for the docking port, etc. Yes, it\u0027s easy (once you know how) to dock with a ship if you can swing it round so the port faces you and you can see it. With uncontrollable objects (solar panels facing the wrong way again!) where the approach to the port may not be clear and no lights it gets a bit trickier. Much easier with an alignment indicator, because at least that shows you where the port is and which way it faces, not just \u0022the target\u0027s over there\u0022.\u003C/p\u003E\u003Cp\u003EBTW: I just used MJ for docking while I was cooking and it uses much, much less monopropellant than it used to. Bit more than I would, but then it decided the \u0027safe distance\u0027 was further than I would have gone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T23:30:25Z\u0022 title=\u002204/25/2014 11:30  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by Pecan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-25T23:29:08Z","Content":"\n\u003Cp\u003EDepending on what you have played before KSP, your first docking attempt may be easy or hard. I had played X-Wing, TIE Fighter, Star Control II, and similar games enough in the 90s, so the whole idea of matching speed with the target and slowly approaching it was obvious to me.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-26T00:29:44Z","Content":"\n\u003Cp\u003EEvery player is good at some aspects of the game and not so good at others.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-04-26T00:34:54Z","Content":"\n\u003Cp\u003EI was terrible at my first docking. It took a long time, and I was really sweating it. Now it\u0027s no big deal, after having had some practice. I don\u0027t even bother with MechJeb for it. It\u0027s just a matter of having a good eye for relative alignment (rotationally) and then using the nav-ball with the translation keys. Not everyone will be good at it, of course, but I think most people can at least do it with some practice.\u003C/p\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2014-04-26T00:36:35Z","Content":"\n\u003Cp\u003EI found it really hard until I found the option in the corner to switch to docking controls. I have no idea what I thought I was using my RCS on before that. It\u0027s just like flying a Kerbal though, which I\u0027m pretty used to thanks to runaway ships. I suppose if you like to mess around a lot in EVA you might have an advantage when it comes to docking. Either that or some people maybe forget to switch targets, that makes the world of difference.\u003C/p\u003E\n"},{"CreatedByName":"TerLoki","CreatedById":30301,"CreatedDateTime":"2014-04-26T00:44:54Z","Content":"\n\u003Cp\u003EOne thing I\u0027ve noticed recently is that location means everything when it comes to docking. Rendezvous and docking with an asteroid flying past Kerbin? Easy, just catch it on the way out. Docking over the Mun or Minmus? Easy, gravity is so weak out there you can practically point and shoot in a medium orbit once you\u0027re a kilometer or so away. High Kerbin orbit? Pretty simple. Low Kerbin orbit? Tricky. Really low Kerbin orbit? I think I hear\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/PGNiXGX2nLU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E playing in the background, because this is just a dizzying ballet whacko if you\u0027re not ready for it, and a good way to waste a lot of RCS fuel if you start out far apart.\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-04-26T01:08:43Z","Content":"\n\u003Cp\u003EPersonally I don\u0027t find the actual process of docking all that hard. All the times I ever did Apollo style Mun transfers made that part easy.\u003C/p\u003E\u003Cp\u003EThe hardest part for me is just doing the rendezvous. So tedious to set up that maneuver node if I\u0027m not in the perfect position from the start, which isn\u0027t always possible (or astronomically hard) depending on the situation.\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-04-26T01:10:28Z","Content":"\n\u003Cp\u003EDocking is easy once you understand orbital mechanics.\u003C/p\u003E\u003Cp\u003EBut when you\u0027re new to docking, it\u0027s something that\u0027s really hard and you want to have a lot of discussion about.\u003C/p\u003E\u003Cp\u003EI don\u0027t like when people use tools like mechjob to do stuff for them, people need to know how to do stuff manually.\u003C/p\u003E\n"},{"CreatedByName":"bobcook","CreatedById":73597,"CreatedDateTime":"2014-04-26T02:19:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EWhat makes it difficult in stock is, on the night side, not having any idea which side of the target you are approaching from, which way to face for the docking port, etc. Yes, it\u0027s easy (once you know how) to dock with a ship if you can swing it round so the port faces you and you can see it. With uncontrollable objects (solar panels facing the wrong way again!) where the approach to the port may not be clear and no lights it gets a bit trickier. Much easier with an alignment indicator, because at least that shows you where the port is and which way it faces, not just \u0022the target\u0027s over there\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I\u0027m within shouting distance of the target, I switch to that vessel, set its docking port as the \u0022control from here\u0022 point, and set the docking port of the incoming vessel as the target. Then rotate around until the navball indicates I\u0027m pointing in the right direction. Finally switch back to the original vessel and complete the docking procedure. As long as the rate of approach isn\u0027t very high, this is easy.\u003C/p\u003E\u003Cp\u003EObviously this is easy with vessels that can rotate easily. For situations where the target is a gigantic space station that doesn\u0027t rotate, I simply bring lots of lights. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-04-26T02:20:10Z","Content":"\n\u003Cp\u003EI think my record for docking was launching a ~15t ship into LKO and managing to dock it with a station using just a tad over 4 units of Monoprop; I might stop adding any monoprop tanks to my ships and just use the stuff that comes in the command pod! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, for docking at night I just put lights on the station docking port to illuminate the ships port, and Z100 batteries on the station\u0027s docking port to use as docking lights to show where the port is.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-26T02:22:17Z\u0022 title=\u002204/26/2014 02:22  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 26, 2014\u003C/time\u003E by Random Tank\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2014-04-26T03:32:48Z","Content":"\n\u003Cp\u003EI can very nearly dock in my sleep at this point\u003C/p\u003E\u003Cp\u003EI have lots of station and interplanetary ship building to thank for that.\u003C/p\u003E\n"},{"CreatedByName":"AustralianFries","CreatedById":57660,"CreatedDateTime":"2014-04-26T03:48:32Z","Content":"\n\u003Cp\u003EOnce the two vessels I\u0027m docking are within 500 meters, I don\u0027t even look at them until they are connected. I\u0027m having a bad day if it takes more than ten minutes to dock with a target.\u003C/p\u003E\u003Cp\u003EWatch the navball. Be the navball.\u003C/p\u003E\u003Cp\u003E\u0026gt;Navball is love.\u003C/p\u003E\u003Cp\u003E\u0026gt;Navball is life.\u003C/p\u003E\n"},{"CreatedByName":"EuSouONumero345","CreatedById":40840,"CreatedDateTime":"2014-04-26T04:26:06Z","Content":"\n\u003Cp\u003EDocking once was something only mods could do....\u003C/p\u003E\u003Cp\u003EAnd then, when it got added as an official feature of the game, it was hard, really hard I mean, hardcore, really close to impossible (lol just exaggerating)\u003C/p\u003E\u003Cp\u003ELater, Squad added the stuff that really helped, and then docking became easy ( for people who have been playing the game for some time)\u003C/p\u003E\u003Cp\u003EAnd now I can easily dock like you, it\u0027s really easy with all these things helping, and some mods (Docking Alignment Indicator, I\u0027m looking at you) really makes it even easier (and immersive).\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-04-26T04:43:38Z","Content":"\n\u003Cp\u003EDocking is really quite easy as long as you know how and are not spatially challenged. I even wrote a brief tutorial on it with the tagline \u0022How I learned to stop worrying and love the navball\u0022.\u003C/p\u003E\n"}]}