{"TopicId":70541,"ForumId":32,"TopicTitle":"Showoff your big huge ISS and Space stations!","CreatedByName":"Bearsh","CreatedById":107549,"CreatedDateTime":"2014-04-26T01:53:47Z","PageNum":1,"Articles":[{"CreatedByName":"Bearsh","CreatedById":107549,"CreatedDateTime":"2014-04-26T01:53:47Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EAll my space stations we\u0027re lost in a great attack from the great space kraken while on it\u0027s way to laythe to have Laythe 12\u0027s lander refuel to be able to rendezvous with the return vehicle, Sadly the great 2 stations one carrying the return vehicle the other going to refuel the lander once they were making their burn to rendezvous both of the stations started twirling then broke apart, One station\u0027s part hit the other and blew up all the stations...\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E(I like to make complicated missions, they\u0027re more satisfying!)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESo i can\u0027t give any pics of mine... So heres a describe, And Showoff yours!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EZerfer Station:\u003C/p\u003E\u003Cp\u003EMy first ISS and Mobile refueling station, It was in service for 3-4 Kerbal Years.\u003C/p\u003E\u003Cp\u003EIn it\u0027s carreer it monitered, refueled and completed many missions for the KSC.\u003C/p\u003E\u003Cp\u003EUntil it was destroyed in a random space kraken tragedy.\u003C/p\u003E\u003Cp\u003EStation 12:\u003C/p\u003E\u003Cp\u003EThe seccond station and mobile refueling and task fullfilling station.\u003C/p\u003E\u003Cp\u003EIt was in service for 3-4 Kerbal years as was the zerfer station, Zerfer station was the mother station to\u003C/p\u003E\u003Cp\u003EStation 12. Serving as a communications and operation helper. It\u0027s carreer was long and well. Until it was then attacked with zerfer station in a freak Space Kraken Tragedy.\u003C/p\u003E\u003Cp\u003ESo there\u0027s mine! Go ahead and tell me yours!\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-26T02:34:26Z","Content":"\n\u003Cp\u003EThis is not a bad idea for a thread. In fact, that\u0027s why \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/22251-Showcase-SPACE-STATIONS%21-Post-your-pictures-here\u0022 rel=\u0022external nofollow\u0022\u003Esomebody already made one\u003C/a\u003E. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Bearsh, why don\u0027t you take some screenshots of your stations and post them there?\u003C/p\u003E\n"}]}