{"TopicId":72491,"ForumId":32,"TopicTitle":"Do you remember your first time playing KSP?","CreatedByName":"ICrashRockets","CreatedById":102674,"CreatedDateTime":"2014-05-16T00:28:01Z","PageNum":1,"Articles":[{"CreatedByName":"ICrashRockets","CreatedById":102674,"CreatedDateTime":"2014-05-16T00:28:01Z","Content":"\n\u003Cp\u003EWhat was your first experience with KSP like? Were you immediately able to make it into orbit on your first try? Did you spend countless hours hours failing at keeping your rocket upright? Or was it something in between? \u003C/p\u003E\u003Cp\u003ETalk about what you were able to accomplish within the first hours of being a Kerbalnaut! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(I apologize if this thread already exists somewhere, but I have looked around and have found nothing on this topic! So again, I\u0027m sorry if this thread has been done.)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E \u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"joekidd1992","CreatedById":110769,"CreatedDateTime":"2014-05-16T00:54:56Z","Content":"\n\u003Cp\u003EThat\u0027s easy for me. I started on Saturday or Sunday of this week, 5/10 or 5/11. I can\u0027t really remember if I made it into orbit first try, but it isn\u0027t that hard to do.\u003C/p\u003E\n"},{"CreatedByName":"pslytely psycho","CreatedById":62775,"CreatedDateTime":"2014-05-16T00:58:03Z","Content":"\n\u003Cp\u003E0.13 demo. Downloaded it from a link in a reply C\u0027ptn Skunky left on Slashdot about games in Education.\u003C/p\u003E\u003Cp\u003EFirst rocket was definitely a suborbital missile with no parachutes. I laughed myself silly watching Jeb\u0027s reactions. I was hooked.\u003C/p\u003E\u003Cp\u003EHaving played Orbiter (VERY BADLY!) I found the approachability of KSP amazingly intuitive even at that early stage.\u003C/p\u003E\u003Cp\u003EOrbiter instruction manuals can be a mind numbing read. (And I still don\u0027t undestand a lot of it!) KSP, even in that early stage got around that nicely. It took about 20 launches before I made a stable orbit, and another 20 or so before I learned to circularize and my first Mun mission. (The only other body aside from Kerbol in that version)\u003C/p\u003E\u003Cp\u003EHumor, easy to intuit orbital mechanics, great parts. This game walks a narrow tightrope. And as a bonus, rereading those confusing Orbiter manuals, they make much more sense now. KSP simplified the concepts without \u0027dumbing it down,\u0027 as you can do the math if you want. Or like me. Just Jeb and the seat of his spacesuit.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-16T00:58:37Z","Content":"\n\u003Cp\u003EIt\u0027s been a while, but I mostly experimented with different combinations of rocket parts and launching them straight up. Lots of suborbital shots before getting a multistage rocket into orbit, definitely not on the first try.\u003C/p\u003E\u003Cp\u003EEdit: Checked the version history, I started with 0.11.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T10:12:20Z\u0022 title=\u002205/16/2014 10:12  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-05-16T00:58:48Z","Content":"\n\u003Cp\u003Eyes, it was right after the summer sale last year. building a rocket was fun. launching a 150 part rocket at 5fps wasnt so much. so i shelved it till i upgraded my desktop.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-16T01:12:42Z","Content":"\n\u003Cp\u003EVaguely. .18.3 demo. I went through the tutorial and for lulz decided to put the fuel tank on top of the command pod. Then found the tutorial wouldn\u0027t let me launch. If it had, I\u0027d probably have been surprised since doing that WORKS.\u003C/p\u003E\u003Cp\u003EAnd my first orbital rocket had about 18 small SRBs on the bottom, because I didn\u0027t know about going too fast causing drag.\u003C/p\u003E\u003Cp\u003EI also recall my first rescue mission. I didn\u0027t think I\u0027d be very good at controlling the Kerbal on EVA so I *covered* the rescue ship in ladders.\u003C/p\u003E\n"},{"CreatedByName":"Fagiano","CreatedById":110977,"CreatedDateTime":"2014-05-16T01:14:22Z","Content":"\n\u003Cp\u003EOh, it was on 0.19, didn\u0027t sleep that night. 13h of ksp till i get to the mun. Oh, First time i reached the mun my \u0022tryhardmun\u0022 didn\u0027t have landing gear, didn\u0027t go well. Second time, didn\u0027t have light, and well...dark side, didn\u0027t go well either. Third time was the right one, crashed on the mun and crew survived: \u0022New base on the mun\u0022, they are still there. It got me 13hours. It was the most exciting thing so far. I was truly proud.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-05-16T01:28:08Z","Content":"\n\u003Cp\u003E0.13 demo in Poland in 2012. I saw an ad, downloaded the demo, and was hooked, entering a \u0027zen\u0027 state of trial-and-error engineering.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"ICrashRockets","CreatedById":102674,"CreatedDateTime":"2014-05-16T01:29:53Z","Content":"\n\u003Cp\u003ECan anybody other than me relate to this?\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/2QO_QKL6Y0Q?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThis is pretty much my first time for the first 2 hours. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mokmo","CreatedById":62363,"CreatedDateTime":"2014-05-16T01:32:42Z","Content":"\n\u003Cp\u003E0.18, the demo (is it still that version in demo ?) \u003C/p\u003E\u003Cp\u003EPlayed a few hours, got to the mun with the help of a few tutorials, saw the huuuge possibilities of the mods and just decided to get this. \u003C/p\u003E\u003Cp\u003EBeen over a year (end of april) and this will probably be the best return on investment i\u0027ve ever done on a game.\u003C/p\u003E\n"},{"CreatedByName":"Jon Tash","CreatedById":2681,"CreatedDateTime":"2014-05-16T01:33:06Z","Content":"\n\u003Cp\u003EOh boy, it was a long time ago. When the forum was just a baby learning to post treads. C\u0027ptn Skunky making funny jokes, Harvester actively posting in the forum, responding to players. And it was when 0.8 was out that I begun this voyage to the strange Kerbal Universe (and I never got out). There was no Mun, no map view, lots of parts overheating. The dark side of the planet was the danger zone and every kerbal(only Bill, Bob and Jeb) to go there should die immediately. The ocean was hard solid like the ground (nice shaders though). You had to learn the hard way, figure out your velocity, your vector, altitude and do the math to know if you were in a stable (mostly elliptic) orbit. There were palm trees next to the KSC. \u003C/p\u003E\u003Cp\u003EAnd most of all, it was fun as hell!\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2014-05-16T01:33:40Z","Content":"\n\u003Cp\u003EYes I remember!\u003C/p\u003E\u003Cp\u003EIt was in summer, early june.\u003C/p\u003E\u003Cp\u003EI remember my [ironic]very efficient[/ironic] ascent path: full throttle, straight up until I exit the atmosphere, then I cut the engines, go horizontal and full throttle.\u003C/p\u003E\u003Cp\u003EI rapidly switched to a more efficient ascent path.\u003C/p\u003E\u003Cp\u003E(But I didn\u0027t had the idea to cut the engine when reaching a good apoapsis so my orbits where very eccentric.\u003C/p\u003E\n"},{"CreatedByName":"Joe32320","CreatedById":81055,"CreatedDateTime":"2014-05-16T01:35:57Z","Content":"\n\u003Cp\u003EI remember seeing someone post screenshots of the game on another forum, and had one of those moments where I just had to try it out, got the demo, I think I got as far as having a go at landing on the Mun, if my landing skills now are any indication of what I was like a year ago, it probably didn\u0027t end well...\u003C/p\u003E\u003Cp\u003EAnyways I only played a few hours of the demo, before deciding to buy the full game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-05-16T01:46:21Z","Content":"\n\u003Cp\u003EI first tried out the demo after seeing it around Steam for a little while. At first I was kinda put off by the thought of these sweet little green guys going into space, but then I tried the demo... and my head promptly exploded. After cramming my face back together, I bought the full game and here I am! Still a bit touched by the first time... \u003C/p\u003E\u003Cp\u003EI figure the insanity should go away in a few years... :JKADS:CAH :ADJKASDL:JASKAXSJGHDXAG \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-05-16T01:51:04Z","Content":"\n\u003Cp\u003EI thought it looked childish with the little green dudes, but tried the demo and loved it. Bought it the same day.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-05-16T02:06:28Z","Content":"\n\u003Cp\u003EMy first time:\u003C/p\u003E\u003Cp\u003E\u0022Space...the final frontier...these are the voyages of...\u0022*record scratch* *1812 overture* \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/D4q4si5lI8o?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E(Not my video)\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-05-16T02:08:55Z","Content":"\n\u003Cp\u003EHad no idea about orbital mechanics, freefall, inclination, prograde/retrograde burning. My game was essentially a \u0022build a fastest moving rocket, launching vertically\u0022 contest. Until i read the physics, moon launching tutorials.\u003C/p\u003E\u003Cp\u003EIt was back in 0.13.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-05-16T02:56:20Z","Content":"\n\u003Cp\u003EOh I remember all right. Hot off the heels of watching Maxwell Adams goof off with 0.8.4, I went and downloaded the then-latest version (0.11) and proceeded to more or less imitate his antics of making completely impractical rockets that were more meant to blow up than to get anywhere. And much fun was had, to be certain! Not for Jeb, Bill, and Bob of course, but seeing as they were the only cosmonauts at at that time and always came back to life as soon as a mission ended, I don\u0027t think they could complain too much.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2014-05-16T02:58:57Z","Content":"\n\u003Cp\u003EI saw something on the Minecraft forums about it, so I took a look. It was an 0.8 or 0.9 version, and it was mostly a manned ballistic missile simulator at that point.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-05-16T03:05:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ICrashRockets\u0022 data-cite=\u0022ICrashRockets\u0022\u003E\u003Cdiv\u003ECan anybody other than me relate to this?\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/2QO_QKL6Y0Q?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThis is pretty much my first time for the first 2 hours. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat video was my first exposure to KSP! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy first major hurdle in the game was figuring out how to launch. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2014-05-16T03:17:32Z","Content":"\n\u003Cp\u003EGot the demo a year ago, tried to get into orbit for three days, watched Scott Manley do it, did it in the demo, bought the full version. Then I landed on the Mun, Minmus, and docked in the next three days. Much help from youtube.....\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2014-05-16T03:44:22Z","Content":"\n\u003Cp\u003EI saw the game trailer on Steam, and my first impression was, \u0022cartoony green dudes? This is obviously not a game to take seriously.\u0022 So I passed the game over without a second thought.\u003C/p\u003E\u003Cp\u003EAt the urging of two friends, I very reluctantly tried out the demo. It took some effort, but I finally got into orbit by launching straight up into space, then burning horizontally as others had mentioned. I wouldn\u0027t learn about gravity turns until much later... ahem.\u003C/p\u003E\u003Cp\u003EAnyway, I remember getting into orbit around Mun in the demo and texting my friend over Steam chat.\u003C/p\u003E\u003Cp\u003EFriend: Mun?\u003C/p\u003E\u003Cp\u003EMe: Wow! Pretty cool game. Yes, I got into Mun orbit.\u003C/p\u003E\u003Cp\u003EMe: It\u0027d be cool if you could actually land on it though. Maybe in the full version you can? \u003C/p\u003E\u003Cp\u003EFriend: lol you can land on it.\u003C/p\u003E\u003Cp\u003EMe: Oh! What do I press to make the pilot do a landing?\u003C/p\u003E\u003Cp\u003EFriend: You have to land it yourself, lol!\u003C/p\u003E\u003Cp\u003EMy next thought was, \u0022whaaaaat?!? This has got to be \u003Cem\u003Eimpossible\u003C/em\u003E.\u0022\u003C/p\u003E\u003Cp\u003ESo I watched a couple landing videos and eventually tried it myself. I remember getting within a couple meters of the surface, teetering this way and that, getting nervous and going full throttle to bug out, then trying to get into a hover again. I was all over the damn place. When my landing gear touched down and I shut down the engines, I suddenly realized I hadn\u0027t been breathing for the past 45 seconds. Gasping for air, I looked at my computer clock.\u003C/p\u003E\u003Cp\u003E2:00 AM\u003C/p\u003E\u003Cp\u003EWow...\u003C/p\u003E\u003Cp\u003EFor some stupid reason, I didn\u0027t rush to buy the full version. I shelved the game for a couple weeks and then bought it when it went on sale. Once I got the full game and started playing again, I was up at 2:00 AM several nights in a row. I clocked 400 hours of played time in only a few months, ending with a grande finale of a 100% stock manned return mission from Eve barely a week before the ARM/NASA update was released.\u003C/p\u003E\u003Cp\u003EI had come a long way from my first, silly, non-gravity turn launch profile. My Eve return had to use everything I had learned:\u003C/p\u003E\u003Cp\u003EAsparagus Staging\u003C/p\u003E\u003Cp\u003EThrust Plates\u003C/p\u003E\u003Cp\u003EOrbital Rendezvous \u0026amp; Docking\u003C/p\u003E\u003Cp\u003ERovers\u003C/p\u003E\u003Cp\u003EManually calculating delta-v (I built a spreadsheet... hehehe)\u003C/p\u003E\u003Cp\u003E...and a mission profile inspired by Robert Zubrin\u0027s book, \u003Cem\u003EMars Direct\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EEver since then, I\u0027ve been much more interested in space exploration. Neil deGrasse Tyson is now my personal hero, I watch the new Cosmos every week, and I can now name the fathers of modern rocketry. KSP is now my favorite game OF ALL TIME, and it\u0027s practically the only game in my library that doesn\u0027t involve killing something intentionally.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T03:49:04Z\u0022 title=\u002205/16/2014 03:49  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by Xavven\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-05-16T04:59:14Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/901005634774755877/702BFE4CC74FE72892B78E342F563F9AE70F1931/\u0022 alt=\u0022702BFE4CC74FE72892B78E342F563F9AE70F1931\u0022\u003E\u003C/p\u003E\u003Cp\u003EI remember there was a lot of explosions....\u003C/p\u003E\u003Cp\u003EI also remember I would go straight up with my rocket, then attempt to turn WAAY out there and always ended up falling back down before getting enough momentum sideways. There was also a lot of parachutes going off on the launch pad because I didn\u0027t get the staging thing for a while. Oh, and wings! took me forever to figure out that winglets would help control the craft.\u003C/p\u003E\n"},{"CreatedByName":"Jas1126","CreatedById":99760,"CreatedDateTime":"2014-05-16T05:06:26Z","Content":"\n\u003Cp\u003EI had a blast right out of the gate. My first ship reached space and I thought \u0022Well, that was easy\u0022. My second ship had an orbit of around 80km. I admittedly was a little disappointed but somewhat proud. But, that just drove me to see just how big of a ship I could put into orbit. Haven\u0027t gone a day without playing since. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E A big thanks to the modders, especially.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-05-16T05:41:42Z","Content":"\n\u003Cp\u003EI started with 0.12 or 0.13 and nope ... my first attempts were aimed at having enough fuel to reach higher and higher altitudes (still within the atmosphere)\u003C/p\u003E\u003Cp\u003Ethen my next milestone was a suborbital flight over the continent east of Kerbal spaceport.\u003C/p\u003E\u003Cp\u003EOnly then the next milestone was to reach orbit.\u003C/p\u003E\u003Cp\u003EAnd after I first reached it, I didnÃ‚Â´t orbit Kerbin for a long time anymore, because this version still lacked a persistent world, which meant that each mission started anew with a fresh universe and the Mun in always the same position ... which also meant (due to the lack of maneuver nodes in this version) that the easiest method to get to Mun was, to directly accelerate (in a known angle) towards it, without first getting into Kerbin orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T05:43:43Z\u0022 title=\u002205/16/2014 05:43  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by Godot\u003C/strong\u003E\n\u003C/span\u003E\n"}]}