{"TopicId":77343,"ForumId":32,"TopicTitle":"ANxiously Awaiting Contracts and Budgets in .24","CreatedByName":"JebidiahsBigSister","CreatedById":85774,"CreatedDateTime":"2014-07-12T05:55:19Z","PageNum":1,"Articles":[{"CreatedByName":"JebidiahsBigSister","CreatedById":85774,"CreatedDateTime":"2014-07-12T05:55:19Z","Content":"\n\u003Cp\u003EHaving been a KSP fan for more than 18 months now I simply \u003Cem\u003Ecan\u0027t wait\u003C/em\u003E for ver .24 and all the money making grinding ensconced in contracts and budgets. Finally (!!) I can get away from the tedium of exploring new places, finding the sunken pyramids of Mars, or the Stonehenge monuments in the Jool system or the Neil Armstrong monument on the Mun and devote my time to what we space jockeys like best - grinding away the evening trying to make a few bucks so I can but a new reaction thruster. YES!!!\u003C/p\u003E\u003Cp\u003ENow that the KSP team has made it much easier to achieve orbit I no longer need to worry so much about things like skill or orbital mechanics (seriously???!! What was up with \u003Cem\u003Ethat\u003C/em\u003E?? ) and now I can just spend my time making Excel spreadsheets in order to optimize and maximize the budgetary requirements involved in launching a spaceplane to the Tracking Station.\u003C/p\u003E\u003Cp\u003EThanks KSP team and keep up the great work! Can I ask that you provide \u0022Union Negotiations\u0022 in .25 and make .26 the \u0022Bean Counter Edition\u0022 ?? Pretty please ???\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-07-12T06:15:54Z","Content":"\n\u003Cp\u003EMaybe you should stick with sandbox mode. None of this update is a surprise to anyone following the games development. I\u0027ve logged close to 1800 hours in this game and an greatly looking forward to some new challenges. Building on a budget sounds fun to me.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-07-12T06:37:49Z","Content":"\n\u003Cp\u003EThere are already several existing threads for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79878-The-Officially-unofficial-0-24-Kerbapalooza-Thread\u0022 rel=\u0022external nofollow\u0022\u003Ediscussing the 24 update\u003C/a\u003E. Meanwhile, it is unfortunate that this update doesn\u0027t focus on the things you would prefer, but there is indeed still the Sandbox mode, which is free of all the issues you list.\u003C/p\u003E\n"}]}