{"TopicId":77812,"ForumId":32,"TopicTitle":"0.24 eta ?","CreatedByName":"techstepman","CreatedById":68505,"CreatedDateTime":"2014-07-16T10:50:48Z","PageNum":1,"Articles":[{"CreatedByName":"techstepman","CreatedById":68505,"CreatedDateTime":"2014-07-16T10:50:48Z","Content":"\n\u003Cp\u003Ehello guys. Yesterday I watched one of Scott Manley\u0027s vids about 0.24 and I assumed that the new version was already released. I have the steam version of the game and since yesterday I installed - deleted - and reinstalled a few times and the version is still 0.23.5 . Did I misunderstand something? Is 0.24 already released or are we still waiting for it? Sorry for the dumb question but in all the posts around the web there was no ETA or release date mentioned so I assumed it was already out. Is it? Im trembling with anticipation of a 64 bit version for windows so I can have fun with all the beautiful graphics mods plus all the part mods I need to make my space program reality at last together in one install of the game.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-07-16T10:53:51Z","Content":"\n\u003Cp\u003ERelease dates are not to be asked for, as is written in the [thread=30064]Community Rules[/thread]. Some of the media team and Youtube/Twitch streamers are given access to the experimental releases in order to promote the release. 0.24 is not out yet.\u003C/p\u003E\u003Cp\u003EFor a release date to be given is extremely rare, but has occasionally happened. Not this time, though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-16T11:01:19Z\u0022 title=\u002207/16/2014 11:01  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 16, 2014\u003C/time\u003E by vexx32\u003C/strong\u003E\n\u003C/span\u003E\n"}]}