{"TopicId":77902,"ForumId":32,"TopicTitle":"How are your Kerbals handling the Kerpocalypse???","CreatedByName":"sumrex","CreatedById":103753,"CreatedDateTime":"2014-07-17T02:28:31Z","PageNum":1,"Articles":[{"CreatedByName":"sumrex","CreatedById":103753,"CreatedDateTime":"2014-07-17T02:28:31Z","Content":"\n\u003Cp\u003EUpon recent study of ancient Kayan calendars. Kerbal conspiracy theorists have surmised the end of the .23.5 world fast approaching. As a result Kerbal kind is responding in a variety of ways. The following Kerbals of the Sub-Standard rocket program are proceeding with an emergency mad dash to return all Kerbals home to be with their families before the .24 end of the world. Anyway, a long story short I\u0027m just curious what you guys are winding down before .24. Here are some examples of my mad rush.\u003C/p\u003E\u003Cp\u003EThe Lunar colony is the first to run for home after planting a flag.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9P0epcN.png\u0022 alt=\u00229P0epcN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill Kerman unwisely takes the rover in the background and decides the \u0022drive\u0022 home from Minimus ranch ending up in a goofy Kerbal orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fCZnA4z.jpg\u0022 alt=\u0022fCZnA4z.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDoctor Banner arrives with just enough to push Bill into a low orbit before landing himself.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tcdMTHv.png\u0022 alt=\u0022tcdMTHv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EVarious items from different programs are cobbled together to send rescue teams to the Jool system. (General Landers, Tylo descent modules, Ion Tugs, and even \u0022Angry Rover\u0022\u003C/p\u003E\u003Cp\u003EThe general lander below can act as a bare minimum ssto with A jet engine to hit an 80x80 orbit or becomes an excellent lander by substituting a rocket engine.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7V8QphB.jpg\u0022 alt=\u00227V8QphB.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iHCM5Jd.jpg\u0022 alt=\u0022iHCM5Jd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WpkA0qu.png\u0022 alt=\u0022WpkA0qu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill Kermans descent back home gets way iffy....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bkAiFjH.jpg\u0022 alt=\u0022bkAiFjH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill Kerman survives Sans parachutes in the incredibly tough rover below with his rocket impacting at 100 meters per second.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VtYyedn.jpg\u0022 alt=\u0022VtYyedn.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-17T02:49:59Z\u0022 title=\u002207/17/2014 02:49  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 17, 2014\u003C/time\u003E by sumrex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"caba111","CreatedById":39713,"CreatedDateTime":"2014-07-17T02:44:45Z","Content":"\n\u003Cp\u003EYou\u0027ve motivated me to bring my Kerbals home for 0.24... Good thing I only have two out there.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-07-17T04:36:33Z","Content":"\n\u003Cp\u003ESame deal here. I have a lot more up there though. And some ships and stations that can\u0027t be landed practically. But I may try to at least bring home all the Kerbals.\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-07-17T04:42:20Z","Content":"\n\u003Cp\u003EI was going to nuke my 0.23.5 career save and start over, but since Science\u003Csup\u003ETM\u003C/sup\u003E mode is a thing I\u0027m now going to port it over to that and play it when the fancy strikes.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-07-17T06:17:20Z","Content":"\n\u003Cp\u003EMine don\u0027t know how to read nor write, so they\u0027re safe from the abomination of contracts. Hooray for illiteration.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-07-17T07:03:40Z","Content":"\n\u003Cp\u003EMine are mostly exploding and going about their daily business.\u003C/p\u003E\u003Cp\u003EWhy would kerbals care about the end of the world, their going to die on my rockets eventually anyway.\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2014-07-17T08:49:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceSphereOfDeath\u0022 data-cite=\u0022SpaceSphereOfDeath\u0022\u003E\u003Cdiv\u003EMine are mostly exploding and going about their daily business.\u003Cp\u003EWhy would kerbals care about the end of the world, their going to die on my rockets eventually anyway.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause they\u0027re rather die in an explosion caused by the misfiring of a rocket thruster than in the death of the universe, obviously \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell, unless of course the end of the universe involved explosions beyond the imaginative capacity of any Kerbal, in which case they\u0027d probably like that more...but that would imply that your hard drive just exploded spectacularly or something.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2014-07-17T08:58:06Z","Content":"\n\u003Cp\u003EKerpocalypse, I like that. But it won\u0027t be anything spectacular or hilarious. Kerbol, along with all the planets and moons will be simply - gone - from one second to another.\u003C/p\u003E\u003Cp\u003EJust to magically reappear in a parallel universe a few seconds later.\u003C/p\u003E\u003Cp\u003ENo regrets to leave it all behind. What remains are a lot of good memories and a lot of knowledge.\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2014-07-17T09:21:56Z","Content":"\n\u003Cp\u003EThe give all their money to \u003Cem\u003Eme\u003C/em\u003E!\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-07-17T09:23:42Z","Content":"\n\u003Cp\u003EWaiting, and playing Minecraft. My kerbals of 10 seperate saves are whining. One is stuck on RRS kerbin, the other on gilly, 22 of em, \u003C/p\u003E\u003Cp\u003EIf I tried to rescue em all, my save game would corrupt due to not having the correct mods\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-07-17T10:35:10Z","Content":"\n\u003Cp\u003EBringing them home? I still have to send more out in .23.5 !\u003C/p\u003E\u003Cp\u003EAt least five will go to Jool this evening and maybe three are scribbling a Duna Revisited mission in the cantina right now!\u003C/p\u003E\u003Cp\u003EBut \u003Cem\u003Ein the end\u003C/em\u003E they will all be back at KSC. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"95tiger59","CreatedById":92346,"CreatedDateTime":"2014-07-17T12:27:54Z","Content":"\n\u003Cp\u003EI forgot i had TAC life support enabled when i was time warping a probe to Eeloo 5 weeks ago. so yeah their aren\u0027t any left\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2014-07-17T12:31:16Z","Content":"\n\u003Cp\u003EJust recovered all kerbals from all space stations in the Kerbol System using one mothership. It was almost a grand tour, except there were none to recover from Moho or Eeloo...\u003C/p\u003E\u003Cp\u003EAll stations are abandoned. Recovery teams will be sent out ASAP if anyone survies the Kerpocalypse...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#D3D3D3;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EOkay, over dramaticness over. Carry on.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-07-17T13:05:56Z","Content":"\n\u003Cp\u003EI started a save some time ago. It only has a three Kerbal stations in orbit (One orbital assembly facility, one large fuel depot, and one free-flying space laboratory with its own propulsion) amounting to around 20 Kerbals in space. but multiple Kerbal space shuttles in orbit and ships around the Mun, where I just recently established a twelve Kerbal outpost. In interplanetary space, we have a large ship on a outbound Hohmann Transfer to Duna and a crew working on the Dunaian surface. There is a asteroid tug with a crew of two heading toward Kerbin, but it already has a shuttle awaiting to pick them up in LKO, so they should be fine. Otherwise, it\u0027s mostly probes and rovers for the rest of the system.\u003C/p\u003E\u003Cp\u003EMy rescue plans are as follows.\u003C/p\u003E\u003Cp\u003ESTS-78, STS-80, and STS-81 are in orbit. STS-78 will assist in the evacuation of Space Station Liberty (The assembly facilty), but will only be able to bring three astronauts home of the ten onboard. STS-82 and the two Soyuz escape pods onboard (Liberty earned the nickname of \u0022Titanic\u0022 by having not enough escape pods for the whole crew) will bring the rest of the crews home. STS-80 is awaiting the arrival of the asteroid tug, and STS-81 is working on repairing the Kerman Space Telescope. STS-81 is to halt all repair work immediately and bring the telescope back into its payload bay to be returned to KSC. STS-80 is to await the arrival of the tug and evacuate the crew immediately back to Kerbin. \u003C/p\u003E\u003Cp\u003EOnboard the fuel depot (Space Station Polaris), the crew should easily escape through the Soyuz escape pods (As the station operates on a skeleton crew), but the free-flying laboratory will require a full extraction by the shuttle (With the return of the station to KSC if possible). As for the crew on Duna, they should escape just fine to their cruiser and return home, as they were to anyway. For the outbound crew, it would be slightly more difficult, and probably a couple tears over the cancelled landing and surface mission, but they will return home for extraction by the shuttle. STS-85 and 86 will take part in rescuing the crews. On the Mun base, they already have a tug in orbit and two ascent vehicles, so they should be OK in returning home as long as a shuttle takes them on. STS-84, STS-87, and STS-89 will aid in their rescue. STS-88 will conduct the some more Spacelab research (Since the stations have been evacuated). \u003C/p\u003E\u003Cp\u003EIf they survive, all stations and bases will be restored to full operation.\u003C/p\u003E\n"},{"CreatedByName":"Rabid Bat","CreatedById":114865,"CreatedDateTime":"2014-07-17T13:18:05Z","Content":"\n\u003Cp\u003EReturn to home, rescue... umm no. My 23.5 universe has already ended, they never saw it coming.\u003C/p\u003E\n"}]}