{"TopicId":77993,"ForumId":32,"TopicTitle":"The Grand 0.24 Discussion Thread","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2014-07-17T21:19:39Z","PageNum":12,"Articles":[{"CreatedByName":"LobeDethfaurt","CreatedById":109693,"CreatedDateTime":"2014-07-18T03:25:30Z","Content":"\n\u003Cp\u003EPatcher finally worked. Does anybody know if the patcher updates KSP to the 64 bit version, or will I need to do a separate download to get it?\u003C/p\u003E\n"},{"CreatedByName":"Rufledt","CreatedById":115067,"CreatedDateTime":"2014-07-18T03:28:39Z","Content":"\n\u003Cp\u003EOk i\u0027ve played for a few straight hours now. My neck is killing me but I don\u0027t care! I\u0027m loving the new contract system! I haven\u0027t tried any mods yet, though. Going to go stock for a while.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-07-18T03:31:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LobeDethfaurt\u0022 data-cite=\u0022LobeDethfaurt\u0022\u003E\u003Cdiv\u003EPatcher finally worked. Does anybody know if the patcher updates KSP to the 64 bit version, or will I need to do a separate download to get it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI updated my own copy through the patcher. Sadly, it seems it still only provides the old 32-bit .exe, not the new 64-bit one.\u003C/p\u003E\n"},{"CreatedByName":"cpast","CreatedById":112846,"CreatedDateTime":"2014-07-18T03:33:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoPanShabuShabu\u0022 data-cite=\u0022NoPanShabuShabu\u0022\u003E\u003Cdiv\u003EObviously you can\u0027t exactly run the engine without the air intake, but have you guys tried the \u0022Run Test\u0022 that you get from right clicking?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t know there was one. I just activated through staging.\u003C/p\u003E\u003Cp\u003EThat C7 contract was the first I saw with perfectly sensible and ordinary contract flavor text: something along the lines of \u0022after achieving combustion, we want to dispel moronic rumors that our system won\u0027t amount to anything.\u0022\u003C/p\u003E\n"},{"CreatedByName":"4j25","CreatedById":95125,"CreatedDateTime":"2014-07-18T03:34:17Z","Content":"\n\u003Cp\u003EErr... Could someone tell me how to update it? XD I can\u0027t find out how...\u003C/p\u003E\n"},{"CreatedByName":"LobeDethfaurt","CreatedById":109693,"CreatedDateTime":"2014-07-18T03:38:01Z","Content":"\n\u003Cp\u003EIf you start the Launcher, there is a button that should say \u0022update\u0022 next to the \u0027Play\u0022 button.\u003C/p\u003E\n"},{"CreatedByName":"thylordroot","CreatedById":115008,"CreatedDateTime":"2014-07-18T03:41:26Z","Content":"\n\u003Cp\u003EI just recorded about an hour\u0027s worth of video, and I have to say, \u003Cem\u003Ewow\u003C/em\u003E. This was well worth the wait! In good keeping with Kerbin tradition, my first contract launch was doomed to fail thanks to a staging error that deployed the chutes at the same time as my SRB. Miraculously, Jebediah Kerman somehow survived and gained positive reputation (despite destroying the bulk of his rocket).\u003C/p\u003E\u003Cp\u003ESo far, the only real wrinkle I have found is that \u0022activate while landed\u0022 can also apparently mean \u0022activate at launchpad\u0022. That isn\u0027t really a complaint, though; I suppose anybody who really wants the challenge can simply avoid staging the parts in question at launch. Otherwise, I am having fun so far; I have already managed to have my space program teetering on the brink of insolvency, which I feel is in good keeping with finding parts on the side of the road.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2014-07-18T03:46:35Z","Content":"\n\u003Cp\u003EAll-righty! It\u0027s time to reflect on my experiences after my first couple of rounds with the new and improved (oops, spoiler!) career mode.\u003C/p\u003E\u003Cp\u003EFirst - the GREAT:\u003C/p\u003E\u003Cp\u003EVastly improved depth! The simple addition of adding costs and income makes this game so much deeper. Now, it\u0027s not longer sufficient for me to try different configurations to reach a new science goal. Now I have to be aware of how expensive a mission is going to be. I spend no small amount of time making sure that the craft I build is able to complete the contract(s) it is designed for without costing more than the contract will yield! Since recovery is a bigger deal, reusable craft like space-planes are extremely profitable once you get enough science and figure out how to make a reliable one.\u003C/p\u003E\u003Cp\u003EFlexible play styles! This game oozes flexible play styles. I could be a contract monkey - grinding at the grind-stone and still achieve science and riches along the way. I can spend some hard-earned money on purely scientific missions, with no contract attached, but doing so will drain the coffers over time.\u003C/p\u003E\u003Cp\u003EWide range of challenge levels! Contracts come in a great variety of challenge levels. Some of them seem deceptively simple, but prove to be quite difficult, but not in a frustrating way. I am clearly motivated to look at the contract a couple times and go, \u0022What do I need to build to accomplish that?!\u0022 Things such as deploy a parachute between 12km and 14km at a speed of at least 400m/s can be really tough, but fun to try to achieve. Also, I can really see the value of a reusable space-plane now as a test platform for many of these in-atmosphere tests.\u003C/p\u003E\u003Cp\u003EThe GOOD:\u003C/p\u003E\u003Cp\u003EContract Interface (Mission Control): Great job putting this interface together so we can peruse and accept new contracts. The other parts of the contract interface could use just a bit of help, though. In various screens, the contract info is located in different places. Additional UI iterations should focus on normalizing where all the information is found. For instance, contract stuff is in the lower right in the VAB, but in the upper right in Launch Pad and in flight.\u003C/p\u003E\u003Cp\u003ECurrency interface: Gives me a very quick heads up on how I\u0027m doing over-all. But this interface also wanders around the screen.\u003C/p\u003E\u003Cp\u003EThat said, the icons and information is consistent, so I can glance around and find what I need quickly.\u003C/p\u003E\u003Cp\u003ECan be IMPROVED (but isn\u0027t BAD):\u003C/p\u003E\u003Cp\u003EMission Summaries! When I complete a mission and receive a bunch of Science, I would like to be informed of all science received over the flight. This includes science transmitted and earned through contracts. \u003C/p\u003E\u003Cp\u003EFunds Summaries! Again, when I complete a mission and receive a bunch of Funds, I would like to be informed, line by line, how much Funds I received from all sources - including contracts, in addition to vehicle recovery. Also, I want to be informed of the launch cost of the vehicle, if available.\u003C/p\u003E\u003Cp\u003EThe BAD:\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EI can\u0027t really think of anything, can you?\u003C/p\u003E\u003Cp\u003EThis really is the update worth waiting for. I have way more reasons and options on how and why to launch a particular mission with all new problems to solve. Excellent stuff Squad, I give this update 4.5/5 stars - it would have earned 5, if the new UI pieces had gone through another iteration or two for over-all location for ease of use, and if summaries gave me a bit more information. Even so, I fully expect to put in a couple hundred more hours into playing this update alone, and will enjoy every last minute of it.\u003C/p\u003E\u003Cp\u003E(Now to plan the return of Let\u0027s Play KSP - Career Mode! on my YT Channel)\u003C/p\u003E\n"},{"CreatedByName":"4j25","CreatedById":95125,"CreatedDateTime":"2014-07-18T03:48:08Z","Content":"\n\u003Cp\u003ENevermind, I figured out how to install it! Looks amazing as far as I can tell! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2014-07-18T03:50:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thylordroot\u0022 data-cite=\u0022thylordroot\u0022\u003E\u003Cdiv\u003EI just recorded about an hour\u0027s worth of video, and I have to say, \u003Cem\u003Ewow\u003C/em\u003E. This was well worth the wait! In good keeping with Kerbin tradition, my first contract launch was doomed to fail thanks to a staging error that deployed the chutes at the same time as my SRB. Miraculously, Jebediah Kerman somehow survived and gained positive reputation (despite destroying the bulk of his rocket).\u003Cp\u003ESo far, the only real wrinkle I have found is that \u0022activate while landed\u0022 can also apparently mean \u0022activate at launchpad\u0022. That isn\u0027t really a complaint, though; I suppose anybody who really wants the challenge can simply avoid staging the parts in question at launch. Otherwise, I am having fun so far; I have already managed to have my space program teetering on the brink of insolvency, which I feel is in good keeping with finding parts on the side of the road.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you notice that many of those activate while landed missions only give you like 200 Funds when finished?\u003C/p\u003E\n"},{"CreatedByName":"seahawk27","CreatedById":115718,"CreatedDateTime":"2014-07-18T04:23:43Z","Content":"\n\u003Cp\u003EOk here\u0027s my issue. I\u0027ve only een playing about 2 weeks and just last night was able to land on the mun and return to Kerbin. Excited doesn\u0027t begin to cover it! Now I am ready to go further but this expansion came out. I like the idea of contracts but I can\u0027t really afford mine! My first contract is to plant a flag on the mun. I only start with 10000 and that isn\u0027t enough for me to build a mun lander. I did a few test contracts but really only got to about 35000. Now I am stuck. I was excited to get on today and head out to minimus or somewhere and now I feel like the game has been taken from me. I wish I had the lower level contracts to build some cash up. I am pretty much at a lost and don\u0027t really know what to do know. I was really enjoying this game but now I am stuck. Is there a way to build cash that I\u0027m not aware of? please help!!\u003C/p\u003E\n"},{"CreatedByName":"Rufledt","CreatedById":115067,"CreatedDateTime":"2014-07-18T04:35:03Z","Content":"\n\u003Cp\u003EI agree, loving the new career mode. I haven\u0027t hit any money troubles but I haven\u0027t unlocked any really expensive. Plus I try to piggy back a few contracts at once, and pick some really high paying ones. I think the contract system is pushing me, too. I only just landed on the min and got a contract to explore Ike.\u003C/p\u003E\n"},{"CreatedByName":"Camelotking524","CreatedById":58776,"CreatedDateTime":"2014-07-18T04:43:39Z","Content":"\n\u003Cp\u003EAll these rescue missions made me think of one thing, wouldn\u0027t a two man command pod be lovely. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AAqgFlf.jpg\u0022 alt=\u0022AAqgFlf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb likes being a space taxi.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-07-18T04:44:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022seahawk27\u0022 data-cite=\u0022seahawk27\u0022\u003E\u003Cdiv\u003EOk here\u0027s my issue. I\u0027ve only een playing about 2 weeks and just last night was able to land on the mun and return to Kerbin. Excited doesn\u0027t begin to cover it! Now I am ready to go further but this expansion came out. I like the idea of contracts but I can\u0027t really afford mine! My first contract is to plant a flag on the mun. I only start with 10000 and that isn\u0027t enough for me to build a mun lander. I did a few test contracts but really only got to about 35000. Now I am stuck. I was excited to get on today and head out to minimus or somewhere and now I feel like the game has been taken from me. I wish I had the lower level contracts to build some cash up. I am pretty much at a lost and don\u0027t really know what to do know. I was really enjoying this game but now I am stuck. Is there a way to build cash that I\u0027m not aware of? please help!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou have 3 options:\u003C/p\u003E\u003Cp\u003E1) Do multiple contracts in a launch, for several launches, until you have the cash to do what you want. It helps if you are super efficient, of course. \u003C/p\u003E\u003Cp\u003E2) Hack in some cash into your persistence file. I don\u0027t know exactly where it is but if you open the file and search for whatever your current money number is, you should be able to find it. Add $100k or so as a nest egg to help yourself along.\u003C/p\u003E\u003Cp\u003E3) Hack your save file out of career mode into science mode. I also don\u0027t know how to do this, but again it shouldn\u0027t be too hard. Science mode is essentially what you played yesterday. Science, no money.\u003C/p\u003E\u003Cp\u003EAnd if you fiddle with our persistence file, back it up first!\u003C/p\u003E\n"},{"CreatedByName":"thylordroot","CreatedById":115008,"CreatedDateTime":"2014-07-18T04:44:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EtherDragon\u0022 data-cite=\u0022EtherDragon\u0022\u003E\u003Cdiv\u003EDid you notice that many of those activate while landed missions only give you like 200 Funds when finished?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn hindsight, yes; I was just excited to be doing contracts and jumped the gun a bit. I think I\u0027m beginning to get the hang of how to stack contracts to get more bang for my buck, however. The #KSPHypeTrain had me all ready to go, I suppose.\u003C/p\u003E\n"},{"CreatedByName":"thylordroot","CreatedById":115008,"CreatedDateTime":"2014-07-18T05:04:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022seahawk27\u0022 data-cite=\u0022seahawk27\u0022\u003E\u003Cdiv\u003EOk here\u0027s my issue. I\u0027ve only een playing about 2 weeks and just last night was able to land on the mun and return to Kerbin. Excited doesn\u0027t begin to cover it! Now I am ready to go further but this expansion came out. I like the idea of contracts but I can\u0027t really afford mine! My first contract is to plant a flag on the mun. I only start with 10000 and that isn\u0027t enough for me to build a mun lander. I did a few test contracts but really only got to about 35000. Now I am stuck. I was excited to get on today and head out to minimus or somewhere and now I feel like the game has been taken from me. I wish I had the lower level contracts to build some cash up. I am pretty much at a lost and don\u0027t really know what to do know. I was really enjoying this game but now I am stuck. Is there a way to build cash that I\u0027m not aware of? please help!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E5thHorseman offered some excellent options to start with, but I think it is also worth pointing out that there are things that you can do to make your money stretch a bit further as well. In particular, how you get out of the atmosphere makes a huge difference on your delta-V budget in orbit; I wouldn\u0027t bring this up otherwise, but you said you\u0027ve been playing for a couple of weeks, and it took me months to start doing my gravity turns properly. The advice I usually give to my friends who are just starting is not to overbuild their rockets and to learn how to efficiently maneuver.\u003C/p\u003E\u003Cp\u003EMy understanding is that the new contract system will always provide an out if you\u0027re having trouble maintaining funding. I\u0027m not sure exactly what happens if you go into the red (I\u0027m sure Danny2462 came pretty close, though), but it seems like there is the option of grinding funds or science until you get to the point where you can approach the landing the way you\u0027d normally do it. Nonetheless, stacking contracts and doing multiple tests in one mission seems to be a good strategy at this point.\u003C/p\u003E\n"},{"CreatedByName":"uboats","CreatedById":77596,"CreatedDateTime":"2014-07-18T05:26:56Z","Content":"\n\u003Cp\u003Ecan anyone explain what is proper stage to finish the contract? It seems that for later solid propeller contract, i need to quit the mission once all four requirement are checked? otherwise, once landed, all four are then unchecked.\u003C/p\u003E\u003Cp\u003ECannot understand the complete condition and seems parachute contract cannot play together with the radial decoupler one since they can not be all checked at the same time.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2014-07-18T05:30:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022seahawk27\u0022 data-cite=\u0022seahawk27\u0022\u003E\u003Cdiv\u003EOk here\u0027s my issue. I\u0027ve only een playing about 2 weeks and just last night was able to land on the mun and return to Kerbin. Excited doesn\u0027t begin to cover it! Now I am ready to go further but this expansion came out. I like the idea of contracts but I can\u0027t really afford mine! My first contract is to plant a flag on the mun. I only start with 10000 and that isn\u0027t enough for me to build a mun lander. I did a few test contracts but really only got to about 35000. Now I am stuck. I was excited to get on today and head out to minimus or somewhere and now I feel like the game has been taken from me. I wish I had the lower level contracts to build some cash up. I am pretty much at a lost and don\u0027t really know what to do know. I was really enjoying this game but now I am stuck. Is there a way to build cash that I\u0027m not aware of? please help!!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I understand correctly how it works you should be able to ignore those contracts and get easier ones so that you can grind the money you need from those.\u003C/p\u003E\u003Cp\u003EThis is just what I understood from what was said during squad streams or read on here, so I am not 100% sure if this is correct.\u003C/p\u003E\n"},{"CreatedByName":"Lunniy Korabl","CreatedById":10897,"CreatedDateTime":"2014-07-18T05:31:33Z","Content":"\n\u003Cp\u003E@Uboats With the solid rocket contracts you\u0027ll need to fire the rocket once all four requirements are met, not before. Then it will go completely green and no longer show the requirements. That is how you know it\u0027s done. Same with the liquid really, but you at least can mess with your staging and refire them if you lit them too early.\u003C/p\u003E\n"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2014-07-18T05:31:36Z","Content":"\n\u003Cp\u003EI thought that losing kerbs was supposed to remove rep?\u003C/p\u003E\u003Cp\u003EI just lost Jeb and didn\u0027t lose any rep (although didn\u0027t get any for recovering him either obviously)\u003C/p\u003E\n"},{"CreatedByName":"seahawk27","CreatedById":115718,"CreatedDateTime":"2014-07-18T05:32:40Z","Content":"\n\u003Cp\u003EOK i\u0027m willing to try to hack my funds but I don\u0027t see that anywhere in my persistance file. I really wish contracts were just for science. My 2 friends are both out of money now as well. I really think without the option to career mode without the money option, this game could lose some players. Make the money option be a \u0022hard\u0022 mode for example. Really disappointed over here. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"uboats","CreatedById":77596,"CreatedDateTime":"2014-07-18T05:36:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lunniy Korabl\u0022 data-cite=\u0022Lunniy Korabl\u0022\u003E\u003Cdiv\u003E@Uboats With the solid rocket contracts you\u0027ll need to fire the rocket once all four requirements are met, not before. Then it will go completely green and no longer show the requirements. That is how you know it\u0027s done. Same with the liquid really, but you at least can mess with your staging and refire them if you lit them too early.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi lunniy,\u003C/p\u003E\u003Cp\u003ESame for decoupler that I need to activate it when all requirement are checked then the contract is solid finished? Otherwise those checked requirement could be unchecked?\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-07-18T06:04:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022seahawk27\u0022 data-cite=\u0022seahawk27\u0022\u003E\u003Cdiv\u003EOK i\u0027m willing to try to hack my funds but I don\u0027t see that anywhere in my persistance file. I really wish contracts were just for science. My 2 friends are both out of money now as well. I really think without the option to career mode without the money option, this game could lose some players. Make the money option be a \u0022hard\u0022 mode for example. Really disappointed over here. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI opened my persistence file and searched for the word \u0022fund\u0022. Took me right to it.\u003C/p\u003E\u003Cp\u003EAnd there is a mode without funds. It\u0027s called Science Mode and it\u0027s the option between Career and Sandbox.\u003C/p\u003E\n"},{"CreatedByName":"Mipe","CreatedById":109421,"CreatedDateTime":"2014-07-18T06:13:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022seahawk27\u0022 data-cite=\u0022seahawk27\u0022\u003E\u003Cdiv\u003EOK i\u0027m willing to try to hack my funds but I don\u0027t see that anywhere in my persistance file. I really wish contracts were just for science. My 2 friends are both out of money now as well. I really think without the option to career mode without the money option, this game could lose some players. Make the money option be a \u0022hard\u0022 mode for example. Really disappointed over here. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuh. Squad said it\u0027d be very hard to run out of money. Either their testers are too good at playing the game or... well, you and your two friends aren\u0027t doing it right.\u003C/p\u003E\u003Cp\u003ETake a contract that offers prepayment and use that prepayment to fund another, cheaper mission. Bit by bit you should be able to creep back into black.\u003C/p\u003E\n"},{"CreatedByName":"Tweety","CreatedById":115567,"CreatedDateTime":"2014-07-18T06:24:54Z","Content":"\n\u003Cp\u003EI would just like to thank SQUAD in particular the guys that worked flat out yesterday trying to please the hype-train, you\u0027ve succeeded and I will be getting my first contracts fix this evening! Watching the speed at which we were going in that train and the terror we were causing servers all over with 502\u0027s I think they HAD no choice but give us the update :-)\u003C/p\u003E\u003Cp\u003EThankyou thankyou thankyou \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}