{"TopicId":79082,"ForumId":32,"TopicTitle":"My Fun Contract Outlook (if you care)","CreatedByName":"Lysergic","CreatedById":69762,"CreatedDateTime":"2014-07-22T23:48:26Z","PageNum":1,"Articles":[{"CreatedByName":"Lysergic","CreatedById":69762,"CreatedDateTime":"2014-07-22T23:48:26Z","Content":"\n\u003Cp\u003EOn my first 0.24 save I took on pretty much any contract offered to me, and if I couldn\u0027t complete it, I would abandon it. But I found myself discontented with the way my space program was going. Here I was, launching rediculous craft to do rediculous things at rediculous speeds and heights. I was making money hand over fist and rapidly getting bored. \u003C/p\u003E\u003Cp\u003EI started a new save and have been having a blast. After the first 4 default contracts I only accepted contracts that did NOT ask me to test a part. Basically the ones where you need to send science or land somewhere. This gave my space program structure and purpose. It also has made my funds slightly tight (5 probe launches to Jool don\u0027t come cheap when you only have a contract to hit up one moon). In addition, I don\u0027t accept the same contract twice - no flag spam, and not even multiple Kerbal rescues. And like many others I\u0027ve disabled quicksave, quick load, don\u0027t revert, and have PermaDeath on.\u003C/p\u003E\u003Cp\u003EYou may think it\u0027s crazy, but I\u0027m loving playing like this. Any of you do something similar (or totally different?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T23:50:45Z\u0022 title=\u002207/22/2014 11:50  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by Lysergic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-07-22T23:52:58Z","Content":"\n\u003Cp\u003EI only accept contract that I am 100% (Well, maybe at least 90%) sure that I am able to complete. To this day I have not failed oradbandonded a single contract. My goal is to complete every single one that I take on. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fiontar","CreatedById":115863,"CreatedDateTime":"2014-07-23T00:07:10Z","Content":"\n\u003Cp\u003EEveryone is different. Initially, I was annoyed by the crazy part contract requirements, but then I realized it makes sense to test components under certain conditions not necessarily congruent with a greater mission goal. Engines do get tested strapped to concrete blocks, or to the fuselage of a larger aircraft. Current private space companies do take on contracts for things outside their greater designs for money, status and building trust with the government and corporations looking to them for possible commercial solutions. \u003C/p\u003E\u003Cp\u003EOnce I got over the initial resistance, I started to enjoy designing odd test craft. Sometimes I can manage three mission completions in one flight, while there are some mission parameters I still haven\u0027t managed to crack. I don\u0027t obsess over the hard ones, I just revisit them from time to time with new ideas and tech to see if a different approach will work.\u003C/p\u003E\u003Cp\u003EI am glad, though, to know that it is possible to lessen dependance on component testing and turn focus back towards exploration, even if money becomes more tight. Like the real private space companies, I know that some very mundane commercial missions may be needed to fund my loftier goals and I\u0027m actually o.k. with that.\u003C/p\u003E\u003Cp\u003EThat said, I wouldn\u0027t mind a mod that would generate more science and exploration missions as a means of funding my space program...\u003C/p\u003E\n"},{"CreatedByName":"Lysergic","CreatedById":69762,"CreatedDateTime":"2014-07-23T01:47:05Z","Content":"\n\u003Cp\u003EI\u0027m hoping for a mod that generates contracts based off of the history of the US space program. I think it would be highly entertaining, and if the rewards and science were balanced right, could be nice and demanding.\u003C/p\u003E\n"},{"CreatedByName":"95tiger59","CreatedById":92346,"CreatedDateTime":"2014-07-23T01:52:09Z","Content":"\n\u003Cp\u003Eyeah I only take contracts I know I can complete, but will occasionally take a part testing one if it is easy\u003C/p\u003E\n"},{"CreatedByName":"biohazard15","CreatedById":91655,"CreatedDateTime":"2014-07-23T01:52:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lysergic\u0022 data-cite=\u0022Lysergic\u0022\u003E\u003Cdiv\u003EI\u0027m hoping for a mod that generates contracts based off of the history of the US space program. I think it would be highly entertaining, and if the rewards and science were balanced right, could be nice and demanding.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that would nicely go along with FASA.\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-07-23T11:50:51Z","Content":"\n\u003Cp\u003EI am surprised there are no launch communications satellite contracts. Don\u0027t Kerbals have direct tv?\u003C/p\u003E\n"},{"CreatedByName":"Ruthgar","CreatedById":113799,"CreatedDateTime":"2014-07-23T12:34:28Z","Content":"\n\u003Cp\u003EI will take the part testing contracts if I can work them into another mission I have going on, or if I can get several test contracts that will work cheaply on one of my dedicated test vehicles. Current record is 8 test contracts done with my jet with each test having different start requirements.\u003C/p\u003E\n"},{"CreatedByName":"Pope_Gregory_IX","CreatedById":82244,"CreatedDateTime":"2014-07-23T12:56:40Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI\u0027m hoping to use contracts to generally improve my designs / gameplay. Pre-0.24, I\u0027ve built munstations, spacestations and so on, but my general attitude when things don\u0027t go well has been to add more dV (Moar boosters, as I think the youngsters call it nowadays \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ).\u003C/p\u003E\u003Cp\u003EI\u0027d like to gradually go through the career mode now, being tight with budgets and going for a more minimalist approach. The aim is that by the end of it, I\u0027ll be much better at everything I do in my sandbox mode games.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003EAdam\u003C/p\u003E\n"},{"CreatedByName":"ArchGaden","CreatedById":116362,"CreatedDateTime":"2014-07-23T13:43:05Z","Content":"\n\u003Cp\u003EI\u0027ve had a blast with the insane test contracts, but I\u0027ve started cherry picking only the ones that give exceptional funds or science now so that I can focus on advancement. After the novelty of part testing wears off, the key for me has been moderation. \u003C/p\u003E\u003Cp\u003EOne mission type that has annoyed me is rescue missions... the first was awesome, but they seem too frequent and I feel compelled to do them on an emotional level, even though there is no longer any real benefit to doing them. If I don\u0027t rescue that kerbal, who will? I\u0027ve overcome that boredom by taking a new approach. Instead of sending a perfected rescue craft up for each mission...I designed a new rescue bus made of detachable life-pods, each capable of detaching from the bus and bringing a kerbal home. My first design has 4 such pods... so 1 launch keeps me in business for the new 4 rescues. That was a fun project and puts some LEO infrastructure up if I ever need to rescue my own guys. After I use all those pods, I\u0027ll improve it by adding more dv to the pods so they can swing out for moon rescues if required.... perhaps even work it in as part of a station. Taking a mission I dislike and adding my own goals to it has been great! I expect that was intended. \u003C/p\u003E\u003Cp\u003ESimilarly, you can use other repetitive missions as an excuse for developing advanced infrastructure. Tired of gathering science data in orbit? Build a satellite or research station! Tired of planting flags on Mun? Build a staffed moon base!\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2014-07-23T16:37:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ArchGaden\u0022 data-cite=\u0022ArchGaden\u0022\u003E\u003Cdiv\u003EI\u0027ve had a blast with the insane test contracts, but I\u0027ve started cherry picking only the ones that give exceptional funds or science now so that I can focus on advancement. After the novelty of part testing wears off, the key for me has been moderation. \u003Cp\u003EOne mission type that has annoyed me is rescue missions... the first was awesome, but they seem too frequent and I feel compelled to do them on an emotional level, even though there is no longer any real benefit to doing them. If I don\u0027t rescue that kerbal, who will? I\u0027ve overcome that boredom by taking a new approach. Instead of sending a perfected rescue craft up for each mission...I designed a new rescue bus made of detachable life-pods, each capable of detaching from the bus and bringing a kerbal home. My first design has 4 such pods... so 1 launch keeps me in business for the new 4 rescues. That was a fun project and puts some LEO infrastructure up if I ever need to rescue my own guys. After I use all those pods, I\u0027ll improve it by adding more dv to the pods so they can swing out for moon rescues if required.... perhaps even work it in as part of a station. Taking a mission I dislike and adding my own goals to it has been great! I expect that was intended. \u003C/p\u003E\u003Cp\u003ESimilarly, you can use other repetitive missions as an excuse for developing advanced infrastructure. Tired of gathering science data in orbit? Build a satellite or research station! Tired of planting flags on Mun? Build a staffed moon base!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the attitude I look for among fellow KSP players. Though there may not be anything spelled out in black and white in career mode about building a space station or base, there are tremendous advantages to having them, even with the likely chance of not getting any of those initial funds back, especially since they make it likely to get a better return in further missions. Like SSTO\u0027s? Build an orbiting refueling station to get that SSTO out of LKO and to the Mun and Minmus for cheap science. The potential is there, and imagination is what brings it to light. You do not have to have it spelled out for you.\u003C/p\u003E\n"}]}