{"TopicId":80104,"ForumId":32,"TopicTitle":"My Sonada 1 Mission (Mun landing and rover assembly)","CreatedByName":"Strainborm","CreatedById":116277,"CreatedDateTime":"2014-07-30T11:09:20Z","PageNum":1,"Articles":[{"CreatedByName":"Strainborm","CreatedById":116277,"CreatedDateTime":"2014-07-30T11:09:20Z","Content":"\n\u003Cp\u003ESo I decided to send (yet another) Mun landing mission, but this time I had KerbalAttachmentSystem and ModularMultiwheels installed. So I thought, hey, how about I try to assemble a manned rover on the Mun, kind of like Apollo 15 mission? And so i did. \u003C/p\u003E\u003Cp\u003EI kinda decided to cut a corner, so instead of proper Apollo-style mission with separate CSM and lander modules I just made a singe lander module which would leave rover \u0027hangar\u0027 on the Mun when returning. So the entire thing looked something like this. The only already-assembled part of the rover was just the probe body with wheel base with electric engine and a docking port Jr, just the parts that you cannot attach from EVA. All other parts (such as the rest of the frame, scientific instruments, a seat, solar panels, Communitron 88-88, and batteries) were stored in KAS part containers, right above the rover base. \u003C/p\u003E\u003Cp\u003EThe rocket itself was mostly built with KW Rocketry parts, pretty much now an essential mod for any of my KSP mod builds. The parts just look so awesome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WSnl3yE.png\u0022 alt=\u0022WSnl3yE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JT7mN1k.png\u0022 alt=\u0022JT7mN1k.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EThe launch was pretty regular, standard gravity turn, circularization, transfer to Mun, orbit capture, all that well-known jazz. I didn\u0027t really pick a specific landing point, just landed somewhere near East Crater. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5yfPYUJ.png\u0022 alt=\u00225yfPYUJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EI kinda forgot to take screenshots of the assembly process \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E But the final result was this. Jeb was very happy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AA42giO.png\u0022 alt=\u0022AA42giO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EThe rover itself performed very well, although i encountered a bug where the electric engine refused to draw the electric charge from one of the batteries. I think Bill should follow the manual after all, especially when building a rover, he probably wired something up incorrectly. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E And Jeb, the crazy kerbal that he is, somehow managed to break one of the solar panels on the lander, even though Bob told the guys at the VAB to specifically put them up high out of his reach. \u003C/p\u003E\u003Cp\u003EJust as I was about to return, Kerbin eclipse. Bob, Bill and Jeb were stranded for a while, but I don\u0027t think that they mind, I mean, the view was fantastic! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E But just as the first glimpse of the Kerbol appeared, the trio has set off for a trip back home\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wZVKHhd.png\u0022 alt=\u0022wZVKHhd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4MvD6j5.png\u0022 alt=\u00224MvD6j5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EThe trip back to Kerbin was pretty uneventful, we\u0027ve all done this many times \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But the guys landed safe and sound, with Bill planning next time to take an airplane and Bob explaining why that wouldn\u0027t work, while Jeb eats the rest of snacks. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tLRvXZ6.png\u0022 alt=\u0022tLRvXZ6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FI1nPCw.png\u0022 alt=\u0022FI1nPCw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vX0p3XI.png\u0022 alt=\u0022vX0p3XI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EI personally enjoyed this mission quite a lot. Even though it\u0027s really not much, it was still very fun and interesting. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat do you think? What is your favorite mission? Share with me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2014-07-30T11:12:14Z","Content":"\n\u003Cp\u003EI think this should really be in the fanworks forum but nice rocket all the same.\u003C/p\u003E\n"}]}