{"TopicId":84251,"ForumId":32,"TopicTitle":"What is your favorte Joolian moon? (quick survey thing)","CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-09-10T05:30:50Z","PageNum":1,"Articles":[{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-09-10T05:30:50Z","Content":"\n\u003Cp\u003EHey all. I was just curious what YOUR favorite \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EJoolian moon\u003C/span\u003E is?\u003C/p\u003E\u003Cp\u003EI seem to have a habit of randomly posting polls but, I find it entertaining and somewhat enlightening on what the forum thinks of a subject/what they do (apparently, 15% of the forum uses a mobile device for the forum \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E). So which moon of Jool is your favorite?\u003C/p\u003E\n"},{"CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-09-10T05:47:49Z","Content":"\n\u003Cp\u003Einb4 Laythe...\u003C/p\u003E\u003Cp\u003EAnyways, my favorite Joolian moon would have to be Pol because of its very colorful and very mountainous landscape. Also, its the first Joolian moon I ever landed on...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/TVxSu3Z\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/TVxSu3Z.jpg\u0022 alt=\u0022TVxSu3Z.jpg\u0022\u003E\u003C/a\u003E \u003C/p\u003E\u003Cp\u003ECan you believe it! That picture is over 1 year and 4 months old. Ahh the memories... T\u0027was a simpler time when I didn\u0027t care about Delta-V or building decent rockets or doing anything remotely efficiently...\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-09-10T06:57:58Z","Content":"\n\u003Cp\u003EAlways Pol.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/ik80.jpg\u0022 alt=\u0022ik80.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s just the most interesting moon to look at!\u003C/p\u003E\n"},{"CreatedByName":"KingPhantom","CreatedById":110881,"CreatedDateTime":"2014-09-10T07:13:01Z","Content":"\n\u003Cp\u003EPOL and BOP. i like small moons...\u003C/p\u003E\u003Cp\u003Ebut vall is also intersting.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-09-10T07:21:54Z","Content":"\n\u003Cp\u003EPol for the landscape, Vall for the anomaly.\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-09-10T07:36:44Z","Content":"\n\u003Cp\u003EPoor Tylo aint getting much of a like... i guess because saying hello to Tylo always ends in a fight to the death.\u003C/p\u003E\u003Cp\u003EIÃ‚Â´ve never been to Bop and Pol, Val is vast but has some strange feeling to it and i still need to find the anomaly\u003C/p\u003E\u003Cp\u003E(located it with ScanSAT in my .23.5 career though), so i go with Laythe. Especially with Environmental Visual Enhancements installed.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-09-10T07:43:51Z","Content":"\n\u003Cp\u003EWell, Pol does look pretty, but for challenge and excitement - Tylo.\u003C/p\u003E\u003Cp\u003EBase/mining station refuelling the skycrane that landed it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zdpXQMT.png\u0022 alt=\u0022zdpXQMT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELaythe sure is pretty too..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ywqLlJd.png\u0022 alt=\u0022ywqLlJd.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-10T08:00:42Z\u0022 title=\u002209/10/2014 08:00  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 10, 2014\u003C/time\u003E by SSSPutnik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-09-10T08:10:47Z","Content":"\n\u003Cp\u003ENice landing SkyRender \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E No need for gravity turn on launch!\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-09-10T12:17:14Z","Content":"\n\u003Cp\u003EIve always loved vall, but ive never landed on it. I think that will be my weekend mission this week.\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-09-10T12:35:55Z","Content":"\n\u003Cp\u003EPersonally I like Bop. To me Laythe is over rated it is a bunch of water with little to do, and it seems like the hipster place to visit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-09-10T12:54:06Z","Content":"\n\u003Cp\u003EI personally have to go with Vall. I\u0027ve landed at twice there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. both at the anomaly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. I just love the place. Icy... mystical... Also the science scans said something cool about earthquakes. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58923-Jeb-s-Vall-Adventure%21-%28-VERY-pic-heavy%29\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s the mission log\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ESharing my story isn\u0027t the point of this though. Why does everyone like Laythe so much... is it because jet engines?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-09-10T16:11:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avera9eJoe\u0022 data-cite=\u0022Avera9eJoe\u0022\u003E\u003Cdiv\u003EWhy does everyone like Laythe so much... is it because jet engines?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think so. That and it\u0027s a good candidate for colonization with its friendly atmosphere. Watching Jool rise from Laythe orbit is one of the best sights to see in the game, too.\u003C/p\u003E\n"},{"CreatedByName":"SiliconPyro","CreatedById":19734,"CreatedDateTime":"2014-09-10T16:26:07Z","Content":"\n\u003Cp\u003EFor me, it\u0027s Laythe. I\u0027ve only visited once and didn\u0027t bring a jet, plus there was a catastrophic failure that destroyed my lander while I was several hundred meters away, but I still like it. I\u0027ll be back someday, and with my VTOL engine!\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-09-10T16:33:06Z","Content":"\n\u003Cp\u003ELaythe. There\u0027s something exhilarating about landing a plane on a mysterious moon from orbit.\u003C/p\u003E\n"},{"CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2014-09-10T16:52:58Z","Content":"\n\u003Cp\u003EI have no flipping idea why, but I really like Tylo. I love the challenge it presents.\u003C/p\u003E\n"},{"CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-09-10T16:53:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avera9eJoe\u0022 data-cite=\u0022Avera9eJoe\u0022\u003E\u003Cdiv\u003EI personally have to go with Vall. I\u0027ve landed at twice there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. both at the anomaly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. I just love the place. Icy... mystical... Also the science scans said something cool about earthquakes. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58923-Jeb-s-Vall-Adventure%21-%28-VERY-pic-heavy%29\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s the mission log\u003C/a\u003E.\u003Cp\u003ESharing my story isn\u0027t the point of this though. Why does everyone like Laythe so much... is it because jet engines?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you look at the Joolian moons in terms of how useful they are, Laythe ranks #1 easily. For starters, Laythe has an atmosphere which allows you to areocapture directly from a Jool flyby into a Laythe orbit without having to spend a ton of fuel, or aerocapture at Jool. In addition, Laythe has strong gravity (as strong as Tylo) which makes it a prime target for gravity assists. You can also perform both a gravity assist AND an aerobrake to change your orbit in ways a regular gravity assist couldn\u0027t. This makes Laythe an incredibly useful planet for correcting inclined, hyperbolic Jool flyby orbits into Jool equatorial orbits. As mentioned before, Laythe also has oxygen in its atmosphere which means that you can use KSP\u0027s incredibly overpowered jet engines to land/lift heavy payloads with minimum fuel (not saying that this is a bad thing, I\u0027m guilty of it too). On top of all of that, Laythe is the most science rich celestial body in the Kerbol System. So there, Laythe OP volvo pls nerf.\u003C/p\u003E\u003Cp\u003EDespite all this, I can\u0027t like Laythe as much as Pol. There\u0027s just something mysterious and captivating about Pol... I also like Vall a lot too, it ranks #2 as my favorite Joolian moon just for this scene: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/t6Mfd6D\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/t6Mfd6D.jpg\u0022 alt=\u0022t6Mfd6D.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2014-09-10T17:07:07Z","Content":"\n\u003Cp\u003EI was amazed by Pol\u0027s beauty when I landed on it. Although not a fan of moons with tiny gravity (makes my rover perform badly), I would definitely use that one for a refueling base before heading out to (future) further away planets of the Kerbol System (like an Uranus analogue of somekind).\u003C/p\u003E\u003Cp\u003ELaythe comes in as a close second with Val.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-09-10T17:11:21Z","Content":"\n\u003Cp\u003EI like Pol because all the spikes remind me of this ancient claymation Gumby show where he went to the moon. Also, all the spikes kick your FPS in the crotch when you get low enough for ground scatter to load. And there are places where the collision mesh is about 1500m above the visible surface so your ship explodes during descent. But mostly because it looks like the Daemon Sultan Azathoth \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. What\u0027s not to love about it?\u003C/p\u003E\n"},{"CreatedByName":"SlyReaper","CreatedById":58168,"CreatedDateTime":"2014-09-10T18:16:19Z","Content":"\n\u003Cp\u003EI like Laythe because it\u0027s a challenging place to land and return from, but not so challenging that you need a super-heavy unwieldy lander module like Tylo. The fact that it has oxygen means I don\u0027t feel so bad about stranding kerbals there if something goes wrong. And the view is amazing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dDDs3dF.png\u0022 alt=\u0022dDDs3dF.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-09-10T19:13:58Z","Content":"\n\u003Cp\u003EI do like Laythe, and it\u0027s very pretty with BA (especially looking at Jool!), but Pol is mostest favouritester; it looks cool with its weird colours, it\u0027s a breeze to get to and land on, its low gravity is great fun, and it\u0027s really useful when you have EPL and Kethane/Karbonite!\u003C/p\u003E\u003Cp\u003EIMO, Pol wins this Poll!\u003C/p\u003E\n"},{"CreatedByName":"General Rarity","CreatedById":67829,"CreatedDateTime":"2014-09-10T19:18:13Z","Content":"\n\u003Cp\u003EVall, because it\u0027s icy and looks awesome. I just adore it, even though I have only landed on it once.\u003C/p\u003E\n"},{"CreatedByName":"GreeningGalaxy","CreatedById":66813,"CreatedDateTime":"2014-09-10T20:07:16Z","Content":"\n\u003Cp\u003EI\u0027m also kind of weirdly in love with Vall. It doesn\u0027t look a thing like Europa (which I am, slightly more seriously, also in love with) but I just love the seas of ageless ice surrounded by sharp mountain ranges. It and Laythe are actually the only ones of the Joolian moons I\u0027ve ever landed on (I should really send something to Bop and Pol soon, Tylo can wait until I have a few days of nothing to do). Laythe is pretty and the 02 atmosphere is very intriguing (and useful), but its hard to take off from and has a habit of eating my ships and kerbals Eve-style. It would probably be my favorite if I went there more, but every ship I send to Jool tends to get enticed by the siren song of Vall and lands there instead. Which is often a good thing, because sometimes I just head off for Jool without remembering to equip my ship with a lander capable of getting down and back up again from anywhere big, and end up having to just land on whatever I can get my transit vehicle down onto. That\u0027s not really an excuse for not going to Bop or Pol, but the big far-out and inclined orbits tend to prey upon my laziness. \u003C/p\u003E\u003Cp\u003EVall, though. I mean, just \u003Cem\u003Elook\u003C/em\u003E at this place!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7y8XPjw.png\u0022 alt=\u00227y8XPjw.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2014-09-11T18:32:49Z","Content":"\n\u003Cp\u003EFor my money, it\u0027s always Vall. Something about its ice-cold blue, rolling mountains, and mysterious land formations near the south pole. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/f9BmTP5.png\u0022 alt=\u0022f9BmTP5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CNhcAwp.png\u0022 alt=\u0022CNhcAwp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2014-09-11T20:14:48Z","Content":"\n\u003Cp\u003ETylo -- because it\u0027s hard.\u003C/p\u003E\n"},{"CreatedByName":"MisterDoubleSevens","CreatedById":119193,"CreatedDateTime":"2014-09-11T21:00:21Z","Content":"\n\u003Cp\u003ECan I say \u0022anything that\u0027s not Pol\u0022?\u003C/p\u003E\u003Cp\u003EBecause Pol is cursed. Literally any time my mission has even included a\u003Cem\u003E consideration \u003C/em\u003Eof going to Pol, it fails in some way.\u003C/p\u003E\n"}]}