{"TopicId":84730,"ForumId":32,"TopicTitle":"What is Kerbal Space Program ?","CreatedByName":"EnderSpace","CreatedById":118587,"CreatedDateTime":"2014-09-16T10:52:29Z","PageNum":1,"Articles":[{"CreatedByName":"EnderSpace","CreatedById":118587,"CreatedDateTime":"2014-09-16T10:52:29Z","Content":"\n\u003Cp\u003EHi I have been thinking about topic but then I remember \u0022what is KSP ?\u0022 \u003C/p\u003E\u003Cp\u003EWhen I ever started KSP I didn\u0027t know anything about it , I just see Scott Manley tutorials and learn how to go up then little right and then orbit and I see all tutorials , but Scott was missing something.\u003C/p\u003E\u003Cp\u003E( Science , Math , Angles , Mass , Delta V and many thing that kerbal space program is about was missing , and then I realized what I\u0027m doing is not kerbal space program.\u003C/p\u003E\u003Cp\u003Ewhat I\u0027m doing is just copying tutorials and that sadly what 60% of players do , they only think they should not learn science and math and other things they only think that they should only blast off with rocket to other planets and do what tutorials do , yes tutorials is the best way to learn a game but sadly the most dump players don\u0027t learn they only copy and copy that is not Kerbal Space Program that\u0027s , that is Copying Space Program , I\u0027m not kidding.\u003C/p\u003E\u003Cp\u003Ethen I think many of you want to know what is kerbal space program is , What is it , it\u0027s a game make you know space very well and make you smarter ,also \u003Cstrong\u003EHow Hard is Rocket Science anyway ?\u003C/strong\u003E I see many people stop playing it after 2 or 3 months , because they are not that smart to understand what is Kerbal Space Program and they are not interested in space and math they want only to play games don\u0027t need your mind like call of duty and minecraft.\u003C/p\u003E\u003Cp\u003Enow I can tell thanks to SQUAD \u003C/p\u003E\u003Cp\u003E- thanks for making the only Science Space Game in the world\u003C/p\u003E\u003Cp\u003E- thanks for making something realistic that can make someone smart\u003C/p\u003E\u003Cp\u003E- thanks for keeping updating the game huge updates\u003C/p\u003E\u003Cp\u003E- thanks for making a community for ideas and question and everything else\u003C/p\u003E\u003Cp\u003E- thanks , thanks for Creating \u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EKerbal Space Program\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eif you still don\u0027t know what is kerbal space program , it\u0027s Space Exploration Program for smarts\u003C/p\u003E\u003Cp\u003ESQUAD if you ever stop updating KSP , I\u0027m going to come to your home and kill you D-:\u0026lt;\u0026lt;\u003C/p\u003E\n"},{"CreatedByName":"TimberWolffe","CreatedById":119811,"CreatedDateTime":"2014-09-16T11:07:02Z","Content":"\n\u003Cp\u003EKerbal Space Program is a game in which you can do whatever and have it work because PHYSICS, and also things that should work...don\u0027t\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-09-16T11:23:04Z","Content":"\n\u003Cp\u003EKerbal Space Program is a game, that makes your SCIENCE fiction dreams come true, while teaching you a lot about actual spaceflight. Imagine - Think - Build - Test - Launch - Explode\u003C/p\u003E\n"},{"CreatedByName":"EnderSpace","CreatedById":118587,"CreatedDateTime":"2014-09-16T11:27:33Z","Content":"\n\u003Cp\u003EYep that what I mean\u003C/p\u003E\u003Cp\u003Enot just a rocket to other planet\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-09-16T12:22:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frank_G\u0022 data-cite=\u0022Frank_G\u0022\u003E\u003Cdiv\u003EImagine - Think - Build - Test - Launch - Explode\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure I\u0027ve ever seen KSP summed up so succinctly. Good job!\u003C/p\u003E\u003Cp\u003EI think of KSP as the ultimate spaceship Lego set, where you get to be the rocket scientist and astronaut. What\u0027s not to love?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-09-16T12:25:13Z","Content":"\n\u003Cp\u003EI don\u0027t think KSP is intended to be about math, angles, mass, and delta-v. Actually, KSP devs did a lot in order to allow you flying into space without you actually knowing them. They are an option, and they give you an edge. The more you understand the math under the hood, the more effective you can be in the game. But it is not a requirement.\u003C/p\u003E\u003Cp\u003EIn my opinion, the intent is for the game is to give you \u0022feel\u0022 for orbital mechanics. You don\u0027t need to understand all the math and you still can understand orbital mechanics intuitively and be able to guess what is good and what is bad.\u003C/p\u003E\u003Cp\u003EMany players declare MechJeb, KER or VOID are essential for playing the game. In the end, they don\u0027t actually need to understand orbital mechanics, they just know which button to push for their ship to do the right thing. I don\u0027t think it is any better than following tutorials. They\u0027re just following slightly different tutorials.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-09-16T12:34:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIn my opinion, the intent is for the game is to give you \u0022feel\u0022 for orbital mechanics. You don\u0027t need to understand all the math and you still can understand orbital mechanics intuitively and be able to guess what is good and what is bad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is quite true. I gained a better intuitive grasp of how orbits work in a hour of playing with burns in different directions in orbit around Kerbin than I did in a lifetime of reading about the space program. It is one thing to understand the math behind changing orbits, it is another entirely to gain experience watching those changes take place in front of you.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EMany players declare MechJeb, KER or VOID are essential for playing the game. In the end, they don\u0027t actually need to understand orbital mechanics, they just know which button to push for their ship to do the right thing. I don\u0027t think it is any better than following tutorials. They\u0027re just following slightly different tutorials.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEr, I don\u0027t think I\u0027d put KER and VOID in that category, there\u0027s no button to push with them. They\u0027re just convenient calculation and information tools. If a player is the type that likes real numbers instead of seat-of-the-pants feel, they might quickly feel that an in-game calculator is essential to their enjoyment of the game. VOID and KER (and the info displays in MechJeb) tell you nothing about how or when to execute a maneuver, they just give feedback in numerical form rather than graphical.\u003C/p\u003E\u003Cp\u003EDefinitely agree that it\u0027s possible to play and enjoy KSP without them, as you and others demonstrate.\u003C/p\u003E\n"},{"CreatedByName":"EnderSpace","CreatedById":118587,"CreatedDateTime":"2014-09-16T12:48:38Z","Content":"\n\u003Cp\u003EWhat only squad need is making planet surface awesome\u003C/p\u003E\u003Cp\u003Ealso in my profile what is reputation?\u003C/p\u003E\n"},{"CreatedByName":"Jon Tash","CreatedById":2681,"CreatedDateTime":"2014-09-16T13:00:38Z","Content":"\n\u003Cp\u003EKSP is Love, KSP is Life, KSP is everything and better than 42.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frank_G\u0022 data-cite=\u0022Frank_G\u0022\u003E\u003Cdiv\u003EImagine - Think - Build - Test - Launch - Explode\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn a serious note, this is pretty much what KSP is summed up.\u003C/p\u003E\n"},{"CreatedByName":"TimberWolffe","CreatedById":119811,"CreatedDateTime":"2014-09-16T14:13:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frank_G\u0022 data-cite=\u0022Frank_G\u0022\u003E\u003Cdiv\u003E Imagine - Think - Build - Test - Launch - Explode\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy experience thus far is Imagine - Explode - Think - Explode - Build - Explode - Test - Explode - Launch - Explode\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-09-16T14:48:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TimberWolffe\u0022 data-cite=\u0022TimberWolffe\u0022\u003E\u003Cdiv\u003EMy experience thus far is Imagine - Explode - Think - Explode - Build - Explode - Test - Explode - Launch - Explode\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s close to the way I play KSP, which is like this.\u003C/p\u003E\u003Cp\u003EExplode - Explode - Explode - Explode - Fifteen minutes of stupid laughter - Explode - Explode - Something works by accident - Amazement - Think - Rebuild it bigger - Test - Explode - Fifteen minutes of stupid laughter - Rebuild - Re-test - Success (EXPLODE EXPLODE EXPLODE)\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-09-16T14:57:50Z","Content":"\n\u003Cp\u003EYes, that is what can be verified through your videos... (which add the stupid laughter to my equation too)\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-09-16T15:01:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EnderSpace\u0022 data-cite=\u0022EnderSpace\u0022\u003E\u003Cdiv\u003E...\u003Cp\u003Ealso in my profile what is reputation?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReputation is what you get when you do something that other people want to reward, or give approval to. Essentially, the more reputation you have, the more you have done cool or worthy things on the Forum. You can see roughly how much \u002BRep a person has by looking just above their profile picture. A single blob of rep means you have 0-99 \u0022points,\u0022 two blobs is 100-199 points, etc.\u003C/p\u003E\u003Cp\u003EBecause I have created artwork and music, made a number of neat craft, and occasionally posted a witty comment, I now have five rep blobs. People like Red Iron Crown (who commented above) have much more rep than I do, though.\u003C/p\u003E\u003Cp\u003EThat\u0027s basically it, in a nutshell. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nahim","CreatedById":78568,"CreatedDateTime":"2014-09-16T17:10:18Z","Content":"\n\u003Cp\u003EWe all learn a lot! Well, guess the ones that survive to tell...\u003C/p\u003E\u003Cp\u003EBut i agree! KSP is the first comercial SCIENCE game out there, at least that was intended to be comercial i guess. A plenty of people distaste it because it is not a first person shooter like all the post modern AAA games in ocident. But for the ones that give a try... the sense of acomplishment after the first succeful orbit/docking/transfer is outstanding! Every man loves to discover that all these moments at the school that you were forced to believe that you were mediocre and puny, was nothing but a round lie! The stars shines for all the exploders.\u003C/p\u003E\n"},{"CreatedByName":"GreeningGalaxy","CreatedById":66813,"CreatedDateTime":"2014-09-16T18:10:57Z","Content":"\n\u003Cp\u003EI don\u0027t think you learn any less about space travel if you follow tutorials. Now, granted, you don\u0027t exactly learn all that much either way compared to actually going to college and majoring in astrophysics or something, but all I did at the beginning was follow Scott Manley\u0027s maneuver node tutorials, and now I have a significantly improved idea of how orbital mechanics work than I did before. These days, I sometimes don\u0027t even use maneuver nodes out of laziness / just to see how far I can get before I have to use one (usually all but the inital encounter burn), which ends up creating trainwreck missions like my last one to Eeloo. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn all seriousness, though, I think just playing with maneuver nodes and understanding what they do goes a very long way towards teaching you orbital mechanics, regardless of whether or not you watch tutorials or use Mechjeb to follow the nodes for you after you create them. Figuring it out on your own might give you a sense of satisfaction, but I think if you manage to land on another body in KSP, you\u0027ll arrive with a better understanding of physics no matter how you do it.\u003C/p\u003E\u003Cp\u003EHyperedit and jump drive mods nonwithstanding, of course.\u003C/p\u003E\n"},{"CreatedByName":"EnderSpace","CreatedById":118587,"CreatedDateTime":"2014-09-16T18:29:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UpsilonAerospace\u0022 data-cite=\u0022UpsilonAerospace\u0022\u003E\u003Cdiv\u003EReputation is what you get when you do something that other people want to reward, or give approval to. Essentially, the more reputation you have, the more you have done cool or worthy things on the Forum. You can see roughly how much \u002BRep a person has by looking just above their profile picture. A single blob of rep means you have 0-99 \u0022points,\u0022 two blobs is 100-199 points, etc.\u003Cp\u003EBecause I have created artwork and music, made a number of neat craft, and occasionally posted a witty comment, I now have five rep blobs. People like Red Iron Crown (who commented above) have much more rep than I do, though.\u003C/p\u003E\u003Cp\u003EThat\u0027s basically it, in a nutshell. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh thanks , I thought it was good topic , but I will make better soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2014-09-16T18:41:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EI don\u0027t think KSP is intended to be about math, angles, mass, and delta-v. Actually, KSP devs did a lot in order to allow you flying into space without you actually knowing them. They are an option, and they give you an edge. The more you understand the math under the hood, the more effective you can be in the game. But it is not a requirement.\u003Cp\u003EIn my opinion, the intent is for the game is to give you \u0022feel\u0022 for orbital mechanics. You don\u0027t need to understand all the math and you still can understand orbital mechanics intuitively and be able to guess what is good and what is bad.\u003C/p\u003E\u003Cp\u003EMany players declare MechJeb, KER or VOID are essential for playing the game. In the end, they don\u0027t actually need to understand orbital mechanics, they just know which button to push for their ship to do the right thing. I don\u0027t think it is any better than following tutorials. They\u0027re just following slightly different tutorials.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree that KSP is a good way to come at orbital mechanics from an intuitive approach, and it does a great job of introducing concepts in a useful order. First you start with getting something off the launch pad. Second, orbits and plane changes. Then you work on intercepts, rendezvous, landings, and dockings. A player practices these concepts and becomes more adept at utilizing the navball, maneuver nodes, and the other optional tools like KER. If a player wants to be hardcore, they can sit down and do all the maths associated with these concepts, but for those like me who don\u0027t math so well, KSP allows me to understand the concepts and apply them successfully so I can get a deeper appreciation for the achievements of real-life space programs. It\u0027s the feedback between real-life concepts and practices and in-game exerimentation that makes KSP such a wonderful game and learning experience.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-09-16T18:45:28Z","Content":"\n\u003Cp\u003EAnother short definition: KSP is a kind of interactive LEGO* game in which you can make your own parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E.\u003C/p\u003E\u003Cp\u003E*or Playmobil or Meccano or any kind of similar building game.\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-09-16T18:47:35Z","Content":"\n\u003Cp\u003EI really like comparing KSP with Lego... like Justin or Red Iron Crown mentioned. It really hits the nail on the head.\u003C/p\u003E\n"},{"CreatedByName":"Monger","CreatedById":4143,"CreatedDateTime":"2014-09-16T20:37:34Z","Content":"\n\u003Cp\u003EKerbal Space Program is a game that combines hilarious disaster with some real engineering and physics lessons.\u003C/p\u003E\n"},{"CreatedByName":"nine_iron","CreatedById":37971,"CreatedDateTime":"2014-09-16T21:06:02Z","Content":"\n\u003Cp\u003EKSP is a place to put all my KSP mods.\u003C/p\u003E\u003Cp\u003EAlso I like looking at the sky.\u003C/p\u003E\n"},{"CreatedByName":"BDelacroix","CreatedById":121050,"CreatedDateTime":"2014-09-16T21:42:28Z","Content":"\n\u003Cp\u003EThe open nature of the game means the game is about what you make it about.\u003C/p\u003E\u003Cp\u003EFor myself, I looked at no online tutorials. I looked at the ones that came with the demo then experimented.\u003C/p\u003E\n"},{"CreatedByName":"TimberWolffe","CreatedById":119811,"CreatedDateTime":"2014-09-16T23:47:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003EAnother short definition: KSP is a kind of interactive LEGO* game in which you can make your own parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E.\u003Cp\u003E*or Playmobil or Meccano or any kind of similar building game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d more associate KSP with something a bit different from Lego. Can\u0027t remember what it\u0027s called, but basically the difference for me is you use Legos to make your parts, but in KSP you have the parts made, you just build different sections using them. It\u0027s a kind of sandboxy non-sandboxy thing that I find hard to explain\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-09-16T23:59:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EnderSpace\u0022 data-cite=\u0022EnderSpace\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E- thanks for making the only Science Space Game in the world\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOrbiter, Universe Sandbox, Space Engine, Spaceway, BARIS, F-Sim, SSMS, Celestia, Pioneer, Take On Mars etc etc don\u0027t count?\u003C/p\u003E\n"},{"CreatedByName":"Nahim","CreatedById":78568,"CreatedDateTime":"2014-09-17T02:27:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EOrbiter, Universe Sandbox, Space Engine, Spaceway, BARIS, F-Sim, SSMS, Celestia, Pioneer, Take On Mars etc etc don\u0027t count?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGuess you\u0027re right! Also BARIS is one of the best ever!\u003C/p\u003E\n"}]}