{"TopicId":85925,"ForumId":32,"TopicTitle":"Disasters and safety survey","CreatedByName":"Hudson633","CreatedById":92081,"CreatedDateTime":"2014-10-02T19:53:30Z","PageNum":1,"Articles":[{"CreatedByName":"Hudson633","CreatedById":92081,"CreatedDateTime":"2014-10-02T19:53:30Z","Content":"\n\u003Cp\u003ELink to \u003Ca href=\u0022https://docs.google.com/forms/d/1hZLV0PFqYWSNtZ-HGpHOkVAoEM_9pC--5rQcWHAaj1M/viewform?usp=send_form\u0022 rel=\u0022external nofollow\u0022\u003Esurvey\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ELink to \u003Ca href=\u0022https://docs.google.com/forms/d/1hZLV0PFqYWSNtZ-HGpHOkVAoEM_9pC--5rQcWHAaj1M/viewanalytics?usp=form_confirm\u0022 rel=\u0022external nofollow\u0022\u003Eresults\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EFeedback appreciated.\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-10-02T20:29:18Z","Content":"\n\u003Cp\u003EGreat idea. Not sure if the multiple choice structure will make it easy to deduce any findings - as a participant can basically select nearly every option. Regardless, let\u0027s see what happens.\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2014-10-02T20:32:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf you lost a kerbal deliberately, how do you feel about it?\u003Cp\u003E Unhappy\u003C/p\u003E\u003Cp\u003E Indifferent\u003C/p\u003E\u003Cp\u003E Happy -----Tick\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs it bad that i tick almost every disaster and crash related tick box?\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EIt seems i am the only one so far that has ticked happy!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHappy 1 4%\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-02T20:36:03Z\u0022 title=\u002210/02/2014 08:36  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 2, 2014\u003C/time\u003E by worir4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2014-10-02T20:55:56Z","Content":"\n\u003Cp\u003ENice survey! It\u0027s interesting how many people have never deliberately killed a Kerbal, but the people that \u003Cem\u003Ehave \u003C/em\u003Eusually do it more than once \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-10-02T22:32:54Z","Content":"\n\u003Cp\u003EOh my results for this are going to look terrible... 3 years of playing KSP and having no mishaps at all would be something of a miracle, especially given how many hours I\u0027ve logged. Only rarely do I embrace my inner Danny2462 and purposely torment Kerbals, at least.\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2014-10-02T23:15:03Z","Content":"\n\u003Cp\u003EThis survey made me feel like a horrible person...\u003C/p\u003E\n"},{"CreatedByName":"airelibre","CreatedById":107713,"CreatedDateTime":"2014-10-02T23:19:40Z","Content":"\n\u003Cp\u003ENice survey! Plus I\u0027m number 100 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EMakes me feel better that most people are like me and don\u0027t like screwing up missions or losing Kerbals. I do really enjoy watching people\u0027s failures, intentional nonsense and tormenting of Kerbals on YouTube (in particular Danny!) but I always wondered why I get so pissed off/upset at my own mission failures when these guys thrive off it.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-10-02T23:31:55Z","Content":"\n\u003Cp\u003EHey! This is a great survey! It is always a lot of fun to look back at my history and evaluate my over-cautious behaviour. I play it safe, sometimes so much so it worries me. It\u0027s the very reason why I haven\u0027t been to Duna legitimately! And losing Kerbals? I might as well throw a funeral! I really hate losing my Kerbonauts, especially in my serious-business save. I\u0027m going for a minimal-death kind of play-through, and even when a Kerbal is stranded somewhere I always come back to rescue them.\u003C/p\u003E\u003Cp\u003EAm I healthy?\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-10-02T23:35:58Z","Content":"\n\u003Cp\u003EI left my son in charge of walking/jetpacking Bill a couple of km on Minmus while I went to stir stuff for supper. Somehow he killed him. I had to breathe deeply and remember that getting him in trouble would be stupid. (Despite the fact that \u003Cstrong\u003EI ONLY LEFT FOR A MINUTE AND YOU KILLED BILL\u003C/strong\u003E!!!!!!!) In-out-in-out...\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2014-10-03T00:23:41Z","Content":"\n\u003Cp\u003EI\u0027ve been very careful with the safety my Kerbals during space missions, but I can\u0027t say the same about planes...\u003C/p\u003E\n"},{"CreatedByName":"Duke23","CreatedById":96591,"CreatedDateTime":"2014-10-03T00:58:43Z","Content":"\n\u003Cp\u003EThinking back over a lot of missions to answer those questions. I feel kind of dirty now. Semi-related, I think I\u0027d like to try the no quicksaves and no reverts option in .25. Not saying I\u0027ll stick with it, but I think certain aspects might be fun. As it stands I have developed a bad habit of jamming F9 for the slightest thing, botching an aerobrake maneuver or landing too far from a target... Then again you can generally read \u0022botching an aerobrake maneuver\u0022 as \u0022accidentally deorbiting a ship without landing capabilities\u0022\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-03T01:03:37Z","Content":"\n\u003Cp\u003EThough I try to be safe, this brings to mind a sharp clarity that despite my best intentions... my \u0022safe\u0022 space program is about as safe as walking across a busy freeway... with sunglasses on... at night... while wearing light-absorbant clothing. Then again, I tend to have a lot of structural mishaps, boosters through the wings of my shuttle, randomly exploding engines causing massive changes in center of mass vs. center of lift, shattered solar panels leading to a loss of control of the rover, running over my Kerbals with a jet plane, engine backblast proving to be rather fatal to Kerbals, and an antimatter explosion when I accidentally staged my reactor and generator away due to a mild (okay, just barely short of catastrophic) overheating issue.\u003C/p\u003E\u003Cp\u003EAnd that\u0027s even before we start encountering worlds other than Kerbin... Add the \u0022Permanent Colony\u0022 on Minmus (created from the shattered remains of many ships...) and my Mun Base (where, despite my intents of sending a dozen rovers, not a one runs anymore. Smashed solar panels, wheels broken clean off the frame, one that\u0027s in about 30 pieces in a crater, and several that were tipped...) and we start getting into the meat of the damage.\u003C/p\u003E\u003Cp\u003EThen there\u0027s that Eve-plane I lost due to a violent separation of the left wing from the fuselage. Had plenty of parachutes for a Kerbin landing, but Eve smashed the ejection seat into an ocean at lethal velocity.\u003C/p\u003E\u003Cp\u003EI\u0027ve had Kerbals fall out of command seats, seats break off of probe cores, the Kraken decide to tear a ship apart mid-air and scatter the debris over a 10 km circle, and accidentally hitting EVA instead of IVA... I\u0027ve staged boosters through wings and dropped engines on rovers.\u003C/p\u003E\u003Cp\u003ESo yeah, I\u0027ve made a mess, but I\u0027m proud of it.\u003C/p\u003E\n"},{"CreatedByName":"Malokin","CreatedById":124319,"CreatedDateTime":"2014-10-03T03:38:15Z","Content":"\n\u003Cp\u003EI think it needs an option for \u0022Unbalanced Weight Distribution\u0022. Not necessarily on launch but once in space this can be crippling and it is nigh impossible to make small accurate adjustments to fuel loads on small vessels.\u003C/p\u003E\u003Cp\u003EAlso, am I the only one who has stranded a kerbal outside of a lander that he was unable to climb back into? I\u0027ve learned not to forget about ladders and keep the area around your hatches clear. No idea if it is possible to refill jetpack RCS outside of a lander.\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2014-10-03T04:42:11Z","Content":"\n\u003Cp\u003EI fear that if I took the survey it may skew the results.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-10-03T04:43:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xacktar\u0022 data-cite=\u0022Xacktar\u0022\u003E\u003Cdiv\u003EI fear that if I took the survey it may skew the results.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDidn\u0027t stop me. Go for it!\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2014-10-03T13:03:37Z","Content":"\n\u003Cp\u003EIt seems, I have ticked almost all of the options.........\u003C/p\u003E\n"}]}