{"TopicId":87612,"ForumId":32,"TopicTitle":"Thanks!","CreatedByName":"masterquinn","CreatedById":29638,"CreatedDateTime":"2014-10-17T04:13:53Z","PageNum":1,"Articles":[{"CreatedByName":"masterquinn","CreatedById":29638,"CreatedDateTime":"2014-10-17T04:13:53Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EJust wanted to say a few things... I\u0027ve had this game since 0.17? The first release with space planes.. That was when i found this game and got interested, i spent a good long time getting this rocket to the damn Mun without any mods or anything else. I achieved orbit after some spectacular failures, and many sun orbits until i finally figured out what the hell i was doing wrong. So.. this is great! Now to make it to the Mun.. well since im not a rocket guy and maths are practically a foreign concept now-a-days (getting old and i drink too much, lol), let\u0027s just burn direct for the Mun and hope for the best.. that didnt work.. Lots of rockets leaving the solar system and not really making it anywhere near the Mun.. in fact im pretty sure i ran out of fuel a good dozen times and slammed face first into a crater..\u003C/p\u003E\u003Cp\u003EFINALLY i made it to the Mun, but problem.. i could never land correctly, i land on a slope, a hill, or just end up coasting 5m above the Mun going 100m/s sideways.. fun times, fun times. So i put the game down and focused on other things...\u003C/p\u003E\u003Cp\u003EI recently grabbed it again with the introduction of Career Mode.. FINALLY something to strive for! And i had to relearn everything all over again.. was able to orbit Kerbin, land on the Mun, then i got stuck couldn\u0027t figure out how to get back to Kerbin... read the forums, and found out how to do a (very large) orbit around 3/4 of the solar system to end back in the ocean on Kerbin.. well at least i made it.. that\u0027s something right? So i figured i\u0027d spice things up a bit... found out about MechJeb.\u003C/p\u003E\u003Cp\u003ELet me tell you... i learned more with MechJeb as to what im doing than i did without it. I use it currently, however i use it to find out when to burn for the Mun, how to adjust apoapsis and periapsis, asparagus staging (holy hell this helps so much) and what the hell Dv stood for. After reading alot of the forums it seems the majority of ppl are \u0022 learn the game before automating it \u0022.. well i\u0027m sorry, but i\u0027m one of those people who suck at games like this. MechJeb is my helper - criticize as you see fit.\u003C/p\u003E\u003Cp\u003EThe game as a whole i\u0027m quite proud of how its come along from the 4 building pad (space plane hangar, launchpad, rocket facility and tracking station) to what it is today. Thank you KSP developers, i am addicted again to this mind-numbing game. I\u0027m stating to dream about rockets.. seriously.. and that\u0027s when i know that this game does it for me.\u003C/p\u003E\u003Cp\u003EThank you to everybody who is helping to keep this game going.. i am seriously looking forward to further development and trying out all the crazy mods ive seen. I do have a few quick questions though.. Are there stock parts to building an ISS so i can just launch to other planets from there? How do i refuel in space anyways? And how the hell do i \u0027 collect \u0027 science? Ive been walking around on the Mun and there isnt a whole lot there... maybe Minmus has some? Or do i need more mods?\u003C/p\u003E\u003Cp\u003EThank you for this awesome game and for the community that keeps it exploding on the pad............... thats it.. all i wanted to really say \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E-- Quinn\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-10-17T04:35:50Z","Content":"\n\u003Cp\u003EThis should have gone in the \u0022Welcome Aboard\u0022 section, really.\u003C/p\u003E\u003Cp\u003EBut holy Mos-Esley, is this a big post! Nice to see someone with a good history joining the forums.\u003C/p\u003E\u003Cp\u003EAnd your Mun missions remind me of my own... I could never get enough fuel there to get home, \u003Cem\u003Enever\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EWelcome to the game and the Forum, masterquinn!\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EWhoah, just noticed your questions at the end. (Sorry, I didn\u0027t read it \u003Cem\u003Eall\u003C/em\u003E the way through! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E)\u003C/p\u003E\u003Cp\u003EDocking and refueling, check out the tutorial in my signature.\u003C/p\u003E\u003Cp\u003EScience, you need to be in Career mode. There are something like 10 different experiments: Goo Canister, Materials Bay, Accelerometer, Gravioli Detector, Barometer, Thermometer, Sensor Array Computing Nose Cone, Crew Report, Surface Sample and EVA Report. Except for the last three (two?) you need parts, which would be in the \u0022Science\u0022 tab. Look there.\u003C/p\u003E\u003Cp\u003EThe Crew Report/EVA Reports need Kerbals. Right-click on a capsule and then \u0022Crew Report\u0022 to do one. Right-clicking a Kerbal gives you EVA reports, and if you are landed or splashed down, an option for \u0022Surface Samples\u0022.\u003C/p\u003E\u003Cp\u003EThe other part\u0027s experiments are accessed via right-clicking as well.\u003C/p\u003E\u003Cp\u003EHope this helped!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-17T04:41:41Z\u0022 title=\u002210/17/2014 04:41  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 17, 2014\u003C/time\u003E by Starwhip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-10-17T13:12:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022masterquinn\u0022 data-cite=\u0022masterquinn\u0022\u003E\u003Cdiv\u003EHi,\u003Cp\u003EAre there stock parts to building an ISS so i can just launch to other planets from there? \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are no specific ISS parts but you can build a space station with docking ports and fuel tanks. (The real ISS is in fact not suitable for refueling for interplanetary missions).\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2014-10-17T15:41:09Z","Content":"\n\u003Cp\u003EI like you learned much with mechjeb. Now, all I really need it for is rendezvous and planetary transfer. It\u0027s very useful for long burns - you can go make yourself a coffee or something while it\u0027s running.\u003C/p\u003E\u003Cp\u003EAs to space stations, I make my own with stock parts. You can use Hitchhiker storage things to keep Kerbals in, fuel tanks to keep fuel in and docking ports to allow docked ships to refuel. Maybe a lab, but those are mostly useful for science you don\u0027t plan on bringing home to Kerbin. You can launch that in one piece if you use enough boosters. Anything else is up to you.\u003C/p\u003E\u003Cp\u003EHere\u0027s my Mun station (Sandbox mode) from 0.23.something:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rytfKEn.png\u0022 alt=\u0022rytfKEn.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-17T15:44:15Z\u0022 title=\u002210/17/2014 03:44  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 17, 2014\u003C/time\u003E by moogoob\u003C/strong\u003E\n\u003Cbr\u003EAdding picture\n\u003C/span\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-10-17T15:45:09Z","Content":"\n\u003Cp\u003EThere\u0027s already a \u0022thanks thread\u0022 \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/7284-Thanks-KSP-team-%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/7284-Thanks-KSP-team-%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-10-17T16:00:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022masterquinn\u0022 data-cite=\u0022masterquinn\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELet me tell you... i learned more with MechJeb as to what im doing than i did without it. I use it currently, however i use it to find out when to burn for the Mun, how to adjust apoapsis and periapsis, asparagus staging (holy hell this helps so much) and what the hell Dv stood for. After reading alot of the forums it seems the majority of ppl are \u0022 learn the game before automating it \u0022.. well i\u0027m sorry, but i\u0027m one of those people who suck at games like this. MechJeb is my helper - criticize as you see fit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree. Space travel isn\u0027t as intuitive as people are lead to believe and trial and error, while fun, isn\u0027t an actual avenue to learn orbital mechanics. What is learnt from space travel is actually an accumulation of scientific knowledge over the centuries that we derive from.\u003C/p\u003E\u003Cp\u003EMechjeb is just another way of deriving knowledge and showing the basics to new players.\u003C/p\u003E\n"}]}