{"TopicId":87955,"ForumId":32,"TopicTitle":"Aircraft Suspension","CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-10-20T02:13:08Z","PageNum":1,"Articles":[{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-10-20T02:13:08Z","Content":"\n\u003Cp\u003EI found this out totally by accident, not sure if its a known thing or not; but structural intakes \u002B small gear bay = bouncy aircraft! \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/RvLeFKM\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/RvLeFKMl.jpg\u0022 alt=\u0022RvLeFKMl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d attached a gear bay to an intake under the wing just to lower the wheel a bit, when the craft loaded it bounced in a rather pleasing way. I didn\u0027t expect it to work at all, but surprisingly the wheels are stable, just they can move up and down a bit. I can see that with some aircraft it won\u0027t work well, but for some designs its quite nice to have a bit of padding in the wheels as you land. I\u0027ve not tried putting \u0022suspension\u0022 on the front wheel, I expect that to go badly. Anyway just thought I\u0027d share that.\u003C/p\u003E\n"},{"CreatedByName":"rdwulfe","CreatedById":107690,"CreatedDateTime":"2014-10-20T02:30:39Z","Content":"\n\u003Cp\u003ENoticed this before too! A heavy load squishes them down, might need to add a 2nd set of gear if it\u0027s too bad... But yes, it\u0027s a nice little touch and I\u0027m glad they did it! You really see it when you\u0027re touching down, too.\u003C/p\u003E\n"},{"CreatedByName":"Ignamious","CreatedById":60779,"CreatedDateTime":"2014-10-20T02:31:51Z","Content":"\n\u003Cp\u003EYeah, if i remember that was also an issue with SP\u002B 1.3. strutting it helps... ads some rigidity to it. I use Remote Tech 2 in my game, and my SSTO\u0027s are launch vessels for them (cheap!) i have a 7% CMF rate on it, during LKPD - VII (Low Kerbin Payload Delivery) I think in my latest save i\u0027ve used the my plane 15 times, 6 com sats for the moons of kerbin, 4 in geostationary 2 in polar LKO 2 at Duna (one landed) and then one lost when a fuel tank ruptured in flight (i blame the kraken) during the XST-2 trials, the gear were attached to the intake for the added hight, but found it unstable, with XST-3 the struts helped, but not enough, so XST-4 the plane had a redesign. sadly the suspension is not stiff enough, and when your landing deadstick you kit harder, and can break your engine off (typical landing speed is 140m/s-200m/s with FAR installed. \u003C/p\u003E\u003Cp\u003EBut now that B9 is updated to .25 i can use the larger landing gear, and the LKPD mk3 can be born! (again)\u003C/p\u003E\n"},{"CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2014-10-20T06:17:18Z","Content":"\n\u003Cp\u003EThe same can be achieved for larger craft using structural pillars like i have done on this, need to leave about a meter of clearance and it will increase your landing speeds by more than double, makes for very durable gear. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Voq5oKo5p8g?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2014-10-20T20:07:39Z","Content":"\n\u003Cp\u003EThat suspension is what saves you on hard landings so be great full for it! Also if you don\u0027t like it i think there is an option to disable it.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-10-20T20:16:52Z","Content":"\n\u003Cp\u003ETry wings on structural intakes, stock ornithopter \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}