{"TopicId":88164,"ForumId":32,"TopicTitle":"Opinions on \u0026quot;Kerbal Experience\u0026quot;","CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-10-22T01:17:26Z","PageNum":16,"Articles":[{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-10-22T16:02:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FleetAdmiralJ\u0022 data-cite=\u0022FleetAdmiralJ\u0022\u003E\u003Cdiv\u003EYou don\u0027t need to rewire a ship to do tasks in a certain order to make them more power efficient.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re grasping here. Really.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FleetAdmiralJ\u0022 data-cite=\u0022FleetAdmiralJ\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAgain, you\u0027re assuming Kerbals operate their space program like NASA.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbals operate their space program however \u003Cem\u003EI\u003C/em\u003E operate it. That\u0027s the point, right?\u003C/p\u003E\u003Cp\u003EI\u0027d say that any improvised improvement by my astronauts becomes SOP. How do I do that?\u003C/p\u003E\u003Cp\u003EAbstraction is fine within something that is already abstracted at a similar level. Anything they do to \u0022career\u0022 stuff like rep, science, funds is perfectly fine since those systems are huge abstractions to start. In FLIGHT, a couple m/s can actually distinguish success and failure. Abstracting things in flight need the fidelity of flight even as abstractions, or they break it.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2014-10-22T16:04:07Z","Content":"\n\u003Cp\u003EI\u0027ll just add this. Harvester has always talked about KSP being a game where you run your own space program. A tycoon game. Upgrading your space center has been mention far before 0.25 and destructible buildings. Kerbals earning experience has been a topic since I can remember. I, for one, enjoy this style of game. Improving my amusement park or movie studio. Even finding that one character who achieves greatness. An actor who excels in \u003Cem\u003EThe Movies\u003C/em\u003E or a warrior in \u003Cem\u003EMajesty\u003C/em\u003E. I was looking forward to having these same experiences in KSP. The tech tree was the first let down, contracts the second. Certain Kerbals getting more out of rockets than others, or more science then others, seemed to be the first step towards the management sim / tycoon game I thought KSP had been setup to be. It seems the majority is against me. I only wish there was this much out cry against contracts which do little to teach or encourage smart play. Instead we build rockets that make little sense in order to get to contracts that actually want use to do anything reasonable.\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-10-22T16:04:16Z","Content":"\n\u003Cp\u003EI\u0027m firmly in the \u0022No\u0022 bin... I had a very different thing in mind when XP was first suggested.\u003C/p\u003E\u003Cp\u003EI was thinking that it might be nice to give the Kerbals more \u0022privileges\u0022 as the game progresses, depending on their success in previous missions... for example:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFirst level:\u003C/strong\u003E Kerbals are allowed to sit in the cockpit, but nothing more... for a launch or two.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESecond Level:\u003C/strong\u003E Kerbals can do \u0022tethered\u0022 EVAs, in which they can float about in space, but never more than 25 meters from the spacecraft. (This is mostly so that they can gather planetary science data.) This phase lasts another launch or two.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThird Level:\u003C/strong\u003E Kerbals can do free EVAs, and walk upon planets\u0027 and moons\u0027 surfaces. They should also be able to get more Science than their earlier counterparts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFourth Level:\u003C/strong\u003E In addition to everything else, Kerbals can relocate parts on a spacecraft via EVA, and get even more science!\u003C/p\u003E\u003Cp\u003EYou would go through levels faster by doing more ambitious missions: A Kerbal could even be promoted midflight for a particularly daring mission.\u003C/p\u003E\u003Cp\u003EThis would be relatively nonintrusive, it would conform to the laws of physics and the unofficial rules of real-world space agencies, and it would give you reason to fly Kerbals multiple times. It\u0027s honestly the best thing I can think of, off the top of my head.\u003C/p\u003E\n"},{"CreatedByName":"Yellowburn10","CreatedById":107558,"CreatedDateTime":"2014-10-22T16:07:27Z","Content":"\n\u003Cp\u003EYou know, it\u0027s funny how KSP has so many things that don\u0027t line up with the laws of physics. Planet sizes, ion engines, soupospheres, etc. Heck, you could go faster than the speed of light if you wanted. That\u0027s right, THE SPEED. OF. LIGHT. You don\u0027t hear anyone arguing about that. And yet, when a change is made that makes it so certain kerbals have a tiny, and I mean tiny, change in an engines performance, then everyone looses their minds! Like, seriously! It\u0027s a MINUSCULE perk! I would say it\u0027s even less than 5%. Yet people are acting like one kerbal could add 500 extra deltaV to their craft or something! Really, it is not that significant. Nor should it be significant enough to argue about it.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-10-22T16:08:58Z","Content":"\n\u003Cp\u003EThere has been plenty of talk about contracts and how screwy science is that I have seen. They are all abstractions, and could be abstracted better, clearly, but at least they don\u0027t break flying. This does.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-22T16:10:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yellowburn10\u0022 data-cite=\u0022Yellowburn10\u0022\u003E\u003Cdiv\u003EYou know, it\u0027s funny how KSP has so many things that don\u0027t line up with the laws of physics. Planet sizes, ion engines, soupospheres, etc. Heck, you could go faster than the speed of light if you wanted. That\u0027s right, THE SPEED. OF. LIGHT. You don\u0027t hear anyone arguing about that.\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EWhere have you been that you haven\u0027t heard anyone arguing about those things? \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd yet, when a change is made that makes it so certain kerbals have a tiny, and I mean tiny, change in an engines performance, then everyone looses their minds! Like, seriously! It\u0027s a MINUSCULE perk! I would say it\u0027s even less than 5%. Yet people are acting like one kerbal could add 500 extra deltaV to their craft or something! Really, it is not that significant. Nor should it be significant enough to argue about it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it\u0027s not significant, what is the point of it?\u003C/p\u003E\n"},{"CreatedByName":"Tail_TL","CreatedById":121487,"CreatedDateTime":"2014-10-22T16:10:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UpsilonAerospace\u0022 data-cite=\u0022UpsilonAerospace\u0022\u003E\u003Cdiv\u003EI\u0027m firmly in the \u0022No\u0022 bin... I had a very different thing in mind when XP was first suggested.\u003Cp\u003EI was thinking that it might be nice to give the Kerbals more \u0022privileges\u0022 as the game progresses, depending on their success in previous missions... for example:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFirst level:\u003C/strong\u003E Kerbals are allowed to sit in the cockpit, but nothing more... for a launch or two.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESecond Level:\u003C/strong\u003E Kerbals can do \u0022tethered\u0022 EVAs, in which they can float about in space, but never more than 25 meters from the spacecraft. (This is mostly so that they can gather planetary science data.) This phase lasts another launch or two.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThird Level:\u003C/strong\u003E Kerbals can do free EVAs, and walk upon planets\u0027 and moons\u0027 surfaces. They should also be able to get more Science than their earlier counterparts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFourth Level:\u003C/strong\u003E In addition to everything else, Kerbals can relocate parts on a spacecraft via EVA, and get even more science!\u003C/p\u003E\u003Cp\u003EYou would go through levels faster by doing more ambitious missions: A Kerbal could even be promoted midflight for a particularly daring mission.\u003C/p\u003E\u003Cp\u003EThis would be relatively nonintrusive, it would conform to the laws of physics and the unofficial rules of real-world space agencies, and it would give you reason to fly Kerbals multiple times. It\u0027s honestly the best thing I can think of, off the top of my head.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh why... Why couldn\u0027t the devs think like this and do it... Why?..\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-10-22T16:12:56Z","Content":"\n\u003Cp\u003ESort answer, I don\u0027t like the idea of my craft\u0027s performance being changed by crew experience.\u003C/p\u003E\u003Cp\u003EHowever that leaves very little left for crew experience to effect. Science is the obvious one, reputation and funds are also options.\u003C/p\u003E\u003Cp\u003EI guess you could also require a set level of experience to even conduct some contracts (the level would be a requirement to complete the missions).\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2014-10-22T16:13:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EI will never understand why people use this as an argument.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPatched conics, souposphere, drag model, tiny yet dense planet, etc... There are simplifications and abstractions made to accommodate the fact that this is not a game with a huge budget, being run on supercomputers. Whether those are acceptable abstractions is another discussion entirely, but they do exist, and they do set the tone and feel of the game.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-10-22T16:13:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FleetAdmiralJ\u0022 data-cite=\u0022FleetAdmiralJ\u0022\u003E\u003Cdiv\u003EWait...are aren\u0027t you justifying my \u0022going to extremes\u0022 by turning around and saying that one plays the game with \u0022the normal god mentality\u0022? How is playing god not the same thing as \u0022you fly the ship yourself\u0022?\u003Cp\u003E*snip*\u003C/p\u003E\u003Cp\u003EOr if any and all parts must perform exactly the same in all circumstances regardless of experience? (which again, begs the question of why even bother having experience in the first place then)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe experience system is fine and wanted by most people. there are just better ways to handle kerbal XP buffs instead of changing craft handling/turn rate/fuel efficiency. \u003C/p\u003E\u003Cp\u003Elike: \u003C/p\u003E\u003Cp\u003E*a kerbals flight exp enhancing his ability to conduct experiments/crew reports/repairs in flight. = boost science points. the kerbal will not be able to do his job very well when hes screaming, passing out from g-force or violently ill from microgravity.\u003C/p\u003E\u003Cp\u003E*a kerbals flight exp enhancing a kerbals ability to remain conscious while experiencing high G forces. if the pilot kerbal blacks out - the player effectively blacks out, resulting in a loss of control \u003Cstrong\u003Eif\u003C/strong\u003E there is no backup co-pilot or probe core.\u003C/p\u003E\u003Cp\u003E*a good scientist with little flight experience will make good science gains with his feet planted safely on the ground. likewise for a good engineer with little flight experience. they cannot make a clear transmission if if they are sick or panicking or passed out ect\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#4B0082;\u0022\u003Escience skill\u003C/span\u003E\u003C/strong\u003E = governs science returns.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF8C00;\u0022\u003Eengineering skill\u003C/span\u003E\u003C/strong\u003E = governs repairs, construction, transmission strength. limited orbital construction would need to be added (radial parts only...?). \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003Eflight skill\u003C/span\u003E\u003C/strong\u003E = governs ability to stay conscious while under high G force. google G-Lock. also governs the ability to perform science and engineering tasks while in flight. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Ecommand pod certification:\u003C/strong\u003E a kerbal could require certification in a particular command pod before they can operate it on there own. to get certification they would need to accumulate supervised flight time at the controls of that pod. supervised - meaning another certified kerbal (or orange suit) would have to also be in the craft (with their own set of controls). \u003C/p\u003E\u003Cp\u003EThis would give purpose to training craft and space stations where kerbals can clock up supervised flight hours (in vacuum and atmosphere) so they can perform science and engineering tasks with greater precision. people have also mentioned tethered EVAs for newb kerbals, before progressing on to thrust packs after accumulating enough space flight time.\u003C/p\u003E\u003Cp\u003Ethere are loads of other ways to handle XP out there. XP = better engine performance and turn rate is not the best way to do it...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T16:43:24Z\u0022 title=\u002210/22/2014 04:43  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by Capt Snuggler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Flight","CreatedById":99865,"CreatedDateTime":"2014-10-22T16:13:28Z","Content":"\n\u003Cp\u003EWhat if SAS could only be enabled if the pilot was trained to operate it?\u003C/p\u003E\u003Cp\u003EIt\u0027s kind of realistic. For example, real airliners have auto-landing systems, but even tho you only have to press a few buttons to activate, only trained crew are allowed to use it (because they need to be prepared to identify failures and react accordingly).\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-10-22T16:16:53Z","Content":"\n\u003Cp\u003ESo I posted an idea in suggestions about having contracts use a launch windows type pluggin to present missions when there was a good window to do so.\u003C/p\u003E\u003Cp\u003EWhat if the kerbal skill level could tell you where to place a maneuver node in some fashion?\u003C/p\u003E\u003Cp\u003EFor example: You set a target, say Duna. Based on skill level, a section of the orbit track becomes another color, letting you know where to place the optimum maneuver node? It might even highlight which direction to stretch, go green within some range of ideal, etc.\u003C/p\u003E\u003Cp\u003EThe game would then start with at least one of the default astronauts having some high skill (for noobs to use to learn).\u003C/p\u003E\n"},{"CreatedByName":"Yellowburn10","CreatedById":107558,"CreatedDateTime":"2014-10-22T16:17:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EWhere have you been that you haven\u0027t heard anyone arguing about those things? \u003Cp\u003EIf it\u0027s not significant, what is the point of it?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPart 1: I was mainly referring to the speed of light thing. I\u0027ve seen plenty of arguing about the others.\u003C/p\u003E\u003Cp\u003EPart 2: Ok, perhaps I was wrong in saying it\u0027s not significant. I was trying to say it\u0027s not as significant as people are making it out to be. Tiny engine perks will only help you in the long run, if anything. Anything below that will make it barely noticeable\u003C/p\u003E\u003Cp\u003EOne more thing, squad has gone and said specifically that KSP is a game before a simulator.\u003C/p\u003E\n"},{"CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2014-10-22T16:19:59Z","Content":"\n\u003Cp\u003ELooking forward to whoever fills enough crewtanks with thrust booster kerbals to VTOL with ion engines on Kerbin.\u003C/p\u003E\u003Cp\u003EAside from that no, awful idea.\u003C/p\u003E\u003Cp\u003EIf you\u0027re looking for Kerbal skills why not apply them to science output, like a geology specialist to boost sample retrieval gains, lab specialist to boost transmitted gains when a lab is available, or flight specialist for orbital reports.\u003C/p\u003E\u003Cp\u003ESaying that though, I haven\u0027t really found the science system fun at all. It\u0027d be neat if it felt like a logical progression, but it doesn\u0027t. So I\u0027d want to play contracts with cash and everything already unlocked, but I can\u0027t. And even if I pile on starting science, I still can\u0027t buy everything, so I have to mess up my starting budget.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-22T16:22:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yellowburn10\u0022 data-cite=\u0022Yellowburn10\u0022\u003E\u003Cdiv\u003EPart 1: I was mainly referring to the speed of light thing. I\u0027ve seen plenty of arguing about the others.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe speed of light doesn\u0027t really matter because it\u0027s awfully close to impossible to approach without cheating. I.e. infinite fuel or hacked parts.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EPart 2: Ok, perhaps I was wrong in saying it\u0027s not significant. I was trying to say it\u0027s not as significant as people are making it out to be. Tiny engine perks will only help you in the long run, if anything. Anything below that will make it barely noticeable\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDefine \u0022help you.\u0022 \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOne more thing, squad has gone and said specifically that KSP is a game before a simulator.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*sigh* As if those are opposites or something. KSP is a simulator game.\u003C/p\u003E\n"},{"CreatedByName":"ThirdHorseman","CreatedById":77825,"CreatedDateTime":"2014-10-22T16:28:24Z","Content":"\n\u003Cp\u003EI would be able to accept Kerbal experience altering physics for just a few situations:\u003C/p\u003E\u003Cp\u003E1) Kerbals with high XP don\u0027t spawn hundreds of meters away when they exit command chairs\u003C/p\u003E\u003Cp\u003E2) Kerbals with high XP, when piloting a craft, can prevent Null Reference Exception errors from suddenly slowing the game to a crawl\u003C/p\u003E\u003Cp\u003E3) A heavy craft, when piloted by a high XP Kerbal, will not cause the launch pad to collapse\u003C/p\u003E\u003Cp\u003E4) High XP Kerbals have access to a clean UI that allows them to easily filter and sort when they are piloting a capsule with 60-70 stored science reports\u003C/p\u003E\u003Cp\u003E5) High XP Kerbals have access to IVA views when in the MK2 Crew Cabin and the MK1 Inline Cockpit\u003C/p\u003E\u003Cp\u003E6) Kerbals with high XP can recover their spent stages for a subsequent return of a percentage of funds\u003C/p\u003E\u003Cp\u003EOr, just fix all that crap and drop the idea of Kerbals with high experience altering vessel performance...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T16:40:10Z\u0022 title=\u002210/22/2014 04:40  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by ThirdHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-10-22T16:28:36Z","Content":"\n\u003Cp\u003EI\u0027m just going to wait and see how it turns out, and like with science, contracts and strategies there will be time to return to experience and balance it later during this phase of KSP\u0027s development \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, Don\u0027t forget you can post feedback and feature requests to the public tracker.\u003C/p\u003E\n"},{"CreatedByName":"radonek","CreatedById":84077,"CreatedDateTime":"2014-10-22T16:32:12Z","Content":"\n\u003Cp\u003EYou people are making too much fuss for nothing. Squad have basic framework for this XP thing, need something to make it work on, and adding a bit to existing mechanism is easy first pick. Yes, altering physics is a bad idea. So what? As long as its moddable, anyone can prove to do better. And squad guys can then take best ideas back to vanilla, as they already did several times. I\u0027d say its actually smart to get this thing out of the door and to the modders hands ASAP and not waste time with \u0022deep\u0022 changes.\u003C/p\u003E\n"},{"CreatedByName":"Michaelo90","CreatedById":98783,"CreatedDateTime":"2014-10-22T16:35:06Z","Content":"\n\u003Cp\u003EScience boost is ok, but changing ship performance based on who the pilot is is just stupid. I\u0027d rather see a system like a secondary tech tree where you pay funds and science to upgrade the parts.\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-10-22T16:36:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022radonek\u0022 data-cite=\u0022radonek\u0022\u003E\u003Cdiv\u003EYou people are making too much fuss for nothing. Squad have basic framework for this XP thing, need something to make it work on, and adding a bit to existing mechanism is easy first pick. Yes, altering physics is a bad idea. So what? As long as its moddable, anyone can prove to do better. And squad guys can then take best ideas back to vanilla, as they already did several times. I\u0027d say its actually smart to get this thing out of the door and to the modders hands ASAP and not waste time with \u0022deep\u0022 changes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think you understand how product development works.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-10-22T16:39:43Z","Content":"\n\u003Cp\u003EGuys, remember that the more insignificant you make the change just to justify adding the feature as badly thought as it already is, the more useless the feature turns out to be, and will end up taking space in dev time for, as you said, an insignificant change.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EI\u0027m just going to wait and see how it turns out, and like with science, contracts and strategies there will be time to return to experience and balance it later during this phase of KSP\u0027s development\u003Cp\u003EAlso, Don\u0027t forget you can post feedback and feature requests to the public tracker. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI live with the constant fear of devs not caring much about what is being talked about in the forums because they give too much importance to that bug tracker, which most people don\u0027t know about. I myself visited it a few times, but I don\u0027t want to use it, feels awkward and overwhelming.\u003C/p\u003E\n"},{"CreatedByName":"JedTech","CreatedById":104003,"CreatedDateTime":"2014-10-22T16:42:11Z","Content":"\n\u003Cp\u003EI think Squad should brainstorm and find something besides physics that they can alter in order to give the player benefits from having happy/experienced kerbals.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EOk, I\u0027ll brain storm for them:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EExperienced Kerbals require less life support and electricity.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETheir happiness meter could stay higher for longer missions.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EExperienced Kerbals can \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Erun faster\u003C/span\u003E\u003C/strong\u003E during EVA.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EExperienced Kerbals get higher science returns due to their scientific skills.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2014-10-22T16:44:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt Snuggler\u0022 data-cite=\u0022Capt Snuggler\u0022\u003E\u003Cdiv\u003EThe experience system is fine and wanted by most people. there are just better ways to handle kerbal XP buffs instead of changing craft handling/turn rate/fuel efficiency. \u003Cp\u003Elike: \u003C/p\u003E\u003Cp\u003E*a kerbals flight exp enhancing his ability to conduct experiments/crew reports/repairs in flight. = boost science points. the kerbal will not be able to do his job very well when hes screaming, passing out from g-force or violently ill from microgravity.\u003C/p\u003E\u003Cp\u003E*a kerbals flight exp enhancing a kerbals ability to remain conscious while experiencing high G forces. if the pilot kerbal blacks out - the player effectively blacks out, resulting in a loss of control \u003Cstrong\u003Eif\u003C/strong\u003E there is no backup co-pilot or probe core.\u003C/p\u003E\u003Cp\u003E*a good scientist with little flight experience will make good science gains with his feet planted safely on the ground. likewise for a good engineer with little flight experience. they cannot make a clear transmission if if they are sick or violently ill ect\u003C/p\u003E\u003Cp\u003Ein short.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#4B0082;\u0022\u003Egreater science skill\u003C/span\u003E = better science returns.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF8C00;\u0022\u003Egreater engineering skill\u003C/span\u003E = better repairs, construction, transmission strength.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003Egreater flight skill\u003C/span\u003E = better ability to stay conscious in high G force. better ability to perform science and engineering tasks while in flight.\u003C/p\u003E\u003Cp\u003Ea kerbal could require certification in a particular command pod before they can operate it on there own. to get certification they would need to accumulate supervised flight time at the controls of that pod. supervised - meaning another certified kerbal (or orange suit) would have to also be in the craft (with a set of controls)\u003C/p\u003E\u003Cp\u003EThis would give purpose to training craft and space stations where kerbals can clock up flight hours (in vacuum and atmosphere) so they can perform science and engineering tasks with greater precision.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see this idea mentioned again and again, and I like it way more than what Squad intends to implement. If I may add:\u003C/p\u003E\u003Cp\u003E - skill system should be completely exposed to mods. So, base-building/CLSS mods could add \u0022agriculture\u0022 skill, random failure/repair mods could add \u0022mechanic\u0022, KAS could add \u0022crane operator\u0022 just for lulz, and so on. It should be a framework for mods to add onto it.\u003C/p\u003E\u003Cp\u003E - seats in pods could have designated roles and requirements for kerbals. Say, standard 3-seat pod would have a pilot seat, co-pilot/engineer seat and mission specialist/scientist seat. And to use it, for example you\u0027d _have_ to have a kerbal with \u0022pilot\u0022 skill of 3 or more in one of pilot seats. Or to operate mobile lab, you\u0027d have to have 2 kerbals with combined \u0022science\u0022 skill \u0026gt;= 5.\u003C/p\u003E\u003Cp\u003EKerbal Experience can be a great addition to the game. It\u0027s sad that the best examples developers can come up with include magic boost for engines.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-10-22T16:44:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wiseman\u0022 data-cite=\u0022Wiseman\u0022\u003E\u003Cdiv\u003EPatched conics, souposphere, drag model, tiny yet dense planet, etc... There are simplifications and abstractions made to accommodate the fact that this is not a game with a huge budget, being run on supercomputers. Whether those are acceptable abstractions is another discussion entirely, but they do exist, and they do set the tone and feel of the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t get it. People use this kind of statement to argue for more of the same, when the opposite should be the case, i.e. KSP is already too gamey so let\u0027s make it more realistic.\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-10-22T16:46:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tail_TL\u0022 data-cite=\u0022Tail_TL\u0022\u003E\u003Cdiv\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E \u003Cstrong\u003E(Me: )\u003C/strong\u003E I\u0027m firmly in the \u0022No\u0022 bin... I had a very different thing in mind when XP was first suggested.\u003Cp\u003EI was thinking that it might be nice to give the Kerbals more \u0022privileges\u0022 as the game progresses, depending on their success in previous missions... for example:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFirst level:\u003C/strong\u003E Kerbals are allowed to sit in the cockpit, but nothing more... for a launch or two.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESecond Level:\u003C/strong\u003E Kerbals can do \u0022tethered\u0022 EVAs, in which they can float about in space, but never more than 25 meters from the spacecraft. (This is mostly so that they can gather planetary science data.) This phase lasts another launch or two.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThird Level:\u003C/strong\u003E Kerbals can do free EVAs, and walk upon planets\u0027 and moons\u0027 surfaces. They should also be able to get more Science than their earlier counterparts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFourth Level:\u003C/strong\u003E In addition to everything else, Kerbals can relocate parts on a spacecraft via EVA, and get even more science!\u003C/p\u003E\u003Cp\u003EYou would go through levels faster by doing more ambitious missions: A Kerbal could even be promoted midflight for a particularly daring mission.\u003C/p\u003E\u003Cp\u003EThis would be relatively nonintrusive, it would conform to the laws of physics and the unofficial rules of real-world space agencies, and it would give you reason to fly Kerbals multiple times. It\u0027s honestly the best thing I can think of, off the top of my head.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh why... Why couldn\u0027t the devs think like this and do it... Why?..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know whether they\u0027re trying to be overly ambitious, or whether they want it to play like a Tycoon-style game, or whether they simply haven\u0027t thought of this. I hope that a system like this one is implemented at some point or another, probably by some wonderful modder but maybe, maybe in the stock game. I\u0027d put the odds at less than a tenth of 1% though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T16:48:48Z\u0022 title=\u002210/22/2014 04:48  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by UpsilonAerospace\u003C/strong\u003E\n\u003C/span\u003E\n"}]}