{"TopicId":89233,"ForumId":32,"TopicTitle":"Rover for Children\u0027s Museum","CreatedByName":"dlb","CreatedById":128072,"CreatedDateTime":"2014-11-02T18:56:43Z","PageNum":1,"Articles":[{"CreatedByName":"dlb","CreatedById":128072,"CreatedDateTime":"2014-11-02T18:56:43Z","Content":"\n\u003Cp\u003Ei am a complete novice to KSP, but not to programming. our children\u0027s museum wants a Mun landing or a Rover, very simple, for children to enjoy with a joystick. easily resettable, etc. can anyone offer ideas or solutions for this task?\u003C/p\u003E\u003Cp\u003Eplatform is not an issue; seems that Linux would be best. the issue is the actual scenario, limited in scope, easily started over.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-11-02T19:15:31Z","Content":"\n\u003Cp\u003EWith a joystick, eh?\u003C/p\u003E\u003Cp\u003EI can\u0027t help you there, I know nothing of joysticks and KSP.\u003C/p\u003E\u003Cp\u003EBut for the scenario, perhaps some landed ships to drive around? (or at! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E)\u003C/p\u003E\u003Cp\u003EEDIT: If you don\u0027t need to do anything special to setup for joystick (Like settings that you would need enabled during construction) I could set up and post a persist/quicksave with a rover to play with early tomorrow.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-11-02T19:17:06Z","Content":"\n\u003Cp\u003EHello, it\u0027s going to be awesome to have such thing.\u003C/p\u003E\u003Cp\u003EI can see this being achieved by using scenarios, those are like preset situations you start from.\u003C/p\u003E\u003Cp\u003ELike load straight into two ships close to each other for docking or the MÃƒÂ¼n landing you desire.\u003C/p\u003E\u003Cp\u003EIt\u0027s also easily resettable.\u003C/p\u003E\u003Cp\u003EIt will be a bit tricky to make one craft to be easily pilotable with a joystick, I will try to make one scenario for you.\u003C/p\u003E\u003Cp\u003EBut before anything, make sure to contact SQUAD about this, since you need a special licence in order to publicly display the game.\u003C/p\u003E\u003Cp\u003ESo before you make it public, you have to to contact \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/94305-Rowsdower\u0022 rel=\u0022external nofollow\u0022\u003ERowsdower\u003C/a\u003E about this for an agreement.\u003C/p\u003E\u003Cp\u003EWill post again if I get anything proper \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TJPrime","CreatedById":101641,"CreatedDateTime":"2014-11-02T19:26:45Z","Content":"\n\u003Cp\u003EI\u0027m actually working on some scenario packs - I\u0027ll be happy to make a small munar base for the kids. I take that it needs to be all stock and no mods?\u003C/p\u003E\n"}]}