{"TopicId":89340,"ForumId":32,"TopicTitle":"Landing multiple landers at the same time","CreatedByName":"Marclev","CreatedById":108506,"CreatedDateTime":"2014-11-03T23:03:57Z","PageNum":1,"Articles":[{"CreatedByName":"Marclev","CreatedById":108506,"CreatedDateTime":"2014-11-03T23:03:57Z","Content":"\n\u003Cp\u003EUnfortunately I didn\u0027t get a screenshot, but was impressed enough at this actually working that I thought I\u0027d post about it.\u003C/p\u003E\u003Cp\u003ECame back to Kerbin from a trip to Jool with a lander attached to a science lab attached to a nuclear rocket (all detachable). Both the lander and the science lab had independent parachutes and landing legs, as the intent was always to break them up in LKO and then land them separately.\u003C/p\u003E\u003Cp\u003ESo, long story short, I got overconfident with the aerobrake and down everything went towards the surface. With no other option, I decoupled everything from each other, activated the parachutes and legs on the lander, and then flipped to the science lab and activated the parachutes and legs on that.\u003C/p\u003E\u003Cp\u003EI was amazed to watch as they both deployed their parachutes and proceeded to gently fall to the surface in relative unison, quite close by to each other. Both made a safe landing and I was able to recover both.\u003C/p\u003E\u003Cp\u003ESo now I\u0027m wondering how many things you could safely land like this at the same time, if you actually designed a ship around it. Has anybody tried this?\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-11-03T23:09:10Z","Content":"\n\u003Cp\u003EYou could probably land a bunch of vessels like this, so long as they didn\u0027t drift too far apart. On Kerbin, any vessels in flight are removed from the game (just destroyed, deleted) if they are more than 2.5 km from the active vessel, so you just have to keep them close. The best way to do this I\u0027ve seen is to break up the ship as close to the surface as possible.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-11-03T23:22:09Z","Content":"\n\u003Cp\u003EYep, did this on Duna. You can have chutes and decouplers on the same stage so that when you decouple something, the chutes for it deploy at the same time.\u003C/p\u003E\u003Cp\u003EI had 3 large tanks that were going to be used to store fuel, a Kethane mining rover, and a return ship all together stacked one on top of another. Brought them all into the atmosphere together, and then dropped them one by one with each stage decoupling and setting off the chutes at the same time. They all landed nicely in a row. When I was done I ended up with a nice refueling point on Duna with lots of fuel ready to fill up visiting ships while I built a base. I also dropped the parts of the base multiple pieces at a time after proving that it worked.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EYou could probably land a bunch of vessels like this, so long as they didn\u0027t drift too far apart. On Kerbin, any vessels in flight are removed from the game (just destroyed, deleted) if they are more than 2.5 km from the active vessel, so you just have to keep them close. The best way to do this I\u0027ve seen is to break up the ship as close to the surface as possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is easily solved by making sure there\u0027s a probe module on each piece. Then the game won\u0027t remove it because it\u0027s considered a ship. That\u0027s what I do.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2014-11-03T23:31:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xtoro\u0022 data-cite=\u0022xtoro\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis is easily solved by making sure there\u0027s a probe module on each piece. Then the game won\u0027t remove it because it\u0027s considered a ship. That\u0027s what I do.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat he\u0027s referring to is the way that the game auto-deletes /anything/, ship or not, that\u0027s flying in Kerbin\u0027s atmosphere below an altitude of about 21 km, that is more than 2.5 km from your active craft. The similar kill line for Duna is about 8km altitude; I don\u0027t recall what it is for Eve or Laythe.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-11-03T23:35:20Z","Content":"\n\u003Cp\u003EAs long as they don\u0027t get more then 2.5K away;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RYSpnBq.jpg\u0022 alt=\u0022RYSpnBq.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JayKay","CreatedById":90560,"CreatedDateTime":"2014-11-03T23:49:09Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NIqBWZB.png\u0022 alt=\u0022NIqBWZB.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI put down a hab lander alongside the main ship that way. I set up the chutes to deploy one after the other and separated the docking ports early. They stayed together until the main ship\u0027s chutes deployed, then the hab module dropped a short ways until its chute also opened all the way, then they drifted down within metres of each other until touching down.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2014-11-04T04:11:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maltesh\u0022 data-cite=\u0022maltesh\u0022\u003E\u003Cdiv\u003EWhat he\u0027s referring to is the way that the game auto-deletes /anything/, ship or not, that\u0027s flying in Kerbin\u0027s atmosphere below an altitude of about 21 km, that is more than 2.5 km from your active craft. The similar kill line for Duna is about 8km altitude; I don\u0027t recall what it is for Eve or Laythe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh. Well I\u0027ve never tried them far apart, they\u0027re always together\u003C/p\u003E\n"},{"CreatedByName":"Wooks","CreatedById":101499,"CreatedDateTime":"2014-11-04T05:02:36Z","Content":"\n\u003Cp\u003EThis is a really old video of mine, a round trip to get science from Duna and Ike with 6 probes and a lander, I wanted to return to Kerbin in style so I set up everything to decouple and land separately. Relevant part to the discussion starts in 8:00, no need to watch whole.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/LbB81-fcCLw?start=480\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-04T15:18:46Z\u0022 title=\u002211/04/2014 03:18  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 4, 2014\u003C/time\u003E by Wooks\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2014-11-04T06:43:16Z","Content":"\n\u003Cp\u003EBut, yeah. IT is fun to watch multiple ships do that at once. Had 8 Kerbals that I put in to their craft while doing a short sub-orbital hop from Kerbin long time ago. Was neat wating all 8 drop ships land so close to each other they where like a string of pearls.\u003C/p\u003E\n"},{"CreatedByName":"Kerano","CreatedById":107460,"CreatedDateTime":"2014-11-04T07:04:35Z","Content":"\n\u003Cp\u003EMy current go-to launcher for a ~350 tonne payload to LKO is designed to have four separate engine sections splash down together a few hundred km from KSC. As long as they stay within the ~2.5 km physics range the parachutes always open together and the engines always survive.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/87213001/KSP/Random/screenshot819.jpg\u0022 alt=\u0022screenshot819.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne odd thing I notice from time to time though is that if one section is separated by more than ~200-300 metres from the one in current view, the post-splashdown animation (falling gently into the water, parachute disappearing) does not occur - instead the craft freezes upright with its parachute still deployed until I switch to it with the [ or ] keys. Apparently the range when applying water physics for splashed-down spacecraft is only a few hundred metres?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-04T07:11:06Z\u0022 title=\u002211/04/2014 07:11  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 4, 2014\u003C/time\u003E by Kerano\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-11-04T08:19:16Z","Content":"\n\u003Cp\u003EMechjeb will run on ships less than 2.3 km away, if its set to land anywhere at an set speed this should work well if you do final braking burn while using parachutes. \u003C/p\u003E\u003Cp\u003ENot done landing this way but have docked two ships while controlling another\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-11-04T09:00:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Marclev\u0022 data-cite=\u0022Marclev\u0022\u003E\u003Cdiv\u003EUnfortunately I didn\u0027t get a screenshot, but was impressed enough at this actually working that I thought I\u0027d post about it.\u003Cp\u003ECame back to Kerbin from a trip to Jool with a lander attached to a science lab attached to a nuclear rocket (all detachable). Both the lander and the science lab had independent parachutes and landing legs, as the intent was always to break them up in LKO and then land them separately.\u003C/p\u003E\u003Cp\u003ESo, long story short, I got overconfident with the aerobrake and down everything went towards the surface. With no other option, I decoupled everything from each other, activated the parachutes and legs on the lander, and then flipped to the science lab and activated the parachutes and legs on that.\u003C/p\u003E\u003Cp\u003EI was amazed to watch as they both deployed their parachutes and proceeded to gently fall to the surface in relative unison, quite close by to each other. Both made a safe landing and I was able to recover both.\u003C/p\u003E\u003Cp\u003ESo now I\u0027m wondering how many things you could safely land like this at the same time, if you actually designed a ship around it. Has anybody tried this?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt takes delicate timing; I had a comparable situation where I needed to get half a dozen Kerbals out of a crippled spaceplane to descend on EVA parachutes. Arranging things so that I could get all six onto their \u0027chutes and to the ground without anyone leaving physics range was quite tricky, particularly as the plane only had two hatches and no ladders.\u003C/p\u003E\u003Cp\u003EFrom memory, I ended up throwing the plane into a vertical climb until it stopped dead, then frantically right-clicked all over the place.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-04T13:47:54Z","Content":"\n\u003Cp\u003EDasValdez was doing something like this on his stream last night, breaking his rocket into three parts for recovery.\u003C/p\u003E\u003Cp\u003EIf you do the breakup 2 km from the surface you will definitely be fine, just watch that your bits don\u0027t fall on top of each other. 2 km is also a sensible altitude to pre-deploy chutes, at least on Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-11-04T14:28:27Z","Content":"\n\u003Cp\u003EYeah did this quite a lot when delivering multiple small things to Laythe, (rovers, supply drop pods etc)\u003C/p\u003E\u003Cp\u003EI do it by having the stuff arranged radially on the bottom section of the section I deorbit. On the top of that section are some drogue chutes, once those have deployed and decent is relatively slow and 100% vertical I blow the decouplers holding the \u0022lander bits\u0022 and deploy their (non-drogue) chutes at the same time. Landers will then fall away from motherdropship straight down, staying within 2.5km of each other.\u003C/p\u003E\u003Cp\u003EThings to remember with this approach:\u003C/p\u003E\u003Cp\u003E- Don\u0027t put a control module on the motherdropship . . . if you do you might find yourself staying with it as all your landers drop away to 2.5km oblivion. This can happen even if you change \u0022control from here\u0022 point. Sometimes its seems the game doesn\u0027t get the message, best just to eliminate the option. \u003C/p\u003E\u003Cp\u003E- Deploy landing legs of all the landers before decoupling them. . . . Unless you really WANT to rush around switching craft in a panic to deploy all the legs before they hit the ground . . .\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-11-05T18:52:09Z","Content":"\n\u003Cp\u003EMy first Duna lander did something like this. It dropped 6 rovers, a return module that had empty tanks and a kethane miner. Worked quite well except the rovers did not quite have enough chute and so burst some tyres on landing.\u003C/p\u003E\n"}]}