{"TopicId":89428,"ForumId":32,"TopicTitle":"How do you make your career game more fun?","CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-11-04T20:39:28Z","PageNum":1,"Articles":[{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-11-04T20:39:28Z","Content":"\n\u003Cp\u003EJust a general thread where you can post about your career game and how you make it more fun.\u003C/p\u003E\u003Cp\u003EI just started a DRE, FAR, Remotetech, Fineprint, Mission Control Extended game with Sci, Funds, and Rep set to 30% each and no revert, no quickloading, missing crews stay dead, no auto hire of crew, entry purchase required, destructible buildings and no stock vessels. 25K funds, no sci, no rep to start.\u003C/p\u003E\u003Cp\u003EI\u0060ve called it Ironman RT and it is loads of fun!\u003C/p\u003E\u003Cp\u003EI got to a point near the start where I spent 35K on boosting my science with funds and my remaining funds on a Mun rocket (about 25K) and it HAD to get there or I would be left with about 1.2K funds. If it got there the boost to science would be amazing. If it failed then the future of the entire program was in doubt.\u003C/p\u003E\u003Cp\u003EI messed up the launch by launching too shallow and it just fell into the ocean.\u003C/p\u003E\u003Cp\u003EI had to do a couple of \u0060test basic jet engine landed at kerbin\u0060 and \u0060test launch stability landed at kerbin\u0060 type contracts to free up some contract spaces so I could get the advance from some new contracts to be able to build rockets to fulfill the old contracts and try to bootstrap my way out of poverty.\u003C/p\u003E\u003Cp\u003EThis is all while trying to get a working coms network going to be able to launch unmanned probes. It was a lot of fun.\u003C/p\u003E\u003Cp\u003EI like it when launches matter.\u003C/p\u003E\u003Cp\u003EWhat do you do to make your career game more fun?\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-11-04T21:15:07Z","Content":"\n\u003Cp\u003EOn hard mode to force my program to purchase research for selective parts while using Nova Punch and KW Rocketry mods. Even though I could go do all four base contracts after getting some science from EVAs on the pad, I deliberately start the space program in little steps. Those little steps results in lots of revenue and science generating contracts in which two simple low cost SRB designs can fulfill those contracts. It\u0027s similar to how a real space program would have started.\u003C/p\u003E\u003Cp\u003E1. Launch and reach 5,000 meters. Use an SRB with 40% fuel tweaked to 40% power, land in the water.\u003C/p\u003E\u003Cp\u003E2. Launch and reach 11,000 meters with more fuel in the SRB.\u003C/p\u003E\u003Cp\u003E3. Launch and reach 22,000 meters using even more fuel in the SRB\u003C/p\u003E\u003Cp\u003E4. Launch and reach 33,000 meters using the SRB with 100% fuel.\u003C/p\u003E\u003Cp\u003E5. Do the 55,000 meter and sub orbital with a two stage SRB with Goo canisters for science.\u003C/p\u003E\u003Cp\u003E6. Go for orbit with combo SRB and liquid engines with Goo canisters.\u003C/p\u003E\u003Cp\u003E7. Do manned flyby of Mun, Minmus once the contracts appear.\u003C/p\u003E\u003Cp\u003E8. Do actual probe landings once the tech is unlocked for Ox Stats and the Too Hot Thermometer. Place the lander back in orbit for additional free money data from orbit contracts.\u003C/p\u003E\u003Cp\u003E9. Conduct manned landings to plant flag and return samples.\u003C/p\u003E\u003Cp\u003E10. Use test while escaping missions to place probes orbiting the sun to find a direct launch window for future explore Duna, Eve, etc... contracts.\u003C/p\u003E\u003Cp\u003E11. Prepare interplanetary unmanned missions for Eve and Duna along with manned ones. Launch them one right after another to send the exploration fleet to the target planet and moons.\u003C/p\u003E\u003Cp\u003E12. Do plenty of combined testing contracts to accumulate enough funds to launch the fleet missions once the launch window is available.\u003C/p\u003E\u003Cp\u003E13. Do it all with small low cost efficient designs.\u003C/p\u003E\u003Cp\u003E14. Keep a record of the results.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-11-04T21:17:36Z","Content":"\n\u003Cp\u003EOn hard mode to force my program to purchase research for selective parts while using Nova Punch and KW Rocketry mods. Even though I could go do all four base contracts after getting some science from EVAs on the pad, I deliberately start the space program in little steps. Those little steps results in lots of revenue and science generating contracts in which two simple low cost SRB designs can fulfill those contracts. It\u0027s similar to how a real space program would have started.\u003C/p\u003E\u003Cp\u003E1. Launch and reach 5,000 meters. Use an SRB with 40% fuel tweaked to 40% power, land in the water.\u003C/p\u003E\u003Cp\u003E2. Launch and reach 11,000 meters with more fuel in the SRB.\u003C/p\u003E\u003Cp\u003E3. Launch and reach 22,000 meters using even more fuel in the SRB\u003C/p\u003E\u003Cp\u003E4. Launch and reach 33,000 meters using the SRB with 100% fuel.\u003C/p\u003E\u003Cp\u003E5. Do the 55,000 meter and sub orbital with a two stage SRB with Goo canisters for science.\u003C/p\u003E\u003Cp\u003E6. Go for orbit with combo SRB and liquid engines with Goo canisters.\u003C/p\u003E\u003Cp\u003E7. Do manned flyby of Mun, Minmus once the contracts appear.\u003C/p\u003E\u003Cp\u003E8. Do actual probe landings once the tech is unlocked for Ox Stats and the Too Hot Thermometer. Place the lander back in orbit for additional free money data from orbit contracts.\u003C/p\u003E\u003Cp\u003E9. Conduct manned landings to plant flag and return samples.\u003C/p\u003E\u003Cp\u003E10. Use test while escaping missions to place probes orbiting the sun to find a direct launch window for future explore Duna, Eve, etc... contracts.\u003C/p\u003E\u003Cp\u003E11. Prepare interplanetary unmanned missions for Eve and Duna along with manned ones. Launch them one right after another to send the exploration fleet to the target planet and moons.\u003C/p\u003E\u003Cp\u003E12. Do plenty of combined testing contracts to accumulate enough funds to launch the fleet missions once the launch window is available.\u003C/p\u003E\u003Cp\u003E13. Do it all with small low cost efficient designs.\u003C/p\u003E\u003Cp\u003E14. Keep a record of the results.\u003C/p\u003E\u003Cp\u003EUntil the EVA bug is fixed, I am avoiding EVA which is really restricting Jeb\u0027s ability to unlock a lot of science early on in the program.\u003C/p\u003E\u003Cp\u003EForum glitch double posted during an edit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-04T21:19:56Z\u0022 title=\u002211/04/2014 09:19  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 4, 2014\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-11-04T21:18:42Z","Content":"\n\u003Cp\u003EI use the difficulty increasing mods and settings similar to those you listed above, with Kerbal construction time and TAC-LS, plus a few other changes. \u003C/p\u003E\u003Cp\u003EI require space in a hitchhike for every kerbal on a station or interplanetary mission for living space. I also drop the Science from the Mun and Minmus to 1x for orbit and 2x for surface. I also increase the shockwave multiplier on DRE to around 1.06. \u003C/p\u003E\u003Cp\u003EI also see how small and low tech I can make my missions to save cash.\u003C/p\u003E\u003Cp\u003EI like a good challenge in KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Plusk","CreatedById":103195,"CreatedDateTime":"2014-11-04T23:24:35Z","Content":"\n\u003Cp\u003EWith lots and lots of mods. The more difficult it is, the better. And i follow somewhat realistic aproach to space exploration.\u003C/p\u003E\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2014-11-05T14:55:05Z","Content":"\n\u003Cp\u003EHard mode (although I quick loaded after some strange bugs with the maneuver nodes and an unintentional exploid with strategies). I use FAR, DRE, remote tech, TAC ls, b9 and the highest settimgs with astronomers pack (visual stuff, a working 64x version on windows is rare, but awesome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E). I also have some roleplay restrictions.\u003C/p\u003E\u003Cp\u003EGetting started was tough and I was rly in trouble when my 100k funds payload for my munar station sunk in the ocean... I was planing my entire progress toward a reusable infrastructure around the mun. It got delayed... (but is finally established now)\u003C/p\u003E\u003Cp\u003EI don\u0027t have to grind for more funds anymore as I am able to ship half an orange tank\u002Bconsumables to the mun for roughly 50k funds. My next goal is to get enough science to get my shuttle program going. \u003C/p\u003E\u003Cp\u003ESo far I burned Jeb during a messed up reentry and killed Bill during a mun landing (I was distracted by an easter egg that I unintentionally discovered during the final decent \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2014-11-05T16:47:22Z","Content":"\n\u003Cp\u003EKerbal Construction Time really makes Career mode more fun for me. Having research and building happen in the background whilst I\u0027m flying missions makes my space program feel much more cohesive, and it gets around the mid-game dip between unlocking most of the science tree and waiting for the first interplanetary transfer windows to open. After that, I add a few roleplaying restrictions - like providing living space on anything longer than a Mun flight, putting comsats up, and returning to Kerbin in capsules. I should probably try out DRE and RemoteTech at some point. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHard mode is a step too far at the moment though. I see the attraction, but with limited play time, its a bit too unforgiving.\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2014-11-05T17:53:31Z","Content":"\n\u003Cp\u003EI recently took the big step of moving to Hard Mode (pure stock) and I was a bit nervous, but honestly it hasn\u0027t been bad. I\u0027ve achieved every scripted contract (except \u0022plant flag on xxx\u0022) and I haven\u0027t lost any Kerbals ... but admittedly I have only used them to explore the Mun and Minmus -- everything else has been probes. Tylo was definitely the most difficult, but I haven\u0027t had any mishaps except for one explosion on the launchpad due to a symmetry bug with Launch Stabilizers.\u003C/p\u003E\u003Cp\u003EHard Mode definitely gives a whole new level of tension to the game.\u003C/p\u003E\u003Cp\u003EOne word of caution, I do not recommend playing in Hard Mode without Claw\u0027s plugins that fix a few very serious, career-ending bugs:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/97285-0-25-Stock-Bug-Fix-Modules\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/97285-0-25-Stock-Bug-Fix-Modules\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-05T17:57:17Z\u0022 title=\u002211/05/2014 05:57  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 5, 2014\u003C/time\u003E by Caelib\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-11-05T18:32:34Z","Content":"\n\u003Cp\u003EMight give that construction time mod a go. Always seems a bit odd that I can instantly get a craft to the launchpad...\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2014-11-06T03:37:31Z","Content":"\n\u003Cp\u003EHard mode plus Kerbal Construction Time. KCT is adding a whole new time and budgetary role-playing component that\u0027s a welcome enhancement to the game.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2014-11-06T06:56:07Z","Content":"\n\u003Cp\u003EHeh, I seem to be somewhat different. I try Max out my science gainsby outsourcing R\u0026amp;D. I don\u0027t really like the science gain from parts so I try to get to Sandbox mode as soon as possible.\u003C/p\u003E\u003Cp\u003EOtoh, quite enjoy parts test contracts. I have an early plane and a late plane designed specifically for testing parts out.\u003C/p\u003E\n"},{"CreatedByName":"serolrom","CreatedById":127826,"CreatedDateTime":"2014-11-06T10:33:36Z","Content":"\n\u003Cp\u003EThis is the main reason why I enjoy to see what others achieve, but try not to learn \u0027how\u0027 they achieve.\u003C/p\u003E\u003Cp\u003EIt is inherent to all games/simulators I know that you want to learn as much as you can so you can do great things. Only to realize that once you master the thing, half of the fun is gone. At least sandboxes have the advantage that you can still challenge yourself in a number of ways. \u003C/p\u003E\u003Cp\u003EGlad to see by this post that the fun can be extended for a while with career modes. I\u0027m by now enough challenged, just trying to get Jebediah back from Mun in sandbox mode though...\u003C/p\u003E\n"},{"CreatedByName":"Bishop149","CreatedById":82368,"CreatedDateTime":"2014-11-06T11:41:11Z","Content":"\n\u003Cp\u003EMeh, IMO KSP is still too buggy for this kind of play.\u003C/p\u003E\u003Cp\u003EI\u0027ve had two completely random screw-ups in the last day or two\u003C/p\u003E\u003Cp\u003E1) Game decided to duplicate a 1/3 of the craft in exactly the same position on launch, clipping blew it apart instantly.\u003C/p\u003E\u003Cp\u003E2) All engines on a craft exploded for no reason.\u003C/p\u003E\u003Cp\u003ESuch things are annoying but don\u0027t ruin enjoyment if you can just revert / reload and start again. If I was playing \u0022hard\u0022 like this either of those would probably have bankrupted / ruined an early game.\u003C/p\u003E\u003Cp\u003EAlso I STILL quite regularly realise shortly after launch that I\u0027ve forgotten to put on something vital, batteries, solar panels, parachutes, ladders. . . . that kind of thing.\u003C/p\u003E\u003Cp\u003EI\u0027m sticking with reverts and saves thanks\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-11-06T11:56:13Z","Content":"\n\u003Cp\u003ESpaceplanes only. I don\u0027t think I\u0027ve launched a single rocket these past few months.\u003C/p\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2014-11-06T12:52:18Z","Content":"\n\u003Cp\u003EHmm, I don\u0027t know if other people would find this interesting, but I\u0027m finding it quite rewarding: I go for reuseable launchers with limited payloads. I have a satellite launch program, and the satellites can be upgraded and de-orbited by orbital tugs. My interplanetary spacecraft are all non-nuclear for this savegame, so with the reusabilty factored in, I\u0027m pretty green.\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-11-06T19:10:07Z","Content":"\n\u003Cp\u003EI\u0027ve been experimenting with custom difficulty to see how hard I can go and still play a successful stock career. The aim here is to make the game challenging without going too far and turning it into a boring resource grind.\u003C/p\u003E\u003Cp\u003ESetting resource gains to 20% made me re-learn how to play KSP. Efficient rocket designs and careful mission planning are essential. You have to think carefully about which contracts to accept, bearing in mind the potential costs versus rewards. Part unlock costs can be crippling, making strategic use of experimental parts very attractive. Limited money makes recovery and reusability very important. Verdict: An enjoyable challenge! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt 10% resource gains, the game is just barely playable. You make very little science and money per mission, making game progression very slow indeed. The pre-set game progression contracts don\u0027t pay enough to cover the cost of game progression, so you have to make up the difference by grinding lots of part test contracts between missions, which soon starts to get boring. Verdict: Challenging but grindy. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SorryDave","CreatedById":119474,"CreatedDateTime":"2014-11-06T22:17:22Z","Content":"\n\u003Cp\u003EI like maxing out the tech tree before going into orbit, and then collecting science for funds using re-usable rockets.\u003C/p\u003E\u003Cp\u003EI am currently making a fleet of re-usable rockets for missions that never return to Kerbin and some that do.\u003C/p\u003E\u003Cp\u003EI play as if on hard, but with quick load on and initial funds set to zero. The only mods I use are Engineer and alarm clock.\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-11-06T22:26:35Z","Content":"\n\u003Cp\u003ELots of design inspirations from the forum here, but otherwise I\u0027ve kinda capped out on career when it was first introduced. I don\u0027t really get inspired by gatekeeper modes when I\u0027ve already experienced the end-game (sandbox).\u003C/p\u003E\u003Cp\u003EI\u0027d like to \u0022wander\u0022 more, like just fly off in a random direction to see what a planet has to offer, but there\u0027s nothing out there right now. Game needs wildlife, geography, research content, \u003Cem\u003Esome\u003C/em\u003Ething.\u003C/p\u003E\n"},{"CreatedByName":"serolrom","CreatedById":127826,"CreatedDateTime":"2014-11-07T12:05:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Franklin\u0022 data-cite=\u0022Franklin\u0022\u003E\u003Cdiv\u003ELots of design inspirations from the forum here, but otherwise I\u0027ve kinda capped out on career when it was first introduced. I don\u0027t really get inspired by gatekeeper modes when I\u0027ve already experienced the end-game (sandbox).\u003Cp\u003EI\u0027d like to \u0022wander\u0022 more, like just fly off in a random direction to see what a planet has to offer, but there\u0027s nothing out there right now. Game needs wildlife, geography, research content, \u003Cem\u003Esome\u003C/em\u003Ething.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is interesting. \u003C/p\u003E\u003Cp\u003ESquad, as I have read lately, will dedicate some of the effort on creating content. It might somehow change the aim of the game. I know Squad explicitly refers to KSP as a game first, and a simulator second, but so far, the most developed side is the simulation. What they probably mean is that the depth of the simulation has found the limit, and the next things we see will be more content related.\u003C/p\u003E\u003Cp\u003EThat said, what I like of KSP is the simulation side. You can very well argue if this is a simlulator or not (depends on how much level of detail you call it simulation), but hey, there are orbits and celestial bodies. There *is* simulation to some degree. \u003C/p\u003E\u003Cp\u003EContent (wether alien life forms, geography, etc), while interesting, is for me a secondary thing.\u003C/p\u003E\n"}]}