{"TopicId":89483,"ForumId":32,"TopicTitle":"My first actually successful spaceplane","CreatedByName":"lordmuffin","CreatedById":127240,"CreatedDateTime":"2014-11-05T13:13:10Z","PageNum":1,"Articles":[{"CreatedByName":"lordmuffin","CreatedById":127240,"CreatedDateTime":"2014-11-05T13:13:10Z","Content":"\n\u003Cp\u003EIt only flew for 19 seconds, but hey, it flew!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OUhGhhX.jpg\u0022 alt=\u0022OUhGhhX.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is my first plane ever to get off the ground. Finally learnt that you need those control surfaces.\u003C/p\u003E\u003Cp\u003EIt is kind of unstable, but it flies!\u003C/p\u003E\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2014-11-05T13:37:46Z","Content":"\n\u003Cp\u003ENot bad. In my opinion getting into the air is the hardest part. Why did it crash after 19 seconds? \u003C/p\u003E\u003Cp\u003EAnd as always, if you don\u0027t know where the problem is ask YouTube \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-05T13:37:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lordmuffin\u0022 data-cite=\u0022lordmuffin\u0022\u003E\u003Cdiv\u003EIt only flew for 19 seconds, but hey, it flew!\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/OUhGhhX.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/OUhGhhX.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is my first plane ever to get off the ground. Finally learnt that you need those control surfaces.\u003C/p\u003E\u003Cp\u003EIt is kind of unstable, but it flies!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECongrats!\u003C/p\u003E\u003Cp\u003EDid you want suggestions or were you just sharing your accomplishment?\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2014-11-05T13:43:30Z","Content":"\n\u003Cp\u003EPretty cool! It looks like that jet plane the Germans built in WWII (forgot the name) Fitting if it is your first successful plane \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2014-11-05T14:11:30Z","Content":"\n\u003Cp\u003EGood job!\u003C/p\u003E\u003Cp\u003EIf you want some advice, you want to keep your center of lift as close to your center of gravity, and if it looks like a flying industrial plant and you want to move the wings rather backwards than forward. And remember: \u0022Moar boosterz doesn\u0027t always work. Moar wingz does.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Secuas","CreatedById":126000,"CreatedDateTime":"2014-11-05T14:24:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmpsterMan\u0022 data-cite=\u0022AmpsterMan\u0022\u003E\u003Cdiv\u003EPretty cool! It looks like that jet plane the Germans built in WWII (forgot the name) Fitting if it is your first successful plane \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou mean this one? \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/0/0e/Messerschmitt_Me_262A_at_the_National_Museum_of_the_USAF.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/0/0e/Messerschmitt_Me_262A_at_the_National_Museum_of_the_USAF.jpg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-11-05T14:32:38Z","Content":"\n\u003Cp\u003E\u0022Spaceplane\u0022 \u002B flied only 19 seconds = in orbit in 19 seconds? Wow. It usually takes me at least 5 minutes. But keep experimenting, SSTO spaceplanes are the most rewarding thing in the game.\u003C/p\u003E\n"},{"CreatedByName":"lordmuffin","CreatedById":127240,"CreatedDateTime":"2014-11-05T14:47:05Z","Content":"\n\u003Cp\u003ESorry, not spaceplane, its just a plane. I think there\u0027s a difference.\u003C/p\u003E\u003Cp\u003EIt crashed into the water after 19 seconds because it was a bit unstable. I think the main cause is because it doesnt have the back control surface, plus it goes kinda fast.\u003C/p\u003E\n"},{"CreatedByName":"lordmuffin","CreatedById":127240,"CreatedDateTime":"2014-11-05T14:48:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003ECongrats!\u003Cp\u003EDid you want suggestions or were you just sharing your accomplishment?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA bit of both.\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-11-05T15:41:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lordmuffin\u0022 data-cite=\u0022lordmuffin\u0022\u003E\u003Cdiv\u003EA bit of both.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1) Have enough lift, you can liftoff even without it with enough power but you probably won\u0027t land.\u003C/p\u003E\u003Cp\u003E2) Fully fueled plane: CoL as close to CoM as possible but \u003Cem\u003Enever \u003C/em\u003Ein front of it.\u003C/p\u003E\u003Cp\u003E3) Fully drained plane: CoL as close to CoM as possible but \u003Cem\u003Enever \u003C/em\u003Ein front of it.\u003C/p\u003E\u003Cp\u003E4) If you want to orbit then pack more intakes (airhog). Detachable fuel tanks or boosters make everything much easier although your plane won\u0027t be a SSTO.\u003C/p\u003E\u003Cp\u003EThe further the CoL behind the CoM is the more stable but less maneuverable your plane is.\u003C/p\u003E\u003Cp\u003EAs for suggestions: \u003C/p\u003E\u003Cp\u003E1) Tilted wheels usually behave strangely for me.\u003C/p\u003E\u003Cp\u003E2) I\u0027m not sure those intakes are efficient, especially for such a lightweight design. There\u0027s a reason they\u0027re hardly ever seen here.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-05T15:47:21Z\u0022 title=\u002211/05/2014 03:47  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 5, 2014\u003C/time\u003E by theend3r\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-05T15:42:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lordmuffin\u0022 data-cite=\u0022lordmuffin\u0022\u003E\u003Cdiv\u003EA bit of both.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, well then my suggestion for a plane this size is to choose smaller wings. Those big B9 wings are meant for massive planes (pun intended). The stock wings have less mass making them a bit more suitable for a small 1.25m plane. You really only need a single engine for this design. It\u0027s so small, a turbojet should get you to orbit and using only one air breather will eliminate complications from flameout. \u003C/p\u003E\u003Cp\u003E For the best suggestions you need to post an image of the side of the plane with CoM and CoL showing. \u003C/p\u003E\u003Cp\u003EIt is hard to tell but it looks like you have 2 control surfaces that are sitting around where I would expect CoM. Those would be good for roll but not for pitch. You need to right click the surface and choose it\u0027s function, best not have it do all 3. Roll (aileron) should be at center of mass, pitch should be far behind (elevator) or in front (canard) of it. Elevons are a combination of roll and pitch, typically seen on fighter jets, they need to be in about the same position as the elevator would be, not the roll which is what I think you have here. Yaw control is optional, flight does not require a rudder, but it can help control the nose while banking.\u003C/p\u003E\u003Cp\u003EFeel free to browse the catalog of planes in my signature, there are several designs of planes this size that should give you some ideas of how it works. They are, however, designed for NEAR/FAR (mostly the difference is a matter of wing position to balance the CoM/CoL)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-05T15:50:01Z\u0022 title=\u002211/05/2014 03:50  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 5, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Meecrob","CreatedById":104543,"CreatedDateTime":"2014-11-05T23:23:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E Yaw control is optional, flight does not require a rudder, but it can help control the nose while banking.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou \u003Cem\u003Ecan\u003C/em\u003E get away without using a rudder, but the OP seems to be new to spaceplanes and planes in general, and with keyboard controls being what they are, I think his turns at first will be yawing for fine heading changes and roll\u002Bpitch for large changes. It\u0027s a pattern I\u0027ve noticed with people new to flight sims combined with keyboard control. There seems to be a tendency to stay wings level if possible.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-06T03:38:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Meecrob\u0022 data-cite=\u0022Meecrob\u0022\u003E\u003Cdiv\u003EYou \u003Cem\u003Ecan\u003C/em\u003E get away without using a rudder, but the OP seems to be new to spaceplanes and planes in general, and with keyboard controls being what they are, I think his turns at first will be yawing for fine heading changes and roll\u002Bpitch for large changes. It\u0027s a pattern I\u0027ve noticed with people new to flight sims combined with keyboard control. There seems to be a tendency to stay wings level if possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat it exactly why beginners SHOULD NOT design with rudders. Bad practices are bad practices. Learn it right the first time.\u003C/p\u003E\u003Cp\u003EOP: I don\u0027t know your skill level so I\u0027m going to explain it all, forgive me if you know some of this. When a plane wants to turn it doesn\u0027t do so like a car... side to side (i.e. yaw). Instead instead the pilot will roll in the direction he wants to go and pull back on the stick (pitch up). This causes the plane to turn, but unless you roll all the way so that the artificial horizon is vertical (which isn\u0027t a good thing) then your plane is going to pitch up as well in this process. A rudder\u0027s purpose is to allow the pilot to push the nose back down and keep it on the horizon while doing this turning maneuver, so you can turn without gaining altitude. The other option is to turn a little, level off, go back down, rinse repeat. This is why rudders are optional, but they do come in handy.\u003C/p\u003E\u003Cp\u003EFine adjustments are done simply by rolling and letting the wind push you around a little. This technique is useful for maintaining inclination while ascending an SSTO.\u003C/p\u003E\u003Cp\u003EThe rudder in the real world can be used to turn... slowly. But in KSP that\u0027s difficult if not impossible to do it properly due to the digital nature of the keyboard. If you have a flight stick or some other analog control, you might be able to pull it off, but for the most part I recommend using ailerons.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-06T04:39:44Z\u0022 title=\u002211/06/2014 04:39  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 6, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Meecrob","CreatedById":104543,"CreatedDateTime":"2014-11-06T23:05:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EThat it exactly why beginners SHOULD NOT design with rudders. Bad practices are bad practices. Learn it right the first time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with you 100% that it is a bad practice. I do think beginners should include rudders though. It is notoriously easy to tell flight training students who play flight sims apart from ones who don\u0027t - ones who play flight sims have pitch and roll down pat before sitting in the plane but have zero yaw skills. The lack of use of a rudder is a bad practice also. I think I\u0027m more stuck in the train of thought that a keyboard controlling a plane is crap no matter what and bad practices will be developed no matter what. Especially without an \u0022instructor\u0022 to beat it out of them like in real flight training. \u003C/p\u003E\u003Cp\u003EBack to my original post though, I\u0027ll be the first to admit what I said is \u003Cem\u003ENOT\u003C/em\u003E the proper way to fly. In real life, a sim, anywhere. I also admit that I made an assumption of the op\u0027s intentions. \u003C/p\u003E\u003Cp\u003ESo OP! do you want to learn the proper way to fly because flight is what interests you or do you want to design a vehicle to get you to a destination without having to worry about the finer points of flying and realism be damned?\u003C/p\u003E\n"}]}